{
  "title": "Is it possible to trace data without adding a break point?",
  "link": "https://reverseengineering.stackexchange.com/questions/10655/is-it-possible-to-trace-data-without-adding-a-break-point",
  "content": "I'm using IDA Pro and trying to analyze a parameter passed to a function call. Problem is, when i add a breakpoint on function address to see what values are being passed , the application crashes. Is there a way to monitor what parameters passed other than setting a breakpoint ?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "753",
  "tags": [
    "ida",
    "call"
  ],
  "user": "AcarX",
  "time": "Dec 16, 2015 at 17:07",
  "comments": [],
  "answers_data": [
    {
      "content": "Assuming you're using a software breakpoint (int 3), you have a few alternative options:\n\nEdit:\n\nBased on your comment below, it looks like you're looking to log/hook imported API functions, in which case IAT hooking and EAT hooking are also options.\n\nHowever, the easiest solution will likely be using an existing tool like API Monitor which allows you to easily log function parameters and choose the type of breakpoint you want to use.\n\n",
      "votes": "1",
      "user": "Jason Geffner",
      "time": "Aug 19, 2015 at 14:59",
      "is_accepted": true,
      "comments": [
        {
          "user": "AcarX",
          "text": "Thanks for the detailed answer. I'm kind of new to this stuff so i'm not really sure which alternative suits me the best. But i'm interested at third option. As far as i understood, as it starts, application imports the function i'm interested at from the dll(advapi32.dll). With third option, would i be able to output(for example with a message box) the parameter ?",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "I've updated my answer above.",
          "time": null
        },
        {
          "user": "AcarX",
          "text": "Sadly, application detects API Monitor. I'm looking into IAT/EAT hooking.",
          "time": null
        }
      ]
    }
  ]
}