{
  "title": "Reverse Engineer Joomla fabrik calculator",
  "link": "https://reverseengineering.stackexchange.com/questions/10775/reverse-engineer-joomla-fabrik-calculator",
  "content": "I am wondering if it is possible to reverse engineer the calculator on this url:\n\nhttp://www.contrelec.co.uk/index.php/en/motor-full-load-current-estimator-kw\n\nIt appears to be a Joomla site with the Fabrik plugin driving the calculator. Some research suggests Fabrik uses Ajax, a language I know little about other than it is client-side calculation, so the source should be accessible(?)\n\nGlad of anyone's help.\n\n",
  "votes": "0",
  "answers": 1,
  "views": "202",
  "tags": [
    "javascript",
    "websites"
  ],
  "user": "Bill Peet",
  "time": "Sep 2, 2015 at 2:39",
  "comments": [
    {
      "user": "user262170",
      "text": "Why don't you just ask the owner for the script (i.e. me)?",
      "time": null
    },
    {
      "user": "Jongware",
      "text": "Hi, and welcome to Reverse Engineering! Unfortunately, RE is not a forum, and the \"Answer\" box is for answers only. This could have a comment; once you have a bit of reputation, you can comment on posts. If you want to edit this into a proper answer, you can do so; else, it will probably get flagged for deletion.",
      "time": null
    },
    {
      "user": "Bill Peet",
      "text": "@user262170 are you serious? Apparently no provision for private messages on stackexchange: meta.stackexchange.com/questions/431/…",
      "time": null
    },
    {
      "user": "Bill Peet",
      "text": "@user262170 however I'd love to get my hands on it :)",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The algorithm is on the server-side (and executed via an HTTP POST to http://www.contrelec.co.uk/index.php/en/motor-full-load-current-estimator-kw), so you won't be able to directly extract the algorithm by just looking at the client-side HTML, JavaScript, etc.\n\nHowever, since there are only 3 input variables, it shouldn't be too difficult to write a program to submit many values, extract the output, and then extrapolate the formula by graphing the results.\n\n",
      "votes": "0",
      "user": "Jason Geffner",
      "time": "Sep 2, 2015 at 13:25",
      "is_accepted": true,
      "comments": [
        {
          "user": "Bill Peet",
          "text": "Thanks a lot @Jason, any pointers as to how to substitute values in programmatically?",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "That would be a question for stackoverflow.com",
          "time": null
        }
      ]
    }
  ]
}