{
  "title": "Android ARM64 kernel disassembly IDA pro64",
  "link": "https://reverseengineering.stackexchange.com/questions/10792/android-arm64-kernel-disassembly-ida-pro64",
  "content": "I extracted Samsung Galaxy S6 kernel image from its stock boot.img. The result is a raw code kernel image. I load into IDA 6.8 (64-bit) using ROM Start: 0xffffffc000205000 size:0x18C020000, load address:0xffffffc000205000 size:0x18C020000 which is the address of _text/_stext inside it's kallsyms, it does not disassemble correctly and recognise nearly everything as data. On the other hand, using the _text/stext function for a 32-bit ARM Note 4 kernel image at 0xC0008000 works perfectly. Does any one have any idea how to disassemble ARM64 android image correctly? Any advice is appreciated. Thanks.\n\n",
  "votes": "1",
  "answers": 2,
  "views": "3k",
  "tags": [
    "arm",
    "android"
  ],
  "user": "gigasai",
  "time": "Sep 4, 2015 at 6:39",
  "comments": [],
  "answers_data": [
    {
      "content": "It may be a mix of 64 and 32 bit code, to disassemble the 32bit segments, change the segment bitness to 32  ( via Alt-S )\n\nthen you can disassemble those sections as either arm32, or thumb code.\n\nA problem will arise when you want to be able to decompile both the 32 and 64 bit code.\nIDA will only be able to decompile the 64 bit code.\n\n",
      "votes": "1",
      "user": "Willem Hengeveld",
      "time": "Jun 22, 2016 at 21:31",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I needed to set the segment bitness to 64-bit. It then disassembled correctly.\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Jul 23, 2016 at 13:04",
      "is_accepted": false,
      "comments": [
        {
          "user": "perror",
          "text": "This does not provide an answer to the question. To critique or request clarification from an author, leave a comment below their post - you can always comment on your own posts, and once you have sufficient reputation you will be able to comment on any post.",
          "time": null
        },
        {
          "user": "gigasai",
          "text": "Hi, @perror, he answered me on IDA forums :)",
          "time": null
        }
      ]
    }
  ]
}