{
  "title": "GUI apps uses registry,how?",
  "link": "https://reverseengineering.stackexchange.com/questions/10894/gui-apps-uses-registry-how",
  "content": "I have a GUI app that seems to use registry.\nSo I wanna know if I can capture that function that access registry and check if it's activated because this app doesn't use windows directory, it's just a click and a GUI pops pup.\n\nIs it possible to identify how the app uses registry, how?\n\n",
  "votes": "0",
  "answers": 2,
  "views": "529",
  "tags": [
    "executable",
    "register"
  ],
  "user": "Alex",
  "time": "Sep 18, 2015 at 7:58",
  "comments": [],
  "answers_data": [
    {
      "content": "You can try to dissect your executable in IDA Pro and find functions like these: RegOpenKeyEx, RegSetValueEx, RegGetValue, RegQueryValueExW, RegCloseKey, RegOpenCurrentUser (they are part of advapi32.dll).\n\nIf you prefer to analyse the registry activity of your app dynamically then use regshot. It's very easy to use it - just make first shot of the registry before you launch your app and then second shot (after say 3-5 minutes) and then press compare-button. regshot will make a report about registry keys/values that have been opened, added, deleted.\n\n",
      "votes": "1",
      "user": "0xDEADC0DE",
      "time": "Sep 18, 2015 at 9:20",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "To see which registry keys your applications accesses while running, use Procmon. If you want to monitor more DLL calls than mere registry accesses, i recommend API Monitor.\n\n",
      "votes": "2",
      "user": "Guntram Blohm",
      "time": "Sep 18, 2015 at 11:21",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jason Geffner",
          "text": "Furthermore, both of those tools allow you to examine the call-stack for any captured log entry. That will help you find the function in your program that solicited the registry lookup.",
          "time": null
        }
      ]
    }
  ]
}