{
  "title": "Finding the library an imported function is from in IDA",
  "link": "https://reverseengineering.stackexchange.com/questions/10940/finding-the-library-an-imported-function-is-from-in-ida",
  "content": "I'm fairly new to reversing, and I have even less experience with IDA Pro. I am wondering if there is a way to figure out from where an imported function is imported, i.e. a memory location I can find with ldd or even better a .so name.\n\n",
  "votes": "3",
  "answers": 2,
  "views": "4k",
  "tags": [
    "ida",
    "elf",
    "shared-object"
  ],
  "user": "kage x",
  "time": "Sep 23, 2015 at 22:43",
  "comments": [],
  "answers_data": [
    {
      "content": "When I had the same problem (I was working on ELF binaries from Linux and QNX systems) I had to do the following:\n\nIf you don't have an ability to use shell on your system, you can automate getting list of exports using IDAPython ( idautils.Entries() ) and -S ida command line option.\n\nIf the library is loaded dynamically (by using dlopen/dlsym for example) you'll have to find corresponding dlopen call and find out its arguments.\n\n",
      "votes": "5",
      "user": "w s",
      "time": "Sep 24, 2015 at 9:40",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Created this plugin recently, you can use https://github.com/0xMirasio/AutoResolv. This is an IDA plugins for resolving imports and show the library origin. You can also refactor code by importing function signature from the libs.\n\n",
      "votes": "1",
      "user": "Thibault Poncetta",
      "time": "Sep 20, 2022 at 12:05",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "Welcome to RE.SE. It is customary to disclose one's affiliation with a recommendation. In this case you seem to be the owner of the repo, right? Note: there's nothing wrong with promoting a solution you created, but it's good style to say that you are the one who made it when you are promoting it (also holds for noncommercial offerings like yours). Thanks.",
          "time": null
        },
        {
          "user": "Thibault Poncetta",
          "text": "Ok , going to edit",
          "time": null
        }
      ]
    }
  ]
}