{
  "title": "Why do we have to put shellcode before return address [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/10972/why-do-we-have-to-put-shellcode-before-return-address",
  "content": "I'd like to know why we have to put the shellcode before the return address in a buffer overflow. Logically the return address will point to the shellcode and will be executed. So, the return address should be put before the shellcode. \n\nI read about it here : buffer overflow exploits - Why is the shellcode put before the return address. \n\nBut, I didn't really understand. Can someone explain me.\n\n",
  "votes": "-1",
  "answers": 2,
  "views": "768",
  "tags": [
    "shellcode"
  ],
  "user": "Scoobydoo",
  "time": "9 years ago",
  "comments": [
    {
      "user": "Scoobydoo",
      "text": "But I don't understand the answers over there, could you explain me please?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can put your shellcode wherever you want. It's usually below the return address in textbook stack overflow, because it causes your total payload to be smaller.\n\nSmall illustration: you're overflowing a 256 bytes buffer on the stack. Your payload would look like this in classical overflow:\n\nNOP * (256 - len(shellcode)) + shellcode + padding + returnaddress\n\nIf you put the payload after:\n\npadding * 256 + padding + returnaddress + nop * (as much as needed) + shellcode.\n\nPro: you can sometimes add much more space for your nops or bigger shellcode. If you're doing ROP you'll need to use that space after the return address anyway.\n\nCons: your payload is bigger and may not fit in your buffer.\n\n",
      "votes": "1",
      "user": "Aris",
      "time": "Sep 28, 2015 at 9:32",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "The shellcode does not need to be before the return address in a buffer overflow.\n\nSee, for example, this advisory and the corresponding slide deck.\n\n",
      "votes": "0",
      "user": "Jason Geffner",
      "time": "Sep 26, 2015 at 20:06",
      "is_accepted": false,
      "comments": [
        {
          "user": "Scoobydoo",
          "text": "Thank you for your answer but can you explain me exactly what happens when we put the shellcode before the return address and what happens when we put it after the return address? Thank you for your help",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "That's not a reverse engineering question. Please ask on security.stackexchange.com or stackoverflow.com.",
          "time": null
        }
      ]
    }
  ]
}