{
  "title": "How can I turn .deb files back to .tar for reuse with other Linux distros? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/109/how-can-i-turn-deb-files-back-to-tar-for-reuse-with-other-linux-distros",
  "content": "We all know that Ubuntu is the most popular Linux distro today with plenty of application currently being developed for it. But then I use Fedora and some use other distros but still liked to have the same program from Ubuntu in their systems.\n\nSo how can I convert .deb files back to .tar so it can be recompiled for other distros?\n\n",
  "votes": "-9",
  "answers": 1,
  "views": "1k",
  "tags": [
    "decompilation",
    "linux",
    "development"
  ],
  "user": "forums",
  "time": "12 years ago",
  "comments": [
    {
      "user": "Archenoth",
      "text": "This really doesn't have anything to do with Reverse Engineering. Perhaps Super User would be the place you are looking for?  Also, so I'm at least being a helpful, a little converter called Alien may be relevant to your interests if you are looking to convert .deb files. Or you can just extract them with \"ar\".",
      "time": null
    },
    {
      "user": "Gilles 'SO- stop being evil'",
      "text": "@Archenoth (and others) If you think the question is off-topic (I agree, by the way), please vote to close it! Click on the “close” button below the question, select “off-topic”, and “Vote to Close”. It's very important, especially during the private beta, that we indicate what we consider on-topic and off-topic.",
      "time": null
    },
    {
      "user": "jlcanovas",
      "text": "This question is out of the scope of this website. As @Archenoth has previously noted. Clicking \"close\" button...",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I doubt this is an RE question. deb is a known format.\n\nAlso deb is a .ar it just has a specific internal structure you can decompress it with ar. or use undeb if you want to be fancy.\n\nHere is a howto for deb and rpm just for reference\n\nAlso note that deb is usually a binary format and you can't really convert it to source.. unless of course it is a source deb! Any installation you do should probably be done into /opt and add the appropriate directories to your path so you don't pollute your installation with untracked binaries.\n\n",
      "votes": "4",
      "user": "cb88",
      "time": "Mar 21, 2013 at 4:26",
      "is_accepted": false,
      "comments": []
    }
  ]
}