{
  "title": "Any guides for absolute newbie to start? [duplicate]",
  "link": "https://reverseengineering.stackexchange.com/questions/11018/any-guides-for-absolute-newbie-to-start",
  "content": "Good morning/day/evening/night. I would like to know is it possible for absolute newbie which generally gifted with no talents and skills and generally sucks in everything he does(like myself) to learn reverse engineering? If it's rocket science or close to that and I have no hopes in learning it il understand... But i feel like I've gotta try. I do not expect to do amazing stuff right away or anything, just basic stuff for you know, everyday uses. \n\nMy knowledge when it comes to computers, I understand its not much and im  pretty much braindead but who knows, maybe any of that is useful:\n\nSo is there a guide towards reverse engineering for a guy like me? Also, just in case for those who wondering why i decided to learn it..well, I had vacation in my home village in summer, decided to move some games i had from my pc to laptop. so yeah and you know what? when i arrived there noticed all but one game werent working and trying to connect to steam! I was like..\"alright steam, you ruined my childhood, but now you screwed up my vacation, thats it!\". Well, still had great time away from computer, you know, taking care of turkeys and goats, collecting vegetables, went to forest for some berries, mushrooms etc,didn't even noticed how fast vacation ended.\n\nWhoops, apparently went a bit off-topic, sorry about that guys. Well as i said if anyone got any helpful links of how to learn it, I'd be grateful, also english is my 3rd language so sorry if i made some mistakes or something, thank you for your patience.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "242",
  "tags": [
    "disassembly",
    "debugging"
  ],
  "user": "New",
  "time": "9 years ago",
  "comments": [
    {
      "user": "Nolo",
      "text": "If you know a little bit of javascript then your most productive route might be to start by asking questions about how to compile, disassemble and view the result of javascript code.  Then you can write simple programs and see the resulting disassembly.  It may be necessary to use a c++ compiler to build a javascript engine (such as webkit) from source code in order to do so.  I have never done it and I know next to nothing about assembly language, but the examples that I have seen were informative none-the-less.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You should start with learning to understand assembly (x86) ,next try learning using a debugger(start with ollydbg).\n\nGood resources are opensecuritytraining classes (you will get all the training videos the path you have to follow etc all for free) for learning to use ollydbg a good resource is lenas tutorials...\n\nYou can use two approaches :\n\n1>Learn on the fly approach :Start directly with the tutorials and if you get stuck google it understand and then continue.You will have to dive deeper and deeper if you follow this approach i.e. if one gets stuck on CSS he googles and finds :CSS is a stylesheet language that describes the presentation of an HTML (or XML) document ,then you should google XML also if you dont know xml...\n\n2>Warm up approach:Read the architecture and internals of the system you want to reverse,learn C ,write a few programs,learn asm,use a debugger ,debug your programs,then move on to the tutorials mentioned above...\n\nAnd lastly have patience this takes time and never let the curiosity to die...\n\n",
      "votes": "0",
      "user": "rebel87",
      "time": "Oct 5, 2015 at 6:46",
      "is_accepted": false,
      "comments": []
    }
  ]
}