{
  "title": "Firmware data in an audio file FM - How to demodulate?",
  "link": "https://reverseengineering.stackexchange.com/questions/11026/firmware-data-in-an-audio-file-fm-how-to-demodulate",
  "content": "I'd like to have a peek at the firmware of a piece of Hardware. Its firmware is available as a .wav file to be uploaded via audio jack.\n\nhttps://drive.google.com/open?id=0B6S_PcWWM1YlQnNwT2FSMnFzVE0\n\nAnd it sure looks like straight forward frequency modulation. I think I can even make out a pattern: useful signal (8 waves, then 4 recurring waves as separator) and once in a while (didnt count the \"bytes\" inbetween) 0.5ms of unmodulated signal as a newline marker maybe?\n\n\n\nIs there a software available to decode this? Or a name for me to start reading?\nGot matlab ...\n\n",
  "votes": "1",
  "answers": 2,
  "views": "1k",
  "tags": [
    "firmware"
  ],
  "user": "baltersice",
  "time": "Oct 5, 2015 at 10:00",
  "comments": [
    {
      "user": "Dmitry Janushkevich",
      "text": "Can you provide the name of the product?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Software defined radio tools could be used for this. GNUradio has a simple block based user interface thats good for experimenting with different demodulation techniques. It will allow you to build patches for the demodulation and get playback from files.\n\nFinding out what the modulation is might be a harder thing to do though. For this you could look at the signal in the frequency domain with graphical tools like baudline or some GNUradio modules. Learning to recognize modulations from their frequency domain representations is something that is best learned by experience. Wikipedia and HAM radio sites are a good source for information on different modulation techniques.\n\nOne good place for starting out on recognizing modulations is the sigidwiki.\n\nThe signal might also be digital. In that case you could check out logic analyzer software like sigrok.\n\n",
      "votes": "3",
      "user": "Juha Kivekäs",
      "time": "Oct 30, 2015 at 6:13",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "MATALB. It is very easy to demodulate it, see here for step-by-step instructions: http://www.mathworks.com/help/comm/ref/fmmod.html\n\n",
      "votes": "0",
      "user": "student1",
      "time": "Nov 2, 2015 at 14:03",
      "is_accepted": false,
      "comments": []
    }
  ]
}