{
  "title": "What is the meaning of the \".debugxxx\" segments in IDA Debugger?",
  "link": "https://reverseengineering.stackexchange.com/questions/11103/what-is-the-meaning-of-the-debugxxx-segments-in-ida-debugger",
  "content": "When I debug an application inside the IDA Debugger, sometimes I get referenced to a .debugxxx segment.\n\nWhat are those segment ?\nHeap allocations ?\n\nIf so, why are they called .debug ?\n\nAlso, even if I stop the debugger at the entrypoint of my application, there are already 3 or 4 .debug segments, at the beginning and at the end of the address space.\n\nWhat type of data do they contain ?\n\nI'm sorry for this post, but I could not find any concrete information anywhere else.\nIt has already been asked here, but I don't find that the replies were anwsering the question in the title.\n\nThanks !\n\n",
  "votes": "8",
  "answers": 1,
  "views": "970",
  "tags": [
    "ida",
    "segmentation"
  ],
  "user": "David229",
  "time": "Oct 14, 2015 at 8:12",
  "comments": [],
  "answers_data": [
    {
      "content": "Generally, these are allocated regions within a debugged process. Some are heap related, some are internal to the OS's implementation, some can be pages allocated by another process that interacts with yours. \nThey are there because IDA needs to provide you with an interface to view memory as it's actually laid-out in memory, just like any other debugger. \n\nIntegrating them with IDA's built-in segments facilities makes it easier to work with other components and third party plugins. \n\nThey are dubbed .debug??? because these segments are part of the executable's debug environment. The numbers are just sequential and have no real meaning. \n\nP.S.\nA hint about those: IDA doesn't maintain them constantly updated, and you might sometime require IDA to rescan the memory of the debugged process to make sure your viewing the most recent memory snapshot. At least  that was the case around IDA 6.6, it might have changed. \n\n",
      "votes": "7",
      "user": "NirIzr",
      "time": "Jan 9, 2017 at 8:27",
      "is_accepted": true,
      "comments": []
    }
  ]
}