{
  "title": "Ollydbg terminated while loading dll",
  "link": "https://reverseengineering.stackexchange.com/questions/11158/ollydbg-terminated-while-loading-dll",
  "content": "When I try to load a DLL of a game client I get this error:\n\nHow can I completely load this dll?\n\n\n\n",
  "votes": "5",
  "answers": 2,
  "views": "2k",
  "tags": [
    "ollydbg"
  ],
  "user": "Ranastic",
  "time": "Nov 22, 2016 at 5:32",
  "comments": [
    {
      "user": "Guntram Blohm",
      "text": "This can really be anything. My guess would be the game client opens a window before loading the DLL, and the DLL has a startup routine that finds the window, tries to do something with it, fails, and exits.",
      "time": null
    },
    {
      "user": "Ranastic",
      "text": "That picture I try with 4.9 version, but with 4.8 version I did same way can pass this step normally :(",
      "time": null
    },
    {
      "user": "mrexodia",
      "text": "With x64dbg you can debug the original application that loads the DLL and set a DLL breakpoint so you can examine what happens while this DLL is loading.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "From the picture i don't see it's terminated it is only \"Running\" which could be a lot of things. For example the Dll might be waiting for a specific dll to be loaded or a specific window name. \n\nTry to use the option \"AdvEnumModule\" in StrongOD plugin and see if that helps making your DLL pause at EP. Or you could also try to change the PE Header of your dll by unchecking \"File is a DLL\" flag using CFF Explorer go to File Header > Characteristics.\n\n",
      "votes": "1",
      "user": "RCECoder",
      "time": "Oct 26, 2015 at 10:12",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "As said by Guntram Blohm this can be anything ! try to post a scan of the DLL in order to see if its packed or crypted. what RDG reported to you ? in addition you can also guess that oldbg cannot \"execute\" a dll. One approach is to load the main EXE that calls the concerned DLL, once done try to disassemble your \"game.dll\" from Executable module window (ALT+E).\n\nIn this example I loaded main exe file (hidden with black) and can double click on loaded dll (hidden in red) in order to load it into olly.\n\n\n\n",
      "votes": "1",
      "user": "Soufiane Tahiri",
      "time": "Oct 28, 2015 at 10:24",
      "is_accepted": false,
      "comments": [
        {
          "user": "Abr001am",
          "text": "he said \"load\" not \"execute\"",
          "time": null
        },
        {
          "user": "Soufiane Tahiri",
          "text": "Really -_- ... did you even read the answer ? [.... in order to load it into olly.....]  @Abra001",
          "time": null
        }
      ]
    }
  ]
}