{
  "title": "Should these numbers be interpreted as flags or not, or something else?",
  "link": "https://reverseengineering.stackexchange.com/questions/11160/should-these-numbers-be-interpreted-as-flags-or-not-or-something-else",
  "content": "I am reverse engineering the VAG format, which is a sound file format for the PSX (PlayStation 1). In the format, audio markers indicating audio looping points are encoded in the stream itself by a block attribute.\n\nDefinition of possible attributes from a header found on the official SDK:\n\n```\n/* block_attribute */\n#define ENC_VAG_1_SHOT      0\n#define ENC_VAG_1_SHOT_END  1\n#define ENC_VAG_LOOP_START  2\n#define ENC_VAG_LOOP_BODY   3\n#define ENC_VAG_LOOP_END    4\n\n```\nHere is an excerpt of what flags/numbers are found when printing their content:\n\nFor a 1 shot (no looping) sample:\n004000000000000000000000000000000000000000000000000000000000000000000001\n\nFor a looping sample:\n026222222222222222222222222222222222222222222222222222222222222222222223\n\nAs you can see, in both examples it is pretty easy to visually spot where are start/stop flags, whether for a 1 shot sample or a looping sample (confirmed by listening to the resulting WAV file).\n\nHowever, looking at their 'official' definition, the values by themselves are not what they should be. Basically, on a 1-shot sample there should be only 1-shot-related values, and for loops only loop-related values (again, confirmed by an encoder sample application found in the SDK).\n\nCould there be some trick/considerations involved when one should interpret these flags ?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "86",
  "tags": [
    "file-format",
    "decompress"
  ],
  "user": "aybe",
  "time": "Oct 23, 2015 at 14:37",
  "comments": [],
  "answers_data": [
    {
      "content": "Something seems a bit weird here; i'd have expected the loop to look something like 233333334, not 62222223. And i'm missing a loop count, how would you encode a start that's played twice, mid-section that doesn't get repeated, and an end section that repeats forever, or until the end of the level?\n\nBut that doesn't neccesarily mean some trick were intentionally involved. I'd assume Sony wrote the specs, published them to game creators, then implemented these specs in a certain way. The implementation probably doesn't check for violations of these specs, it just handles them in some way.\n\nEnter some software vendor who does a cross-platform game. They have their own music format, need to port it to the PSX, and write a converter. To test the converter, they convert some samples and listen to them, iterating until they sound right. After that, the converter might have gotten modified and enhanced several time, which introduced some bugs, but since the samples seem to work correctly, noone ever looks at the bytes anymore. Which means at some point they started violating the spec, but since the implementation doesn't choke at this, nobody knows about this.\n\n20 years later, you're the first one to ever notice.\n\nSo yes, there could be some considerations involved how to interpret the flags, and maybe nobody ever knew what these considerations are. Best you could do is get some games from a different vendor, and look at how they encode music. This may give you an idea if you're just misinterpreting something or if your first sample actually don't match the spec. And if it does, and you want to handle this, you'll probably have to reverse the actual implementation in the PSP firmware to find out how to handle these edge cases.\n\n",
      "votes": "1",
      "user": "Guntram Blohm",
      "time": "Oct 23, 2015 at 15:58",
      "is_accepted": true,
      "comments": [
        {
          "user": "aybe",
          "text": "Thanks, I guess you're right ! Just tried with 3 games and they all exhibit the same behavior. Too sum it up one should watch for 4 and 1 for one shots, and 6 and 3 for loops, period. Once again the KISS approach, using merely FC and sticking to these hints was right. But my curiosity caught me and I ended in a trap... (I think this specific, pre-SPU-stage format has been replaced by the more contemporary ATRAC, in the PSP)",
          "time": null
        }
      ]
    }
  ]
}