{
  "title": "How to debug (like gdb) with radare2?",
  "link": "https://reverseengineering.stackexchange.com/questions/11207/how-to-debug-like-gdb-with-radare2",
  "content": "I am new to radare2 and Linux. I got problem with r2.\n\nAs the title states it, many tutorials, articles, videos about r2 are just about disassembling programs, and read assembly codes. But, I want debug my programs.\n\nI search on the web and on GitHub... But did not find anything meaningful (or maybe I did miss it).\n\nI would like to know if somebody could tell me how to run the debugger in r2.\n\n",
  "votes": "7",
  "answers": 1,
  "views": "25k",
  "tags": [
    "radare2",
    "debuggers"
  ],
  "user": "hachzz",
  "time": "Mar 12, 2019 at 16:12",
  "comments": [
    {
      "user": "peter ferrie",
      "text": "you need to be a bit more specific about what exactly you want to do, otherwise this question is likely to be closed.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Go to archives of hack.lu conference here.\n\nYou can find there Radare2 workshop materials.\nThere are some mentions of debugging there.\n\nIn addition you have a radare 2 book, see basic debugging session chapter.\nI'd suggest to read all the book and workshop materials.\n\n",
      "votes": "10",
      "user": "Cquast",
      "time": "Mar 12, 2019 at 8:53",
      "is_accepted": true,
      "comments": [
        {
          "user": "hachzz",
          "text": "thanks, im so noob, just add -d as parameter, r2 will run in debug mode.  I have one more problem: can u guide me use radeco and add it to r2?",
          "time": null
        },
        {
          "user": "w s",
          "text": "As far as I know it doesn't decompile yet, it just creates dependency graphs. Use retdec plugin, you can install it with r2pm.",
          "time": null
        },
        {
          "user": "milahu",
          "text": "radare2 book has moved here",
          "time": null
        }
      ]
    }
  ]
}