{
  "title": "Reversing Hisense TV Firmware",
  "link": "https://reverseengineering.stackexchange.com/questions/11201/reversing-hisense-tv-firmware",
  "content": "I am looking for methods to get root on my Linux smart tv. Anyone have any ideas, in order to try extract the kernel config. Hisense is no help when asking for GPL source.\n\nI ran metasploit against it and had no luck, it did find some open ports for upnp and something called twonkymedia but I was not able to get anywhere with that. \n\nI have a Hisense LTDN50K220GWUS (Hisense 50H5GB) Smart TV that is running what appears to be a customized version of \"Opera TV OS\"\nRunning on \"Linux-3.0.13\" and is using uboot, I tried connecting a usb keyboard to the ports and pounding escape and other buttons\nbut that didn't get me anywhere.\n\nUsing Binwalk I was able to extract so info from a rom firmware image:\nbinwalk output\n\n",
  "votes": "5",
  "answers": 2,
  "views": "5k",
  "tags": [
    "decompilation",
    "linux",
    "arm",
    "unpacking"
  ],
  "user": "Bob R",
  "time": "Oct 28, 2015 at 21:08",
  "comments": [
    {
      "user": "w s",
      "text": "Link to binwalk output is dead. Providing a link to a full firmware image will also help.",
      "time": null
    },
    {
      "user": "Bob R",
      "text": "Working for me!",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "My achievements.\nI added to the startup telnetd, and ftpd.\nI found cifs.ko. kernel module And now added to mount network folders on boot. It works faster than dlna, in addition, I was able to solve the problem with the display of some of the file names in the Russian keyboard layout that used to be displayed as question marks....\nSee my research on the link\nhttp://openlgtv.org.ru/forum/viewtopic.php?f=17&t=170280\n\n",
      "votes": "5",
      "user": "hawkeye",
      "time": "May 22, 2016 at 18:44",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Use binwalk to extract rootfs, then search for file passwd in /etc/\nYou will discover every users available. Look for root user, this should look like:\n\n```\nroot:x3FrTg6uYT7.:0:0:root:/:/bin/sh\n\n```\nRecover the x3FrTg6uYT7string and give it to John the ripper software. This one will try to brute force the password. Once done you will need to find a debug port on your TV.\n\nI advise you to take a look at this link.\nFinally connect your RS232 com cable, power on your tv and wait for a shell asking for root password :)\n\nHave fun.\n\nUseful links:\n\nhttp://cities.lk.net/lost_password.htm\n\nhttp://www.cyberciti.biz/faq/understanding-etcpasswd-file-format/\n\nhttp://www.cyberciti.biz/faq/understanding-etcshadow-file/\n\n",
      "votes": "3",
      "user": "VivienG",
      "time": "Oct 29, 2015 at 9:59",
      "is_accepted": false,
      "comments": [
        {
          "user": "Bob R",
          "text": "Unfortunately there is no password for root in there, nor is there a /etc/shadow, I am trying to get the sources from the manufacturer. If not I will have to see if there is a method to dump from the TV.",
          "time": null
        },
        {
          "user": "VivienG",
          "text": "Is ther any root account ? Can you copy/paste the line ?",
          "time": null
        },
        {
          "user": "Bob R",
          "text": "root:x:0:0:root:/basic:/bin/sh",
          "time": null
        },
        {
          "user": "VivienG",
          "text": "As you may know x means that the password is in /etc/shadow. But as you said there is no shadow file, that's quite strange ... However, shadow file is not obliged to be in /etc/shadow if I remember well, I propose you to do something like grep -R \"root:\" /path/to/your/rootfs to find the shadow file.",
          "time": null
        }
      ]
    }
  ]
}