{
  "title": "Callee's return precalculations",
  "link": "https://reverseengineering.stackexchange.com/questions/11338/callees-return-precalculations",
  "content": "Good day.\n\nI build this simple code on Intel cpu working on Windows 7 with MS VS Express 2013:\n\n```\n#include <stdio.h>\nint f(int a, int b, int c);\n\nint f(int a, int b, int c){\n    int d = a*b + c;\n    return d;\n};\n\nint main()\n{\n    printf(\"%d  \n\", f(1, 2, 3));\n    return 0;\n};\n\n```\nWhen I disassemble binary I see just main() function that push 5 (the result of f()) and call printf():\n\n```\n; int __cdecl main(int argc, const char **argv, const char **envp)\n_main proc near\npush    5\npush    offset Format   ; \"%d  \n\"\ncall    ds:__imp__printf\nadd     esp, 8\nxor     eax, eax\nretn\n_main endp\n\n```\nI'm expect to see something like:\n\n```\n push 3\n push 2\n push 1\n call _f\n\n```\nor doing similar things with registers (for x64). But can't find f() definition. Is there any conventions or compiler optimizations that allow passing result without routine call? Or it is a debuggers (IDA, OllyDBG) calculating? It looks like the result of f() was calculated when project was built.\n\n",
  "votes": "0",
  "answers": 1,
  "views": "62",
  "tags": [
    "binary-analysis"
  ],
  "user": "Alex_H",
  "time": "Nov 17, 2015 at 8:13",
  "comments": [
    {
      "user": "w s",
      "text": "Yes, it is optimization during compile time, not debugging. If you want to see the function, you should compile with option /Od which means disabled optimization and may be found in project options (Configuration properties/C++/Optimization). If you would compile your program in VS in debug mode, start debugging and view disassembly window you'd see the call as you expected.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Many compilers have magic incantations for explicitly suppressing the inlining of certain functions, like __declspec(noinline). An alternative is introducing something that the optimizer is not allowed to 'see through', like a (volatile) function pointer or an external DLL function. A vararg function can sometimes be used with similar effect (i.e. pretend to use the result of some computation in order to force the compiler to actually perform it).\n\nThe convention underlying all this is the 'as if' rule in the C/C++ standards. The compiler must ensure that the observable behaviour of the resulting binary follows the defined semantics; how these results are arrived at is completely up to the compiler.\n\nIn connection with a good optimising compiler this makes the source code of a program a logical specification (or contract) of what the programmer expects to happen, and the physical realisation is fully up to the compiler. This is a good thing, and long overdue.\n\nContrast this to glorified macro assemblers like Turbo Pascal and older Delphis, where you know exactly which machine code fragment/template will get emitted for which source code construct (barring a small handful of tricks from the Dragon Book, like dead store elimination).\n\nHere are a few relevant verses from Scripture (ISO/IEC 14882:2003 alias C++03):\n\n(IOW, if you invoke undefined behaviour then all bets are off and the compiler may do whatever it pleases - including, but not limited to, crashing your computer or selling your wife on Ebay. Modern compilers tend to rely heavily on this clause.)\n\n",
      "votes": "1",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": true,
      "comments": [
        {
          "user": "Alex_H",
          "text": "Thank you for your detailed answer. It is very informative and helpful",
          "time": null
        }
      ]
    }
  ]
}