{
  "title": "adding data and code to existing .exe file on Windows [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/11406/adding-data-and-code-to-existing-exe-file-on-windows",
  "content": "I am trying to add new functionality to a hard-coded exe of a game like adding  new creatures and new spells and adding spells to creatures that did not have them before. For that I need to significantly modify the exe.\n\nIt should be theoretically possible to expand an exe file somehow by increasing its binary size. Browsing on the internet I have stumbled upon this tool:http://www.cgsoftlabs.ro/studpe.html\n\nSince I am a RE and assembly newbie I do not get at all how this operates and how I could expand an exe using this.\n\nI have heard about some tools that make this possible on Linux. Are there Windows equivalents?\n\nAlternatively, maybe I could use some sort of dll injection to expand the .exe? Or maybe add functionality through some hooking?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "7k",
  "tags": [
    "disassembly",
    "executable"
  ],
  "user": "Stanislaw T",
  "time": "9 years ago",
  "comments": [],
  "answers_data": [
    {
      "content": "Sure its possible to increase exe size (that's the trivial part) you just need to add new section to section table. \nI recommend CFF explorer \nIMHO the best PE view/edit tool.\nInvoke context menu from section headers (on the right side) to add new section then fill it with the code, data you want. Next you need to reverse the game and see how its structured and where to patch the code so it will jump to your code. For dll injection you could use Cheat engine they have a very nice tutorial but you still need to reverse the game and write injection code.dll.\n\n",
      "votes": "2",
      "user": "krusty",
      "time": "Nov 26, 2015 at 13:05",
      "is_accepted": true,
      "comments": [
        {
          "user": "Stanislaw T",
          "text": "I tested it on a test.exe file that was written in c++. After realigning the file, it lost its libraries and was reduced to base PE size. How do I avoid losing libs when realigning?",
          "time": null
        },
        {
          "user": "krusty",
          "text": "I dont understand, why do you realign. Do you use CFF explorer ? it will do everything for you",
          "time": null
        },
        {
          "user": "Stanislaw T",
          "text": "Because I was trying to add a big chunk (8000h). I am using CFF explorer.",
          "time": null
        }
      ]
    }
  ]
}