{
  "title": "How can i get offset of class member manualy(without source of )",
  "link": "https://reverseengineering.stackexchange.com/questions/11457/how-can-i-get-offset-of-class-member-manualywithout-source-of",
  "content": "I have a simple C++ program compiled with  Visual Studio 2005. I know that this program has a class base with a member variable x.\n\nHow can I identify the variable x when looking at the x86? Here is a function of this binary.\n\n",
  "votes": "0",
  "answers": 1,
  "views": "1k",
  "tags": [
    "assembly",
    "c++"
  ],
  "user": "LighFusion",
  "time": "Dec 16, 2015 at 17:12",
  "comments": [
    {
      "user": "user2823000",
      "text": "Do you know the language in which this program was written?",
      "time": null
    },
    {
      "user": "LighFusion",
      "text": "@Dillinur yes its C++ visual studio 2005, but i dont have any additional info like pdb or Coff, here is the source - pseudo code pastebin.com/5NLDV3S1 , asm pastebin.com/GRuJWSm6",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "For Visual Studio, ecx usually points to the current this object. As you can see, it's placed in esi at the start of your program.\n\nesi is not modified elsewhere, and is always used to access variables with offsets. That should indicate to you that it's the address of a struct, and each offset points to a given variable.\n\nYou'll have to find the purpose of each of those variables by looking at their size and how they are used in your program. In order to help you with that, you can define a new struct in Ida by going in the Structs tab (Shift+F9), and defining a new struct with variables corresponding to those offsets. You can then map them with T to help you following them.\n\nSee for instance this blog post.\n\n",
      "votes": "2",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": true,
      "comments": [
        {
          "user": "LighFusion",
          "text": "thx a lot, i will try to do that.",
          "time": null
        }
      ]
    }
  ]
}