{
  "title": "How to Fix a memory dump of a dll - so i dynamically reverse it using olly \\ ida",
  "link": "https://reverseengineering.stackexchange.com/questions/11474/how-to-fix-a-memory-dump-of-a-dll-so-i-dynamically-reverse-it-using-olly-ida",
  "content": "I need to analyze a memory dump of a malware module, unfortunately the sample is not the original dll, but the dump of the dll from the memory.\n\nNow fixing the sections headers is fairly easy - i just need to match the Virtual address \\ size to the Raw address \\ size because this is what the PE will get once loaded to memory (Which is the case for the dump)\n\nBut now there is a different problem, when i open the file on IDA-PRO for example, the memory isnt aligned correctly thus the analysis is incorrect and not all call functions with relative addresses work properly (they dont point to the right location - or to a location which makes sense in terms of PE size)\n\nI feel like the solution of Re-basing the PE on ida is incomplete and does not fix everything as i need it to be.\nAlso i would like to fix the PE so i can dynamically load it later with ollydbg (as if i had the original)\n\nSo my question is:\nHow exactly would you recommend me to fix the PE Headers and Rebase the program so i can load it successfully?\n\nFor the VirusTotal-Intelligence users, the Sample MD5 is:\n3bb85abe51b0f96f501d2bb32ec4edef\nSHA256:\n83c95637712cacc0ca280892465a75a3a10a2d8df48dd816ae703bccb15db51d\n\nSamples:\nhttps://www.hybrid-analysis.com/search?query=vxfamily%3AGen:Variant.Terkcop\n\n2015_12_08_ExtraInfo:\n@ubnix, I havent yet read the content of the materials you sent me, but im much aware of the importance of IAT - By the way this is exactly the problem when im loading the file on IDA.\n\nThe dll is being loaded at address 0x10000000 (Thus every section is loaded at 0x10001000 - depending on size and so on respectively, 0x10000000 and forward.)\n\nThe code of the malware is expecting the IAT to be located at 0x05320000, which is not the case obviously. When i try on IDA-PRO to change the location of the IAT Segment (Ctrl + S or ALT + S if i recall) it is crashing my IDA client.\n\nObviously changing the Address would only work as a temporary solution to see the malware statically on IDA pro and not as a solution to run the malware with ollydbg. If i would want to run the malware with olly, i need to somehow make the dll run under the correct address of 0x5320000\n\nWhen changing the BaseAddress of the PE from 0x10000000 to the address i want (Using CFF Explorer), it is still being loaded at 0x10000000 at ollydbg.. no idea why\n\nEdit2 2015_12_15:\nExample of a sample i \"fixed\" his headers, yet its still not working properly (Problems with all CRT fucntions)\n\nThe original sample:\nhttps://www.hybrid-analysis.com/sample/53dd790b1bd0588e542d33bde49dbf33c6fb7828e91a8d13c416c831108d642c?environmentId=1\n\nAfter i fixed the sample:\nhttps://www.dropbox.com/s/6dz7athzdja94p4/53_fixed_rebase.dll?dl=0\n\nPlease note that both of these files are samples of malware and might cause antivirus to alert.\n\nThe sample i fixed is definitely working more properly, and ida can instantly recognize all the functions - yet i think i missed something, because only the CRT functions or functions such as \"Init operation\" (Like c++ classes initialization) are failing.\n\n",
  "votes": "7",
  "answers": 2,
  "views": "5k",
  "tags": [
    "ida",
    "windows",
    "ollydbg",
    "pe",
    "memory-dump"
  ],
  "user": "0xAK",
  "time": "Dec 15, 2015 at 7:05",
  "comments": [],
  "answers_data": [
    {
      "content": "This would be a comment but since I still don't have enough reputation for comments, I will leave it as an answer:\n\nFor a dump to work correctly, there are a couple of more things you need to do besides fixing the section headers:\n\nI know I just posted a lot of material to read but believe me, I am talking from my personal experience, and these resources are a must if You want to understand the PE file format and the procedure of dumping PE files correctly. If you have any more questions feel write to ask and I will answer ASAP.\n\n",
      "votes": "6",
      "user": "ubnix",
      "time": "Dec 8, 2015 at 15:30",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xAK",
          "text": "i've changed my question and added some more information about the problem",
          "time": null
        },
        {
          "user": "ubnix",
          "text": "@RE-Beginner: DLLs are usually compiled with ASLR enabled. Check the Characteristics field in the IMAGE_FILE_HEADER to see does it contain the IMAGE_DLLCHARACTERISTICS_DYNAMIC_BASE flag. What this means is that the DLL will be loaded on a random address in memory and for it to work correctly, the relocation table must be specified and correct. So, is the relocation table specified in your malware sample?",
          "time": null
        },
        {
          "user": "0xAK",
          "text": "No this is not the case, also my reversing environment is set on windows XP, so it shouldnt effect me",
          "time": null
        },
        {
          "user": "ubnix",
          "text": "@RE-Beginner: could you upload the sample?",
          "time": null
        },
        {
          "user": "0xAK",
          "text": "yes i've added a way to download the sample on my message hybrid-analysis.com/search?query=vxfamily%3AGen:Variant.Terkcop",
          "time": null
        }
      ]
    },
    {
      "content": "open the dumped file in a hexeditor say hxd\nselect the bytes from offset 0x400 to 0xfff and delete them\n(all the bytes would be 0x00)\nsave the file your imports should turn out ok\npointer to raw data would normally be 0x400\nbut since this is a memory as you say the pe header would be 0x1000 bytes     deleting the extra bytes should align the text segment as well as entry point to correct place    \n\nif there are any misalignments further down in other sections you may need to trim the extra 00000 bytes  based on size of raw data + pointer to raw data this should normally match the next sections pointer to raw data\n\n",
      "votes": "1",
      "user": "blabb",
      "time": "Dec 10, 2015 at 19:48",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xAK",
          "text": "What i would usually do, instead of deleting the zero-bytes was to change to PE header to match that extra offset - so instead of having a raw-size of 0x400, i would change it to 0x1000 and it would fix the problem (so far)  I havent tried what u suggested yet, but i dont think its any different!   Will come back later with results",
          "time": null
        },
        {
          "user": "0xAK",
          "text": "any idea why only the crt functions are not working properly on ollydbg?",
          "time": null
        },
        {
          "user": "T.Todua",
          "text": "couldnt you write a sample app that does this automatically for a given file?",
          "time": null
        }
      ]
    }
  ]
}