{
  "title": "How can I check if an address contains a pointer?",
  "link": "https://reverseengineering.stackexchange.com/questions/11535/how-can-i-check-if-an-address-contains-a-pointer",
  "content": "I'm iterating through a list of heads returned by the Heads() function, and for each head I want to check if the address contains a pointer (specifically a pointer to code). \n\nI've tried using the functions here but none of them seem to be relevant.\n\n",
  "votes": "0",
  "answers": 2,
  "views": "2k",
  "tags": [
    "ida",
    "idapython"
  ],
  "user": "Derek",
  "time": "Dec 15, 2015 at 12:13",
  "comments": [],
  "answers_data": [
    {
      "content": "In idapython :\n\nidc.isOff0(idc.GetFlags(your_ea)) - checks if the operand 0 of the entity at your_ea is the offset (which means pointer). dd and dq are the valid entities for such a request.\n\nidc.isDword(idc.GetFlags(your_ea)) or idc.isQword(idc.GetFlags(your_ea)) checks if this head defined as a value of corresponding size.\n\nIf this head's content is not marked as an offset, but you still want to check it - you can get its value and check it against code segment borders.\n\n",
      "votes": "2",
      "user": "w s",
      "time": "Dec 15, 2015 at 12:52",
      "is_accepted": true,
      "comments": [
        {
          "user": "Derek",
          "text": "Thanks! Could you clarify why exactly \"checks if the operand 0 of the entity at your_ea is the offset \" means pointer?  Also, is there a corresponding method for checking if the address is an array? Something like idc.isArray (I tried but it didn't work)",
          "time": null
        },
        {
          "user": "w s",
          "text": "You can use 'idc.GetType(here())' to determine the type of the entity at the specific address. Data pseudo instructions like dd and dq have only one operand, and this is reason why OpOff0 and not OpOff1 is used.",
          "time": null
        }
      ]
    },
    {
      "content": "Using Sark you can:\n\n```\nimport sark\n\nfor line in sark.lines():\n    for xref in line.xrefs_from:\n        if xref.type.is_flow:  # Make sure the xref is not to the next line.\n            continue\n        if sark.Line(xref.to).is_code:  # Check if the xref's target is code.\n            print 'xref to code!'\n\n```\nSee xrefs and lines documentation.\n\n",
      "votes": "1",
      "user": "jvoisin",
      "time": "Dec 18, 2015 at 2:12",
      "is_accepted": false,
      "comments": []
    }
  ]
}