{
  "title": "what is the meaning of UsrLAsg in assembly?",
  "link": "https://reverseengineering.stackexchange.com/questions/11635/what-is-the-meaning-of-usrlasg-in-assembly",
  "content": "Little knowledge of assembly can be a problem sometimes. \n\n```\n push       ebp\n lea        eax,[ebp-3C0]\n call       005A0E30\n pop        ecx\n mov        edx,dword ptr [ebp-3C0]\n lea        eax,[ebp-20]\n call       @UStrLAsg\n push       ebp\n lea        eax,[ebp-3C4]\n call       005A1568\n pop        ecx\n\n```\nJust as the above code, I am trying to understand what is happening but I cannot understand the instructions lea followed by a call. \n\nMaybe if I had an idea of what @UstrLAsg means I would start to get what is going on there or maybe someone out there can give me a hint.\n\n",
  "votes": "1",
  "answers": 2,
  "views": "410",
  "tags": [
    "assembly",
    "x86"
  ],
  "user": "Alexio puk2sefu",
  "time": "Dec 26, 2015 at 9:26",
  "comments": [
    {
      "user": "blabb",
      "text": "as answered by perror ustlasg is just a name a symbol most of the debuggers and disassembler will offer you an option to turn it off and display the actual address like your call 5a0e30 just a few lines above your tool recognized the address as ustrxxx so it displays ustrxx for the call few lines above thsi call it didnt recogize the symbol so it says call 0x50xxxxx that is all",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "This instruction sets register edx to the value of the DWORD at memory address (ebp-3C0).\n\nThis instruction sets register eax to the value (ebp-20); despite the square brackets in the instruction, there is no memory dereferencing involved.\n\nThis instruction calls the Delphi library function UStrLAsg(), which receives its input arguments via eax and edx. A little Googling shows that that function is used to assign a local Unicode string to a global variable, where edx points to the source string and eax points to the global variable.\n\n",
      "votes": "2",
      "user": "Community",
      "time": "May 23, 2017 at 12:37",
      "is_accepted": true,
      "comments": [
        {
          "user": "Alexio puk2sefu",
          "text": "Great,thats why  call @UstrLAsg starts with test Edx,Edx huh!",
          "time": null
        }
      ]
    },
    {
      "content": "lea stands for Load Effective Address. It is an instruction designed to fetch a piece of memory and load it into a register in an optimized manner. It may also be used to perform an addition when you see:\n\n```\nlea eax, [eax+4]\n\n```\nWhich is equivalent to:\n\n```\nadd eax, 4\n\n```\nThen, the call @UstrLAsg refer to a symbol (@UstrLAsg), which give a static address in the executable memory. The best way to find out where it does jump in memory would be to execute the program and to look at the symbol while running. It should unveil the static address.\n\nHope this helped you a bit.\n\n",
      "votes": "0",
      "user": "perror",
      "time": "Dec 26, 2015 at 9:35",
      "is_accepted": false,
      "comments": []
    }
  ]
}