{
  "title": "Extract text data from a compressed/encrypted .DAT file",
  "link": "https://reverseengineering.stackexchange.com/questions/11659/extract-text-data-from-a-compressed-encrypted-dat-file",
  "content": "Hello,\n\nI'm from Uruguay so I'll make my best effort to explain my \"problem\" in english.\nI want to read some text that is inside a .DAT file, but is \"encrypted\" or \"compressed\" (I don't know which is the right \"term\" for this). The file is from the game SMITE, and this file has basically most of the text in the game (like unreleased Item descriptions) and that's why I want to read the file :D\n\nPrevious versions of the file could be readed with Notepad ++, like this:\nhttps://i.sstatic.net/LCi71.png\n\nBut current versions are just random letters and NULL characters. (I can't post a picture because of the \"only two links\" restriction).\n\nI'm interested in just two files. One, is named \"Lang_INT.dat\", inside the Localization folder, there is another file in that folder named \"GFxTranslation.int\", which has some text that appears in the Lobby Screen and things like that, that's why the \"Localization\" folder has to be where the text is... but in the first picture that I shared, you can see text that appears in-game and also in the lobby screen, and it's on another folder named \"Content\" and the file is named \"assembly.dat\", with another file named \"behavior_trees.dat\" but I think that file is not important to me.\n\nBy the way, this maybe would be usefull as a \"reference\", there is another .DAT file named \"word filter\" which (i suppose) has the \"bad words\" that are censored in the chat if the word filter is activated. This .DAT is inside the Localization folder.\n\nI'll appreciate any kind of help on this, I did some research but I did not find anything that is usefull... the only thing that I know is: A person who has no knowledge about programing or \"some\" knowledge, could \"de-compress\" \"decrypt\" one of this files...or that is what looks like, and no, that person do not want to help me :c\n\nThanks in advance again, and sorry for bad English:\n\n-Agustín\n\n",
  "votes": "3",
  "answers": 1,
  "views": "41k",
  "tags": [
    "decompilation",
    "file-format",
    "decryption"
  ],
  "user": "Agustín Gargaglione",
  "time": "Dec 30, 2015 at 22:12",
  "comments": [
    {
      "user": "Agustín Gargaglione",
      "text": "Also: If you speak spanish please read this post in spanish here: pastebin.com/mKDzi0fb (without the links or pictures)",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "These files are definitely not compressed. behavior_trees.dat is a binary file which is not encrypted and not compressed, just binary. Encryption, as far as I can see, looks like substitution cipher which should be relatively easy to crack with frequency analysis if you know what should be there. Assuming that decrypted content of files from older and newer versions are similar you can try to account frequencies of symbols on a base of files of previous versions.\n\nHere is what I'd do for decrypting (for example) assembly.dat file:\n\nUPDATE, Just for the sake of completeness:\n\nI used an excellent tool XorSearch by Didier Stevens (it was mentioned by @Andy Dove in answer to another question, which reminded me to return to this one) and found out the following:\n\nGood luck.\n\n```\nimport os\nimport sys\n\nf = open(sys.argv[1], \"rb\")\no = open(sys.argv[2], \"wb\")\n\ndata = f.read()\n\nfor d in data:\n    o.write(\"\" + chr (ord(d) ^ 0x2a))\n\n\nf.close()\no.close()\n\n```\n",
      "votes": "3",
      "user": "w s",
      "time": "Jan 12, 2016 at 11:16",
      "is_accepted": true,
      "comments": [
        {
          "user": "Agustín Gargaglione",
          "text": "I got lost when i read the Nº2 :P I don't know so much about programming or things like that, i know only the basics...",
          "time": null
        },
        {
          "user": "Agustín Gargaglione",
          "text": "Also: Unfortunately I can't get old files, the only server that got them remove the files recently :c",
          "time": null
        },
        {
          "user": "Agustín Gargaglione",
          "text": "Well, forgot to say: THANKS! This worked. I will write a new post, regarding this Dat... Thanks again! (and sorry for not reply this before lol)",
          "time": null
        }
      ]
    }
  ]
}