{
  "title": "Can I extract .txt files from .exe if I know their addresses?",
  "link": "https://reverseengineering.stackexchange.com/questions/11741/can-i-extract-txt-files-from-exe-if-i-know-their-addresses",
  "content": "I have disassembled the exe in IDA 6.1 and I think I found a hand full of text files and was wondering how to go about dialing into the addresses and extracting the data. Here is what I found\n\n\nI know how to code a bit in C and .net and thought maybe it would be possible with guidance. Thanks in advance\n\n",
  "votes": "0",
  "answers": 2,
  "views": "851",
  "tags": [
    "ida",
    "c#"
  ],
  "user": "William Henson",
  "time": "Jan 11, 2016 at 5:31",
  "comments": [
    {
      "user": "William Henson",
      "text": "I found a program that extracts all bits of texts but the demo is very limited. Word Extractor. what works works well",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "It appears to me as if these are just file names, which may or may not refer to files embedded in the executable. Looking at the cross references and the surrounding API calls might tell you how they are being used. \n\nPerhaps using a utility like strings might help to discover if there is more embedded text.  If you think the files might be obfuscated you could try Didier Steven's xorsearch tool.\n\n",
      "votes": "2",
      "user": "Andy Dove",
      "time": "Jan 11, 2016 at 14:46",
      "is_accepted": false,
      "comments": [
        {
          "user": "William Henson",
          "text": "I have scoured the accompanying files using Word extract and hex editors.  there is no mention of such files except for inside the .exe. And when I say scoured I mean the find utility and manually searching. Still downloaded xorsearch. Thank you.",
          "time": null
        }
      ]
    },
    {
      "content": "Have you tried using IDAPython? Recently Palo Alto's special team, Unit42, started a series of articles about using it to help in binary analysis. It doesn't cover exactly what you're looking for, but it might give you some ideas:\n\nUsing IDAPython to Make Your Life Easier: Part 1\nUsing IDAPython to Make Your Life Easier: Part 2\nUsing IDAPython to Make Your Life Easier: Part 3\nUsing IDAPython to Make Your Life Easier: Part 4\n\n",
      "votes": "1",
      "user": "DarkLighting",
      "time": "Jan 12, 2016 at 15:04",
      "is_accepted": false,
      "comments": []
    }
  ]
}