{
  "title": "Trouble understanding this rop chain",
  "link": "https://reverseengineering.stackexchange.com/questions/11838/trouble-understanding-this-rop-chain",
  "content": "I recently saw a video of someone doing some rop work. And I have a lot of trouble about what is going on. His setup is like this:\n\n```\n[garbage]\n[xor eax]\n[xor ebx]\n[address of \"sh\"]\n[pop ecx]\n[address of Null byte]\n[pop edx]\n[address of Null byte]\n[add eax 11]\n\n```\nThe first instruction is xor eax (where eip return is) , and I don't understand where the esp is when there are the pop instructions\n\nLink to the video : https://youtu.be/uYHOxlYzH0A\n\n",
  "votes": "1",
  "answers": 1,
  "views": "473",
  "tags": [
    "assembly",
    "buffer-overflow"
  ],
  "user": "side",
  "time": "Jan 26, 2016 at 18:08",
  "comments": [],
  "answers_data": [
    {
      "content": "The ROP chain uses gadgets, which are short code snippets performing a basic function. The instruction what you see in the Python script in the video are the gadgets names, which were selected in the beginning.\nAs an example, the XOREAX gadget was a code snippet at address 0x080512c0, which contains the following instructions:\n\n```\nxor eax, eax\nret\n\n```\nSo, whet the XOREAX gadget is called, the eax register is cleared and a ret instruction is executed. Because the ret load an address from the stack and jumps to it, this instruction is used to call the next gadget.\n\nWhat you see in the Python script is the construction of the payload, which will be placed into the stack. The first address will be the overwritten return address and the next values will be the addresses of the gadgets. In some places in the payload you see SH and NULL. It is because the previous gadget load some value from the stack into a register, so the value should be placed into the stack also. The SH is an address points to the sh string, while the NULL is an address points to a 0 value in the memory.\n\nSo, the whole ROP chain is only initializes the registers to execute a system call.\n\n```\nXOREAX                             -> clears EAX\nPOPEBX, SH                         -> moves 'sh' string to EBX\nPOPECX, NULL                       -> moves a pointer to a NULL value to ECX\nPOPEDX, NULL                       -> moves a pointer to a NULL value to EDX\nADDEAX3, ADDEAX3, ADDEAX3, ADDEAX2 -> set EAX to 11\nSYSCALL                            -> perform syscall instruction\n\n```\n",
      "votes": "3",
      "user": "ebux",
      "time": "Jan 25, 2016 at 9:04",
      "is_accepted": true,
      "comments": []
    }
  ]
}