{
  "title": "What is the command to \"go to current statement\" in IDA debugger?",
  "link": "https://reverseengineering.stackexchange.com/questions/11868/what-is-the-command-to-go-to-current-statement-in-ida-debugger",
  "content": "I'm trying to learn how to use the IDA pro debugger (having used Visual Studio's C++ debugger for years) and I'm struggling to find how to switch the code/asm view back to the current instruction that debugger broke on?\n\nSimilar to the \"Show next statement\" button in Visual Studio:\n\n\n\nPS. Here's my situation. Say, I broke on some instruction and then using IDA's \"graph view\" navigated away from that instruction. How do I go back?\n\n",
  "votes": "5",
  "answers": 1,
  "views": "2k",
  "tags": [
    "ida",
    "windows",
    "debuggers"
  ],
  "user": "c00000fd",
  "time": "Jan 28, 2016 at 8:08",
  "comments": [],
  "answers_data": [
    {
      "content": "You can navigate back to the previous position simply by pressing ESC. If you want to back to the current IP address, just press the right mouse button a select Jump to IP\n\n.\n\n\nAlternatively you can press G and set EIP as address.\n\n",
      "votes": "7",
      "user": "ebux",
      "time": "Jan 28, 2016 at 9:02",
      "is_accepted": true,
      "comments": [
        {
          "user": "c00000fd",
          "text": "Oops. Thanks. I should've thought about it myself.",
          "time": null
        },
        {
          "user": "c00000fd",
          "text": "As a side note... do they rename it to \"Jump to RIP\" for x64 process :)",
          "time": null
        },
        {
          "user": "Vitaly Osipov",
          "text": "There will come a time when people read help before posting to stackexchange.",
          "time": null
        },
        {
          "user": "c00000fd",
          "text": "@VitalyOsipov: You know that it would take you less time to answer my question then to post what you did above?",
          "time": null
        },
        {
          "user": "c00000fd",
          "text": "@VitalyOsipov: You really have nothing else to do, do you?",
          "time": null
        }
      ]
    }
  ]
}