{
  "title": "Creating my own custom structure in Ollydbg",
  "link": "https://reverseengineering.stackexchange.com/questions/11893/creating-my-own-custom-structure-in-ollydbg",
  "content": "In Ollydbg's hex dump window (lower left quadrant of CPU window) one can interpret data as structures, you can right-click on one or more bytes and see the options \"Decode as structure\" or \"Decode as pointer to structure\" (if more than one byte selected).  It then opens a new window with the data laid out vertically, with each data element shown as a row.  You can decode more than one instance.  \n\nHowever, I'd like to add my own structure types.  Imagine I have this structure:\n\n```\ntypedef struct {\n           double x,y,z;   \n           unsigned char id;\n           int label;\n           char *name_string;\n           anotherStructType *struct;       \n           } model_type;\n\n```\nBelow are some images showing the steps, with the fixed structure type \"COORD\" chosen.  Imagine I want to decode it instead with the above 'model_type' structure type.  Perhaps the answer lies in some command line or .ini manual setting?\n\nAlso, it would be nice if this could be used along with labels to identify struct elements in the disassembly window, for example [EAX+1C] could be interpreted as 'player.id' if one could somehow tell Olly EAX is the base pointer.  But perhaps I'm getting carried away...\n\n\n\n\n\n\n",
  "votes": "3",
  "answers": 1,
  "views": "2k",
  "tags": [
    "ollydbg"
  ],
  "user": "Markbotix",
  "time": "Jan 30, 2016 at 9:43",
  "comments": [],
  "answers_data": [
    {
      "content": "BE AWARE what follows are undocumented stuff \n\ncreate a file either named as [binary].arg or common.arg\nthe first name is applicable to only to the specific [binary]\nthe second name common.arg is applicable globally \n\npaste this inside the file \n\n```\nSTRUCT _MYSTRUCT\nQWORD DOUBLE x\nQWORD DOUBLE y\nQWORD DOUBLE z\nBYTE  CHAR  id\nDWORD INT label\nDWORD ASCII* name\nDWORD INT* foo\nEND\n\n```\ndrop the file in the folder where ollydbg resides.\n_MYSTRUCT should be available in the drop down box now \n\nSTRUCT is a keyword\nstruct names need a leading underscore\nthe members are defined like\nFIELDSIZE, TYPENAME , MEMBERNAME   \n\nvalid FIELDSIZE are   \n\nthat correspond to sizes 1,2,3,4,8,16\nTYEPNAMES are vast you should try and err\ni have posted some which are common\nNotice i have cast Your last Structure as INT* instead of anotherstruct*\nfor which you may need to add a custom type in the file\nyou can specify a repeat count with asterisk *    \n\n```\nBYTE*48 BYTE somecrap  \n\n```\nsomecrap is MemberName a string    \n\nEND is a keyword denoting end of structure    \n\nsome dummy src that use the structure from your Query compiled executed and \nscreen shot below\n\nsrc \n\n```\n#include <stdio.h>\n#include <windows.h>\n#pragma pack(1)\ntypedef struct _TESTY {\n    int a;\n    int b;\n}Testy,*PTesty;\ntypedef struct _MYSTRUCT {\n    double x,y,z;\n    unsigned char id;\n    int label;\n    char *name;\n    Testy *foo;\n}MyStruct,*PMyStruct;\n\nint main (void) {\n    MyStruct blah;\n    Testy arrgh;\n    char *test = \"hello do i know c ?\";\n    memset(&blah,0,sizeof(blah));\n    blah.x=43.0;\n    blah.y=76.34;\n    blah.z=0.0;\n    blah.id = 'a';\n    blah.label = 54;\n    blah.name = test;\n    arrgh.a =45;\n    arrgh.b =54000;\n    blah.foo = &arrgh;\n    printf(\"%f  \n\",blah.x);\n    printf(\"%s  \n\",blah.name);\n    printf(\"%d  \n\",blah.foo->b);\n    return 0;   \n}\n\n```\nexecuted \n\n```\nstructy.exe\n43.000000\nhello do i know c ?\n54000 \n\n```\nrunning with ollydbg \n\n```\nollydbg.exe structy.exe \n\n```\nthe log windows shows it used the structure definitions we provided by xxxxx.arg \n\n```\nLog data\nAddress   Message\n          OllyDbg v2.01\n          Command line: structy.exe\n          Loading function descriptions from 'common.arg'\n            2 structures\n            Total size of known data is 1521777 bytes\n\n```\nscreen shot \n\n\n",
      "votes": "3",
      "user": "blabb",
      "time": "Feb 1, 2016 at 9:52",
      "is_accepted": true,
      "comments": [
        {
          "user": "Markbotix",
          "text": "Looks good, thanks!  But I can't repeat it in my system, the compiler is optimizing it away and I get a much shorter program with hardcoded values fed to _printf.  I am using Visual Studio 6, compiling for Release with default flags.  I need to find my correct compiler or linker setting to make the full code appear that you have.",
          "time": null
        },
        {
          "user": "blabb",
          "text": "i dont compile debug i always compile release and with highest level of warnings and analyze enabled code shown above is done with windows sdk 7.1 compiler (free )  cl /nologo /Zi /EHsc /O1 /analyze /W4 *.cpp /link /release  so wyswyg should apply",
          "time": null
        },
        {
          "user": "Markbotix",
          "text": "I fixed the compiler optimization issue, changing it to /Od which is \"disable (Debug)\".  The default for VS6 Release was /O2 =\"optimize speed\".  It was simply under the Project Settings->C++ -> Optimizations in the IDE.  I like the idea of doing things from the command line with 'cl' directly, I must try that too.",
          "time": null
        },
        {
          "user": "Markbotix",
          "text": "This is a great answer, now I can see structures.  It's really useful I believe, at least for looking into my own programs.  I found Blabb's answer worked with Ollydbg 2.01.   I found I could change the .ARG file and simply restart (ctrl-F2) to reload the defn's without having to stop and start Ollydbg like I feared (I thought it might only look at them when I launched Ollydbg).  Sadly in Olldbg when you spawn a structure, list, or other dump window from the main hex dump, it doesn't have the same capabiliites.  I can't spawn another decoded window from the *foo pointer to the 2nd struct type.",
          "time": null
        },
        {
          "user": "trigger_segfault",
          "text": "Be aware that numbers are in hexadecimal by default. The 0x prefix is optional, but required for numbers starting with alpha characters. The . suffix can be used for unsigned decimal numbers: 10. Also TBYTE is 10 bytes in size (which is required for fields using the LDOUBLE type). But it was awkward to figure this out before learning everything was in hex. For character arrays, the ATEXT type can be used. I've written up more in-depth documentation on the format, there's a lot to it, but it's definitely experimental: github.com/trigger-segfault/Ollydbg-Argfile-Docs",
          "time": null
        }
      ]
    }
  ]
}