{
  "title": "Can changes in memory (stack or hex dump) be highlighted as are register changes in Ollydbg?",
  "link": "https://reverseengineering.stackexchange.com/questions/11954/can-changes-in-memory-stack-or-hex-dump-be-highlighted-as-are-register-changes",
  "content": "In Ollydbg, if an instruction causes a register to change, it is highlighted red in the registers window in the CPU view.\n\nIs it possible to have the same happen in the hex dump or stack windows?  Of course the area of memory being watched would have to have limits, perhaps only what is seen, or between some limits?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "494",
  "tags": [
    "ollydbg"
  ],
  "user": "Markbotix",
  "time": "Feb 5, 2016 at 23:04",
  "comments": [],
  "answers_data": [
    {
      "content": "yes it is possible to but you have to set the dump characteristics manually\nsuppose you are on an instruction push 58\nthis instruction will modify the stack \nso select esp from the registers pane rightclick->and follow in dump\nselect some bytes and press ctrl+e\nmodify some bytes in the selection\nand reset it back to original bytes with alt+backspace\nnow if you execute push 58 the dump at position esp-4 will be highlighted in red \n\n\n\n",
      "votes": "2",
      "user": "blabb",
      "time": "Feb 6, 2016 at 5:16",
      "is_accepted": true,
      "comments": [
        {
          "user": "Markbotix",
          "text": "another great helpful answer from Blabb.  Actually, I find that the necessary steps are just to change memory, and then to undo with the alt-BACKSPACE as you said.  This works for either the hex dump window or the stack, just change something and undo the change (undo critical step it seems) and then it will show changes in red from then on.  If the hex dump pane is set to the stack memory area, it will appear in both.  It's not necessary to follow the stack pointer from the register pane first (although this helps us get to the address faster if we wish to follow the stack).",
          "time": null
        },
        {
          "user": "Markbotix",
          "text": "In my above comment, I used Ollydbg 2.01.",
          "time": null
        }
      ]
    }
  ]
}