{
  "title": "Statically detect destroyed Import Segment (IAT)",
  "link": "https://reverseengineering.stackexchange.com/questions/11999/statically-detect-destroyed-import-segment-iat",
  "content": "I'm writing a tool, which analyses PE-Malformations and I'would like to build a function to detect a destroyed import section in a PE-File. It would be great if it would be possible to somehow figure it out from the optional header of a PE.\n\nIf I open a PE with IDA Pro then I'm notified about that:\n\n\n\nBut I'm interesting about how it works under the hood. Is IDA Pro saying that Imports are destroyed just because there are a few imports?\nOr does it try to find some functions and isn't able to do that?\n\nI'm sorry if it's a simple question, but I could not find a detailed information about that. There are a lot of information how to rebuilt/repair Import Address Table from a dumped file, but not how to actually detect it by yourself.\nThanks in advance!\n\n-------little supplement-------------\n\nI would like to show one example with a corrupted import sections by viewing a PE in a PEView Tool.\n\nBelow you see a PE which claims that it has the import table at the RVA 0xA21C.\n\n\n\nBUT this file ends at the RVA 0x5BF0. \n\nSince 0xA21C > 0x5BF0 we can conclude that the imports in this PE are damaged, because 0xA21C is a not valid pointer, right?\n\n\n\nAre there another ways to recognise the corrupted import section?\n\n",
  "votes": "2",
  "answers": 2,
  "views": "3k",
  "tags": [
    "ida",
    "pe",
    "iat"
  ],
  "user": "0xDEADC0DE",
  "time": "Feb 11, 2016 at 14:48",
  "comments": [
    {
      "user": "Jason Geffner",
      "text": "I answered your first question below. Please ask your second question in a separate post. (One question per post, please.)",
      "time": null
    },
    {
      "user": "0xDEADC0DE",
      "text": "This is one question, but with an example.",
      "time": null
    },
    {
      "user": "Jason Geffner",
      "text": "You're asking how IDA Pro decides whether or not to display its imports segment warning message, and you're also asking for other ways to recognize a corrupted import section.",
      "time": null
    },
    {
      "user": "0xDEADC0DE",
      "text": "I'm actually asking how to detect a corrupted import section. The case with IDA Pro is another example - I want to understand how IDA Pro detects a damaged IAT too.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You need to get familiar with PE Import Table\n\nIn a nutshell (I will not mention about import by ordinal)\n\n```\nIMAGE_IMPORT_DESCRIPTOR.FirstThunk points to IMAGE_IMPORT_BY_NAME table. \n\nIMAGE_IMPORT_DESCRIPTOR.FirstThunk --------------------------\n                                                            |\n                                                            |\nIMAGE_IMPORT_BY_NAME <---------------------------------------\nIMAGE_IMPORT_BY_NAME\nIMAGE_IMPORT_BY_NAME\nIMAGE_IMPORT_BY_NAME\n\n```\nWhen you parse the table and it's pointers (RVA) are not resolved to a valid IMAGE_IMPORT_BY_NAME structure you can assume import table is corrupted.\n\n",
      "votes": "3",
      "user": "ebux",
      "time": "Feb 11, 2016 at 14:04",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xDEADC0DE",
          "text": "Thank you! I have also added an example to my question. Do I understand it correctly?",
          "time": null
        },
        {
          "user": "krusty",
          "text": "I dont use use PEView tool I use/recommend CFF explorer ntcore.com/exsuite.php  Looking at the screenshot your file has import table at RVA 0xA21C it is not an offset.",
          "time": null
        },
        {
          "user": "0xDEADC0DE",
          "text": "But is it a correct logic in this example?",
          "time": null
        },
        {
          "user": "krusty",
          "text": "Yes of course if Import Table RVA is not valid (outside of the file) then import table is corrupted. But that's the first step to validate import table. The stuff I described is deeper, it's not that simple.",
          "time": null
        }
      ]
    },
    {
      "content": "IDA shows that message if the PE section that contains the Import Table doesn't contain relocations and the name of Import Table's section isn't one of the following: .idata, .rdata, .text.\n\n",
      "votes": "1",
      "user": "Jason Geffner",
      "time": "Feb 11, 2016 at 14:37",
      "is_accepted": false,
      "comments": []
    }
  ]
}