{
  "title": "What is a USES Diagram? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/12012/what-is-a-uses-diagram",
  "content": "I am new to reverse engineering code. I am currently trying to reverse engineer code that is poorly documented. The reason being is that my system will be based of the code I am reverse engineering. It is currently too complex to simple go through.\n\nA friend of mine recommend I use a diagram called a USES diagram. He explained is as such. The diagram displays the modules and how each module connects to one another. The arrows display the data transfer between the modules. IT can be described that M1 uses M12 uses M2.\n\nI have been looking on the net to find a better description of this and how I can create such a diagram and how I can define a module. I am attempting to define the architecture of the program. Unfortunately, a google search turned up very little.\n\nI was wondering, is there another name for this type of diagram? I was describing it to another friend and he says that it sounded like a special case of a UML diagram.\n\n",
  "votes": "-1",
  "answers": 1,
  "views": "66",
  "tags": [
    "code-modeling"
  ],
  "user": "philm",
  "time": "9 years ago",
  "comments": [
    {
      "user": "philm",
      "text": "I do not see why this was placed on hold. I am using this type of diagram because it is for reverse engineering code which is directly what the forum is related to.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "It sounds like your friend is describing a dependency graph.\n\n",
      "votes": "0",
      "user": "Jason Geffner",
      "time": "Feb 12, 2016 at 19:10",
      "is_accepted": true,
      "comments": [
        {
          "user": "philm",
          "text": "Hey Jason, thank you for your reply. Yes, I think that this is what he is saying. I will mark this as answered for now. IF i have any more questions about this topic, I will post on this comment.",
          "time": null
        }
      ]
    }
  ]
}