{
  "title": "How to extract code form .exe file having signature Borland Delphi 6.0 - 7.0 [Overlay] [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/12026/how-to-extract-code-form-exe-file-having-signature-borland-delphi-6-0-7-0-ov",
  "content": "when i input .exe file to PEiD v0.95 it gives output like\n\"Borland Delphi 6.0 - 7.0 [Overlay]\"\n\nNow i want to retrieve code from .exe file. So how to do that . Can any one give me right path for that.\n\n",
  "votes": "0",
  "answers": 2,
  "views": "12k",
  "tags": [
    "debugging",
    "delphi",
    "exe"
  ],
  "user": "Sam",
  "time": "9 years ago",
  "comments": [
    {
      "user": "ubnix",
      "text": "If you never reversed a Delphi binary I would suggest you to go through these two tutorials. They should get you started on the right path: octopuslabs.io/legend/blog/archives/1947/1947.htm octopuslabs.io/legend/blog/archives/2044/2044.htm",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I had the same question.. Unfortunatly thre is no tool that can provides you the original source code. But the perfect solution that I found is to use OllyDbg or IdaPro. In this way you can navigate inside the code reading ASM lenguage.\n\nIf ASM is a problem for you.. IdaPro can probably help showing a sort of pseudocode, that is not exactly like the original source code, but it can give you an idea about the CodeFlow \n\n",
      "votes": "1",
      "user": "Alessio Trecani",
      "time": "Feb 14, 2016 at 12:09",
      "is_accepted": true,
      "comments": [
        {
          "user": "Sam",
          "text": "i have already tried IdaPro but i am not understanding anything. Can u tel me something more on it.",
          "time": null
        },
        {
          "user": "Alessio Trecani",
          "text": "first of all if you want to decompile something coded with native code(C/C++/Delphi)  you need to learn at least the basics of ASM. There is no solution  about this.. Because every decompiler will retrieve the code in Assembly.. If this solved your problme please check it as solved.",
          "time": null
        }
      ]
    },
    {
      "content": "As far as I am concerned, you cannot retrieve the high level code from an executable.Fire up your debugger and analyze it.\n\n",
      "votes": "0",
      "user": "Noname",
      "time": "Feb 13, 2016 at 21:23",
      "is_accepted": false,
      "comments": []
    }
  ]
}