{
  "title": "What compression algorithm could have generated these strings?",
  "link": "https://reverseengineering.stackexchange.com/questions/12211/what-compression-algorithm-could-have-generated-these-strings",
  "content": "To what kind of compression algorithm could the following sentences belong to?    \n\n```\nAxFWR:YRCtIPns<_o%p_=Q>LELBM\nAxFWRPA:cXe#<InM=L:Mthwekblc\nAxFWREFEp`f?PU`;K;M:;P?MDMCL\nAxFWRW%VK>Hk]hhDTSERSHWEKBLC\nAxFWRiQifLRCE@t>N<J=<L;QHQGP\nAxFWRTWTArlZ[fJhxbtcbrewax%y\n\n```\nI don't think that it is any kind of hash but rather a simpler algorithm. I tried Base64, but I am sure that it is not.\n\nAlso I know that fragments of the \"plain text\" of every of these strings probably include (in order) :\n\n```\n4B3A29\n4609\nN00852\nA00\n\n```\nJust to give you an example it could look like:\n 4B3A29 ... 4609532N 00852444E A00 ...\n\n",
  "votes": "2",
  "answers": 2,
  "views": "205",
  "tags": [
    "decompress",
    "strings"
  ],
  "user": "G Tr3s0ld1",
  "time": "Mar 14, 2016 at 16:27",
  "comments": [
    {
      "user": "w s",
      "text": "It doesn't look compression.  If it would be compression AxFWR would not appear here more than one time - and you'd see there non-printable characters. It looks like substitution cipher or other encoding.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "As stated by @ashleydc, it's most likely custom Base64.If you have enough ciphertexts, an easy way to check if it's custom Base64 would be to compute the number of unique characters. (there are 56 unique chars with the few given examples, so it's a fair bet).\n\nAfter that, it's \"just\" a substitution cipher. Having a plaintext/ciphertext couple would tremendously help. Otherwise, if the plaintext has enough constraints (only digits/uppercase as you might hint?), you'll have to guess enough about the plaintext (most propable tuples, etc) until you're able to bruteforce it. \n\n",
      "votes": "1",
      "user": "user2823000",
      "time": "Mar 15, 2016 at 23:28",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "This looks like base64 encoding to me, using an alphabet that has been reordered.  If you'd like a little more information, there's a paper that describes this sort of thing at https://security.utexas.edu/sites/default/files/Obfuscation.pdf.  Unfortunately, since there are so many ways to reorder the alphabet, it may not be easy to decode.\n\n",
      "votes": "0",
      "user": "ashleydc",
      "time": "Mar 15, 2016 at 13:44",
      "is_accepted": false,
      "comments": []
    }
  ]
}