{
  "title": "Why can't I get the EIP to reflect my input",
  "link": "https://reverseengineering.stackexchange.com/questions/12307/why-cant-i-get-the-eip-to-reflect-my-input",
  "content": "I am going through a tutorial which shows you how to exploit a stack based buffer overflow in a sample C program. The C code is:\n\n```\n#include <string.h>\n\nvoid function(char *str) {\n   char buffer[1024];\n   strcpy(buffer,str);\n}\n\nint main(int argc,char *argv[])\n{\n    char aaa[500];\n    function(argv[1]);\n}\n\n```\nAs per the author if we write 1032 'A's, we should be able to see 'AAAA' in the EIP register. I understand the theory behind it. However, running it on Windows 7 32 bit and debugging it with Immunity Debugger, it says \"Process terminated exit code C0000409\". EIP instead points to \"ntdll.RT lUserThreadStart\". Please advise. \n\n",
  "votes": "1",
  "answers": 2,
  "views": "517",
  "tags": [
    "x86",
    "exploit",
    "buffer-overflow"
  ],
  "user": "user1720897",
  "time": "Mar 30, 2016 at 15:14",
  "comments": [
    {
      "user": "peter ferrie",
      "text": "while the code does contain a vulnerability, your ability to exploit it depends very much on the compiler and options that you used for it.  A build on a modern Visual C for example, will terminate the process before the overwritten EIP receives control.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "That assumes that the program was compiled without (now standard) runtime safety checks. If you'd like to compile the program with these safety checks disabled, please ask for help at https://stackoverflow.com/.\n\n",
      "votes": "0",
      "user": "Community",
      "time": "May 23, 2017 at 12:37",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Building upon Jason's answer, this is most likely due to your compilers Buffer Security Check.\n\nSpecifically in Microsoft compilers the '/GS' option.\n\nThe MSDN page gives a better explanation aswell as a few examples.\n\n",
      "votes": "0",
      "user": null,
      "time": "Mar 30, 2016 at 17:08",
      "is_accepted": false,
      "comments": []
    }
  ]
}