{
  "title": "Visual Basic internal structure",
  "link": "https://reverseengineering.stackexchange.com/questions/12359/visual-basic-internal-structure",
  "content": "I am analyzing some Visual Basic 6.0 malware(before .NET) and I have several questions regarding the internal structure of the format. The samples I have are both p-code or native code compiled(depends on the malware version). In the last couple of days I read Alex Ionescu's paper as well as one other paper on the subject and I have a couple of questions regarding the format. Also, if you have any more resources where I can obtain additional information about the Visual Basic internal structure feel free to post them here.\n\nSo the questions are:\n\nThe first picture is a dump view of an ObjectInfo structure while the second picture is the methods array pointed to by lpMethods field. Notice the 8 zero bytes before the actual method addresses (on some other samples there are more than 8 zero bytes so it's not always that number). What I would like to know is what are those zero bytes?\n\n",
  "votes": "9",
  "answers": 1,
  "views": "624",
  "tags": [
    "file-format",
    "visual-basic"
  ],
  "user": "ubnix",
  "time": "Apr 7, 2016 at 7:30",
  "comments": [
    {
      "user": "Remko",
      "text": "Did you try VB Decompiler ? Here are two examples of modifying VB executables: - remkoweijnen.nl/blog/2013/01/02/… - remkoweijnen.nl/blog/2012/08/04/…",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "disclaimer: Since the VB file structure is still undocumented, we cannot provide guaranteed answers without fully reverse engineering the format. This has been attempted to some success by Ionescu and others as you and others have mentioned.\n\nI will attempt to answer your questions to the best of my ability without opening any reverse engineering tools. If you would like to ask how would someone go about reverse engineering the VB file format and related executables I would suggest opening another question on the subject specifically.\n\nNow, without further ado, my answers (read: educated guesses):\n\n",
      "votes": "1",
      "user": "NirIzr",
      "time": "Jun 10, 2018 at 1:24",
      "is_accepted": false,
      "comments": []
    }
  ]
}