{
  "title": "xcList of x86/x64 instructions that implicitly access registers",
  "link": "https://reverseengineering.stackexchange.com/questions/12379/xclist-of-x86-x64-instructions-that-implicitly-access-registers",
  "content": "So I am looking for a list of instructions that implicitly do stuff like reading or writing to registers. Obvious ones would be\n\npush/pop modifies esp, pushad accesses all\n\nbut I'm sure there are more. Does someone know of a comprehensive list?\n\nedit: By implicitly I mean registers that are not explicitly mentioned in the arguments or the opcode. (except eflags)\n\n",
  "votes": "5",
  "answers": 3,
  "views": "1k",
  "tags": [
    "disassembly",
    "x86"
  ],
  "user": "bernd feinman",
  "time": "Apr 8, 2016 at 16:25",
  "comments": [
    {
      "user": "Guntram Blohm",
      "text": "I think a more interesting question would be \"instructions that do NOT access registers\", with jmp being the only one I can think of right now. Conditional jumps access flags (do they count as registers?), call/ret access [er]sp, even 2 address instructions like movsb access [er]di/[er]si, and [er]cx if they include the rep prefix.",
      "time": null
    },
    {
      "user": "Guntram Blohm",
      "text": "Or, does your implicitly mean \"registers that aren't mentioned, explicitly, in the opcode/arguments\" ?",
      "time": null
    },
    {
      "user": "bernd feinman",
      "text": "Guntram Blohm yes that is exactly what I mean. :) I'll add it.",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "what's \"xcList\", by the way?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I do not know of any comprehensive list, but here (32-bit/64-bit) is a very useful reference which contains most of the information you want.\n\nNote their description of the operand columns:\n\nSo for example, in the 8-bit version of the MUL instruction (AX = AL * r/m8), they list the operands as AX, AL, and r/m8.  Note that the first two operands are italicized because they are implicit, and the first operand is bolded because it is modified.\n\nUnfortunately, this does not cover all cases of register modification.  For example, MOVSD only lists m32 and m32 for the operands and does not mention the fact that ESI and EDI are dereferenced and then adjusted by 4.\n\nStill, it covers almost all cases, including:  AAA, AAD, AAM, AAS, CBW, CDQ, CLTS, CMPXCHG, CMPXCHG8B, CPUID, CWD, CWDE, DAA, DAS, DIV, ENTER, IDIV, IMUL, IN, LAHF, LEAVE, LGDT, LIDT, LLDT, LMSW, LOOP, LOOPcc, MONITOR, MUL, OUT, POPA, PUSHA, RDMSR, RDPMC, RDTSC, RDTSCP, REP, SAHF, SALC, SGDT, WRMSR, and many of the float and SSE instructions, as well as a couple instructions that do not have mnemonics.\n\nIt does not (completely) cover some others, including:  CMPS, INS, LODS, MASKMOVDQU, MASKMOVQ, MOVS, OUTS, SCAS, STOS. Modifications to the stack pointer are generally not mentioned.\n\nIf you care about segment registers, there are also LDS, LES, LFS, LGS, LSS, and the segment prefixes.  Several other instructions can implicitly modify the segment registers, however.  Additionally, instructions that access memory implicitly access cached information from the segment registers.\n\nNote: The above are not comprehensive lists!\n\nUltimately, you need to read the Intel Manuals to get the official documentation, but this chart should still save you a lot of time.\n\n",
      "votes": "5",
      "user": "user1354557",
      "time": "Jun 17, 2016 at 14:47",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "This list is going to contain most of the instructions in the instruction set because most of the instructions modify flags or registers in some way (the 'mov' instruction being one that doesn't). The flags that are accessed for conditional jumps are stored in the EFLAGS register. You can find the information you're looking for by looking at the Intel manual - read the section on the operation of each instruction. \n\n",
      "votes": "1",
      "user": "dingo_kinznerhook",
      "time": "Apr 8, 2016 at 16:23",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Here's my attempt at the list:\n\nDAA, DAS, AAA, AAS, PUSHA, POPA, NOP, PAUSE, CBW, CWD[E], CDQ, CQO, WAIT, AAM, AAD, XLAT, JMP, LOADALL, EMMS, FINIT, CALL, RET[F], INT, INTO, RSM, PUSH, POP, ENTER, LEAVE, any FPU instruction that ends in 'P'...\n\nTo find a comprehensive list would require that you clarify the question even further.  There are instructions that modify memory using immediate values, for example.  They don't access registers, so they seem to qualify but probably not what you intend.\n\n",
      "votes": "1",
      "user": "peter ferrie",
      "time": "Apr 11, 2016 at 17:04",
      "is_accepted": false,
      "comments": []
    }
  ]
}