{
  "title": "Is it possible to debug a .Net executable with IDA?",
  "link": "https://reverseengineering.stackexchange.com/questions/12572/is-it-possible-to-debug-a-net-executable-with-ida",
  "content": "When I load a .Net executable into IDA then there is no Debug menu as when I load a normal binary. Is there any way to enable the debug functionality for .Net as well? I'd like to step into some jitted functions in order to analyse the quality (or lack thereof) of the generated native code. \n\nI know that I can do this with Visual Studio, but that is too cumbersome and unwieldy for my taste. I'd rather use my trusted IDA, which is so much better for stuff like that.\n\nI tried attaching to an running .Net exe but that didn't really get me anywhere, apart from the need for adding ReadLine() calls to the programs to make them stay around long enough.\n\nIn case it matters, on this machine I'm still using IDA 6.8 (Pro) at the moment because my antivirus - Avira - screams its little head off when I launch IDA 6.9 (on account of the plugins).\n\n",
  "votes": "2",
  "answers": 2,
  "views": "11k",
  "tags": [
    "ida",
    "debugging",
    ".net"
  ],
  "user": "DarthGizka",
  "time": "May 1, 2016 at 13:31",
  "comments": [
    {
      "user": "tmr232",
      "text": "In most cases, using a tool like dnSpy is much preferable for .Net than using regular debuggers.",
      "time": null
    },
    {
      "user": "DarthGizka",
      "text": "@tmr: Interesting, thanks! Starred and filed away for further investigation...",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "No. https://www.hex-rays.com/products/ida/debugger/index.shtml\nAsk on their support forum if you want.\n\n",
      "votes": "3",
      "user": "Vitaly Osipov",
      "time": "May 2, 2016 at 3:56",
      "is_accepted": false,
      "comments": [
        {
          "user": "DarthGizka",
          "text": "Where does that say that IDA cannot debug those Windows executables that happen to be .Net assemblies?",
          "time": null
        },
        {
          "user": "Vitaly Osipov",
          "text": "Well, surprisingly, if it doesn't list that rather significant capability, it does not have it.",
          "time": null
        }
      ]
    },
    {
      "content": "It's an old question, but maybe somebody is searching for it nowadays. Yes, IDA can do it!\n\n",
      "votes": "0",
      "user": "scopolamin",
      "time": "Apr 26, 2020 at 7:44",
      "is_accepted": false,
      "comments": [
        {
          "user": "Paweł Łukasik",
          "text": "but can it debug? Or it's just displays the IL?",
          "time": null
        },
        {
          "user": "DarthGizka",
          "text": "@ scopolamin: The links you provided only indicate the ability to disassemble .NET code at the IL level (which IDA has had for quite a while and which ildasm has given us since day 1 of .NET). The question is about the ability to debug .NET code and/or to disassemble the jitted native code, just like Pawel said.",
          "time": null
        },
        {
          "user": "scopolamin",
          "text": "Sorry, I didn't mean to make up false information.",
          "time": null
        }
      ]
    }
  ]
}