{
  "title": "Where do I find a cheap hardware USB sniffer",
  "link": "https://reverseengineering.stackexchange.com/questions/12730/where-do-i-find-a-cheap-hardware-usb-sniffer",
  "content": "I wanto to capture and then process the USB data that is sent from a computer to a USB printer.\n\nI know that there are several software sniffers like Wireshark that can do that. But I need a hardware solution that does the capture and sends the captured packets to another computer. But a Beagle is too expensive. And apart from that I need to process the captured data in my own code. It would not serve me to have a professional software that only shows me the captured packets on the screen.\n\nA comercial solution would be possible if costs less than $200.\n\nIt could also be a PCI card that is designed to capture USB signals together with an API that allows me to access the captured data.\n\nBut it would be perfect if this would be possible with a cheap USB capable hardware like any of the Arduino flavors or a Teensy and an open source library. Some of these microcontrollers support to act like USB host and client. So I suppose that they have also the capabality to just listen to the packets that go over the cable.\n\nBut I could not find any libraries for that purpose. I found sourcecode for keyloggers via PS/2 but I could not find any similar project to capture USB.\n\n\n\n",
  "votes": "10",
  "answers": 4,
  "views": "19k",
  "tags": [
    "usb",
    "arduino"
  ],
  "user": "Elmue",
  "time": "May 25, 2016 at 21:11",
  "comments": [
    {
      "user": "Dominik Antal",
      "text": "I'ld try asking on adafruit forums or on reddit. Sorry I can't help you.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "These days hardwarerecs.SE would be another place to ask these questions. But it's also on-topic here, I'd say.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Expensive commercial solutions: Beagle (400€), Ellisys (800 - 3200€), MQP, International Test Instruments (600€), Teledyne Lecroy (1000€), USBeee (1000 - 2000€).\n\nCheapest commercial solution I found : Keelog Morphstick, 125€, which is within your budget.\n\nDIY solutions:\n\nYou might also dig into \"USB over IP\".\n\n",
      "votes": "8",
      "user": "jrouquie",
      "time": "Jan 30, 2019 at 16:25",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "It doesn't quite meet your price limitation, but since nobody else had jumped in, it is probably worth mentioning:\n\nI've used various versions of the Teledyne LeCroy USB Protocol Analyzers, and they would meet your needs from a capture and download/analyze perspective. I've seen used versions of the older \"CATC USB Chief\" but they are still about 2x of your target.\n\nFrom a functionality perspective, it works like your diagram above; and it is possible to have Computer 1 and Computer 2 be the same box (you end up with two USB cables going to the PC). They are able to capture HID, mass storage, and isoc data. Although make sure you also pay attention to the USB version of your device, as the older capture hardware won't support all the new protocols / speeds.\n\n",
      "votes": "7",
      "user": "josh poley",
      "time": "May 26, 2016 at 20:10",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Another Hardware Packet Sniffer for USB is the ezSniffer ($79) 1.  It works with Full Speed and High Speed devices and there's a Python example for analysis.\n\n",
      "votes": "6",
      "user": "timecc",
      "time": "Jun 24, 2019 at 13:32",
      "is_accepted": false,
      "comments": [
        {
          "user": "NessDan",
          "text": "This has been superseded by the miniSniffer2:  bugblat.com/products/minisniff2/index.html",
          "time": null
        }
      ]
    },
    {
      "content": "My answer is slightly late, but you can check this list: https://sigrok.org/wiki/Supported_hardware#Logic_analyzers\n\nThey have support for multiple analyzers, and many of them have cheap Chinese clones. You need ones that can support >= 50 MHz sample rate.\n\nFor example, I am successfully captured FullSpeed USB (12 Mbits/sec) with Chinese Saleae Logic 16.\n\n",
      "votes": "1",
      "user": "Alexey Esaulenko",
      "time": "Oct 26, 2023 at 10:45",
      "is_accepted": false,
      "comments": [
        {
          "user": "Elmue",
          "text": "Your link points to a logic analyzer, not a USB sniffer! The only thing that I see that is related to USB is this: sigrok.org/wiki/Protocol_decoder:Usb_packet  But the page is empty. So this software seems highly unprofessional to me.",
          "time": null
        }
      ]
    }
  ]
}