{
  "title": "Thought I found serial port - broke embedded device instead! Help?",
  "link": "https://reverseengineering.stackexchange.com/questions/12812/thought-i-found-serial-port-broke-embedded-device-instead-help",
  "content": "Well another weekend has gone by and my tinkering has caused another device to (potentially) bite the dust. I've been playing around with a couple of Slingboxes, an M1 and a 500. Today was the M1. I had taken it apart (quite easily!) and poked around with my continuity and voltage probes with results as below for a few locations (see image).\n\nGnd means continuity existed between the tested part & the metal shield. The voltage in yellow is the voltage while it was plugged in. The spot in the upper left has a voltage that fluctuates somewhat erratically esp earlier on in the booting process.\n\n full size image at https://dl.dropboxusercontent.com/u/23091/m1/front.jpg\n\nI hooked up a serial to usb and ran minicom on the \"chatty\" one noted towards the top left.. and got a bunch of garbled garbage. Ran baud rate and it cycled thru various baud settings but didn't find anything that made sense.\n\n and so on. Tried the other ports as labeled, and nothing else had any \"chatter\" on minicom.\n\nAny thoughts?\n\nUpdate\nWell I started touching the read probe on various other points on the board. One chip on the right generated a few (but not lots) of random looking data. And as I was touching a the prongs of the chip on the left above the smaller shield, the LEDs on the board turned off and it stopped generating any output. Sad. It won't turn back on or do anything at this point. Can that happen just from touching two pins on a chip? \n\nAny ideas how to repair this?\n\nPretending I didn't fry the board, any ideas on what I could've done differently with minicom?\n\nThanks!\n\n",
  "votes": "5",
  "answers": 2,
  "views": "746",
  "tags": [
    "hardware",
    "serial-communication",
    "embedded",
    "integrated-circuit"
  ],
  "user": "justin",
  "time": "Jun 6, 2016 at 2:32",
  "comments": [
    {
      "user": "Spektre",
      "text": "Added also some insight to GND as measuring reference which is usually non aware of for rookies in the matter causing them a lot of headaches.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Frying your board:\n\nJust touching one single pin of a chip, or connecting it to ground over a reasonably high-resistance voltmeter, will generally not fry a board. However, there are ways to fry a board:\n\nSo, yes, this can happen, and short of identifying replacing the broken chip, there's no way to repair this. (Well, if you're lucky, you could just blow a fuse, but your board doesn't look like it has any fuses).  And in 99% of the cases replacing the board will be cheaper than the labour involved in repairing it.\n\nTo test if a signal is really a serial signal, I typically use a scope. They don't cost you an arm and a leg these days; the one I currently use is this. (I have no affiliation with them except being a satisfied customer). To qualify as a serial signal, your signal should have sharp, straight vertical edges, and the time between two raising edges will be very constant. From this time, you can determine the baud rate (for example, ~100 µs between edges => ~1 ms per 10-bit-byte (8 bits + start bit + stop bit) => 1000 bytes per second => probably 9600 baud).\n\nMy answer to this question shows what is most probably not a serial signal; this is what a serial signal looks like (source):\n\n\n\n",
      "votes": "9",
      "user": "Community",
      "time": "Apr 13, 2017 at 12:49",
      "is_accepted": true,
      "comments": [
        {
          "user": "justin",
          "text": "thanks! just out of curiosity do you see any spots on the board that might have been a hidden serial port?",
          "time": null
        },
        {
          "user": "Guntram Blohm",
          "text": "My first guess would have been the J603 jumper to the left top. There's 2 jumpers as well right to what looks like a wifi module, but with their symmetric layout next to the quartz oscillators, they're unlikely. The two things to the bottom right seem to be optional front plate connectors (speakers? Optical audio?), i'd discount them.",
          "time": null
        },
        {
          "user": "Guntram Blohm",
          "text": "The problem is that a serial port should have at least 3 pins (tx, rx, gnd), and there's nothing that looks like that. You could investigate if that isn't an SPI port. Google for the types of the chips close to it (you can't really read them in your image) and check if one of them has an SPI interface and if it's connected to that jumper.",
          "time": null
        }
      ]
    },
    {
      "content": "I had to add just a few things to have a clear mind (although the other answer is really good and got my up-vote already).\n\n[PS]\n\nIn case you did not fry the board for good (sometimes chips will recover after time when the charge accumulated in wrong places is gone) so try it in few days again. But make no mistake not fried for good does not mean undamaged. Even in cases the device will run again usually its life span is significantly reduced and often not all pins are functional as should afterwards.\n\n[Edit1] Measuring against GND\n\nThere are usually more GND types in analog/digital mixed device. usually all of them are interconnected at some point (usually very near stabilisator output) but that does not mean they have the same voltage !!!\n\n",
      "votes": "8",
      "user": "Community",
      "time": "May 23, 2017 at 12:37",
      "is_accepted": false,
      "comments": []
    }
  ]
}