{
  "title": "How would I go about imaging a propriatary flash or eeprom memory chip?",
  "link": "https://reverseengineering.stackexchange.com/questions/12873/how-would-i-go-about-imaging-a-propriatary-flash-or-eeprom-memory-chip",
  "content": "I've been playing around a lot with the xeltek reader, which lets me image various memory chips. Usually, I just use the catalog number used to get the chip's datasheet and search xelteks database for a proper adapter.\n\nBut what if I have an electronic device that uses a proprietary chip or no catalog number is given.\n\nHow would I go about making a binary image of the mystery chip in question? Is there any readily available hardware that will help do this?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "307",
  "tags": [
    "memory",
    "digital-forensics",
    "memory-dump"
  ],
  "user": "ChipsAhoy",
  "time": "Jun 17, 2016 at 14:21",
  "comments": [],
  "answers_data": [
    {
      "content": "I am no expert in the matter but that seems highly unlikely. There are 2 ways how to approach that I know of:\n\nTo make some universal HW for this you would need to have some analog multiplexors switching matrix to be able to support any pinout and then prior to use configure which pin is what (power supply, data, ...). That is more or less possible (considering voltage, current, impedance, and frequency requirements) but to use it you would need the necessary info you do not have for unknown chip anyway ...\n\nTo detect the chip first you would need to try power it up which will most likely burn any chip with wrongly selected pins... making universal detection impossible. For a group of similar chips is this possible but again you would need some info about them ...\n\n",
      "votes": "3",
      "user": "Community",
      "time": "Apr 13, 2017 at 12:49",
      "is_accepted": false,
      "comments": [
        {
          "user": "ChipsAhoy",
          "text": "Thanks for thorough response. So assuming I had an infinite supply of chips to test, would it be just trial and error?   The only pre-existing knowledge I would have about the electronic device is the 28 connector pin out that it interfaces with other electronic devices with.",
          "time": null
        },
        {
          "user": "Spektre",
          "text": "@ChipsAhoy If you got the pinout then you know which pins are power, ground, shield and interfaces so there are no guesses ... but to have minimal circuit  usually chips need few capacitors, crystal etc ... which can be deduced from PCB you are inspecting.  Then it is just matter of scanning for programing protocol ...",
          "time": null
        }
      ]
    }
  ]
}