{
  "title": "reverse-engineering to preserve old software [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/13039/reverse-engineering-to-preserve-old-software",
  "content": "first of all I am not a programmer. It's just not what I am good at. I have an old windows3.1 tts engine called Keynote Gold multimedia application that I would like to decompile and make work on a modern computer system and also on android. If I send someone the dll files could you take a look and see if it can be done, please? \n\n",
  "votes": "0",
  "answers": 2,
  "views": "187",
  "tags": [
    "windows"
  ],
  "user": "Josh Kennedy",
  "time": "8 years ago",
  "comments": [],
  "answers_data": [
    {
      "content": "Edited because I misunderstood what kind of software you were talking about.\n\nYou don't have to, just run it in a virtual machine such as QEMU, DOSBox or Virtualbox. QEMU probably the best option.\n\nPorting Windows software the way you're suggesting is generally too painful to be realistic, and virtualization provides almost perfect results with little effort.\n\nIf it is just a DLL it might be more realistic than a full software package, depending on how complex the code is. Still a lot of work, and if you want it to run on Android you still have to emulate it somehow. Payoff/work ratio very low imho.\n\n",
      "votes": "2",
      "user": "user6576405",
      "time": "Jul 15, 2016 at 8:11",
      "is_accepted": false,
      "comments": [
        {
          "user": "Josh Kennedy",
          "text": "I can use the keynote gold text to speech engine in talking dosbox inside windows 3.1 just fine. I was hoping that the windows3.1 keynote gold text to speech engine could be ported to modern windows, but I guess that won't be happening.",
          "time": null
        }
      ]
    },
    {
      "content": "You may use WINE to run or integrate a dll into your modern program.\n\n",
      "votes": "2",
      "user": "juan",
      "time": "Jul 16, 2016 at 19:01",
      "is_accepted": false,
      "comments": []
    }
  ]
}