{
  "title": "Are there any interactive decompilers besides HexRays?",
  "link": "https://reverseengineering.stackexchange.com/questions/13089/are-there-any-interactive-decompilers-besides-hexrays",
  "content": "Are there any decompilers that generate pseudo-code that is interactive? By interactive, I mean you can select a variable and rename it. Or you can select a function call and rename the function. Or you can select an instruction in the disassembly and it will take you to the equivalent line in the pseudo-code.\n\nI know that the HexRays plugin for IDA Pro can do this but are there any alternatives that also have this interactive functionality?\n\nI am looking for an interactive decompiler (meaning the output should be C-like pseudocode) - not an interactive disassembler.\n\n",
  "votes": "4",
  "answers": 6,
  "views": "10k",
  "tags": [
    "ida",
    "disassembly",
    "decompilation",
    "decompiler"
  ],
  "user": "user16797",
  "time": "Jul 20, 2016 at 0:46",
  "comments": [],
  "answers_data": [
    {
      "content": "Short answer: No, there is no other interactive decompiler, at least not for native codes.\n\nLong answer: The Hex-Rays decompiler was created with the idea of interactiveness while all the other decompilers for native code that I know (I'm not talking about Java or .NET) were created as batch tools. The closest to a half interactive decompiler is Snowman, but is not really interactive (unless selecting which function you want to decompile when using the IDA Plugin is considered interactiveness.)\n\nThere is a toy \"decompiler\" (if the name is appropriate, as it's more a translator to pseudo-C than anything else) in Hopper but is neither interactive.\n\nBoomerang, REC, and all the other abandoned decompiler projects that I know, were created either as command line batch tools or had a GUI just to let you select a binary.\n\nSo, as said at the beginning: the only interactive decompiler for native codes is the Hex-Rays one.\n\nPS: I don't know why people is not focusing in the question instead of proposing their favourite tools... A disassembler is not an interactive decompiler.\n\n",
      "votes": "9",
      "user": "joxeankoret",
      "time": "Jul 20, 2016 at 10:20",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "The plasma project seems to have an interactive decompiler: https://github.com/joelpx/plasma\n\nFrom the documentation:\n\n```\n$ plasma -i tests/server.bin\n>> v main # or v 0xFFFFFF (replace 0xFFFFFF with the address of the function)\n# You are now in visual mode. Press P to define the function. Then press TAB to decompile the function into pseudocode.\n# You can hover over a variable using your arrows keys and press R to rename a variable. You can press X to see all xrefs to the variable.\n\n```\n",
      "votes": "1",
      "user": "Community",
      "time": "Jul 21, 2016 at 7:49",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Radare2 seems to meet your requirements. It's a command line program, there's no GUI available (but there is a visual mode). It takes a bit of getting used to, I'd recommend the radare2 book to start out.\n\n",
      "votes": "0",
      "user": "PlasmaPower",
      "time": "Jul 19, 2016 at 23:20",
      "is_accepted": false,
      "comments": [
        {
          "user": "Necrolis",
          "text": "You can use the Bokken frontend for radare if a UI is a must: bokken.re/index.html",
          "time": null
        },
        {
          "user": "PlasmaPower",
          "text": "@Necrolis I thought I remembered there being a GUI for radare2, but I didn't see it in a Google search. Thanks! In general though, the CLI will be more powerful of course.",
          "time": null
        }
      ]
    },
    {
      "content": "Another interesting alternative to IDA is Medusa, its not fully complete, but may server your needs.\n\nHowever, its sounds as though you are actually after the decompiler side of things, more than just a labeled CFG, in which case you might want to look at snowman. x64dbg has a plugin that wraps snowman that might do what you need. You can also try REC, though I have never fiddled with it.\n\n",
      "votes": "0",
      "user": "Necrolis",
      "time": "Jul 19, 2016 at 23:53",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "There are some interesting decompilers from this list: http://www.capstone-engine.org/showcase.html\n\n",
      "votes": "0",
      "user": "user311703",
      "time": "Jul 20, 2016 at 1:50",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I have been there, I have made the quest.\nUse vivisect . Contribute to it! I do have binary ninja (signed up for a beta tester) and I have to say: It is nowhere near as functional as vivisect.\nBinja only has a better graph layout and few more extras on the IL side. That's all.\nVivisect had the goal of becoming IDA replacement. And is damn close. However a lot of work is still to be done.\n\n",
      "votes": "0",
      "user": "user2104110",
      "time": "Jul 20, 2016 at 10:24",
      "is_accepted": false,
      "comments": []
    }
  ]
}