{
  "title": "Restoring original stack variable accessing in IDA Pro?",
  "link": "https://reverseengineering.stackexchange.com/questions/13128/restoring-original-stack-variable-accessing-in-ida-pro",
  "content": "IDA Pro noob here. I hit a wrong key while trying it out and now some of the lines that looked like\n\n```\nlea     ecx, [esp+150h+var_13E+2]\n\n```\nnow look something like\n\n```\nlea     ecx, [esp+14h]\n\n```\nIt computed the sum of the formula to figure out the stack address, removing the stack variable name it was using. It's harder to use now. Is there a way to get back the original line?\n\n",
  "votes": "0",
  "answers": 2,
  "views": "1k",
  "tags": [
    "ida"
  ],
  "user": "djcouchycouch",
  "time": "Jul 24, 2016 at 15:22",
  "comments": [
    {
      "user": "0xec",
      "text": "Right Click or press Alt + F1 -> Manual -> Delete everything in the operand text box -> Click OK.",
      "time": null
    },
    {
      "user": "w s",
      "text": "Press <kbd>O</kbd> on 14h",
      "time": null
    },
    {
      "user": "djcouchycouch",
      "text": "Thanks for the suggestions. Unfortunately neither of them work. I had closed and reopened the project so maybe it lost the original information forever?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can use K to toggle between stackvar and numerical representations.\n\n",
      "votes": "3",
      "user": "Igor Skochinsky",
      "time": "Jul 24, 2016 at 18:43",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "If none of the solutions already provided work then it could be because the stack variable information itself was lost. You can have IDA regenerate it by undefining your function and redefining it.\n\nTo do, so, place your text cursor at the beginning of the function, press U (Undefine), then P (define Procedure).\n\nNote that this will cause IDA to lose any information you manually added to the function (stack variable names, function prototype, etc.), so only do it as a last-resort.\n\n",
      "votes": "0",
      "user": "Jason Geffner",
      "time": "Jul 24, 2016 at 18:48",
      "is_accepted": false,
      "comments": []
    }
  ]
}