{
  "title": "How to connect two Windows VMWare virtual machines over a virtual serial port for kernel debugging on a Linux host",
  "link": "https://reverseengineering.stackexchange.com/questions/13139/how-to-connect-two-windows-vmware-virtual-machines-over-a-virtual-serial-port-fo",
  "content": "The problem: Recently I had to perform a kernel debugging on two MS windows VMWare virtual machines connected via a virtual serial port, and while running on a GNU/Linux host.\n\nThe layout: GNU/Linux host with Arch Linux distribution (even though the distro does not play a crucial role in this scenario), with VMWare Workstation 11 installed, hosting two MS Windows virtual machines - MS Windows 7SP1 x64 (the DEBUGGER), and MS Windows 8.0 x64 (the DEBUGGEE).\n\nThe solution: I did quite a lot of Googling to figure this out, and there was some information here and there, but I was no able to find a solution that would work for my case.\nTherefore, I have compiled my findings and a working step-by-step approach in the solution written below. Hopefully this will be also useful for someone else as well.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "3k",
  "tags": [
    "windows",
    "debugging",
    "virtual-machines"
  ],
  "user": "lockout",
  "time": "Jul 25, 2016 at 12:30",
  "comments": [
    {
      "user": "blabb",
      "text": "this was on an old vmwareplayer  (the physical machine that hosts the vms shouldn't matter theoratically) woodmann.com/forum/…",
      "time": null
    },
    {
      "user": "lockout",
      "text": "The named socket creation differs per physical host OS. And there are differences across VMware versions with how to set up the VM (debugger) to VM (debuggee) communication.",
      "time": null
    },
    {
      "user": "Marcus",
      "text": "I followed your steps..but no output.Debugger m/c not able to connect debuggee machine.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "This is a step-by-step approach, excluding the actual host system installation, VMware setup and Virtual Machine creation, since these are rudimentary steps and anyone willing to perform kernel debugging should be capable doing.\nThe approach is split into three parts - the VM hardware settings, MS Windows configuration, and establishing a debugging session.\n\nThese steps should be enough to get the Kernel Debugging session over serial connection between two MS Windows VMs on a GNU/Linux host up and running.\n\n",
      "votes": "4",
      "user": "lockout",
      "time": "Jul 25, 2016 at 12:35",
      "is_accepted": true,
      "comments": [
        {
          "user": "Mohd Shahril",
          "text": "Thank you for the step by step explanation, it works!",
          "time": null
        }
      ]
    }
  ]
}