{
  "title": "Immunity Debugger reset windows to default tiling",
  "link": "https://reverseengineering.stackexchange.com/questions/13161/immunity-debugger-reset-windows-to-default-tiling",
  "content": "I have changed the windows from the original tiling layout in Immunity Debugger. I would like to restore the original tiling. I have tried restarting the program but the modified tiling remains. Is there a procedure for restoring the original tiling?\n\n",
  "votes": "11",
  "answers": 2,
  "views": "16k",
  "tags": [
    "immunity-debugger"
  ],
  "user": "Concklin F",
  "time": "Jul 29, 2016 at 1:36",
  "comments": [],
  "answers_data": [
    {
      "content": "I'm not sure what you mean with \"original tiling\". As far as I know Immunity just displays the CPU window initially. All the other windows are normally closed. So I would recommend to just close all windows and open View>CPU.\n\nTo \"reset\" the tiling within the CPU window. Just close all windows expect the CPU window. Minimize the CPU window manually and click Tile horizontal afterwards. Normally the tiling within the CPU window should be centered now.\n\nIn the case you want to display multiple windows and re-arrange them:\n\nUntil now, I didn't find a better solution.\n\n",
      "votes": "10",
      "user": "knx",
      "time": "Jul 29, 2016 at 15:53",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jan Wikholm",
          "text": "When you reopen CPU it is not maximized so it is easy to miss that it has the 4-way default layout (disassembly, registers, memdump and stack) inside that single panel, so this answer is clearly the correct way to go.",
          "time": null
        }
      ]
    },
    {
      "content": "The default is CPU main thread which has four panels, three of which may become hidden if you have closed it or clicked on additional windows. To get back the initial layout, close all windows, reopen with CPU Main thread and resize the edges to reveal the heap, the register panels etc. \n\n",
      "votes": "4",
      "user": "izzie",
      "time": "Jun 25, 2018 at 10:27",
      "is_accepted": false,
      "comments": []
    }
  ]
}