{
  "title": "How to import Windows DDK headers into IDA?",
  "link": "https://reverseengineering.stackexchange.com/questions/13175/how-to-import-windows-ddk-headers-into-ida",
  "content": "Currently I'm reversing a Windows driver, and there are a lot of structs IDA doesn't automatically recognize, which means I have to import them manually by parsing C header files.\n\nHowever, there are way too many nested structs/unions and I have to modify each one so IDA can parse it correctly. They go so deep, they make me spend more time on adding structs rather than actually reversing.\n\nIs there any way of doing this?\n\nI did try parsing the file I need with Ctrl+F9, but IDA doesn't understand stuff like e.g. #includes and errors, making this option impossible to use\n\n",
  "votes": "7",
  "answers": 2,
  "views": "3k",
  "tags": [
    "ida",
    "windows",
    "driver"
  ],
  "user": "rev",
  "time": "Jul 31, 2016 at 3:41",
  "comments": [],
  "answers_data": [
    {
      "content": "View->Open subviews->Type Libraries (Shift-F11), right click, Load Type Library..., wdk8_km.\n\n",
      "votes": "10",
      "user": "Igor Skochinsky",
      "time": "Jul 31, 2016 at 9:00",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Create an empty file, include whatever headers you want, add a DriverEntry and compile with debug symbols enabled and no optimization. Now load the test driver into IDA. If done correctly, All types should be available.\nYou should be able to export all types via File->Produce File->Dump typeinfo to IDC file... then load the script back File->Script File....\n\n",
      "votes": "7",
      "user": "Ahmed Abdelfattah",
      "time": "Jul 31, 2016 at 7:01",
      "is_accepted": false,
      "comments": [
        {
          "user": "rev",
          "text": "Very smart trick! This time I will go with Igor's answer but you definitely have my upvote, as that could work even if IDA doesn't support the type library I need.",
          "time": null
        }
      ]
    }
  ]
}