{
  "title": "QtNetwork in IDA's PyQt5",
  "link": "https://reverseengineering.stackexchange.com/questions/13206/qtnetwork-in-idas-pyqt5",
  "content": "I'm interested in writing a network component to my IDAPython plugin, and QtNetwork looks really attractive, however it isn't include-able from IDAPython shell.\n\nIs there a simple way to add that functionality?\n\nThanks.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "442",
  "tags": [
    "ida",
    "idapython",
    "python"
  ],
  "user": "NirIzr",
  "time": "Jan 13, 2017 at 19:31",
  "comments": [
    {
      "user": "joxeankoret",
      "text": "Isn't it better to use Python's own networking modules?",
      "time": null
    },
    {
      "user": "NirIzr",
      "text": "I'd really like qtnetwork's abitiliy to work async as part of  the entire qt signals&slots. I'm also somewhat trying to avoid having requests as a dependency",
      "time": null
    },
    {
      "user": "joxeankoret",
      "text": "I'm afraid that for doing so you will need to build yourself QT for IDA... See this: hexblog.com/?p=250",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The official response I got from hex-rays states they rather avoid shipping too many third party libraries bundled with IDA if said libraries will not be helpful for the majority of users.\n\nThey suggested compiling the necessary Qt libraries myself and bundling the resulting packages with the plugin, but unfortunately this will be a nightmare to maintain (carrying out those packages for every IDA version).\n\nAlthough using QNetwork will have some advantages (like clean async operation), my original goal was ease of maintenance and this is better achieved by using a python library like requests. That's probably the direction I'll be taking.\n\nthe full response is this:\n\nThey also went on and explained why Python/PyQt/QtWidgets.pyd are indeed shipped rather surprisingly:\n\nAnd finished by tipping off about an upcoming new minor release:\n\nNoting the complexities of bundling additional IDA-QT libraries with plugins:\n\n",
      "votes": "1",
      "user": "NirIzr",
      "time": "Aug 6, 2016 at 12:10",
      "is_accepted": true,
      "comments": []
    }
  ]
}