{
  "title": "Can benign applications have such APIs?",
  "link": "https://reverseengineering.stackexchange.com/questions/13204/can-benign-applications-have-such-apis",
  "content": "I am new to malware analysis .. and I was analyzing some 'windows' apps and found functions that I thought it exist only on malware, is this possible or there is something wrong with my analysis ? \nI am using Cuckoo sandbox .. the functions are: SetWindowsHookExA, IsDebuggerPresent .. and others as well \n\nOne of the app examples is AcroRd32.exe: \nIt calls IsDebuggerPresent .. and this is its page on virustotal including all the information related to the sample in addition to the MD5.\nhttps://www.virustotal.com/en/file/9e702e7b53f6f00e344a1cb42c63eaf4d52ed4adb5407744a654753569044555/analysis/\n\n",
  "votes": "0",
  "answers": 2,
  "views": "343",
  "tags": [
    "winapi",
    "malware",
    "benign"
  ],
  "user": "Ophilia",
  "time": "Aug 30, 2018 at 3:22",
  "comments": [
    {
      "user": "Vitaly Osipov",
      "text": "These API calls have been added by Microsoft for certain reasons they had. Obviously Microsoft didn't create them for use exclusively by malware. It's just that they are more commonly used by malware. It's a probability question.",
      "time": null
    },
    {
      "user": "Dominik Antal",
      "text": "Where did you get the idea that these functions should only be used by malware? Following your logic, why would you think Microsoft created such functions in the first place? To aid malware developers? :D",
      "time": null
    },
    {
      "user": "Ophilia",
      "text": "I a newbie to both the APIs and malware analysis .. and I don't have a full understand of both yet .. So we usually ask to learn from people like you :)",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "IsDebuggerPresent is found in most executables compiled with Visual C++ in the setup code that is executed before the main function. There are also legitimate use cases for SetWindowsHookExA, so you will often see them in clean executables.\n\n",
      "votes": "6",
      "user": "ekse",
      "time": "Aug 4, 2016 at 2:40",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Yeah, there are definitely legitimate use cases for both IsDebuggerPresent and SetWindowsHookExA common windows functions.\n\nI propose you a simple experiment you can try, take this little legitimate c++ snippet of mine:\n\n```\n#include <stdio.h>\n#include <stdlib.h>\n#include <windows.h>\n\nvoid main(int argc, char* argv[]) {\n    printf(\"Hello world  \n\");\n    while(true) {\n        printf(\"Debugger present: %d  \n\", IsDebuggerPresent());\n        Sleep(200);\n    }\n    system(\"pause\");\n}\n\n```\nBuild it with your favourite c++ windows compiler and run it. Now, take your favourite debugger, I recommend you x64dbg and try this:\n\nBy doing so, you'll understand the very basics about IsDebuggerPresents.\n\nAbout SetWindowsHookExA, I've seen it used on legit apps countless times so I can guarantee you is definitely not a microsoft function whose purpose is to be used on \"naughty\" apps :)\n\n",
      "votes": "0",
      "user": "BPL",
      "time": "Aug 30, 2018 at 13:07",
      "is_accepted": false,
      "comments": []
    }
  ]
}