{
  "title": "Malware samples to analyze with existing disassembly?",
  "link": "https://reverseengineering.stackexchange.com/questions/13256/malware-samples-to-analyze-with-existing-disassembly",
  "content": "Hopefully this question isn't get marked as Duplicate, since it differs from the following question:\nWhere can I, as an individual, get malware samples to analyze?\n\nI'm looking for samples (ideally malware) which have already been disassembled. The only useful resource which I could found so far was a dataset provided on kaggle. However, the only note how the ASM files have been generated is:\n\nMy problem:\nThere are no details about the specifice process of disassembling: I could not find any additional information if or how the disassembler considers special obfuscation mechanisms and if it could be ensured, that the files contain meaningful assembler instructions.\n\nTo recall the question: I'm looking for malware samples (windows) with the corresponding disassembly to download in bulk, which have been ideally counterchecked for meaningful instructions (e.g. constant code of the malware).\n\n",
  "votes": "0",
  "answers": 1,
  "views": "850",
  "tags": [
    "disassembly",
    "windows",
    "malware",
    "pe"
  ],
  "user": "knx",
  "time": "Apr 13, 2017 at 12:49",
  "comments": [],
  "answers_data": [
    {
      "content": "The archive of disassembled and analysed malware does not exist - at least I haven't heard of any good ones. The closest I can think of is labs files from \"Practical Malware Analysis\", at https://practicalmalwareanalysis.com/labs/. Each of the files is described and analysed in the \"Answers\" section of the book, including IIRC obfuscated samples, but actual disassembling is left as an exercise for the reader :)\n\nAnother way to achieve your goal is to look for summary articles on topics that interest you, such as https://www.virusbulletin.com/virusbulletin/2014/07/obfuscation-android-malware-and-how-fight-back (Android in this case), take hashes listed in them and download (bulk or not, up to you) samples from VirusTotal.\n\nA rather dated Windows malware analysis set of tutorials with emphasis on reversing - https://fumalwareanalysis.blogspot.com.au/p/malware-analysis-tutorials-reverse.html\n\n",
      "votes": "4",
      "user": "Vitaly Osipov",
      "time": "Aug 13, 2016 at 5:55",
      "is_accepted": true,
      "comments": []
    }
  ]
}