{
  "title": "Capture traffic of android app on unknown port",
  "link": "https://reverseengineering.stackexchange.com/questions/13335/capture-traffic-of-android-app-on-unknown-port",
  "content": "I am using ProxyDroid to proxy everything to Charles Proxy. But by default Charles proxy (or any other similar programs like Fiddler, mitmproxy, etc..) only capture traffic on common ports such as 80, 8080, 443, 8443.\n\nIf an app is using a different port then the traffic would not show up in Charles proxy. \n\nIs there anyway to know which port the app is using? Or any way around the issue?\n\n",
  "votes": "0",
  "answers": 3,
  "views": "2k",
  "tags": [
    "android",
    "proxy"
  ],
  "user": "Arya",
  "time": "Aug 21, 2016 at 17:50",
  "comments": [
    {
      "user": "majidarif",
      "text": "android is based on linux so I'm guessing lsof -i | grep \"app\" should work.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Have you checked out Burp proxy?\n\nhttps://portswigger.net/burp/proxy.html\n\nI always use Brup for any Android app, desktop app, website... and you don't even have to use ProxyDroid. \n\nConnect you mobile phone and your laptop to the same LAN and configure the Burp proxy to start listening at your private ip. Then in android wifi options you can configure the proxy settings ip and port:\n\nAfter that configure Brup proxy options under the proxy tab to stop all requests and responses. After that you don't need to know the port that you app is using, all traffic from you smartphone will be shown in Brup.\n\nhttps://support.portswigger.net/customer/en/portal/topics/718317-installing-and-configuring-burp/articles\n\nApart from that Burp have lots of features and plugins for fuzzing and other stuff, I don't know what are you trying to accomplish here but anyway this way should work for you!\n\n",
      "votes": "1",
      "user": "z4k4",
      "time": "Aug 25, 2016 at 7:04",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Packet capture is much better, allows you to log raw network traffic from specific apps on all ports.\n\nIt's free.\n\nFeatures:\n\n\n\n",
      "votes": "0",
      "user": "Kenkit",
      "time": "Sep 24, 2016 at 11:36",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "low rep so i'll post my comments here.\n\nFor BurpSuite: you'll have to modify the hosts file then on Burp Suite, listen on your target port via transparent proxy. You might have to enter all 65535 ports though.\n\nFor Packet Capture: sure it can decrypt SSL traffic. However, if Wireshark level pcap is what you are looking for, Packet Capture is still not enough.\n\n",
      "votes": "0",
      "user": "fuu_manchu_III",
      "time": "Mar 7, 2018 at 11:09",
      "is_accepted": false,
      "comments": []
    }
  ]
}