{
  "title": "Understanding FCOMP instruction and extracted value from address operand",
  "link": "https://reverseengineering.stackexchange.com/questions/13338/understanding-fcomp-instruction-and-extracted-value-from-address-operand",
  "content": "I'm trying to reverse engineer an application made in vb6. At a certain point it compares an input number to a constant number, my goal here is to extract that number, now i found where the comparison is taken place:\n\n```\nFCOMP QWORD PTR DS:[402CB0]\n\n```\nNow I understand that FCOMP Compares the contents of register ST(0) and source value. I don't know if I got this right, but from what I've read DS:[402CB0] is pointer to an address that's holding the source value, but using OllyDbg, and while navigating to that address (Ctrl + g), i found out that the value is DB 00 which is not correct\n\n\nso my question here is how can I find the real value that is being compared?\nand is it possible to make the FCOMP compare a constant to a pointer of an integer?\n\n",
  "votes": "0",
  "answers": 2,
  "views": "447",
  "tags": [
    "disassembly",
    "assembly",
    "ollydbg",
    "float"
  ],
  "user": "Ouerghi Yassine",
  "time": "Jun 17, 2020 at 9:54",
  "comments": [
    {
      "user": "Viktor",
      "text": "Use the memory view window. Read up on memory and hardware break points.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "FCOMP Compares the fpu register ST0 with a constant\nthe constant is a QWORD (Meaning DOUBLE , FLOAT , Etc 8+ bytes wide )   \n\nollydbg  can show both the ST0 register and decipher the contents of the CONSTANT . \n\nin your case if shows DB 00 because the constant is probably 0.0 .    \n\nand you have not set the dump view mode to appropriate format    \n\nthe view mode you are looking at is Disassembly (DB is Define Byte 00 is well 0x00 ) .\n\nyou may need to change the view mode  \n\nfirst select the dump window then use ctrl+g and then right click select FLOAT . \n\nollydbg also has a small window between disassembly pane and dump pane \nwhich can show both the source and destination contents   \n\nin the screen shot below \nyou can observe how 783ef8 is DB 00 in Disassembly window and FLOAT 0.0 in Dump Pane . \nyou can observe how the contents of register pane shows both the src and dest contents\nyou can observe how fpu register window shows the ST0 contents\n\n",
      "votes": "1",
      "user": "blabb",
      "time": "Aug 22, 2016 at 8:17",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Understanding the assembly line\n\nFCOMP QWORD PTR DS:[402CB0]\n\nIt checks for a qword sized operand. That is 8 bytes while your picture only shows about 3.\n\nThis comparison is also a floating point comparison, which is a bit more complex than an integer comparison.\n\nIt sets three control registers (C0, C2, C3) depending on the outcome and raises an exception if either values is NaN (could this be some kind of Anti debugging related exception?)\n\nGetting to the actual content at the time of comparison\n\nAlthough you can access the address now, it is not guaranteed the value you're looking at is the value that will end up being compared to your float.\n\nYou should make sure the debugger reaches that address when you inspect it. This can usually be done quite easily by setting a breakpoint (either software - OllyDbgv1's default or hardware - OllyDbgv2's default). Either right click on that assembly line -> Breakpoint -> Toggle or simply hit F2 while it's highlighted.\n\n",
      "votes": "1",
      "user": "NirIzr",
      "time": "Aug 22, 2016 at 12:07",
      "is_accepted": false,
      "comments": []
    }
  ]
}