{
  "title": "What is the scalability of state of the art static binary analysis techniques?",
  "link": "https://reverseengineering.stackexchange.com/questions/1338/what-is-the-scalability-of-state-of-the-art-static-binary-analysis-techniques",
  "content": "What is the largest program that has been analyzed by a semantics-based static binary analysis?\n\nBy semantics-based, I mean an analysis that examines the meaning of the program, and does not simply perform a computation on the syntax of the program, such as computing an md5sum.\n\n",
  "votes": "6",
  "answers": 1,
  "views": "266",
  "tags": [
    "static-analysis",
    "binary-analysis"
  ],
  "user": "Ed McMan",
  "time": "Mar 27, 2013 at 19:05",
  "comments": [
    {
      "user": "Andrew",
      "text": "Would you count the SAGE system from Microsoft? Also, someone should ask Veracode what the largest program they've analyzed is...",
      "time": null
    },
    {
      "user": "Ed McMan",
      "text": "@Andrew As far as I know, SAGE is completely dynamic.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The largest static analysis example I am aware of is 32,405 PPC instructions from this paper on CFG recovery.  There is no analysis performed besides recovering the CFG.\n\n",
      "votes": "4",
      "user": "Ed McMan",
      "time": "Mar 27, 2013 at 19:05",
      "is_accepted": false,
      "comments": [
        {
          "user": "Rolf Rolles",
          "text": "Is decompilation considered a static analysis?  It should be, seeing as it does not execute the program.  And in which case, Hex-Rays does bigger jobs than that every day.",
          "time": null
        },
        {
          "user": "Rolf Rolles",
          "text": "Also, in the deobfuscation example in my recent presentation [1], which is a static analysis, I have applied it to huge binaries on a very regular basis.  I think in order for this question or its answers to have any meaning, the term \"static binary analysis\" needs to be precisely defined.",
          "time": null
        },
        {
          "user": "Ed McMan",
          "text": "@Syzygy Decompilation seems like fair game to me.  The link to your presentation does not seem to work, by the way.",
          "time": null
        },
        {
          "user": "Rolf Rolles",
          "text": "Whoops ... that reference is [1] ruxconbreakpoint.com/assets/Uploads/bpx/… ;-)",
          "time": null
        },
        {
          "user": "Ed McMan",
          "text": "@Syzygy So how big is \"huge\"?",
          "time": null
        }
      ]
    }
  ]
}