{
  "title": "Is reverse engineering legal?",
  "link": "https://reverseengineering.stackexchange.com/questions/13398/is-reverse-engineering-legal",
  "content": "Few weeks ago, I started reverse engineering libraries and binaries from a commercial copyrighted product (a game). And, I would like to post the code on an open source platform like GitHub.\n\nI've searched a lot on the Internet, and found that in some cases it was legal to share the reversed-material, and in other cases illegal.\n\nIs it legal to post reverse-engineered code from a copyrighted product on an open source platform?\n\n",
  "votes": "6",
  "answers": 1,
  "views": "2k",
  "tags": [
    "decompilation",
    "law"
  ],
  "user": "Avo18",
  "time": "Dec 17, 2021 at 10:25",
  "comments": [
    {
      "user": "Abr001am",
      "text": "no it is not legal to attach the brand of that product with the slice of code, do it as unknown-sourced, besides it is suited to post such issues on meta",
      "time": null
    },
    {
      "user": "knx",
      "text": "So what do you mean with \"post the code...on github\"? Push it to a private repo for your own usage or really share it in a public repo? If it's the latter one, I am pretty sure it is not legal.",
      "time": null
    },
    {
      "user": "Abr001am",
      "text": "@avo18 pay attention to spoil the product brand and version while posting a piece of reversed code from a copyrighted source, that might get u in trouble with the publisher and it can persue the community also",
      "time": null
    },
    {
      "user": "Avo18",
      "text": "Thank you for the fast answers ;) I will do it for my own use.",
      "time": null
    },
    {
      "user": "Vitaly Osipov",
      "text": "Depends on what country you live in.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Disclaimer: IANAL. Usually the answer is “it depends.” Are you creating a derivative commercial game? Probably it is not so legal. Are you doing that to be “compatible” with that game? It's legal. Are you just researching the internals of the game? It's legal.\n\nFor example: I know people who ported game engines by reverse engineering and even copying parts by decompilation & adaptation and, except when they tried to distribute copyrighted things (libraries, graphics, etc…), it was considered legal. Also, please remember that if you're using, say, SAMBA in MacOSX/Linux or Open/LibreOffice, you're actually using code that was reverse engineered from their commercial counterparts and published in open source codes.\n\nIn short: derivative products or anything with the aim of damaging a company or getting an economic benefit, is probably not so legal. Research, compatibility and porting is.\n\n",
      "votes": "4",
      "user": "MarianD",
      "time": "Dec 17, 2021 at 10:24",
      "is_accepted": true,
      "comments": [
        {
          "user": "JimmyB",
          "text": "IANAL either. But reversing code to understand its workings/algorithms and then write your own implementation from scratch is surely different from publishing the reversed code itself.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@JimmyB: I'd say it depends again. Usually there's something called \"clean room RCE\" in such a case. I.e. the reverse engineer is a different person than the implementer of the code. So taking LibreOffice as an example someone would RCE MS Office, document the effort and write specifications etc. Someone else would then take the documentation/specification and write new code based on that. Either way if LibreOffice outright copied the GUI of MS Office for example, I'm sure they'd be in trouble. But in this case the RCE was for interoperation.",
          "time": null
        }
      ]
    }
  ]
}