{
  "title": "Why is otkloadr.WRAssembly.1 reference present in a office file?",
  "link": "https://reverseengineering.stackexchange.com/questions/13400/why-is-otkloadr-wrassembly-1-reference-present-in-a-office-file",
  "content": "I was working with a RTF file and I found the string \"otkloadr.WRAssembly.1\" present inside the file in plain sight.\n\nI know that many exploits use this for loading the msvcr71.dll (non-ASLR module).\n\nMy suspicion is the file I'm working with is malicious. Does this have any good use inside a office file or is just plain malicious?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "437",
  "tags": [
    "malware",
    "exploit",
    "software-security",
    "msvc"
  ],
  "user": "rebel87",
  "time": "Sep 3, 2016 at 7:13",
  "comments": [],
  "answers_data": [
    {
      "content": "Since RTF is a mostly textual file format, noticing plaintext strings in it is not unheard of, and shouldn't be treated as cause for suspicion. \n\notkloadr.dll is a library used for Visual Studio / office integration, as part of a package called \"Microsoft Visual Studio Tools for the Microsoft Office System\".\n\nThat package is used to incorporate Visual Studio components inside Office documents (such as rtf files), and to generate/manipulate Office files programmatically from within Microsoft development environments.\n\nIt might be used in an rtf document generated automatically directly by Microsoft-provided development tools or by a third party tool using Microsoft's office integration library (most third party office related manipulation tools are using this internally, and usually simply provide a different interface, probably in a different programming language).\n\nIt might also be used in an rtf using one of the advanced features \"Microsoft Visual Studio Tools for the Microsoft Office System\" brought into Office, or was converted from a newer format that did.\n\nInspecting the file format is needed to reach these conclusions with a higher degree of certainty. Since RTF is as mentioned a textual format this shouldn't be too complicated. Additionally, googling for RTF file parser yields multiple promising results.\n\n",
      "votes": "3",
      "user": "NirIzr",
      "time": "Sep 2, 2016 at 18:59",
      "is_accepted": true,
      "comments": []
    }
  ]
}