{
  "title": "Tools to work cooperatively on the same binary",
  "link": "https://reverseengineering.stackexchange.com/questions/1347/tools-to-work-cooperatively-on-the-same-binary",
  "content": "What's a working tool/methodology to work cooperatively on the same binary (if possible in parallel), that is proven to work?\n\nI used various methods long ago to share information with others, but not in parallel:\n\nHowever, none of these were really efficient. I am looking for better methodologies and tools for collaborative work.\n\n",
  "votes": "27",
  "answers": 6,
  "views": "3k",
  "tags": [
    "tools",
    "disassembly",
    "static-analysis",
    "ida"
  ],
  "user": "Ange",
  "time": "Apr 17, 2013 at 3:00",
  "comments": [
    {
      "user": "asheeshr",
      "text": "You should separate the suggestions from the question and post them as an answer (as they actually answer the question).",
      "time": null
    },
    {
      "user": "Guntram Blohm",
      "text": "@AsheeshR: The poster is supposed to show some insight into the topic/research done. Listing possible answers and explaining that/why they're unsatisfactory is exactly that.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Just to expand on @ange's answer, IDA Toolbag is a lightweight solution for collaboration using their \"Queues\" feature. I have tested that it does work, and I believe it provides all the features you mentioned in your question.\n\n\n\n\n\n",
      "votes": "17",
      "user": "Mick",
      "time": "Mar 28, 2013 at 14:57",
      "is_accepted": true,
      "comments": [
        {
          "user": "fileoffset",
          "text": "Do you know if the other users need to have the exact same version of IDA? Are there many issues using it, or does it work exactly as expected? - Just curious, I've always wanted a good collaboration tool for IDA, the Toolbag looks really promising...",
          "time": null
        }
      ]
    },
    {
      "content": "potential (but untested) suggestions:\n\n",
      "votes": "17",
      "user": "Ange",
      "time": "Mar 28, 2013 at 9:44",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Dexter is a static android application analysis tool, which has collaboration features. For more information here is their first public talk about this tool: SIGINT12 - Android Analysis Framework.\n\n",
      "votes": "5",
      "user": "samuirai",
      "time": "Mar 28, 2013 at 14:45",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I'ld like to add these tools to the list :\n\nRelated whitepaper.\n\n",
      "votes": "3",
      "user": "Dominik Antal",
      "time": "Dec 4, 2014 at 14:23",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "A new tool that's actively developed on github is IDArling (Previously called IDAConnect). According to its developers, Alexandre Adamskiand and Joffrey Guilbon, it's inspired by SolIDArity (which made some noise in 2016 but was never released) and other projects.\n\nIt is an IDA python project that although according to maintainers is still a work in progress, already gained a small user base and is quite functional and useable nowadays.\n\nUnlike a lot of other projects, (at least for now, 4th quarter of 2018) it sees commits on a daily/weekly basis. It was also awarded with first prize in 2018's IDA plugin contest.\n\nI have not yet had the pleasure of using it.\n\n",
      "votes": "3",
      "user": "hairlessbear",
      "time": "Jan 17, 2019 at 7:04",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I don't see Ghidra in the lists in the other answers, probably because this question was asked in 2013, and Ghidra has only more recently been made available to the public.\n\nGhidra comes with built-in cooperative working tools. Each user who wishes to cooperate on a reverse engineering project would connect to Ghidra server. This is a simple server that can be run on any computer that these Ghidra users can all access. It provides network storage for the shared project too. It controls user access, provides file versioning, and supports check in, check out and version history. Quite neat.\n\n",
      "votes": "2",
      "user": "auspicious99",
      "time": "May 4, 2020 at 1:48",
      "is_accepted": false,
      "comments": []
    }
  ]
}