{
  "title": "Allwinner Camera Reversing: Compiling V4L [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/13478/allwinner-camera-reversing-compiling-v4l",
  "content": "I've reverse engineered quite a bit of action cameras based on Allwinner's poorly documented chipset.\n\nIt runs firmware closely related to H3, in fact I can compile a kernel that boots with no video from this source: https://github.com/friendlyarm/h3_lichee (using crane-sdv config)\n\nAfter getting ext2 working I would like to compile v4l utils for this system. This way I can record video with MY parameters using the adb command line.\n\nSo my question is how can I do this? I don't have the tiny android source code although it appears based on 4.2.2 sans java. The rootfs is only 20MB but it has the full v4l2 system. \n\nI tried cross compiling with linaro against the /system/lib folder of rootfs but I can't run v4l-ctl, it says file not found.\n\nmore info on the fw is here:https://dashcamtalk.com/forum/threads/hacking-q3h-allwinner-v3-camdroid.20507/\n\nWhat do I try next?\n\nCompiled stuff wasn't running because I had to use the android ndk so it can use the correct linker.\n\nyou can proceed to kick the question back out on your technicality boys, thanks for the non-help\n\n",
  "votes": "-1",
  "answers": 0,
  "views": "666",
  "tags": [
    "linux",
    "kernel-mode",
    "patch-reversing"
  ],
  "user": "gamut",
  "time": "8 years ago",
  "comments": [
    {
      "user": "NirIzr",
      "text": "Your question seems to be more about compiling than reverse engineering",
      "time": null
    },
    {
      "user": "gamut",
      "text": "the other reverse engineering was done already. I binary patched the main application and libs as was documented.",
      "time": null
    },
    {
      "user": "NirIzr",
      "text": "Sorry, I pointed that out to suggest other Stack Exchange sites might be a better fit for this type of questions.",
      "time": null
    },
    {
      "user": "gamut",
      "text": "I tried to ask before about getting ext2 working with similar/incomplete kernel tree and they had no clue over in unix. I figured it out myself and how to boot off of SD card fully... just in that case vold won't mount external sd and I can't record.",
      "time": null
    },
    {
      "user": "gamut",
      "text": "wow, thanks guys for the wonderful help and just kicking my question out because you couldn't answer it. Nice technicality by the way.  Compiled stuff wasn't running because I had to use the android ndk so it can use the correct linker. Now I need to figure out how to get around the missing libraries but no point in asking here, I'll just get my question tossed.",
      "time": null
    }
  ],
  "answers_data": []
}