{
  "title": "Reverse engineering camera blobs in Android [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/13498/reverse-engineering-camera-blobs-in-android",
  "content": "So I heard that bacon (OnePlus One) got the camera working on custom ROMs by reverse engineering the camera blobs. I tried reading online, but I didn't have a proper link for this matter.\n\nSo the problem is the following, I'm owning the Sony Xperia Z3 Compact (codename \"aries\"), which stopped receiving Android updates (starting from Nougat), but in terms of custom ROMs based on CM or AOSP, the camera is not working. The device trees and the other files can be found on the freexperia github (https://github.com/sonyxperiadev?tab=repositories).\n\nReading the posts on XDA Developers I came across someone who claimed that by doing reverse engineering on the camera blobs, the camera might start working.\n\nSo my question is: are there any methods or tutorials regarding reverse engineering? Or any solutions for the problem that I asked earlier.\n\nThanks!\n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "android",
    "development"
  ],
  "user": "Dorian Diaconu",
  "time": "8 years ago",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "There are no tutorials for this specific task (whatever it is). Ask the person who suggested it what exactly they mean and how to do it.",
      "time": null
    },
    {
      "user": "Dorian Diaconu",
      "text": "The person that said about this is not answering their messages...so...",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "It is unlikely you will find any tutorials, and  even if you found one to get started with something simple it may take a couple of years to learn the basics.\n\nThat said, reverse-engineering the blobs is probably unnecessary; if the driver is in Sony's kernel tree, that's all you will need, just compile a new kernel and it will work, and if it's not, then you can try to extract the old kernel's driver and patch the kernel version in it so that it loads in the new kernel, that's likely to work in most camera drivers as the surface area for incompatibilities isn't that big (partly because they don't use Video4Linux).\n\n",
      "votes": "0",
      "user": "Ismael Luceno",
      "time": "Sep 18, 2016 at 18:03",
      "is_accepted": false,
      "comments": [
        {
          "user": "Dorian Diaconu",
          "text": "We never had a working kernel that didn't have reverse fish eye camera effect on custom ROMs, either CyanogenMod or AOSP. The camera on stock kernel is protected by DRM keys.",
          "time": null
        },
        {
          "user": "Ismael Luceno",
          "text": "One thing is to get the camera working on something that's linked against GPL code and another is to violate someone copyright just because it's easy...",
          "time": null
        },
        {
          "user": "Ismael Luceno",
          "text": "What I mean is that generally the image correction isn't part of the driver, and you don't need it anyway.",
          "time": null
        },
        {
          "user": "Ismael Luceno",
          "text": "If the camera works, you can fix the image yourself, you can characterize the deformation e.g. with a pattern printed on paper, then build a transformation to fix it, then work on the color distortion.",
          "time": null
        }
      ]
    }
  ]
}