{
  "title": "Tools for Windows 10 hiberfil.sys file analysis",
  "link": "https://reverseengineering.stackexchange.com/questions/13700/tools-for-windows-10-hiberfil-sys-file-analysis",
  "content": "As I know Rekall and Volatility don't support Windows 10 hiberfil.sys analysis. Corresponding issue marked with Win 8/Win 10 is still opened.  \n\nIs there any tools (free, paid, open source, any) that able to reconstruct address space or unpack hiberfil.sys file to plain binary form?  \n\n",
  "votes": "3",
  "answers": 2,
  "views": "7k",
  "tags": [
    "memory",
    "digital-forensics"
  ],
  "user": "Nikita",
  "time": "Oct 11, 2016 at 21:39",
  "comments": [
    {
      "user": "user423430",
      "text": "$400 arsenalrecon.com/apps/hibernation-recon source: forensicswiki.org/wiki/Hiberfil.sys",
      "time": null
    },
    {
      "user": "Matthias Braun",
      "text": "Hibr2Bin seems to support Windows 10.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "We recently added a \"Free Mode\" to Hibernation Recon which will extract the active contents from your Windows hibernation files (legacy or modern formats) into physical memory dumps. You will also get statistics related to the various kinds of slack within the hiberfil.sys files and interesting NTFS metadata within both active contents and slack.\n\nHere's a direct download link:\n\nhttps://arsenalrecon.com/apps/download/HibernationRecon_1.1.0.55_Beta.zip\n\nSome screenshots and more information here:\n\nhttps://arsenalrecon.com/apps/hibernation-recon/\n\nWe'll post updates @ArsenalArmed.\n\n",
      "votes": "2",
      "user": "Mark Spencer",
      "time": "Mar 10, 2017 at 14:18",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "It looks like the commercial EnCase Forensics supports Windows 10 to some extent since version 7.12 (they're now at 8). You might want to check it out with them.\n\nThe Moonsols Windows Memory Toolkit has an utility called \"hibr2bin.exe\" that is able to convert windows8 hibernation files to raw dumps, those should be similar to windows10's, so they have a good chance of working.\n\nAdditionally, I encountered this message from more than a year ago:\n\nyou might want to hit him up.\n\n",
      "votes": "1",
      "user": "NirIzr",
      "time": "Oct 11, 2016 at 22:10",
      "is_accepted": false,
      "comments": [
        {
          "user": "Nikita",
          "text": "No, EnCase doesn't support it and I didn't find any EnScript to do that. Link to Moonsols looks strange, in description information about support up to Windows 7. I've googled a bit, Moonsols is still owned by Matt Suiche.",
          "time": null
        },
        {
          "user": "Nikita",
          "text": "Mentioned Volatility issue was merged into Issue #25 and unfortunately it still opened.",
          "time": null
        },
        {
          "user": "NirIzr",
          "text": "Thanks for the corrections, edited. I linked to that issue solely for the message I quoted.",
          "time": null
        },
        {
          "user": "NirIzr",
          "text": "@Nikita In the past I've reverse engineered one of VMWare's file formats for volatility, so I'm guessing it won't be too hard to do for hibernation files.",
          "time": null
        }
      ]
    }
  ]
}