{
  "title": "What is *(_BYTE *), __usercall, eax and edi [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/13703/what-is-byte-usercall-eax-and-edi",
  "content": "I am trying to understand some algorithm of how the thing works. Here is the function I got from decompiling my executable with Hey Rays. \n\nI want to run this function to see the result and then understand how it works.\n\nSo the first thing I want to know what all the signature of this function means?\n\n```\n__usercall sub_401960<eax>(int a1<edi>)\n__usercall\neax and diamond <>\nedi and diamond <>\n\n```\nThen I want to know what these things mean:\n\n```\n*(_BYTE *)\n\n```\nand \n\n```\n__security_cookie\n\n```\nand what they're doing in the following code:\n\n```\n#include <stdio.h>\n#include <stdlib.h>\n\n\nint __usercall sub_401960<eax>(int a1<edi>)\n{\n  int result; // eax@1\n  signed int v2; // esi@1\n  char v3; // cl@2\n  char v4; // cl@3\n  char v5; // cl@8\n  char v6; // cl@9\n  char v7; // cl@14\n  char v8; // cl@15\n  char v9; // cl@20\n  char v10; // cl@21\n\n  result = 0;\n  v2 = 0;\n  do\n  {\n    v3 = *(_BYTE *)(v2 + a1);\n    if ( (unsigned __int8)(v3 - 48) > 9u )\n    {\n      if ( (unsigned __int8)(v3 - 97) > 5u )\n      {\n        if ( (unsigned __int8)(v3 - 65) > 5u )\n          return result;\n        v4 = v3 - 55;\n      }\n      else\n      {\n        v4 = v3 - 87;\n      }\n    }\n...\n  return result;\n}\n\n```\nSorry if I've asked such newbie question\n\nWhat I want is to run the thing!\n\n",
  "votes": "2",
  "answers": 2,
  "views": "9k",
  "tags": [
    "ida",
    "assembly",
    "c",
    "hexrays"
  ],
  "user": "alexey polusov",
  "time": "8 years ago",
  "comments": [],
  "answers_data": [
    {
      "content": "First, OP mentioned several times he'd like to execute the function. Which should be pretty easy using a debugger (IDA has decent debugging capabilities, or you could give ollydbg a try)\n\nI'll answer the questions in the order in which they appear:\n\n__usercall is a \"virtual calling convention\" in IDA. This is not a real world calling convention, but instead it let an IDA user to specifically describe how parameters are passed to the function. This is particularly useful when parameters are passed in some unconventional way, and you can't use either __stdcall, __fastcall, etc.\n\nThe diamond wrapped register names in the prototype are used in __usercall to assign a specific register to that variable (or return address) in the function's body.\n\nThe prototype you've got (__usercall sub_401960<eax>(int a1<edi>)) means the return value is placed in eax and a1 is passed to the function in edi.\n\nThis actually has two distinctive parts, evaluated one after the other.\n\nFirst, (_BYTE *) casts a value or a register to be a byte pointer. This is similar to assigning the value to a C variable which is defined as byte *.\n\nSecond, * dereferences the address and retrieves the value in that address, value is assumed to be of the type of the pointer, in our case _BYTE.\n\nThis is plain C syntax, read more about it online. Good C understanding is very beneficial to reverse engineers.\n\n__security_cookie is a variable defined in Microsoft's Visual Studio's compiler when stack canaries are used as stack protections. These are variables that are set to a specific (non deterministic) value at the start of the function, and are validated for the same value when the function ends.\n\nThis is done to make sure no one managed to overflow a buffer defined in the function's stack, and overwrote return addresses. Because such an overflow must also override the __security_cookie which has an unknown value.\n\n",
      "votes": "4",
      "user": "NirIzr",
      "time": "Oct 12, 2016 at 15:25",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "*(BYTE *) means take a byte from the pointer provided in address \n\nif address is 12345678 and it holds  hello \n\nthen  x = *(byte *) (12345678 + counter) if counter is 0 \nx will be 'h' and so on\n\nthe truncated part  checks for [0..9a..eA..E] and returns either 0 (result \nor 10,9,8,7,6 to v4\ndon't see any reference to __security_cookie in Your query     \n\nbut if you were asking in general what it meant then you should read about stack canaries , stack smashing protection , gscookie etc \n\nit is a part of implementation to protect against stack / buffer overflow exploits / vulnerabilities\n\n",
      "votes": "0",
      "user": "blabb",
      "time": "Oct 12, 2016 at 11:46",
      "is_accepted": false,
      "comments": []
    }
  ]
}