{
  "title": "Getting pydbg working on windows 10",
  "link": "https://reverseengineering.stackexchange.com/questions/13761/getting-pydbg-working-on-windows-10",
  "content": "I downloaded the paimei tool and dropped the pydbg package files inside .../paimai/pydbg then installed paimei but I can't seem to get pydbg to work. I keep getting an error with pydasm when trying to import pydbg. Any tips?\n\nI have python 2.7 on windows 10.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "2k",
  "tags": [
    "tools",
    "debuggers",
    "python"
  ],
  "user": "Nitro",
  "time": "Oct 20, 2016 at 6:24",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "what error? we can't see your screen from here.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Are you sure you installed pydasm properly? pydasm cannot be automatically installed by pip, so most installations of dependent software will just assume it is installed when in their own installation process as well as when executing.\n\nThis explains how libdasm and pydasm can be compiled and installed on windows. This provides a prebuilt package and shows how to properly install it, together with additional scripts you seem to be using.\n\nIt is not too clear from your question, but it might be the case that the missing package is pydbg, depends on how I interpret your text.\nIf that's the case, the second aforementioned link also describes how pydbg can be installed, and additionally google is your friend.\n\nIf these links does not work, providing the output of pip freeze will be a good start of additional info.\n\n",
      "votes": "1",
      "user": "NirIzr",
      "time": "Oct 20, 2016 at 2:05",
      "is_accepted": true,
      "comments": [
        {
          "user": "Nitro",
          "text": "Sorry for the vague question I was at work when I posted it and didn't have my personal laptop on me. I deleted everything and followed the steps in the second link you posted and it worked! Must have been the old pydasm.pyd file that came with pydbg.",
          "time": null
        },
        {
          "user": "NirIzr",
          "text": "no worries, glad I could help :)",
          "time": null
        }
      ]
    }
  ]
}