{
  "title": "Am I seeing this dll's innards correctly? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/13898/am-i-seeing-this-dlls-innards-correctly",
  "content": "The dll in question is custom, from a retail/consumer software package that was first offered for sale in 2006/2007. I am fairly confident that it was compiled with Visual Studio .NET (2003).\n\nMy initial attempts to understand the dll had me test-driving various proxy dll code generators. I was able to extract the exported functions (nearly 800 of them), and the code would build. Unfortunately the retail software would reject this dll because of some mismatched signature that I was eventually able to ascertain with the corflags.exe VS utility. Eventually it became clear that my version of Visual Studio was too modern to ever match this, and after some hair-pulling I acquired VS2003. Finding that it can never install properly on modern windows, I dug Windows XP out of a closet, and I now have a VM with which to build the proxy dll... signature matches, new errors are showing.\n\nIt's complaining that it can't load a type, which it names. I was under the impression that the proxy dll generator was taking care of this. Spent some time making sure it wasn't missing anything, and it doesn't appear to be.\n\nBut the dll is built with CLR/.NET 1.1, which is slightly strange. So I downloaded IntelliJ's dotpeek decompiler. Sure enough, this brings up a relatively small handful of classes and structs that I haven't seen before. It even shows me the c# sharp code for this (variable names don't look like decompiled/disassembled stuff... does dotnet not strip these during compilation?).\n\nSo now I have a dll that looks as if it has both cpp and cs code in it both. Is that a valid/viable dll build result? I have yet to find any instructions, tutorials, or documentation that suggests this is now possible or ever was. But quite a few microsoft.com and msdn forum links are dead, so this is difficult to research. I feel as if I must be misinterpreting what I'm seeing, and that my amateurish attempts are just confusing me.\n\nIf this was ever a thing, can someone tell me what buzzwords it was called by? My Microsoft jargon is pretty limited, and I'm finding a whole bunch of nothing.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "94",
  "tags": [
    "windows",
    "decompilation",
    "dll",
    ".net",
    "c#"
  ],
  "user": "John O",
  "time": "8 years ago",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "pretty confusing question, but sounds like you're dealing with a CLR/native (or \"mixed\") DLL: msdn.microsoft.com/en-us/library/x0w2664k",
      "time": null
    },
    {
      "user": "John O",
      "text": "@IgorSkochinsky My apologies. Do I need to delete this question or edit it?",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "Edit with more details",
      "time": null
    }
  ],
  "answers_data": []
}