{
  "title": "OllyDbg: How to set conditional breakpoint on a register value?",
  "link": "https://reverseengineering.stackexchange.com/questions/13969/ollydbg-how-to-set-conditional-breakpoint-on-a-register-value",
  "content": "I want to set a breakpoint when the register EAX references a specific Unicode string, e.g. \"Enter\". In Ollydbg there is usually right beside the EAX value a string that says \"ASCII: Enter \".\n\nI read that I have to use Olly v1.10 for this purpose. When I go to \"Debug\" -> \"Set Condition\" I can write in the text field \"Condition is TRUE\" for instance this:\n\n```\nEAX == 00000010\n\n```\nI press F9 (Run) and the breakpoint will work. So once EAX becomes 0x10 olly will stop. However when I do this:\n\n```\nUNICODE[EAX] == \"Enter\"\n\n```\nit doesn't work. What am I doing wrong? Doesn't matter which program I use and which Olly version, I can't get this to work. I would like to match strings like \"Enter text\" as well, so any appearance of \"Enter\".\n\nIn the end I'm basically looking for a way to stop olly once a specific string is loaded into RAM. How can I achieve this?\n\nAny help is appreciated. Thanks!\n\n",
  "votes": "2",
  "answers": 2,
  "views": "10k",
  "tags": [
    "disassembly",
    "ollydbg",
    "strings",
    "breakpoint"
  ],
  "user": "Chris",
  "time": "Nov 17, 2016 at 23:16",
  "comments": [],
  "answers_data": [
    {
      "content": "there is a slight syntax change between 1.1 and 2.01 the square are compulsory even when not dereferencing   \n\nso to have a condition where eax points to unicode string you need a condition like   \n\n[UNICODE EAX] == \"what\"\n\nsuppose you have code like this \n\n```\n#include <stdio.h>\n#include <windows.h>\nwchar_t *strings[] = { L\"is this what\", L\"does it matter\", L\"what is this\",\n  L\"who are you\", L\"why am i doing this\", L\"lest scoot from here\"\n};\nPWCHAR foo (int a) {\n  return strings[a];\n}\nint main(void ) {\n  for(int i=5;i>=0;i--) {\n    printf(\"%S  \n\",foo(i));\n  }\n  return 0;\n}\n\n```\nsetting a break as shown in screenshot will break correctly in 2.01\n\n\n",
      "votes": "1",
      "user": "blabb",
      "time": "Nov 18, 2016 at 14:31",
      "is_accepted": true,
      "comments": [
        {
          "user": "Chris",
          "text": "Where did you set the breakpoint in Olly 2.01? Did you typed [UNICODE EAX] == \"what\" in \"Trace\" -> \"Set Condition\" -> \"Condition 1 is true\" ? Still not working for me.",
          "time": null
        },
        {
          "user": "Chris",
          "text": "Just to clarify: I don't want to set a breakpoint on a specific address (in your example 00DF1295) and check EAX value changes. I want to look for a specific string once it is loaded for the first time in the register EAX (or in any register actually).",
          "time": null
        },
        {
          "user": "blabb",
          "text": "tracing condition is not breakpoint condition that is a seperate question breakpoints are always tied to some instruction pointer  while tracing eax can hold anything from 0 to 2^31 in a 32 bit machine per instruction  you cannot read the memory of eax if eax = 0 or for that matter any unreadable memory address  please post a seperate question",
          "time": null
        }
      ]
    },
    {
      "content": "It's possible to set a conditional breakpoint in both OllyDbg 1.01 and 2.00\nFor example in Olly 2, by pressing Shift+F2 you can type your condition UNICODE [EAX] ==  \"Enter\" in the dialog box.\nIf the debugger doesn't break on the condition you can check the values of EAX by setting a conditional log breakpoint(Shift+F4). set the settings like shown:\n\n\nNow while the program is running and you are waiting to break here, open the log window and check what are the values in EAX and why the debugger is not breaking.\n\n",
      "votes": "0",
      "user": "Jango",
      "time": "Nov 18, 2016 at 12:30",
      "is_accepted": false,
      "comments": [
        {
          "user": "Chris",
          "text": "When I press SHIFT+F2 I can only set a breakpoint on a specific address. But I don't want to do that. I want Olly to stop once a specific ASCII, e.g. \"what\", is loaded into the register EAX (it can be any place/address in the program). So Olly needs to run over the whole program and not just one address like 001A74EF in your example.",
          "time": null
        },
        {
          "user": "Jango",
          "text": "If your specific string is hardcoded in the program you can find it in dump and set a breakpoint on it. Otherwise you should break on all the commands that load something in EAX either using MOV or LEA or...",
          "time": null
        }
      ]
    }
  ]
}