{
  "title": "IDA Pro does not recognize function",
  "link": "https://reverseengineering.stackexchange.com/questions/13966/ida-pro-does-not-recognize-function",
  "content": "I am reversing a program with IDA Pro, but for some reason it cannot recognize a function inside the text section.\n\nCan someone show me how to reformat the codes (in the figure) as a function?\n\n\n\n",
  "votes": "3",
  "answers": 2,
  "views": "8k",
  "tags": [
    "ida"
  ],
  "user": "SieuTruc",
  "time": "Nov 17, 2016 at 21:25",
  "comments": [],
  "answers_data": [
    {
      "content": "I experienced this error when function body contained some embedded data; it is normal for assembler code, but I never saw such technique with high level language, so code packers/obfuscators embed data pieces in code segment as anti-disassembling measure.\n\nWhen unused random data appears in code, IDA can not detect function borders automatically. \n\nSo, in such obfuscated code, instead of Create function (or press P) at the function start you can use Set function end (or press E) at function end, and IDA will create function from last \"non-function\" code start to current function. From my experience, this way may work with P at the beginning of obfuscated function doesn't work.\n\n",
      "votes": "3",
      "user": "Vitalii",
      "time": "Aug 13, 2019 at 6:57",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "You should be able to go to encrypt_String and press P\n\n",
      "votes": "2",
      "user": "broadway",
      "time": "Nov 17, 2016 at 21:20",
      "is_accepted": false,
      "comments": [
        {
          "user": "w s",
          "text": "and if it doesn't work you should see an error message in the Output window, probably with the understandable reason why.",
          "time": null
        },
        {
          "user": "SieuTruc",
          "text": ".text:026AFB5C: The function has undefined instruction/data at the specified address. Your request has been put in the autoanalysis queue. ??? i do not understand ? nothing happened later",
          "time": null
        },
        {
          "user": "w s",
          "text": "@SieuTruc It looks like that IDA didn't recognize the data at this address (0x026AFB5C) as code . Save the database for backup and go to this address, and press <kbd>U</kbd> to undefine whatever it is there and then <kbd>C</kbd> , which will convert this data to code. After that press <kbd>P</kbd> on the start of the function again.",
          "time": null
        }
      ]
    }
  ]
}