{
  "title": "What syntax does OllyDbg follow in its dissassembly window?",
  "link": "https://reverseengineering.stackexchange.com/questions/14007/what-syntax-does-ollydbg-follow-in-its-dissassembly-window",
  "content": "I have some understanding of Assembly after reading some tutorials and a few chapters from the \"PC Assembly Book\". Right now, I am trying to understand the instructions I see in OllyDbg, but it seems to follow a different syntax than the NASM syntax I am used to.\n\nThis OllyDbg instruction for example doesn't seem intuitive to me, especially the PTR SS: part.\n\n```\nMOV DWORD PTR SS:[ESP+8],EBX\n\n```\nI am not looking for an explanation of this particular construct, but rather a documentation for the whole syntax. How can I find that?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "427",
  "tags": [
    "disassembly",
    "assembly",
    "ollydbg"
  ],
  "user": "Helmy",
  "time": "Nov 21, 2016 at 8:53",
  "comments": [
    {
      "user": "Jongware",
      "text": "\"The PTR SS: part\" is not a separate part at all.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "OllyDbg uses the MASM/Intel syntax for disassembly. You can get the basic documentation at http://www.cs.virginia.edu/~evans/cs216/guides/x86.html. The Intel developer manuals can give you more detail about what specific instructions do and what segments mean (in your case the memory location [ESP+8] uses the SS segment).\n\nOn Windows user mode it is safe to ignore all segments (SS:[ESP+8] means exactly the same as DS:[ESP+8]), only the FS (32 bit) and GS (64 bit) segments have a meaning. See this page for more information.\n\nA good resource is Basics of Assembler by Lena151 it should get you up to speed if you're not familiar with (dis)assembly. In x64dbg you can get brief descriptions and the relevant intel manual section for every instruction with a click of the mouse which might come in handy too.\n\n",
      "votes": "3",
      "user": "mrexodia",
      "time": "Nov 21, 2016 at 9:53",
      "is_accepted": true,
      "comments": []
    }
  ]
}