{
  "title": "The Nokia CA-50 cable has a longer USB port. Does it hide any kind of chip?",
  "link": "https://reverseengineering.stackexchange.com/questions/14029/the-nokia-ca-50-cable-has-a-longer-usb-port-does-it-hide-any-kind-of-chip",
  "content": "Here's the attached image: \n(source: gsmsolutions.ie)\n\nThe CA-50 was used by Nokia to program newer phones. Nokia phones from around 2008-2011 feature this port for flashing.\n\nI noticed the USB side is unusually longer. It is even bigger than the USB pen drive I hold. Does it hide any kind of microchip beneath it?\n\n",
  "votes": "1",
  "answers": 3,
  "views": "1k",
  "tags": [
    "disassembly",
    "windows",
    "hardware",
    "usb",
    "vulnerability-analysis"
  ],
  "user": "Shubham Deshmukh",
  "time": "Jun 17, 2020 at 9:54",
  "comments": [
    {
      "user": "ratchet freak",
      "text": "if you don't mind losing the cable you can cut it open and see ;)",
      "time": null
    },
    {
      "user": "Shubham Deshmukh",
      "text": "Ok, I did just that, and it does contain some circuitry, it looks exactly like the image at this link. The cable, when connected without  any device at the other end, is detected by the computer as a serial communication port. I think this circuit is something designed by Nokia to help reduce additional circuitry on the phones that can be connected, and they work only with the Nokia PC Suite. Any brighter minds here might crack the code on its real purpose.",
      "time": null
    },
    {
      "user": "ratchet freak",
      "text": "You aren't really going to get much more info from the hardware given that it's a little magic COB.",
      "time": null
    },
    {
      "user": "Shubham Deshmukh",
      "text": "Yeah, maybe. And it is a cheap knock-off too. The original Nokia cable has  different internals, not a COB but SSOP. Luckily, I just found a site with the same discussion here, the cable I've cut looks exactly like this on the inside.",
      "time": null
    },
    {
      "user": "Shubham Deshmukh",
      "text": "I am yet to understand its original purpose.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Older Nokia phones use a serial (db-9) cable so if this cable supports flashing it likely includes a usb to serial converter (eg ftdi chip)\n\n",
      "votes": "2",
      "user": "Remko",
      "time": "Nov 27, 2016 at 10:02",
      "is_accepted": false,
      "comments": [
        {
          "user": "Shubham Deshmukh",
          "text": "Why exactly is serial converting needed when the USB itself transfers serially?",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "@ShubhamDeshmukh USB does not use the UART protocol",
          "time": null
        }
      ]
    },
    {
      "content": "If there is any chip inside the cable, it will use the 5v line as power supply. So, you have to measure resistance from gnd to 5v and compare it with another cable. Usually, the resistance is so high it's undetectable by a normal tester, and this also means there's nothing more than wire and plastic inside (for sure in any normal device).\nAlso, make sure to measure resistance backwards and forwards (I mean, swap the probes), because it is a semiconductor.\n\nYou can measure also the data pair.\n\n",
      "votes": "1",
      "user": "Alex",
      "time": "Nov 23, 2016 at 20:06",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "The USB cable might have contained a chip to handle some special I/O, but I don't think it was anything special.  In fact, there is a third party cable with a smaller male USB end which appears to work as intended.\n\n\n\n",
      "votes": "0",
      "user": "JAL",
      "time": "Nov 23, 2016 at 4:50",
      "is_accepted": false,
      "comments": []
    }
  ]
}