{
  "title": "Is there something like DVWA (Damn Vulnerable Web Application) for reverse engineering?",
  "link": "https://reverseengineering.stackexchange.com/questions/14170/is-there-something-like-dvwa-damn-vulnerable-web-application-for-reverse-engin",
  "content": "I am learning reverse engineering, and would like a way to try out methods I'm learning. \n\nIn web security, the way to try out and learn methods is a thing called DVWA. It is an insecure web app made for web security people to exploit. \n\nIs there something like this for reverse engineering?\n\n",
  "votes": "6",
  "answers": 1,
  "views": "982",
  "tags": [
    "decompilation"
  ],
  "user": "anonmous",
  "time": "Dec 14, 2016 at 18:40",
  "comments": [],
  "answers_data": [
    {
      "content": "You can try your hand at analyzing programs which are used to introduce reverse engineering concepts in academia such the binaries available for download at RPI's \"Modern Binary Exploitation\" course page at http://security.cs.rpi.edu/courses/binexp-spring2015/ in the sections titled \"Tools and Basic Reverse Engineering\", \"Extended Reverse Engineering\" and \"Reverse Engineering Lab\". I believe the 11 or so crackmes included in the challenges.zip file are similar to the IOLI crackme files, for which there are many tutorials available.\n\nOne of the binaries in the bombs.zip file is called \"cmubomb\" which is Carnegie Mellon University's binary bomb, also available at their student lab site http://csapp.cs.cmu.edu/2e/labs.html, for which there are also many tutorials across the web. \n\nNYU also has some reverse engineering \"challenge applications\" to analyze at https://github.com/isislab/Hack-Night#workshop-materials-5.\n\nNote: The binaries from the aforementioned sources are Linux ELF 32-bit executables. Almost all are unstripped. If you would like to analyze Windows binaries, you can get Win32 versions of the IOLI crackmes from https://github.com/radare/radare2book/tree/master/crackmes/ioli. The IOLI-crackme.tar.gz file available for download there contains 10 Windows PE32 executable files. \n\nUpdate: The CMU labs, including the binary bomb, now require an Instructor account to download.\n\n",
      "votes": "6",
      "user": "julian",
      "time": "Dec 15, 2016 at 4:02",
      "is_accepted": true,
      "comments": [
        {
          "user": "julian",
          "text": "if crackmes.de is ever back up you can check the crackmes available there, as well",
          "time": null
        },
        {
          "user": "anonmous",
          "text": "I looked up crackmes.de, and found these. tuts4you.com/download.php?list.61 Of course, download with caution. Password are \"tuts4you\"",
          "time": null
        },
        {
          "user": "julian",
          "text": "you can also look at root-me.org/en/Challenges/Cracking, as well as wechall.net/index.php/?mo=WeChall&me=Challs and challenges.re",
          "time": null
        },
        {
          "user": "blabb",
          "text": "There was full zip of binaries of the erstwhile reverse engineering academy by dr thorsten schneider along with an iso of damn vulnerable linux  codebreakers-journal.com which you may check out",
          "time": null
        },
        {
          "user": "Jay",
          "text": "+1 for the l5 CGME, !!",
          "time": null
        }
      ]
    }
  ]
}