{
  "title": "Write own obfuscator in Python [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/14246/write-own-obfuscator-in-python",
  "content": "I want to create my own, static obfuscator for any executables. What is the best way to do it with python? How should I start or what sources should I learn to do it? Anyon can give me some tips or links connected with this topic?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "1k",
  "tags": [
    "python"
  ],
  "user": "Developus",
  "time": "8 years ago",
  "comments": [],
  "answers_data": [
    {
      "content": "You should start with reading documents.\nYour problem definition is too broad to be covered by reading sources of already existing solutions. \n\nHere is the reading list (unfortunately, it is far from being covering the whole problem) \n\nAfter reading this you'll be able to search for more fine-grained information.\n\nThe most approachable methodology to deal with the issue is using LLVM.\nLLVM has python bindings that probably can be used for this.\nThere are some works related to obfuscation with this methodology, but none of them has complete solution in python, for example\n\nYour question is actually huge, and I'm far from covering the topic.\nHowever this topic is very interesting, and I wish you good luck with that :)\n\nUPDATE: \n\nAs it appears from comments the topic starter wants to write as a starter something similar to UPX, which looks much simpler.\n\nHere is a list of links that may be helpful for that:\n\nI'd suggest to learn PE format first, and read the code of UPX.\n\n",
      "votes": "2",
      "user": "w s",
      "time": "Dec 26, 2016 at 11:39",
      "is_accepted": true,
      "comments": [
        {
          "user": "Developus",
          "text": "Thanks so much. I know that question is too broad. I want to create an obfuscator for PE files first. Platform architecure is x64. So at the beginning I should understand the form I want to obfuscate and then go deepper? I'm interesting in RE, but in practical side I decided to create something like UPX packer.",
          "time": null
        },
        {
          "user": "w s",
          "text": "You need to understand the form (PE) - or you'll not be able to create a valid executable, the platform (x64) - or you'll not be able to add something meaningful to the executable, and you need to choose specific obfuscating transformations set to apply. UPX, by the way, is not obfuscator, but packer: it scrambles and archives IAT and the original code and AFIK unpacks it prior to the execution.",
          "time": null
        },
        {
          "user": "Developus",
          "text": "So maybe at the begining, write own packer instead of obfuscator would be simpler? I should try same way - learn PE format and go step by step through your list?",
          "time": null
        },
        {
          "user": "w s",
          "text": "I'll update the answer",
          "time": null
        }
      ]
    }
  ]
}