{
  "title": "How to switch to \"Graph View\" in IDA Pro while debugging with WinDbg inside a system DLL?",
  "link": "https://reverseengineering.stackexchange.com/questions/14264/how-to-switch-to-graph-view-in-ida-pro-while-debugging-with-windbg-inside-a-sy",
  "content": "While debugging inside a loaded exe process (using IDA Pro as a disassembler, and WinDbg as a debugger) I can right click the code view and select Graph view:\n\n\n\nThat will switch it to this nice code-flow view that is much easier to read:\n\n\n\nBut if I step into a system DLL (in this case mshtml.dll) I can't seem to get that same Graph view command, and instead I get this generic view:\n\n\n\nSo I was wondering, if there's a way to enable Graph view for a system DLL as well?\n\n",
  "votes": "6",
  "answers": 1,
  "views": "29k",
  "tags": [
    "ida",
    "disassembly",
    "windows",
    "debuggers"
  ],
  "user": "c00000fd",
  "time": "Dec 28, 2016 at 6:24",
  "comments": [],
  "answers_data": [
    {
      "content": "IDA can only display functions in graph mode, so in order to see that code as a graph, you must:\n\nSearch for a prologue, such as push ebp, mov ebp, esp1, and find the start of the function. If it gets hard, you can always load debug symbols2 and find the start like that.\n\n1: Actually, most Microsoft DLLs are compiled with the hotpatch option, which means that the prologue is prefixed with mov edi, edi (here's why), so searching for that instruction should be very easy.\n\n2: In the WinDbg command line, write .symfix to fix the symbols path and .reload /f mshtml.dll to reload the symbols for that module. Alternatively, go to Debugger -> Debugger windows -> Modules list, find mshtml.dll in the window, right-click it and choose \"Load debug symbols\". Then, simply use the Functions window or the status bar to find the start of the function.\n\nPut the cursor at the start, and press P. Now press Space and you'll be in graph mode!\n\n",
      "votes": "11",
      "user": "Martin",
      "time": "Dec 29, 2016 at 19:59",
      "is_accepted": true,
      "comments": [
        {
          "user": "c00000fd",
          "text": "Thanks for the info. What I didn't realize is that it takes Ida Pro some time before \"Graph view\" option becomes available, i.e. it evidently needs to scan the module after symbols are loaded. After that it will work just fine!",
          "time": null
        }
      ]
    }
  ]
}