{
  "title": "Basic Buffer Overflow Help",
  "link": "https://reverseengineering.stackexchange.com/questions/14944/basic-buffer-overflow-help",
  "content": "I am currently practicing for a CTF competition and one of the practice challenges is a buffer overflow exploit. Before this challenge I knew absolutely nothing about these exploits, but I've been reading into them and trying to understand the basics.\n\n```\n#include <stdio.h>\n#include <string.h>\n#include <stdlib.h>\n\nvoid win(void)\n{\n    system(\"cat flag.txt\");\n    return;\n}\n\n\nint main(int argc, char *argv[])\n{\n    printf(\"Give me some data:   \n\");\n    fflush(stdout);\n    char buffer[32];\n    gets(buffer);\n    printf(\"You entered %s  \n\", buffer);\n    fflush(stdout);\n    return 0;\n}\n\n```\nSo what I know so far is that I need to redirect to the win() function and that there is a buffer of 32 characters. I broke down the program into assembly and found that the win() function's address is 0x080484fd. After that, I connected to the program's server and typed 32 characters and the function's address. The program only returned my input, and did not redirect to the win() function. I did some more reading and tried doing it from another shell with the command:\n\n```\nsudo python -c 'print \"a\"*32 + \"\\x08\\x04\\x84\\xfd\"' >& /dev/pts/2\n\n```\nSadly, this did not get me to the win() function. What am I doing wrong? I've hit a total block and not sure what else to try. Any advice and help would be greatly appreciated.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "2k",
  "tags": [
    "c",
    "exploit",
    "buffer-overflow"
  ],
  "user": "Mayo",
  "time": "Mar 19, 2017 at 13:53",
  "comments": [
    {
      "user": "julian",
      "text": "have you read Smashing The Stack For Fun And Profit? it may help you think about how to approach this challenge. Also, have you tried using GDB to step through your code to see exactly what is happening? PS if your system is little-endian then memory addresses in the payload need to be written in little-endian fashion",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You're doing well, with a little bit help you can exploit this program. First, let's look at stack layout for Linux (i assume it is Linux because of sudo and it is more common than other Unix-like OSes).\n\n\n\nold-EIP is not immediately after our buffer.\n\nI compiled your program in my 32-bit Linux Mint and as you can see\nGCC throw security warning.\n\n\n\nLets, prepare our exploit.\n\n\n\nSegmentation fault, most probably EIP tried to execute wrong address. (Maybe because it is a CTF :)\n\n\nProgram crashed again:\n\n\n\nYou can see we overwritten old-EBP value before old-EIP. We just need to find function symbol and smack the stack (old-EIP) value with that address.\n\n\n\nI hope it made things little more clear for you.\n\nLittle security warning for you: Do not use sudo unless you need it.\n\n",
      "votes": "4",
      "user": "Kerim Can Kalıpcıoğlu",
      "time": "Dec 5, 2020 at 19:07",
      "is_accepted": true,
      "comments": []
    }
  ]
}