{
  "title": "How to assemble back a disassembled ChunkSpy LUA?",
  "link": "https://reverseengineering.stackexchange.com/questions/14974/how-to-assemble-back-a-disassembled-chunkspy-lua",
  "content": "Is it possible to assemble back the ChunkSpy's dissembled LUA files? Here's an example:\n\n```\n0B50  05000000           [001] getglobal  0   0        ; script\n0B54  C63E0000           [002] gettable   0   0   251  ; \"reload\"\n0B58  81000001           [003] loadk      1   2        ; \"player/common.lua\"\n0B5C  59000100           [004] call       0   2   1  \n\n```\n(And this is how it's actually supposed to look like.)\n\n```\nscript.reload(\"player/common.lua\")\n\n```\nI tried to use Unluac and Luadec for files I want to decompile, but ChunkSpy is the only program that manages to open them. And these 3 tools are the ones I can use eventually, since all other tools were designed to work with LUB versions 5.1, 5.2 or 5.3. But, the version of my files is 5.0.2. I've searched everywhere for any suggestions about my problem, but I couldn't find anything. \n\nDespite the fact that the needed program may not even exist, and absolutely nothing can't be done with these LUB files, I still would like to know, why Unluac and Luadec fail at decompiling those files, while ChunkSpy doesn't have any problems with them?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "assembly",
    "decompile",
    "byte-code"
  ],
  "user": "EnderMan1997",
  "time": "Mar 21, 2017 at 15:14",
  "comments": [],
  "answers_data": [
    {
      "content": "You don't. From the ChunckSpy website:\n\nAs for your other question\n\nPlease note that this is hardly an reverse engineering question and very specific to the internal structure of the mentioned projects. You may be better off posting to the project maintainers themselves.\n\nFrom the Unluac site:\n\nFrom the LuaDec site:\n\n",
      "votes": "1",
      "user": "Nordwald",
      "time": "Mar 23, 2017 at 6:23",
      "is_accepted": true,
      "comments": []
    }
  ]
}