{
  "title": "What exactly is a SIM card?",
  "link": "https://reverseengineering.stackexchange.com/questions/14975/what-exactly-is-a-sim-card",
  "content": "Does a SIM card consist of only Flash memory or is there a microprocessor inside as well?\n\n",
  "votes": "-3",
  "answers": 1,
  "views": "479",
  "tags": [
    "memory",
    "embedded"
  ],
  "user": "Vishal Sharma",
  "time": "Mar 21, 2017 at 16:10",
  "comments": [
    {
      "user": "julian",
      "text": "My answer was incorrect. It has been updated.",
      "time": null
    },
    {
      "user": "phuclv",
      "text": "How does this related to reverse engineering?",
      "time": null
    },
    {
      "user": "phuclv",
      "text": "@SDsolar first post or not isn't an explanantion for it on this site. It's off topic and this should be on electronics.stackexchange.com",
      "time": null
    },
    {
      "user": "perror",
      "text": "I'm voting to close this question as off-topic because it is about regular hardware usage.",
      "time": null
    },
    {
      "user": "Vishal Sharma",
      "text": "This question can be closed if that's the wish of the majority. I don't have any problem because I've already asked the question at the right forum (as was suggested).",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Correction: \n\nThank you Igor Skochinsky for the correction.\n\nAccording to Karsten Nohl's presentation \"Mobile Network Attack Evolution\", SIM cards contain an embedded real-time operating system, a filesystem and a Java VM :\n\n\n\n\n\nHere is a direct link to the presentation: https://www.slideshare.net/phdays/140521karsten-nohl-phdmobileattackevolution-35161629\n\nSee also: 4G Security: Hacking USB Modem and SIM Card via SMS\n\n\n",
      "votes": "2",
      "user": "julian",
      "time": "Mar 22, 2017 at 14:53",
      "is_accepted": false,
      "comments": [
        {
          "user": "SDsolar",
          "text": "Excellent information.  I recently bought a $10 gadget called a \"SIM card reader\" but it shows nothing when I plug it into the USB port.  I suppose it must require some fancy software to  make all this work, eh?",
          "time": null
        },
        {
          "user": "julian",
          "text": "I don't know but I'm sure that someone else here will. Maybe post a question about it?",
          "time": null
        },
        {
          "user": "Vishal Sharma",
          "text": "Thanks for the info. However I'd like to know a few more things: 1. Since which generation did the SIM cards start to have a microprocessor? I mean, was it after 2G, 3G or 4G?   2. Mainly which microprocessor is used in the SIMs?",
          "time": null
        },
        {
          "user": "julian",
          "text": "http://simhacks.github.io/sim-cards/",
          "time": null
        },
        {
          "user": "Vishal Sharma",
          "text": "I couldn't find anywhere explicitly written that SIM cards contain microprocessor. Why do you think we don't have info about the microprocessors being used in our modern SIM cards like we have in the case of smartphones?",
          "time": null
        }
      ]
    }
  ]
}