{
  "title": "How does a SIM card work?",
  "link": "https://reverseengineering.stackexchange.com/questions/15011/how-does-a-sim-card-work",
  "content": "I understand that a SIM card has memory, and that some or maybe all of them also include microprocessors.  \n\nThey act as peripherals that are more than just flash memory.\n\nI would like to be able to read the contents and extract my contacts and messages, for backup, so I bought an el-cheapo \"SIM Card Reader\" that plugs into a USB port.  But when I plug it in it is as if it isn't even there.  \n\nSo how can I get access to the data?\n\nSecondly, I understand that they can affect the baseband portion of the cellphone, including frequency of operation and whatever codes are necessary to identify itself (IMEI) and to access a particular network (T-Mobile, AT&T, Verizen).  Again, it is clearly more than just flash memory.\n\nSo my question is, how exactly do they work, and how can I read the data from my phone's card?\n\n",
  "votes": "15",
  "answers": 2,
  "views": "7k",
  "tags": [
    "firmware",
    "memory"
  ],
  "user": "SDsolar",
  "time": "May 14, 2018 at 17:00",
  "comments": [],
  "answers_data": [
    {
      "content": "SIMs card are a type of Universal Integrated Circuit Card (UICC).\n\nAccording to Karsten Nohl's presentation \"Mobile Network Attack Evolution\", SIM cards contain an embedded real-time operating system, a filesystem and a Java VM:\n\n\n\nHere is the technical specification for UICCs, which describes exactly how they work: \n\nETSI TS 102 221 V8.2.0 (2009-06)\nTechnical Specification for smart cards, the UICC-Terminal interface and physical and logical characteristics.\n\nThis DefCon presentation \"DEF CON 21 - Karl Koscher and Eric Butler - The Secret Life of SIM Cards\" video explains quite a bit about SIM cards and how to interface with them.\n\nFrom the presentation slides:\n\n\n\nThey also had trouble:\n\n\n\nThey found SIM Alliance Loader software...\n\n\n\n...but decided to use GlobalPlatform instead, which is far more complicated. In order to use GlobalPlatform to interface with the SIM card, the presenters drew on techniques presented in Karsten Nohl's research.\n\n",
      "votes": "17",
      "user": "julian",
      "time": "Mar 26, 2017 at 3:54",
      "is_accepted": true,
      "comments": [
        {
          "user": "SDsolar",
          "text": "Thank you, @SYS_V - I really appreciate you explaining this.  It isn't nearly as easy as reading a regular SD card at all.       (btw, cool handle -  I was trained on ATT System V also)",
          "time": null
        },
        {
          "user": "julian",
          "text": "@SDsolar opensecuritytraining.info/SmartCards.html",
          "time": null
        }
      ]
    },
    {
      "content": "Found some good answers in this article:\n\nWhat Is A SIM Card (And What Comes Next)? (howtogeek.com)\n\nEXCERPT:\n\n",
      "votes": "1",
      "user": "SDsolar",
      "time": "Jun 1, 2018 at 19:41",
      "is_accepted": false,
      "comments": []
    }
  ]
}