{
  "title": "Reverse engineer an old DOS QBasic executable",
  "link": "https://reverseengineering.stackexchange.com/questions/1503/reverse-engineer-an-old-dos-qbasic-executable",
  "content": "I recently decided to try my hand at reverse engineer an old DOS text based game that was coded in QBasic.\n\nI found some info online about old DOS games disassembly but mostly for Wacom compiled C/C++ binaries, but nothing on QBasic. I know that getting the original Basic code is probably impossible, but going disassembling the file with nasm I didn't get any useful info either...\n\nAny pointers?\n\n",
  "votes": "13",
  "answers": 3,
  "views": "9k",
  "tags": [
    "disassembly",
    "decompilation",
    "x86",
    "binary-analysis",
    "dos-exe"
  ],
  "user": "ricardojoaoreis",
  "time": "Apr 2, 2013 at 21:15",
  "comments": [],
  "answers_data": [
    {
      "content": "",
      "votes": "9",
      "user": "Ange",
      "time": "Apr 2, 2013 at 17:15",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Apparently a decompiler for DOS Basic executables already exists.\n\nGoing by examples from that page, quite a lot of the code can be recovered. I guess it used some form of P-code, or there was some additional metadata.\n\nDescriptions of the decompiler's error messages can give some hints about various functions implemented by the Basic runtime.\n\n",
      "votes": "9",
      "user": "Igor Skochinsky",
      "time": "Apr 2, 2013 at 17:51",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I found the debug-enabled builds a bit unwieldy. But I found the combination of DOSBox and IDA quite nice using idados. It's an IDA Pro plugin which allows you to control the debugger of a debug-enabled DOSBox build from within IDA similar to how you can control a debuggee running one of the other supported remote debuggers.\n\nGiven the existing answer by Igor this is of course like using a kitchen knife instead of a scalpel, but I thought I should mention it, as it is a more generic method for reversing DOS programs.\n\nNB: There used to be an even older, but I think unrelated, plugin of the same name which hasn't been maintained by its original author. I still have a copy of it on my disk (at home), but the website seems to no longer exist.\n\n",
      "votes": "5",
      "user": "0xC0000022L",
      "time": "Apr 2, 2013 at 19:39",
      "is_accepted": false,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "Well, the decompiler I mention is not public so there's nothing wrong with the good old debugging.",
          "time": null
        }
      ]
    }
  ]
}