{
  "title": "Safe way to download a malware payload?",
  "link": "https://reverseengineering.stackexchange.com/questions/15067/safe-way-to-download-a-malware-payload",
  "content": "I'm trying to analyze a piece of malware that is most-likely a downloader. During dynamic analysis on an isolated VM network, Wireshark registered a GET request to a server for what I believe is the payload (a .bin file).\n\nWhat is a safe way to download the payload? Is there a tool that will allow me to replicate only the GET request? I do not want to run the malware connected to the internet.\n\nThanks\n\n",
  "votes": "5",
  "answers": 2,
  "views": "916",
  "tags": [
    "windows",
    "malware"
  ],
  "user": "qwersjc",
  "time": "Apr 2, 2017 at 7:53",
  "comments": [
    {
      "user": "blabb",
      "text": "Leech the url and use wget , curl to download it ?",
      "time": null
    },
    {
      "user": "julian",
      "text": "use wget + torsocks",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "This sounds like a straightforward question at first glance, but may prove a little more complicated at second thought.\n\nBefore we go into how to retrieve the payload, I should highlight the importance of backing up your machine and taking extra precautions. Running malware, even inside a VM, is a dangerous business. Tread safely.\n\nThe safest way will probably be using wget or a similar tool to download the payload. There are plenty of ways to download an asset. There are even some tools that let you \"replay\" a .pcap (network capture) file as if the HTTP client is connected to the original server, but that does not sound like what you're looking for.\n\nHowever downloading the manually payload from a different computer might not be the best way to do what you're trying to do, for several reasons:\n\n",
      "votes": "5",
      "user": "Community",
      "time": "May 23, 2017 at 12:37",
      "is_accepted": true,
      "comments": [
        {
          "user": "SDsolar",
          "text": "And keep good backups of your system before doing this.",
          "time": null
        },
        {
          "user": "NirIzr",
          "text": "Yes. That's important. I'll add that!",
          "time": null
        },
        {
          "user": "qwersjc",
          "text": "Thanks for the great answer, it's very helpful to know the details.",
          "time": null
        }
      ]
    },
    {
      "content": "If you've got the GET reply captured in the wireshark session, then I'd suggest you to just extract the binary from it. This also way you also avoid situations where downloader uses some kind of challenge/response or time-based protocol which means second attempt with the same URL would fail or it was a fast-flux or hijacked server which could be down by the time you get to trying the download again.\n\n",
      "votes": "2",
      "user": "Igor Skochinsky",
      "time": "Apr 3, 2017 at 18:54",
      "is_accepted": false,
      "comments": []
    }
  ]
}