{
  "title": "Fixing dump files in ida",
  "link": "https://reverseengineering.stackexchange.com/questions/15117/fixing-dump-files-in-ida",
  "content": "ive recently dumped a few mem page sections of a possibly malicious dll. However, I can't analyze the files correctly since i don't know how to allign all the sections correctly for analysis at once in IDA. I can analyze them individually but many values are displayed in red under names like v123456789. Can someone guide me in the right direction? \n\n",
  "votes": "0",
  "answers": 1,
  "views": "3k",
  "tags": [
    "ida",
    "dumping"
  ],
  "user": "Bob Bobby",
  "time": "Apr 7, 2017 at 2:30",
  "comments": [
    {
      "user": "Nordwald",
      "text": "If you can, dump the complete memory region of the dll, it'll save some trouble",
      "time": null
    },
    {
      "user": "Bob Bobby",
      "text": "Unfortunately, this isn't possible as it seems that the module gets split and mapped into different parts of the process upon injection.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "If that is not possible, load any of them in IDA and go to File -> Load file -> Additional binary file to load each file one after another. After selecting the file, IDA will display the following dialog:\n\n\n\nHere you have to make sure that each part is loaded at the right offset.\n\n",
      "votes": "2",
      "user": "Nordwald",
      "time": "Apr 7, 2017 at 10:21",
      "is_accepted": false,
      "comments": [
        {
          "user": "Bob Bobby",
          "text": "I have been doing this, however, my issue is trying to find the correct offset to load the next section at.",
          "time": null
        },
        {
          "user": "Nordwald",
          "text": "@BobBobby I'm sorry, I'm afraid there is not much you could do about it other than regenerating the dumps with annotated offsets. There is no way for IDA to know how to align them.",
          "time": null
        },
        {
          "user": "Bob Bobby",
          "text": "What do you mean by annotated offsets? Sorry if this is a stupid question, I'm sort of new to using IDA",
          "time": null
        },
        {
          "user": "Nordwald",
          "text": "@BobBobby The term offset refers to their starting address in memory (e.g. page at 0x40000 should be loaded at that address)",
          "time": null
        },
        {
          "user": "Bob Bobby",
          "text": "Okay thanks, sorry for misunderstanding. Do you know how I could go about finding the correct loading segment offset for loading the next bin file though?",
          "time": null
        }
      ]
    }
  ]
}