{
  "title": "Why the program can't write to specific memory area",
  "link": "https://reverseengineering.stackexchange.com/questions/15127/why-the-program-cant-write-to-specific-memory-area",
  "content": "I am working on Lab13-01.exe from \"Practical Malware Analysis\" (you can download it from here).\n\nWhen I run it without debuggers in my VMWare it runs without errors.\n\nI started to analyze it with OllyDbg 2.01.\n\nThere is some point in the code that it receives exception and I don't understand why.\n\nIt has resource that contains encoded string:  \n\n```\nLLLKIZXORXZWVZWLZI^ZUZWBHRHXTV\n\n```\nThis resource is saved at address 0x408060\nAt 0x4011C1 it overwrites the first byte of the string with AL (0x77):\n\n```\nMOV BYTE PTR DS:[ECX], AL\n\n```\nThen I received:\n\n\n\nWhen I press Shift+Run/Step, it succeed to run.\n\nThere number of things I don't understand here.\n\n",
  "votes": "1",
  "answers": 2,
  "views": "1k",
  "tags": [
    "ollydbg",
    "exception"
  ],
  "user": "E235",
  "time": "Apr 8, 2017 at 12:06",
  "comments": [
    {
      "user": "blabb",
      "text": "Probably virtual protected against write access and trapping the exception for handling differently based on presence or absence of debugger follow the exception chain and single step. The handler",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "did you check if it installs an exception handler which catches the exception?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I went to the memory map window.\nI searched for the memory address range for 408060.\nIt  was under .rsrc (Resources).\nIt had only read permissions, I set it with write permissions too and now it works:  \n\n\n\n",
      "votes": "1",
      "user": "E235",
      "time": "Apr 10, 2017 at 10:51",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "It could easily be that it is code/data segregation.  \n\nIn Windows it is called Data Execution Protection.  \n\nA lot of malware will load their code as if it were data, then maybe rewrite it after decryption, then attempt to execute it.  \n\nDEP should always be on, but for purposes of this demonstration maybe you could turn it off and see if you get different results.  \n\nThen turn it back on.\n\n",
      "votes": "0",
      "user": "SDsolar",
      "time": "Apr 10, 2017 at 6:05",
      "is_accepted": false,
      "comments": [
        {
          "user": "E235",
          "text": "I checked with Pestudio and DEP is off. See printscreen here: imgur.com/dzaCXmR",
          "time": null
        }
      ]
    }
  ]
}