{
  "title": "Incorrect semicolon usage in decompiled variables",
  "link": "https://reverseengineering.stackexchange.com/questions/15140/incorrect-semicolon-usage-in-decompiled-variables",
  "content": "My problem is: hexrays thinks that semicolon is visible character. \nIn IDAPython idaapi.is_visible_char(';') returns True\n\nIn picture you can see \"field_100C;\" highlighted, but \"field_100C\" not highlighted.\n\n\n\nIn ida.cfg I have following NameChars (this is ARM LE):\nNameChars =\n        \"_0123456789\"\n        \"ABCDEFGHIJKLMNOPQRSTUVWXYZ\"\n        \"abcdefghijklmnopqrstuvwxyz\";  \n\nIn any other NameChars array semicolon is not added.\nSo, how can this behaviour get fixed? Is there idapython call of some sorts? Can plugins be a reason for this? Is there GUI option to check?\n\nFound this, but it didnt help\nhttps://www.hex-rays.com/products/ida/support/sdkdoc/name_8hpp.html\n\n",
  "votes": "-1",
  "answers": 2,
  "views": "236",
  "tags": [
    "ida",
    "ida-plugin"
  ],
  "user": "mizari",
  "time": "Apr 11, 2017 at 11:01",
  "comments": [
    {
      "user": "Nordwald",
      "text": "Did you consider contacting support? Usually the hex-rays guys won't tear off your head for bug reports. The fix should be easy",
      "time": null
    },
    {
      "user": "mizari",
      "text": "Unfortunately I can't, idb is NDA'ed",
      "time": null
    },
    {
      "user": "Nordwald",
      "text": "Thats unfortunate, but it should be quiet easy to construct a minimal example showing this bug? It seems like something which just slipped between the cracks in Q&A.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I did try to come up with a minimal example myself and I couldn't reproduce the bug above:\n\n\n\nIt boils down to what you are selecting:\n\n\n\nThe default behavior seems to select the word you click on, omitting trailing characters like ;. But if I select the string manually (here: *v3;) only occurrences of this exact string are highlighted,\n\nIf you can provide any additional information, please disclose it. I'm afraid it can not be helped otherwise. Can you maybe come up with a minimal example exhibiting the bug?\n\n",
      "votes": "1",
      "user": "Nordwald",
      "time": "Apr 11, 2017 at 13:25",
      "is_accepted": false,
      "comments": [
        {
          "user": "mizari",
          "text": "It's not that I can't provide additional info, more like there's nothing more to add.   I cant come up with example for bug, I just dont know whats wrong.   The question is more about how to remove ';' from NameChars from IDA itself, not from .cfg",
          "time": null
        }
      ]
    },
    {
      "content": "Still don't know what was the root of the problem, but PC restart helped...\n';' stopped magically appearing in NameChars array.\n\n",
      "votes": "0",
      "user": "mizari",
      "time": "Apr 13, 2017 at 7:41",
      "is_accepted": true,
      "comments": []
    }
  ]
}