{
  "title": "Is there any websites to get malware files using YARA rules?",
  "link": "https://reverseengineering.stackexchange.com/questions/15146/is-there-any-websites-to-get-malware-files-using-yara-rules",
  "content": "I want to know, Is there any websites which has malware files (Windows OS) that are detected by YARA rules?\n\nNote: I know some websites to get android malware samples using YARA.\nBut, I need Windows OS based malware.\n\n",
  "votes": "5",
  "answers": 3,
  "views": "865",
  "tags": [
    "windows",
    "malware",
    "yara"
  ],
  "user": "xoreax",
  "time": "Aug 27, 2018 at 23:10",
  "comments": [],
  "answers_data": [
    {
      "content": "An additional source of such samples, which I don't know why nobody listed, is virustotal.com. It lets you execute what they call \"ruleset\" and \"retrohunt\" searches which are basically running yara rules on every sample processed through virustotal and every sample from the last 3 months. This is a paid service but it's definitely worth it.\n\nHere's an image that shows the retro-hunt and yara search web UI:\n\n\n\n",
      "votes": "6",
      "user": "NirIzr",
      "time": "Apr 12, 2017 at 19:37",
      "is_accepted": true,
      "comments": [
        {
          "user": "knx",
          "text": "I'm curious - is it possible to obtain the yara rules to use it \"offline\" ?",
          "time": null
        },
        {
          "user": "NirIzr",
          "text": "There are online yara rule repositories. This is one example: github.com/Yara-Rules/rules",
          "time": null
        },
        {
          "user": "knx",
          "text": "I am aware of github.com/Yara-Rules/rules  (see my answer above). I thought perhaps VT manages its own repository.",
          "time": null
        },
        {
          "user": "NirIzr",
          "text": "I don't think VT exposes other users rules for obvious reasons. I think they have a single ruleset at the backend but a user can only see his own rules.",
          "time": null
        }
      ]
    },
    {
      "content": "afaik shadowserver offers a service like this to business partners (you send yara rules and get matching samples from honeypots in return), but there is no such service for free or personal use.\n\nYou can try to set up your won honeypot for current malware samples (there is a broad range of software for this) or try to run your yara rules on your own malware repository (i.e. collect all samples you can find from free sources and apply your yara rules).\n\nIf you are not in that business, you will not be able to rely on services like virustotal intelligence who offer the biggest malware corpus I know of.\n\nThat being said, a lot of community-driven or free malware sample collections failed at some point. Please be aware of that when starting a service of your own.\n\n",
      "votes": "3",
      "user": "Nordwald",
      "time": "Apr 12, 2017 at 7:05",
      "is_accepted": false,
      "comments": [
        {
          "user": "xoreax",
          "text": "Thank you very much Nordwald.. Thanks for the valuable reply.:)",
          "time": null
        }
      ]
    },
    {
      "content": "So let me google that for you... What about:\n\n",
      "votes": "2",
      "user": "knx",
      "time": "Apr 12, 2017 at 6:48",
      "is_accepted": false,
      "comments": [
        {
          "user": "xoreax",
          "text": "Thanks for your kind reply :). Is there is any site to download the yara rule detected samples?",
          "time": null
        },
        {
          "user": "Vitaly Osipov",
          "text": "@xoreax VT, see Nirlzr's answer below.",
          "time": null
        }
      ]
    }
  ]
}