{
  "title": "Trying to figure what kind of compression was used",
  "link": "https://reverseengineering.stackexchange.com/questions/15326/trying-to-figure-what-kind-of-compression-was-used",
  "content": "I got the following raw data, which are the first 35 bytes of a compressed png image:\n\n```\n00 89 50 4e 47 0d 0a 1a 0a 00 00 00 00 0d 49 48\n44 52 08 00 00 02 58 00 83 5a 08 06 80 00 83 64\n31 28 fe\n\n```\nI also happened to have the 33 bytes the above 35 bytes were before they were compressed\n\n```\n89 50 4e 47 0d 0a 1a 0a 00 00 00 0d 49 48 44 52\n00 00 02 58 00 00 00 5a 08 06 00 00 00 64 31 28\nfe\n\n```\nI'm staring on those bytes for days now and can't figure our the compression algorithm... it looks like some kind of lz77 or Sliding Window Compression.\n\nAny help would be much appreciated with this problem\n\n",
  "votes": "2",
  "answers": 2,
  "views": "996",
  "tags": [
    "decompress"
  ],
  "user": null,
  "time": "May 12, 2017 at 13:42",
  "comments": [
    {
      "user": "julian",
      "text": "can you share all of the data, not just the first n bytes of file x",
      "time": null
    },
    {
      "user": "rertiyulte",
      "text": "hey i have something pretty similar just with 16 bits and not 8. can you tell us how did solve it? ian cock can you give me your skype or something to chat?",
      "time": null
    },
    {
      "user": "perror",
      "text": "If you have a new question, please ask it by clicking the Ask Question button. Include a link to this question if it helps provide context. - From Review",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "It does indeed appear to be an LZ77 variant where 8 encoded/not-encoded flags are combined into a single flag byte.\n\nThe compressed data is then grouped into 8 data 'units' where each unit is represented either by a single uncompressed byte or by a 2 byte dictionary entry.\n\nThe data for a batch of 8 units is preceded by the flag byte where each of its 8 bits indicates whether each unit is an uncompressed byte or a dictionary entry.\n\nThere's not enough data here to be 100% sure about the encoding of the dictionary entries or what any window is because there are only 2 (identical) dictionary entries in your example data.  However, it appears likely that the 2 byte entry is made up of a 12 bit offset and a 4 bit length referring back to previously decompressed data.\n\nIn the case of your compressed data, the decompression proceeds as follows -\n\n```\ncompressed                  decompressed\nflags         data          offset  data            \n00                                                  \n    0=>raw    89      ->    0000:   89              \n    0=>raw    50      ->    0001:   50              \n    0=>raw    4e      ->    0002:   4e              \n    0=>raw    47      ->    0003:   47              \n    0=>raw    0d      ->    0004:   0d              \n    0=>raw    0a      ->    0005:   0a              \n    0=>raw    1a      ->    0006:   1a              \n    0=>raw    0a      ->    0007:   0a              \n00                                                  \n    0=>raw    00      ->    0008:   00              \n    0=>raw    00      ->    0009:   00              \n    0=>raw    00      ->    000A:   00              \n    0=>raw    0d      ->    000B:   0d              \n    0=>raw    49      ->    000C:   49              \n    0=>raw    48      ->    000D:   48              \n    0=>raw    44      ->    000E:   44              \n    0=>raw    52      ->    000F:   52              \n08                                                  \n    0=>raw    00      ->    0010:   00              \n    0=>raw    00      ->    0011:   00              \n    0=>raw    02      ->    0012:   02              \n    0=>raw    58      ->    0013:   58              \n    1=>dict   00 83   ->    0014:   00 00 00    // copy of 3 bytes from offset 8    \n    0=>raw    5A      ->    0017:   5A              \n    0=>raw    08      ->    0018:   08              \n    0=>raw    06      ->    0019:   06              \n80                                                  \n    1=>dict   00 83   ->    001A:   00 00 00    // copy of 3 bytes from offset 8        \n    0=>raw    64      ->    001D:   64              \n    0=>raw    31      ->    001E:   31              \n    0=>raw    28      ->    001F:   28              \n    0=>raw    fe      ->    0020:   fe              \n    0=>raw    ...     ->    0021:   ...\n    0=>raw    ...     ->    0022:   ...                 \n    0=>raw    ...     ->    0023:   ...          \n\n```\n",
      "votes": "3",
      "user": "Ian Cook",
      "time": "May 11, 2017 at 19:52",
      "is_accepted": false,
      "comments": [
        {
          "user": "user20145",
          "text": "I was so sure it is the right solution, but sadly after decompressing it - the image isnt readable :( this is my decompression script: pastebin.com/N94jrkpu   I'm so hoping you will find an error in my decompression script...",
          "time": null
        },
        {
          "user": "Ian Cook",
          "text": "The problem is that there are various ways of encoding the dictionary entities and it's not possible to tell how it's done from the exceedingly small data sample you've provided. Having more of the compressed image would help.",
          "time": null
        },
        {
          "user": "user20145",
          "text": "the 4 bits definitely represent the amount, because the size of the decompressed file is right (I know that by the IDAT length) but the content isnt, any other ideas?",
          "time": null
        }
      ]
    },
    {
      "content": "This looks like an format produced by a LZRW family algorithm.\n\nThe code referred there contains\n\n```\n#define FLAG_COMPRESS 0     /* Signals that compression occurred. */\n#define FLAG_COPY     1     /* Signals that a copyover occurred.  */\n\n```\n(your variant may have those two swapped) and\n\n```\n#define ITEMMAX 16     /* Maximum number of bytes in an expanded item.  */\n\n```\n",
      "votes": "0",
      "user": "Leo B.",
      "time": "May 12, 2017 at 1:52",
      "is_accepted": false,
      "comments": [
        {
          "user": "user20145",
          "text": "Can you please give an example on the data I provided",
          "time": null
        },
        {
          "user": "Leo B.",
          "text": "@Matan The algorithm refuses to compress because of no savings (as you said, the original is 33 bytes, the \"compressed\" form is 35). The LZRW1 format is similar but not exact; for example, it uses 2 bytes of flags at a time, but otherwise the idea is the same. You may want to consult the decompression part of the LZRW code by my link to see if your decompression script has a bug (sorry, I cannot access pastebin now from behind a corporate firewall).",
          "time": null
        },
        {
          "user": "Leo B.",
          "text": "One thing to notice is that the compressed references use the absolute buffer position of the string to copy (offset 8) rather than the relative (how many bytes to step back to find the copy source). This is different from most LZ77 implementations.",
          "time": null
        },
        {
          "user": "user20145",
          "text": "I implemented a decompressor and it outputed a file in right side - but the CRC32 of the IDAT chunk doesnt fit the data itself, the CRC is right, the data isnt.",
          "time": null
        },
        {
          "user": "user20145",
          "text": "What it means is that the 4 LSB bits are definitely the amount but the 12 MSB bits aren't just the offset, there is something more over there.",
          "time": null
        }
      ]
    }
  ]
}