{
  "title": "how do I define an address with a module and an offset in c++",
  "link": "https://reverseengineering.stackexchange.com/questions/15447/how-do-i-define-an-address-with-a-module-and-an-offset-in-c",
  "content": "I'm trying to define an address so that I can edit its memory later, however I can't figure out a way to access it.\n\nThe base address is \"program.exe\"+00D23440 and has an offset of +30\n\nNormally you would just take the address and add its offset, but there's a string involved here.\n\nWhat can I do?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "1k",
  "tags": [
    "disassembly",
    "c++",
    "memory"
  ],
  "user": "Wes",
  "time": "May 30, 2017 at 19:21",
  "comments": [],
  "answers_data": [
    {
      "content": "Modules have a base address where space is allocated for it.For example in 32 bit this can be 0x00400000. \nSo \"program.exe\" is just a placeholder for BASE_ADDRESS+OFFSET \nYou need to know or find out the base address of your program. \nyou can do this manually or dynamically \nfor an example of a dynamic solution see here \nhttps://stackoverflow.com/questions/11564148/how-to-get-the-starting-base-address-of-a-process-in-c\nIn some situations, the base address can change.\nThis is why a dynamic solution is be preferred.\n\n",
      "votes": "1",
      "user": "Samson",
      "time": "May 30, 2017 at 23:52",
      "is_accepted": false,
      "comments": [
        {
          "user": "Rup",
          "text": "His 'base address' is 00D23440 though, and I'd expect the DLL-load base address to be 4K aligned at the very least. So I suspect he means something else.",
          "time": null
        },
        {
          "user": "Samson",
          "text": "Possibly, it would be useful if OP would post more information on what he is trying to achieve or methods that he's tried. I can see that he needs to find the address that the executable is loaded at (instead of \"program.exe\"), and he has another offset besides 0x00D23440, which is '+30'. Are they talking about a pointer? e.g. [BASE_ADDRESS+RVA]+offset",
          "time": null
        }
      ]
    }
  ]
}