{
  "title": "IDAPython: Change struct member content name",
  "link": "https://reverseengineering.stackexchange.com/questions/15454/idapython-change-struct-member-content-name",
  "content": "tl;dr\nI have an array of structs, I'd like to iterate over it and change fields content, (name, values), upon simple conditions.\nI can get the offset of the members, but I can't modify them due to the aforementioned error.\n\nI have a the following structure in IDA:\n\n```\nLOAD:86B70B00 22 F6 DC 86 24 F6 DC+stru_86B70B00   Commands_Array <asc_86DCF622, aQueryOrSetAnSR,          2, \\\nLOAD:86B70B00 86 02 00 00 00 89 F6+                                        ; DATA XREF: sub_85C73BBC+42o\nLOAD:86B70B00 D2 85 DF F6 D2 85 00+                                        ; LOAD:off_85C73D78o\nLOAD:86B70B00 00 00 00 00 00 00 00+                                           sub_85D2F688+1, sub_85D2F6DE+1>; 0 ; \"S\" ...\nLOAD:86B70B00 3F F6 DC 86 45 F6 DC+                Commands_Array <0, 0, 0x86DCF63F, Byte_Nothing, sub_0+2>; 1\nLOAD:86B70B00 86 02 00 00 00 00 00+                Commands_Array <0, 0,          0, sub_0, asc_86DCF646>; 2\nLOAD:86B70B00 00 00 00 00 00 00 00+                Commands_Array <aDial, sub_0+3, 0x85CAECA9, sub_85CAECAC+1,\\\nLOAD:86B70B00 00 00 00 00 00 00 00+                                           a_end__2>; 3\n\n```\nI would like to iterate over it and change the name of each of its members\nby examining each member.\n\nGetting the offset to the structure member was sort of easy, \n\n```\nid = GetStrucIdbyName(struct_name)\nprint \"0x%08x\" % (((base + (struct_size * indx)) + GetMemberOffset(id, \"Func\")))\n\n```\nhowever, whenever I try to \n\nI get the following error:\n\nI guess I'm doing something wrong here, but I can't seem to find the \"right\" \nway to access IDA structures and handle them properly.\n\nHelp would be appreciated and compensated by points, beer and RE-SE fame.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "2k",
  "tags": [
    "idapython",
    "ida-plugin"
  ],
  "user": "Shift",
  "time": "May 31, 2017 at 16:17",
  "comments": [],
  "answers_data": [
    {
      "content": "I am not sure what you are trying to accomplish.\nMy guess is you are trying to document each command entry in a list of commands.\n\nChanging struct membernames is done in the structs view, or using the idc function SetMemberName.\nThat will change the member name for all instances of the struct.\n\nIf you would like to do this programatically for all Members using something like this in idc script ( untested ):\n\n```\nsid = GetStrucIdByName(\"Commands_Array\");\nfor (sofs = GetFirstMember(sid) ; sofs<=GetLastMember(sid) ; sofs += GetMemberSize(sid, sofs)) {\n     SetMemberName(sid, sofs, \"yournewname\");\n}\n\n```\nBut maybe you are trying to give names to entries in an array of structs?\nIn that case, uncheck the Create as array checkbox in the array properties.\nThen you will be able to assign names to each item in the array of structs.\n\nOr maybe you are just looking for the expanded view of the struct?\nThat may be accomplished by typing ctrl +, or unhide in the view menu.\n\nWhat is not possible, is assign names, or comments to individual items in an array.\nYou can add a repeatable comment to a struct member, which will than be the same for each struct in the array.\n\nOr do you want to change the values in the structs? For that you would use functions like PatchByte.\n\nEDIT:\n\nI think i know what you want to do: You want to rename the subs in the struct. Not the struct membernames themselves.\n\n```\nMakeName(Dword(ofs))\n\n```\n",
      "votes": "2",
      "user": "Willem Hengeveld",
      "time": "Jun 5, 2017 at 18:38",
      "is_accepted": false,
      "comments": [
        {
          "user": "Shift",
          "text": "Yup, I've already solved it and started writing a brief answer here. I'll post it in a few days.",
          "time": null
        }
      ]
    }
  ]
}