{
  "title": "Linux protectors: any good one out there?",
  "link": "https://reverseengineering.stackexchange.com/questions/1545/linux-protectors-any-good-one-out-there",
  "content": "I know no one that works as of today (i.e., kernels not way too old) and I wonder if anybody found or knows any protector for Linux either commercial, open source, used in malware, etc...\n\n",
  "votes": "6",
  "answers": 3,
  "views": "1k",
  "tags": [
    "linux",
    "unpacking"
  ],
  "user": "joxeankoret",
  "time": "Apr 3, 2013 at 16:28",
  "comments": [
    {
      "user": "Denis Laskov",
      "text": "You also may look on this thread of security.stackexchange.com : Any comprehensive solutions for binary code protection and anti-reverse-engineering? It include both links to external articles and some valuable input. Bit outdated(2010-2011), but still relevant.",
      "time": null
    },
    {
      "user": "jvoisin",
      "text": "This is also related to this question.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "There is a nice article on Linux binary code protection at http://www.intel-assembler.it/portale/5/linux-binary-code-protection/linux-binary-code-protection.asp. \n\nIf your target is to protect your binary Sentinel HASP supports Linux. \n\nAs for the old ones as you mention most of them don't work anymore, elf-encrypter Shiva, Burneye etc. IF I had to guess what will be the most common in Linux malware it will be  the most common packer that's is used in windows too, UPX.\n\n",
      "votes": "5",
      "user": "Nicolas",
      "time": "Apr 3, 2013 at 19:06",
      "is_accepted": true,
      "comments": [
        {
          "user": "julian",
          "text": "the link is dead",
          "time": null
        }
      ]
    },
    {
      "content": "ZVrba's Phrack article on cryptexec: Next-generation runtime binary encryption is a good read and it doesn't rely on additional kernel functionality:\n\n",
      "votes": "5",
      "user": "0xea",
      "time": "Apr 3, 2013 at 16:53",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "The majority of modern ELF binaries are protected using UPX or a variant thereof. 1,2 However, custom packers have been observed in the wild, including both UPX based- and non-UPX based-custom packers.\n\n",
      "votes": "1",
      "user": "julian",
      "time": "Jul 5, 2019 at 7:21",
      "is_accepted": false,
      "comments": []
    }
  ]
}