{
  "title": "IDA Pro debugging: follow child process",
  "link": "https://reverseengineering.stackexchange.com/questions/15535/ida-pro-debugging-follow-child-process",
  "content": "I'm reverse engineering a malware that creates a number of child processes and I'm trying to do dynamic analysis of the ELF binary with IDA Pro and IDA's Local Linux Debugger, but I can't get IDA to attach to the child process.\n\nIs there some way to force IDA to follow the child process instead of the parent one?\n\nI've tried using gdbserver which seems to lack the follow-fork-mode functionality of gdb and I couldn't find any information on child processes and the IDA Pro Linux Debugger.\n\n",
  "votes": "3",
  "answers": 1,
  "views": "5k",
  "tags": [
    "ida",
    "debugging",
    "linux",
    "elf",
    "dynamic-analysis"
  ],
  "user": "m-strasser",
  "time": "Jun 12, 2017 at 18:43",
  "comments": [],
  "answers_data": [
    {
      "content": "AFAIK IDA does not have that feature, so you'll have to do that yourself by breakpointing or stepping to calls to process creation functions (usually execve, fork, etc), and then forcibly debugging them either by using other IDA instances or creating gdb instances.\n\nYou won't be able to debug multiple processes in a single IDA instance.\n\nIf you want to debug such processes, you could replace the execve with spawning the process yourself, attaching to the process, etc. There are plenty of answers online, if you're not limiting to IDA specifically.\n\nOnce you debugged a process, a common trick you could use is to put the debugged process into a JMP $-2 infinite loop (EB FC on x86 CPUs), detach your original debugger, re-attach with IDA and restore the original instruction sequence you replaced with JMP $-2.\n\n",
      "votes": "1",
      "user": "NirIzr",
      "time": "Jun 13, 2017 at 15:17",
      "is_accepted": false,
      "comments": [
        {
          "user": "m-strasser",
          "text": "Thanks for your answer, but could you explain a bit more what you mean by \"forcibly debugging them\"?",
          "time": null
        },
        {
          "user": "NirIzr",
          "text": "I didn't mean anything special, just the usual attaching and following childs in GDB",
          "time": null
        }
      ]
    }
  ]
}