{
  "title": "Visual View in radare2 while debugging",
  "link": "https://reverseengineering.stackexchange.com/questions/15609/visual-view-in-radare2-while-debugging",
  "content": "I am using radare2 in debugging mode (r2 -d ./program).\nI set up a breakpoint at a certain address (db 0x12341234)\nAnd next I have entered Visual View using: V!\n\nFollowing some tutorials, I saw them using 's' to switch to the next instruction, but that isn't working for me.\nAlso this is not working:\n\nAny key I would press does nothing. Am I missing something or?\n\n\n\nI am talking about this view.\n\n",
  "votes": "7",
  "answers": 1,
  "views": "11k",
  "tags": [
    "disassembly",
    "radare2"
  ],
  "user": "Florin",
  "time": "Jun 17, 2020 at 9:54",
  "comments": [
    {
      "user": "Paweł Łukasik",
      "text": "what version of radare?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "First of all, make sure you run the latest version of radare2 from git repository:\n\n```\n$ git clone https://github.com/radare/radare2.git\n$ cd radare2\n$ ./sys/install.sh\n\n```\nIf you don’t want to install the git version or you want the binaries for another machine (Windows, OS X, iOS, etc) check out the download page at the radare2 website.\n\nradare2 has several different Visual Views, before I'll explain them - please analyze the program using aa and seek to a function using s <function_name>. You can list the functions recognized by radare2 using afl.\n\nIn each of the modes mentioned above you can press ? in order to list the commands available. The commands varies between the different modes.\n\nPressing s and S inside a Visual view while debugging will step-in and step-over respectively. radare will automatically sync the view with eip on every step.\nIn Visual Panels Mode (V!) you can use TAB to navigate between the panels and h/j/k/l to move inside the view/panel.\nYou can run r2 commands from inside Visual Mode using : (ie. s 0x00402c1e).  \n\nIf it still doesn't work and you believe it's a problem with radare please open an issue and the great contributors of radare2 will be happy to help you.\n\n",
      "votes": "11",
      "user": "Megabeets",
      "time": "Jun 20, 2017 at 11:06",
      "is_accepted": true,
      "comments": [
        {
          "user": "Florin",
          "text": "Thank You, it was a nice answer. Apparently I had an older version :3",
          "time": null
        }
      ]
    }
  ]
}