{
  "title": "Modifying a string in a .net binary",
  "link": "https://reverseengineering.stackexchange.com/questions/15603/modifying-a-string-in-a-net-binary",
  "content": "I have a .net exe called foo.exe I open foo in a hex editor (HxD) and search for myString. I do not see it.\n\nI open foo.exe in ILSpy and was able to find myString.\n\nI do see human readable text in the hex editor but I think the .net strings are encoded some other way.\n\nSome background is we have a client site that switched servers on some 10+ year old code and the server configuration was hard coded. The old server was left online during testing and the issue was not found until 12 hours into production.\n\n",
  "votes": "3",
  "answers": 1,
  "views": "2k",
  "tags": [
    "binary",
    ".net",
    "binary-editing"
  ],
  "user": "user20610",
  "time": "Jun 19, 2017 at 22:31",
  "comments": [],
  "answers_data": [
    {
      "content": "C# encodes its string literals as UTF-16.\n(http://csharpindepth.com/Articles/General/Strings.aspx)\n\nTo search the hex in HxD you need to check the Unicode string checkbox in HxD and after that you are able to search your string. \n\nIf you are able to then change your string to the correct character without breaking UTF-16 and file size then your new string will be updated.\n\nwell i wrote a similar answer but discarded it and just adding a screen shot that explains your answer better     \n\n \n\n",
      "votes": "2",
      "user": "L29Ah",
      "time": "Oct 30, 2018 at 19:48",
      "is_accepted": true,
      "comments": [
        {
          "user": "svick",
          "text": "Please, don't call the encoding \"Unicode\", as Microsoft often does. Unicode has several encodings, the one used here is UTF-16.",
          "time": null
        },
        {
          "user": "hildred",
          "text": "@svick, and sometimes it is UCS16 which is also annoying (Unicode code points encoded as a sixteen bit integer.",
          "time": null
        }
      ]
    }
  ]
}