{
  "title": "MSP430 - IDA Pro Free Binary Dump",
  "link": "https://reverseengineering.stackexchange.com/questions/15657/msp430-ida-pro-free-binary-dump",
  "content": "I have a assembly dump from a MSP430 binary in a normal ascii text file as below:\n\n```\n46f4 <strcpy>\n46f4:  0d4f           mov   r15, r13\n46f6:  023c           jmp   #0x46fc <strcpy+0x8>\n46f8:  1e53           inc   r14\n46fa:  1d53           inc   r13\n46fc:  6c4e           mov.b @r14, r12\n46fe:  cd4c 0000      mov.b r12, 0x0(r13)\n4702:  4c93           tst.b r12\n4704:  f923           jnz   #0x46f8 <strcpy+0x4>\n4706:  3041           ret\n4708 <_unexpected_>\n4708:  0013           reti  pc\n\n```\nUsing Ida Pro Free, how can I \"upload\" a binary dump of this format so I can use IDA's flow graphs, visual aids, etc. I realized it's already dissasembled but I still want to use the features IDA Pro free offers.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "ida",
    "disassemblers",
    "risc"
  ],
  "user": "John 41_",
  "time": "Jun 24, 2017 at 17:04",
  "comments": [
    {
      "user": "blabb",
      "text": "you mean you want to extract the 0d4f023cxxxx convert them to binary and load a binary file you may need to sed grep and awk and strtoul the result yourself no disassembler I know of can parse and load a text file",
      "time": null
    },
    {
      "user": "John 41_",
      "text": "When you open IDA Pro, there is an option to load various types of files (Windows, Unix, PE, ELF, etc.) There is also a tab for Embedded (.hex intel/MOS hexadecimal file, .p MAS Macro Assembler code File). It appears as though you could include an assembler dump, or at least make one based on what I already have. It would be nice to keep the addresses the same however, those listed on the left side.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "IDA Free does not support MSP430 (only x86) and neither can it load plain binary files. You need the full version of IDA (Starter or Pro) to do either.\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Jun 24, 2017 at 17:47",
      "is_accepted": false,
      "comments": [
        {
          "user": "blabb",
          "text": "does that mean the pro version can load a text file as posted  or does it need to be in the mspxxx format  ( i mean 0x0d as liefeed etc etc)",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "not \"as posted\", but it can load hex dumps or raw binaries",
          "time": null
        }
      ]
    }
  ]
}