{
  "title": "Creating a patcher for a mac app",
  "link": "https://reverseengineering.stackexchange.com/questions/15717/creating-a-patcher-for-a-mac-app",
  "content": "I have a signed mac app and I don't have the source code of the app.\nI know address locations of some assembly instructions which I need to change so as to make this app to work in certain way. So I'm trying to write a patcher, which should be able to read the assembly of original mac app and change those addresses and produce new mac app with no signature. \n\nThis patcher should be a stand alone mac app.\nThe patcher should patch the original app and produce the modified one.\n\nHow can I do this? I just need some guidance to write this patcher.   \n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "disassembly",
    "assembly",
    "osx"
  ],
  "user": "Jaffer Sheriff",
  "time": "Jun 29, 2017 at 17:41",
  "comments": [],
  "answers_data": [
    {
      "content": "There are several aspects for this:\n\nUPDATE:\n\nTo automate the on-disk patching, one can use a pretty easy way which is based on some pattern matching and a little bit of heuristics:\n\nAll the above will be sufficient (hopefully) to accommodate version changes and assure that you change at the right place. Such patcher could be easily coded with Python. For disassembling you can use Capstone library which has Python binding.\n\nTake into account that, you fill make OSX complain about this patched app as it will not be signed any more.\n\n",
      "votes": "5",
      "user": "PhoeniX",
      "time": "Jun 29, 2017 at 17:55",
      "is_accepted": true,
      "comments": [
        {
          "user": "Jaffer Sheriff",
          "text": "thank you for your valuable info. I have created a modified executable of a app using hopper disassembler. I have to replace the original executable with modified one to run the patched app.  So instead of doing this manual process in every Mac, I want to create a app patcher which should patch the original app and produce the modified one. It Is much like dynamic patching so how can dynamically patch that Mac app?",
          "time": null
        },
        {
          "user": "Jaffer Sheriff",
          "text": "@phOsec really thank you for your help and you are a life saver.",
          "time": null
        }
      ]
    }
  ]
}