{
  "title": "Basic assembly query [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/15792/basic-assembly-query",
  "content": "I wrote a program which will add two numbers in assembly.\nWhen I do a system call for scanf(), the instruction looks like this:\n\n```\nmov rcx, num1\n\n```\nNote: I have defined num1 in the bss section as:\n\n```\nnum1 resb 10\n\n```\nAnd, when I try to move this value to say rax the instruction looks like:\n\n```\nmov rax, [num1]\n\n```\nFrom what I have learned, anything inside square brackets must only be computed in case of rm32. So, more like going to memory location but not reading what's in the memory.\n\nHow is this bracket helping here ?\n\nWhy do we need the memory location when we can have the direct value?\n\nAnd my next instruction is:\n\n```\nsub rax, '00'\n\n```\nrax contains an address of num1. Shouldn't we be doing math to the value num1 and not on the address ?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "602",
  "tags": [
    "ida",
    "assembly",
    "intel"
  ],
  "user": "Atply",
  "time": "7 years ago",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "just because it's about assembler does not mean it's RE",
      "time": null
    },
    {
      "user": "Atply",
      "text": "Agreed. But it's related.  That's the reason I posted it here.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "First of all, you are using the Intel syntax for the x86/amd64 assembly. So, in this syntax the brackets ([.]) stands for a dereference of the address it contains.\n\nIf you know C programming, [var] (in assembly) is exactly similar to '*var'.\n\nIn fact, the only small difficulty you have to handle here is that the num1 that you defined is already an address (I am speaking now about the nasm syntax and NOT about the Intel asm syntax). \n\nSo, move rcx, num1 means that you copy the address of num1 to rcx. \n\nAnd, move rax, [num1] means that you copy the content of num1 to rax.\n\nYou may refer to this SO question which might explain your problem.\n\n",
      "votes": "1",
      "user": "perror",
      "time": "Jul 9, 2017 at 11:45",
      "is_accepted": false,
      "comments": []
    }
  ]
}