{
  "title": "Where can someone interested in the topic learn more about Dynamic binary instrumentation?",
  "link": "https://reverseengineering.stackexchange.com/questions/1584/where-can-someone-interested-in-the-topic-learn-more-about-dynamic-binary-instru",
  "content": "Generally, it's a complex topic.  There seems to be very little in the way of example or linear progression in to non-trivial examples.  \n\nIt's possible my google-fu is weak, but I can't seem to locate decent tutorials on using binary instrumentation frameworks (Pin, DynamoRIO, other).  \n\nWhat resources could someone who is interested use beyond stumbling around until they get it working?  \n\nAfter some of the answers, I thought I should tack on that dynamorio.org is sometimes non-responsive.  The project is on googlecode here.  \n\n",
  "votes": "7",
  "answers": 4,
  "views": "669",
  "tags": [
    "dynamic-analysis"
  ],
  "user": "RobotHumans",
  "time": "Apr 7, 2013 at 13:15",
  "comments": [],
  "answers_data": [
    {
      "content": "There is a nice introduction on PIN at http://www.slideshare.net/null0x00/nullcon-2011-automatic-program-analysis-using-dynamic-binary-instrumentation also a nice tutorial on Skype for Linux simple unpacking using Pin http://joxeankoret.com/blog/2012/11/04/a-simple-pin-tool-unpacker-for-the-linux-version-of-skype/ \n\nFinally an old presentation that you might like also, \"Using the Pin Instrumentation Tool for Computer Architecture Research\" http://www.jaleels.org/ajaleel/Pin/slides/1_Intro.ppt\n\n",
      "votes": "8",
      "user": "Nicolas",
      "time": "Apr 5, 2013 at 5:06",
      "is_accepted": true,
      "comments": [
        {
          "user": "RobotHumans",
          "text": "Plus one for the Skype example, which is really the thing for which I was looking (non-all-theory non-contrived example).",
          "time": null
        }
      ]
    },
    {
      "content": "Jurriaan Bremer wrote at least two articles that can be quite informing regaring Pin which can serve as a nice introduction. \n\n",
      "votes": "5",
      "user": "0xea",
      "time": "Apr 5, 2013 at 7:56",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "If you've never touched DBI before, I found this book to be a good use of $17.  Written by a long-time researcher in the field, it describes the theory and practice behind DBI, including multiple DBI platforms, exotic DBI tools, etc.\n\n",
      "votes": "5",
      "user": "Rolf Rolles",
      "time": "Apr 5, 2013 at 8:45",
      "is_accepted": false,
      "comments": [
        {
          "user": "RobotHumans",
          "text": "Plus one for a full text.  It would be more convenient as a kindle edition though.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@RolfRolles: thanks for the tip. It's now on my shopping list for next month :)",
          "time": null
        }
      ]
    },
    {
      "content": "PIN and DynamoRIO both have complete documentation with many examples that are fully commented.\nI think best place to start is to play with examples, modify them and see the result.\n\n",
      "votes": "0",
      "user": "perror",
      "time": "Apr 5, 2013 at 14:05",
      "is_accepted": false,
      "comments": []
    }
  ]
}