{
  "title": "Changing the format of IDA's Produce file -> Create ASM file",
  "link": "https://reverseengineering.stackexchange.com/questions/15863/changing-the-format-of-idas-produce-file-create-asm-file",
  "content": "OK, so I know this is path is not recommended but it is a situation I have been forced into. I have a tool not created by me which takes the exported asm file from IDA and processes the exported assembly from IDA. However, it seems as though the assembly that IDA exports has changed since the tool was created. When I export an assembly listing from one of my IDA databases using the \"Produce file -> Create ASM file\" option, the resulting assembly listing does not include addresses for every instruction but the tool I am using has hardcoded the assembly listing format that it receives from IDA and throws exceptions because addresses are not at the start of every instruction.\n\nIs there a way to turn this feature on? What controls the format of the assembly listing that IDA exports? \n\n",
  "votes": "1",
  "answers": 2,
  "views": "2k",
  "tags": [
    "ida",
    "disassembly",
    "file-format"
  ],
  "user": "dingo_kinznerhook",
  "time": "Jul 19, 2017 at 19:06",
  "comments": [],
  "answers_data": [
    {
      "content": "To get addresses in the output, you should use LST option instead of ASM. .asm files are intended to be input for an assembler (in theory, in practice it rarely works) which will assign addresses to labels as necessary, so there is no need to print addresses in the ASM file.\n\n",
      "votes": "2",
      "user": "Igor Skochinsky",
      "time": "Jul 21, 2017 at 12:22",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "The answer, according to IDA support, is that there is no way to change the format of this menu option. However, there is a small amount of customization you can achieve using the IDA API function GenerateFile: \n\nhttps://www.hex-rays.com/products/ida/support/idadoc/244.shtml\n\n",
      "votes": "1",
      "user": "dingo_kinznerhook",
      "time": "Jul 20, 2017 at 18:08",
      "is_accepted": false,
      "comments": []
    }
  ]
}