{
  "title": "What is a free & open source alternative to IDA Pro for MacOS?",
  "link": "https://reverseengineering.stackexchange.com/questions/15895/what-is-a-free-open-source-alternative-to-ida-pro-for-macos",
  "content": "I am looking for a free & open source alternative to IDA Pro runs on MacOS - the suggestions should have as close to the features of IDA as possible. I should also be able to edit an executable that I am debugging (i.e. change/remove things).\n\n",
  "votes": "19",
  "answers": 6,
  "views": "26k",
  "tags": [
    "ida",
    "mach-o",
    "macos"
  ],
  "user": null,
  "time": "Aug 17, 2017 at 9:12",
  "comments": [
    {
      "user": "Brendan Dolan-Gavitt",
      "text": "Possible duplicate of Is there any disassembler to rival IDA Pro?",
      "time": null
    },
    {
      "user": "PhoeniX",
      "text": "In the above mentioned link you can find most possible alternatives for various platforms, including macOS.",
      "time": null
    },
    {
      "user": "user20964",
      "text": "Hy @Megabeets sorry about that, I've been quite busy with life, I marked your answer as accepted :)",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I highly recommend radare2 which seems to suit you the best:\n\nYou can find most of the features you have in IDA in radare (including the option to edit a binary that you debug) and in case you lack some feature you can always open a request on the Github page or develop it by yourself. Note that, in my opinion, the learning curve of r2 is pretty steep and it'll take some time to get use to it.\n\nInstallation\nIt’s recommended to use the current git version of radare2.\nSimply run:\n\n```\ngit clone https://github.com/radare/radare2.git\ncd radare2\n./sys/install.sh\n\n```\nYou'll need to perform several more steps in order to sign radare and make it ready to debug applications without the need of root permissions.  \n\nBeginners guides \n\nThis should be enough in order to learn the basics of radare.  \n\nUser Interface\nradare2 has a powerful command line visual modes to help you go through the program and super useful while debugging. This is how the Visual Graph Mode looks like:   \n\n \n\nThe official graphic user interface of radare2 is called Cutter (originally named Iaito). Cutter is built on top of Qt and C++.\n\n\n\n",
      "votes": "17",
      "user": "NirIzr",
      "time": "Oct 1, 2018 at 0:27",
      "is_accepted": true,
      "comments": [
        {
          "user": "Vitaly Osipov",
          "text": "I believe Radare isn't able \"to edit an executable that I'm debugging (I.e. change/remove things)\", am I wrong?",
          "time": null
        },
        {
          "user": "Megabeets",
          "text": "Sure you can :) Editing, pathching, resizing, copying & pasting, etc are all possible with radare. Check for example w? to list write commands and dr? to list registers commands.",
          "time": null
        },
        {
          "user": "Anton Kukoba",
          "text": "Currently R2 is not even close to IDA, it's UI version is even worse than a text one. Yet it's the best alternative for Mac...",
          "time": null
        }
      ]
    },
    {
      "content": "This is not free and open source but Hopper Disassembler is $99US for personal use which compared to IDA Pro is super cheap. There is a free trial version if you would like to check it out. https://www.hopperapp.com/\n\n",
      "votes": "5",
      "user": "Igor Skochinsky",
      "time": "Jul 23, 2017 at 22:02",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "As of 2020, Ghidra should be considered as a major contender. It is challenging IDA Pro in many areas. The integrated decompiler is one of its greatest assets.\n\nThe support for debugging was added recently on the official repository. It will be added to the next official build. Ref\n\n\n\n",
      "votes": "5",
      "user": "h3xStream",
      "time": "Dec 22, 2020 at 5:20",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "The integrated decompiler is actually a separate decompiler that could be integrated into other tools, such as IDA.",
          "time": null
        },
        {
          "user": "Anton Kukoba",
          "text": "Debugger for MacOS in Ghidra still doesn't work",
          "time": null
        }
      ]
    },
    {
      "content": "There aren't any. Radare is the only open source disassembler (that works on OSX) worth mentioning, and its capabilities are still far away from what you're looking for.\n\nhttps://github.com/radare/radare2 or\n\n",
      "votes": "2",
      "user": "Vitaly Osipov",
      "time": "Jul 23, 2017 at 4:41",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "The officially supported debugging package for Mac OS X is lldb.\nYou can always try GDB which is the legendary GNU Debugger. It is not in any way as fancy as IDA buy you can always spice it up with GDB-Dashboard or gdbgui. \n\n",
      "votes": "2",
      "user": "api pota",
      "time": "Jul 24, 2017 at 7:11",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Although they are not free, you can try either Hopper Disassembler and Binary Ninja. Both can be bought starting from $99.\n\n",
      "votes": "1",
      "user": "Lotternamx",
      "time": "Jul 29, 2017 at 9:34",
      "is_accepted": false,
      "comments": []
    }
  ]
}