{
  "title": "Reverse engineering a Visual Basic p-code binary",
  "link": "https://reverseengineering.stackexchange.com/questions/1597/reverse-engineering-a-visual-basic-p-code-binary",
  "content": "p-code is the intermediate code that was used in Visual Basic (before .NET). I would like to know where I can find resources/tools related to analysis of these virtual machine codes. \n\n",
  "votes": "15",
  "answers": 3,
  "views": "39k",
  "tags": [
    "decompilation",
    "visual-basic"
  ],
  "user": "viv",
  "time": "Apr 5, 2013 at 13:43",
  "comments": [
    {
      "user": "George Dima",
      "text": "about P32Dasm , on their page, they mention \"IDA Visual Basic debugger plugin\" for debugging with IDA , but this plugin is impossible to find... does anyone know about this?",
      "time": null
    },
    {
      "user": "alexanderh",
      "text": "Here's an old RE-Reddit thread asking a similar question reddit.com/r/ReverseEngineering/comments/djhb7/…",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Alex Ionescu, co-author of the latest \"Windows Internals\" book and contributor to ReactOS, wrote a good paper on the topic of VB decompilation quite a while ago. Here the direct link to the PDF (originally from http://www.alex-ionescu.com/vb.pdf).\n\nThe paper documents the structures and constants of the file format itself and probably goes a long way in accompanying the information on the opcode list from the other answer.\n\n",
      "votes": "16",
      "user": "0xC0000022L",
      "time": "Jan 19, 2015 at 6:57",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "They are some tools can be useful in reversing p-code binary\n\nvb-decompiler lite (free ver): very good decompiler can be download from vb-decompiler official site\n\nP32Dasm: another p-code decompiler see here\nand see below of page how they debug p-code with IDA\n\nWKTVBDE: p-code debugger, I don't work with it but good to try, to download search tuts4you.com site\n\n",
      "votes": "12",
      "user": "Arash",
      "time": "Apr 5, 2013 at 13:58",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "A very comprehensive resource on the p-code was on the site of vb vb-decompiler. Luckily there is a backup in the wayback machine, link here.\n\n",
      "votes": "6",
      "user": "evandrix",
      "time": "Aug 14, 2022 at 17:03",
      "is_accepted": false,
      "comments": []
    }
  ]
}