{
  "title": "Any tool for finding IP that a process use/access?",
  "link": "https://reverseengineering.stackexchange.com/questions/16004/any-tool-for-finding-ip-that-a-process-use-access",
  "content": "I need to extract the IP that a certain application is using to receive and/or send data, is there any tool or software that would do this for me ? or any simple way without needing to dig into the application calls ?\n\n",
  "votes": "3",
  "answers": 2,
  "views": "2k",
  "tags": [
    "tools",
    "process",
    "callstack",
    "address"
  ],
  "user": "Bruno Cerk",
  "time": "Aug 4, 2017 at 16:43",
  "comments": [],
  "answers_data": [
    {
      "content": "As @Nirlzr correctly mentioned, netstat -ape | grep <proc_name/pid> will show you the active connections of a process. It might be just enough for you but there are some cases where it would not. \n\nnetstat has some blind spots -- it only shows connections at a certain point in time. Therefore, connections which closed quickly and every connection which was closed before or started after the execution of netstat will obviously not be shown.  \n\nA solution for this is to use strace which can help you monitor the connections which created by a process.\n\nTo start a process and monitor its connections:\nstrace -f -e trace=network -s 10000 <process [arg1] [arg2] [...]>\n\nTo monitor an already existing process:\nstrace -p <pid> -f -e trace=network -s 10000\nif you don't know its PID use pidof <processname>\n\nThen use some grep magic to print only the IP addresses:\nstrace -f -e trace=network <process [args...]> 2>&1 | grep -oP 'connect.*inet_addr\\(\"\\K[^\"]+' \n\nIn windows you also can use netstat or the improved version of it Get-NetTCPConnection via powershell. But both have the blind spot aforementioned.  \n\nTwo recommended solutions for it are:  \n\nBoth have the ability to monitor connections as they open and a nice GUI to show it.\n\n",
      "votes": "7",
      "user": "Megabeets",
      "time": "Aug 4, 2017 at 20:15",
      "is_accepted": true,
      "comments": [
        {
          "user": "Bruno Cerk",
          "text": "Network Monitor just did what i needed, it first shown the source address as a \"website\" address, like \"something.address1.net\", but then searching on the information it gives when clicking on it, i managed to find the IP address and the port, and thats what i needed",
          "time": null
        },
        {
          "user": "Bruno Cerk",
          "text": "That was really helpful, i'm sure that i'll be using this software a lot from now on",
          "time": null
        }
      ]
    },
    {
      "content": "Since OP's answer was a bit low on details, i'll assume Linux and Dynamic IP.\n\nOn most OSes there are tools to list network resources taken by processes. This often includes IP addresses and ports used for existing connections. If you want to list existing connections and their owning processes on linux, running the netstat command.\n\nBy providing it some command line arguments you can get the desired information, consulting man pages is always recommended but for your specific case running netstat -ape to list all connections with their pid and username.\n\n",
      "votes": "1",
      "user": "NirIzr",
      "time": "Aug 4, 2017 at 16:58",
      "is_accepted": false,
      "comments": [
        {
          "user": "Y M",
          "text": "On windows, it is netstat -n -b",
          "time": null
        },
        {
          "user": "Bruno Cerk",
          "text": "Its Windows, but thanks very much, i'll look into it",
          "time": null
        }
      ]
    }
  ]
}