{
  "title": "Trying to read/write an Renesas's M30626FHPGP flash memory",
  "link": "https://reverseengineering.stackexchange.com/questions/16030/trying-to-read-write-an-renesass-m30626fhpgp-flash-memory",
  "content": "I need to make a little introduction: I'm a 37 years old man who is affected by multiple sclerosis. My neurologist gave me Rebif 44 (44mg) as a treatment. I started at full dose and went on for, roughly, a year, but it become clear that I could not go on like that as my immune system would go down too much. Taking half the dose is, instead, too little, so switching to Rebiff 22 (22mg) was not an option. \n\nWe went to an intermediate dose: 70% of Rebif 44, which translates to 30.8mg.\nThe question comes because any Rebismart 2 device only gives 72 reduced doses of Rebif 44, which only last for half a year (while, using the injector normally, it could last for 3-5 years). After that, the only option is to have a new injector.\nEveryone of these devices are quite costly, at around 500€/$. \nMind: I don't have to pay for them, as it is the government health system that takes care of it.\nBut it is a waste of money nonetheless.\n\nSo, after a couple of injector stashed away, I got more and more interested on how to access the programming of these devices and how, if possible, to reset or reprogram those 72 injections. I could not find any answer on the internet.\n\nSo, I tore apart one of the injectors and found out it has the microcontroller said in the title.\n\nUnfortunately I don't have programming skill whatsoever, so I don't even know how and where to start doing these kind of things. \n\nI link a couple of images i took with my cellphone, so anyone can have a look at the motherboard and chips.\n\nAny help would be fantastic.\n\nhttps://drive.google.com/drive/folders/0B-41ngW_8ao9T2F2NWpLYnFXWGc?usp=sharing\n\n",
  "votes": "1",
  "answers": 0,
  "views": "123",
  "tags": [
    "disassembly",
    "memory",
    "hardware",
    "memory-dump"
  ],
  "user": "Paolo Cazzaniga",
  "time": "Aug 7, 2017 at 8:38",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "While we can try to figure this out, are you sure you want to tinker with the device which manages your health? what if you screw up and it starts dispensing really high doses? would insurance cover any accidents happening due to hw modifications?",
      "time": null
    },
    {
      "user": "NirIzr",
      "text": "Seems like OP managed to collect a few \"spare\" injectors to tinker with without risking his health.",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "@NirIzr: yes, because those were not modified",
      "time": null
    }
  ],
  "answers_data": []
}