{
  "title": "Radare2 doesn't display the whole function",
  "link": "https://reverseengineering.stackexchange.com/questions/16089/radare2-doesnt-display-the-whole-function",
  "content": "I am using radare2, I have disassembled the function: sym.loop, it contains a switch witch has 4 cases that calls different functions. After any of the function call, the program exits the loop function.\n\nHere is my problem: after the first exit displayed in radare the disassembled code stops. I am not able to see the rest of the function's code, although there are jump indicating there is more content after the exit function.\n\nDo I have to press or do anything to display the rest or is it a bug? \n\nHere is the code of the loop function: \n\n```\nvoid loop(int a) {\n    type[0] = a;\n    while (true) {\n        switch (type[0]) {\n        case 1:\n            function1(arg);\n            break;\n        case 2:\n            function2(arg);\n            break;\n        case 3:\n            function3(arg);\n            break;\n        default:\n            printf(\"Command unrecognized.  \n\");\n        case 4:\n            function4();\n            break;\n        }\n    }\n}\n\n```\nNote: if there is any bug in the code, I may have caused trying to clean the code from debug messages or whatever... But the idea is that the main code has no bugs, it is just the disassembler that doesn't print the entire function.\nand the disassembly code stops after the case1's break (exit function).\n\n(UPDATE:)\nHere is an example of the error I am talking about (not the above code, but the same error): \n\n\nNo return value is displayed.\n\n",
  "votes": "5",
  "answers": 1,
  "views": "2k",
  "tags": [
    "disassembly",
    "radare2",
    "functions"
  ],
  "user": "Florin",
  "time": "Sep 19, 2017 at 9:28",
  "comments": [
    {
      "user": "Megabeets",
      "text": "Can you please share the output of pdf @ sym.loop? Also, do you able to share the binary so we can investigate deeper?",
      "time": null
    },
    {
      "user": "Paweł Łukasik",
      "text": "how did you compile it? was there any optimisation turned on? is it possible to put the binary somewhere?",
      "time": null
    },
    {
      "user": "Megabeets",
      "text": "Is the problem still occur? Would you be able to share the binary?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You may also need to enable jumptable analysis options e anal.jmptbl before analysis and you also need latest git version of radare2.\n\n/ 2018 This is now default to true as the functionality have been improved.\n\n",
      "votes": "1",
      "user": "Maijin",
      "time": "Jul 16, 2018 at 1:12",
      "is_accepted": false,
      "comments": [
        {
          "user": "Florin",
          "text": "hmm, this might be the problem, could you give me some help with enabling it?",
          "time": null
        },
        {
          "user": "Megabeets",
          "text": "Simpy run e anal.jmptbl=true from inside radare's shell. Read more about configurations: radare.gitbooks.io/radare2book/content/configuration/intro.html",
          "time": null
        },
        {
          "user": "Florin",
          "text": "@Megabeets just got the latest version, also set e anal.jmptbl to true but the result is the same. But: if I press pC to visualize the code in more lines, then, the entire function is displayed (mabe this can help)",
          "time": null
        },
        {
          "user": "joxeankoret",
          "text": "Why isn't that option the default?",
          "time": null
        }
      ]
    }
  ]
}