{
  "title": "How do I decompress a .astc file with an additional .ccz extension? How do I view .lta files?",
  "link": "https://reverseengineering.stackexchange.com/questions/16084/how-do-i-decompress-a-astc-file-with-an-additional-ccz-extension-how-do-i-vie",
  "content": "First, full disclosure: I'm very new to coding and very new to file dissecting, but its something I anticipate studying in school very soon, so please pardon my ignorance in future interactions. \n\nAs a project I've decided to dissect the files of a mobile app I greatly enjoy. This app is Futurama: Worlds of Tomorrow. I'm a big fan of the cartoon, even spent money on the stuff, so I figured it was natural for me to pick. \n\nExtracting the .apk file was easy, I found some of the assets they use in the game, like the music, the soundbytes, and some .pngs. All simple stuff. \n\nHowever there are two files I'm absolutely baffled by: files with an .astc.czz extension and .lta files, the developers informed me that those are animation files. \n\nAllow me to go into what I know and what I don't know:\n\nExample file here\nI recognize .astc as a compression file and was informed that .astc files are common for mobile games. Fair enough, but the real extension is .czz, the \"real\" extension of the file leads me to dead end. I've found the ASTC Evaluation Codec\nby ARM-Software on github so I tried that. I changed the extension to .astc and then tried keeping .czz but the codec gives me an error every time. This is where I show my ignorance, I didn't know the right way to do this so I'm showing you every combination of what I tried. I replaced my name with user.\n\n```\nC:\\Users\\user\\Downloads\\astc-encoder-master\\Binary\\Win32\n位 astcenc -d C:\\Users\\user\\Downloads\\astc-encoder-master\\Binary\\Win32\\ C:\\Users\\user\\Downloads\\astc-encoder-master\\Binary\\Win32\\\nFile C:\\Users\\user\\Downloads\\astc-encoder-master\\Binary\\Win32\\ not recognized\n\nC:\\Users\\user\\Downloads\\astc-encoder-master\\Binary\\Win32\n位 astcenc -d  \nFile  not recognized\n\nC:\\Users\\user\\Downloads\\astc-encoder-master\\Binary\\Win32\n位 astcenc -d C:\\Users\\user\\Downloads\\astc-encoder-master\\Binary\\Win32\\ C:\\Users\\user\\Downloads\\astc-encoder-master\\Binary\\Win32\\\nFailed to open file C:\\Users\\user\\Downloads\\astc-encoder-master\\Binary\\Win32\\\n\nC:\\Users\\user\\Downloads\\astc-encoder-master\\Binary\\Win32\n位 astcenc -d  \nFailed to open file \n\n```\nNo success there.\n\nSo then I learned that .CZZ files are apparently associated with visECAD Viewer  and I downloaded that and the .astc.czz files became associated with the program. I tried opening them but visECAD says it cant open them because they are \"outdated.\" So that's another dead end. \n\nI was told to use Unix's file command too, and all I got was \"data\": \n\n```\nubuntu@ubuntu:~/Downloads$ file BR1.astc.ccz -b data ubuntu@ubuntu:~/Downloads$ file BR1.astc.ccz BR1.astc.ccz: data ubuntu@ubuntu:~/Downloads$ file BR1.astc.ccz -i -b application/octet-stream; charset=binary ubuntu@ubuntu:~/Downloads$ file BR1.astc.ccz -z BR1.astc.ccz: data ubuntu@ubuntu:~/Downloads$ file -z BR1.astc.ccz BR1.astc.ccz: data\n\n```\nRight, so that's all I know. \n\nExample file here\nOut of curiosity I've actually emailed the developers about this file (and the astc ones too) and they said those are the animation files of the game. They couldn't send me a viewer, which is perfectly fine, but I don't even know what .lta could be. I think it has something to do with Maya, but that's all I got. Any insight would be appreciated, the animations are great and I would love to see them. \n\nFor full disclosure here are snippets of what the developers sent me:\n\nWell that's all folks, sorry it was so long, and thank you so much in advance. I'm grateful already!\n\n",
  "votes": "1",
  "answers": 1,
  "views": "552",
  "tags": [
    "android",
    "decompress"
  ],
  "user": "Ruby",
  "time": "Aug 13, 2017 at 16:06",
  "comments": [],
  "answers_data": [
    {
      "content": "since these formats seem to be custom to the game, I suspect there is no other way than disassembling/decompiling the game code to see how they're processed. \n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Aug 14, 2017 at 7:27",
      "is_accepted": false,
      "comments": []
    }
  ]
}