{
  "title": "Disassembled code: Find out command-line arguments of program",
  "link": "https://reverseengineering.stackexchange.com/questions/16108/disassembled-code-find-out-command-line-arguments-of-program",
  "content": "Imagine a program is launched (on windows) with a few starting parameters, for example a number and a string.\n\nWhen disassembling the program (With PEiD for example), how can I find out the starting parameters? What I'd like to do is find out what \"variable\" the starting parameters are assigned, and then track the use of that variable, in order to find the section in which they get used.\n\nI am completely new to all of this assembly stuff, so this question may be stupid, but I didn't manage to find my answer through simple googling.\nThanks!\n\n",
  "votes": "3",
  "answers": 1,
  "views": "931",
  "tags": [
    "disassembly",
    "arguments",
    "program-analysis"
  ],
  "user": "user2065501",
  "time": "Aug 16, 2017 at 16:35",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "do you mean command-line arguments?",
      "time": null
    },
    {
      "user": "user2065501",
      "text": "@IgorSkochinsky Whooops, yeah, that's exactly what I meant. I kind of forgot the word while writing this post, my bad.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Unlike Linux, on Windows command-line arguments are not passed to the program's entrypoint but must be retrieved from the OS by using the API GetCommandLine. However, it is rarely used in actual programs. Usually it is the CRT startup which calls it, then either passes it to the WinMain function (for GUI programs), or splits it into the argument array (argv) and passes that to main (for console programs). \n\nSome disassemblers (e.g. IDA) can automatically identify the CRT code and show you just the main/WinMain function, in which case you can just look at the corresponding arguments (argv/argc or lpCmdLine).\n\n",
      "votes": "3",
      "user": "Igor Skochinsky",
      "time": "Aug 16, 2017 at 18:08",
      "is_accepted": true,
      "comments": []
    }
  ]
}