{
  "title": "How to make radare2 work for a large binary?",
  "link": "https://reverseengineering.stackexchange.com/questions/16112/how-to-make-radare2-work-for-a-large-binary",
  "content": "I compiled cpython with debugging headers and I want to perform the following analysis using radare2. \n\nThe problem I encounter is that it takes forever (at least 27 hours) to perform the aaa (analysis) part. \n\n",
  "votes": "11",
  "answers": 1,
  "views": "6k",
  "tags": [
    "binary-analysis",
    "radare2"
  ],
  "user": "0x90",
  "time": "Nov 13, 2017 at 15:11",
  "comments": [],
  "answers_data": [
    {
      "content": "It is not a good practice to run full analysis of your binary at the startup and it also isn't encourged by radare. Running aaa by default is a heavy action and absolutely not recommended or needed in most of the cases.\n\nAs stated in this execllent post from radare's blog:  \n\nTo make the analysis process more efficient you can start with configuring different analysis configuration variables in radare. These configuration variables can help you to fit the analysis process to your program and to your needs. Some of the interesting variables are:  \n\n```\nanal.afterjmp  \nanal.depth  \nanal.eobjmp  \nanal.esil  \nanal.hasnext  \nanal.nopskip  \nanal.from\nanal.to\n\n```\nSee the e??anal. command to get more detailed descriptions for them. \n\nAnalysis of a program isn't just performing one action and that's it -- it is combined from different analysis for different needs.\nradare implements many different commands that perform different kind of analysis. Smart use of these command can help you quick the process of the analysis and analyze only the parts which you believe are the most important:\n\nTo sums it up, you should think and plan the analysis process that fits best to your needs:\n\nIf after reading this answer and the post in radare's blog you believe its a bug and you can point at the problem, feel free to open an issue on github.\n\n",
      "votes": "24",
      "user": "mrexodia",
      "time": "Aug 19, 2017 at 11:33",
      "is_accepted": true,
      "comments": [
        {
          "user": "newlog",
          "text": "Given that this answer was set to correct, it would be interesting to know what analysis switches did you use to analyze that binary specifically and how much time it took.",
          "time": null
        }
      ]
    }
  ]
}