{
  "title": "Disassembling MIPS 32 version 1 binary with the Radare2 Framework",
  "link": "https://reverseengineering.stackexchange.com/questions/16118/disassembling-mips-32-version-1-binary-with-the-radare2-framework",
  "content": "I am trying to disassemble a MIPS 32 version 1 binary with the Radare2 framework.\n\nHere is the full output of the file command:  \n\n```\nELF 32-bit LSB executable, MIPS, MIPS32 version 1 (SYSV), dynamically linked, \ninterpreter /lib/ld-uClibc.so.0, stripped\n\n```\n",
  "votes": "2",
  "answers": 1,
  "views": "3k",
  "tags": [
    "disassembly",
    "binary-analysis",
    "elf",
    "radare2",
    "mips"
  ],
  "user": "John Thomson",
  "time": "Aug 17, 2017 at 9:10",
  "comments": [],
  "answers_data": [
    {
      "content": "First of all, make sure you run the latest version of radare2 from git repository:\n\n```\n$ git clone https://github.com/radare/radare2.git\n$ cd radare2\n$ ./sys/install.sh\n\n```\nIf you don’t want to install the git version or you want the binaries for another machine (Windows, OS X, iOS, etc) check out the download page at the radare2 website.\n\nTo open MIPS binary with radare2, simply use the following command:  \n\n```\nradare2 -a mips -b 32 ./file\n\n```\nDon't forget to read the manual (man r2), it's all there. \n\nFor more relative information you can watch Andrew McDonnell's talk \n called \"Reverse engineering embedded software using radare2\" (slides: link).  \n\nIf you feel that you need more basic information about radare2 and how to use it, I recommend the following sources:  \n\n",
      "votes": "4",
      "user": "Megabeets",
      "time": "Aug 16, 2017 at 22:21",
      "is_accepted": true,
      "comments": [
        {
          "user": "John Thomson",
          "text": "Thanks for the response Megabeets but my system can run MIPS code and I don't have qemu installed. Wouldn't that command (radare2 -a mips -b 32 ./file) try to run the file because of the ./?",
          "time": null
        },
        {
          "user": "Megabeets",
          "text": "The command will not execute the file. In order to execute the file (i.e open it in debug mode) you need to pass the -d flag to radare. The command mentioned before will open the binary in read-only mode and will help you to conduct static analysis. The prepended \"./\" just means that the file is in the current folder. You can avoid it and simply call it with r2 -a mips -b 32 filename",
          "time": null
        }
      ]
    }
  ]
}