{
  "title": "How to break when specific text is found",
  "link": "https://reverseengineering.stackexchange.com/questions/16159/how-to-break-when-specific-text-is-found",
  "content": "In this line of code:  \n\n```\nmov        eax,dword ptr [eax+8];\n\n```\neax+8 contains a long string of text, I want to find out where it originally came from. \n\nIn either OllyDbg or x32dbg, how can I break when eax contains a certain word e.g. \"haxxor\" \n\nThanks!\n\n",
  "votes": "4",
  "answers": 2,
  "views": "7k",
  "tags": [
    "ollydbg",
    "debugging",
    "breakpoint",
    "x64dbg"
  ],
  "user": "Raz Razman",
  "time": "Aug 22, 2017 at 10:30",
  "comments": [],
  "answers_data": [
    {
      "content": "You are searching for Conditional Breakpoints\n\nIt's possible to set a conditional breakpoint in both OllyDbg 1.01 and 2.00\n\nConditional Breakpoint \n\nIf you want to set a conditional breakpoint when EAX points to \"haxxor\", press Shift+F2 and then enter: UNICODE[EAX] == \"haxxor\"\n\nConditional Log Breakpoint \n\nThis option has more functionality and allows you to see outputs on the log window (Alt+L)\nPress Shift+F4 and then enter: UNICODE[EAX] == \"haxxor\"\n\n \n\nModify the dialog settings to fit best to your needs.\n\nCurrently, as far as I know, there's no support for conditional breakpoints on strings. The feature is planned though and I hope we'll get to see it soon. Meantime, check cndSteroids plugin which you may find helpful.  \n\nMore information about Conditional Breakpoints on x64dbg you can find in the official documentation.\n\n",
      "votes": "7",
      "user": "Megabeets",
      "time": "Aug 22, 2017 at 9:31",
      "is_accepted": false,
      "comments": [
        {
          "user": "Raz Razman",
          "text": "Am I correct in saying this adds a conditional breakpoint on this line only, ie when eax at this exact location contains this string then break? I am trying to find the original of this value, ie at line #7752606 I know eax contains this string, but where and when did that value come from",
          "time": null
        },
        {
          "user": "mrexodia",
          "text": "Just for the record, there is a better string matching plugin available now: github.com/x64dbg/strmatch",
          "time": null
        }
      ]
    },
    {
      "content": "NOTE! \nI realized afterward that it was about Ollydbg... Anyway, I stick to my answer... GDB is great!\n\nGDB is a wonderful debugger! In fact, and only a few people knows about it, it gives access to all the usual libc functions.\n\nFor example, in your case, you may find interesting to set up a conditional on a breakpoint like that (by using strcmp()):\n\n```\nbreak *0xdeadbeef if strcmp(*($eax+8), \"haxxor\") == 0\n\n```\nThis line will stop if you are executing the instruction located at 0xdeadbeef and that the value of the string located at $eax+8 is \"haxxor\".\n\nIf you want to break whenever the value of the string is '\"haxxor\"', then it will be a bit more difficult. Personally, I would set a watchpoint to each character with a condition such as:\n\n```\nwatch *0xdeadbeef if *0xdeadbeef == 'h'\n\n```\nAnd thus, for each character of the string.\n\n",
      "votes": "2",
      "user": "perror",
      "time": "Aug 22, 2017 at 9:33",
      "is_accepted": false,
      "comments": [
        {
          "user": "Ruslan",
          "text": "It's worth noting that calling functions in this way does leave all the side effects it can, first of all changes of data in the proximity of the stack pointer (due to local variables and return address)(not in the stack per se though). This may or may not matter to particular debugging session. Also, this can result in spurious signals like SIGSEGV on *nix/Access Violation on Windows, unless you set unwindonsignal on (e.g. when EAX has bad pointer in your first breakpoint example).",
          "time": null
        },
        {
          "user": "perror",
          "text": "Yes, this is more or less like attaching a debug code to the running program \"on-line\". So, it may break the whole thing. Thanks for mentioning it!",
          "time": null
        }
      ]
    }
  ]
}