{
  "title": "Reverse engineering the virtual machine based crackme",
  "link": "https://reverseengineering.stackexchange.com/questions/16167/reverse-engineering-the-virtual-machine-based-crackme",
  "content": "I am currently working on some crackme, that has implemented an obfuscation technique, virtualisation. The virtual machine inside this crackme is a huge switch-case block (over 130 cases in it). I have already read dozens of article, but none are making things clear enough.\n\nI have found some info though, that I can find some buffer in memory, containing opcodes, that are native assembly code that are then interpreted by the virtual machine in switch cases block. \n\nFinding them will provide an opportunity to write a small disassembler on any language preferred, where in \"case\"-blocks would be the native operations written, like printf(\"mov eax, dword ptr [ebp-4]\"). That way I can figure out the algorithm of generating and checking the serial. \n\nHowever, I am stuck on finding that memory location with opcodes. Can anyone advice me something on how to find these, some techniques, or at least some good literature or tutorials on how to deal with such a thing? May be there are some common ways to crack this kind of crackme.\n\nYour help is very much appreciated.\n\n",
  "votes": "6",
  "answers": 1,
  "views": "3k",
  "tags": [
    "disassembly",
    "crackme",
    "assembly",
    "virtualizers"
  ],
  "user": "ShHolmes",
  "time": "Aug 23, 2017 at 16:38",
  "comments": [],
  "answers_data": [
    {
      "content": "First of all, the fact to turn a program into a bytecode that will be interpreted by a crafted VM which will be embedded into the software is a quite well-known technique of obfuscation. There have been numerous writings about it.\n\nIf you want to find good pointers about it (and how to solve it in different ways), I would advise you to search for \"VM-based obfuscation\" on any search engine. It should provide you with a lot of literature about it.\n\nNow, solving this kind of thing require first to identify the internal language of the machine and then to understand the program that is coded into this language. For now, there have been only very few progress in automating this process and human is still heavily required to guide and understand what is going on in the obfuscated program.\n\nYet, one nice thing you can look at is the fact that the VM itself usually looks like another obfuscation called \"CFG-flattening\" that can be partially processed automatically (even though, I cannot advise you any public tool about it). Anyway, the VM-based obfuscation and the CFG-flattening obfuscation are somehow very close (the CFG-flattening is a subcase of the VM-based obfuscation), so do not hesitate to look at these two techniques and the tricks that may be associated to it.\n\nHere is a bunch of pointers that you may find relevant:\n\nAlso, this question in this website is also relevant to look at.\n\nOf course, you may find more useful links by yourself! Feel free to improve the list on your own! I just hope that these ones will help you a bit.\n\n",
      "votes": "10",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": true,
      "comments": [
        {
          "user": "ShHolmes",
          "text": "Thank you very much for this advice and the links to resources!",
          "time": null
        }
      ]
    }
  ]
}