{
  "title": "APK Tools for Tinder 7.4.0 [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/16291/apk-tools-for-tinder-7-4-0",
  "content": "I wanted to make some Tinder tools, and found some already made APIs.\nI would like go through the process of discovering this private API by myself, since most of the articles are a bit out of date.\n\nMy issue is the following :\n\nConstraint : I can't use a SSL killer on my phone because of security issues that are implied.\n\nIs APK Tools a good tool? Is there another way?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "860",
  "tags": [
    "disassembly",
    "assembly",
    "android",
    "apk",
    "reassembly"
  ],
  "user": "Nvlf",
  "time": "7 years ago",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "FYI here we do \"reverse engineering\", not \"retro-engineering\".",
      "time": null
    },
    {
      "user": "Nvlf",
      "text": "For you, what is the difference? According to wikipedia it seems quite similar (source)",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "I haven't heard the term before; to me it sounds like  \"retrofitting\".",
      "time": null
    },
    {
      "user": "Nvlf",
      "text": "Oh ok, thanks. It feels like it can have both sense. Fun fact, google brought me to reverse engineering reddit community from the retro engineering keyword.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Probably the app has some additional checks against modification. Try to track down the login error shown, maybe you can find the check which triggers it and disable it. \n\nInstead of patching the app itself, you can also try an external solution which would target external libraries to bypass pinning. You'll need to find out which SSL library the app uses and how it detects the certificate mismatch, then either patch the library on disk or in memory, at runtime.\nThis post gives some possible solutions that might work for that.\n\n",
      "votes": "0",
      "user": "Igor Skochinsky",
      "time": "Sep 8, 2017 at 13:09",
      "is_accepted": false,
      "comments": [
        {
          "user": "Nvlf",
          "text": "Thanks a lot for your answer. I'll give it a try then.  About the external solutions, that's why I meant by a SSL Killer. But it needs a rooted phone, and it will most probably disable SSL on every app and connection. And for security purposes, I'd like to avoid this solution.  I've read many papers from researchers, going through certificate pinning on Tinder, and there's no mention of a tampering check, or needs for an external things. That's why I concluded that it's either out of date, or the most probable one, is that I'm not skilled enough since I'm a beginner.",
          "time": null
        }
      ]
    }
  ]
}