{
  "title": "Need help with a USB gaming mouse",
  "link": "https://reverseengineering.stackexchange.com/questions/16392/need-help-with-a-usb-gaming-mouse",
  "content": "I have a Chinese USB gaming mouse (04d9:a070) which has 4 color modes and 4 light levels. I know for a fact that this mouse is capable for showing at least 5 different color so it must be an RGB led (4 legs). The software is the worst I've ever seen and it's incredibly hard to change the color, brightness and mode so it works and doesn't just turn off. Now I'm planning to make my own control software (for Linux first).\n\nI have started with a simple guide \"Reverse Engineering a USB mouse (Updated 3rd May 2017)\" at Bytepunk (can't post a link but Google or DuckDuckGo should find that guide)\n\nI have already sniffed most of the things I need. I used USBlyzer on Windows with the awful control software and got a few hex strings and figured out how to change the color, brightness and mode in the hex strings.\nI pasted the data I discovered here\n (Pastebin)\n\n```\nClicking turn on lights from the Windows control software\n\nout: 07 07 01 00 00 00 00 00 <-- Is this a \"Commands coming in call\"?\nout: 07 09 01 02 00 00 00 00 <-- 07 09 01 0X where X is the color\nout: 07 0C 01 04 00 00 00 00 <-- 07 0Y 01 0Z where Y is the brightness and Z is the mode \nout: 07 13 04 00 00 00 00 00 <-- Is this a \"Commands sent call\"?\n\nX - OFF: 0 RED: 1 BLUE: 2 GREEN: 3 PINK: 4\nY - LOW: B MED: 9 HIGH: C \nZ - STATIC: 1 SLOW PULSE: 2 MED PULSE: 3 FAST PULSE: 4\n\n```\nMy problem is that when I try to \"write\" anything to the device it just hangs and I get a \"[Errno2] Entity not found\" error and the mouse needs to be replugged in order to make it work again. It doesn't \"disconnect\" but it stays in lsusb and nothing special shows up in dmesg.\n\nI pasted my modified python script to Pastebin\n\nI also applied a custom udev rule\n\nSUBSYSTEM==\"usb\", ATTR{idVendor}==\"04d9\", ATTR{idProduct}==\"a070\", GROUP:=\"plugdev\", MODE=\"0666\"\n\nI'm new to serial communications and reverse engineering so I don't know what to search for.\nI think I can post pictures and more data from the USBlyzer in the comments. This is my first post here so I don't have the reputation to give more links.\n\nGreetings, Santeri\n\n",
  "votes": "5",
  "answers": 1,
  "views": "1k",
  "tags": [
    "linux",
    "serial-communication",
    "usb"
  ],
  "user": "user1475122",
  "time": "Sep 24, 2017 at 7:52",
  "comments": [],
  "answers_data": [
    {
      "content": "my understanding of USB is very low at best (even if I do develop some simple USB devices for a living) so read this with major prejudice...\n\n",
      "votes": "4",
      "user": "Spektre",
      "time": "Sep 24, 2017 at 7:56",
      "is_accepted": true,
      "comments": [
        {
          "user": "user1475122",
          "text": "1. pretty much solved my problem. I had the wrong bmRequestType value. I'm not sure why but I got an invalid value from USBlyzer. I used Wireshark this time and got the correct value (0x21). Now I'm able to control the LEDs and other settings. Thank you for the explanation!",
          "time": null
        },
        {
          "user": "Spektre",
          "text": "@user1475122 glad to be of help.",
          "time": null
        }
      ]
    }
  ]
}