{
  "title": "How can I tell if a virus was made by Russians? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/16436/how-can-i-tell-if-a-virus-was-made-by-russians",
  "content": "I have been looking around quite a bit on the internet for something that could tell me more than basic section on a binary.\n\nI have a PE file and usually I see just what compiled it (MSVS or GCC ... ect ), but not necessarily if the file was compiled on a Russian file system. I ran strings on it and I see lots of items thrown in by the compiler. \n\nIs there a way to see what the file was compiled on or anything to identify my authors?\n\nI hope this makes sense. Let me know if you need anymore info please.\n\nThanks\n\n",
  "votes": "0",
  "answers": 1,
  "views": "155",
  "tags": [
    "binary-analysis",
    "decompilation",
    "pe",
    "binary-diagnosis"
  ],
  "user": "LUser",
  "time": "7 years ago",
  "comments": [
    {
      "user": "Paweł Łukasik",
      "text": "do you expect that there is like one way to tell that? it's case by case - and sometimes might be impossible to do",
      "time": null
    },
    {
      "user": "julian",
      "text": "see Identifying the author(s) of a piece of malware and How is Malware Traced to a Specific Country? and When coding style survives compilation: De-anonymizing programmers from executable binaries",
      "time": null
    },
    {
      "user": "LUser",
      "text": "I am curious, I am not asking for a tutorial, but perhaps some ways to identify WHO made this. I would be happy if there are some tell tell signs of what forensic data might be left behind. What some one might not clean up or hide so easily.",
      "time": null
    },
    {
      "user": "LUser",
      "text": "Ok I will look.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Code and binary is really, really hard. People who say it's easy are either stupid or want to sell you something. On the other hand, it's relatively easy if the code in question is created by a completely naive person or they really don't give a damn if it being attributed to them.\n\nFor general education try some results of this search https://www.google.com.au/search?q=attribution+in+infosec+is+hard\n\nPS I recall seeing some research in attributing code and even binaries (at least to compilers) based on statistical methods, but I cannot recall where. Perhaps I imagined it.\n\n",
      "votes": "1",
      "user": "Vitaly Osipov",
      "time": "Sep 29, 2017 at 2:27",
      "is_accepted": false,
      "comments": []
    }
  ]
}