{
  "title": "Disassembling at a memory address",
  "link": "https://reverseengineering.stackexchange.com/questions/16558/disassembling-at-a-memory-address",
  "content": "I started to use radare2 to debug a PE file because it stops working as soon as I run it. When I attach my debugger and continue execution to the point where the exception is thrown I get a memory address in which the exception occurred.\n\nWhat can I do with this address to further analyze the problem at hand?\n\n```\nc484f\\mscorlib.ni.dll) mscorlib.ni.dll\n(14116) loading library at 77130000 (C:\\Windows\\SysWOW64\\ole32.dll) ole32.dll\n(14116) loading library at 70100000 (C:\\Windows\\SysWOW64\\uxtheme.dll) uxtheme.dll\n(14116) loading library at 700A0000 (C:\\Windows\\Microsoft.NET\\Framework\\v2.0.50727\\mscorjit.dll) mscorjit.dll\n(14116) loading library at 6C3C0000 (C:\\Windows\\Microsoft.NET\\Framework\\v2.0.50727\\Culture.dll) Culture.dll\n(14116) unloading library at 6C3C0000 (C:\\Windows\\Microsoft.NET\\Framework\\v2.0.50727\\Culture.dll) Culture.dll\n(14116) Unknown exception e06d7363 in thread 10352\n\n```\n",
  "votes": "3",
  "answers": 2,
  "views": "2k",
  "tags": [
    "disassembly",
    "windows",
    "pe",
    "radare2"
  ],
  "user": "Hooga",
  "time": "Oct 16, 2017 at 16:49",
  "comments": [
    {
      "user": "Paweł Łukasik",
      "text": "what version of r2 are you using?",
      "time": null
    },
    {
      "user": "Hooga",
      "text": "Went to the website and downloaded the most recent",
      "time": null
    },
    {
      "user": "HamZa",
      "text": "Which debugger are you using? Have you tried debugging it with radare2? r2 -d program.exe",
      "time": null
    },
    {
      "user": "Hooga",
      "text": "Yes that is exactly the command I ran",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Since the question in the subject is slightly different than the question in the body of your question, I'll focus on the first one. \n\nIn order to disassemble the code at a specific memory address using radare2 you should use the pd @ <address> command. \n\nAfter attaching radare to the program you should be able to print the disassembly in this specific address. Assuming the pid of the program is 317:  \n\n```\n$ radare2 -d 317\n= attach 317 317\nbin.baddr 0x00400000\nUsing 0x400000\nasm.bits 64\n\n[0x7f2e51727230]> pd @ <address>\n\n```\npd is a subcommand of p and stands for print disassembly. You can check p? and especially pd? for more relevant subcommands. Adding ? at the end of most of the commands in radare will print its help and its subcommands. By default, pd prints b instructions from the specified address where b is the default basic-block size. The default size of b is 0x100 but you can change it easily using b <size>.\n\nThe @ sign is radare's temporary seek address so whenever you want to print the disassembly in a specific address you should use it. The number specified before the @ sign is the number of instructions to print. A common mistake is executing pd with the address before @. Thus, executing pd 0x400000 would print 0x400000 instructions from the current seek.\n\nYou received \"Unknown exception e06d7363\" which is an exception generated by Microsoft Visual C++ compiler.  \n\nAs stated in Microsoft's support page:\n\nTo continue your analysis I'd suggest you to read Decoding the parameters of a thrown C++ exception (0xE06D7363) and its revisited article.\n\nNote that the addresses of the executable in the memory might change in each run, depends on your system and the program itself. Therefore, sometimes you won't be able to predict what would be the address which causes the exception.  \n\nCheck the Migration from ida, GDB or WinDBG page from radare2 book to see radare's corresponding commands to WinDBG's.\n\n",
      "votes": "6",
      "user": "Megabeets",
      "time": "Oct 16, 2017 at 8:41",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "From the manual:\n\nTry:\n\n```\npd @ 0xYourAddress\n\n```\nNote: I am unsure if this will work in the event of an exception.\n\n",
      "votes": "0",
      "user": "Megabeets",
      "time": "Oct 17, 2017 at 10:06",
      "is_accepted": false,
      "comments": [
        {
          "user": "Megabeets",
          "text": "You have a mistake, it should be pd @ 0xYourAddress. Otherwise it'd print 0xYourAddress instructions.",
          "time": null
        },
        {
          "user": "Alpha",
          "text": "Oh, my bad, I'll correct it for future reference. Thank you",
          "time": null
        }
      ]
    }
  ]
}