{
  "title": "What are the overall features used in static analysis of malware? Is file property among the features used in static analysis of malware?",
  "link": "https://reverseengineering.stackexchange.com/questions/16608/what-are-the-overall-features-used-in-static-analysis-of-malware-is-file-proper",
  "content": "I was looking at the paper: \"Improved Detection for Advanced Polymorphic Malware\" by James Fraley who claimed to have used static, dynamic and file properties for increased malware detection. But is file property not a static feature?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "156",
  "tags": [
    "malware",
    "static-analysis"
  ],
  "user": "Faisal Ali Gama",
  "time": "Oct 23, 2017 at 23:01",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "is the term defined in the paper? also, you have two questions in the title, try to be more specific.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The author does not appear to explicitly explain what \"file properties\" are, but some of the papers cited in relation to \"file properties\" discuss the role of malware families in machine-learning based approaches to malware detection. \n\nIt is possible that the author does not provide a clear description of what is meant by \"file properties\" because the term is being used as a buzzword (\"Static analysis, dynamic analysis and file properties? How exciting and novel!\") such that it has no real technical meaning and is employed to draw attention to some aspect of the research deemed new or original. This seems to happen frequently in research investigating applications of machine learning to information security challenges.\n\n\n\nHere are some of the papers cited in relation to the author's use of the term \"file properties\":\n\nText of interest from page 79:\n\nText of interest from page 99:\n\n",
      "votes": "4",
      "user": "julian",
      "time": "Oct 24, 2017 at 1:27",
      "is_accepted": false,
      "comments": []
    }
  ]
}