{
  "title": "Techniques to hide a process (procmon)? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/16627/techniques-to-hide-a-process-procmon",
  "content": "On Windows, how would one go about hiding procmon from another process? What techniques/terms would I be searching for?\n\n",
  "votes": "1",
  "answers": 2,
  "views": "2k",
  "tags": [
    "obfuscation"
  ],
  "user": "user737447",
  "time": "7 years ago",
  "comments": [],
  "answers_data": [
    {
      "content": "You have to write a rootkit for this purpose. Look at this two.\n\nhttps://github.com/landhb/HideProcess\n\nhttps://www.codeproject.com/Articles/167583/Driver-to-Hide-Processes-and-Files-Second-Edition\n\n",
      "votes": "3",
      "user": "EWD-0-",
      "time": "Oct 26, 2017 at 8:36",
      "is_accepted": false,
      "comments": [
        {
          "user": "EWD-0-",
          "text": "Wlc. You can also do patching. It depends on your case.",
          "time": null
        },
        {
          "user": "user737447",
          "text": "Could you elaborate on patching? This is all new to me.",
          "time": null
        },
        {
          "user": "EWD-0-",
          "text": "Please explain for what you need to hide this particular process. Then I can give more details",
          "time": null
        },
        {
          "user": "user737447",
          "text": "I believe I just need to hide the process name. Does 'patching' mean custom kernel with modified list process call?",
          "time": null
        },
        {
          "user": "EWD-0-",
          "text": "No. You've not explained the case in detail yet and without that information, it's' not possible to say which method is the best choice for you.",
          "time": null
        }
      ]
    },
    {
      "content": "If you are trying to hide Procmon from another process, and you control the environment, say in an analysis lab, it may be sufficient just to hook the victim processes methods for obtaining a process list and feed it an incomplete process list. \n\nAnother way to do it would be to hexedit the method that looks for procmon such that it always returns false. \n\nThe rootkit idea above works too, but it might be overkill depending on your situation. \n\n",
      "votes": "0",
      "user": "MrSynAckSter",
      "time": "Oct 26, 2017 at 14:53",
      "is_accepted": false,
      "comments": [
        {
          "user": "user737447",
          "text": "What's used to create the hook?  Hexedit the method?",
          "time": null
        },
        {
          "user": "MrSynAckSter",
          "text": "You need a hooking framework. frida.re/docs/functions works. Depending on your version of Windows, you may have to play with your settings for it to work.",
          "time": null
        }
      ]
    }
  ]
}