{
  "title": "IDA python, write to specific memory location",
  "link": "https://reverseengineering.stackexchange.com/questions/16800/ida-python-write-to-specific-memory-location",
  "content": "I am looking for a way to modify memory location in IDA python script. We can read memory with these functions:\n\n```\nByte(address)\nWord(address)\nDword(address)\n\n```\nWhen I try to do something like this:\n\n```\nByte(address) = value\n\n```\nIDA says that it is not valid to assign to a function call. I tried to use ctypes, however IDA says about unhandled exception on the line:\n\n```\ninclude ctypes\n\n```\nSo how can I write to specific memory location? Thank you.\n\n",
  "votes": "7",
  "answers": 2,
  "views": "10k",
  "tags": [
    "ida",
    "idapython"
  ],
  "user": "user22310",
  "time": "Nov 20, 2017 at 18:24",
  "comments": [],
  "answers_data": [
    {
      "content": "Byte(), Word() and Dword() are idapython's functions and every try to assign a value to a function call in python will end up with \"SyntaxError: can't assign to function call\".\n\nThese 3 functions you have mentioned are used to read the value of a given address, whether it's a byte, word or a dword. You can't use them to set a value to an address.  \n\nIn order to modify a memory location you can use one of the following functions:\n\nPrior IDA 7.0:\n\n```\nPatchByte(ea, value)\n\n```\n```\nPatchWord(ea, value)\n\n```\n```\nPatchDword(ea, value)\n\n```\n```\nPatchDbgByte(ea, value)\n\n```\nIn case you want to get the original byte that was existed before any changes occurred, you should use:\n\n```\nGetOriginalByte(ea)\n\n```\nIDA 7.0:\n\nSince IDA 7.0 has arrived idapython made some changes that worth to mention.\n\nThe names of the functions has changed to patch_byte(), patch_word(), patch_dword(), patch_dbg_byte() and get_original_byte() accordingly, but, as for now, you still can use the old names since \"IDA 7.0/Python/idc_bc695.py\", which is responsible to compatibility, contains a wrapper to these functions.\n\nMoreover, another function was added:\n\n```\npatch_qword(ea, value)\n\n```\nNotice that PatchQword() won't work for you since it was not existed in older versions so there's no reason to create it as a wrapper to patch_qword() for compatibility.\n\nPatching a single byte is very intuitive:\n\n```\nfrom idaapi import *\n\naddress= 0x67643021 \nnew_value = 0xCC\n\nPatchByte(address, new_value)\n\n```\nThis will edit the IDB file to set the value of 0x67643021 to 0xCC. This won't affect the origianl file. In case that you only want to edit the value of the address in the memory and not in the IDB file, you should use PatchDbgByte() instead of PatchByte().\n\nIf you want your changes to affect the original file you'll need to make it by yourself like this:\n\n```\naddress= 0x67643021 \nnew_value = 0xCC\n\n# Open the file\nf = open(\"my_binary.exe\", \"rb+\")\n\n# Seek to the address you want to patch\nf.seek(address)\n\n# Write the new value to this address\nf.write(new_value)\n\n# Close the file\nf.close()\n\n```\nYou can check fwrapper.py by Alexander Hanel and ida-patcher by Peter Kacherginsky to see some code examples that you may find helpful.\n\n",
      "votes": "5",
      "user": "Megabeets",
      "time": "Nov 21, 2017 at 12:20",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "```\nfrom idaapi import *\nfrom idautils import *\nprint Byte(ScreenEA())\nPatchByte(ScreenEA(),100) <--- this will patch the byte at current address to 0x64\nprint Byte(ScreenEA())\n\n```\n",
      "votes": "1",
      "user": "blabb",
      "time": "Nov 20, 2017 at 23:03",
      "is_accepted": false,
      "comments": []
    }
  ]
}