{
  "title": "What sources do you use for gaining information/intelligence about hardware products?",
  "link": "https://reverseengineering.stackexchange.com/questions/1681/what-sources-do-you-use-for-gaining-information-intelligence-about-hardware-prod",
  "content": "When reverse engineering consumer hardware products, it can often be helpful to gain as much information as possible outside of the device itself, including:\n\nI have found the following sources useful:\n\nAre there any other useful sources for finding out such information?\n\n",
  "votes": "12",
  "answers": 2,
  "views": "660",
  "tags": [
    "hardware"
  ],
  "user": "Cybergibbons",
  "time": "Apr 9, 2013 at 12:14",
  "comments": [
    {
      "user": "Cybergibbons",
      "text": "This might be a bit vague. I thought I would try it and see what the community thought.",
      "time": null
    },
    {
      "user": "asheeshr",
      "text": "You could separate the question and the answer into two parts. Its perfectly alright to answer your own quesion. See the FAQ if you dont believe me :)",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@Cybergibbons: rephrasing my question: is this only about electronic hardware? A car is a \"consumer hardware products\", so is a bike or a microwave oven.",
      "time": null
    },
    {
      "user": "Cybergibbons",
      "text": "No, it can be any hardware. The examples I have given only extend to electromechanical hardware though, nothing without any electronics. A lock or safe would be an example of something without electronics.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Not applicable to every device, but always worth checking if the company used any open source software in the design and look at the code provided.  Even if most of the device is proprietary, the open source code might have useful pointers towards basic hardware functionality or implementation details.  \n\nAn example might be a manufacturer that has customized u-boot to function with their board and included a memory map of flash in the source. \n\nOn the google searches front, some chip manufacturers use a very predictable document number format that can be searched for, or use certain phrases that are very uncommon elsewhere, such as \"proprietary and confidential\" on all processor datasheets. \n\nFinally, if a company is particularly stingy with technical details about their device, I expand my search to their business partners.  For example, a processor manufacturer identified that their products were used in Company X's products in marketing materials, even when no literature directly from Company X mentioned anything about what chip or architecture they were using.\n\n",
      "votes": "6",
      "user": "nopnopgoose",
      "time": "Apr 9, 2013 at 14:05",
      "is_accepted": false,
      "comments": [
        {
          "user": "Cybergibbons",
          "text": "I like this answer. On the side of open source, I have found some companies are sneaky. HID Global use open source software, but charge over $100 to provide the software on a CD in the post. I am not sure of the legality of that.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@Cybergibbons: ask the FSF or the SFLC for assistance. Also depends on the license, though. I for one have been trying for over a year to get Zyxel to provide the GPL'd sources to my router's firmware. Only last month I finally got a response.",
          "time": null
        }
      ]
    },
    {
      "content": "Personally my experience is pretty much limited to attempts to reverse engineer electronic hardware, so I'll limit my answer to that area as well. What I've found useful is\n\nThat's it from me. My two cents. I'm sure there are a whole lot of things that I haven't considered in my own searches, so I'm looking forward to other answers.\n\nYes, using search operators can work to your advantage, such as inurl, intitle, filetype and site on Google (e.g. search terms intitle:index inurl:ftp). Unfortunately there doesn't seem to be a standard for search operators and especially meta search engines are very weak on that front, but also Google's competitors, which is sad. There is also one caveat with search operators on Google. You can read about it in this question over on webapps.SE.\n\n",
      "votes": "6",
      "user": "Community",
      "time": "Apr 13, 2017 at 12:57",
      "is_accepted": false,
      "comments": []
    }
  ]
}