{
  "title": "How do you rename a memory address operand in IDAPython?",
  "link": "https://reverseengineering.stackexchange.com/questions/16847/how-do-you-rename-a-memory-address-operand-in-idapython",
  "content": "I need to rename some memory address \"names\" in IDAPython. I'm talking about the dword_805672 formatted ones. Please see the screenshot below:\n\n\n\nI've placed red boxes around the names which I would like to rename with IDAPython. I've searched the API docs and I came up with: idc.MakeName(ea,name) however, as you can see, this only placed a name in the spots labeled dynamic_1, dynamic_2 and so on. I want to rename the actual operand.\n\n",
  "votes": "3",
  "answers": 1,
  "views": "3k",
  "tags": [
    "idapython"
  ],
  "user": "the_endian",
  "time": "Nov 27, 2017 at 4:44",
  "comments": [],
  "answers_data": [
    {
      "content": "idc.MakeName should be the correct api command. I'm assuming that you did something like idc.MakeName(0x123772cd, 'dynamic_3') instead of doing the make name on the actual dword in the instruction.\n\nSomething like this should be done instead:\n\nidc.MakeName(idc.GetOperandValue(0x123772cd, 0), 'dynamic_3')\n\nIn this case idc.GetOperandValue will return the value of the zeroth operand (ie. 0x123ef5e0). That address will then be labeled 'dynamic_3' and IDA should update the UI to show the change. \n\n",
      "votes": "4",
      "user": "Bambu",
      "time": "Nov 27, 2017 at 4:58",
      "is_accepted": true,
      "comments": [
        {
          "user": "the_endian",
          "text": "Yup. That was it, thanks. I hadn't realized that the operand itself has its own address like that in terms of solving this problem. Do you have any tips on how to learn the little fine ins and outs of the API like this? This is the kinda stuff that's not really in the docs :(",
          "time": null
        },
        {
          "user": "Bambu",
          "text": "I usually default to looking at the idc/idaapy/idautil python files when trying to figure out how something is done. Besides that, the resources on reverseengineering.stackexchange.com/questions/11391/… are pretty good.",
          "time": null
        }
      ]
    }
  ]
}