{
  "title": "Difficulty decrypting nested PKCS #7 / AES router configuration file",
  "link": "https://reverseengineering.stackexchange.com/questions/16894/difficulty-decrypting-nested-pkcs-7-aes-router-configuration-file",
  "content": "I am trying to decrypt a router configuration backup file that appears to be a combination of a 128-byte header, a PKCS #7 encrypted file, and another OpenSSL salted format encrypted file.  I think the file encrypts a single data chunk in a nested way in order to hinder its decryption.\n\nI can decrypt the first part with the following command.\n\n```\ndd if=file skip=128 iflag=skip_bytes |\nopenssl smime -decrypt -inform der -in - -inkey server.key -out part1\n\n```\nThis gives me 5550 base-64 encoded bytes, which I can then convert into a 4096 byte binary file.  The distribution of byte values within the file is random: similar to that I obtain from openssl rand.\n\nMy initial guess is that the first part file is a (too long?) key for decrypting the second part file.  Based on commands used in the router's firmware, I tried to decrypt the second part with the decrypted first part as a key, both before and after decoding it with base64.\n\n```\ndd if=file skip=$(grep -abo Salted__ file | cut -d: -f 1) iflag=skip_bytes |\nopenssl enc -d -aes-256-cbc -out decrypted -pass file:part1\n\ndd if=file skip=$(grep -abo Salted__ file | cut -d: -f 1) iflag=skip_bytes |\nopenssl enc -d -aes-256-cbc -out decrypted -pass file:<(base64 -d <part1)\n\n```\nIn both cases I get a bad decrypt error, and the decrypted file appears to contain random bytes.  Any other ideas on how the file could be encrypted?\n\n",
  "votes": "1",
  "answers": 0,
  "views": "237",
  "tags": [
    "firmware",
    "decryption"
  ],
  "user": "Diomidis Spinellis",
  "time": "Dec 3, 2017 at 9:52",
  "comments": [
    {
      "user": "Willem Hengeveld",
      "text": "Can you provide more details, like what router model is this for. And can you post a sample file?",
      "time": null
    },
    {
      "user": "Diomidis Spinellis",
      "text": "I hyperlinked the router in the question.  I'd have to perform a factory reset in order to post a sample file, because the configuration backup contains sensitive authentication information",
      "time": null
    },
    {
      "user": "julian",
      "text": "I think the file encrypts a single data chunk in a nested way in order to hinder its decryption. - If you have access to the code that performs the encryption, it should be possible to reverse engineer this code to recover the algorithm used",
      "time": null
    }
  ],
  "answers_data": []
}