{
  "title": "Can we see local variable directly by inspecting the disk image (file in disk)?",
  "link": "https://reverseengineering.stackexchange.com/questions/16997/can-we-see-local-variable-directly-by-inspecting-the-disk-image-file-in-disk",
  "content": "As far as I know, global and static variables are stored in heap memory, while local variables are on stack memory. I think this is the case when we speak about a binary file (like PE) that is located in memory. If this is correct, I am wondering: Are local and global variables stored plainly in a disk image (binary in Disk), can we see them directly by inspecting the disk image?\n\n",
  "votes": "2",
  "answers": 2,
  "views": "211",
  "tags": [
    "windows",
    "stack"
  ],
  "user": "Aan",
  "time": "Nov 30, 2017 at 4:14",
  "comments": [
    {
      "user": "user2073973",
      "text": "Yes, you can usually find these variables in the .data section",
      "time": null
    },
    {
      "user": "Aan",
      "text": "@user2073973 Even local variables?",
      "time": null
    },
    {
      "user": "user2073973",
      "text": "@Aan if by local values you mean something like, std::string = \"bla\"; then yes. The \"bla\"const char array will be stored on the .data (depending on your compiler settings) section.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "First, local variables needn't be stored on the stack. Modern compilers will first try to use CPU registers to store local variables.\n\nNext, heap and stack are terms that relate to virtual memory. Virtual memory starts to exist when the operating system creates the process. It does not exist when the file is on disk only. Therefore, you can never see a variable on disk.\n\nNow, @user2073973 left a comment that the variables are stored in the .data section. This is typically true, but\n\n",
      "votes": "3",
      "user": "Thomas Weller",
      "time": "Dec 3, 2017 at 20:38",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Data storage on modern OSes and their appropriate file formats is far more complex than that.\n\nThere are multiple locations to store variables, of those the more predominant are:\n\nThe last one, the pre-allocated regions, is the only type of variable storage encoded in the PE file directly and the only one there's a chance to access from the hard drive, but only initial values are readable. You cannot use that to read current variable values (because those will only be stored in memory).\n\n",
      "votes": "1",
      "user": "NirIzr",
      "time": "Dec 20, 2017 at 11:59",
      "is_accepted": false,
      "comments": []
    }
  ]
}