{
  "title": "Inject code into exe",
  "link": "https://reverseengineering.stackexchange.com/questions/17003/inject-code-into-exe",
  "content": "I don't know whether this is the right place to ask this question. I want some guide lines on this subject because I don't know how to search my problem in the internet.\n\nI want to create an executable file which can inject code into a targeted (another) executable file and run that target. What I talking about is not a patched exe. I want that exe to inject the code and run the program.\n\nIs it possible to create such executable files..? If it is, can you please tell me some guiding materials..?\n\nps: when I search about injection, I get only about dll injection and it is not I want.\n\nThank You!!\n\n",
  "votes": "1",
  "answers": 1,
  "views": "9k",
  "tags": [
    "patching",
    "injection"
  ],
  "user": "Ramesh-X",
  "time": "Dec 19, 2017 at 12:19",
  "comments": [
    {
      "user": "EWD-0-",
      "text": "Search for code injection... You'll get dozens of articles and source code",
      "time": null
    },
    {
      "user": "julian",
      "text": "code injection takes place at runtime, not before. Modifying a binary before it is executed = patching, which you said you are not interested in. I want that exe to inject the code and run the program - this does not make sense.",
      "time": null
    },
    {
      "user": "Ramesh-X",
      "text": "@SYS_V I might be using words incorrectly. But if you get the idea, I just want to make an exe (program 1) to run another exe (program 2) with my code injected. So if I delete program 2 and run program 1, it will not run properly.",
      "time": null
    },
    {
      "user": "julian",
      "text": "No, I don't get the idea. Do you understand conceptually how code injection works and what it means? Maybe you should explain why you are trying to do this.",
      "time": null
    },
    {
      "user": "EWD-0-",
      "text": "@SYS_V we have two kinds of patching... in memory while execution and the file itself before execution. You have to make it clear what you mean by execution, 1. execution of the file or 2. execution of that particular instruction.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Start here--specifically, the third technique: \"The CreateRemoteThread & WriteProcessMemory Technique\". To quote:\n\nYou could also use the WriteProcessMemory function to write bytes directly, whether it's overwriting bytes directly or code-caving. There are nuances to keep in mind, though, like making sure the permissions of the memory you're writing to are set properly (read/write/execute), ala the Virtual* functions.\n\n",
      "votes": "8",
      "user": "dsasmblr",
      "time": "Dec 19, 2017 at 15:27",
      "is_accepted": true,
      "comments": [
        {
          "user": "Ramesh-X",
          "text": "This was helpful, thanks!! And I was looking at your youtube channel. It is good.",
          "time": null
        }
      ]
    }
  ]
}