{
  "title": "Decompiling .pyc files",
  "link": "https://reverseengineering.stackexchange.com/questions/1701/decompiling-pyc-files",
  "content": "Does anybody have a suggestion for (non commercial) software to decompile \"byte-code\" Python (.pyc) files?\n\nEverything I've found seems to break...\n\n",
  "votes": "27",
  "answers": 7,
  "views": "97k",
  "tags": [
    "tools",
    "decompilation",
    "python"
  ],
  "user": "Carlos Garcia",
  "time": "Apr 10, 2013 at 14:27",
  "comments": [
    {
      "user": "Ange",
      "text": "tried uncompyle2 ?",
      "time": null
    },
    {
      "user": "alexanderh",
      "text": "I haven't read it yet so I won't offer as an answer but A Problem Course in Compilation: From Python to x86 Assembly might be of use. link",
      "time": null
    },
    {
      "user": "Carlos Garcia",
      "text": "Alex, you kill me. Another PDF to my huge \"To read\" stack. Looks pretty interesting, thanks ;)",
      "time": null
    },
    {
      "user": "jvoisin",
      "text": "possible duplicate of What are the tools to analyze Python bytecode?",
      "time": null
    },
    {
      "user": "pestophagous",
      "text": "uncompyle6 has now superseded uncomplye2. credit to other answer for helping me learn this: stackoverflow.com/a/14808336/10278",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "What Python version you're decompiling? Py3k is not well supported, but there are quite a few decompilers for 2.x. One of the latest projects is this:\n\nhttps://github.com/Mysterie/uncompyle2\n\nIt runs on Python 2.7 but supports decompiling 2.5 to 2.7.\n\nNote that some commercial projects has been known to use modified Python interpreters. Modifications can include:\n\nIf you need to handle this, one approach is to convert non-standard bytecode to standard one and then use the usual decompilers (this apparently was used by the people from above project to decompile Dropbox code). Another is to change the decompiler to directly support the variations.\n\n",
      "votes": "25",
      "user": "Igor Skochinsky",
      "time": "Apr 10, 2013 at 14:12",
      "is_accepted": true,
      "comments": [
        {
          "user": "pestophagous",
          "text": "update from 2018 (five years later): uncompyle6 has now superseded uncomplye2. credit to other answer for helping me learn this: stackoverflow.com/a/14808336/10278",
          "time": null
        }
      ]
    },
    {
      "content": "You might find pyREtic from Immunity to be useful. The presentation from BlackHat USA 2010 on pyREtic is here (YouTube).\n\n",
      "votes": "13",
      "user": "Community",
      "time": "Feb 29, 2016 at 14:29",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I, of course, use uncompyle6. Disclaimer: I work on this project.\n\nI've written at length about the uncompyle6 and pycdc here.\n\n",
      "votes": "4",
      "user": "rocky",
      "time": "Nov 13, 2018 at 18:26",
      "is_accepted": false,
      "comments": [
        {
          "user": "Olivier Lasne",
          "text": "I did use this for a CTF, I am impressed by the quality of the code generated (for a simple pyc in my case).",
          "time": null
        }
      ]
    },
    {
      "content": "For initial and rough Python bytecode disassembly, I would be using the Python standard library dis module: https://docs.python.org/2/library/dis.html\n\n",
      "votes": "2",
      "user": "lockout",
      "time": "Feb 29, 2016 at 18:37",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Here is what you're looking for, I just came across a fully working Python decompiler named \"Easy Python Decompiler\".\n\n",
      "votes": "1",
      "user": "0xC0000022L",
      "time": "Nov 13, 2018 at 8:38",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "There is also an open-source Python (.pyc) decompiler, called Decompyle++\n\nDecompyle++ aims to translate compiled Python byte-code back into valid and human-readable Python source code. \nWhile other projects have achieved this with varied success, Decompyle++ is unique in that it seeks to support byte-code from any version of Python.\n\n",
      "votes": "0",
      "user": "0xC0000022L",
      "time": "Nov 12, 2018 at 22:18",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I recommend uncompyle6. it can decompile pyc/pyo files and it is compatible with python 3\n\n",
      "votes": "0",
      "user": "REEDNIV",
      "time": "May 8, 2021 at 0:35",
      "is_accepted": false,
      "comments": [
        {
          "user": "bikalpa",
          "text": "Could not find a version that satisfies the requirement decompyle3.",
          "time": null
        }
      ]
    }
  ]
}