{
  "title": "Fixing the checksum of a modified Android ELF",
  "link": "https://reverseengineering.stackexchange.com/questions/1703/fixing-the-checksum-of-a-modified-android-elf",
  "content": "I've hex-edited a string in an Android ELF binary.\nNow, it won't run, and gives the error message CANNOT LINK EXECUTABLE, presumably due to a bad checksum.\n\nDoes anybody have a tool to fix the checksum? \n\n",
  "votes": "10",
  "answers": 2,
  "views": "3k",
  "tags": [
    "tools",
    "android",
    "elf"
  ],
  "user": "user1636717",
  "time": "Apr 11, 2013 at 16:33",
  "comments": [
    {
      "user": "Denis Laskov",
      "text": "Did You replaced string in ELF with SAME SIZE string, or add a different amount of bytes? Can You test the concept by replacing this string with something with same size and execute it?",
      "time": null
    },
    {
      "user": "0xea",
      "text": "Would this actually be an Android ELF file?",
      "time": null
    },
    {
      "user": "zetavolt",
      "text": "Can you attach the output of objdump -x and readelf -a of the file?",
      "time": null
    },
    {
      "user": "user1636717",
      "text": "It's an android ELF.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "ELF itself doesn't specify any kind of checksum. Your link error is likely due to an incorrect edit which changed some offsets within the file. If you don't adjust the offsets, you have to replace a string with a string that is no longer than the original, and you cannot add new fields unless you have a known amount of slack space available.\n\nUse readelf -a to check the ELF file headers, and compare old with new.\n\n",
      "votes": "8",
      "user": "nneonneo",
      "time": "Apr 11, 2013 at 1:11",
      "is_accepted": true,
      "comments": [
        {
          "user": "user1636717",
          "text": "It wasn't the string I edited it was a symbol name with the same name :-O. Bad luck and me not checking if my constant appears more than once in the file.",
          "time": null
        }
      ]
    },
    {
      "content": "I'd suggest using HT Editor for all your ELF fun. \n\nThat's what it's made for. \nThere are other tools of course. \n\n",
      "votes": "1",
      "user": "0xea",
      "time": "Apr 10, 2013 at 17:44",
      "is_accepted": false,
      "comments": [
        {
          "user": "Ange",
          "text": "Can you also explain how to fix the checksum with HTE ?",
          "time": null
        },
        {
          "user": "0xea",
          "text": "not sure what checksum is user1636717 speaking of really, that's why i asked what kind of ELF is it",
          "time": null
        }
      ]
    }
  ]
}