{
  "title": "Functions without a prologue and epilogue?",
  "link": "https://reverseengineering.stackexchange.com/questions/17109/functions-without-a-prologue-and-epilogue",
  "content": "I was just wondering what exactly causes a function without a prologue/epilogue to be generated? If a program is compiled with just stdcall/cdecl convention, why is it that there are some calls which lead to a subroutine that doesn't have the typical push ebp -> mov ebp,esp. Are these just sanity checks generated by the compiler? Are these subroutines important? Or is that impossible to say without actually analysing it? For example, would a compiler produce a call to a subroutine which moves one value into eax and then returns or would that be the programmer changing the binary of the executable?\n\n",
  "votes": "4",
  "answers": 2,
  "views": "2k",
  "tags": [
    "functions"
  ],
  "user": "Xymistic",
  "time": "Jan 4, 2018 at 6:44",
  "comments": [
    {
      "user": "Jongware",
      "text": "Do you know what the purpose is from a prologue/epilogue?",
      "time": null
    },
    {
      "user": "user2073973",
      "text": "What this prologue code does is save the stack frame address. Later on at the end of the function, in the epilogue code, the stack frame gets restored again. You can disable this behaviour in the compiler flags if you wish.",
      "time": null
    },
    {
      "user": "Ciro Santilli OurBigBook.com",
      "text": "Related: stackoverflow.com/questions/43310704/…",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The prologue and epilogue are not required by the CPU to execute functions, so most compilers only generate them when necessary, or optimization is not enabled. In particular, leaf functions (those that don't call other functions) do not usually need a prolog (unless required by the ABI) and the compiler may safely omit it.\n\n",
      "votes": "7",
      "user": "Igor Skochinsky",
      "time": "Jan 5, 2018 at 13:37",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Frame-Pointer Omission compiler option:\nhttps://msdn.microsoft.com/en-us/library/2kxx5t2c.aspx\n\nFor gcc see -fomit-frame-pointer\nhttps://gcc.gnu.org/onlinedocs/gcc-4.5.2/gcc/Optimize-Options.html\n\n",
      "votes": "1",
      "user": "Anton Kukoba",
      "time": "Jan 5, 2018 at 9:39",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jongware",
          "text": "That is quite specific for Microsoft's compiler – which indicates that without, it will generate a prologue/epilogue even when not needed. I dare say there is another, better reason.",
          "time": null
        },
        {
          "user": "Anton Kukoba",
          "text": "No, it disables prologue/epilogue generation it /Oy specified. And this is default behavior for the Release build. But you may specify /Oy- if you still want prologues in release code.",
          "time": null
        }
      ]
    }
  ]
}