{
  "title": "Trying to identify the JTAG/RS232 port on this board",
  "link": "https://reverseengineering.stackexchange.com/questions/17131/trying-to-identify-the-jtag-rs232-port-on-this-board",
  "content": "I am doing some research into smart devices. I realized that the device is communicating with an Internet end-point but the communication is encrypted (and using a proxy tool doesn't work). \n\nI want to see if I can reverse engineer the firmware or get access to the scripts on the controller to further analyse the functionality. \n\n",
  "votes": "4",
  "answers": 2,
  "views": "782",
  "tags": [
    "hardware"
  ],
  "user": "Lucas Kauffman",
  "time": "Jan 6, 2018 at 13:35",
  "comments": [
    {
      "user": "yaspr",
      "text": "First, remove the sticker from the chip to get the part's ID so we can look up the data sheet and help you. At first glance this looks like a Kevo Hub for smart locks with a Power plug, a Ethernet port and an antenna mount. You'll be most likely dealing with an ARM SoC given the size of what I see.",
      "time": null
    },
    {
      "user": "Lucas Kauffman",
      "text": "you are right about the kevo plus, the chip indeed is an ARM CPU digikey.sg/product-detail/en/nxp-usa-inc/MK60DN512VLL10/…",
      "time": null
    },
    {
      "user": "Spektre",
      "text": "as numind suggest you should download datasheet/pinout and look which pins are connected to the connectors. Also take a look at this Thought I found serial port - broke embedded device instead! Help? see both answers",
      "time": null
    },
    {
      "user": "dyasta",
      "text": "Be sure to try those test points, and other potentials, to see if you have an accessible RS232 (serial) connection. Find a 3.3v source and then check for I/O from the pins/points, which may appear as garbage. From there, determine the baud rate in use so you aren't getting garbage. Hopefully it isn't encrypted or otherwise disabled. A good serial shell may allow you to dump the FLASH or otherwise interact with the OS in easier ways. Case in point, look where I found serial on this little router years ago: bitsum.com/openwiking/owbase/WL530G",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "J2 looks suspiciously close to the classic ARM 20-pin JTAG connector\n\n",
      "votes": "5",
      "user": "Igor Skochinsky",
      "time": "Jan 6, 2018 at 18:51",
      "is_accepted": false,
      "comments": [
        {
          "user": "Lucas Kauffman",
          "text": "The chipset is ARM powered",
          "time": null
        },
        {
          "user": "Lucas Kauffman",
          "text": "I am a complete newbie to this, I assume I probably need to solder some connector pins onto that J2. Then I will need some type of cable to connect to a computer?",
          "time": null
        }
      ]
    },
    {
      "content": "Well, the fastest way is get datasheet of MCU and test data pins for get JTAG access and dump main code from RAM. Also you can measure pin volts looking for 3.3v and place Rx and Tx rs232 for get console.\n\nElse if you dont have JTAG access you should start to think about desolder flash chip (in case it exists) but in this case the code seems to be written into flash area of the MCU.\n\nSo finally successful depends on IC security...Maybe some some glitch at the right place and moment could help as well..\n\nGood luck\n\n",
      "votes": "2",
      "user": "numind",
      "time": "Jan 6, 2018 at 14:16",
      "is_accepted": false,
      "comments": []
    }
  ]
}