{
  "title": "IDA Pro Search classes within a Dex file inclusive of package name",
  "link": "https://reverseengineering.stackexchange.com/questions/17189/ida-pro-search-classes-within-a-dex-file-inclusive-of-package-name",
  "content": "Let's just assume that our classes.dex file has a class:\n\n```\ncom.example.MyClass\n\n```\nin which there's a method \"meth\":\n\n```\npublic final com.example.MyClass.meth(java.lang.String p0)\n\n```\nhow/where can I search the code of the method \"meth\" with the string \"com.example.MyClass.meth\"?\n\nBecause in the Local Types view I can only find the class but I can't reach the code and in the Names/Functions windows I can only search the method name (think what you can get with an obfuscated code) prefixed by the class name so there are a lot of duplicates.\n\nFYI:\nIDA pro (I'm using the version 7) supports officially Dalvik bytecode disassembling and debugging.\n\n",
  "votes": "1",
  "answers": 2,
  "views": "1k",
  "tags": [
    "ida",
    "android"
  ],
  "user": "Simone Aonzo",
  "time": "Jan 14, 2018 at 10:33",
  "comments": [],
  "answers_data": [
    {
      "content": "What does work is a text search for a string like com.foo.bar.Method - press Alt+T in the disassembly, mark \"Match case\", \"Identifier\". This should help find you the actual method body, at least it's what I have been using.\n\nI don't think it's ideal but also I don't know of a better way either. For bigger APKs this can be quite slow but at least it solves the problem.\n\n",
      "votes": "1",
      "user": "Johann Aydinbas",
      "time": "Feb 13, 2018 at 17:48",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "You're abusing IDA Pro, it's best in decompiling/disassembling code that has been actually compiled, not Java. While IDA Pro sort of supports Java decompilation (I guess you're interested in Android stuff), there are much more convenient decompilers for Java pseudocode. JEB is the best for Android, in my opinion. I haven't used it much recently, though.\n\nOr even \"decompile\" the whole dex into a text file via and grep.\n\nhttps://www.google.com.au/search?q=dex+decompiler\n\nIf you're looking at pure Java - again, tons of \"decompilers\". Even IntelliJ has a plugin :)\n\n",
      "votes": "0",
      "user": "Vitaly Osipov",
      "time": "Jan 14, 2018 at 6:54",
      "is_accepted": false,
      "comments": [
        {
          "user": "Simone Aonzo",
          "text": "Thanks for your answer, but imho you're wrong. IDA Pro supports officially Dalvik bytecode disassembling and debugging. Moreover it's a simple search feature in already available data... I'm not asking for the moon!",
          "time": null
        }
      ]
    }
  ]
}