{
  "title": "mathematical background behind exploit development and vulnerabilities",
  "link": "https://reverseengineering.stackexchange.com/questions/1727/mathematical-background-behind-exploit-development-and-vulnerabilities",
  "content": "I would like more information about the mathematical foundations of vulnerability and exploit development.online sources or books in the right direction will be helpful.\n\n",
  "votes": "10",
  "answers": 2,
  "views": "2k",
  "tags": [
    "vulnerability-analysis"
  ],
  "user": "viv",
  "time": "Apr 11, 2013 at 18:39",
  "comments": [],
  "answers_data": [
    {
      "content": "I would read up on static program analysis\n\ndynamic program analysis,\n\nabstract interpretation,\n\nsymbolic execution,\n\nsymbolic computation,\n\nsymbolic simulation,\n\nmodel checking,\n\nmight want to read System Assurance: Beyond Detecting Vulnerabilities.\n\nRolf probably has a ton of really good input on this subject. Read about his advice here\n\n",
      "votes": "10",
      "user": "Peter Andersson",
      "time": "Apr 11, 2013 at 19:05",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "As it turns out, somebody asked roughly the same question on reddit about a year ago and I posted a rather extensive answer to it, and I have continued to edit it in the meantime.\n\n",
      "votes": "5",
      "user": "Rolf Rolles",
      "time": "Apr 11, 2013 at 19:05",
      "is_accepted": false,
      "comments": [
        {
          "user": "Peter Andersson",
          "text": "Would you mind quoting the most important parts here in case Reddit goes offline for whatever reason?",
          "time": null
        },
        {
          "user": "Rolf Rolles",
          "text": "Well ... I think it doesn't make sense to simultaneously maintain two copies of this.  As I said, I still edit it from time to time, and duplicating it means that I would have to edit multiple copies of it in the future.  But I suppose you are referring to StackExchange's \"quote some relevant portion to demonstrate that the link pertains to the question\" policy.",
          "time": null
        },
        {
          "user": "Peter Andersson",
          "text": "Yeah I get why you wouldn't want to maintain two versions to be honest. Not sure how solve it \"properly\". Quote and copy the entire thing without the links? The list if really good imo.",
          "time": null
        },
        {
          "user": "ekse",
          "text": "The indexing and search is much better on Stack Overflow than on Reddit imo so I would recommend maintaining the list here. Just my 2cents.",
          "time": null
        }
      ]
    }
  ]
}