{
  "title": "Adding additional language to Linux based Firmware of Volkswagen Car Radio",
  "link": "https://reverseengineering.stackexchange.com/questions/17342/adding-additional-language-to-linux-based-firmware-of-volkswagen-car-radio",
  "content": "I'm owning a CarPlay head unit from Volkswagen called RCD330 plus. It is possible to upgrade/downgrade to any available firmwares. For example here are two firmware versions: http://rcd330plus.com/rcd/variantconflict_Eror.rar\n\nThe firmware file itself is a *.tar file and can be extracted. I found a linux file structure (var, etc, opt, ... folders).\n\nMy goal:\n\nThe head unit supports only a few languages like Chinese, Mexican, US English, ... and I want to add support for German language.\n\nWhat I tried already\n\n(1) I checked nearly every file with a HEX editor (iHex for Mac OS X) and found one 9.4MB big file called hmi (without extension) in folder /opt/ and this file contains all labels:\n\n\n(2) I checked this hmi file with binwalk and get this output:\n\n\n\nWhere can I get information/knowledge to add an additional language. Maybe also with adding german language flag in the setup menu of the radio?\nOr is this just impossible?\n\nIs this hmi file a compiled file or is it kind of some archiv which can be somehow extracted?\n\n",
  "votes": "0",
  "answers": 2,
  "views": "3k",
  "tags": [
    "firmware",
    "linux",
    "embedded"
  ],
  "user": "mahega",
  "time": "Jan 30, 2018 at 21:20",
  "comments": [
    {
      "user": "Murat",
      "text": "I have same radio RCD330 plus. Hardware version is 5GD 035 280 B. Have you succeded in installing German language into the radio? Can you please give information regarding how can I connect radio to install language package?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "As binwalk points out, this file is a compiled executable, and you don't even need binwalk for it:\n\n```\n$ file hmi\nhmi: ELF 32-bit LSB executable, ARM, EABI5 version 1 (SYSV), dynamically linked, interpreter /lib/ld-linux.so.3, for GNU/Linux 2.6.31, stripped, with debug_info\n\n```\nStrings you can see in a hex editor are embedded into the binary and are referenced directly from the code. As to whether or not it's possible to add a new language with a reasonable effort, consider the following:\n\nI think an easier way would be replacing strings from one of existing languages:\n\n```\n$ strings hmi | grep ias\ndias\nSolo emergencias\nncias na conex\nPuede haber interferencias\nMemorias\nLista de memorias FM\n\n```\nThe downside here is that translated strings can't be longer than original ones (which is unfortunate for German), otherwise data offsets would change. However, it's certainly easier than remapping the whole executable.\n\n",
      "votes": "3",
      "user": "Vladislav Ivanov",
      "time": "Jan 31, 2018 at 10:34",
      "is_accepted": false,
      "comments": [
        {
          "user": "mahega",
          "text": "Thanks. I also faced the problem with replacing string of an existing language (e.g. Mexican) to German is not possible, cause the new string would be longer. So in other words there is no solution for my plan, right?",
          "time": null
        },
        {
          "user": "Vladislav Ivanov",
          "text": "I think the only more or less feasible solution is to use some sort of abbreviations or anglicisms and replace an existing language. I think it's possible to rebuild the binary with changed string lengths (and offsets), but I'm not sure how complex this task can be. I would start by disassembling the binary and writing a linker script to assemble it back from section data. Since it's not encrypted or otherwise protected there's a chance it will work.",
          "time": null
        }
      ]
    },
    {
      "content": "In meantime there is already a German version. But that one used the HMI file with an hexeditor and they replaced character by character.\nBut now is another person busy with replacing them better\nhttps://www.reddit.com/r/RCD_330/comments/bh6p0j/wip_language_translations_rcd_330_ce_types/\n\nEverything is here downloadable\nhttps://www.reddit.com/r/RCD_330/\n\n",
      "votes": "1",
      "user": "571",
      "time": "May 31, 2019 at 10:40",
      "is_accepted": false,
      "comments": []
    }
  ]
}