{
  "title": "AT&T - Does assembly code return whatever is in %eax by default?",
  "link": "https://reverseengineering.stackexchange.com/questions/17406/att-does-assembly-code-return-whatever-is-in-eax-by-default",
  "content": "I have the following AT&T assembly code:\n\n```\n  movl 12(%ebp),%eax\n  cmpl %eax,8(%ebp)\n  jle L7\n  movl 8(%ebp),%eax\nL7:\n  leave\n\n```\nI'm supposed to \"transpose\"(??) it to C code. I actually just have to fill in the blanks in this skeleton C code:\n\n```\nint g(int x, int y) {\n    if (x ______ y)\n        return ______;\n    else\n        return ______;\n}\n\n```\nFrom what I unerstand, the assembly is going to return whatever is in %eax when done.\n\nSo this is how I understand what's happening:\n\nThe cmpl %eax,8(%ebp) line is comparing x (8(%ebp)) with y (%eax). If x is <= to y, we jump to L7: and return whatever is in %eax at that time, which is y. Otherwise, we proceed to the next line in the assembly code and movl x (8(%ebp)) to %eax, and return whatever is in %eax, which would be x at that point.\n\nIn the end, this is what I think is happening:\n\n```\nint g(int x, int y) {\n    if (x <= y)\n        return y;\n    else\n        return x;\n}\n\n```\nAm I correct in saying that the assembly returns whatever is in %eax when the assembly code is finished running?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "255",
  "tags": [
    "assembly",
    "decompilation"
  ],
  "user": "velkoon",
  "time": "Feb 7, 2018 at 8:40",
  "comments": [],
  "answers_data": [
    {
      "content": "Assembly doesn't \"return\" anything.\n\nIn assembly, it is left to the programmer to decide how to pass values between the caller and callee routines.  In order to avoid things getting messy, calling conventions have been devised.\n\nYour question therefore becomes \"what calling convention was used to compile the unknown C code to the known assembly?\"\n\nWhen compiling for x86 architectures, C compilers usually use the cdecl convention. \n Working on the assumption that was the convention used here, then integer results would indeed always be returned in register EAX.\n\n",
      "votes": "1",
      "user": "eggyal",
      "time": "Feb 7, 2018 at 9:13",
      "is_accepted": true,
      "comments": []
    }
  ]
}