{
  "title": "Odd convention for accessing elements of an array?",
  "link": "https://reverseengineering.stackexchange.com/questions/17491/odd-convention-for-accessing-elements-of-an-array",
  "content": "While reverse engineering a game using the Hex Rays decompiler I was looking for how an array of NPC's was accessed. I found the array but I don't quite understand the unusual formula for getting the index of the NPC. First an integer is & with 0xFFF then the result is multiplied by 4 to get the index.\n\nExample:\n\n```\ndword_1F4A8A5C[4 * (v3 & 0xFFF)]\n\n```\nI'm really not sure if this is standard or if it's weird output from the Hex Rays decompiler. If anyone has an explanation please let me know. Thanks.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "403",
  "tags": [
    "ida",
    "c++",
    "c",
    "hexrays",
    "array"
  ],
  "user": "Edward Severinsen",
  "time": "Feb 18, 2018 at 21:22",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "what is the type of dword_1F4A8A5C? (press Y on it or hover mouse).",
      "time": null
    },
    {
      "user": "Edward Severinsen",
      "text": "@IgorSkochinsky It's an array of integers. The dll I'm reversing is 32-bit and the element it accesses is the address of the NPC/enemy.",
      "time": null
    },
    {
      "user": "w s",
      "text": "It looks like that it is array of structures, where v3 is an index and 0xfff is used to avoid overfflow - I'd suggest that the array was originally defined with size 0x1000. The size of a structure should be 4 dwords.",
      "time": null
    },
    {
      "user": "Edward Severinsen",
      "text": "@ws Okay, after you explained it this makes more since. v3 & 0xFFF doesn't allow anything over 0x999. And I had the misconception that it was an array of pointers to structures. Not an actual array of structures. Thank you, you've helped tremendously. If you would like you can turn it into an answer and I'll accept it.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "It looks like that it is array of structures, where v3 is an index and 0xfff is used to avoid overflow.\nI'd suggest that the array was originally defined with size 0x1000. The size of a structure should be 4 dwords.\n\n",
      "votes": "2",
      "user": "w s",
      "time": "Feb 20, 2018 at 15:52",
      "is_accepted": true,
      "comments": []
    }
  ]
}