{
  "title": "Rootkit.Fileless.MTGen Reverse Engineering",
  "link": "https://reverseengineering.stackexchange.com/questions/17527/rootkit-fileless-mtgen-reverse-engineering",
  "content": "Has anyone tried seeing what's inside of this malware? It ended up on one of our work machines. I copied the files to a thumb drive before setting the machine up for reimaging. Though the AV software kept saying it was removed, it kept coming back.\n\nI noticed 3 outbound connections. Two were to Amazon AWS servers and one was to a machine in Panama based on the IP.\n\nAll the included .bat files are the same as below. I've checked against different encryption types but haven't had any luck figuring out the commands in the file. All of the executable have a 3 character extension. Looked at them in a hex editor and am unable to pull any useful data.\n\nThis is more out of curiosity than anything. \n\n```\n    echo KWvBTeEhoOBvYGBOV0L9i07izYZQZ6eUNvN\necho UHCxEg2gVic\necho FgXcH8LAyBRqqlUil8L\necho EqXkXZQa0\necho 3BPrg\necho ptGFX9BkqRJM50l0ZhOy4FHpc2TYBtayl70\necho FfStAj3XYV5w9u\nstart \"Lnvqgn8kWPwvFipqD8tLpq\" \"%LOCALAPPDATA%\\Gm Ugc\\iqgux rez.dcah\"\necho f199qjLWdJ6URiTJLa3AC0\necho bF6MorMQoqttAWAMHa\necho Kpme1Fkmm\necho kLShOlr2t\necho sTNvUyM5FjoN89YzL3CFCdi5d6bknL\necho K6n2kL9BxaAY9NlDD8tFg\n\n```\n",
  "votes": "1",
  "answers": 1,
  "views": "192",
  "tags": [
    "malware"
  ],
  "user": "RRice",
  "time": "Feb 23, 2018 at 11:47",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "the echos seem to be just random noise, possibly to reduce detection rate. The meat is probably in the iqgux rez.dcah binary.",
      "time": null
    },
    {
      "user": "RRice",
      "text": "other than a hex editor, there away to look inside the binary?",
      "time": null
    },
    {
      "user": "Fewmitz",
      "text": "To actually do proper reverse engineering you'll at a minimum want to open it up in a disassembler and debugger to see what it's doing. IDA  still the de-facto standard and has a free variant however it may not work for 64bit binaries. That being said, Rootkit.Fileless.MTGen is a generic detection and can be multiple different kinds of malware with a rootkit component",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@Fewmitz: if this is live malicious code, running it in a debugger without further precautions is actually a pretty bad idea.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "the echo  statements seem to be just random noise, possibly to reduce antivirus detection rate. The only line which is actually doing something is this one:\n\n```\nstart \"Lnvqgn8kWPwvFipqD8tLpq\" \"%LOCALAPPDATA%\\Gm Ugc\\iqgux rez.dcah\"\n\n```\nIt starts a new process using a file located in  %LOCALAPPDATA%\\Gm Ugc\\iqgux rez.dcah, so it's probably an executable containing the actual functionality of malware. You will need to analyze it to figure out what it does (e.g. using a disassembler or a decompiler, depending on the file format).\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Feb 26, 2018 at 18:48",
      "is_accepted": false,
      "comments": []
    }
  ]
}