{
  "title": "Windows Wiki : Books and Tutorials [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/1754/windows-wiki-books-and-tutorials",
  "content": "This post is for collecting all the best books and tutorials that exist dealing with windows specific reverse engineering techniques and concepts. The content will be added to the Windows wiki. Any suggestions of books and tutorials should be added into the CW answer. Please do not add any other answers. \n\nIf you have anything to say about this, post your opinion here :\n\n",
  "votes": "21",
  "answers": 1,
  "views": "4k",
  "tags": [
    "windows"
  ],
  "user": null,
  "time": "12 years ago",
  "comments": [
    {
      "user": "QAZ",
      "text": "already 3 votes to close, leaving this open as a community wiki seems reasonable?",
      "time": null
    },
    {
      "user": "Mellowcandle",
      "text": "Why was this question closed. It was proven effective.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@Mellowcandle: it is outside the scope of a Q&A site. Making this entirely CW will allow others to edit away and closing it won't make it go away (unless you'd decide to delete it). Basically we are cheating to have something to reference from tag wikis, but we all know we're cheating, because shopping-list-like questions aren't allowed :)",
      "time": null
    },
    {
      "user": "asheeshr",
      "text": "I have voted to close as there have been multiple discussions on Meta about this specific issue. 1, 2 and 3 regarding issues with Tag Wikis. If we were to follow democratic processes, then the majority opinion was to add this information to the Tag Wikis via a post on Meta (+5 score) and",
      "time": null
    },
    {
      "user": "asheeshr",
      "text": "not as a separate question on Main (0 score). Meta is for deciding site policies and I believe we should adhere to majority decisions taken there. There was another post by Robert Cartaino that explains in detail the problems with such questions. Also, I do think that we need a list of books and resources and its absolutely great to see the effort being put into this!",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "",
      "votes": "19",
      "user": "12 revs, 7 users 41%Mellowcandle",
      "time": "Nov 30, 2020 at 10:30",
      "is_accepted": true,
      "comments": [
        {
          "user": "Mellowcandle",
          "text": "I added Windows Internals",
          "time": null
        },
        {
          "user": "Denis Laskov",
          "text": "Added 3 links from my answer. :)",
          "time": null
        },
        {
          "user": "toasted_flakes",
          "text": "Gray hat python is outdated.",
          "time": null
        },
        {
          "user": "AminM",
          "text": "@Mellowcandle what about assembly language",
          "time": null
        }
      ]
    }
  ]
}