{
  "title": "How to exploit an suid root application",
  "link": "https://reverseengineering.stackexchange.com/questions/17576/how-to-exploit-an-suid-root-application",
  "content": "I have to exploit an application and I have only the 32-bit ELF excecutable, which is also stripped. Its a suid root application and when it is executed practically run the ls -al command for a specific directory that normally is inaccessible for normal users.\n\nAny advice about how to handle this problem?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "4k",
  "tags": [
    "elf",
    "exploit"
  ],
  "user": "John Rewei",
  "time": "May 7, 2018 at 20:38",
  "comments": [
    {
      "user": "user23101",
      "text": "what are the inputs that you control? can you effect the arguments of ls -al?",
      "time": null
    },
    {
      "user": "joxeankoret",
      "text": "Check for how can you influence that command, it's most likely a system() call. Environment variables and command line arguments are the candidates. However, without disassembly, it's impossible to say.",
      "time": null
    },
    {
      "user": "John Rewei",
      "text": "I have tried a lot of inputs with patterns but I cannot spot any influence in memory. I can show you disassembly but because of the fact that the file is stripped has no info about functions.",
      "time": null
    },
    {
      "user": "Paweł Łukasik",
      "text": "how do you know it's exploitable?",
      "time": null
    },
    {
      "user": "John Rewei",
      "text": "its an exercise and it says it is",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "If the program is setuid, you can use the fact that it is calling the command ls -al /tmp through system() from the main() function.\n\nJust a remark, the rest of the software seems to have been obfuscated, at least by renaming the subroutines into sub_xxxx. It may also contain other obfuscations.\n\n",
      "votes": "4",
      "user": "perror",
      "time": "Mar 19, 2018 at 14:50",
      "is_accepted": true,
      "comments": []
    }
  ]
}