{
  "title": "Is there a collaborative reversing forum for people that deal with firmware?",
  "link": "https://reverseengineering.stackexchange.com/questions/1757/is-there-a-collaborative-reversing-forum-for-people-that-deal-with-firmware",
  "content": "The question pretty much says it.  Beyond knowing people that are interested in the same things, is there a collaborative reversing dumping ground for documenting specifically disassembly of closed source firmware?\n\n",
  "votes": "11",
  "answers": 2,
  "views": "1k",
  "tags": [
    "decompilation",
    "disassembly",
    "firmware"
  ],
  "user": "RobotHumans",
  "time": "Apr 17, 2013 at 4:29",
  "comments": [
    {
      "user": "Lizz",
      "text": "Can you provide an example? Does the ordinary motherboard firmware count? I'm guessing \"no\" since they don't usually post it, but I'm not aware of any open source firmware, except for things like Tomato, though that's more like an OS for a wifi unit, so I'm just trying to make sure I understand the question better.",
      "time": null
    },
    {
      "user": "RobotHumans",
      "text": "Mobo firmware would be inclusive...as would scada firmware, wireless firmware, any specific chipset firmware, atmel, etc etc.  Essentially there are sites for malware reversing that don't necessarily include legitimate firmware reversing.  Does that make more sense?",
      "time": null
    },
    {
      "user": "Lizz",
      "text": "Thanks for the clarification. This site is beta but includes tags for firmware, so I expect as it evolves it will fully embrace RE firmware. That said, there are some forums tending to this question: wololo.net/talk/viewtopic.php?p=256442 hackaday.com/2011/05/30/… and elitehackforums.com/index.php",
      "time": null
    },
    {
      "user": "RobotHumans",
      "text": "Thanks and uptick, but I don't think hackaday really counts as the type of forum.  I'll definitely give the other two and the hexrays forum a look.",
      "time": null
    },
    {
      "user": "cb88",
      "text": "@Lizz CoreBoot, OpenFirmware, SeaBios and intel's Tianocore are prime examples of open source firmwares.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I am not aware of a currently active generic \"firmware reversing\" forum.\n\nA few years ago there was a pretty ambitious attempt with lostscrews.com but unfortunately it languished due to lack of attention, got overwhelmed with spam and eventually the domain has expired. I think the guys behind the /dev/ttyS0 blog also tried opening a forum a couple months ago but it wasn't very active and apparently has been closed down.\n\nI guess the problem is that the area is somewhat nebulous and trying to cover everything won't really work. However, there are numerous forums that specialize in a specific type of firmware, manufacturer, or even just one product, and some of them are pretty big on their own. Here's a few examples that come to mind:\n\n",
      "votes": "11",
      "user": "Igor Skochinsky",
      "time": "Apr 14, 2013 at 21:59",
      "is_accepted": true,
      "comments": [
        {
          "user": "RobotHumans",
          "text": "It's a fair point that the hardware in question may have a dedicated community around it.  I think this will probably be the accepted answer after a little more waiting just in case (that and I think the previous readers will be more likely to upvote it as time goes by).",
          "time": null
        }
      ]
    },
    {
      "content": "What are you looking for exactly? Are you looking to trade notes about specific firmwares, a place to trade tips and tricks when reversing low-level code, or just a place to show off your accomplishments?\n\nI think the Hex-Rays forum would be a good place to start for a tips and tricks forum. It's currently not what you want, but it has the right people browsing the forum already -- which is generally the hardest part of creating an online resource like this. I don't know how amenable Hex-Rays is to posting complete write-ups and disassemblies of commercial firmwares.\n\nFor a place to show off your accomplishments, I believe that this StackExchange is appropriate (or /r/ReverseEngineering)!\n\n",
      "votes": "5",
      "user": "0xC0000022L",
      "time": "Apr 17, 2013 at 4:30",
      "is_accepted": false,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "I'm afraid the Hex-Rays forum is not a good choice. 1) it is restricted to Hex-Rays customers; 2) it's mostly intended for discussions about Hex-Rays products; 3) you definitely can't post any third-party binaries (such as firmware dumps) there.",
          "time": null
        }
      ]
    }
  ]
}