{
  "title": "What is a FLIRT signature?",
  "link": "https://reverseengineering.stackexchange.com/questions/175/what-is-a-flirt-signature",
  "content": "I've seen this referenced in a couple of other questions on this site.  But what's a FLIRT signature in IDA Pro?  And when would I create my own for use?\n\n",
  "votes": "38",
  "answers": 3,
  "views": "26k",
  "tags": [
    "ida",
    "flirt-signatures"
  ],
  "user": "mrduclaw",
  "time": "Mar 23, 2013 at 8:48",
  "comments": [],
  "answers_data": [
    {
      "content": "FLIRT stands for Fast Library Identification and Recognition Technology.\n\nPeter explained the basics, but here's a white paper about how it's implemented:\n\nhttps://www.hex-rays.com/products/ida/tech/flirt/in_depth.shtml\n\nIt's somewhat old (from IDA 3.6) but the basics still apply.\n\nTo create your own signatures, you'll need FLAIR tools, which can be downloaded separately.\n(FLAIR means Fast Library Acquisition for Identification and Recognition)\n\nThe IDA Pro book has a chapter on FLIRT and using FLAIR tools.\n\n",
      "votes": "27",
      "user": "Igor Skochinsky",
      "time": "Mar 23, 2013 at 13:16",
      "is_accepted": true,
      "comments": [
        {
          "user": "Peter Andersson",
          "text": "Ah wasn't aware of that white paper. Definitely explains it better than my little comment.",
          "time": null
        }
      ]
    },
    {
      "content": "A flirt signature is a pattern used to match known function headers. As an example consider the following:\n\n```\npush    ebp\nmov     ebp, esp\nsub     esp, 4Ch\nmov     [ebp+var_4], eax\npush    ebx\npush    edi\n...\n\n```\nThe compiler is free to change any register to another one or move anything around so it all depends on what the compiler thinks is most optimal. Compiled somewhere else the compiler may choose to use other registers, for instance:\n\n```\npush    ebp\nmov     ebp, esp\nsub     esp, 4Ch\nmov     [ebp+var_4], eax\npush    ecx\npush    esi\n...\n\n```\nNow you have a couple of options for trying to match this. Either naively create a signature from the sequence of instructions:\n\n```\npush    X\nmov     X\nsub     X\nmov     X\npush    X\npush    X\n...\n\n```\nAssume stack frames use ebp and esp, which is actually more dangerous than it sounds. It's common for functions to use ebp as a general purpose register:\n\n```\npush    ebp\nmov     ebp, esp\nsub     esp, 4Ch\nmov     [ebp+var_4], X\npush    X\npush    X\n...\n\n```\nIDA flirt signatures are an attempt to create these sorts of signatures based off of a number of the initial bytes of a function. The problem they are trying to solve is identifying commonly re-used code. These signatures are generated by compiling various commonly used libraries using various compilers. Once the compiler produces a library IDA has tools to extract the signatures from this library while also matching it to its source definition. After a while you can build up quite a lot of signatures for common libraries which will save you quite a lot of time down the road.\n\nFor a more complex solution to the related problem of identifying program similarities and differences see BinDiff. It uses much more advanced heuristics.\n\nThe signature I used above as an example is fairly worthless since it's way too generic and will create a lot of false positive matches.\n\n",
      "votes": "16",
      "user": "Peter Andersson",
      "time": "Mar 23, 2013 at 9:31",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "From the Hex-Rays site: \n\n```\nA signature file contains patterns of standard runtime functions. \nWith their help, IDA is able to recognize the standard functions and names them accordingly.\n\n```\nIn an effort of full disclosure, I've not really created any for my own use from scratch.  I suppose one instance where creating your own might be helpful is if you have a lot of malware that is of the same family.  Typically, they write and use their own library functions and it would make sense for a FLIRT signature to help here.\n\nAs an added bonus, here's a public repo of FLIRT signatures.\n\n",
      "votes": "2",
      "user": "omghai2u",
      "time": "Mar 23, 2013 at 8:53",
      "is_accepted": false,
      "comments": [
        {
          "user": "Peter Andersson",
          "text": "I don't think that repo contains anything :)",
          "time": null
        },
        {
          "user": "omghai2u",
          "text": "Well, one can hope it would get pull requests with some advertising, right? ^_^",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "Hardly anymore, given Google Code has been discontinued.",
          "time": null
        }
      ]
    }
  ]
}