{
  "title": "Do IDA Python plugins work with IDA free or only IDA pro? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/17632/do-ida-python-plugins-work-with-ida-free-or-only-ida-pro",
  "content": "For example, the plugin fluorescence.py is a very small tool that adds a choice in the \"Options\" menu of IDA to highlight call instructions.  It is supposed to work upon dropping it into the plugins directory.  Do such plugins only work on IDA Pro or can they be used with the free version?\n\n",
  "votes": "6",
  "answers": 1,
  "views": "8k",
  "tags": [
    "ida"
  ],
  "user": "Joe Johnson",
  "time": "7 years ago",
  "comments": [
    {
      "user": "TechLord",
      "text": "I'm voting to close this question as off-topic because not only has the OP not even bothered to try it out himself first, but also did not even mention the IDA version that he's interested in.",
      "time": null
    },
    {
      "user": "huang",
      "text": "5 years passed, does IDA freeware 8.x supports plugins now? If it is, I would develop the plugin myself.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "No, most plugins don't work, without hacks, with the freeware version because various exported functions (like callui) are either renamed or deleted.\n\n",
      "votes": "6",
      "user": "joxeankoret",
      "time": "Mar 8, 2018 at 10:46",
      "is_accepted": false,
      "comments": [
        {
          "user": "Laurie Stearn",
          "text": "Nice to know. No explicit mention that on the download page, and nothing in the Help file under Plugin modules.",
          "time": null
        },
        {
          "user": "NirIzr",
          "text": "AFAIK IDA plugins generally work (if used with a supported SDK version, recall IDA free is usually a few steps back). The issue with IDAPython is that the plugin itself is not included in the download, but should work if somehow made available.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "Possibly relevant in particular the part where you wrote, quote: Kind of. After diffing with Diaphora libida64.so, I just realized that some symbols have been renamed to zyaXXX. That's all.",
          "time": null
        }
      ]
    }
  ]
}