{
  "title": "Tool besides ida to get high level code",
  "link": "https://reverseengineering.stackexchange.com/questions/17657/tool-besides-ida-to-get-high-level-code",
  "content": "I looking another tool besides ida to get high level code from binary file.(like oda pesudocode)\n\nI know that the high level is not perfect on every tool, but I want try another tool.\n\nMy code compile to arm.\n\n",
  "votes": "1",
  "answers": 4,
  "views": "2k",
  "tags": [
    "ida",
    "disassembly",
    "decompilation"
  ],
  "user": "Highlevel",
  "time": "Mar 11, 2018 at 16:12",
  "comments": [],
  "answers_data": [
    {
      "content": "Try the Retargetable Decompiler.\n\nhugsy has developed a Binary Ninja plugin to decompile binaries using the RetDec API called binja-retdec.\n\n",
      "votes": "1",
      "user": "julian",
      "time": "Mar 11, 2018 at 16:32",
      "is_accepted": false,
      "comments": [
        {
          "user": "Highlevel",
          "text": "@SYS_Y what Retargetable Decompiler diffrent than Binary Ninja. Witxh better?  And they bettwr than ida psudocode??",
          "time": null
        },
        {
          "user": "fpmurphy",
          "text": "RetDec only works at present with 32-bit binaries. It  has a 32-bit IDA Pro plugin for generating either C or pseudo-code.",
          "time": null
        }
      ]
    },
    {
      "content": "If you are using a Mac or Linux, hopper is a product worth checking out.\n\n",
      "votes": "0",
      "user": "fpmurphy",
      "time": "Mar 12, 2018 at 8:11",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Currently nothing beats the quality of IDA’s ARM decompiler. \n\nBut if you are on a budget, BinaryNinja’s medium level IL is actually quite pleasant to read. And in my experience it’s correct (while retdec’s C code is sometimes just plain wrong).\n\nThe JEB guys have entered the decompiler business with a MIPS decompiler (which HexRays doesn’t offer at the moment). Supposedly it’s quite good. And they have a ARM decompiler in open beta now. I have not tried it yet, but it’s good to see competition.\n\n",
      "votes": "0",
      "user": "manduca",
      "time": "Apr 11, 2018 at 8:55",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "If you on Windows then Relyze Desktop contains a decompiler for ARM binaries (As well as ARM64/x86/x64).\n\n",
      "votes": "0",
      "user": "QAZ",
      "time": "Jan 25, 2022 at 14:47",
      "is_accepted": false,
      "comments": []
    }
  ]
}