{
  "title": "Does IDA support remote debugging in their Freeware Version?",
  "link": "https://reverseengineering.stackexchange.com/questions/17693/does-ida-support-remote-debugging-in-their-freeware-version",
  "content": "I am unable to find if it does. This PDF linked here says that from version 4.8 IDA Pro supports remote debugging. But I can't seem to find this in the UI for the Freeware Version 5.0. Or is it that IDA Pro and IDA Freeware are different irrespective of version number.\n\n",
  "votes": "4",
  "answers": 3,
  "views": "5k",
  "tags": [
    "ida",
    "debugging",
    "remote"
  ],
  "user": "user1720897",
  "time": "Jul 22, 2018 at 18:00",
  "comments": [],
  "answers_data": [
    {
      "content": "I'll start by saying that there's already IDA Free 7.0 which is much better than version 5.0. However, both the free edition of IDA 7.0 and IDA 5.0 are not supporting remote debugging of any kind.\n\nHex-Rays stated that, and other limitations, in their IDA 5.0 freeware page (which is now replaced with version 7.0). I'm quoting from a backed-up page:\n\n(emphasizes are mine)\n\nA similar description is available on the IDA 7.0 Freeware page as well:\n\nEdit:\n\nAs both OP and @blabb mentioned -- apparently, IDA 5.0 do supports local-debugging but is not supports remote debugging.\n\nAs can be seen in this screenshot from IDA Free 5.0, the \"Debug application setup\" window doesn't contain the settings for remote debugging:\n\n\n\nIn contrary, the screenshot from the PDF attached by OP is showing these settings:\n\n\n\n",
      "votes": "5",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": false,
      "comments": [
        {
          "user": "user1720897",
          "text": "I see. However, the freeware version does come with support for a local debugger. I am yet to find anything that says explicitly that it doesn't come with support for remote debugging. I am confused.",
          "time": null
        },
        {
          "user": "Megabeets",
          "text": "Thanks! I didn't know that. Updated my answer according to what you and blabb mentioned.",
          "time": null
        }
      ]
    },
    {
      "content": "as far as i know ida free supported  debugging of x86 in the 32 bit version \n\ni think the free v7 does not even run in 32 bit machine \n\n\n\n",
      "votes": "2",
      "user": "blabb",
      "time": "Mar 14, 2018 at 7:10",
      "is_accepted": false,
      "comments": [
        {
          "user": "Abr001am",
          "text": "yes, i tried running both 86 and 32b of IDA7.x, the executable clashes with system architecture.",
          "time": null
        }
      ]
    },
    {
      "content": "The recent release of IDA 7.0 Free (March 2019) supports local debugging.\nThe description on the website hasn't been updated yet, but see the following tweet by one of the IDA authors:\n\nSource: Twitter\n\n\n\nStill, no support for remote debugging though.\n\n",
      "votes": "2",
      "user": "Dvd848",
      "time": "Mar 17, 2019 at 20:59",
      "is_accepted": false,
      "comments": []
    }
  ]
}