{
  "title": "Tracing function calls in x64dbg",
  "link": "https://reverseengineering.stackexchange.com/questions/17736/tracing-function-calls-in-x64dbg",
  "content": "I'm new with x64dbg and want to know if there is any way to get the trace of a functions inside a module? \n\nI've used trace over option, but basically it just traces all the insturctions but doesn't \"step in\" into a call statement.\n\nHere I found a way to do this using windbg(notice the treeview of functions and return values), but is there any way I can do same using x64dbg? or maybe trace all the api calls of a module. \nthanks.\n\n",
  "votes": "5",
  "answers": 2,
  "views": "10k",
  "tags": [
    "disassembly",
    "windows",
    "windbg",
    "functions",
    "x64dbg"
  ],
  "user": "Ojs",
  "time": "Mar 19, 2018 at 19:29",
  "comments": [],
  "answers_data": [
    {
      "content": "It is possible using Trace->Trace into... option. After opening the executable, select this option and specify the message you want to log (in Log text field); for example {a:cip} {i:cip}, which will log the module name, address and the instruction after a space.\n\nAs far as I am concerned, there is unfortunately no support for string comparison in x64dbg, so you cannot write something like {modname@rip}==some_module_name in Log condition field. However, you may use the module entry point as a module identifier, like here:\n\n\nAfter clicking OK button, only instructions in the specified module will appear in the log panel and you should see something like this:\n\n\n\nThe only problem that is still to solve is to find the module entry address. I've done it by logging every module name and entry point until I find the relevant one. If I find any better way to do that, I will update my answer.\n\n",
      "votes": "7",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "This is the solution.  Same dialog as before but these values, replace prog1 with the name of your executable:\n\n```\nbreak condition: 0\nlog text: {p:cip} {i:cip}\nlog condition: dis.isbranch(cip) && prog1.EntryPoint == mod.entry(dis.branchdest(cip))\ncommand text: \ncommand condition:\nmaximum trace count: 232323\n\n```\nThis will log all the conditionals in the userspace program only, and if you need more trace count just raise the value.  It will take awhile but you end up with a file of je/jne  where you can compare and see what was different between different runs of your program.  Priceless and extremely poorly documented.\n\n",
      "votes": "0",
      "user": "test",
      "time": "May 9, 2023 at 6:25",
      "is_accepted": false,
      "comments": []
    }
  ]
}