{
  "title": "how to find the strings values in a comparision using ollydbg",
  "link": "https://reverseengineering.stackexchange.com/questions/17767/how-to-find-the-strings-values-in-a-comparision-using-ollydbg",
  "content": "In OllyDbg 1.10 (assembler level deubugger) I can find all referenced text strings\n\nThe program compare if a user input string is equal  a internal string.\n\nWhen I debug the program, I can't find the internal string. I found only the string of the image\n\nThe program is a Windows Console (DOS).\n\nThis is the string the plugin found\n\n\n\nThis strings appear in the program, but I can't see the string when program say \"Congratulations....\", is 4 lines under the red mark in the image\n\nYou can help?\nHow I can debug and see the text of comparision?\n\n\n\nIs like...\n\nif user_input == X then\n print \"Congratulations....\"\nelse\n print \"Better luck next time...\"\n\nHow find X string?\n\nThanks\n\n[EDIT]\n\nAfter the answer, I recommend, in this case, to use x64dbg\n\n\n\n",
  "votes": "-1",
  "answers": 1,
  "views": "684",
  "tags": [
    "windows",
    "ollydbg",
    "debugging",
    "strings"
  ],
  "user": "incode",
  "time": "Mar 22, 2018 at 15:32",
  "comments": [],
  "answers_data": [
    {
      "content": "It's hard to answer by looking at the low-res image but it looks like that the 'X' is not present in as as string in one place. Instead there are bunch of char comparisons spread across this binary.\n\nLike this one:\n\n```\nCMP BYTE PTR SS:[ESP+25], 40\n\n```\nGather those together (there should be some above the part that you've pased) and sort by the index (ESP+xx). Converting the values after the comma (in this case 40) to ascii and printing them should give you the 'X'. \n\nFor the image we have:\n\n",
      "votes": "0",
      "user": "Paweł Łukasik",
      "time": "Mar 22, 2018 at 8:04",
      "is_accepted": true,
      "comments": [
        {
          "user": "incode",
          "text": "Thanks, this is more visible (for me) in x32dbg, is more easy to read. Many thanks",
          "time": null
        }
      ]
    }
  ]
}