{
  "title": "CRC32 reverse engineer without knowing parameters, but knowing the input value",
  "link": "https://reverseengineering.stackexchange.com/questions/18127/crc32-reverse-engineer-without-knowing-parameters-but-knowing-the-input-value",
  "content": "Dear members, \n\nI am trying to figure out the parameters of some hexadecimal CRC32 values I have.\n\nThe values are:\n\n```\nValue - input (before hashing)\n55D3028A - J\n73AF2D02 - O\n6742BE71 - T\n\n```\nI hope I can figure out the polynominal and initial/final XOR value so I can hash my own values.\n\nI'm using reveng to getting the parameters for hashing my own strings, but I didn't found a working solution.\n\nthe commands I've tried:\n\nIs it possible to use the input value(s) and the given crc(s) to bruteforce/calculate the parameters or does someone know a other method to achieve the same goal.\n\nThanks in advance,\n\nEvilID\n\n",
  "votes": "0",
  "answers": 1,
  "views": "3k",
  "tags": [
    "crc",
    "hash-functions"
  ],
  "user": "EvilID",
  "time": "Apr 29, 2018 at 16:08",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "are you sure the algorithm is a CRC and not some other chevksum/hash? where are you getting the data from?",
      "time": null
    },
    {
      "user": "EvilID",
      "text": "Well, I'm getting the values from software that I use and the documentation states that it is crc 32-bit 4 bytes.",
      "time": null
    },
    {
      "user": "Johann Aydinbas",
      "text": "If you have the software calculating these, why not just try to find the code and see what is actually happening? Or is the question more about solving it the way you asked for?",
      "time": null
    },
    {
      "user": "EvilID",
      "text": "I could try to find the code inside the program, but I indeed hope to learn how to solve it without doing that. Just for learning purposes.",
      "time": null
    },
    {
      "user": "EvilID",
      "text": "@josh The reveng approach was for me to figure out if it was indeed possible to calculate the parameters with the known information in the first place.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I wanted to give this a try because it seemed interesting but I did not succeed.\n\nStill, maybe this will lead you in the right direction for further tests.\n\nI started reading some introduction material on CRCs:\n\nhttp://www.sunshine2k.de/articles/coding/crc/understanding_crc.html\n\nand this one where someone else was trying to reverse engineer a CRC:\n\nhttps://www.cosc.canterbury.ac.nz/greg.ewing/essays/CRC-Reverse-Engineering.html\n\nto get a general understanding what we're dealing with. Then I was about to write some small Z3 script but luckily stumbled upon \n\nhttps://github.com/DennisYurichev/yurichev.com/blob/master/blog/CRC_cracker_Z3/CRC_cracker.py\n\nwhich is described here: https://yurichev.com/blog/CRC_cracker_Z3/\n\nBasically, that is a script that uses Z3 (Microsoft's theorem prover) to calculate the CRC sum and it tries to find the polynomial, test Big and Little Endian interpretation, and an inverted input/output or not. You supply it with input data and the CRC sums they have to generate and then it tells you the parameters.\n\nThat script did not produce a result for me though. That either means it's not a CRC, not a 32 bit CRC, the input/output is modified beyond simple inversion, or the supplied samples are not just over the 3 letters you listed.\n\nI also could not find any matching publicly known set of parameters (such as CRC32C), for that I tested some parameter sets using https://pycrc.org/\n\nIf your actual target was recreating the checksum I'd probably go reverse engineer the code now instead of treating it as a blackbox.\n\n",
      "votes": "3",
      "user": "Johann Aydinbas",
      "time": "Apr 30, 2018 at 21:55",
      "is_accepted": false,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "have you tried hashing the strings including the terminating 0, or maybe even padded to 4 bytes?",
          "time": null
        },
        {
          "user": "Johann Aydinbas",
          "text": "I just did for the terminating 0 (no result), and padded to 4 byte it ran more than an hour until I had to cancel it.",
          "time": null
        }
      ]
    }
  ]
}