{
  "title": "Could you list some useful plugins and scripts for IDA Pro? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/1829/could-you-list-some-useful-plugins-and-scripts-for-ida-pro",
  "content": "I am just starting to use IDA Pro. After discussing a bit with the community, it seems that IDA Pro plugins and scripts are quite important to reach a good level of productivity while analyzing a program.\n\nWhat are some must have plugins for IDApro that you would recommend for an everyday usage.\n\n",
  "votes": "11",
  "answers": 1,
  "views": "9k",
  "tags": [
    "ida",
    "ida-plugin"
  ],
  "user": null,
  "time": "12 years ago",
  "comments": [
    {
      "user": "Ange",
      "text": "what kind of program? what kind of analysis? that's an extremely broad question so far.",
      "time": null
    },
    {
      "user": "Remko",
      "text": "possible duplicate of What are the essential IDA Plugins or IDA Python scripts that you use?",
      "time": null
    },
    {
      "user": "Denis Laskov",
      "text": "IMHO, most useful plugin - one You familiar with and one that automate and help in YOUR work with IDA. When You'll learn IDA a bit more, You'll find out Your methods, and then - choose Your plugins to automate process.",
      "time": null
    },
    {
      "user": "Peter Andersson",
      "text": "I converted it into a community wiki so that anyone can edit it and add a list of plugins as I think the question is very common.",
      "time": null
    },
    {
      "user": "perror",
      "text": "I edited the question to reflect the two main tasks for which I intend to use IDApro.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Generic helpers for reverse engineering of a specific architecture.\n\nGeneric helpers for reverse engineering of a specific operating system.\n\nGeneric helpers for reverse engineering of binaries generated using a specific compiler.\n\nGeneric helpers for reverse engineering of a technology.\n\nGeneric helpers for reverse engineering of encryption and decryption algorithms.\n\nPlugins and scripts for removing obfuscations from disassembly.\n\n",
      "votes": "10",
      "user": "7 revs, 3 users 87%Peter Andersson",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": true,
      "comments": [
        {
          "user": "Peter Andersson",
          "text": "I started with this small template. I have more that I want to add but I don't have time right now. Anyone else, edit away.",
          "time": null
        },
        {
          "user": "broadway",
          "text": "is there a reliable mirror for the mida plugin? It'd be nice if we could ensure all download links work.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@broadway: send it to IDAPalace?!",
          "time": null
        }
      ]
    }
  ]
}