{
  "title": "Is pointer decryption possible?",
  "link": "https://reverseengineering.stackexchange.com/questions/18325/is-pointer-decryption-possible",
  "content": "I’m pretty new to reverse engineering, so bear with me...\n\nI’m trying to get a few struct definitions (or whatever they’re called) from this one binary. After some time fiddling around with it, I’ve gathered some data I’m pretty sure belongs to the one of the structs I’m interested in. However, upon closer inspection, I’ve noticed the addresses of these “pieces of data” are scattered all over the place within this binary, instead of being in one contiguous chunk, as a struct should be.\n\nA quick Google search on this issue suggested it might be happening because of “pointer encryption”, which apparently is more like xoring than encrypting(?)... and following searches on the topic lead to nothing.\n\nWhich leads me to ask this: what exactly is “pointer encryption”? Can it be undone? And, if so, how can I decrypt it?\n\n",
  "votes": "3",
  "answers": 2,
  "views": "1k",
  "tags": [
    "windows",
    "binary-analysis",
    "c++",
    "pointer"
  ],
  "user": "Bruno Fauth",
  "time": "May 20, 2018 at 20:50",
  "comments": [],
  "answers_data": [
    {
      "content": "There is no such thing. There is only pointer obfuscation. This is essentially how Microsoft markets a couple of functions, and they're pretty open about it from the docs on EncodePointer\n\nFrom one of the Microsoft blogs from 2006\n\n",
      "votes": "5",
      "user": "Evan Carroll",
      "time": "May 21, 2018 at 2:18",
      "is_accepted": true,
      "comments": [
        {
          "user": "mrexodia",
          "text": "Current versions of Windows have an algorithm that is slightly smarter than just XOR because it was easy to break if you had both the plain and obfuscated pointer.",
          "time": null
        }
      ]
    },
    {
      "content": "I don't think there is any encryption going on. Probably the program uses multiple structs to store the data which is completely normal.\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "May 22, 2018 at 7:36",
      "is_accepted": false,
      "comments": []
    }
  ]
}