{
  "title": "dnSpy - What do these symbols mean?",
  "link": "https://reverseengineering.stackexchange.com/questions/18338/dnspy-what-do-these-symbols-mean",
  "content": "When decompiling a dll file there are certain lines of code that read like this:\n\nreturn \\u0013.\\u0002.\\u0001(url, info);\n\nI have two questions on this:\n\n1) does \\u00xx mean that it is obfuscated, if yes, what steps can I take to understand it\n\n2)  what are the . between each one, is it a dnSpy thing or does it mean something in C#\n\n",
  "votes": "6",
  "answers": 1,
  "views": "7k",
  "tags": [
    "decompilation",
    "dll",
    ".net"
  ],
  "user": "pzirkind",
  "time": "May 23, 2018 at 14:05",
  "comments": [],
  "answers_data": [
    {
      "content": "These are Unicode characters that are not supported by the font used by dnSpy.\nUsually, you'll see it when the code is obfuscated or in cases where the developer used languages as Chinese and Russian in their code. But yeah, usually obfuscation.\n\nYou can try to deobfuscate this .Net binary by using de4dot which is doing an incredible job with deobfuscating obfuscated .net applications. de4dot's engine was later used to create dnSpy which is my favorite .Net decompiler.\n\nThe separating dots are the dot Operator, just as in most popular programming languages, the dot operator is used to access members of variables, types, etc. \"Members\" can be a method, attribute, and others. \n\nIn your case, \\u0001 is a method of \\u0002 which is a member of the variable \\u0013.\n\n",
      "votes": "7",
      "user": "Megabeets",
      "time": "May 23, 2018 at 15:25",
      "is_accepted": true,
      "comments": [
        {
          "user": "Biswapriyo",
          "text": "Can de4dot deobfuscated any .NET executable?",
          "time": null
        },
        {
          "user": "Megabeets",
          "text": "No. But it'll try and usually will output a bit less-obfuscated binary. There are indeed obfuscators that will beat de4dot",
          "time": null
        }
      ]
    }
  ]
}