{
  "title": "How do TDBCtrlGrid or TDBCtrlPanel Borland Delphi controls add new text rows?",
  "link": "https://reverseengineering.stackexchange.com/questions/18411/how-do-tdbctrlgrid-or-tdbctrlpanel-borland-delphi-controls-add-new-text-rows",
  "content": "I am trying to reverse engineer an old native application written in Borland Delphi in order to modify it for my needs:\n\n\n\nThe application interfaces with the special hardware and displays events that it receives in the TDBCtrlGrid control, that acts as a long list. Using the Spy++ tool I was able to see that it has a child window TDBCtrlPanel:\n\n\n\nSo both are placed in the actual application as such:\n\n\n\nI need to add some custom functionality to this application and namely, to be able to track when a certain hardware-related event occurs. I am not the author of this application and the company who created it is long gone.\n\nSo my only solution seems to be trying to patch the executable with my own code trampoline. My goal is to trap instances when a new line is added to that TDBCtrlGrid control and ideally get the text from it. (Example: 5/30/2018  9:30:00 PM  Beam Alarm Zone   Alarm Zone Armed that is the last line from the screenshot above.)\n\nI've never done much in Delphi/Pascal. So I don't know its structure. To start, I need to find out how do those Delphi controls receive text for a new row to try to trap the part of the original code that does it?\n\nPS. If it was Windows common controls, I know that they receive most notifications via SendMessage API. I tried that approach with Spy++, but the only messages those two Delphi controls receive were WM_PAINT and WM_STYLECHANGED.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "windows",
    "patching",
    "delphi"
  ],
  "user": "c00000fd",
  "time": "May 31, 2018 at 6:10",
  "comments": [],
  "answers_data": [
    {
      "content": "This sounds more like you need to become familiar with the Delphi API. I googled a bit:\n\nfrom http://docs.embarcadero.com/products/rad_studio/delphiAndcpp2009/HelpUpdate2/EN/html/delphivclwin32/DBCGrids_TDBCtrlGrid.html\n\nFrom my understanding, you define a data source (this is the part I didn't understand), connect it to a data viewer widget like your CtrlGrid and add a Navigator that handles the view into the data source.\n\nSo either the program uses the TDBNavigator to add data and this might be your hook, or there is some other way to alter your data source.\n\nI'd probably look for simple example code using all the above to see how one typically implements it in Delphi, then it should be straight-forward to find the proper hook location.\n\n",
      "votes": "1",
      "user": "Johann Aydinbas",
      "time": "May 31, 2018 at 9:51",
      "is_accepted": false,
      "comments": []
    }
  ]
}