{
  "title": "How can I fix the problem of IDA view and corresponding HEX view not being in sync?",
  "link": "https://reverseengineering.stackexchange.com/questions/18423/how-can-i-fix-the-problem-of-ida-view-and-corresponding-hex-view-not-being-in-sy",
  "content": "When I place my cursor on an instruction (on the address, opcode or operand) in the IDA-view, and switch immediately to HEX-view, I expected the hex bytes corresponding to the instructions to be selected. However, IDA 7.0.171130 (x86_64) is not behaving as expected.\n\nAs an example, I have selected the address 0x8000328 in the IDA view (the cursor is not visible in the screenshot) which is a mov instruction. However, the HEX-view shows E8 D9 04 00 00 highlighted with the cursor on it; which is a call instruction.\n\n\n\n\n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "ida"
  ],
  "user": "sherlock",
  "time": "Jun 2, 2018 at 3:49",
  "comments": [],
  "answers_data": [
    {
      "content": "Did you validate that your Hex-View is Synchronized with the IDA View?\n\nIn order to do this, go to the Hex View tab, Right Click anywhere in the view and choose \"Synchronize With > IDA View\":\n\n\n\nThis works fine for me in version 7.0.1709\n\n",
      "votes": "4",
      "user": "Megabeets",
      "time": "Jun 3, 2018 at 7:06",
      "is_accepted": true,
      "comments": [
        {
          "user": "sherlock",
          "text": "Exactly that was the problem. Why on Earth would some not want to be in sync? Thank you so much.",
          "time": null
        },
        {
          "user": "Megabeets",
          "text": "Glad it helped :) Imagine, for example, reading an assembly code in the IDA View that manipulates an array of bytes in another address. One might want to see the assembly in the IDA View and at the same time to open the Hex View on this structure of bytes.",
          "time": null
        },
        {
          "user": "sherlock",
          "text": "Makes sense :-)",
          "time": null
        }
      ]
    }
  ]
}