{
  "title": "What are the steps to reverse engineering a Shockwave .DCR file?",
  "link": "https://reverseengineering.stackexchange.com/questions/18439/what-are-the-steps-to-reverse-engineering-a-shockwave-dcr-file",
  "content": "I have been fascinated by reverse engineering after making several emulators and  finding the pret community. I love the idea behind decompiling old games and recreating source code that recompiles into a matching file. \n\nI recently found an old game that was hosted by Cartoon Network that I must have played around ~2001. I downloaded the source file and it is 514 Kb file with a .dcr extension.\n\nIf this is anything like any other computer program, this file should store all of the games logic, images/sound, etc. that is interpreted by the Adobe Shockwave VM.\n\nIs it a feasible task to reverse engineer and extract data/code from a compiled .dcr file, or is this technology too outdated and proprietary to try and reverse engineer and test? Apparently the .dcr file is generated by the \"Director\" application. Does this mean that if I wanted to RE this game, I would have to find the exact Director version they used when creating the game so it compiles into the same bytecode? Is this too complex of a project for a single person?\n\n",
  "votes": "4",
  "answers": 1,
  "views": "3k",
  "tags": [
    "binary-analysis",
    "decompilation",
    "virtual-machines",
    "binary-diagnosis"
  ],
  "user": "user2936448",
  "time": "Jun 3, 2018 at 20:14",
  "comments": [
    {
      "user": "Flash and Dash Demo",
      "text": "What could you do? I have a demo game from my childhood and I thought maybe I could scramble the codes so I can translate it to the full version. Do you think this is possible?",
      "time": null
    },
    {
      "user": "user2936448",
      "text": "@FlashandDashDemo So over 4 years have passed since I posted this question. Recently I researched options again and I discovered that recently someone developed: github.com/ProjectorRays/ProjectorRays  You can use this to decompile DCR files and also convert them into workable DIR files that can be opened with director. I used this program and it perfectly decompiled the game I was originally posting about. Good luck.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "There's a lot to Google on the topic, so take some time to do that and learn about what the *.dcr format is. A great initial point of reference for you is this post on the ZenHAX forum, where a script or two have been created for use with their program, QuickBMS. That won't teach you how to reverse the format, but if you spend some time reading what QuickBMS scripts are comprised of, you'll end up travelling down the path of reversing file formats using archives themselves as the sample.\n\nI actually worked on reversing a Director application not too terribly long ago. I made notes and documented what I'd found at the time here and here, so those may be useful for ancillary points in regards to your studying.\n\nFinally, you'd probably be best suited to inquire around both the ZenHAX and XeNTaX forums, since they both primarily focus on reversing file formats. That should all get you started quite nicely in the direction you're interested in heading. =)\n\n",
      "votes": "6",
      "user": "dsasmblr",
      "time": "Jun 4, 2018 at 13:29",
      "is_accepted": true,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "more links: github.com/eriksoe/Schockabsorber github.com/Brian151/OpenShockwave fileformats.archiveteam.org/wiki/Lingo_bytecode",
          "time": null
        }
      ]
    }
  ]
}