{
  "title": "where can I get mIDA",
  "link": "https://reverseengineering.stackexchange.com/questions/1849/where-can-i-get-mida",
  "content": "Some posts reference the mIDA plugin, but the download site seems unavailable. Is there any mirror or a link to an archive version?\n\n",
  "votes": "4",
  "answers": 1,
  "views": "713",
  "tags": [
    "ida",
    "ida-plugin"
  ],
  "user": "Ohajo Zanajo",
  "time": "Apr 13, 2017 at 12:49",
  "comments": [
    {
      "user": "N3mes1s",
      "text": "try to ask directly to author, you've his email",
      "time": null
    },
    {
      "user": "Ange",
      "text": "I couldn't find mIDA online, so I e-mailed the author.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@Ange: how about setting up a mirror on Bitbucket or Github, the license allowing, and then answer with that? Edit: oh or on Google Code ... your site is there of course.",
      "time": null
    },
    {
      "user": "Ange",
      "text": "yeah, that would be good, but I don't see myself maintaining a file archive on top of the rest: why Woodman or Openrce didn't host a local copy is beyond me. It would be trivial to also put it on a google code project, but I'm not sure that's compatible with the licences.",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "I don't think the source has been released so this discussion is moot so far.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I was just sent mIDA-1.0.10, from 2008.\n\n```\nmIDA is an IDA plugin which extracts RPC interfaces and recreates the associated IDL file.\nmIDA supports inline, interpreted and fully interpreted server stubs.\n\n```\n",
      "votes": "9",
      "user": "Ange",
      "time": "Apr 18, 2013 at 21:09",
      "is_accepted": true,
      "comments": [
        {
          "user": "Ange",
          "text": "I didn't get it from the author (no answer yet), so there might be a newer version.",
          "time": null
        },
        {
          "user": "nopnopgoose",
          "text": "mIDA_v1.0.10.zip can also be found at Aaron Portnoy's site  here as well, for another source, but I'm likewise unsure if that is the latest version.",
          "time": null
        },
        {
          "user": "Dev.K.",
          "text": "The link is not accessible..can you please update the link if possible..please?",
          "time": null
        },
        {
          "user": "Remko",
          "text": "github.com/sourceincite/tools/tree/master/pymsrpc/mIDA & tuts4you.com/download.php?view.3469",
          "time": null
        }
      ]
    }
  ]
}