{
  "title": "How to view string references?",
  "link": "https://reverseengineering.stackexchange.com/questions/18504/how-to-view-string-references",
  "content": "I have attached debugger to process/application (exe), but when i go to string references, it shows ntdll.dll references, instead of program.\nhow to get the references from program itself?\nis it protected?\n\n\n\n",
  "votes": "10",
  "answers": 2,
  "views": "38k",
  "tags": [
    "x64dbg"
  ],
  "user": "T.Todua",
  "time": "Jun 11, 2018 at 15:25",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "If you wanted to conceal the name of the module you should also have looked at line four inside the disassembly :) ... btw: I think the debuggers use heuristics in order to show you cross-references. There are bound to be some false positives.",
      "time": null
    },
    {
      "user": "Benjamin Supaman Perez",
      "text": "Click right button, search for -----> all modules ---> strings references.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "When x64dbg attaches to a process it will first stop at the 'Attach breakpoint'. The button to search for string references will search the module currently shown in the disassembly. To search in another module you simply have to go there.\n\nOne way to do this is to go to the Symbols tab and double click the module you are interested in. This should take you to the code section of the module. From there you can press the button to search for string references.\n\n",
      "votes": "10",
      "user": "mrexodia",
      "time": "Jun 15, 2018 at 17:51",
      "is_accepted": true,
      "comments": [
        {
          "user": "KeyC0de",
          "text": "That was what I did but wasn't working (always going back to ntddl.dll or some other module), until I RMB on the module and selected \"Follow Entry point in Disassembler\" then I was able to search for strings in my target module.",
          "time": null
        }
      ]
    },
    {
      "content": "The way is:    \n\n```\nDebug -> Run to user code\n\n```\nThen you will see the strings of the program itself.\nx64dbg/x32dbg as any other debugger, walks you trough all the process initialization code before entering your \"main\".\n\n",
      "votes": "5",
      "user": "0xfede7c8",
      "time": "Jun 14, 2018 at 16:50",
      "is_accepted": false,
      "comments": [
        {
          "user": "T.Todua",
          "text": "hm, i can only see Run To User code, however it still shows ntdll.dll when i go to string references.",
          "time": null
        }
      ]
    }
  ]
}