{
  "title": "Patching a program in memory at a certain point of time",
  "link": "https://reverseengineering.stackexchange.com/questions/18516/patching-a-program-in-memory-at-a-certain-point-of-time",
  "content": "I'm using OllyDbg to patch a value and I need to patch a certain value when the program gets mapped in memory, how can I do this? I don't want to patch the value in file, but only in memory after the program gets mapped, any ideas ?\n\nI also want to automate this, so that every time I run the program and after it gets mapped in memory, and after pushing a certain button, the value gets patched, only in memory, automatically!!\n\n",
  "votes": "2",
  "answers": 1,
  "views": "770",
  "tags": [
    "assembly",
    "ollydbg"
  ],
  "user": "Ponsonnet",
  "time": "Jun 13, 2018 at 13:52",
  "comments": [
    {
      "user": "0xec",
      "text": "In game cheating this is quite common. You've trainers which edit the contents of process memory. You would invoke the trainer using predefined hotkeys. You can search for \"game trainer creation tutorials\".",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "To control memory mapping events you need a debugger or kernel mode driver. I.e. you have to open the process for debug, with your own debugger in order to get the notification that some module loaded. There's a patching type called Loader it's actually works this way. https://lucasg.github.io/2016/11/27/How-to-Create-and-Debug-a-Process-on-Windows/ see the \"Debug way\" section\n\nAnd in kernel mode driver you can subscribe to memory mapping events from the whole OS, so you're able to control all the modules in all the processes.\n\n",
      "votes": "2",
      "user": "Anton Kukoba",
      "time": "Jun 13, 2018 at 9:06",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "Could you explain which exact mechanism you mean in the last paragraph? I am unaware of such a broad mechanism. Or do you mean PsSetLoadImageNotifyRoutine?",
          "time": null
        },
        {
          "user": "Anton Kukoba",
          "text": "Yes, PsSetLoadImageNotifyRoutine. There's a way through ETW. And as I remember it's possible to see file mapping operations in FS minifilter.",
          "time": null
        },
        {
          "user": "Ponsonnet",
          "text": "Could you explain how can I use this kernel mode to control modules? - as I need to patch a DLL module while the program is running.. Could you explain how the whole process is done?",
          "time": null
        }
      ]
    }
  ]
}