{
  "title": "ARM Thumb2 register usage",
  "link": "https://reverseengineering.stackexchange.com/questions/18529/arm-thumb2-register-usage",
  "content": "I am reversing ARM Thumb2 code.\n\nI am looking for a table that shows which registers are used to pass arguments to functions, and which registers must be saved after the function ends.\n\nBy the way, if I see push r5-r9 at the beginning of the function and pop r5-r9 at the end of function,  are those registers saved?\n\n",
  "votes": "3",
  "answers": 2,
  "views": "343",
  "tags": [
    "disassembly",
    "assembly",
    "arm",
    "thumb2"
  ],
  "user": "Keystone",
  "time": "Jun 15, 2018 at 15:55",
  "comments": [],
  "answers_data": [
    {
      "content": "This is all documented in the ARM Architecture Procedure Call Standard (AAPCS) ARM IHI0042.  There may be more recent versions.  The short version: R0-R3 are for passing arguments, R12 is a scratch register for procedure calls (linker things, etc) and everything else must be preserved by functions that use it.\n\n",
      "votes": "4",
      "user": "Igor Skochinsky",
      "time": "Nov 10, 2018 at 17:45",
      "is_accepted": false,
      "comments": [
        {
          "user": "julian",
          "text": "Do you have a link to the Arm Procedure Call Standard (AAPCS) Arm IHI 0042F doc? I would like to take a look at it",
          "time": null
        }
      ]
    },
    {
      "content": "Typically, the push r5-r9 instruction is a way to save the content of these registers (ie r5, r6, r7, r8, r9) on the stack, then the pop r5-r9 is restoring the saved values before leaving the function stack-frame.\n\nThis is quite common behavior when you want to manipulate non-volatile registers within your stack-frame and be compliant to the ABI. It is extremely frequent to see these way of doing in compiler generated assembly code.\n\n",
      "votes": "2",
      "user": "perror",
      "time": "Jun 15, 2018 at 16:22",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "So are these typically the registers used to pass arguments to a function (first part of the question!)?",
          "time": null
        },
        {
          "user": "perror",
          "text": "It depends of the ABI, the question is not precise enough to answer properly. We need to know the OS used (and thus the ABI used).",
          "time": null
        },
        {
          "user": "Keystone",
          "text": "@perror, I talking about embbeded without os",
          "time": null
        }
      ]
    }
  ]
}