{
  "title": "Please edit this .exe file. I beg you. At least tell me what can be done(No general answers) Specific please [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/18550/please-edit-this-exe-file-i-beg-you-at-least-tell-me-what-can-be-doneno-gene",
  "content": "There is this game called Mafia 2 and since its release modders hve been trying to access encrypted files in the game. It was not until the years 2013 and 2014 that a Russian modder that goes by the name of Y.u.s.i.k created programs with the sole purpose of decompiling particular files in the game. One of these programs is the FrameRes_Editor.exe, it gives users the ability to modify certain components of selected vehicles in the game via the alteration of a Frameresource,bin file that is located inside the selected car file.. However, whenever I try to open car files, I receive an error notification that prevents me from saving any work performed. I am always met with an error detection whenever I try to edit a car: \" value was either too large or too small \".\n\nhttp://img.playground.ru/images/5/9/Capture_FrameResource_Error_Possiblly_Faulty_Program.PNG\n\nThere are files that were created by the Mafia 2 developers and this program will even classify the work of these professionals as erroneous, incorrect. Some example of this are the \"jefferson_provincial.sds\" and \"smith_200_pha.sds\" file. The program will even detect errors in unmodified content. I did nothing to the \"jefferson_provincial.sds\", the program detects an error in nearly ALL of the cars. This is obviously wrong because the modification of most car files date back to 2010.\n\nhttp://img.playground.ru/images/1/2/Capture_Mafia_2_Cars_Folder_Unmodified_Content.PNG\n\nI am not requesting that helpers download the game to assist me, rather I am only asking that you download the program along with the provided .sds file. You will see that you cannot save such file - even after running the program as administrator. This is due to a STUPID error that is unnecessary since I mentioned that a majority of cars, regardless of their modification, are classified as erroneous. I am in need of a capable computer programmer. It would be great if someone could edit the FrameRes_Editor.exe program in a way that could allow users to circumvent this error detection. that way, I could still save files after false errors are detected.\n\nHere are the files:\n\nFrameRes_Editor.exe\n\nhttps://yadi.sk/d/Zjv_wkgj3XzPDr\n\nsmith_200_pha.sds\n\nhttps://yadi.sk/d/d5Wb4CVM3XzPQx\n\n",
  "votes": "-3",
  "answers": 1,
  "views": "292",
  "tags": [
    "tools"
  ],
  "user": "osaru badiaru",
  "time": "6 years ago",
  "comments": [],
  "answers_data": [
    {
      "content": "So, i tracked your bug.\n\nThe simple explanation:\nsome values in the file are too large/small for the program to handle,\n you'll need to re-write them. basiclly, everything past 3E+38 will prevent the program from working. I lack knowlage in C# and never tried patching C# programs so that's all i can offer. Also note that some values might affect in-game stuff, I do not know how different the result might be - i can only hope that it'll be unnoticable.\n\nNow, a bit info on the problem:\nThe program was written in C# so i could get the source code. i used dnSpy.\nThe error was inside a function named \"Bound_Write\", it tries to convert a String to float using Convert.toSingle().\nA value in the Blend section in the file was \"a bit\" over 3.4E+38 and it threw an exception. That exception triggered the alert and stopped the saving process.\nThe Single.MaxValue is around 3.4E+38, so I just rounded the number to 3E+38.\nYou can find the modified \"smith_200_pha.sds\" here:\n\n```\nhttps://files.fm/u/cm4wk8yk\n\n```\nEDIT:\ni ended up patching the executable, turns out it wasn't that difficult. dnSpy has a built-in option for that.\nnote, it only takes care of cases where the input is in the form of 3...E+38, positive and negative. it means that if you have 4.1E39 for example, this patch will NOT work. i am not fully aware of C# limitations and what numbers the game allows his fields to have. this patch is solely for convenience and doesn't make this progrem flawless.\nthe patched executable can be found here:\n\n```\nhttps://www.filedropper.com/framereseditor1\n\n```\n",
      "votes": "3",
      "user": null,
      "time": "Jun 19, 2018 at 0:26",
      "is_accepted": false,
      "comments": [
        {
          "user": "osaru badiaru",
          "text": "Hey, Amirag, thank you for your help; I was able to follow your approach in fixin the Single related error detection issue. However, the program does not save anything at all. I also discovered that it was an issue in the original, unedited version - which would indicate that was not the edit on dnSpy. Once an .sds file is saved in the program via the \"Save As\" button, the detail in the property .sds file acknowledges such modification, but the file content does not. The program disregards the edits performed on the file and reverts such file to its original condition - nothing can be saved.",
          "time": null
        },
        {
          "user": "osaru badiaru",
          "text": "To view the edited program: yadi.sk/d/uIzNNqJ03YyQ4w  To test the program's performance on saving: yadi.sk/d/d5Wb4CVM3XzPQx          I really hope a solution can be contrived",
          "time": null
        },
        {
          "user": "user22970",
          "text": "seems like it works. is there a problem or did i just misunderstood?",
          "time": null
        },
        {
          "user": "osaru badiaru",
          "text": "I told you, it doesn't save any edits. You might have thought that I meant that there was an exception in the program's saving. However, that is not the case; the edits to .sds files are not saved. Try altering a number or more in the provided .sds file, and return to such file after saving to see if the saving function of the program is flawless.",
          "time": null
        },
        {
          "user": "osaru badiaru",
          "text": "For example, if you changed a value in the .sds file through the program, then such edit would not be saved. There will be no error notification or exception when the save button is pressed; however, the content of the .sds file remains the same. You could test this by simply changing a value in the .sds file via the program, then saving the file. Afterwards, you can return to the file to discover whether or not such edit was saved.",
          "time": null
        }
      ]
    }
  ]
}