{
  "title": "How to view SDK files and is it mandatory to run modified apk on rooted device",
  "link": "https://reverseengineering.stackexchange.com/questions/18561/how-to-view-sdk-files-and-is-it-mandatory-to-run-modified-apk-on-rooted-device",
  "content": "I am performing reverse engineering on android apk using apktool.\n\n",
  "votes": "-1",
  "answers": 2,
  "views": "77",
  "tags": [
    "android",
    "java",
    "apk"
  ],
  "user": "Rick",
  "time": "Jul 5, 2018 at 6:19",
  "comments": [
    {
      "user": "TheKalin",
      "text": "@1 - You can view it here github.com/AndroidSDKSources @2 - If you make some changes in the .smali files it is not necessary to run the apk file on rooted devices. You need to recompile the apk file, sign it with proper certificate (developer cert is ok), it can be done manually or with github.com/appium/sign.",
      "time": null
    },
    {
      "user": "Rick",
      "text": "@TheKalin, My friend has encrypted the db and stored the encryption password in NDK (.c files), I want to find the password via reverse engineering.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can view the SDK by downloading it yourself.\n\nChanging the dex file (which smali assembles to), or any other contents of an apk will invalidate the signature of the app, which will cause it to fail to install/update. \n\nHowever, you can always just resign the app yourself and it will run fine, assuming the app itself isn't doing any integrity checks, or is using any signature based custom permissions, etc. Note that if you already have the app installed, you will need to uninstall it, because otherwise the signatures won't match and the app will fail to update.\n\n",
      "votes": "2",
      "user": "Antimony",
      "time": "Jun 19, 2018 at 13:36",
      "is_accepted": false,
      "comments": [
        {
          "user": "Rick",
          "text": "There are some changes made in SDK/NDK and then apk is build, So i wanted to view it by reverse engineering.",
          "time": null
        }
      ]
    },
    {
      "content": "1) The Code written in NDK files is visible in .so files.\n\n2) It is not mandatory to run the  modified apk on rooted devices,but its a better option to run on rooted devices.\n\n",
      "votes": "0",
      "user": "Rick",
      "time": "Jul 5, 2018 at 6:18",
      "is_accepted": true,
      "comments": []
    }
  ]
}