{
  "title": "x64dbg - see the current position?",
  "link": "https://reverseengineering.stackexchange.com/questions/18634/x64dbg-see-the-current-position",
  "content": "i.e. when the program is running, and x64dbg is attached to the process - how can i see where it is at this moment?\n\n\n",
  "votes": "3",
  "answers": 2,
  "views": "6k",
  "tags": [
    "x64dbg"
  ],
  "user": "T.Todua",
  "time": "Dec 1, 2018 at 10:17",
  "comments": [
    {
      "user": "Michael Pittino",
      "text": "I don't know if I understood correctly but as you haven't marked mrexodia's answer as the correct one I was wondering if you mean on how to set the view to where the current thread execution is. You can do so by double clicking the RIP register.",
      "time": null
    },
    {
      "user": "T.Todua",
      "text": "@MichaelPittino this question was a while ago, but now i can't understand well, why i've marked that answer. I really want to know where the current application execution/thread is at this moment",
      "time": null
    },
    {
      "user": "Gero B.",
      "text": "In CPU view right click -> go to -> origin",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "From your screenshot I understand that you want to break on. You can do this by breaking on the debug string event. Use the following setting:\n\n\n\nIf you want to pause the execution, simply click the “pause” button. If you want to see the current instruction executes you can use the “Threads” tab and double click the EIP/RIP column of one you’re interested in.\n\n",
      "votes": "4",
      "user": "mrexodia",
      "time": "Nov 18, 2018 at 17:44",
      "is_accepted": false,
      "comments": [
        {
          "user": "T.Todua",
          "text": "can you remind me where is the RIP column?",
          "time": null
        },
        {
          "user": "mrexodia",
          "text": "The column with the name RIP or EIP (depending on what architecture you’re debugging)",
          "time": null
        },
        {
          "user": "T.Todua",
          "text": "yes, i  see the EIP . thanks!",
          "time": null
        }
      ]
    },
    {
      "content": "Use the keyboard shortcut Ctrl+G (go to expression) and type eip or rip depending on your architecture.\n\n\n\n",
      "votes": "2",
      "user": "Viktor",
      "time": "Aug 28, 2022 at 17:06",
      "is_accepted": false,
      "comments": []
    }
  ]
}