{
  "title": "What is the difference between Windbg and local debugger in IDA",
  "link": "https://reverseengineering.stackexchange.com/questions/18657/what-is-the-difference-between-windbg-and-local-debugger-in-ida",
  "content": "When I want to debug an .exe on Windows with IDA  I can choose between Windbg or local debugger.\n\nWhat is the difference?\n\nBy the way, is there any difference if I use Windbg tool (windows software) to debug .exe file, or if I debug with IDA and choose Windbg debugger?\n\n",
  "votes": "2",
  "answers": 2,
  "views": "3k",
  "tags": [
    "ida",
    "windows",
    "debugging",
    "x86",
    "windbg"
  ],
  "user": "debuuger",
  "time": "Jul 2, 2018 at 10:08",
  "comments": [],
  "answers_data": [
    {
      "content": "The Windbg debugger plugin is an IDA Pro debugger plugin that uses Microsoft's debugging engine (dbgeng) that is used by Windbg, Cdb or Kd.\n\nThe Windbg plugin is very similar to IDA Pro's Win32 debugger plugin, nonetheless by using The Windbg plugin, one can benefit from the command line facilities and the extensions that ship with the debugging tools.\n\nFor example, one can type “!chain” to see the registered Windbg extensions:\n\n“!gle” is another command to get the last error value of a given Win32 API call.\n\n\n\nAnother benefit of using the Windbg debugger plugin is the use of symbolic information.\nNormally, if the debugging symbols path is not set, then the module window will only show the\nexported names. For example kernel32.dll displays 1359 names:\n\nLet us configure a symbol source by adding this environment variable before running IDA:\nset _NT_SYMBOL_PATH=srv*C:\\Temp\\pdb*http://msdl.microsoft.com/download/symbols\nIt is also possible to set the symbol path directly while debugging:\n\nand then typing “.reload /f” to reload the symbols.\nNow we try again and notice that more symbol names are retrieved from kernel32.dll:\n\nNow we have 5818 symbols instead!\nIt is also possible to use the “x” command to quickly search for symbols:\n\n(Looking for any symbol in any module that contains the word “continue”)\n[source] \n\nFor the second part of your question, use IDA Pro debugger (Windbg debugger plugin) if you need IDA Pro features otherwise use Windbg. \n\n",
      "votes": "6",
      "user": "user22363",
      "time": "Jul 2, 2018 at 9:15",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "From the standpoint of how IDA and Windbg connect to the debugged process, there's no difference. From the standpoint how IDA and Windbg handle debugging events while the program is running there's a difference. Up to some time IDA was very bad at it, and choosing windbg way was a better option. So using IDA local debugger is ok, unless you need to execute some windbg commands from IDA while debugging. But in case you have problems while debugging, you have a backup option to try. \n\n",
      "votes": "1",
      "user": "Anton Kukoba",
      "time": "Jul 2, 2018 at 7:39",
      "is_accepted": false,
      "comments": []
    }
  ]
}