{
  "title": "WinDbg fails to connect to IDA Pro debugger server",
  "link": "https://reverseengineering.stackexchange.com/questions/1873/windbg-fails-to-connect-to-ida-pro-debugger-server",
  "content": "Environment:\n\nI have VirtualKD setup correctly in my guest and host.\nI say this because attaching WinDbg to the guest VM through VirtualKD works flawlessly.\n\nBut when I try to connect IDA Pro's WinDbg interface using instruction on this page, IDA keeps throwing the following error:\n\n```\nWindbg: using debugging tools from '<PATH>'\nConnecting to debugger server with 'com:port=\\\\.\\pipe\\kd_Win7x64_SP1,pipe'\nConnect failed: The server is currently disabled.\n\n```\nVirtualKD's vmmon is running on the host and shows the following:\n\nUPDATE: Turns out, It's a problem with IDA 6.4. I happened to have IDA 6.3 installed on my machine too. That worked with no issues.\nHas anyone used IDA6.4 for live kernel debugging?\nCan someone please tell me how I can correct this issue in IDA 6.4?\n\n",
  "votes": "8",
  "answers": 1,
  "views": "8k",
  "tags": [
    "windows",
    "ida",
    "debuggers",
    "kernel-mode",
    "windbg"
  ],
  "user": "Lelouch Lamperouge",
  "time": "Apr 21, 2013 at 10:31",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "welcome to RE.SE. Are you connected with WinDbg while you try to connect with IDA?",
      "time": null
    },
    {
      "user": "Lelouch Lamperouge",
      "text": "No I'm not :) No other debugger is connected to the target at present",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "I would strongly recommend using official support channels (i.e. email) for such localized IDA issues.",
      "time": null
    },
    {
      "user": "Lelouch Lamperouge",
      "text": "Somehow that thought never struck me. Thanks!",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I had the same problem at first when trying to connect IDAPro to windbg. What I did was the following:\n\n",
      "votes": "6",
      "user": "perror",
      "time": "Jul 10, 2013 at 9:17",
      "is_accepted": true,
      "comments": [
        {
          "user": "gelodelrosario",
          "text": "Just to add,  it should be double backslashed, like in C programming. And make sure you selected Kernel Debugging in Debugger->Debug Options->Specific Debug Options",
          "time": null
        },
        {
          "user": "cwd",
          "text": "Also make sure that you have the 32-bit version of the debugger tools installed - the package is WinSDKDebugToolsRedist_x86 but MS won't install it when you install the debugging tools if you are on a 64-bit system.",
          "time": null
        }
      ]
    }
  ]
}