{
  "title": "How to install ida plugin to identify encryption function",
  "link": "https://reverseengineering.stackexchange.com/questions/18747/how-to-install-ida-plugin-to-identify-encryption-function",
  "content": "I saw here How to identify known encryption algorithm? the IDA  plugin  https://github.com/nihilus/IDA_Signsrch\n\nI don't understand how to install it .\n\nIn the INSTALL I saw coppy the plug-in and signsrch.xml file to your IDA Pro \"plugins\" directory   .\n\nI saw signsrch.xml file but I not found what is the plug-in that I neet to copy too.\n\nthat source file ,.\n\nplease help me to install this plugin\n\n",
  "votes": "-2",
  "answers": 1,
  "views": "3k",
  "tags": [
    "ida",
    "encryption",
    "ida-plugin",
    "plugin"
  ],
  "user": "ffdebugger",
  "time": "Jul 10, 2018 at 21:11",
  "comments": [],
  "answers_data": [
    {
      "content": "You need to compile the plugin using the IDA SDK, which should result in a binary which you can then copy to the plugins directory.     Possibly the original project on sourceforge provided precompiled binaries but they don’t seem to be present on the GitHub mirror.\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Jul 10, 2018 at 20:33",
      "is_accepted": false,
      "comments": [
        {
          "user": "ffdebugger",
          "text": "how do I compile that with IDA SDK? and why should I do that? why they not give compile file that I only need to copy them?   I don't found compile file on sourceforge too",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "nobody is obliged to give you anything, if you want to use it it’s up to you to find a way or ask/pay someone to do it for you.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@ffdebugger as an IDA Pro customer you will have gotten the credentials to download the latest IDA SDK at the time of your last download. With active maintenance you could simply request a renewal (even if it means staying on the same version). Having that SDK will then enable you - with the help of any of the supported debuggers - to build the plugin for IDA versions supported by said SDK. If you're using the freeware IDA version you'll be out of luck, though, since that doesn't support extensions (not without jumping through some hoops).",
          "time": null
        }
      ]
    }
  ]
}