{
  "title": "How do I create an ASCII string in OllyDBG?",
  "link": "https://reverseengineering.stackexchange.com/questions/18746/how-do-i-create-an-ascii-string-in-ollydbg",
  "content": "During the debugging process, I can use binary edit in order to add commands where I want, etc. However, I can't find any way to add an ASCII string at an address in which I can reference later. If I try to add something like: \"hello\", OllyDBG will just translate the bytes into commands and edit the assembly commands into the program.\n\nIs there a way to just add the ASCII string into the program?\n\n",
  "votes": "1",
  "answers": 2,
  "views": "2k",
  "tags": [
    "ollydbg",
    "debugging",
    "debuggers"
  ],
  "user": "sif",
  "time": "Jul 10, 2018 at 18:12",
  "comments": [],
  "answers_data": [
    {
      "content": "ollydbg v2\n\nCtrl+E  -> Ascii -> \"Hello\" -> Enter  and -> Ctrl+A    (to make ollydbg understand its string not code )\n:(colon) Label for later Reference\n\nuse CTRL+G and type the label name for \n\nhere is a screen shot of a partially matched label that follows\n\n\n\n```\nCPU Disasm\nAddress                                Hex dump          Command              Comments\n00D13FC0 This Is My Newly Added String 48 65 6C 6C 6F 00 ASCII \"Hello\",0;ASCII \"Hello\"\n\n```\nollydbg 1 \nRightClick -> Analysis -> During Next Ananlysis Treat Selection As Ascii String \n\n",
      "votes": "1",
      "user": "blabb",
      "time": "Jul 11, 2018 at 18:03",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Most byte combinations make up valid opcodes. Its just a questions on how to interpret these bytes. You can use the hex view to check the bytes.\n\nYou can always use a hexeditor to modify data and code. If you want to 'add' the string, you may need to inflate the file and fix segment/section offsets of the file format you are using.\n\nPossibly related question:\nHexadecimal editing with and without ollydbg weird issue\n\n",
      "votes": "1",
      "user": "Nordwald",
      "time": "Jul 11, 2018 at 6:03",
      "is_accepted": false,
      "comments": []
    }
  ]
}