{
  "title": "Why can I see certain strings when PE is opened with a hex editor or a simple static analysis tool but not with IDA?",
  "link": "https://reverseengineering.stackexchange.com/questions/18823/why-can-i-see-certain-strings-when-pe-is-opened-with-a-hex-editor-or-a-simple-st",
  "content": "I found the executable in question using VirusTotal \"hunting\" feature, where one can run Yara rules for the files existing in VT database and match the strings. I downloaded the file, opened it with PEStudio and it turned out to contain very many strings that were email addresses, one of which was the string I looked for in VT:\n\n\nPlease note, the number of extracted strings is pretty high.\n\nHowever, when I opened the executable in IDA, none of these email strings were found. The number of strings was much lower too. But, instead I found, for example, these strings:\n\n\nDoes this possibly mean that the emails do not come from a pre-existing list but are generated by the executable?\n\nIn addition, I noticed some text file names in the PEStudio's string list, but they were also nowhere to be found in IDA's list. Is there any difference between IDA's and PEStudio (and similar tools') string extraction?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "588",
  "tags": [
    "ida",
    "strings"
  ],
  "user": "skooog",
  "time": "Jun 17, 2020 at 9:54",
  "comments": [
    {
      "user": "Jongware",
      "text": "IIRC, by default Ida skips reading resource sections. Use that other software to see if that's where these strings occur.",
      "time": null
    },
    {
      "user": "skooog",
      "text": "@usr2564301 Why does Ida skip resource sections? I actually found the missing strings among resources when I opened the PE with Resource Hacker, so it seems to be the case.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "As confirmed in a comment, these strings appear in the Resources section of the executable. \n\nSee this image (taken from the related IDA Pro can't view part of the file, which I can see exists WinHEX and adjusted to highlight this option):\n\n\n\nIt is likely disabled by default because they are not important to the process of disassembling, and they might be quite large. So this is only (marginally) useful when you are interpreting parts of the disassembly that use resources.\n\nAs Ida PRO does not parse common resource formats, it may not be able to show your strings in its \"Strings\" window, and always list them as raw data. So you may want to prefer to use an external resource viewer anyway.\n\n",
      "votes": "3",
      "user": "Jongware",
      "time": "Jul 18, 2018 at 10:03",
      "is_accepted": true,
      "comments": []
    }
  ]
}