{
  "title": "Radare2 - How to scale panel height in visual panels mode?",
  "link": "https://reverseengineering.stackexchange.com/questions/18846/radare2-how-to-scale-panel-height-in-visual-panels-mode",
  "content": "Visual Panels Mode (V!):\n\nI need more space (height) for RegisterRefs and less for Registers (its 50% blank anyway). How can i do that? I can move the vertical split with H and L but i couldn't find anything for the horizontal splits.\n\n",
  "votes": "5",
  "answers": 2,
  "views": "2k",
  "tags": [
    "radare2"
  ],
  "user": "Maniaxx",
  "time": "Jul 19, 2018 at 19:26",
  "comments": [
    {
      "user": "Megabeets",
      "text": "Sadly, this feature is not implemented yet. It's a work-in-progress and I hope you'll see the feature implemented in the next few weeks.",
      "time": null
    },
    {
      "user": "ibitebyt3s",
      "text": "Even though this is already answered, this gitbook could help you out in the future radare.gitbooks.io/radare2book/visual_mode/visual_panels.html",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I found a way! \nPress w you will enter in \"Window mode\" \nUse hjkl to move around panels and HJKL to resize then.\nTo quit \"Window mode\" press q\n\n",
      "votes": "5",
      "user": "Ricardo",
      "time": "Apr 10, 2019 at 20:46",
      "is_accepted": true,
      "comments": [
        {
          "user": "Matthias Braun",
          "text": "This is now documented here.",
          "time": null
        }
      ]
    },
    {
      "content": "I'm not sure if there is an option for that. What you could do is to close Registers and some other frames that you do not use at the moment thus creating more space for the registers. To close the section, move to it with TAB and then close with X.\n\n\n\n",
      "votes": "3",
      "user": "Paweł Łukasik",
      "time": "Jul 20, 2018 at 6:59",
      "is_accepted": false,
      "comments": [
        {
          "user": "Maniaxx",
          "text": "Unfortunately, no persistent solution. Its all back to stock if you leave and re-enter the mode. Also, y-size gets spread evenly when y-split line is moved. Looks like there's currently no solution. I probably have to work more with the cmdline instead then.",
          "time": null
        },
        {
          "user": "Paweł Łukasik",
          "text": "or you can implement something like that and send a pull-request. Or suggest implementing something like this in the radare2 repo.",
          "time": null
        }
      ]
    }
  ]
}