{
  "title": "How to use Python while debugging in IDA",
  "link": "https://reverseengineering.stackexchange.com/questions/18899/how-to-use-python-while-debugging-in-ida",
  "content": "I'm debugging an .exe file in IDA.\n\nAt a specific point during debugging, I want the Python code to automatically take the data in *(eax+8) and encrypt it with that module and print the result to file in my disk.\n\nThe Python package I want to use is pycrypto (more specifically the AES module from it).\n\nfor example:\n\n```\nfrom Crypto.Cipher import AES\nfrom Crypto import Random\n\nkey = b'Sixteen byte key'\niv = Random.new().read(AES.block_size)\ncipher = AES.new(key, AES.MODE_CFB, iv)\nmsg = iv + cipher.encrypt(b'here I want to put the data in eax+8')\n\n```\nand write the  msg to c:\\.txt\n\nHow can I do it?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "385",
  "tags": [
    "ida",
    "encryption",
    "python",
    "executable"
  ],
  "user": "Jonert6544",
  "time": "Jul 26, 2018 at 10:55",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "From your question (before my edit and still now) it's unclear what exactly is at (eax+8). From the context I'd assume it's some array of bytes of arbitrary length, but from your use of *(eax+8) I'm more inclined to think it's a fixed size datum. So which is it?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Use breakpoints with conditions and add your Python script as the condition. Do whatever you want in the Python code and then either return True or False if you want the debugger to stop or not.\n\n",
      "votes": "1",
      "user": "0xC0000022L",
      "time": "Jul 26, 2018 at 10:56",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jonert6544",
          "text": "Do I need to install IdaPython to write pyhon in condition? and how do I take to pyhon the value the in *(eax+8) ??",
          "time": null
        },
        {
          "user": "joxeankoret",
          "text": "You can use either IDC or IDAPython. To read the value from *(eax+8) you can use: Dword(cpu.EAX + 8), IIRC.",
          "time": null
        },
        {
          "user": "Avery3R",
          "text": "When making the condition make sure to hit the ... button to the right that brings out the big script editor and in the dropdown near the bottom change the language from IDC to python. I'm not sure if that'll actually wok though cause I've only written bp conditions in IDC",
          "time": null
        }
      ]
    }
  ]
}