{
  "title": "IDA function never called and only cross-referenced as data",
  "link": "https://reverseengineering.stackexchange.com/questions/18930/ida-function-never-called-and-only-cross-referenced-as-data",
  "content": "When I press the  X key (list x-refs) on a function (sub_xyz) to see which functions call it, I only saw dd offset sub_xyz twice, with no call sub_xyz instructions.\n\nThere is no another place that write call sub_xyz\n\nHow can I see which functions are calling sub_xyz?\nIs this just IDA being confused?\n\n",
  "votes": "4",
  "answers": 2,
  "views": "1k",
  "tags": [
    "ida",
    "disassembly",
    "functions",
    "control-flow-graph"
  ],
  "user": "Keystone",
  "time": "Jul 30, 2018 at 20:32",
  "comments": [
    {
      "user": "Avery3R",
      "text": "Can you take a screenshot of the area around the dd sub_xyz or provide the binary if possible?",
      "time": null
    },
    {
      "user": "Keystone",
      "text": "That not possible.  What do I need to look there? Is that anti debugging?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Although Nirlzr's answer explains it pretty well, here's an example that considers C++ code and vtables are present. The code is taken from here\n\n```\n#include <iostream>\nusing namespace std;\nclass Vehicle {\npublic:\n  virtual void ApplyBreaks() { cout << \"Vehicle Break\" << endl; }\n  virtual void ApplyHorns() { cout << \"Vehicle Horns\" << endl; }\n};\n\nint main() {\n  Vehicle *v = new Vehicle();\n  v->ApplyBreaks(); // Calls vehicle ApplyBreak\n  v->ApplyHorns();  // Calls vehicle ApplyHorn\n}\n\n```\nCompiling with g++ and opening in IDA references to ApplyBreaks are such.\n\n\n\nThis is very common in C++ applications to have function references in vtables. Additionally while init in Vehicle this vtable is set in the object as you can see here.\n\n\n\nWhile calling member functions for this class in main the addresses are accessed like an array with offsets defined at compile time.\n\n\n\nAt main+48 the first(0th) member ApplyBreaks is accessed and at main+71 ApplyHorns is accessed which is next to ApplyBreaks.\n\n",
      "votes": "4",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": false,
      "comments": [
        {
          "user": "NirIzr",
          "text": "Yeah, VTables are kind of a very common scenario this could happen in. Maybe I should have put more focus on that. Great answer, +1 :)",
          "time": null
        }
      ]
    },
    {
      "content": "If there are no other references, this indicates there are no call sub_xyz (that IDA identified, at least). Instead, IDA only identified one cross-reference to sub_xyz, and that reference was a hardcoded offset in a data variable.\n\nUsually, there's a piece of code that accesses that data and indirectly calls the function, so you could search for cross-references to that data area. You should note the reference does not have to reference where the sub_xyz's offset it. Instead, sub_xyz's offset may be part of a bigger structure (or an array, or an array of structures), which may be enumerated. You'll need to search for references that point around that area (these could also be offsets to areas with higher addresses which are then being subtracted).\n\nAssume that when looking up cross-references to sub_xyz you've found only one, at address 00008540 depicted below.\n\n```\nunk_00008538\n    00008538    dd offset sub_foo\n    0000853c    dd aFuncionFoo      ; \"Function Foo\"\n    00008540    dd offset sub_xyz       <- our sub_xyz reference\n    00008544    dd aFunctionXYZ     ; \"Function XYZ\"\n    00008548    dd offset sub_abc\n    0000854c    dd aFunctionABC     ; \"Function ABC\"\n\n```\nYou can notice above dd offset sub_xyz (located at address 00008540) you've got an offset to another subroutine, sub_foo (located at 00008538), and that although there're no cross-references to dd offset sub_xyz (at 00008540) there are cross-references to dd offset sub_foo (at 00008538).\n\nYou can also notice there's another subroutine offset at 00008548, and that after every subroutine offset there's another offset, to a string that coincidentally has the function's name in it. This is obviously a relatively easy example and we can assume these are actually three instances of a structure with two members each, that may be define like that:\n\n```\ntypedef struct FunctionDefinition\n{\n    void* func_addr;\n    char* func_name;\n} _FunctionDefinition;\n\n```\nWe can also guess we found an array of three instances of the FunctionDefinition structure, and that some piece of code enumerates the array and traverses all the functions.\n\nA more sophisticated example can include, for example, an array of functions and their network message identifier, where a function handling a network command is dispatched depending on the type of message received, for example. You can also have found a global object of any class if you're dealing with C++, or perhaps even a function virtual table. The options are endless, and you'll need to figure it out using the specific scenario you encounter and and additional info you can gather (say, the code referencing that bigger structure or array).\n\n",
      "votes": "2",
      "user": "NirIzr",
      "time": "Jul 30, 2018 at 20:28",
      "is_accepted": false,
      "comments": [
        {
          "user": "Keystone",
          "text": "There is no call sub_xyz and I saw dd sub_xyz twice in xref, so you tell seach xref in the area of sub_xyz and looking call to there?",
          "time": null
        },
        {
          "user": "NirIzr",
          "text": "@Keystone I've added an example, i hope this will help you understand this better.",
          "time": null
        }
      ]
    }
  ]
}