{
  "title": "How to watch communication between 2 processes?",
  "link": "https://reverseengineering.stackexchange.com/questions/18998/how-to-watch-communication-between-2-processes",
  "content": "I have exe file in my pc(exe1) that send message to another exe (client-server maybe).\n\nI dont know which exe recived this message from exe1 and with which iso that message encoding.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "619",
  "tags": [
    "ida",
    "dynamic-analysis"
  ],
  "user": "Keystone",
  "time": "Aug 6, 2018 at 15:58",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "what is \"ISO\"? also please fix \"witch\" to \"which\"",
      "time": null
    },
    {
      "user": "Keystone",
      "text": "@IgorSkochinsky there are a variety of ways how to encode message between 2 processes (how to encode each 8 bits). For ex. if yiu encode each 8 bits with ASCII ,because ASCII is only 7 bits, you lose the msb bits of each byte",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "why do you think one exe is sending messages to another? please add more information to the question",
      "time": null
    },
    {
      "user": "Keystone",
      "text": "For ex. in exe1 there is user login (put user and password) and exe2 add this user and password to database,  exe1 don't have a access to db",
      "time": null
    },
    {
      "user": "dsasmblr",
      "text": "Do you know if the message sent is via a proprietary API or Windows API? If the latter, then perhaps an application like API Monitor might be of help: rohitab.com/apimonitor",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "There are multiple ways two processes can communicate. The general term for this is IPC (Interprocess Communications). On Windows, the following forms of IPC are commonly used:\n\nLess common but still possible:\n\nWhich one is actually used is difficult to say with limited information you provided. Using an API monitor, as suggested by @dsasmblr may give you some hints. You can also just debug or RE the executable which processes user input and see what is being done with the entered information.\n\n",
      "votes": "4",
      "user": "Igor Skochinsky",
      "time": "Aug 7, 2018 at 20:14",
      "is_accepted": false,
      "comments": [
        {
          "user": "Keystone",
          "text": "I didn't success watch the communication at api monitor but I saw the message was sent when exe1 call to ObjectStublessClientXX in ole32.dll  is that explain something? Is that passable?",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "This smells like COM(or, less likely, RPC). Unfortunately there’s too little space in the answering box for introduction into COM",
          "time": null
        },
        {
          "user": "Keystone",
          "text": "Is there any way to verify that is com? Why do you think that COM when I tell ObjectStublessClientXX??",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "@Keystone \"stub\" and \"client\" is OLE/COM terminology: docs.microsoft.com/en-us/windows/desktop/Midl/…",
          "time": null
        },
        {
          "user": "Keystone",
          "text": "So when I saw ObjectStublessClientXX that mean communication between process? How can I see what is the message that send between process and to which process my process send that message??   Thank",
          "time": null
        }
      ]
    }
  ]
}