{
  "title": "IDA PRO - .id0: b Tree error: file open error: permission denied",
  "link": "https://reverseengineering.stackexchange.com/questions/19053/ida-pro-id0-b-tree-error-file-open-error-permission-denied",
  "content": "Many times after closing a file I am working on and trying to open it later I get an error:\n\n```\n<fileName>id0: bTree error: file open error: Permission denied\n\n```\n\n\neven when i copy this file to a new location and make sure i have write permission for it it still fails.\nany suggestions?\n\n",
  "votes": "1",
  "answers": 2,
  "views": "6k",
  "tags": [
    "ida"
  ],
  "user": "dandan",
  "time": "Aug 27, 2018 at 22:46",
  "comments": [
    {
      "user": "Biswapriyo",
      "text": "Does this error show only in Google Drive folder?",
      "time": null
    },
    {
      "user": "dandan",
      "text": "no - when i copy the file to another project i still see it. Another strange thing is that i was able to open these files fine. I then closed it and could not reopen.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "Did you copy all files from that folder or only a single one? Also, why don't you get in touch with the Hex-Rays support? They surely have a better chance at salvaging damaged IDA databases than anyone here.",
      "time": null
    },
    {
      "user": "w s",
      "text": ".id0 (exactly as .id1, .id2, .nam, .til) are temporary files that IDA tries to open when opening database, which means that if you successfully closed your database they are not important. Try to move .idb (or.i64) file(which is the database file itself) to another folder without other files. Are you still unable to open it ?",
      "time": null
    },
    {
      "user": "w s",
      "text": "btw, stupid question: do you have enough place on the disk ?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I my case I resolved the issue by removing file attribute \"archive\". I was faced with this using common Drobpox folder for IDA on Windows host and IDA on Wine environment.    \n\n",
      "votes": "2",
      "user": "Igor Matyuh",
      "time": "Apr 25, 2019 at 9:42",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "You could run Process Monitor (https://docs.microsoft.com/en-us/sysinternals/downloads/procmon) and filter on the process name of IDA to narrow down the problem and see which operation exactly causes the issue.\n\n",
      "votes": "0",
      "user": "hariom",
      "time": "Aug 14, 2018 at 7:21",
      "is_accepted": false,
      "comments": [
        {
          "user": "dandan",
          "text": "i tried running ida as admin an was able to open the file...",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "Permission denied always happens on opening/creating. Once you have a handle, there aren't any more permissions checks.",
          "time": null
        }
      ]
    }
  ]
}