{
  "title": "What is ObjectStublessClientXX in ole32dll?",
  "link": "https://reverseengineering.stackexchange.com/questions/19062/what-is-objectstublessclientxx-in-ole32dll",
  "content": "When I do dynamic reversing I saw usage with ObjectStublessClientXX in ole32.dll .\n\nWhat is that function? What does it do?\n\nIs there any way that it supposed to transfer message between 2 processes? I see that after those function called from 1.exe so 2.exe got a message\n\n",
  "votes": "1",
  "answers": 1,
  "views": "858",
  "tags": [
    "ida",
    "windows",
    "dll",
    "dynamic-analysis"
  ],
  "user": "Keystone",
  "time": "Aug 14, 2018 at 20:56",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "Is that the actual name or you have a specific number in place of XX?",
      "time": null
    },
    {
      "user": "NirIzr",
      "text": "@Keystone I noticed you don't usually accept answers. Is that intentional or are you just unaware of the meaning of accepting answers? May I interest you in accepting Biswapriyo's answer to this post, unless you find it lacking?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "COM is very abstract idea in Object Oriented Programming (OOP). To understand this well, you need some in-depth knowledge of Inheritance in OOP, Virtual Method Table, COM in separate process and Data Marshaling with COM.\n\nThose subroutines are part of a COM Proxy/Stub DLL. Proxy DLL are used when the COM interfaces are defined/implemented in separate DLL files. Think these as a simple function call but with COM virtual tables. In case of dynamic linking, DLL has exported functions and EXE files call them. In case of proxy/stub COM, the underlying functions are defined in a separate DLL files. When an executable call any method the parameters are marshalled (i.e. packed/assembled) through Proxy DLL to the main DLL where all the real things happens. Proxy DLLs contain just the list of those methods, aka. Virtual Functions in Virtual Method Table (vtable or vtbl). So, the \"ObjectStublessClient\" are the virtual functions only. In simple C language, this can be compared as function pointers in a structure (with oversimplification).\n\nIn IDA, go to View --> Open subviews --> Names or press Shift + F4 to open 'Names Window'.\nSearch for 'ProxyVtbl', you can find defined virtual tables. Here is an example of IOleCacheControl interface in Ole32.DLL file.\n\n```\n.rdata:00000001800CE9D0 ; $2F7D790A470334608EE0E1481017719B IOleCacheControlProxyVtbl\n.rdata:00000001800CE9D0 _IOleCacheControlProxyVtbl dq offset IOleCacheControl_ProxyInfo; header.piid\n.rdata:00000001800CE9D0                                         ; DATA XREF: .rdata:00000001800C9BF8↑o\n.rdata:00000001800CE9D0                 db 0D0h, 0AEh, 0Fh, 80h, 1, 3 dup(0); gap8\n.rdata:00000001800CE9D0                 dq offset IUnknown_QueryInterface_Proxy, offset IUnknown_AddRef_Proxy; Vtbl\n.rdata:00000001800CE9D0                 dq offset IUnknown_Release_Proxy, offset ObjectStublessClient3_0; Vtbl\n.rdata:00000001800CE9D0                 dq offset ObjectStublessClient4_0; Vtbl\n.rdata:00000001800CEA08                 align 10h\n\n```\n```\nMIDL_INTERFACE(\"00000129-0000-0000-C000-000000000046\")\nIOleCacheControl : public IUnknown\n{\npublic:\n    virtual HRESULT STDMETHODCALLTYPE OnRun( \n        LPDATAOBJECT pDataObject) = 0;\n    \n    virtual HRESULT STDMETHODCALLTYPE OnStop( void) = 0;\n    \n};\n\n```\n```\nGUID IID_IOleCacheControl = { 0x00000129, 0x0000, 0x0000, { 0xC0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x46 };\n\ntypedef struct _IOleCacheControl IOleCacheControl, *PIOleCacheControl;\n\nstruct _IOleCacheControl {\n    \n    //0th IUnknown_QueryInterface_Proxy\n    HRESULT (__fastcall *QueryInterface )( \n        PIOleCacheControl* This,\n        GUID* riid, \n        PVOID* ppvObject\n        );\n    \n    //1st IUnknown_AddRef_Proxy\n    ULONG (__fastcall *AddRef )( \n        PIOleCacheControl* This\n        );\n    \n    //2nd IUnknown_Release_Proxy\n    ULONG (__fastcall *Release )( \n        PIOleCacheControl* This\n        );\n    \n    //3rd ObjectStublessClient3_0\n    HRESULT (__fastcall *OnRun )( \n        PIOleCacheControl* This,\n        IDataObject* pDataObject\n        );\n    \n    //4th ObjectStublessClient4_0\n    HRESULT (__fastcall *OnStop )( \n        PIOleCacheControl* This\n        );\n    \n};\n\n```\nThe first three functions (QueryInterface, AddRef, Release) are inherited from (i.e. copied from) IUnknown interface. Then other remaining virtual functions are named with their offsets. Hence ObjectStublessClient3_0 is the OnRun() and ObjectStublessClient4_0 is the OnStop() function pointers. I changed the calling conventions to __fastcall because Windows binary generally use that calling conventions.\n\nOne can see a real example of this method in my repository GitHub: WslReverse where I show the hidden COM interface of LxssManager.DLL.\n\n",
      "votes": "5",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": true,
      "comments": [
        {
          "user": "Keystone",
          "text": "thank you about your replay, I searched in name windows ProxyVtbl but not found anything,  do you say that ObjectStublessClientXX point to some virtual function that implement in another place? I want to find which function is point about.  Thank!",
          "time": null
        },
        {
          "user": "Biswapriyo",
          "text": "@Keystone There are many COM vtable in ole32.dll. See this image. Look at the assembly view first to get the overall idea. If you double click on ObjectSutblessClient in assembly view IDA automatically opens that function.",
          "time": null
        },
        {
          "user": "Keystone",
          "text": "what do you mean? In my process that I open with ida I dont see in the 'Names Window' anything that contain ProxyVtbl.  Do you want me to open ole32.dll with ida? That windows dll, I want to see which function my process will do when ObjectStublessClientXX called.  When I tried to debug I see that when my process enter to ObjectStublessClientXX I see there ole32_objectstublessclientXX proc near  and then mov ecx xx   and jmp address that is again ObjectStublessClientXX",
          "time": null
        },
        {
          "user": "Biswapriyo",
          "text": "Book: IDA pro 2nd edition chapter 4.",
          "time": null
        },
        {
          "user": "Keystone",
          "text": "friend, I already read that, and workinf lot with ida, maybe I dont explain myself well,  please look on my last replay, if you can please help me to find which function has been called  when I see ObjectStublessClientXX I will thank you",
          "time": null
        }
      ]
    }
  ]
}