{
  "title": "Change value of an IF condition found in IDA",
  "link": "https://reverseengineering.stackexchange.com/questions/19115/change-value-of-an-if-condition-found-in-ida",
  "content": "so I have the .idb file of an executeable I want to modify.\n\nIn the IDB file, I found this code\n\n\n\nAnd I basically want to change 4111006 to 1006 in that IF condition.\nhowever, when I press TAB to go to pseudocode, this is what it shows me\n\n\n\n(marked in yellow)\n\nSo it shows 4121000 and 4111001 in these segments, but it doesn't show the rest and the one I want to change (4111006), preventing me from finding it in ollydbg / a hex editor and changing it.\n\nIs it possible to find 4111006 and change it to a different integer value? If so, how can I do that? Thank you.\n\n",
  "votes": "-3",
  "answers": 1,
  "views": "1k",
  "tags": [
    "ida",
    "assembly",
    "ollydbg",
    "decompilation",
    "executable"
  ],
  "user": "FightRay",
  "time": "Aug 20, 2018 at 20:52",
  "comments": [
    {
      "user": "user202729",
      "text": "First you need to learn assemble language and understand how the decompiled code corresponds to the disassembly.",
      "time": null
    },
    {
      "user": "Paweł Łukasik",
      "text": "please do not post code as images. It's really hard to copy paste from them.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The way how those IFs are constructed in the assembly is a bit different than what you see in high-level overview in IDA code.\n\nApart from the first one, ifs are represented with subtraction (sub & dec) and jz.\n\nThis code is an alternative of conditions:\n\n```\nif (Args == 4121000 || Args == 4111001)\n    goto LABEL_297\n\n```\nand is represented in asm with this code:\n\n```\n6DCC53: mov ecx, 4121000\n6DCC55: cmp eax, ecx\n6DCC57: jg short loc_6DCC93\n6DCC5D: jz loc_6DCBB6\n6DCC62: sub eax, 4111001\n6DCC68: jz loc_6DCBB6\n\n```\nbecause in the first 4 lines (excluding 3rd) you have the first part of the if (standard cmp + jz) and then later a value of 4111001 is subtracted from eax. If it results in zero then we know that the value was equal to it and we jump to the same location. So IDA identifies this as an alternative of two values: 4121000, 4111001.\n\nThe following ifs are represented with this:\n\n```\ndec eax\njz loc_6DCXXX\n\n```\nRemember that after the line 6DCC62 the value in eax we compare with is already -4111001, so if we subtract one more time and if we get zero, we know that the initial value was 4111002. This is why IDA represents this as:\n\n```\nif (Args == 4111002)\n    goto LABEL_346\n\n```\nThe next branches are the same. So you if want to modify the last one, you would have to modify the line that IDA correctly pointed you to + the one before. So instead of having there the same pattern as for all the other ifs, you need to write:\n\n```\ncmp ecx, 1006\njz 6DCD28\n\n```\nand assemble such opcodes.\n\n",
      "votes": "0",
      "user": "Paweł Łukasik",
      "time": "Aug 21, 2018 at 4:37",
      "is_accepted": true,
      "comments": []
    }
  ]
}