{
  "title": "IDA PRO run patched program from debugger without creating new exe",
  "link": "https://reverseengineering.stackexchange.com/questions/19119/ida-pro-run-patched-program-from-debugger-without-creating-new-exe",
  "content": "Using IDA PRO, after making a few patched, can I run the patched program in the debugger?\nWhat I have been doing so far is:\n1.  Edit > Patch Program > Apply patch to input file…\n2.  Save in a specific location\n3.  Move to windows location under /programs instead of the original file\n4.  Reload the patched file in IDA\n\nThis overwrites the original file. Mostly I need to put it in another location since the original may be under windows folder.\nIn addition if forces my to reopen IDA and load the patched file and since this is a new file I lose all my work.\n\nIs there a way, like in Oly, to simple run the patched file?\n\n",
  "votes": "2",
  "answers": 3,
  "views": "3k",
  "tags": [
    "ida"
  ],
  "user": "dandan",
  "time": "Aug 27, 2018 at 22:52",
  "comments": [],
  "answers_data": [
    {
      "content": "To debug a patched program in Ida, a simple way (for me!) is to patch it not in Ida, but in another hex editor. If you leave it its name, you will not lose your work in Ida. \n\nIn this way, you can leave Ida running and continue with the patched file, after applying \"File, Load File, Reload the Input File\". Your patches will show up.\n\nOf course, you always should have saved your original file.\n\n",
      "votes": "1",
      "user": "josh",
      "time": "Aug 21, 2018 at 10:44",
      "is_accepted": true,
      "comments": [
        {
          "user": "dandan",
          "text": "Can't i do the same in IDA? I mean patch it in IDA and load it? What I am trying to achieve is to load my patched file with all my comments and edits",
          "time": null
        },
        {
          "user": "josh",
          "text": "Probably yes. In earlier versions of Ida (V5), there only existed \"The Infamous Patch Program Menu\" (the quote denotes a chapter in Chris Eagle's famous book, Ed. 2008, about that Ida version). Therefore I got used to patch not in Ida. However, the patching is independent of not losing your work in Ida.",
          "time": null
        },
        {
          "user": "dandan",
          "text": "You can patch in IDA 7",
          "time": null
        }
      ]
    },
    {
      "content": "You can not create a copy of your input file from within IDA. But if you copy it to a different location, you can point IDA to patch it there by changing the input file path in the patch program window (I verified that in IDA Free 7.0). Afterwards, you change the \"Application path\" and input file in the Process Options dialog inside the debugger menu to run the patched version. (I verified the presence of these settings in IDA Pro 5.6, I don't have a later commercial version at hand).\n\n",
      "votes": "1",
      "user": "Michael Karcher",
      "time": "Aug 24, 2018 at 11:10",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "The simplest solution is to use DebugAutoPatch plugin. To install, download DebugAutoPatch.py file to IDA plugins directory. Its features:\n\n",
      "votes": "0",
      "user": "Lissanro Rayen",
      "time": "Dec 25, 2020 at 9:49",
      "is_accepted": false,
      "comments": [
        {
          "user": "dandan",
          "text": "It does not work for IDA 7.5",
          "time": null
        },
        {
          "user": "Lissanro Rayen",
          "text": "It does not work in 7.2 either. Even latest \"devel\" branch. As far as I can tell, latest supported version of IDA is 7.0. In the script DebugAutoPatch.py there is a note \"This has been tested with IDA 7.0 - I have made attempts at backward/forward compatibility, but please report bugs for other versions\". Lack of support for 7.2 and 7.5 was already reported few days ago in github issues, so hopefully eventually either author updates it or somebody will create a pull request to add support for newer IDA versions.",
          "time": null
        }
      ]
    }
  ]
}