{
  "title": "How to get rid of this error during pointer scan?",
  "link": "https://reverseengineering.stackexchange.com/questions/19144/how-to-get-rid-of-this-error-during-pointer-scan",
  "content": "I am trying to hack health cheat for Shanghai Dragon PC Game using Cheat Engine. For that I following this video.\n\nAfter finding the required address, I tried to save the pointer scan address, then it gives me this warning message:\n\n\n\nHow to get rid of this error during pointer scan? \n\n",
  "votes": "3",
  "answers": 1,
  "views": "506",
  "tags": [
    "cheat-engine"
  ],
  "user": "Sir John Fendrick",
  "time": "Aug 23, 2018 at 6:47",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "Welcome to RE.SE. While this isn't strictly about RCE, we've had cheat-engine questions before. However, this looks not like an error but a confirmation dialog giving you a sound warning ... how about you heed the warning and use the compare results?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "That is not an error. It's a message you will receive the first time you start a pointer scan with a new address. After you've scanned once, you can save that pointermap with which to compare against the next scan related to the value you're interested in finding a persistent pointer path for. You can save each subsequent pointermap and keep comparing that way.\n\nThe guy in the video doesn't have you do that. He has you keep the initial results window up and then keep rescanning after each restart of the game.\n\nThat message is a confirmation letting you know that an initial scan can take up a vast amount of disk space, especially in hefty modern day games. The video you linked to uses Assault Cube as its game target, which is a very small game and shouldn't take very long to scan (nor should it take up much disk space).\n\nThere are a few possible reasons as to why you didn't see that confirmation in the video you've linked to, so don't get too hung up on that. Just click \"Yes\" and be aware that, depending on the game you're scanning and your system, it can take anywhere from 30 seconds to 12+ hours for an initial pointer scan to complete, and your disk space can be eaten alive in the process.\n\n",
      "votes": "3",
      "user": "dsasmblr",
      "time": "Aug 24, 2018 at 1:18",
      "is_accepted": true,
      "comments": []
    }
  ]
}