{
  "title": "How do I reverse this firmware? 8-bit handheld console",
  "link": "https://reverseengineering.stackexchange.com/questions/19194/how-do-i-reverse-this-firmware-8-bit-handheld-console",
  "content": "\n\nI recently bought this chinese console that supposedly has 328 8-bit games. I want to understand the code and how it works to hack it and maybe load other ROMs. It has a chip covered in black epoxy resin that may be the microcontroller, and right next to it there's a flash memory, specifically the Winbond branded W25Q64 64Mbit (8 Mbyte) memory. Since I have an EEPROM/Flash reader I extracted the data from it. This is the complete .bin file: https://www.4shared.com/s/fYlAk9898gm\n\n\n\nI dont know what kind of processing I need to do to make readable-like code. The binary contains recognizable data like the index of the games, but is not much more\n\n",
  "votes": "8",
  "answers": 0,
  "views": "735",
  "tags": [
    "firmware",
    "embedded",
    "decompile",
    "rom"
  ],
  "user": "Lorenzo Ivan",
  "time": "Aug 30, 2018 at 4:15",
  "comments": [
    {
      "user": "fpmurphy",
      "text": "AFAIK, there is no tool which willl automatically identify the processor typw from a binary file.",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "@fpmurphy1 github.com/airbus-seclab/cpu_rec",
      "time": null
    },
    {
      "user": "fpmurphy",
      "text": "@IgorSkochinsky.  Very interesting!  Thanks.",
      "time": null
    },
    {
      "user": "Denis Laskov",
      "text": "Hi.   Looks like flash contain mostly data - games index, game data, possibly some code related to specific games.   Can you identify serial output on PCB itself? Maybe there are some other ports/sockets that looks familiar and may be used to solder in/connect the debug/usb/serial to observe SoC on chip under epoxy?",
      "time": null
    },
    {
      "user": "Maya",
      "text": "Could you upload the file to a civilized upload service, like mega, mediafire or google drive? I don't know why 4shared wants me to create an account, and I don't know whether I want to know...",
      "time": null
    }
  ],
  "answers_data": []
}