{
  "title": "IDA PRO - compare running process",
  "link": "https://reverseengineering.stackexchange.com/questions/19261/ida-pro-compare-running-process",
  "content": "I have a software which writes some data to specific location in memory depending on user choices.\nSay i can have 2 choices, A & B.\nI want to run IDA, set option A and save all the data, then run it again with option B and save and after that compare the 2.\n\nCan i do this?\n\nHow?\n\n",
  "votes": "1",
  "answers": 2,
  "views": "726",
  "tags": [
    "ida",
    "debugging",
    "patch-reversing"
  ],
  "user": "dandan",
  "time": "Sep 5, 2018 at 10:09",
  "comments": [
    {
      "user": "Rolf Rolles",
      "text": "The question is pretty vague: \"I want to run IDA, set option A and save all the data\". What does \"save all the data\" mean? If you're talking about something in a data section, you could manually save the data as a binary file and then do a binary diff after each. (You could even do this with an entire data section.) If you're talking about heap-allocated data, your life is going to be harder.  Nevertheless, the question really can't be answered until you be more specific about what the data is.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "What you are asking for is called \"Differential Debugging\". Take a look to this tutorial to see how to do so with IDA without requiring any kind of plugins, just built-in functionality.\n\n",
      "votes": "3",
      "user": "joxeankoret",
      "time": "Aug 27, 2020 at 9:17",
      "is_accepted": false,
      "comments": [
        {
          "user": "Eric",
          "text": "The link you provided for IDA does not work anymore",
          "time": null
        },
        {
          "user": "joxeankoret",
          "text": "I have updated to link to point to the PDF in the web archive.",
          "time": null
        }
      ]
    },
    {
      "content": "You may collect code coverage in both cases and then make a diff via ida plugin like lighthouse\n\n",
      "votes": "1",
      "user": "Anton Kukoba",
      "time": "Sep 5, 2018 at 10:56",
      "is_accepted": false,
      "comments": [
        {
          "user": "dandan",
          "text": "how do you collect the data for this plugin?",
          "time": null
        },
        {
          "user": "Anton Kukoba",
          "text": "the way it's described at \"Collecting Coverage\" section at the main page.",
          "time": null
        }
      ]
    }
  ]
}