{
  "title": "Need Advice for the purposes of learning [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/19285/need-advice-for-the-purposes-of-learning",
  "content": "I would really like to make a multiplayer mod for Fallout 4, I know how to program and i have a basic understanding of how to get opcodes and read/write to those. Now what i don't understand is how to find specific functions such as some sort of spawning function so i can spawn an npc to act as another player.\n\nI guess what i need is specific books or tutorials that will help with reversing functions or looking for specific functions to call. Any help would be greatly appreatiated.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "83",
  "tags": [
    "assembly",
    "x86-64"
  ],
  "user": "AxleJoint",
  "time": "6 years ago",
  "comments": [
    {
      "user": "Paweł Łukasik",
      "text": "This is a bit too broad.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You should start from official Bethesda website Community for mods developers:\n\nhttps://bethesda.net/community/category/134/mod-relz-and-wips\n\nAnd if there is no proper information there - grab some mod that implement features/functions you looking for from mods directory: https://bethesda.net/en/mods/fallout4 and RE it. \n\nHere you will find all sorts of manuals on how to begin RE, tools and techniques. \n\nGood luck )\n\nD.L.\n\n",
      "votes": "0",
      "user": "Denis Laskov",
      "time": "Sep 7, 2018 at 8:44",
      "is_accepted": false,
      "comments": [
        {
          "user": "AxleJoint",
          "text": "Thanks for the info but in order to make a multiplayer mod i have to make a client that hooks into the game and i can't use the actual modding system itself to do so. I need to actually reverse the game itself to do the things i'm looking to do.",
          "time": null
        },
        {
          "user": "Denis Laskov",
          "text": "So load it in IDA and go ahead :)",
          "time": null
        }
      ]
    }
  ]
}