{
  "title": "How to get execution time of IDC script?",
  "link": "https://reverseengineering.stackexchange.com/questions/19338/how-to-get-execution-time-of-idc-script",
  "content": "As a beginner I'm trying to disassemble a file with IDA Pro 6.8. I write some IDC script for time-consuming work.\n\nNow, I want to get the execution time of my script, but I can not find appropriate IDC function. Are there anyone to tell me how to write script get execution time?\n\nThanks in advance.\n\n",
  "votes": "4",
  "answers": 1,
  "views": "688",
  "tags": [
    "ida",
    "script"
  ],
  "user": "user6903",
  "time": "Sep 14, 2018 at 3:15",
  "comments": [
    {
      "user": "Abigail",
      "text": "If you would allow me to make a suggestion, I would highly recommend using idapython instead of idc. From what I've heard it seems easier to use/gives you all the python runtime too.",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "@Abigail: there may be reasons for using IDC over Python; we should try to answer the question as asked, unless it's obviously misguided.",
      "time": null
    },
    {
      "user": "Abigail",
      "text": "Fair enough. @user6903 you could try using call_system in IDC to get the system time somehow and wrap your functionality within calls to get the system time.",
      "time": null
    },
    {
      "user": "user6903",
      "text": "@Abigail. I can not find call_system in the list of IDC functions for IDA Pro 6.8. You mean other version of the IDA Pro?",
      "time": null
    },
    {
      "user": "Abigail",
      "text": "It's possibly called Exec in 6.8. I don't know - since I don't have IDA Pro.   Since you're a customer I would try their support if nobody else here can help.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "What you could do as a workaround for the missing time-support in Ida:\n\nIDC has an \"Exec\" command (as mentioned in a comment) allowing you to make arbitrary calls to the OS. This might help. In the \"Exec\" bracktes you enter a command in much the same way as typing it on the command line.\n\nThe following is an idc script file \n\n\n\n",
      "votes": "5",
      "user": "josh",
      "time": "Sep 14, 2018 at 19:38",
      "is_accepted": true,
      "comments": []
    }
  ]
}