{
  "title": "General unpacking of packed malware",
  "link": "https://reverseengineering.stackexchange.com/questions/19349/general-unpacking-of-packed-malware",
  "content": "I did a brief survey on malware unpacking and I found several theses on automated general unpacking:Eureka, PolyUnpack, omniUnpack, Malware Normalization.\n\nHowever, these theses are written years ago and I don't think these methods still work. A basic assumption of these methods is an unpacker routine restore whole protected code at a time. Thus, we can get original code dumping a certain memory region when an unpacker routine finishes its work.\n\nWhen it comes to more sophisticated packer (such as Maya's veil), it doesn't reveal whole protected code. As far as I know an attempt to attack this problem is to distinguish between code that performs unpacking routine and code does not and I think this is not really unpacking.\n\nOnly way to unpacking sophisticated packers is manually reversing it? \n\nThank you.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "430",
  "tags": [
    "malware",
    "unpacking"
  ],
  "user": "kensuke",
  "time": "Sep 15, 2018 at 15:56",
  "comments": [
    {
      "user": "mrexodia",
      "text": "Even though there is sophisticated malware out there, there is always unsophisticated malware for which those old techniques might still work.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You actually have more than one option in this case: \n\nHope it help :)\n\nD.L. \n\n",
      "votes": "2",
      "user": "Denis Laskov",
      "time": "Sep 15, 2018 at 16:05",
      "is_accepted": false,
      "comments": [
        {
          "user": "kensuke",
          "text": "Thank you for your reply. I know I can write an unpacker for a specific packer.",
          "time": null
        },
        {
          "user": "kensuke",
          "text": "I'm going to do further research to figure out a way to create generic unpacker",
          "time": null
        },
        {
          "user": "julian",
          "text": "@kensuke this may be helpful: reverseengineering.stackexchange.com/questions/72/…",
          "time": null
        }
      ]
    }
  ]
}