{
  "title": "Get function from memory address with radare2",
  "link": "https://reverseengineering.stackexchange.com/questions/19356/get-function-from-memory-address-with-radare2",
  "content": "Lets suppose I have a memory address. This address points to an instruction.\nThis instruction is inside a function.\n\nIs there a way to ask radare2 to search the beginning of this function, given the memory address of the instruction ?\n\n",
  "votes": "1",
  "answers": 2,
  "views": "6k",
  "tags": [
    "radare2"
  ],
  "user": "Bob5421",
  "time": "Sep 17, 2018 at 5:41",
  "comments": [],
  "answers_data": [
    {
      "content": "Yes, you can do it.\n\nIf you are seeked on a given memory address you can get the current function where you are with:\n\n```\nafi.\n\n```\nNow if you want to seek to the beginning of the function you can make it with:\n\n```\ns `afi.`\n\n```\nIf you just want to get the address of the beginning of the function but don't want to seek into it, just use the temporary modifier @:\n\n```\ns @ `afi.`\n\n```\nThis will return the memory address where the function is located.\n\nOf course you can get that information on any memory address without having to be seeked by using again the @ modifier.\n\n```\ns @ `afi. @ 0x????????`\n\n```\nWhere 0x???????? is any memory address you want to know where the function it is contained in begins. This approach can be pretty useful while scripting with r2pipe, for example.\n\nPS: backticks are used to get as input the output of command between them.\n\n",
      "votes": "2",
      "user": "arnaugamez",
      "time": "Sep 16, 2018 at 16:27",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "You need to go the address by using the s addr command but after that, you can just use a shorthand to going to the beginning of the function you are in. \n\nJust type: sf. to get to the beginning.\n\nJust refer to the help if needed:\n\n```\n> s?\nUsage: s    # Help for the seek commands. See ?$? to see all variables\n\n| s addr            Seek to address\n...\n| sf.               Seek to the beginning of current function\n...\n\n```\nYou can also combine the two commands with ;:\n\n```\ns 0x100001238; sf.\n\n```\n",
      "votes": "2",
      "user": "Paweł Łukasik",
      "time": "Sep 16, 2018 at 17:59",
      "is_accepted": false,
      "comments": []
    }
  ]
}