{
  "title": "What to do with .dd files? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/19496/what-to-do-with-dd-files",
  "content": "Okay so I am doing picoCTF and I am very new to ctf. Now in one of the questions I am given a .dd file and the hint says Some files have been deleted from the disk image, but are they really gone?\nI have no clue what to do with it. Any help on how to proceed. I mean what should I start with? what could be the way I can find a flag? how to open this .dd file?\n\n",
  "votes": "1",
  "answers": 3,
  "views": "5k",
  "tags": [
    "binary-analysis",
    "binary-diagnosis"
  ],
  "user": "mzfr",
  "time": "6 years ago",
  "comments": [
    {
      "user": "julian",
      "text": "What tools are you using to analyze the file? What have you tried up to this point?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "From my experience, file extensions are rarely meaningful.\nTo really understand what format you are playing with, I suggest you to try the linux file command on this file. It will (maybe) give you more insight on what you are working with.\n\nI never did picoCTF but I bet the .dd refers to a raw disk image.\n\nNow I have only a few experience in Forensics (yes I think it's more Forensics than Reverse Engineering per say), but I think you could try testdisk and/or PhotoRec (A tool that is shipped with testdisk). This software allows you to browse hard drive partitions and play a bit with it.\nNote that because it is a raw disk image, and if the partitions are not encrypted, using common/simple tools such as strings might reveal some interesting information.\n\nI hope this will be helpful.\n\n",
      "votes": "4",
      "user": "NirIzr",
      "time": "Oct 2, 2018 at 1:09",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "These are drive image files. You load them into a tool for forensic analysis like FTK Imager or EnCase in order to analyze the file system structure and recover some clues. If it's just the deleted file recovery that you need, use Testdisk / PhotoRec as said above.\n\n",
      "votes": "0",
      "user": "Anton Kukoba",
      "time": "Oct 1, 2018 at 14:48",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "It's hard to answer such a question without taking a look at the file itself, especially for extensions that don't have a clear and common use case; However, I would guess the extension is in reference to the dd unix command line utility that is used to read and write raw data from different sources and to different destinations. It's often how you'd take a dump of a block or a character device and save it as a file, for example.  \n\n",
      "votes": "0",
      "user": "NirIzr",
      "time": "Oct 2, 2018 at 1:12",
      "is_accepted": false,
      "comments": []
    }
  ]
}