{
  "title": "Extracting SquashFS based filesystem",
  "link": "https://reverseengineering.stackexchange.com/questions/19529/extracting-squashfs-based-filesystem",
  "content": "I'm trying to use binwalk to extract the firmware for the Ubiquiti Networks ER-X. Currently I've downloaded a copy of the firmware and uncompressed it. I opened the folder with the filesystem contents and found compat squashfs.tmp squashfs.tmp.md5 version.tmp vmlinux.tmp vmlinux.tmp.md5. I checked to see which file was the biggest and found squashfs.tmp to be the biggest at about 78MB in size. I ran binwalk with the -e flag but that didn't extract the filesystem. Link to the firmware.   \n\n",
  "votes": "1",
  "answers": 1,
  "views": "7k",
  "tags": [
    "mips",
    "binwalk"
  ],
  "user": "kkx07805",
  "time": "Oct 3, 2018 at 21:35",
  "comments": [],
  "answers_data": [
    {
      "content": "I was able to extract the file system just fine. I used Binwalk v2.1.2b and have sasquatch installed.\n\nExtracted file system:\n\n```\n_squashfs.tmp.extracted/squashfs-root $ ls\nbin  boot  config  dev  etc  home  lib  media  mnt  opt  proc  root  root.dev  run  sbin  selinux  srv  sys  tmp  usr  var\n\n```\nIt is indeed for a MIPS device:\n\n```\n$ file bin/bash\nbin/bash: ELF 32-bit LSB  executable, MIPS, MIPS-II version 1 (SYSV), dynamically linked (uses shared libs), for GNU/Linux 2.6.26, BuildID[sha1]=1b20797b11fa0a481a334f911ac5dfa27ce20c75, stripped\n\n```\nMake sure all of your tools are up to date and you have the necessary plugins installed. From the installation page:\n\n",
      "votes": "3",
      "user": "julian",
      "time": "Oct 3, 2018 at 23:31",
      "is_accepted": true,
      "comments": [
        {
          "user": "kkx07805",
          "text": "I am using MacOS but thanks for the response. The Binwalk version I'm running is v2.1.1. I ran \"brew upgrade binwalk\" and brew said that was the latest version.",
          "time": null
        },
        {
          "user": "julian",
          "text": "Do you have a tool that can extract SquashFS file systems? Such as unsquashfs  or sasquatch? binwalk uses sasquatch to extract SquashFS file systems, so unless you have that installed on your Mac you will need to extract it some other way. If you have access to a linux box (such as a VM), installation of everything you need is trivial, as the installation page indicates.",
          "time": null
        },
        {
          "user": "kkx07805",
          "text": "I wanted to just use the MacOS environment but I guess I will half to get a Docker container setup for running binwalk. It's a shame because I quite like homebrew.",
          "time": null
        }
      ]
    }
  ]
}