{
  "title": "Unable to install ltrace on Kali [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/19591/unable-to-install-ltrace-on-kali",
  "content": "I am kind of stuck with the installation of ltrace on my Kali VM.\n\nMy /etc/apt/sources.list file is updated with following entry:\n\ndeb http://http.kali.org/kali kali-rolling main non-free contrib\n\nI am trying to install ltrace via apt-get install ltrace.\nHowever, getting an error stating \nunable to locate package ltrace.\n\nCould anyone help me out here?\n\nEdit: It got resolved. Thank you all.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "3k",
  "tags": [
    "linux"
  ],
  "user": "Jiger Jain",
  "time": "6 years ago",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "Since this is not an RE question on its own, try asking on Superuser, Unix&Linux, or Security instead. Or just check Kali's own support resources.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "I'm voting to close this question as off-topic because it asks about problems with a particular - not easy to wield - Linux distro. Even on unix.SE such a question won't be well received, because of how many questions lack a basic understanding of Debian package management  in general and Kali-specifics.",
      "time": null
    },
    {
      "user": "dingo_kinznerhook",
      "text": "Ltrace is definitely there. See http.kali.org/pool/main/l/ltrace . When you say \"updated\", you mean you've run \"sudo apt-get update\" or the equivalent, right?",
      "time": null
    },
    {
      "user": "Jiger Jain",
      "text": "Hey, it got resolved. I was able to install ltrace. Thanks all.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@JigerJain: for most practical purposes you'll want apt-get dist-upgrade in place of apt-get upgrade. I know that the name of these commands is slightly misleading, so dist-upgrade will not upgrade from disto version x to x+1 or so. But the package selection criteria differ. However, once you know exactly what you're trying to achieve, you can mix and match these commands as needed.",
      "time": null
    }
  ],
  "answers_data": []
}