{
  "title": "SCSI interface through USB",
  "link": "https://reverseengineering.stackexchange.com/questions/19602/scsi-interface-through-usb",
  "content": "I'm trying to dump the storage of Xiaomi Home camera.\nIt comes with USB port, that if inserted while RESET is pressed is recognized in Linux as a SCSI device.\nI tried mounting the SCSI disc with no success, any idea what's this interface for and how can I dump it?\n\n```\n[dmesg log]\n[   63.698810] usb 1-10: new high-speed USB device number 7 using xhci_hcd\n[   63.846904] usb-storage 1-10:1.0: USB Mass Storage device detected\n[   63.847238] scsi host9: usb-storage 1-10:1.0\n[   64.852610] scsi 9:0:0:0: Direct-Access     Grain    GM8136           1.11 PQ: 0 ANSI: 2\n[   64.853053] sd 9:0:0:0: Attached scsi generic sg6 type 0\n[   64.853593] sd 9:0:0:0: [sdf] Attached SCSI removable disk\n\n$ lsscsi  -s\n[0:0:0:0]    disk    ATA      SanDisk SDSSDA24 70RL  /dev/sda \n[1:0:0:0]    disk    ATA      KINGSTON SV300S3 BBF0  /dev/sdb \n[2:0:0:0]    disk    ATA      ST2000DM006-2DM1 CC26  /dev/sdc \n[3:0:0:0]    disk    ATA      MAXTOR STM350063 E     /dev/sdd \n[5:0:0:0]    cd/dvd  ASUS     DRW-24D5MT       1.00  /dev/sr0 \n[8:0:0:0]    disk    Generic  STORAGE DEVICE   0828  /dev/sde \n[9:0:0:0]    disk    Grain    GM8136           1.11  /dev/sdf\n\n```\n",
  "votes": "9",
  "answers": 1,
  "views": "685",
  "tags": [
    "hardware"
  ],
  "user": "Mellowcandle",
  "time": "Oct 21, 2018 at 9:32",
  "comments": [
    {
      "user": "NirIzr",
      "text": "I assume you mean \"without success\" or \"with no success\" instead of \"with success\"?",
      "time": null
    },
    {
      "user": "gipi",
      "text": "I had a similar (but unsolved problem) but I think you could use a tool like sg_raw or write a program that sends SCSI commands over USB.",
      "time": null
    },
    {
      "user": "NirIzr",
      "text": "Did you try dding the devices?",
      "time": null
    },
    {
      "user": "dingo_kinznerhook",
      "text": "When you say, \"tried mounting the SCSI disc without success\" what do you mean? Which mount options did you try, and what error messages did you receive? Like Nirlzr said, if you can dd the disc and copy some of the first bits off of it you might be able to use binwalk or some other tool to find filesystem signatures that would tell you how to mount it properly.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "Have you considered that this is no disk at all, but an interface that piggybacks on existing SCSI tooling? For example I have seen plenty of USB devices identify themselves as HID even though they weren't really HID in the strict sense. Just because the USB HID support is very good and widespread and it's easy to build on it. Of course this may still be a disk, it's just a though. I also second the idea of reading the whole block device, if it presents itself as such and then using Binwalk or similar tools to make sense of that.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The term SCSI in the device description is a bit of a misnomer: it does not mean that it is a SCSI disk but just refers to the fact that  the USB Mass Storage device class  uses some of the SCSI protocol commands in its communications (similar to some ATA devices). Probably the most well known command is INQUIRY that is used to identify the device and its parameters. See an example here. \n\nI doubt you’ll be able to dump anything via USB, it is probably used to communicate with the host, possibly via some custom protocol. Try to find the manufacturer’s software that can talk to the device and RE it. Or just open it and look for some flash chip you can dump.  \n\n",
      "votes": "2",
      "user": "Igor Skochinsky",
      "time": "Oct 25, 2018 at 15:32",
      "is_accepted": false,
      "comments": [
        {
          "user": "fpmurphy",
          "text": "On this device, according to the schematics, the debug port is UART0",
          "time": null
        }
      ]
    }
  ]
}