{
  "title": "Need help to reverse engineer a dog collar transmitter",
  "link": "https://reverseengineering.stackexchange.com/questions/19671/need-help-to-reverse-engineer-a-dog-collar-transmitter",
  "content": "I have a Petrainer PET998DRU shock collar (similar to this one) that got partially chewed up by the dog it is supposed to train. I salvaged it to the point where I have the following buttons:\n\nThe display does not work so I don't know what the setting (which stim and how much) is on other than trial and error.\n\nI have followed the method on here: http://brettleaver.com/collar/ to get as far as I have gotten but the protocol differs on this model and I have only been able to figure out the device ID and the stim type (I think). I can replay the packets on a separate 433Mhz transmitter and the collar responds appropriately but I want to figure out the whole packet. The amount of stim is what I need helping decoding.\n\nLogic for beep\n\n\nI decoded this as 0xDF 7E DE ED 7F D6 AB\nIf this is wrong, then please let me know because it may give me a clue as to why I can't figure out the rest.\n\nLogic for zap\n\n\nI decoded this as 0x‭DF DE DE ED 6F 7A AA C0‬. The last bits to finish up the last octet are assumed to be logic 0's. Maybe this assumption is wrong though.\n\nI decoded the other packets similarly but I won't post all the images.\n\nEDIT: I have since gotten captures of vibrates and zaps where I know the duration is 0.\n\nAll the packets except the Light start out with 0XDF. The next position (7, F, D, or B) seems to determine stim type. The next 5 are always0xE DE ED so that seems to determine the device ID. All the characters after that are encoding the duration of the zap or buzz and then something to do with a checksum of some sort.\n\nHere is what I got for the buzz stim in sequential order. After recording each one, I incremented by one and then sent the command again:\n\nAn interesting thing I found is that one of the following patterns are always present but I can't figure out the significance:\n\nEDIT: Another interesting thing to note is that there is never 2 consecutive zeros. \n\nAssuming I haven't made a huge mistake from the beginning (this is my first attempt at reverse engineering something), does anyone see an obvious encoding scheme or checksum that is being used?\n\nMy end goal is to code up a new 433MHz transmitter and make it controllable with a yet to be made mobile app.\n\n",
  "votes": "9",
  "answers": 1,
  "views": "1k",
  "tags": [
    "encodings",
    "binary-diagnosis"
  ],
  "user": "dreed75",
  "time": "Oct 24, 2018 at 3:09",
  "comments": [
    {
      "user": "Biswapriyo",
      "text": "Hardware reverse engineering may help.",
      "time": null
    },
    {
      "user": "dreed75",
      "text": "Meaning, analyze the transmitter hardware and do a dump of its firmware?",
      "time": null
    },
    {
      "user": "user202729",
      "text": "This sounds like a lot of effort in comparison with buying a new one. :)",
      "time": null
    },
    {
      "user": "user202729",
      "text": "By the way, can you explain how the thing is supposed to work? Not everyone knows what a pet trainer is. (so there is a part that receives the signal, and another part which is like a remote controller, that has some buttons broken because of the dog, right?)",
      "time": null
    },
    {
      "user": "user202729",
      "text": "Also: What are you trying to do? (\"simulate\" broken buttons? If so which one?)",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Consider a \"gap\" to be a \"low\" interval between two consecutive \"high\" interval, ignoring the first longest one. Then, a bit 1 corresponds to a long gap, and a bit 0 corresponds to a short gap.\n\n\n\nTherefore, the messages decoded that way are:\n\n```\n88 14 4b 00 ee   : Light\n84 14 4b 00 de   : Beep\n81 14 4b 00 7e   : Zap\n82 14 4b 00 be   : Vibrate\n82 14 4b 01 be   : Buzz stim in sequential order\n82 14 4b 02 be\n82 14 4b 03 be\n82 14 4b 04 be\n82 14 4b 05 be\n82 14 4b 06 be\n82 14 4b 07 be\n82 14 4b 08 be\n\n```\nThat follows the exact same pattern as described at http://brettleaver.com/collar/, except that the remote UID is 14 4b instead of 20 89.\n\n(quoting the link above:\n\n)\n\nConsider the signal in binary:\n\n```\n\n1101111110111110110111101110110101111111101011010101010110000000\n1101111110111110110111101110110101111111011011010101010110000000\n1101111110111110110111101110110101111111010101101010101011000000\n1101111110111110110111101110110101111110111011010101010110000000\n1101111110111110110111101110110101111110110101101010101011000000\n1101111110111110110111101110110101111110101101101010101011000000\n1101111110111110110111101110110101111110101010110101010101100000\n1101111110111110110111101110110101111101111011010101010110000000\n\n```\nNote how the bold italic part appear in all of the sequences, and not in a fixed place? That leads me to suspect that the message has a variable length, and the trailing zeroes doesn't matter.\n\nThe common prefix of all the messages is 11011111101111101101111011101101011111. We will cut out this part, but leave a 1 in the message -- the reason will be apparent later.\n\nThe remaining part is:\n\n```\n11110\n11101\n111010\n11011\n110110\n110101\n1101010\n10111\n\n```\nNote that this is supposed to be (a part of) an increasing, consecutive number sequence.\n\nFrom OP's observation (there are no two consecutive zeroes), and note that there are 3 pairs in the data above where the latter one is the former one with a 0 appended, I guess that a 0 is encoded as a 10 and a 1 is encoded as a 1 (or vice versa).\n\nReplacing 10 with 1 gives:\n\n```\n1110\n1101\n1100\n1011\n1010\n1001\n1000\n0111\n\n```\nLooks good enough. This counts in decreasing order, so we have to negate the bits (0 is encoded as 1, 1 is encoded as 10).\n\nIt's obvious that the bits come in decreasing significance (most significant bit first). Because the value represented is from 1 to 100, the 3 previous bits are also a part of the value.\n\nI also suspect that\n\n\n\nis only a start-of-transmission mark and does not contribute to the data,  because it's larger than all the others.\n\n",
      "votes": "4",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": true,
      "comments": [
        {
          "user": "dreed75",
          "text": "Thanks for that. Do you really think they designed it that complex? Does this encoding somehow make it a more robust transmission? I'll code up a converter where I can give it an input of an actual number and it will output the above encoding. Then I'll try other numbers from 0-100 and see if the collar responds.",
          "time": null
        },
        {
          "user": "dreed75",
          "text": "Great clue user202729! I went ahead and decoded the entire bitstream following your example (1=0, 10=1) and also ignored that first bit. The values I got are exactly the same as the values at brettleaver.com/collar except my device ID is 14 4B. If you want to edit your answer to clear that up, I'll accept your answer. Any idea why they encoded it that way? Maybe it's just to make reverse engineering difficult :).",
          "time": null
        }
      ]
    }
  ]
}