{
  "title": "How to compile Hex-Rays decompiler generated code?",
  "link": "https://reverseengineering.stackexchange.com/questions/1967/how-to-compile-hex-rays-decompiler-generated-code",
  "content": "I need help to compile Pseudo-C code generated with IDA Pro and the Hex-Rays decompiler plugin. It shows an error on this line:\n\n```\nint (__thiscall *off_401F14)(void *, char); // weak\n\n```\nError:\n\n```\nerror C2143: syntax error : missing ')' before '*'\n\n```\nI don't see any error on that line. What's wrong?\n\n",
  "votes": "7",
  "answers": 1,
  "views": "5k",
  "tags": [
    "decompilation",
    "ida",
    "compilers"
  ],
  "user": "user1898",
  "time": "Apr 30, 2013 at 14:55",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "Which compiler (and version) are you trying this in? Please edit your question. Also, this looks off-topic as it concerns forward engineering - and yes, I realize that the tool used is mainly used in RCE.",
      "time": null
    },
    {
      "user": "Mellowcandle",
      "text": "@0xC0000022L I agree that the question lack vital information, However, I find this question related to the site. Decompiler are part of the RE process, and compiling the output is absolutly relevant to RE.",
      "time": null
    },
    {
      "user": "Willem Hengeveld",
      "text": "it will not solve your problem, of a missing call type, but you should include \"defs.h\"  ( found in the hexrays sdk )  in your file, it contains several macros used by hexrays.",
      "time": null
    },
    {
      "user": "Willem Hengeveld",
      "text": "o, and what is wrong,  is that '__thiscall'  is apparently not defined for your compiler, you should '#define __thiscall'   it to nothing to get rid of this specific error",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The following code compiles just fine for me as a .cpp file in Visual C++:\n\n```\nint (__thiscall *off_401F14)(void *, char); // weak\n\nint main(int argc, wchar_t* argv[])\n{\n    return 0;\n}\n\n```\nPerhaps you placed the function prototype inside of a function by accident or compiled it as C (file extension .c) file?\n\n",
      "votes": "6",
      "user": "0xC0000022L",
      "time": "Apr 30, 2013 at 14:17",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "you obviously made assumptions about the compiler, so you should add on which compiler (and version) this compiles just fine.",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "I didn't make assumptions about his compiler... \"error C2143: syntax error : missing ')' before '*'\" is a VC++ compiler error, and I tested my code above with VC++.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "it likely is, I agree. But which version? Also it depends (the __thiscall) whether you throw it into a .cpp or a .c file ;) ... you mention neither and neither does the OP. I find the question extremely badly worded.",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "Actually, you raise a very good point. It looks like it could be because the OP was using a .c file instead of a .cpp file.",
          "time": null
        }
      ]
    }
  ]
}