{
  "title": "Cannot load a Floppy Disk image with Bochs emulator",
  "link": "https://reverseengineering.stackexchange.com/questions/19805/cannot-load-a-floppy-disk-image-with-bochs-emulator",
  "content": "I have a floppy disk image which I am trying to load with Bochs Emulator.\n\nIt is from a CTF challenge and can be downloaded from here: http://squarectf.com/2017/floppy.img\n\nI am using Bochs version 2.3.9 on Windows 7 x64\n\nI started Bochs.exe and configured the memory and disk settings as shown below:\n\nMemory options:\n\n\n\nDisk and Boot options:\n\n\n\nHowever, when I start the emulator, it gives the following error:\n\n\n\nI have seen a writeup online for this CTF that describes the same method for loading the disk image and it worked.\n\nPlease let me know why it does not work for me.\n\nNote: I am able to load the disk image using qemu-system-x86_64 or qemu-system-i386 on Linux already. However, I want to understand why I cannot load it with Bochs.\n\nI even tried the method of creating a bochsrc file and loading it using bochsdbg.exe as shown below:\n\n```\nbochsdbg.exe -f bochsrc -q\n\n```\nHowever, I still get an error while loading it.\n\nUpdate: I am able to load the image in Bochs emulator by selecting floppy as the boot device under Boot options.\n\nHowever, I cannot load the image using bochsdbg.exe. Below is my bochsrc.txt file:\n\n```\nromimage: file=$BXSHARE/BIOS-bochs-latest\nvgaromimage: file=$BXSHARE/VGABIOS-lgpl-latest\nmegs: 16\nata0: enabled=1, ioaddr1=0x1f0, ioaddr2=0x3f0, irq=14\nata0-master: type=disk, path=\"floppy.img\", mode=flat, cylinders=2, heads=16, spt=63\nboot: floppy\n\n```\nAnd I get the following error message:\n\n```\nBochs is exiting with the following message:\n[      ] bochsrc.txt:5: ataX-master/slave: unknown type 'floppy'\n\n```\nThe reason I want to have a proper bochsrc file is because I want to use IDA Pro to debug the boot sector.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "2k",
  "tags": [
    "emulation"
  ],
  "user": "Neon Flash",
  "time": "Nov 3, 2018 at 13:34",
  "comments": [
    {
      "user": "0xec",
      "text": "Looks like its trying to boot from the Hard Drive. Check the boot options in bochs. This image.",
      "time": null
    },
    {
      "user": "Neon Flash",
      "text": "@0xec Thanks. I am able to load the image in Bochs emulator now. I selected floppy as the boot option. Now, I have another question. While I am able to get it working using the Bochs GUI, I still cannot get it to load properly using bochsdbg.exe. I have updated my question with my bochsrc file. Please have a look and let me know if it works for you.",
      "time": null
    },
    {
      "user": "0xec",
      "text": "Your bochsrc is incorrect. ata is for the hard disk. Should rather be floppya. Have a look here under Section 4.3.19. floppya/floppyb",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I fought a similar error for a while and figured I was naming the disk image as disk.img. When I renamed it to something else, it worked. In your example, you're naming it to floppy.img, so you could try something else.\n\nIt's a bit of a guess, but seems like bochs doesn't like files with reserved words, like disk or floppy.\n\n",
      "votes": "1",
      "user": "Viktor",
      "time": "Nov 29, 2022 at 7:16",
      "is_accepted": false,
      "comments": []
    }
  ]
}