{
  "title": "Find vtable without complete object locator",
  "link": "https://reverseengineering.stackexchange.com/questions/19825/find-vtable-without-complete-object-locator",
  "content": "I am learning to reverse Visual C++ objects.\n\nI usually find the vtable (or VMT of VFT, however you call it) of the object using a cross reference to its CompleteObjectLocator that I found in the disassembled binary before (using a cross reference to the object's TypeDescriptor or ClassHierarchyDescriptor). The pointer to CompleteObjectLocator is the -1st field of the vtable.\n\nHowever, as some classes are probably abstract in my program, they do not have CompleteObjectLocators. How do I find their vtables?\n\nI know that the program writes the pointer to the vtable down to this in the object's constructor, however in my program the constructors are inlined in the child class constructors and there I do not see work with memory that could be the vtable of the parent.\n\nFor example:\n\nI know I could find a vtable dynamically, because it would be the first element of this, but I do not know where (if anywhere) this of ClassB and ClassD is used. Can I find their vtables and constructors statically?\n\n",
  "votes": "3",
  "answers": 0,
  "views": "578",
  "tags": [
    "c++",
    "vtables",
    "virtual-functions"
  ],
  "user": "Topper Harley",
  "time": "Nov 5, 2018 at 14:51",
  "comments": [
    {
      "user": "Ian Cook",
      "text": "Don't forget that vtables might not exist for all classes as MSVC can be told not to produce a vtable by declaring a class with __declspec(notable)",
      "time": null
    },
    {
      "user": "Ian Cook",
      "text": "__declspec(novtable) that is",
      "time": null
    },
    {
      "user": "Topper Harley",
      "text": "@IanCook I see, thank you very much for the comment. Is it possible that this is not the case and the vtables exist somewhere even though I do not see them used in the constructors of the derived classes?",
      "time": null
    },
    {
      "user": "Biswapriyo",
      "text": "Add some C++ code for example to understand clearly.",
      "time": null
    }
  ],
  "answers_data": []
}