{
  "title": "API for LockState Wireless Internet Thermostat",
  "link": "https://reverseengineering.stackexchange.com/questions/1984/api-for-lockstate-wireless-internet-thermostat",
  "content": "I want to develop a web-based API in Rails for some LockState wifi programmable thermostats, so that other different application can control these thermostats. But I'm cannot find any resource about how these thermostats are accessible from the Internet and how to connect to these thermostats. Is there any documentation available? If not, how would I find how to interact with the thermostats?\n\n",
  "votes": "2",
  "answers": 2,
  "views": "431",
  "tags": [
    "interoperability",
    "api",
    "embedded"
  ],
  "user": "rony36",
  "time": "May 2, 2013 at 12:25",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "So you want to reverse engineer the API that is apparently used by some proprietary application? Do you have the proprietary application? Do you have one of the thermostats?",
      "time": null
    },
    {
      "user": "Till",
      "text": "Given that you could answer @0xC0000022L's question with a yes, the next step would be using a traffic sniffer (e.g. wireshark) or logging proxy (e.g. Charles) for gathering information on the control requests and their answers.",
      "time": null
    },
    {
      "user": "rony36",
      "text": "yes, I have one.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Okay, so far your question is a bit meager on the informational side, but it's intriguing. Let me start an attempt to answer it. I'll not be able to answer it, lacking the device in question.\n\nHere's what I would do.\n\nThe further down you were reading the more hurdles to take and the harder the approach. Now, perhaps you edit more details into your question if this partial answer gets you started.\n\n",
      "votes": "6",
      "user": "3 revs, 2 users 90%0xC0000022L",
      "time": "Apr 13, 2017 at 12:49",
      "is_accepted": false,
      "comments": [
        {
          "user": "Till",
          "text": "great answer - I would never have thought about possible SSH usage etc. not to mention on how to tackle that. Still my guess (and it really is just a guess!) is that the traffic/API will be plain HTTP based, JSON formatted REST stuff.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@Till: likely indeed. But without further input from the OP we won't be able to give anything but an outline of a generic approach as I did. Oh well :)",
          "time": null
        }
      ]
    },
    {
      "content": "This thermostat looks identical to the Radio Thermostat CT-50. That device has an open JSON API which you can read on their website.  http://radiothermostat.com\n\n",
      "votes": "2",
      "user": "Joe Zydeco",
      "time": "Jun 27, 2013 at 20:04",
      "is_accepted": false,
      "comments": [
        {
          "user": "asheeshr",
          "text": "Please add some of the relevant information into the answer itself. Link only posts are not considered answers.",
          "time": null
        }
      ]
    }
  ]
}