{
  "title": "Questions about enabling special pool on win32k",
  "link": "https://reverseengineering.stackexchange.com/questions/19904/questions-about-enabling-special-pool-on-win32k",
  "content": "So there is win32k.sys, win32kbase.sys, win32kfull.sys in Windows 10\n\nDoes verifier /driver win32k.sys /flags 0x1 enable special pool on all three drivers? (win32k.sys is kinda like stub to other drivers)\n\nBecause I have a crash that occurs only when enabling special pool specifically on win32kfull.sys by verifier /driver win32kfull.sys /flags 0x1. It doesn't crash when enabling special pool on win32k.sys or win32kbase.sys. Is this case weird?\n\nAlso, what would be the general setup regarding turning on the special pool when fuzzing win32k*.sys?\n\n",
  "votes": "3",
  "answers": 1,
  "views": "441",
  "tags": [
    "windows",
    "kernel",
    "fuzzing"
  ],
  "user": "Jaewon Min",
  "time": "Nov 20, 2018 at 2:14",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "I'd strongly suggest you head over to the ntdev mailing list (and forum) on the OSR website. Ask it there, higher chance of getting an answer and higher chance of getting it from someone working on a team that maintains these drivers. Of course you may want to cut down on the notion that you're fuzzing stuff ;)",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Just enable special pool on all 3 drivers:\n\n```\nverifier.exe /flags 0x1 /driver win32k.sys /driver win32kbase.sys /driver win32kfull.sys\n\n```\n",
      "votes": "-1",
      "user": "0xC0000022L",
      "time": "Nov 20, 2018 at 9:29",
      "is_accepted": true,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "Can you explain how this answers the question? After all the inquirer was asking whether enabling special pool on win32k.sys also affects the other two \"companion\" drivers. Admittedly this could be seen as addressing the secondary question crammed into the last paragraph by the inquirer.",
          "time": null
        },
        {
          "user": "Jaewon Min",
          "text": "Actually verifier.exe /flags 0x1 /driver win32k.sys win32kbase.sys win32kfull.sys works.",
          "time": null
        },
        {
          "user": "Jaewon Min",
          "text": "Well I guess this partially answers my question. The reason I asked is because I couldn't get all 3 drivers to have special pool turned on so was wondering whether turning it on win32k.sys will have similar affect. Now I got all 3 to have special pools turn on, but still the other question I must find out.",
          "time": null
        },
        {
          "user": "clang",
          "text": "verifier /driver win32k.sys /flags 0x1 will enable special pool only for memory allocated in win32k.sys code. It looks like your memory corruption is in a memory chunk allocated in win32kfull.sys, that's why enabling special pool on this driver alone leads to a crash, and enabling it on other drivers does not.",
          "time": null
        }
      ]
    }
  ]
}