{
  "title": "How to run ida in windows xp",
  "link": "https://reverseengineering.stackexchange.com/questions/19962/how-to-run-ida-in-windows-xp",
  "content": "I tried to install IDA 6.6 on Windows XP VM. After the installation I get that this is not a valid win 32 application.\n\nI search and found that IDA is not supported with Windows XP.\n\nHow can I run IDA debugger in Windows XP via remote debugger? What should I install in my Windows XP VM? So I can remote debugging my exe in my Windows XP VM from Windows 7 VM?\n\nFrom which version is IDA not supported by Windows XP?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "4k",
  "tags": [
    "ida",
    "windows",
    "debugging",
    "remote"
  ],
  "user": "Keystone",
  "time": "Nov 25, 2018 at 17:59",
  "comments": [
    {
      "user": "Biswapriyo",
      "text": "X64dbg is a good choice for debugging purpose.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "As far as I know, IDA 6.8 is the last version supporting Windows XP. So 6.6 should work, maybe the error is somewhere else, possibly you executed the 64bit binary?\n\nIf you don't stick to the IDA debugger but rather choose something like OllyDbg or WinDbg and examine the corresponding code sections in IDA on your host, you don't need that remote setup. \n\nStill of you want to do the remote setup, Hex-Rays provides a tutorial for that here. Maybe this will work for you.\n\n",
      "votes": "3",
      "user": "pudi",
      "time": "Nov 26, 2018 at 1:05",
      "is_accepted": false,
      "comments": [
        {
          "user": "Keystone",
          "text": "I love ida because I ger psudo code of assembly.   Why OllyDbg or WinDbg are better than IDA?",
          "time": null
        },
        {
          "user": "pudi",
          "text": "I didn't say they are better, but by using one of them, you would have the possibility to avoid your IDA installation problem.",
          "time": null
        },
        {
          "user": "Edw590",
          "text": "By the way, I can confirm this. I'm running IDA Pro 6.8 on XP from inside Oracle VM VirtualBox. Loads just fine. [From 7.0 onwards it doesn't work.] I guess I'll say to make sure you're running XP SP3 - I am here, and it works, so could be that. Another more probable reason that happened with me was that I had copied the IDA folder from the host to the VM without installing (and I didn't have Python installed either), and that happened. After installing, all is fine. So check if Python is being installed, for example. Else, no idea what could be. Actually installing it did it for me.",
          "time": null
        },
        {
          "user": "Edw590",
          "text": "Also, I can run the 64-bit EXE on 32-bit Windows XP (according to MS website to check if XP is 32 or 64-bit, I have 32-bit). No idea why, but I can. It loads just like the 32-bit EXE. I can even start the \"Local Win32 debugger\" from Debugging Tools 7.1.0 and start debugging idaq64.exe (either idaq64 or idaw64, doesn't matter, both run just fine). Either it's related to the VM, or I've no idea (my CPU is 64-bit, but supposedly that shouldn't matter). Just thought I'd say this.",
          "time": null
        }
      ]
    }
  ]
}