{
  "title": "IDA remote linux Debugger attach to a running process",
  "link": "https://reverseengineering.stackexchange.com/questions/19977/ida-remote-linux-debugger-attach-to-a-running-process",
  "content": "I usually use remote linux debugger as shown below:\n\n```\n./linux_server bin\n\n```\nAnd in IDA Pro, I select Remote Linux Debugger as the debugger and set the process options accordingly with the IP address and port of the Linux machine. The default port is 23946.\n\nThis works alright.\n\nHowever, if I already have a process running on the Linux Machine with PID: 400. How can I attach Remote Linux debugger to this already running process?\n\nI can see that linux_server provides only the following options:\n\n```\n$ ./linux_server --help\n  -i...  IP address to bind to (default to any)\n  -v     verbose\n  -p...  port number\n  -P...  password\n  -k     keep broken connections\n\n```\nThanks.\n\n",
  "votes": "0",
  "answers": 1,
  "views": "3k",
  "tags": [
    "ida",
    "debugging",
    "linux"
  ],
  "user": "Neon Flash",
  "time": "Nov 27, 2018 at 1:31",
  "comments": [],
  "answers_data": [
    {
      "content": "IDA allows remote process debugging as shown in the fourth page here \n\nNote that you need to run the server with sudo so it could attach to the remote process.\nAlso note that you need to have the executable (more precisely, the database) that you want to debug in IDA.\n\nYou can see what I did on the linux machine:\n\n\n\nI've compiled the code you can see in the background. It's an endless loop to simulate a running process that you want to debug.\n\nOn the connecting machine (Windows in my case):\nIn debugger -> process options you need to configure everything as you would normally do to a regular remote debugging. You said you already have this step completed so that's ok.\n\n\n\nAfter that, press debugger -> attach  to process and you'll be presented with a list of processes (for me it showed all of the running process, you might see only the processes that match the database, atleast that what I would expect). Select the process you want to debug:\n\n\n\nAfter a couple of single steps, I'm back to main and can debug the process:\n\n\n\n",
      "votes": "1",
      "user": null,
      "time": "Nov 27, 2018 at 23:01",
      "is_accepted": true,
      "comments": [
        {
          "user": "Neon Flash",
          "text": "Thanks. I had to run Linux remote debugging server as sudo for this to work properly.",
          "time": null
        }
      ]
    }
  ]
}