{
  "title": "SQL Server not downloading symbols from the symbol server, even though SymInitialize has the symserver in its path",
  "link": "https://reverseengineering.stackexchange.com/questions/2003/sql-server-not-downloading-symbols-from-the-symbol-server-even-though-syminitia",
  "content": "EDIT Clarified, I meant the extended exent ringbugger stacktraces described by Jonathan Kehayias.\n\nI recently discovered it was possible to get link.exe, dumpbin.exe, etc to download symbols from a symbol server. SQL Server has the ability to capture its own call traces through extended events. Traceflag 3656 lets you decode these stack traces with symbol files.  As per Paul Randal's blog, you need to actually put the symbol files in the sql server binn folder, and it wouldn't use the symbol server. I decided to investigate to see how true this is. Using RohitABs API Monitor, I was able to see the following calls being made to DbgHelp.dll:\n\n```\nImagehlpApiVersion (  )\nSymSetOptions ( SYMOPT_DEFERRED_LOADS | SYMOPT_LOAD_LINES | SYMOPT_UNDNAME )\nSymInitialize ( GetCurrentProcess(), \"C:\\Program Files\\Microsoft SQL Server\\MSSQL11.MSSQLSERVER2012\\MSSQL\\Binn\\;C:\\Program Files\\Microsoft SQL Server\\MSSQL11.MSSQLSERVER2012\\MSSQL\\BINN;symsrv*symsrv.dll*c:\\symbols*http://msdl.microsoft.com/download/symbols;C:\\Windows;C:\\Windows\\system32\", TRUE )\nSymRegisterCallback64 ( GetCurrentProcess(), 0x000007fec5a77810, 0 )\n    /* The following SymGetSymFromAddr() calls happen because fInvadeProcess  was set to true  */\nSymGetSymFromAddr ( GetCurrentProcess(), 3313710117, 0x000000001b06c060, 0x000000001b06b348 )\nSymGetSymFromAddr ( GetCurrentProcess(), 3313710116, 0x000000001b06c060, 0x000000001b06b348 )\n    . . . \n    . . . \n    . . . \nSymCleanup ( GetCurrentProcess() )\n\n```\nSo it looks like my _NT_SYMBOL_PATH, with the symbol server is being added to the search path of SymInitialize(). If that is the case, why aren't symbols being downloaded from the symbol server?\n\n",
  "votes": "5",
  "answers": 1,
  "views": "832",
  "tags": [
    "mssql",
    "debugging-symbols"
  ],
  "user": "Justin Dearing",
  "time": "May 23, 2017 at 12:37",
  "comments": [],
  "answers_data": [
    {
      "content": "I am a bit confused by the title of your question\n\nSQL Server or for that matter any other application apart from WinDbg or special symbol retrievers wont be able to download symbols from ms symbol servers\n\nDid you mean you used symchk on the sqlserver.exe as mentioned in the blog you linked \n\nA simple method to get symbols for any application is to\n\nonce the relevant .pdb files are available in cache symsrv.dll will use the cached symbol file and wont look for an active Internet connection\n\nRefrain from copying any .pdb files to any local folders \n\nJust use _NT_SYMBOL_PATH for all your symbol needs\n\n",
      "votes": "4",
      "user": "0xC0000022L",
      "time": "May 5, 2013 at 2:05",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "please use the formatting properly. Both your answers so far had horrible formatting issues in their original form.",
          "time": null
        },
        {
          "user": "Justin Dearing",
          "text": "Sorry, I meant to say the ringbuffer stack traces that extended events gives you access to.",
          "time": null
        },
        {
          "user": "blabb",
          "text": "@Justin Iam Not that familiar with SqlServer i read the post and i saw him mentioning that SqlServer.pdb needs to be in same directory as the sqlserver.exe any exe that shows call stacks should be having an option to set symbol path for example procmon from sysinternals will show either a raw stack with no symbols or if you fill the symbol path option it will show the stack trace with symbol resolved i think sqlserver might also have such an option",
          "time": null
        }
      ]
    }
  ]
}