{
  "title": "How are the segment registers (fs, gs, cs, ss, ds, es) used in Linux?",
  "link": "https://reverseengineering.stackexchange.com/questions/2006/how-are-the-segment-registers-fs-gs-cs-ss-ds-es-used-in-linux",
  "content": "I try to understand the process of memory segmentation for the i386 and amd64 architectures on Linux. It seems that this is heavily related to the segment registers %fs, %gs, %cs, %ss, %ds, %es. \n\nCan somebody explain how these registers are used, both, in user and kernel-land programs ?\n\n",
  "votes": "88",
  "answers": 3,
  "views": "134k",
  "tags": [
    "linux",
    "x86",
    "assembly",
    "amd64"
  ],
  "user": "perror",
  "time": "Jun 9, 2015 at 23:29",
  "comments": [
    {
      "user": "Mellowcandle",
      "text": "You need to be OS specific",
      "time": null
    },
    {
      "user": "perror",
      "text": "Yes, you are right. I edited to question to be Linux-specific.",
      "time": null
    },
    {
      "user": "Mellowcandle",
      "text": "I would like to suggest you read Assembly Langauge Step By Step - duntemann.com/assembly.html",
      "time": null
    },
    {
      "user": "viv",
      "text": "Google's Native Client technology uses segmentation to enforce sandboxing.You can check out the implementation to gain more insight.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Kernel perspective:\n\nI will try to answer from the kernel perspective, covering various OS's.\n\nMemory segmentation is the old way of accessing memory regions.\nAll major operating systems including OSX, Linux, (from version 0.1) and Windows (from NT) are now using paging which is a better way (IMHO) of accessing memory.\n\nIntel, has always introduced backward compatibility in its processors (except IA-64, and we saw how it failed...)\nSo, in its initial state (after reset) the processor starts in a mode called real mode, in this mode, segmentation is enabled by default to support legacy software.\nDuring the boot process of the operating system, the processor is changed into protected mode, and then in enabled paging.\n\nBefore paging, the segment registers were used like this\n\nLet's see some examples (286-386 era) :\n\nThe 286 architecture introduced 4 segments: CS (code segment) DS (data segment) SS (stack segment) ES (extra segment)\nthe 386 architecture introduced two new general segment registers FS, GS.\n\ntypical assembly opcode (in Intel syntax) would look like:\n\n```\nmov dx, 850h\nmov es, dx     ; Move 850h to es segment register\nmov es:cx, 15h ; Move 15 to es:cx\n\n```\nUsing paging (protected mode) the segment registers weren't used anymore for addressing memory locations.\n\nThe segments however still used to enforce hardware security in the GDT\n\nSo, in practice the segment registers in protected mode are used to store indexes to the GDT.\n\nSeveral operating systems such as Windows and Linux, use some of the segments for internal usage. for instance Windows x64 uses the GS register to access the TLS (thread local storage) and in Linux it's for accessing cpu specific memory.\n\nUser perspective:\n\nFrom the user perspective, in recent operating system that uses paging, the memory works in so called \"flat mode\".\nEvery process access its own memory (4GB) in linear fashion, so basically the segment registers are not needed.\n\nThey are still registers, so they can of course be used for various other assembly operations.\n\n",
      "votes": "69",
      "user": "phuclv",
      "time": "Apr 26, 2020 at 18:00",
      "is_accepted": true,
      "comments": [
        {
          "user": "Lorenzo Dematté",
          "text": "Nice answer, but I would add one bit of clarification wrt All major operating system ... use paging. I don't know about linux, but as you later pointed out in your answer, NT still use segments, for protection (on x86 at least). Privilege levels, or rings, are linked to segments. Hence the subdivision of the address space in (at least) four segments. The address space still look like 4gb flat, but the lower 2 (or 3) GB are one segment with ring 3 access, the upper 2(or 1) is a segment with ring 0 access.",
          "time": null
        },
        {
          "user": "Lorenzo Dematté",
          "text": "The other two segments are (short - 64kb long) regions at the low end and upper end of the user space (0-2GB); they help in catching null pointers and mark the \"finish of usable user space\".  Overall, this memory management technique is called \"Paged segmentation\", IIRC: there are segments (just a few) and each segment is paged.",
          "time": null
        },
        {
          "user": "Mellowcandle",
          "text": "@LorenzoDematté You're correct... feel free to edit my answer with your insight.",
          "time": null
        },
        {
          "user": "Lorenzo Dematté",
          "text": "Yes, that's why I think an edit is not necessary and a comment is sufficient :)",
          "time": null
        },
        {
          "user": "user2127",
          "text": "mov es, 850h; Move 850h to es segment registerThis instruction above does not exist. Because it is not possible to load a segment register with an immediate value. It is only possible to load a segment register with a content of an other non segment register, with the content of a ram location, or with popping a value from our stack mov es:cx, 15h ; Move 15 to es:cx This instruction above also does not exist. Because we can not use CX as an adress register, we can only use ECX as an adress register.",
          "time": null
        }
      ]
    },
    {
      "content": "FS points to the exception handling chain, CS and DS are filled from the OS with code and data segment. SS is the battery/stack segment. From what I remember, GS and ES are free.\nIt shouldn't matter much if kernel or user mode (they are used by some instructions like XLAT, MOVS, and some others, so you have to use them in the same way), but just in case I'm talking about programming in user space.\n\nI had not noticed before, but you're using the notation %fs, not FS, so probably you're meaning Linux, which is another story (also you could be more clear on protected/real mode). You can see also from other answers on stackexchange that linux apparently gives you, in FS and GS, 'thread local storage' and 'processor data area'. CS, DS, and SS should still be code/data/stack.\n\nFor the sake of the argument, I have no idea how on a Mac you use those registers.\n\nFor 64 bit it depends: if not in compatibility mode (where you can execute 64 and 32 bit code) then DS, ES, and SS are ignored, and instructions like POP SS give an error. There is no segmentation (the memory model is flat), there should be no real mode (but I think you only mean protected mode?), and if I'm not wrong there isn't hardware task switching.\nThere are further details on CS, FS, and GS (expecially the hidden part) in 64 bit mode, but since it's not used often maybe it's better to omit them.\n\nYou can check the manuals for the AMD family of processors especially in the case of 64 bit legacy mode:\nhttp://developer.amd.com/resources/documentation-articles/developer-guides-manuals/\n\n",
      "votes": "14",
      "user": "13 revs, 2 users 81%lunadir",
      "time": "Jan 2, 2014 at 22:09",
      "is_accepted": false,
      "comments": [
        {
          "user": "lunadir",
          "text": "it's weird not having 'enough reputation' for posting images...",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "it's new to me that the Itanium (IA-64) has segment registers. Can you explain?!",
          "time": null
        },
        {
          "user": "lunadir",
          "text": "well, yes, effectively there shouldn't be any, because there aren't segments... anyway in the transition from ia-32 to ia-64 programming the segment registers are mapped to application registers GR16-GR17 (or so it's written)",
          "time": null
        },
        {
          "user": "Mellowcandle",
          "text": "Linux never used segmentation, it was always used paging. regarding Windows, since NT, it also uses paging, so what you described here is not relevant anymore, unless you're doing DOS programming / reversing",
          "time": null
        },
        {
          "user": "L0j1k",
          "text": "I, for one, happen to be reversing a DOS binary, so finding this information was invaluable.",
          "time": null
        }
      ]
    },
    {
      "content": "i wrote a windows specific answer to a question that was marked as duplicate and closed and the close flag referred to this thread so i post an answer here \n\nos win7 sp1 32 bit machine\nkernel dump using livekd from sysinternals\n\na 16 bit segment register contains\n 13 bits of selector\n 1 bit of table descriptor\n 2 bits of requester_privilege_level  \n\n```\nSelector        tl  rpl \n0000000000000----0---00 \n\n```\nso cs and  fs converted to binary will be \n\n```\nkd> r cs;r fs\ncs=00000008  = 0b 00001 0 00\nfs=00000030  = 0b 00110 0 00\n\n```\n2 bits rpl means 0,1,2,3 rings  ( so 00 = 0 = ring zero)  \n\ngdt = 1 bit means 0,1     (0 is for GDT and 1 is for LDT)\n\nglobal descriptor table and local descriptor table \n\nthe high 13 bits represent segment selector\n\nso cs = 0x08 has a segment selector of 0b 001 = 0x1 ie gdtr@1\n&  fs = 0x30 has a segment selector 0f 0b 110 = 0x6 ie gdtr@6   \n\nthe kernel cs,fs are different from user cs,fs\n as can be noticed from dg command from windbg \n\n```\nkd> dg @cs  <<<<<<<--- kernel \n                                  P Si Gr Pr Lo\nSel    Base     Limit     Type    l ze an es ng Flags\n---- -------- -------- ---------- - -- -- -- -- --------\n0008 00000000 ffffffff Code RE Ac 0 Bg Pg P  Nl 00000c9b\n\n0:000> dg @cs <<<<<<<<----user \n                                  P Si Gr Pr Lo\nSel    Base     Limit     Type    l ze an es ng Flags\n---- -------- -------- ---------- - -- -- -- -- --------\n001B 00000000 ffffffff Code RE Ac 3 Bg Pg P  Nl 00000cfb\n\nkd> dg @fs <<<<<<<<------- kernel\n                                  P Si Gr Pr Lo\nSel    Base     Limit     Type    l ze an es ng Flags\n---- -------- -------- ---------- - -- -- -- -- --------\n0030 82f6dc00 00003748 Data RW Ac 0 Bg By P  Nl 00000493\n\n0:000> dg @fs\n                                  P Si Gr Pr Lo\nSel    Base     Limit     Type    l ze an es ng Flags\n---- -------- -------- ---------- - -- -- -- -- --------\n003B 7ffdf000 00000fff Data RW Ac 3 Bg By P  Nl 000004f3\n\n```\nyou can glean sufficient information about gdt from\nosdevwiki_gdt\nrobert-collins_ddj_article\n\nto do that manually im using livekd here\n\nusing windbg you can get the Descriptor and Task Gate Registers\n\n```\nkd> rM 100\ngdtr=80b95000   gdtl=03ff idtr=80b95400   idtl=07ff tr=0028  ldtr=0000\n\n```\neach gdtr entry is 64 bits so you can have 7f gdtr entries as you can see gdtl is 3ff 0x80*0x08-1 = 0x400-1 = 0x3ff (index starts from 0 not 1)\n\nso gdtr entry @1,@2 are @gdtr+(0x1*0x8) @gdtr+(0x2*0x08=0x10) and so on\n\n```\nkd> dq @gdtr+8 l1    gdtr@1 = gdtr+0n1*0x8 =0n8  = 0x8    \n80b95008  00cf9b00`0000ffff = gdtr+0n6*0x8 =0n48 = 0x30    \nkd> dq @gdtr+30 l1   \n80b95030  824093f6`dc003748   \nkd> dq @gdtr+38 l1   \n80b95038  7f40f3fd`e0000fff   \n\n```\nlets bit game the last two gdtr entries manually   \n\n```\n-------------------------------------------------------------------------------------------\ngdtrentry        [63:     [55:  [51:  [47:          [39:                  [15:             \n                  56]      52]   48]   40]           16]                    0]             \n                 base     gdrs  L     p d  t     Base     Base             Limit           \n                 Hi       rb0y  h     r l  y     Mid      Low                              \n-------------------------------------------------------------------------------------------\nbit position     66665555 5555  5544  4 44 44444 33333333 3322222222221111 1111110000000000\n                 32109876 5432  1098  7 65 43210 98765432 1098765432109876 5432109876543210\n-------------------------------------------------------------------------------------------\n824093f6dc003748 10000010 0100  0000  1 00 10011 11110110 1101110000000000 0011011101001000\nas hex           0x82     0100  0     1 0  0x13  0xF6     0xDC00           0x3748          \n--------------------------------------- ---------------------------------------------------\n7f40f3fde0000fff 01111111 0100  0000  1 11 10011 11111101 1110000000000000 0000111111111111\nas hex           0x7F     0100  0     1 3  0x13  0xFD     0xE000           0x0FFF          \n-------------------------------------------------------------------------------------------\n\n```\n",
      "votes": "8",
      "user": "blabb",
      "time": "Jun 13, 2017 at 19:13",
      "is_accepted": false,
      "comments": [
        {
          "user": "greenpiece",
          "text": "This answer was originally written for this question.",
          "time": null
        },
        {
          "user": "perror",
          "text": "@blabb: Strange! Why didn't you post your answer on the other question? This question is Linux-specific and your answer is Windows-specific. Somehow, your answer would much better fit to the other question. Don't you think ? (nice answer, though!)",
          "time": null
        },
        {
          "user": "perror",
          "text": "Ah, the other question has been closed!!! I vote for a reopen, then.",
          "time": null
        },
        {
          "user": "blabb",
          "text": "@perror yes tbe question was closed as duplicate and the comment referred to this thread so i had to post it here",
          "time": null
        }
      ]
    }
  ]
}