{
  "title": "Radare2 doesn't update current address, when single-step debugging using `ds`?",
  "link": "https://reverseengineering.stackexchange.com/questions/20114/radare2-doesnt-update-current-address-when-single-step-debugging-using-ds",
  "content": "I'm debugging an ELF binary on Linux using single-step (ds). The problem is that the current address at the prompt doesn't update after each step.\n\nThe prompt:\n\n\n\nHow do I make Radare2 update the prompt to reflect the current value of EIP?\n\nFurthermore, is it possible to make Radare2 automatically disassemble the next instruction after each ds, like it is possible with GDB?\n\n",
  "votes": "3",
  "answers": 2,
  "views": "506",
  "tags": [
    "debugging",
    "radare2"
  ],
  "user": "Shuzheng",
  "time": "Dec 11, 2018 at 7:46",
  "comments": [],
  "answers_data": [
    {
      "content": "Just use e cmd.prompt = sr PC for it. See question and issue for more details.\n\nNot automatic solution, but you can do pd1 each time you want to see the next instruction to perform.\n\nHowever, if you want it badly to be automatic, you can modify the source code to perform pd1 automatically for you. To do so, you want to modify libr/core/cmd_debug.c. Just find the place where ds is handled and put relevant code there like so:\n\n\nThen run make and enjoy the new functionality.\n\n\n",
      "votes": "2",
      "user": "bart1e",
      "time": "Jul 21, 2019 at 17:42",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "What you can do is to use pd with the temporary seek operator @ passing rip register so that pd will work from that address.\n\nSo instead of pd just use pd@rip and you should be fine with that.\n\n```\n[0x00000000]> pd\n    ;-- rsi:\n    0x00000000      ff             invalid\n    ...\n\n\n[0x00000000]> pd@rip\n    ;-- rip:\n    ┌─> 0x10000b3bf      4c892424       mov qword [rsp], r12\n    ╎   0x10000b3c3      4489ea         mov edx, r13d\n    ╎   0x10000b3c6      4c89f9         mov rcx, r15\n\n```\nAdditionally you can use the V!-mode (or any other graphical view mode for that matter) view for debugging. They get automatically updated after you step over your binary.\n\n",
      "votes": "0",
      "user": "Paweł Łukasik",
      "time": "Dec 11, 2018 at 7:13",
      "is_accepted": false,
      "comments": [
        {
          "user": "Shuzheng",
          "text": "Thank you - do you think it is a bug in Radare2? Or what's the reason for not updating the prompt address?",
          "time": null
        },
        {
          "user": "Paweł Łukasik",
          "text": "no. I think your seek position is just unrelated to the rip while debugging. You can imagine doing some stepping and investigating data at some other address. If you seek position changes every time you step it might be also frustrating.",
          "time": null
        },
        {
          "user": "Shuzheng",
          "text": "But sometimes the prompt address update, e.g. after pressing ds, say, 10 times?  Do you know if it is possible to make Radare2 update the prompt address after each ds? Also, do you know if it is possible to make Radare2 automatically disassembly the next instruction after each ds (GDB can do that)?",
          "time": null
        }
      ]
    }
  ]
}