{
  "title": "Can Machine Learning be used to develop better reverse engineering tools? [duplicate]",
  "link": "https://reverseengineering.stackexchange.com/questions/20217/can-machine-learning-be-used-to-develop-better-reverse-engineering-tools",
  "content": "So i googled this but other than some papers i couldnt find any reverse engineering tool that was built using machine learning\n\nI'm not an expert in machine learning and deep learning but it seems rational to think that considering we have billions of open source codes out there, we can use them so our \"machine\" can learn how the assembly and executable of these codes look like and just study on them, mastering the art of reversing, and therefore building a tool this way that can reverse any given program with a great accuracy \n\nNow is this doable or am i missing something here? is there any tool built this way or on its way to coming out? what are your thoughts on this? is better reversing tool even needed or is there  already a great reversing tool that can do the job with the best accuracy possible? \n\n",
  "votes": "3",
  "answers": 2,
  "views": "4k",
  "tags": [
    "disassembly",
    "tools",
    "disassemblers",
    "machine-code"
  ],
  "user": "John P",
  "time": "6 years ago",
  "comments": [
    {
      "user": "Oded Ben Dov",
      "text": "This article discusses this: researchgate.net/publication/…",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "If you consider genetic algorithms as a type of machine learning, here’s an interesting post on using it to create an assembler from opcodes and disassembler:\n\nA Fast Track To Assembler Writing\n\nYou can also check Joxean Koret’s experience on using ML to match binaries to source code, including with machine learning:\n\nhttps://docs.google.com/presentation/d/1ifvugStGL7Qc8xSFeYXp2MGQ6jQGOOMSolBrJy8kCMY/mobilepresent\n\nhttps://github.com/joxeankoret/pigaios\n\n",
      "votes": "3",
      "user": "Igor Skochinsky",
      "time": "Apr 10, 2019 at 14:17",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "This is a pipe dream for several reasons:\n\n\n1) C Decompilation: Is It Possible?\n\n2) Is Decompilation Possible?\n\n",
      "votes": "1",
      "user": "julian",
      "time": "Dec 30, 2018 at 2:19",
      "is_accepted": false,
      "comments": []
    }
  ]
}