{
  "title": ".fpk firmware unpacking",
  "link": "https://reverseengineering.stackexchange.com/questions/20232/fpk-firmware-unpacking",
  "content": "I am working on firmware update file prod-build-Isat2-V02.00.03-DFU.fp2.\nI extracted it and I've got some bin files. I analyzed these binary files with binwalk:\n\nbinwalk -E RDA-533.bin\n\nThe entropy of these bin files didn't give any information and when I opened these files with IDA, it didn't give subblocks and functions.\nIt seems these files are compressed or encrypted.\nHow can I analyze these bin files as efficiently as possible?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "513",
  "tags": [
    "unpacking",
    "firmware-analysis"
  ],
  "user": "h msvi",
  "time": "Jan 18, 2022 at 7:47",
  "comments": [],
  "answers_data": [
    {
      "content": "You can find files File1.bin ... File6.bin in \"C:\\temp\" directory after running IsatPhone 2 Firmware Upgrade Tool and selecting firmware. It does not need a connection to physical device, just firmware and tool.Unfortunately you can't decrypt these files in contrast to \"IsatPhone Pro\" model in which files were not encrypted. \n\n",
      "votes": "-1",
      "user": "Igor Matyuh",
      "time": "Mar 24, 2019 at 19:48",
      "is_accepted": false,
      "comments": [
        {
          "user": "h msvi",
          "text": "Thanks for your response, I statistically analyzed extracted files, what are your reasons that file is encrypted? Because of entropy of extracted file, Doesn't it compressed or encrypted?",
          "time": null
        },
        {
          "user": "Igor Matyuh",
          "text": "I can't share my report related to this research due to NDA. You can trust me or not, but I'm 100% sure this firmware is encrypted.",
          "time": null
        },
        {
          "user": "h msvi",
          "text": "Thanks for helpful answer, but I'm studying on working encryption methods of firmware updates generally. Would it be possible if  you give me a sample of firmware with specific encryption method for my work?",
          "time": null
        }
      ]
    }
  ]
}