{
  "title": "Reverse Engineering Grocery Software API",
  "link": "https://reverseengineering.stackexchange.com/questions/20313/reverse-engineering-grocery-software-api",
  "content": "So I have a peer to peer app that allows customers to request jobs at their own price and have the job fulfilled by a freelancer in the community. The common jobs requested as of recent are home improvement gigs and lawn care things. We plan on releasing a new feature that allows customers to request groceries through the app to be delivered to them as well. \n\nThe grocery company we are using has open source documentation for parts of their api, however some of the documentation is missing components we need to successfully integrate the feature into our app. So for the missing components I have reverse engineered some components of the software that aren't included within the public documentation and plan on integrating it into our app. I haven't fully finished the reverse engineering, as I am a quarter of the way done but: \n\nThanks in advance. \n\n",
  "votes": "0",
  "answers": 1,
  "views": "143",
  "tags": [
    "api",
    "law",
    "development"
  ],
  "user": "Solomon Antoine",
  "time": "Jan 9, 2019 at 10:40",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "Hi and welcome to RE.SE! Your question is very much going to elicit opinions. Also you should have separated the questions. Consider checking law for the first one (and possibly the second) of your questions. Keep in mind that any answer will be specific to the jurisdictions in which you act. Third one is pure guess work and not a good fit for Q&A. That said, for interoperability purposes RCE is often allowed.",
      "time": null
    },
    {
      "user": "user22970",
      "text": "note that if they didn't release a part as public, they might change it any time (if at all) without notifying you",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I (a random bloke on the internet) would do these:\n\nAs @Amirag mentioned the private API might be very unstable and if they break the compatibility your users will suffer blaming your app. And most likely leave a negative review and uninstall it.\n\n",
      "votes": "1",
      "user": "zxxc",
      "time": "Jan 9, 2019 at 14:15",
      "is_accepted": true,
      "comments": [
        {
          "user": "Solomon Antoine",
          "text": "Thank you. I will follow your instructions as my next steps.",
          "time": null
        }
      ]
    }
  ]
}