{
  "title": "MITRE MAEC (Malware Attribute Enumeration and Characterization) opinions and usage [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/2033/mitre-maec-malware-attribute-enumeration-and-characterization-opinions-and-usa",
  "content": "I was looking at some MITRE projects and was wondering what you thought about, and if anyone was using or contributing to, the MITRE Malware Attribute Enumeration and Characterization project: https://maec.mitre.org/.  Do you see the potential for widespread adoption?\n\nTo me, it looks interesting from the description:\n\nBut it also looks fairly complicated, which might limit widespread adoption.  \n\n",
  "votes": "2",
  "answers": 0,
  "views": "472",
  "tags": [
    "tools",
    "malware"
  ],
  "user": "Marc",
  "time": "11 years ago",
  "comments": [
    {
      "user": "cb88",
      "text": "\"Do you see the potential for widespread adoption?\" is the only question you have buried in there. It would probably be best if you thought more about the topic and asked more specific questions that are not as subjective. Keep in mind when writing questions that despite your interesting topic, opinion is not the goal of the site; answers are!",
      "time": null
    },
    {
      "user": "Marc",
      "text": "Thank you for the comment.  To clarify, I meant the 'question' to be mostly 'Is anyone using or contributing to, the MITRE Malware Attribute Enumeration and Characterization project?' It looks interesting to me, but I have gotten involved in other such projects that have gone nowhere due to lack of interest. My intent was to see the level of interest among malware analysts to help me determine if I should invest time and effort to understand, adopt, and possibly contribute to the project. While interesting, and on version 4, I have not heard of anyone actually using it.",
      "time": null
    },
    {
      "user": "asheeshr",
      "text": "Hi! Welcome to Reverse Engineering. RE Stack Exchange is suited towards more specific questions that may deal with issues you are facing while RE-ing. It is not suited to opinion based questions and answers. This site is different from a forum. See tour for more.",
      "time": null
    },
    {
      "user": "dingo_kinznerhook",
      "text": "Maybe a way to turn this into a question would be to ask \"What are some examples of real-life scenarios where using MAEC and its related projects are useful and make financial sense?\" I would certainly be interested in reading about those.",
      "time": null
    }
  ],
  "answers_data": []
}