{
  "title": "Academic journals for latest RE/Malware/Exploitation research?",
  "link": "https://reverseengineering.stackexchange.com/questions/20403/academic-journals-for-latest-re-malware-exploitation-research",
  "content": "I am looking for journals to keep track of the latest advances in reverse engineering, binary analysis, malware, binary exploitation, etc. \n\n",
  "votes": "10",
  "answers": 3,
  "views": "656",
  "tags": [
    "malware"
  ],
  "user": "Chase Kanipe",
  "time": "Jan 17, 2019 at 20:00",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "IMO if you want \"latest advances\", you have to go beyond academia and into the field.",
      "time": null
    },
    {
      "user": "joxeankoret",
      "text": "In my opinion, academia is years behind the industry.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "This is an indirect answer to your question, but hopefully still useful. There are multiple conferences that feature state-of-the-art work in this space. If anyone knows of more, feel free to add on to this list.\n\n(links are to the archives of the conferences, whenever possible)\n\nThere are of course the juggernauts: DEF CON (full media archive, YouTube playlists of talks) and Black Hat (site archive with slides + white papers, YouTube playlists of talks). Neither is exclusively focused on what you asked about, but they both have plenty of good content on these topics.\n\nBonus: PoC||GTFO is a completely different style of research than any conference listed above, but it's full of great information and is lots of fun to read.\n\nBonus 2: InfoCon is the best archive of hacking conference content that exists.\n\n",
      "votes": "9",
      "user": "hairlessbear",
      "time": "Nov 3, 2023 at 0:42",
      "is_accepted": false,
      "comments": [
        {
          "user": "perror",
          "text": "Ah! I thought it was only academic conferences!!! Sorry! Yes, Infiltrate, RECon and OffensiveCon are also well known! Good catch.",
          "time": null
        },
        {
          "user": "karsten",
          "text": "Thenk you for the nice list!",
          "time": null
        }
      ]
    },
    {
      "content": "You have a few academic workshops and conferences about the topic (or close to the topic). But, most of them are appearing and disappearing quite often unfortunately. So, it is difficult to come with a long lasting list of conferences. Anyway, here is an attempt:\n\nThese lists are definitely non-exhaustive, so feel free to tell me if I forget something!\n\n",
      "votes": "7",
      "user": "perror",
      "time": "Jan 17, 2019 at 19:58",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "There is also malware conference which has been running since at least 2011. \nhttps://www.malwareconference.org/ \n\n",
      "votes": "3",
      "user": "TJ Nel",
      "time": "Jan 18, 2019 at 5:51",
      "is_accepted": false,
      "comments": []
    }
  ]
}