{
  "title": "Is BinNavi available? If not, can I get the source from anywhere?",
  "link": "https://reverseengineering.stackexchange.com/questions/2058/is-binnavi-available-if-not-can-i-get-the-source-from-anywhere",
  "content": "BinNavi is originally a Zynamics product. But, since the company has been bought by Google, it seems to be difficult to get the library.\n\nI tried to look in the BinNavi manual in the installation chapter. But, I couldn't find any way to get the source code or a binary package.\n\nIs there any hope that the code or, at least, a binary form of BinNavi become available at some point ? \n\nAnd, about the BinNavi API, is it possible to use BinNavi with other languages than REIL or is BinNavi hard linked with it ?\n\n\n\n",
  "votes": "5",
  "answers": 4,
  "views": "2k",
  "tags": [
    "tools",
    "binary-analysis"
  ],
  "user": "perror",
  "time": "Mar 10, 2017 at 9:42",
  "comments": [],
  "answers_data": [
    {
      "content": "BinNavi was just released as open source today by Google, so you can get it for free.\n\nAbout using it with something else than REIL, if you're fearless, you can give a try to radare2, since it can translate its intermediary language ESIL, to REIL.\n\n",
      "votes": "5",
      "user": "jvoisin",
      "time": "Aug 21, 2015 at 18:27",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Go to http://www.zynamics.com/software.html and click Add zynamics BinNavi to cart. This allows you to buy it via Google Wallet.\n\n",
      "votes": "3",
      "user": "Jason Geffner",
      "time": "May 19, 2013 at 19:47",
      "is_accepted": false,
      "comments": [
        {
          "user": "perror",
          "text": "It seems to work, but before paying 400$, I would like to know if the graphical part can be plugged on something else than a REIL language as a model (I assume that we program our own plugin for this). Basically, I'm asking if the graphical part can be used totally interdependently from the analysis part.",
          "time": null
        }
      ]
    },
    {
      "content": "Tim Kornau here BinNavi developer. Yes the graphical part \"can\" be plugged on something else than REIL. The amount of work that is needed to do so should not be underestimated. \n\n",
      "votes": "3",
      "user": "opti",
      "time": "May 21, 2013 at 10:58",
      "is_accepted": false,
      "comments": [
        {
          "user": "cb88",
          "text": "would you consider providing a more complete answer to the question regarding availability and how to get the source/binary if that is possible?",
          "time": null
        },
        {
          "user": "opti",
          "text": "As stated above BinNavi is available in binary form from our website. Debuggers are shipped as source and as binary. The exporter is shipped in binary format. In regards to availability, it is available to the Americas | Europe | Japan ... I hope that clarifies this a little.",
          "time": null
        }
      ]
    },
    {
      "content": "You can also give PaiMei a look as I did understand it could do the same as BinNavi. But it is freeware and highly unsupported. :)\n\n",
      "votes": "1",
      "user": "perror",
      "time": "Oct 4, 2013 at 8:08",
      "is_accepted": false,
      "comments": []
    }
  ]
}