{
  "title": "Likely protocol determination by chip IDs and connections?",
  "link": "https://reverseengineering.stackexchange.com/questions/20665/likely-protocol-determination-by-chip-ids-and-connections",
  "content": "CONTEXT: My first post in this stack. Absolute beginner at RE. Also generally a beginner at anything electronics. Please be kind and correct me instead of ridiculing me.\n\nGOAL: Replace a damaged controller board within a light fixture with a DIY controller board that provides most of the functionality of the original controller. (ALL original functionality is not needed.)\n\nNOTES ABOUT GROUNDING: This light fixture is positive-grounded, all grounds are tied to actual earth as well as to the positive output of the PSU. The small board on the right in the picture is an infrared board, and it's LT1791LTS has RE connected to ground (chip pin 3 on datasheet). The LT1791LTS on the LED Driver board does NOT have RE grounded.\n\nWORK ALREADY DONE: I have searched extensively trying to gain more information about the device and it's component boards, but have not found any technical info on them. The manufacturer does not disclose this info (duh), and they don't repair any of it they just replace boards - which are not sold cheap. So I have bashed my noob head against google for a long time, found datasheets for the chips, tried to ID the eensy weensy components on the boards despite the inane lack of utility of their markings... (can tell things are resistors/capcitors/etc but cant figure out values from markings) I have used my Extech brand multimeter (model 22-816) to identify voltages on the wires, and to identify voltages where they go through the regulators - and to trace out the relevant bits' connections.(the only test equipment I own).\n\nTHOUGHTS: In looking at the datasheets for the chips, it SEEMS to this absolute noob that i'm looking at a RS485 setup wired in full duplex with the controller acting as a master and the LED driver and the IR board actng as slaves. BUT - I don't know anywhere near enough about this to make any claims that it is so, or even that I actually understand well what I just wrote. Also, I'm now aware that I'll need to \"sniff\" the communications, but do not yet know enough to proceed to a purchase of this kit. Will do so once I know enough to use it without screwing up the mismatch of positive ground vs negative ground (desktop vs. fixture grounding being opposite).\n\nQUESTION: From the information in the posted picture, can anyone here narrow down  the 'possibility list' for which means and methods are being used to communicate between the controller board (top left item) and the LED Driver board (lower left item)? Not just \"it is RS485\", but \"It's RS485 and it looks like it will probably use XXXXXX over that.\" \n\nIdeally, an explanation of what's happening here would be awesome but it is more important for me to just figure out how to talk to that LED Driver so ignore 'ideal' if need be. (Eg: why one chip on controller but a different chip on the two connected boards? Why would one connected board have RE grounded but the other doesn't? Etc)\n\nMore than happy to add images or info to this question as we go along - just tell me what's needed!\n\nDATASHEETS IN SAME ORDER AS THEY APPEAR TOP TO BOTTOM ON PICTURE:\n\nhttps://www.analog.com/media/en/technical-documentation/data-sheets/adm2582e_2587e.pdf\n\nhttp://www.farnell.com/datasheets/681099.pdf?_ga=2.26682873.518865155.1550566744-570871691.1522878168\n\nhttp://www.ti.com/lit/ds/symlink/sn65als180.pdf\n\nhttps://www.analog.com/media/en/technical-documentation/data-sheets/178591fd.pdf\n\nhttp://www.ti.com/lit/ds/symlink/iso7220a.pdf\n\nhttp://www.ti.com/lit/ds/symlink/tms320f2808.pdf\n\n\n\n",
  "votes": "1",
  "answers": 0,
  "views": "50",
  "tags": [
    "protocol",
    "communication"
  ],
  "user": "111936",
  "time": "Feb 24, 2019 at 20:48",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "get a scope/logic analyzer and try to capture some communication; you'll probably need it even of someone figures out the protocol used",
      "time": null
    },
    {
      "user": "111936",
      "text": "@IgorSkochinsky - The purpose of the post is to narrow down the possibilities for what it might be, hopefully to just one. The adapters/readers that I go out and purchase will depend on what is being sent on the wires - I don't want to buy a 'USB to XXX' adapter if I should use a \"USB to YYY\" adapter. So I'm asking if by looking at the info can it be determined?",
      "time": null
    }
  ],
  "answers_data": []
}