{
  "title": "Switching from seg to text in IDA-View",
  "link": "https://reverseengineering.stackexchange.com/questions/20677/switching-from-seg-to-text-in-ida-view",
  "content": "actually i don't know where the problem but i will describe it \nI am trying to analyse the firmware of a router and i could extract it and i got these files \nlibxmlapi.so\nlibhttpapi.so\nlibcfmapi.so\nlibmsgapi.so\nBut I can't read the file like this way in the IDA \nand here is how it does like in my computer \n\nThat's the link of the tutorial that i was following https://hg658c.wordpress.com/2017/12/04/decrypting-configuration-files-from-other-huawei-home-gateway-routers/\nBut when i view the file in IDA mode it shows like 1 letter in every line and there is nothing like urk so i can determine the string that i have to copy to continue the tutorial\nHere is the files so maybe someone want to take a look at them \nhttps://drive.google.com/open?id=1cU9qgAsKecfLNuM7RLrBoin5DHl2GsB1\nI tried 3 other firmwares and i couldn't find any thing useful in them ( one of them is tested by other one and he could do it right ) \n\n",
  "votes": "0",
  "answers": 1,
  "views": "450",
  "tags": [
    "assembly",
    "firmware"
  ],
  "user": "Moamen Mohamed",
  "time": "Feb 21, 2019 at 21:30",
  "comments": [
    {
      "user": "dingo_kinznerhook",
      "text": "Can you be more specific? Which file is the one that you are having trouble reading in IDA?",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "what is \"seg\" in the title and what kind of \"text\" you expect to see? is \"urk\" a typo?",
      "time": null
    },
    {
      "user": "Moamen Mohamed",
      "text": "actually i have a problem with all of them , when i open them they looks like this and every letter in 1 line and i can't read the functions and ( not like the tutorial or even like the screenshots that are in the tutorial )  this how they look  like prntscr.com/moc7q0",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "you should add this screenshot to the question so it's more understandable what you're talking about. also try to  fix the typos",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Welcome to RE.SE!\n\nCould you elaborate which version of IDA you are using?\n\nThe files you shared were ELF shared objectes based on the ARM architecture. Although ELF is a well defined executable format, its seems IDA tries to disassemble the file as RAW. This means it doesn't parse the file format and can not tell apart code from data.\n\nIf you are utilizing IDAs free version, this is most likely due to the problem that is does not include arm support.\n\n\n\nHowever, you could use other tools, such as objdump, radare2 or even online services like onlinedisassembler.com for free.\n\n",
      "votes": "1",
      "user": "Nordwald",
      "time": "Feb 22, 2019 at 5:57",
      "is_accepted": false,
      "comments": []
    }
  ]
}