{
  "title": "How do I set the return type for this type declaration?",
  "link": "https://reverseengineering.stackexchange.com/questions/20733/how-do-i-set-the-return-type-for-this-type-declaration",
  "content": "I have a function that seems to calculate the length of a string.\n\nI have made this type declaration and it does kind of work as IDA now flags the string correctly. \n\n__int64 __fastcall strlen(char strlen_string);\n\nNow, RAX seems to hold the length of the string. But doing strlen@<rax> tells me that 'location rax is not allowed here'. Also, I'd like to flag exactly where the length is being used.\n\nThis is what I have now:\n\n```\nmov     rdi, rcx ; strlen_string\ncall    strlen\nmov     [rbp+var001], rax  \n\n```\nand this is what I want to have with the new type declaration:\n\n```\nmov     rdi, rcx ; strlen_string\ncall    strlen\nmov     [rbp+var001], rax ; string_length\n\n```\nHow can I do that? Is it even possible? \n\n",
  "votes": "0",
  "answers": 1,
  "views": "790",
  "tags": [
    "ida"
  ],
  "user": "G. Ramistella",
  "time": "Feb 27, 2019 at 17:26",
  "comments": [
    {
      "user": "Johann Aydinbas",
      "text": "If I'm not mistaken you can only specify argument locations when you use __usercall, you can't combine custom locations with predefined calling conventions like __fastcall. I have also never seen IDA name return value locations so unless I've missed it the whole time, you'd probably need to write your own script for that.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Specifying argument locations syntax is only available in the specific __usercall pseudo calling convention, which IDA supports precisely for that use case, where no other calling convention fit.\n\nHowever, as mentioned in the comments, setting IDA's return value location has little impact, and it is impossible to have IDA automatically set a comment for the returned value (only arguments support that). You can, however, write a short IDAPython script for that.\n\n",
      "votes": "0",
      "user": "NirIzr",
      "time": "Feb 28, 2019 at 10:07",
      "is_accepted": true,
      "comments": []
    }
  ]
}