{
  "title": "What does Scylla/ImpRec are doing? How to reconstruct imports?",
  "link": "https://reverseengineering.stackexchange.com/questions/20743/what-does-scylla-imprec-are-doing-how-to-reconstruct-imports",
  "content": "Mostly in the tutorials they are telling to use this tool and that tool to magically apply something and make XY work & run. I would love to know how these things are working, how is import reconstruction done generally?\n\nFor example in my case I would need dump a malware from memory, where it's manual mapped, but these import reconstruction tools usually does not support such a thing, this is why I want to learn what it is at all. (I know that there are workarounds how to make them work, but I want to know the logic behind imp reccing)\n\nSo, back to the question. Are they analyzing the code itself for calls which are residing in external modules? Or are they using some other/existing/runtime table which usually unveil the original modules/procs.\n\nI couldn't find any good docs/description about it (except for whole the codebase of Scylla)\n\n",
  "votes": "2",
  "answers": 1,
  "views": "2k",
  "tags": [
    "import-reconstruction"
  ],
  "user": "Unc3nZureD",
  "time": "Feb 28, 2019 at 15:13",
  "comments": [
    {
      "user": "Johann Aydinbas",
      "text": "For manual mapped modules, oftentimes you only need to fix the file alignment and sections to properly load it into IDA with an intact import table, as long as you take the dump before the manual mapping code resolves the imports. Once it does, you'd need to repair it leading back to your question.",
      "time": null
    },
    {
      "user": "mrexodia",
      "text": "Scylla supports reconstruction of a memory mapped pe file.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Different import reconstruction tools employ different heuristics in order to find the method used by the malware/packer because manually implemented import tables can be achieved in multiple different approaches (some without holding import tables at all).\n\nMost import reconstruction tools usually have multiple heuristic choices, even. You can read about the different heuristics and their meaning in those tools' documentation and/or files. ImpRec's can be found with it as a text file while Scylla's can be interpreted from it's source code.\n\nNormally, an import reconstruction tool needs to gather two pieces of information for every imported function:\n\n",
      "votes": "3",
      "user": "NirIzr",
      "time": "Feb 28, 2019 at 16:56",
      "is_accepted": true,
      "comments": [
        {
          "user": "Unc3nZureD",
          "text": "Thanks for all the useful info and for pointing out that ImpRec has a real useful documentation :) I'll definitely check out the source of Scylla as well.",
          "time": null
        }
      ]
    }
  ]
}