{
  "title": "Can anyone make much sense of this binary for an embedded system? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/20820/can-anyone-make-much-sense-of-this-binary-for-an-embedded-system",
  "content": "I want to see if anyone more experienced in reverse engineering and disassembly can take a look at this binary update file I have and maby ether help or just say if it is even possible to reverse it. \nIn the long run I want to add a missing functionality to it to allow for an AV input\n\nThe system in question is a bmw head unit (MMI) that has a main processor: renesas SH3 SH7709A . A secondary 16 bit processor ST10F269-T3. A xilinx FPGA. A most bus controller and dual 32mb flash memory for storage S29JL032H.\n \n\nThe binary in question is a update file that has been converted from intelHEX to binary and then unpacked and can be found at this link: https://drive.google.com/file/d/1J6eLOfW17Sit-7-OnEUH_emWjf-3MIC7/view?usp=drivesdk\nIt does contain many debugging strings and so on at least. I have attempted some disassembly in IDA pro but would appreciate if someone else could take a look and maby see something obvious we have missed. \n\nMore documents, pictures, datacheets, dumps from a system with the same hardware that already has the functionality I want to add and so on can be found here: https://drive.google.com/folderview?id=1ue6Z0G95_-nF3svesaC4yThRse6rIdwk\n\n",
  "votes": "1",
  "answers": 0,
  "views": "305",
  "tags": [
    "ida",
    "disassembly",
    "binary-analysis",
    "embedded"
  ],
  "user": "Kasper Nordmark",
  "time": "6 years ago",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "Hi and welcome to RE.SE. You may want to look at firmware questions for related questions (and answers). A question like yours, however, is inherently unfair. For starters the Google Drive links are highly likely to go stale anytime. So visitors now will have no way to relate to the question or even answers implying knowledge of these files. Furthermore: Questions asking for help reverse-engineering a specific system are off-topic unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem. ... which, I think, applies here.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "That said, it sounds a bit like VxWorks. I've had this with the entertainment system of my car and the conventional tools don't help a lot for VxWorks images, it seems. However, once you know the name you can try a we search for hints on how to tackle the task (and maybe come back with a specific question).",
      "time": null
    },
    {
      "user": "Kasper Nordmark",
      "text": "I have kept the links the same for a long time and never plan to change them so that (a Google account I use for nothing else than charging these) everyone will be able to Access the project the foreseeable future since I found no way of uploading anything others than jpeg files I had to link them. Anyway I kind of understood that the question was to general and not specific enough for this forum but wort. It's just that any real documentation reversing software for a Renesas SH3 processor is lacking to say the least and very lacking for VxWorks as you say.",
      "time": null
    },
    {
      "user": "Kasper Nordmark",
      "text": "But I'll keep the question more general and at the same time more specific from now on unless you know where to post this type of question? I already have two threads dedicated to this over at bimmerfest vut will probably not receive this level of expertise there",
      "time": null
    }
  ],
  "answers_data": []
}