{
  "title": "Not able to find Hard coded strings in the mac executable file",
  "link": "https://reverseengineering.stackexchange.com/questions/20978/not-able-to-find-hard-coded-strings-in-the-mac-executable-file",
  "content": "I know that there is a string called \"Activate your subscription\" used in this particular app. But Im not able to find this string from its executable. I tried strings myapp and also searched for same string with Hopper disassembler but it both haven't found location of that string.\n\nSo my question what am I missing here and is this some kind of obfuscation used by these apps ? \n\nImage of a screen in this particular mac app where \"Activate your subscription\" string is used\n\n\n\nAfter Searching for \"Activate\" string in Hopper\n\n\n\n",
  "votes": "1",
  "answers": 1,
  "views": "568",
  "tags": [
    "patch-reversing",
    "strings",
    "hopper",
    "macos"
  ],
  "user": "Jaffer Sheriff",
  "time": "Mar 28, 2019 at 6:23",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "Check the resource files too",
      "time": null
    },
    {
      "user": "GuitarPicker",
      "text": "More here on what @Igor Skochinsky is referring to.  Also if it's a client/server type app, it could be getting messages from an external source over a network.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Some binaries hide the string on base64, with basic encryption algorithms rc4 or even with xor just for avoid what you are trying to achieve. Depending on the design of the owner of the binary you can find this types of techniques on them.\n\nFor example instead of do this\n\n```\nconst char *msg = \"Good morning\";\n\n```\nYou can do\n\n```\nconst char *msg = \"R29vZCBtb3JtaW5nCg==\"; /* base64 of 'Good morning' */\n\n```\nand on every use of msg you just call a base64 decode function and that's how works in a very basic environment. You can use RC4, Xor or any other encryption algorithm for hide the strings, but bear in mind that somebody with experience will find the way to decode the string\n\n```\nprintf(\"My message is %s  \n\", decode64(msg));\n\n```\n",
      "votes": "4",
      "user": "camp0",
      "time": "Mar 28, 2019 at 8:33",
      "is_accepted": true,
      "comments": [
        {
          "user": "Jaffer Sheriff",
          "text": "Could you explain it with some example Code. Because I can't completely understand you. I can understand encryption on string but input to this encryption algorithm must be \"Activate your subscription\" string and strings command must have found at least that occurrence of string. Instead it shows zero result for that string search.",
          "time": null
        },
        {
          "user": "Jaffer Sheriff",
          "text": "So in order to find string we have to search for various encrypted values of our desired string in the target executable ? Or is there any other tool available for this?",
          "time": null
        },
        {
          "user": "GuitarPicker",
          "text": "@JafferSheriff: You might want to check out this question for recommendations of tools.  Although the question is for Windows, at least one of the tools is also available for Mac.",
          "time": null
        },
        {
          "user": "Jaffer Sheriff",
          "text": "@GuitarPicker Thanks for your help and I really appreciate it .",
          "time": null
        }
      ]
    }
  ]
}