{
  "title": "View Array Type in dnSpy",
  "link": "https://reverseengineering.stackexchange.com/questions/21099/view-array-type-in-dnspy",
  "content": "I'm debugging a .NET application and see a declaration of a local array:\n\n```\n$ArrayType$$$BY05PAD $ArrayType$$$BY05PAD;\n\n```\nI break on an instruction that uses data inside that (char*) array:\n\n```\nnum9 = <Module>.strtoul(*(ref $ArrayType$$$BY05PAD + 4), null, 10);\n\n```\nBefore the call to strtoul, I want to show in a hex editor the contents of *(ref $ArrayType$$$BY05PAD + 4), but this is not a valid expression in the watch window and it doesn't appear as a local variable. How can I inspect raw field memory?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "binary-analysis",
    ".net"
  ],
  "user": "Jonas Mechtheim",
  "time": "Apr 9, 2019 at 16:36",
  "comments": [
    {
      "user": "Paweł Łukasik",
      "text": "what happens if you, in Locals window, right click on this array and select Show in Memory window -> Memory 1?",
      "time": null
    },
    {
      "user": "Jonas Mechtheim",
      "text": "Hi Paweł, unfortunately the array does not appear at all in the Locals window.",
      "time": null
    },
    {
      "user": "Paweł Łukasik",
      "text": "is it possible that you put this binary somewhere for me to check?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Those are identified as raw locals. You can enable their visibility by going to Options in Debug menu.\n\n\n\nAfter that you will be able to see those elements in the locals window.\n\n\n\nAnd from there you can right click on it and select Show in Memory Window -> Memory 1\n\n\n\nand analyze the data:\n\n\n\nBut that's not the end of our work. Those are just the pointers so our array contains such addresses (little-endian):\n\n```\n[0x610245D4,0x610245D7,0x610245DA,0x610245DD,0x610245E0]\n\n```\nSo if your example tries to access offset +4 it will get the second address and if we navigate there in the Memory window we will see the strings there that will be passed to strtoul method\n\n\n\n",
      "votes": "0",
      "user": "Paweł Łukasik",
      "time": "Apr 11, 2019 at 18:54",
      "is_accepted": true,
      "comments": [
        {
          "user": "Jonas Mechtheim",
          "text": "Thank you SO MUCH, this is exactly what I was looking for!",
          "time": null
        }
      ]
    }
  ]
}