{
  "title": "IDA remote debugging - non printable characters in parameters",
  "link": "https://reverseengineering.stackexchange.com/questions/21227/ida-remote-debugging-non-printable-characters-in-parameters",
  "content": "I am trying to remote debug a certain binary which gets user-specified command line arguments, which can be non-printable of course.\nMy goal is the ability to debug with IDA the process with the command line argument \"\\x11\\x22\\x33\\x44\" which can be done with gdb easily.\nThe problem is that the \"Parameters\" field in IDA allows only ASCII characters to be inserted into the process' command line arguments\n\n\n\nI looked thoroughly and found these questions but running:\n\n```\n$ ./linux_server unlink < file\n\n```\nor any other combination does not seem to feed the binary file with my input.\nAlso, running StartDebugger in the IDA command line did not help (How does this function know which remote debugger to run?)\n\n",
  "votes": "2",
  "answers": 1,
  "views": "422",
  "tags": [
    "ida",
    "linux",
    "remote"
  ],
  "user": "toothpick",
  "time": "Apr 26, 2019 at 23:32",
  "comments": [
    {
      "user": "Neon Flash",
      "text": "A quick workaround for this issue would be for you to start the binary on the terminal with those command line arguments (or feed the input through a file.). After that attach the remote debugger to the process. You would need to patch the entry point so that the execution can be resumed after attaching the debugger. You could use: \\xeb\\xfe and patch the bytes at entry point after attaching the debugger.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can work around this by using the IDA API. There is a function set_process_options that takes the process arguments as one of the parameters.\n\nBecause it sets all process options you have to pass various null arguments (which don't modify the existing value).\n\n```\nimport ida_dbg\nida_dbg.set_process_options(None, \"\\x11\\x22\\x33\\x44\", None, None, None, 0)\n\n```\n",
      "votes": "0",
      "user": "Florian Magin",
      "time": "Oct 3, 2023 at 15:11",
      "is_accepted": false,
      "comments": []
    }
  ]
}