{
  "title": "Detecting cracked Themida packed malware",
  "link": "https://reverseengineering.stackexchange.com/questions/21265/detecting-cracked-themida-packed-malware",
  "content": "I'm working in a large SOC and my manager has tasked me with finding some way to provide coverage for Themida packed malware samples.\n\nAs alluring as it is to suggest just blacklisting all Themida packed software and calling it a day, I would like to do my due diligence before I take that approach.\n\nI noticed that Themida claims to digitally watermark their executables to protect against piracy, and copies of the software are available for torrent on many pirate sites. I was wondering whether the software left the watermark on the packed executables, and whether the pirated software leaves a watermark on the packed binaries that could be signed against. \n\nI know that this is a thing based off of the answer to this post: How common are virtualized packers in the wild?, but the person who answered provided sources for all of his other claims besides this one.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "3k",
  "tags": [
    "malware",
    "security",
    "yara"
  ],
  "user": "solumnant",
  "time": "May 2, 2019 at 17:32",
  "comments": [],
  "answers_data": [
    {
      "content": "From Oreans KB:\n\nSo supposedly the legit binaries should have a valid tag signed with a non-blacklisted certificate. See the links for more details. There is some code on Github too. \n\nEDIT apparently the taggant servers were shut down in 2018 so probably this can't be used for real-time checks anymore but maybe you can still detect bad files if tags are added by the leaked versions...\n\n",
      "votes": "2",
      "user": "Igor Skochinsky",
      "time": "May 2, 2019 at 19:12",
      "is_accepted": true,
      "comments": [
        {
          "user": "solumnant",
          "text": "Taggants are dead to to lack of industry uptake, the IEEE page describing taggants has had the details section scrubbed: vmpsoft.com/20180505/… standards.ieee.org/industry-connections/icsg/amss.html",
          "time": null
        },
        {
          "user": "solumnant",
          "text": "I think the best way to go would be to just block Themida packed PE files, taggents are only present if they are enabled by the packer at packing time and the packer is connected to the internet. I don't believe that the environment around taggents was ever mature enough to be supported by any library.",
          "time": null
        }
      ]
    }
  ]
}