{
  "title": "Call Stack vs Intermodular Calls in Ollydbg",
  "link": "https://reverseengineering.stackexchange.com/questions/21360/call-stack-vs-intermodular-calls-in-ollydbg",
  "content": "What is the difference between call stack and intermodular calls. Could you clarify the difference between the two? For example if I need to catch message box API function, do these methods serve the same purpose?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "2k",
  "tags": [
    "debugging",
    "ollydbg"
  ],
  "user": "Kıvanç Cantimur",
  "time": "May 24, 2019 at 6:30",
  "comments": [],
  "answers_data": [
    {
      "content": "They are completely different things.\n\nCall stack window shows such information as stack frame for each function call in the current thread, including arguments passed, name of callee and the (virtual) address where it was called from.\n\nIntermodular calls window, on the other hand, shows all calls to the external (API) functions in the current module.\n\nThat being said, if you want to find message box function, you can do it by opening Intermodular calls window, clicking Destination button (that will sort functions by name) and you may set breakpoints on each place this function is called, like presented in the image below:\n\nOf course pick your desired function name instead of atoi.\n\n",
      "votes": "0",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": true,
      "comments": [
        {
          "user": "Kıvanç Cantimur",
          "text": "What if Intermodular calls window shows less functions. I attached the application and press Run. The Destination section shows almost nothing (nothing helpful)",
          "time": null
        },
        {
          "user": "bart1e",
          "text": "Check if you are in the right module when right clicking->Intermodular calls, i.e. in the module you want to get calls from.",
          "time": null
        },
        {
          "user": "Kıvanç Cantimur",
          "text": "Can I use the Names window to find the message box function as well?",
          "time": null
        },
        {
          "user": "bart1e",
          "text": "I think that you should be able to find it this way.",
          "time": null
        }
      ]
    }
  ]
}