{
  "title": "What does this function actually do?",
  "link": "https://reverseengineering.stackexchange.com/questions/21363/what-does-this-function-actually-do",
  "content": "I'm taking part in this reverse engineering lab at college and we have this final big homework project. I have a part of the binary that changes it's own asm code by iterating through it's own bytes and add-ing or maybe xor-ing and then rewriting them back to memory. \n\nI'm stuck at this function that I managed to decompile using x64dbg to the following (variable naming changed by me)\n\n```\nuint8_t fun_401c05(uint8_t argument) {\n    uint8_t counter;\n\n    counter = 0;\n    if (argument) {\n        do {\n            counter = (uint8_t)(counter + 1);\n            argument = (uint8_t)(argument & (uint8_t)(argument - 1));\n        } while (argument);\n    }\n    return counter;\n}\n\n```\nI'm trying to understand what exactly this function does. I know the function is called 3 times, each time with a letter from my input file. Each of the results is then processed using xor and some sar instruction (it's my first time seeing it) to calculate an int key that grants access to the next part of the challenge and I need to understand what the function does in order to give it the right input. I can see what it does but can't really get the meaning of it just yet..\n\nEDIT: I know the name of the question is bad but I have no idea what other generic name to give it. If someone can help I'll be very grateful \n\n",
  "votes": "0",
  "answers": 1,
  "views": "144",
  "tags": [
    "binary-analysis",
    "x64dbg"
  ],
  "user": "Daniel Bejan",
  "time": "May 26, 2019 at 8:27",
  "comments": [],
  "answers_data": [
    {
      "content": "It counts the number of 1's in argument's binary representation (see link).\n\nBasically, each n & (n - 1) cancels out the least significant 1 in n's binary representation, preserving all more significant digits.\n\n",
      "votes": "3",
      "user": "bart1e",
      "time": "May 26, 2019 at 10:28",
      "is_accepted": true,
      "comments": [
        {
          "user": "Daniel Bejan",
          "text": "Yes, that's right.. I was able to derive my key using your tip. Thanks!",
          "time": null
        }
      ]
    }
  ]
}