{
  "title": "Automatically detecting and carving images from .doc, .docx and spreadsheets",
  "link": "https://reverseengineering.stackexchange.com/questions/21419/automatically-detecting-and-carving-images-from-doc-docx-and-spreadsheets",
  "content": "I'm looking for a tool that can extract detect and extract any image format from word documents in both .doc and .docx formats for an automatic document classification use case. It is nice to just detect the presence of images, but it infinitely more valuable to automatically carve the images out of the file through detecting the magic bytes and carving based on the file header.\n\nI'm looking for something like oletools, but that toolkit doesn't support gathering images. \n\nIf there aren't any tools or libraries that satisfy my use case, then any libraries or tools that could support my own development of such a tool would be appreciated. Even research papers or articles on the theory behind such a tool, or even the doc/docx file format would be appreciated.\n\nI would prefer python based tools, but I'll take what I can get. To be clear, I want a command line based tool, or a tool that can be added to a program or a script.\n\n",
  "votes": "0",
  "answers": 1,
  "views": "345",
  "tags": [
    "tools",
    "file-format",
    "static-analysis",
    "automation",
    "magic-number"
  ],
  "user": "solumnant",
  "time": "Jun 4, 2019 at 19:57",
  "comments": [
    {
      "user": "user202729",
      "text": "linux - extracting text from MS word files in python - Stack Overflow -- some tools for extracting text from old .doc format is mentioned, one of them may work.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "If I understand you correctly then for what you want to achieve you dont need any tools as word files are just archives. You can use your favourite unzip program and then you can find images in \\word\\media folder.\n\nI dont know python but should be simple to unzip files and search for image files.\n\n",
      "votes": "1",
      "user": "Rok Tavčar",
      "time": "Jun 5, 2019 at 7:08",
      "is_accepted": false,
      "comments": [
        {
          "user": "solumnant",
          "text": "While that is true for modern files, it is not the case in legacy .doc files (that are ole files or Microsoft Compound files if you go by what Detect It Easy says). When I open this file type as an archive, it still works, but the image(s) are stored in the \"Data\" stream, with the header for the first picture stored ~ byte 240. I would need to carve the header out, read it, and appropriately carve the image out of the file based on the information in the header. If there's a tool for carving images out of data streams then that would work for me. I guess I have two different questions...",
          "time": null
        }
      ]
    }
  ]
}