{
  "title": "Is there a way to export all the strings for a certain module in x64dbg?",
  "link": "https://reverseengineering.stackexchange.com/questions/21418/is-there-a-way-to-export-all-the-strings-for-a-certain-module-in-x64dbg",
  "content": "I have an encrypted file that I was able to step through the code until that specific DLL file was decrypted in memory and I was able to list all of its strings. It has a ton of them that I would like to export all of them to a text file or even a CSV file if possible but I can't find any way to do so. \n\nAm I missing a command or a button somewhere or is this something I would need to try and write a script to accomplish?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "943",
  "tags": [
    "x64dbg",
    "strings"
  ],
  "user": "Hey101",
  "time": "Jun 4, 2019 at 19:41",
  "comments": [
    {
      "user": "bart1e",
      "text": "In which window do you have the strings listed?",
      "time": null
    },
    {
      "user": "Hey101",
      "text": "It is under references",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You may try right click->Copy->Full Table to copy it to clipboard.\n\nIf you want to copy only strings without Disassembly and Address columns, right click at the upper bar of this window (where you see Strings, Disassembly and Address), select columns to hide and click the Hide button as illustrated below.\n\n\n\nEdit: this will copy the entire table too, so if you want to have only strings saved in a file, you need to delete the two remaining columns.\n\nYou may for instance use Notepad++ for this purpose: navigate to the last line, select everything in this line, except the string, press Alt+Shift+PageUp and keep it pressed until you reach the top of file and while you are there, press Delete.\n\nIf your file is so big that the above way to delete these columns is impractcical, you may use regular expressions instead.\n\n",
      "votes": "0",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": true,
      "comments": [
        {
          "user": "Hey101",
          "text": "I knew I was missing something... Thank you so much! I am braindead after staring at x64dbg for like 12h straight lol.",
          "time": null
        }
      ]
    }
  ]
}