{
  "title": "Disassembling ARM binary",
  "link": "https://reverseengineering.stackexchange.com/questions/21436/disassembling-arm-binary",
  "content": "I am trying to disassemble a firmware binary which I am interested in. Yet I don't have much experience in this field, which is why I would like some input from you guys.\n\nMy current state is that I was able to obtain the *.bin file of the firmware and analyze it using binwalk. The standard analysis did not find anything, but trying the --opcodes option revealed some further information.\n\nAccording to the opcodes it seems to contain a mix of different instruction sets using ARM, Ubicom32 and ARMEB instructions. Therefore, there is probably no file system to recover, but if I understand it right I may be able to disassemble the binary using something like objdump?\n\n```\nDECIMAL       HEXADECIMAL     DESCRIPTION\n-----------------------------------------------------------------------\n1406157       0x1574CD        ARM instructions, function prologue\n12575041      0xBFE141        ARM instructions, function prologue\n14942348      0xE4008C        ARM instructions, function prologue\n16502970      0xFBD0BA        Ubicom32 instructions, function epilogue\n28109096      0x1ACE928       ARM instructions, function prologue\n29833956      0x1C73AE4       ARMEB instructions, function prologue\n39390093      0x2590B8D       ARMEB instructions, function prologue\n\n```\n",
  "votes": "0",
  "answers": 0,
  "views": "2k",
  "tags": [
    "disassembly",
    "arm",
    "firmware-analysis"
  ],
  "user": "openloop",
  "time": "Jun 7, 2019 at 12:29",
  "comments": [
    {
      "user": "perror",
      "text": "Install the multiarch version of the binutils package and you will get objdump to work for ARM binaries as well.",
      "time": null
    },
    {
      "user": "openloop",
      "text": "I tried disassembling it but it seems like the opcodes were false positives. The entropy of the binary is near 1 throughout the whole file. So I am not sure if there is more to uncover here, since there is no real structure in the bytes.",
      "time": null
    },
    {
      "user": "perror",
      "text": "So, this was probably a false positive. If the data are random enough, you may end up with some data which looks similar to any asm at some point. Unfortunately, it may happen!",
      "time": null
    }
  ],
  "answers_data": []
}