{
  "title": "ASCII strings not showing up in CPU in OllyDbg, but rather in dump",
  "link": "https://reverseengineering.stackexchange.com/questions/21465/ascii-strings-not-showing-up-in-cpu-in-ollydbg-but-rather-in-dump",
  "content": "I'm pretty much new to the Reverse Engineering and assembly language. I've watched some videos about OllyDbg and cracking serial numbers in programs and I got interested in them and I want to learn more about assembly. Therefore I created a little console program myself in C# to practice:\n\n```\nusing System;\nnamespace ConsoleApp3\n{\n    class Program\n    {\n        static void Main(string[] args)\n        {\n            Console.Write(\"Please enter the code: \");\n            string code = \"af2152ats7u35e\";\n            string input = Console.ReadLine();\n            if (input == code)\n                Console.WriteLine(\"The code is correct!\");\n            else\n                Console.WriteLine(\"You failed, try again...\");\n            Console.ReadLine();\n        }\n    }\n}\n\n```\nOf course I can find the string in a text document, but the point was to actually use OllyDbg to jump over the checking part and right away give the \"code is correct\", just to practice the reverse engineering.\nAt first I thought it's gonna be easy and I'm gonna manipulate the program in different ways, but it turns out the strings are not shown as ASCII in the CPU view:\n\n\nBecause I thought it's gonna be shown as in this video: https://youtu.be/uydMlQlEiyc?t=39\n\nSo instead I can only find them in the dump view:\n\n\nIt makes it harder to actually find it in the CPU view and I can't find how to work with this on the internet or how to change it so it will be like in the video?\n\nHow do I continue from here and how can I find the dump text reference in the code?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "640",
  "tags": [
    "windows",
    "assembly",
    "debugging",
    "c#"
  ],
  "user": "Jefferson",
  "time": "Jun 19, 2019 at 10:55",
  "comments": [
    {
      "user": "ismael_akez",
      "text": "If you are trying to debug a C# program(.NET) which is not an x86 or x64, use DNSpy, or else, code it in C++ or assembly to debug it in OllyDbg.",
      "time": null
    },
    {
      "user": "ismael_akez",
      "text": "Don't forget to mark an answer as correct.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "OllyDbg actually shows these strings, but you weren't looking at the right function. The image you posted shows RaiseException function from KERNELBASE instead of the main function.\n\n\n\nHowever, as you see from assembly instructions, they are written in CIL and OllyDbg works only for x86 architecture, so when you try to set a breakpoint and run this application in it, you will get an exception and will be unable to continue to the code above.\n\nAs @ismael_akez suggested, you may either try some different tool, or just rewrite your program in C++ and you should able to debug your program in Olly.\n\nNote: these are Unicode, not ASCII strings.\n\n",
      "votes": "0",
      "user": "bart1e",
      "time": "Jun 19, 2019 at 13:22",
      "is_accepted": true,
      "comments": []
    }
  ]
}