{
  "title": "What is an entropy graph",
  "link": "https://reverseengineering.stackexchange.com/questions/21555/what-is-an-entropy-graph",
  "content": "I am new to reversing and I see a tool Detect It Easy and it has a feature called Entropy. I want to know what it is used for?\n\n",
  "votes": "5",
  "answers": 5,
  "views": "13k",
  "tags": [
    "entropy"
  ],
  "user": "Suman Mandal",
  "time": "Jun 27, 2019 at 11:56",
  "comments": [],
  "answers_data": [
    {
      "content": "For our purposes, entropy can be though of as information density or as a measure of randomness in information, which is what makes it useful in the context of reverse engineering and binary analysis.\n\nCompressed and encrypted data have higher entropy than e.g. code or text data. In fact, compressed and encrypted data have close to the maximum possible level of entropy, which can be used as a heuristic to identify it as such in order to differentiate it from non-compressed/non-encrypted data.\n\nExample use cases in reverse engineering:\n\nBesides \"Detect It Easy\", tools such as binwalk, ent and binvis.io can assist with calculating file entropy. You can also build your own tools that do this. \n\n",
      "votes": "3",
      "user": "julian",
      "time": "Jun 27, 2019 at 14:10",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Entropy is interpreted as the Degree of Disorder or Randomness \n\na high entropy means a highly disordered set of data\n\na low entropy means an ordered set of data \n\nto address the comments\norder here does not mean 'a' following 'a' kind of order  it is to be interpreted as random / non random state of certain data  \n\naaaabbbbccccdddd  or \"abcdabcdabcdabcd\" or \"adbcadbcadbcadbc\" is a repetitive string whose entropy will be greater than\naaaaaaaabbbbcccd  or any shuffled representation of this string      \n\nin the first string and its shuffled clones all have 4 chars with equal probability 4/16 or 1/4 or 25%\nbut in the second string char 'a'  (8/16 ) or half of the data set has the highest probability\nwhile 'c' (1/16) has the least or a very minuscule probability       \n\nentropy is a thermodynamic concept that was introduced to digital science (information theory) \nas a means to calculate how random a set of data is \n\nsimply put the highest compressed data will have the highest entropy \n\nwhere all the 255 possible bytes will have equal frequencies \n\nie if 0x00 was seen 10 times in a blob \n0x10 or 0x80 or 0xff will all be seen 10 times in the same blob\n\nthat is the blob will be a repeated sequence comprising of all bytes between of 0x0..0xff\n\nwhile a low entropy blob will have a repeated sequence comprising only of a certain byte like  0x00  0r  0x55  or two bytes 0x0d0a  ox222e etc or any series one less than 255  possible byte sequences\n\ntaking an algo from here and modifying it a little \n\n```\nimport math\nfrom collections import Counter\nbase = {\n    'shannon' : 2.,\n    'natural' : math.exp(1),\n    'hartley' : 10.,\n    'somrand'   : 256.\n    }\ndef eta(data, unit):\n    if len(data) <= 1:\n        return 0\n    counts = Counter()\n    for d in data:\n        counts[d] += 1\n        ent = 0\n        probs = [float(c) / len(data) for c in counts.values()]\n        for p in probs:\n            if p > 0.:\n                ent -= p * math.log(p, base[unit])\n    return ent\nhes = \"abcde\\x80\\x90\\xff\\xfe\\xde\"\nles = \"aaaaa\\x61\\x61\\x61\\x61\\x61\"\nprint (\"=======================================================================================================\")\nprint (\" type      ent for hes                 hes                      ent for les            les\")\nprint (\"=======================================================================================================\")\nfor i in base:\n    for j in range(1,4,1):\n        print (i ,' ', eta( j*hes,i) , '\\t', (hes*j + (30 -j *10) *\" \" ) , ' ' , eta (j*les , i) ,'\\t',  (\"%s\" % les*j )) \n\n```\nyou can see  'abcde\\x80.....' is high entropy while 'aaaaa\\x61...' is low entropy \n\n```\n:\\>python foo.py\n=======================================================================================================\n type      ent for hes                 hes               ent for les            les\n=======================================================================================================\nshannon   3.321928094887362      abcdeÿþÞ                   0.0    aaaaaaaaaa\nshannon   3.321928094887362      abcdeÿþÞabcdeÿþÞ           0.0    aaaaaaaaaaaaaaaaaaaa\nshannon   3.321928094887362      abcdeÿþÞabcdeÿþÞabcdeÿþÞ   0.0    aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa\nnatural   2.3025850929940455     abcdeÿþÞ                   0.0    aaaaaaaaaa\nnatural   2.3025850929940455     abcdeÿþÞabcdeÿþÞ           0.0    aaaaaaaaaaaaaaaaaaaa\nnatural   2.3025850929940455     abcdeÿþÞabcdeÿþÞabcdeÿþÞ   0.0    aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa\nhartley   0.9999999999999998     abcdeÿþÞ                   0.0    aaaaaaaaaa\nhartley   0.9999999999999998     abcdeÿþÞabcdeÿþÞ           0.0    aaaaaaaaaaaaaaaaaaaa\nhartley   0.9999999999999998     abcdeÿþÞabcdeÿþÞabcdeÿþÞ   0.0    aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa\nsomrand   0.4152410118609203     abcdeÿþÞ                   0.0    aaaaaaaaaa\nsomrand   0.4152410118609203     abcdeÿþÞabcdeÿþÞ           0.0    aaaaaaaaaaaaaaaaaaaa\nsomrand   0.4152410118609203     abcdeÿþÞabcdeÿþÞabcdeÿþÞ   0.0    aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa\n\n```\n",
      "votes": "5",
      "user": "blabb",
      "time": "Jun 27, 2019 at 17:59",
      "is_accepted": false,
      "comments": [
        {
          "user": "julian",
          "text": "\"a high entropy means a highly disordered set of data  a low entropy means an ordered set of data\" <- This is a false statement. Order is not relevant, because entropy is calculated over a distribution where each value in that distribution has a probability associated with it. Compressed and encrypted data have high entropy because the probability associated with each byte value in the distribution is roughly equal (the distribution of byte values in the data is close to uniform), not because of the order the byte values appear in the bytestream.",
          "time": null
        },
        {
          "user": "julian",
          "text": "\"where all the 255 possible bytes will have equal frequencies\" <- You probably meant \"where all byte values between 0 and 255 (256 total) have an equal probability in the overall distribution\" (the frequency of each byte value between 0-255 is the same in the distribution).",
          "time": null
        },
        {
          "user": "blabb",
          "text": "@julian what do you mean by order ? like a follows a b => b kind of order ?  order in my answer does not mean a sorted / sequential / non sequential data  i meant it as in an orderly / non random state the most random repetitive  data where the count of each value tends to be equal has the highest entropy   it may be a (military type ordered / sorted set like aaaabbbbccccdddd  4[a,b,c,d]  but this will tend to have an entropy greater than aaaaaaaabbbbbccd   8[a],4[b],2[c],1[d]  here  is a theory link using hard technical words en.wikipedia.org/wiki/Entropy_(information_theory)",
          "time": null
        },
        {
          "user": "julian",
          "text": "You said “ordered set”, so maybe I misunderstood your meaning. Anyway, your main point about the relationship between entropy and randomness is correct.",
          "time": null
        },
        {
          "user": "perror",
          "text": "@julian: What are you saying ??? I do think that blabb is correct. You seems to be stuck on only one definition of entropy, but they are two... which are both perfectly valid. So, stop yelling at everyone please.",
          "time": null
        }
      ]
    },
    {
      "content": "Just to add (small) piece of information to @blabb and @Johann Aydinbas answers, here is the cite from Practical Malware Analysis book regarding your question:\n\nYou can find additional information here, under Increased entropy header.\n\n",
      "votes": "4",
      "user": "bart1e",
      "time": "Jun 27, 2019 at 8:30",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Shannon's entropy comes from information theory. It is the measure of degree of randomness of text. If a string has greater Shannon's entropy it means it's a strong password. Principally, Shannon entropy equation provides a way to predict the average minimum number of bits required to encode a string of symbols, based on the frequency of the symbols. \n\n\n\nNote that the base represents the number of possible characters. Base 2 can be replaced by any base. As can be seen in this code where it's replaced by 255.\n\nThis link has a simplest implementation of the algorithm for calculating entropy of novels and religious books. It tells us a lot. For example, that all the human generated books have nearly identical degree of fluctuation between disorder. It is a good feature of data.\nThis is the link to code mentioned above.\nInformation Entropy of different Books\n\n",
      "votes": "3",
      "user": "Holomorphic Guy",
      "time": "Jun 27, 2019 at 14:09",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "First, you have to know that the term entropy is used to refer to two different concepts which are somehow related if you think twice, but as it is really not obvious at first sight, you should prefer to consider these two as different concepts.\n\nThe entropy that you want to know about can be defined as the amount of order, disorder, or chaos in a thermodynamic system.\n\nOn the other hand, the other entropy is coming from information theory and can be seen as a measure of the amount of information that can be stored in a system.\n\nAn entropy graph (to evaluate the amount of disorder) can be useful to detect the parts of the file that get close to random data. It will allow to detect the parts that have been encrypted/compressed and the parts that appear to be left untouched.\n\nIndeed, a high disorder in data is exactly what you want to achieve when encrypting data. And, I told you that the two entropy definitions were related, if you store a lot of information in a minimum of bytes, it appears to be with a high level of disorder, so is compression...\n\nThat is why we use entropy graphs of files, be able to distinguish raw parts from encrypted/compressed sub-parts without any prior information of the file format.\n\nFor example, here is an entropy graph from the tool binwalk coming from another question from here:\n\n\n\nDirectly from this graph we can see that there is a first part that appear to be raw (probably asm opcodes if we look at the shape of the curve), then a part which is much likely encrypted (compression does not reach an entropy of 1 with such regularity usually), and finally padding with always the same byte (e.g. 0x00 or 0xff).\n\n",
      "votes": "0",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": false,
      "comments": [
        {
          "user": "julian",
          "text": "\"The entropy that you want to know about can be defined as the amount of order, disorder, or chaos in a thermodynamic system.\" <- This is a false statement. Software is not a thermodynamic system and does not possesses the property \"energy\" (heat). Software consists of encoded information, therefore to measure its properties - such as its Shannon entropy - the tools provided by information theory are appropriate.",
          "time": null
        },
        {
          "user": "julian",
          "text": "If you don't believe me, please examine the code that was used to generate the entropy plot in your post. Binwalk calculates information entropy level in terms of either zlib compression ratio or Shannon entropy.",
          "time": null
        },
        {
          "user": "julian",
          "text": "\"Your definition of entropy is perfectly valid if you are considering information theory. But, unfortunately, the entropy referred here is much likely the one coming from thermodynamics (i.e. the degree of disorder).\" <- The meaning seems quite clear.",
          "time": null
        },
        {
          "user": "julian",
          "text": "it’s nothing personal. It’s just not correct.",
          "time": null
        },
        {
          "user": "perror",
          "text": "It looks personal, just by the way you are harassing me with that.",
          "time": null
        }
      ]
    }
  ]
}