{
  "title": "Why won't IDA let me name this variable?",
  "link": "https://reverseengineering.stackexchange.com/questions/21674/why-wont-ida-let-me-name-this-variable",
  "content": "I went to stack view and named it counter, and now it appears at the top of my function, although it didn't until I named it. \n\n\nThe name didn't propagate over to the program, as you can see in the mov instruction in this block.\n\n\n\n",
  "votes": "0",
  "answers": 1,
  "views": "292",
  "tags": [
    "ida"
  ],
  "user": "gerbik",
  "time": "Jul 14, 2019 at 20:11",
  "comments": [
    {
      "user": "Avery3R",
      "text": "IDA doesn't look like it's resolving stack variable references. Try to right click on one of the [esp+XXh] operands and see if you can select variable",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "First of all, [esp+5Ch] is not the value of counter. The numbers next to the names of variables / arguments on stack are offsets with respect to ebp. \n\nSo [ebp-5Ch] is the value of the variable counter.\n\nAnd since the variables are accessed via esp, not rbp and there is stack aligning instruction (and esp, FFFFFFF0), I guess IDA is not sure if that instruction will change esp or not, so it won't rename [esp + offset] to an argument or variable, since esp could have different values modulo 16 (i.e. and esp, FFFFFFF0 will not change esp if esp = 11111110, but will change it when esp = 11111118) and thus different values with respect to ebp.\n\n",
      "votes": "0",
      "user": "bart1e",
      "time": "Jul 14, 2019 at 20:44",
      "is_accepted": true,
      "comments": [
        {
          "user": "eyal karni",
          "text": "Never seen stack alignment instruction before. Is it common?",
          "time": null
        },
        {
          "user": "bart1e",
          "text": "It will be called almost in every main function while compiling with GCC. See reverseengineering.stackexchange.com/questions/21414/…",
          "time": null
        },
        {
          "user": "eyal karni",
          "text": "Yeh I do reversing on Windows. Thanks, though",
          "time": null
        }
      ]
    }
  ]
}