{
  "title": "Save Ghidra's control flow graph into a parsable format",
  "link": "https://reverseengineering.stackexchange.com/questions/21693/save-ghidras-control-flow-graph-into-a-parsable-format",
  "content": "I'm working on reverse engineering a firmware which I was able to get its functions control flow graphs to display successfully on Ghidra. I am trying to see if there is a way to save those control flow graphs as a text file or something parse able so that I can write a parser for it and use it in my program (I want to recreate the graph programmatically to train my program to detect certain functions). Thank you!\n\n",
  "votes": "3",
  "answers": 2,
  "views": "2k",
  "tags": [
    "ghidra",
    "control-flow-graph"
  ],
  "user": "Sparval",
  "time": "Jul 16, 2019 at 19:52",
  "comments": [],
  "answers_data": [
    {
      "content": "You can do this using [headless analyser] (https://ghidra.re/ghidra_docs/analyzeHeadlessREADME.html#recursive) script.\n\nCheck out it's usage here. You can find this file in ghidhra/support directory.\n\nThe ghidra api is available here. You can use this api to write custom scripts, either in java or python 2.7.\n\nThen you can do:\n\n```\n./analyzeHeadless /projectloacation projectname -import /binary_location -postscript /yourscript-location -deleteproject\n\n```\nTo run your analysis. This command runs your script on binary by creating a new project and then deleting it later (-deleteproject flag, which is optional).\n\nYou can find a lot of examples in their github repository. e.g. script.\n\nAs you said in your question, if you want to work with functions, you can:\n\n```\nfunctions = currentProgram.getFunctionManager().getFunctions(True)\n\n```\nget the list of functions (in python, changed the syntax if you are using java).\n\n",
      "votes": "2",
      "user": "R4444",
      "time": "Jul 17, 2019 at 5:06",
      "is_accepted": false,
      "comments": [
        {
          "user": "Sparval",
          "text": "If I may ask, how do you import the API into eclipse or a development environment of the sort?",
          "time": null
        },
        {
          "user": "R4444",
          "text": "I am not sure about eclipse, because I used python. My take on this is - read the api, write a code in java, and then use the above command to run the code.",
          "time": null
        },
        {
          "user": "R4444",
          "text": "here is an example \"hello world\" script that you can run - github.com/DiegoMagdaIeno/Ghidra-Launcher/blob/…",
          "time": null
        }
      ]
    },
    {
      "content": "After a few days of trial and error I figured out something called GhidraDev which is an add-on to eclipse, through it you can create your own Ghidra projects and use the API with ease. Instructions on how to install it into eclipse can be found in ghidra_9.0.4 -> Extensions -> Eclipse -> GhidraDev -> GhidraDev_README.html.\n\nGhidra can be downloaded here: https://ghidra-sre.org/\n\n",
      "votes": "1",
      "user": "Sparval",
      "time": "Jul 23, 2019 at 19:07",
      "is_accepted": true,
      "comments": []
    }
  ]
}