{
  "title": "Find the call function of a string",
  "link": "https://reverseengineering.stackexchange.com/questions/21712/find-the-call-function-of-a-string",
  "content": "On a 16bit real mode x86 program I can locate a string that is displayed on screen. How do I go about finding all the places this string is called from to trace back the \"print\" function?\n\n",
  "votes": "-1",
  "answers": 1,
  "views": "474",
  "tags": [
    "x86"
  ],
  "user": "uMinded",
  "time": "Jul 19, 2019 at 18:10",
  "comments": [
    {
      "user": "bart1e",
      "text": "Have you tried pressing x in IDA when this string is selected?",
      "time": null
    },
    {
      "user": "uMinded",
      "text": "@bart1e no cross references listed for ANY strings. Even ones that I know get displayed. As this in an embeded rom I also cant press c at the reset vector either so a lot of the auto eploring doesnt seem to work.",
      "time": null
    },
    {
      "user": "Anonymous Anonymous",
      "text": "@uMinded When you are analysing dynamically you can try a hardware breakpoint on the string - this won't give \"all the places\", but probably some interesting starting points",
      "time": null
    },
    {
      "user": "Dvd848",
      "text": "In the past I was able to use W32Dasm to find string references for a similar binary when IDA and Ghidra failed (select Refs -> String Data References).",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Try searching for INT 10h, that's the x86 BIOS interrupt that allows you to output text to the screen, as well as change the video mode and cursor position among other things.\n\n",
      "votes": "1",
      "user": "Avery3R",
      "time": "Jul 19, 2019 at 19:24",
      "is_accepted": false,
      "comments": [
        {
          "user": "uMinded",
          "text": "I should have mentioned its an embeded rom so not a standard bios. I am trying to track down this exact call idea though.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@uMinded agreed, and moreover you should edit this into your question. These are the things anyone willing to assist needs to even attempt to help.",
          "time": null
        }
      ]
    }
  ]
}