{
  "title": "Decrypting Lua Files",
  "link": "https://reverseengineering.stackexchange.com/questions/21759/decrypting-lua-files",
  "content": "I am trying to decrypt a lua file which has been encrypting using a key. Some background to the LUA file. Its from an android Game i decompiled the APK and found that all the lua files are encrypted.\n\nThe Game is made in an engine called Coco2D which allows developers to encrypt their files using a key. After doing some research i found that you can use IDA to look into the Binaries of the SO File and Find the encryption key in a function called ApplicationDidFinishLaunching. I tried that but i'm not really sure what im looking for in that function.\n\nIDA Text from ApplicationDidFinish Function: https://pastebin.com/9h69PADF\n\nNear the top of the function you can see these set of variables\n\n```\n.text:00404100 var_90          = -0x90    \n.text:00404100 var_84          = -0x84\n.text:00404100 var_80          = -0x80\n.text:00404100 var_7C          = -0x7C\n.text:00404100 var_74          = -0x74\n.text:00404100 var_70          = -0x70\n.text:00404100 var_6C          = -0x6C\n.text:00404100 var_68          = -0x68\n.text:00404100 var_64          = -0x64\n.text:00404100 var_60          = -0x60\n.text:00404100 var_5C          = -0x5C\n.text:00404100 var_3C          = -0x3C\n\n```\nIm not sure what the above variables represent but i dont think they represent the key since the key is meant to be 128bit string encoded as Hex.\n\nExample of Encryption key: https://static.packt-cdn.com/products/9781783284757/graphics/B0561_11_01.jpg\n\nAfter More Digging i found this section in the function\nhttps://pastebin.com/N44prr2N\n\nThis section includes 32 hex Digits with a break of DCB 5 and DCB 4 within. I think that this is most likely the key but im unsure on how i would assemble what i have in the pastebin to a 128Bit key. I also don't know what DCB is (goin g to do research on it in a sec) and i don't know why there are breaks of 5 and 4 within the section.\n\nI went online and found a Hex to Ascii Converter and found that the hex digits do convert to Ascii. 7C converts to | and 78 converts to X just like the comments suggest but the problem i have now is that hex values such as 0xC dont convert to an Ascii value.\n\nLink To the APK: https://apkpure.com/taptap-heroes/com.westbund.heros.en\nLink To Encrypted Lua File + SO: https://www.mediafire.com/file/5ypqt5tk0scjwb5/LuaEncrypted.rar/file\n\nEdit: after looking at the pseudo for the function i found no sign of a XTEA key being used (i may be wrong). Although i did find that RSA endcoding was used for Lua files. I still don't know what or how to decode it if its using RSA.\n\nLink To RSA: https://pastebin.com/quNJNzYd\n\n",
  "votes": "2",
  "answers": 1,
  "views": "20k",
  "tags": [
    "ida",
    "c++",
    "android",
    "game-hacking",
    "lua"
  ],
  "user": "Cartion",
  "time": "Jul 26, 2019 at 11:38",
  "comments": [
    {
      "user": "tmr232",
      "text": "The var_XX = XX lines you're seeing are var offsets, not values. I highly recommend that you look for some IDA Pro tutorials and introductory videos.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "xxtea encrypt with KEY: sxpDM2018\n\nresult\nFightLogic.lua\n\nhow find the KEY\n\n```\nbyte *xxtea_decrypt(byte *data, long data_len, byte *key, long key_len, long *ret_length)\n\n```\n\n\n```\nvar v45 = [896, 914, 915, 827, 756, 630, 499, 369, 252]\nvar v18 = 666\nvar v34 = []\nfor (var v17=0;v17<9;v17++) {\n v19 = v45[v17]\n v34.push((v19-v18)/2) //((((v19-v18)>>31) + (v19-v18)) << 23) >> 24\n v18 = (v19 - v17) - 222\n}\n// result sxpDM2018\nconsole.log(String.fromCharCode.apply(null, v34))\n\n```\n\n\n",
      "votes": "6",
      "user": "user29082",
      "time": "Jul 26, 2019 at 7:39",
      "is_accepted": true,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "Hi and welcome to RE.SE. It's said: Give a man a fish, and you feed him for a day; show him how to catch fish, and you feed him for a lifetime. ... perhaps you'd like to elaborate how you got there (tools, approach ...) instead of simply doing the homework?! Thanks.",
          "time": null
        },
        {
          "user": "Cartion",
          "text": "thank you is it possible to know how you achieved this as i don't want to come back everytime the key changes + it would be great to know thanks alot anyways ive been looking at it for the past few days and as someone new to reverse engineering this is all too confusing",
          "time": null
        },
        {
          "user": "user29082",
          "text": "ok, i will edit tomorrow.",
          "time": null
        },
        {
          "user": "Cartion",
          "text": "okay thanks by any chance when you edit it tomorrow can you tell me how you decrypted the file because i used a simple python script to decrypt the same file in but it didn't work",
          "time": null
        },
        {
          "user": "user29082",
          "text": "You need to remove 8byte sign imgur.com/YZ8mg17",
          "time": null
        }
      ]
    }
  ]
}