{
  "title": "DEX file referenced type is not defined in file",
  "link": "https://reverseengineering.stackexchange.com/questions/21767/dex-file-referenced-type-is-not-defined-in-file",
  "content": "I am analyzing a dex file and to ease with reverse engineering, I converted it a jar so it could be decompiled. In the file android/support/v17/leanback/media/MediaControllerGlue.class, the following import appears: \n\nimport android.support.v4.media.session.MediaControllerCompat;\n\nHowever, this class is not defined. In fact, there is no android/support/v4/media package in the file. \n\nTo confirm, this, I listed the referenced type in the type_ids section of the dex file, and sure enough, the following type is present: android/support/v4/media/MediaControllerCompat. However, when I then iterate over all entries in the class_defs section, this class is nowhere to be found.\n\nI am new to Android (this is actually an Amazon Firestick APK) development/reverse engineering so I'm not sure how this is possible. Is there some way of defining classes in a separate library that would exist outside of the APK?\n\n",
  "votes": "3",
  "answers": 1,
  "views": "165",
  "tags": [
    "android",
    "java",
    "apk"
  ],
  "user": "genghiskhan",
  "time": "Jul 25, 2019 at 13:47",
  "comments": [
    {
      "user": "Antimony",
      "text": "Did you check whether there are multiple dex files? What tool did you use to do the jar conversion?",
      "time": null
    },
    {
      "user": "genghiskhan",
      "text": "There is only one dex file. I used dex2jar but the problem doesn't lie in the jar conversion since I inspected the contents of the dex file directly.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "As it turns out, this class (and other not defined in the DEX file) are part of the standard Android library. Therefore, I suppose they're linked from a shared object at runtime.\n\n",
      "votes": "2",
      "user": "genghiskhan",
      "time": "Jul 28, 2019 at 21:03",
      "is_accepted": false,
      "comments": []
    }
  ]
}