{
  "title": "ECU tune and reverse engineering",
  "link": "https://reverseengineering.stackexchange.com/questions/21787/ecu-tune-and-reverse-engineering",
  "content": "I'm new to the ECU (or chip) tune concept, and I try to understand what is going on there. \n\nI understand the concept and the goal, but I'm having difficulties to understand what is actually going on there. \n\nFrom what I understand the process for tuning is:\n\nHowever, I can't understand what is the format of the downloaded ECU - is it just a regular firmware? I found many websites like this which offer to download ECU  files, but I couldn't recognize the format - it doesn't look to me like any firmware, and I couldn't identify any CPU architecture on all the files I tried. In addition, the size of the files is almost always 512KB, 1024KB or 2048KB which is not very typical to firmware. \n\nWhen downloading files from those sites I see that many of them referenced as ori (original?), some of them as map and some of them as bdm. (Needless to say, there is not much information about the formats in the sites..). What do these types mean?\n\nIf I want to reverse engineer the firmware of the ECU - are those the files that I should look at?\n\n",
  "votes": "1",
  "answers": 2,
  "views": "2k",
  "tags": [
    "firmware",
    "embedded",
    "firmware-analysis"
  ],
  "user": "macro_controller",
  "time": "Jul 28, 2019 at 15:10",
  "comments": [],
  "answers_data": [
    {
      "content": "It is a difficult question because there is no general answer. The layout of the FW  defined by the OEM and the ECU supplier together during design phase and it might be different between ECUs and OEMs. \nEvery ECUs has its own firmware(s) and constant parameter sets inside the Flash memory/ROM/Eeprom/other NVMs where the OEM and the supplier is able tune the ECU behaviour. \n\nHowever it is not easy to get this FW or parameter set from the ECU. Usually the debug ports of these ECUs are secured and only special types of FW-s can be programmed with the OEM programming tool most of the time via UDS. To avoid such a cases to read out the FW usually the RequestUpload routine is not implemented. \n\nOften online and offline integrity and authenticity checks also included so you cannot just simply download / modify / upload a new parameter set to the ECU because it become defective. \n\nI do not really know how does the ECU tunings works in the real life but I think these guys has use the tools from the OEMs or at least they reverse them and not the ECUs.\n\n",
      "votes": "2",
      "user": "0x6261627564",
      "time": "Jul 29, 2019 at 9:32",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Alternatively, ECU tuning is done by replacing original ECU by another unit, which has proper software for tuning. For example: https://www.maxxecu.com/products/race\n\n",
      "votes": "0",
      "user": "Anton Kukoba",
      "time": "Jul 29, 2019 at 10:08",
      "is_accepted": false,
      "comments": []
    }
  ]
}