{
  "title": "How to get array size of a global variable using IDApython?",
  "link": "https://reverseengineering.stackexchange.com/questions/21854/how-to-get-array-size-of-a-global-variable-using-idapython",
  "content": "I can make an array using MakeArray.\n\nIs there a function to get the size of the array I've created?\n\nI've tried GetArrayId + GetLastIndex but it doesn't seem to work.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "1k",
  "tags": [
    "idapython",
    "array"
  ],
  "user": "sololevelingreverser",
  "time": "Aug 6, 2019 at 15:37",
  "comments": [
    {
      "user": "Biswapriyo",
      "text": "Can you add a sample C or assembly code that you have tried on?",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "by \"size\" do you mean total byte size or number of elements?",
      "time": null
    },
    {
      "user": "sololevelingreverser",
      "text": "@IgorSkochinsky, actually I'm trying to get both.",
      "time": null
    },
    {
      "user": "sololevelingreverser",
      "text": "@Biswapriyo. I don't have a sample C or assembly code but you can try something like MakeArray(ea,10) to create an array then use GetArrayID + GetLastIndex.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "An array is an example of a data item. Like all items in IDA (the other item type is instruction), it has a starting address (head) and size. You can retrieve the whole item's size using the function get_item_size() (legacy name ItemSize()).\n\nTo figure out the number of items in an array, you can divide the whole array's size by the size of one element. But how to know the size of element? For this you need to inspect the flags of the item (attached to the head byte) using get_flags() function. Base item type is encoded in the bits defined by the DT_TYPE bits (top 4 bits of the flags) and takes values such as FF_BYTE (byte), FF_WORD (word), FF_DWORD and so on. But instead of checking the bits manually, you can use the function get_data_elsize() which return the size in bytes from the flags.\n\nFor more info check the bytes.hpp header in the SDK.\n\n",
      "votes": "3",
      "user": "Igor Skochinsky",
      "time": "Aug 14, 2019 at 21:26",
      "is_accepted": false,
      "comments": [
        {
          "user": "sololevelingreverser",
          "text": "Thanks @IgorSkochinsky. This was exactly what I did! Almost... s_id = GetVarStrucId(ea) s_size = GetStrucSize(s_id) item_size = idaapi.get_item_size(ea) num_elements = s_size/item_size",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "yes, if your items are sructs you need to get the struct id to determine its size",
          "time": null
        },
        {
          "user": "KulaGGin",
          "text": "@IgorSkochinsky how to do this for stack variables? For example, I have a stack variable: it's an array of 2 DWORD variables. I don't have effective address for them. I can't find it in the documentation: the functions you provided require the effective address.",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "@KulaGGin you can use the struct member ID instead of the ea. you need to get the frame struct and check it’s members.",
          "time": null
        },
        {
          "user": "KulaGGin",
          "text": "Thanks for such a quick answer. I tried it yesterday and it worked.",
          "time": null
        }
      ]
    }
  ]
}