{
  "title": "JTAG Dumped Flash is scrambled",
  "link": "https://reverseengineering.stackexchange.com/questions/21868/jtag-dumped-flash-is-scrambled",
  "content": "I dumped the flash memory of an old ARM9 Chip running VxWorks using the SEGGER J-Link and the savebin command from J-Link Commander.\n\nHere is an example of a line of HTML stored on memory.\n\n```\n<!DOC^YPE H^MN PUNLOC \"///W?C//NTN NTOL 4.01//EN\" \"nt~p>//ww.w?.oro/^R/h~mn4/s~roc~.ntn\">\n\n```\nWhat it should be\n\n```\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\" \"http://www.w3.org/TR/html4/strict.dtd\">\n\n```\nThe pattern of error that I see is the last 4 bits of every other byte is replaced with different bits.\n\nSo the two bytes CT(43 54) in DOCTYPE become C^ (43 5E). The first 2 bits of the two bytes are always correct but the last 4 are not.\n\nMy question is, what is causing this systematic error? Is it a problem with the JTAG configuration or some ECC or something thing else completely?\n\n",
  "votes": "5",
  "answers": 0,
  "views": "146",
  "tags": [
    "binary-analysis",
    "jtag",
    "firmware-analysis"
  ],
  "user": "user3547018",
  "time": "Aug 12, 2019 at 17:07",
  "comments": [
    {
      "user": "w s",
      "text": "It looks like problem in jtag configuration or usage. Did you try to get some copies  of the binary and check differences between the copies ?",
      "time": null
    },
    {
      "user": "user3547018",
      "text": "I think you are right, the problem is some jtag configuration error. I am switching to openOCD for more control over settings but I am not sure what I should change exactly. Unfortunately I do not have access to a copy of the unchanged binary but I have found enough strings to see that the errors are consistent throughout the whole binary.",
      "time": null
    },
    {
      "user": "user3547018",
      "text": "So I tried using openOCD and got the same result. I am now leaning towards the pattern being a ECC i am not sure which one yet.",
      "time": null
    }
  ],
  "answers_data": []
}