{
  "title": "How to bring the message box other than error message box",
  "link": "https://reverseengineering.stackexchange.com/questions/21898/how-to-bring-the-message-box-other-than-error-message-box",
  "content": "The program asks serial number. I've searched the API call which triggers the wrong password message box and force it into accepting an incorrect serial number in x64dbg’s string references. I found nothing usefull. So I tried to use Call Stack window in order to catch the responsible API function for input strings. I placed a breakpoint on the suspected address. I scrolled up to change the JE instructor to JNZ. When I click the OK button after I enter a serial number, the button doesn't work:\n\n0654C66D    E8 26353D01     CALL 0791FB98\n0654C672    85C0            TEST EAX,EAX\n0654C674    0F84 37010000   JE 0654C7B1\n0654C67A    BE 05000000     MOV ESI,0x5\n0654C67F    E9 41010000     JMP 0654C7C5\n0654C684    FF75 14         PUSH DWORD PTR SS:[EBP+0x14]\n0654C687    FF75 10         PUSH DWORD PTR SS:[EBP+0x10]\n0654C68A    FF75 0C         PUSH DWORD PTR SS:[EBP+0xC]\n0654C68D    FF75 08         PUSH DWORD PTR SS:[EBP+0x8]\n0654C690    8B55 DC         MOV EDX,DWORD PTR SS:[EBP-0x24]\n0654C693    8BCB            MOV ECX,EBX\n0654C695    E8 B6FED7FD     CALL 042CC550  ' I've placed the breakpoint here.\n\nAny idea would be appreciated.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "449",
  "tags": [
    "disassembly",
    "ollydbg"
  ],
  "user": "Kıvanç Cantimur",
  "time": "Sep 30, 2019 at 10:53",
  "comments": [
    {
      "user": "andresantacruz",
      "text": "Maybe you changed some code inside MessageBox function? Please give more contextual information about the problem.",
      "time": null
    },
    {
      "user": "Kıvanç Cantimur",
      "text": "I want to make the application bring me the MessageBox function like “registration accepted.” Is it possible that I put the breakpoint on the wrong address?",
      "time": null
    },
    {
      "user": "andresantacruz",
      "text": "I think you need to be more specific and give more details about the context of what you are trying to do.",
      "time": null
    },
    {
      "user": "Kıvanç Cantimur",
      "text": "I want to check if which API function is responsible for input strings. I tried to find an API call by using the \"Names\" window. Also I have tried searching for all intermodular calls. The SendMessage and GetWindowTextA APIs are found in neither.   Likewise I can’t find the error message in Referenced String window when I enter the wrong serial number. Could the program is either packed or strings are encrypted. Should I also try the method of Ctrl+G to find the SendMessage and GetWindowTextA?",
      "time": null
    },
    {
      "user": "andresantacruz",
      "text": "Man you should put some time organizing your thoughts and your problem in a legible easy to understand text. Also I would suggest you stop using Olly and go for a maintained dbg like x64dbg (it is very similar to olly in its GUI and basic functionalities).",
      "time": null
    }
  ],
  "answers_data": []
}