{
  "title": "malware analysis [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/21988/malware-analysis",
  "content": "I tried to use process monitor to find out what program 4.exe did on my system. However, I could not find what changes were made.\n\n\n\nI believe that this program modifies some files and the registry, but I do not know which files and registry keys.\n\nI checked registries in Google and couldn’t figure out what is exactly the threat of the program to the system? The question is  about a kind of modification on the files . I haven’t noticed such kind of modification.\n\nI spent many hours on debugging the program and tracing assembly code, but couldn’t find the damage file.\n\ndownload the file from here\n\n",
  "votes": "-1",
  "answers": 1,
  "views": "136",
  "tags": [
    "windows",
    "malware",
    "pe"
  ],
  "user": "shadow",
  "time": "5 years ago",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "Hi and welcome to RE.SE. Please post the text from that window, instead of a screenshot.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "When analyzing software suspected to have been designed for criminal purposes, uploading the file to VirusTotal seems to be a good first step. In this case, when this file is uploaded to VirusTotal and we click on the \"Behavior\" tab, there is a choice of reports from 4 different emulators/sanboxes to look over, all of which list file system interactions and registry interactions. \n\nIf you are interested in malware analysis, there are many resources available to help you get started. I have heard Practical Malware Analysis is quite good, but there are many others.\n\n",
      "votes": "1",
      "user": "julian",
      "time": "Aug 28, 2019 at 15:01",
      "is_accepted": false,
      "comments": [
        {
          "user": "shadow",
          "text": "Could you please describe in detail the actions of this possible malware ?",
          "time": null
        },
        {
          "user": "julian",
          "text": "@shadow I’m afraid I do not have time to perform a full analysis on request",
          "time": null
        },
        {
          "user": "shadow",
          "text": "Thank you for your kindly support. Could you please perform a some ( not Full) analysis on request. because , I can't find any damage on user's files.",
          "time": null
        }
      ]
    }
  ]
}