{
  "title": "Lack of arguments before a CALL instruction",
  "link": "https://reverseengineering.stackexchange.com/questions/22068/lack-of-arguments-before-a-call-instruction",
  "content": "I'm reversing an open-source windows application written in C++. I found in the disassembler the desired function that I'm trying to understand its behavior.\n\nIn the code this function is defined as follow:\n\n```\nvoid ProtocolGame::sendUseItem(const Position& position, int itemId, int stackpos, int index)\n{\n    OutputMessagePtr msg(new OutputMessage);\n    msg->addU8(Proto::ClientUseItem);\n    addPosition(msg, position);\n    msg->addU16(itemId);\n    msg->addU8(stackpos);\n    msg->addU8(index);\n    send(msg);\n}\n\n```\nAs you can see, this function has 4 parameters, but in assembly code it only pushes 2 args. See picture below.\n\n\n\nWhat is going on with this CALL procedure? Shouldn't it have 4 arguments?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "169",
  "tags": [
    "calling-conventions",
    "arguments"
  ],
  "user": "Sávio Brilhante",
  "time": "Sep 6, 2019 at 19:47",
  "comments": [
    {
      "user": "peter ferrie",
      "text": "Your snippet is too small to show that earlier the Arg3 and Arg4 might have already been pushed to the stack.",
      "time": null
    },
    {
      "user": "Biswapriyo",
      "text": "Paste the assembly in text form not as a picture.",
      "time": null
    },
    {
      "user": "blabb",
      "text": "look at ollydbg comment pane the black bracket will show you where each arg is pushed the one before arg2 will be arg 3 scroll up and down t",
      "time": null
    },
    {
      "user": "Pickle Rick",
      "text": "Not enough information to give a proper answer, as others have said. My guess though would be that it's a __fastcall where ecx and edx are the first two parameters. Post the full assembly of the caller / callee and you will get a more reliable answer.",
      "time": null
    },
    {
      "user": "Michael Karcher",
      "text": "@Pickle Rick (sorry for necroing - feel free to ignore) I don't think this is going to be __fastcall. It will more likely be __thiscall instead, so ecx does contain a parameter, but it will be the hidden this pointer, and not one of the four named argument. I agree that more context is needed to be sure, though.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Seems like it has 4 arguments, and they are passed through stack, yet the more lines of disassembly above E42D6A needed to make sure. Are those mov and lea instruction confusing you? If you've expected to have 4 push instruction in a row, then let me disappoint you: compiler can insert as many instructions as it likes between the push instructions. And let let me disappoint you again: push instruction is not the only way compiler can pass the arguments through stack.\n\n",
      "votes": "1",
      "user": "Anton Kukoba",
      "time": "Sep 16, 2019 at 8:08",
      "is_accepted": false,
      "comments": []
    }
  ]
}