{
  "title": "Reverse Engineering Firmware Aether Cone",
  "link": "https://reverseengineering.stackexchange.com/questions/22074/reverse-engineering-firmware-aether-cone",
  "content": "I have been trying to work out if its possible to reverse engineer the firmware for the Aether Cone. This is a good sound quality WIFI and Bluetooth speaker, but with Aether going bust, there is no support only a final firmware that enabled spotify. \n\nWhat Information I currently know:\n\nInvestigation:\nI have tried using binwalk to examine and extract the files but I have had limited success. \n\n```\n$ binwalk FRM000104.03.01.0013.morse\n\nDECIMAL       HEXADECIMAL     DESCRIPTION`\n\n--------------------------------------------------------------------------------\n\n27842795      0x1A8D8EB       StuffIt Deluxe Segment (data): f\n30729686      0x1D4E5D6       MySQL MISAM compressed data file Version 7\n57321984      0x36AAA00       POSIX tar archive, owner user name: \"ader.img\"\n\n```\nI have extracted the firmware to give this:\n\n```\nls -larth _FRM000104.03.01.0013.morse-0.extracted/\ntotal 29M\n-rw-rw-r--  1    500   501   27 Oct  2  2015 version.txt\n-rw-rw-r--  1    500   501  256 Oct  2  2015 signature.sha256\n-rwxr-xr-x  1    500   501   12 Oct  2  2015 pre-inst.sh\n-rwxr-xr-x  1    500   501  184 Oct  2  2015 post-inst.sh\n-r--r-----  1    500   501 1.9K Oct  2  2015 cert.pem\n-rw-rw-r--  1    500   501   31 Oct  2  2015 bootloader.ver\n-rw-rw-r--  1    500   501 221K Oct  2  2015 bootloader.img\n-rw-r--r--  1    root  root 29M Sep  8 08:06 1A8D8EB.sit\n-rw-r--r--  1    root  root 231K Sep 8 08:07 36AAA00.tar\n\n```\nIf I try and read these, there is nonsense. So I tried using strings, but I cannot get anything useful out of this:\n\n```\n# strings version.txt\n# strings post-inst.sh\n    ^       Gj\n    p8-wR\n# strings pre-inst.sh\n# strings signature.sha\n256\n=DHri,\nZ@pH\nA9!J8a\n# strings cert.pem\nW69)\nfPq2\n:)M7\nvj%<u\n)s|5\n];DE\nOEFvD(\nC\"s6m\n-T}1\nJjw-\nFkY'\n(Z4G\nbf<`\n]*$+\n?j[\\\nCVBG\np%XMi\n|[q:\n1nQ^\nNAf&\n' f&K\npt[679\n# strings bootloader.ver\n\n```\nI would appreciate some assistance as I have definitely run out of ideas and talent now. My main aim would be to either get the root password as ssh is open on the device or be able to edit the firmware file to allow root so that I can update packages and hopefully keep this thing alive, people have had issues with the spotify connect plugin not working with more recent spotify versions. \n\n",
  "votes": "4",
  "answers": 2,
  "views": "978",
  "tags": [
    "firmware",
    "arm",
    "binwalk"
  ],
  "user": "Blaine O",
  "time": "Sep 8, 2019 at 15:25",
  "comments": [
    {
      "user": "julian",
      "text": "You are out of luck. All the extracted files are encrypted.",
      "time": null
    },
    {
      "user": "Blaine O",
      "text": "Hi, How is it that the file names aren't encrypted but the rest of the content is encrypted?",
      "time": null
    },
    {
      "user": "julian",
      "text": "What do file names and other file attributes have to do with the contents of files? unix.stackexchange.com/questions/117325/…",
      "time": null
    },
    {
      "user": "Daniel Kukula",
      "text": "I can play streams with mpg123 and gst-play-1.0 on the speaker. it can be run it remotly with ssh [email protected] gst-play-1.0 http://stream_address I also installed(unpacked and symlinked) mpd found in a thread on volumio forum I could not get it work with alsa and after lot of hacking I got it streaming the music and then I start gst-play with my local address gst-play-1.0 http://localhost:8000 now all works - its a bit hacky and I dont like the local streaming but it works",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "as my previous answer was deleted (I'm guessing because it was not an answer per se) I've got more of an answer for you.\n\nthe firmware does nothing to stop you from using UART to interact with it except require a login.\nroot login is enabled for such an endeavor and you already have the password in the buildroot.config file.\nfrom there you'll need to dig into the location of sshd_config as I'm not sure its in a standard place.\nAdd a line in the Authentication section of the file that says \"PermitRootLogin yes\".\nRestart SSH server with \"service sshd restart\"\n\nthe firmware has an inserting security feature as it's using MetFS to encrypt the data.\nthe password for this is also available on the device in the sysupdate script if you want to tinker with a firmware update to enable ssh or when airplay2 is available go multi-room with a few of these speakers.\n\n",
      "votes": "2",
      "user": "Fidget",
      "time": "Jul 29, 2020 at 20:17",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "my findings on openwrt forum\nhttps://forum.openwrt.org/t/aether-cone-good-device-for-hacking/73890\nalso a link to the update script which can be helpful to see how to decode the firmware from github: https://pastebin.com/SXASpfnX\n\n",
      "votes": "0",
      "user": "Daniel Kukula",
      "time": "Sep 10, 2020 at 21:25",
      "is_accepted": false,
      "comments": [
        {
          "user": "Chris Stratton",
          "text": "Answers on stack exchange sites are required to have stand-alone content, they may not simply be links to elsewhere.  For this to qualify, you'll need to summarize some independently useful set of your findings in the answer itself; then you can leave the rest to the links.",
          "time": null
        }
      ]
    }
  ]
}