{
  "title": "Unable to properly analyze a very simple C-compiled program",
  "link": "https://reverseengineering.stackexchange.com/questions/22216/unable-to-properly-analyze-a-very-simple-c-compiled-program",
  "content": "I'm a RE beginner and I decided to start writing my own simple code for practice.\n\nI wrote a simple code which uses a winAPI function called CreateProcess to start a calc.exe, I've wrote it in C and compiled it using with the official Microsoft SDK with visual studio 2019 as a Release version.\n\nThe exe file works with Windows 7 and Windows 10 without any issue.\n\nI searched through IDA and went to the start function which should point where the main user code is, so here are my problems:\n\n\n\n\n\nI have IDA pro 6.8 installed.\n\nThis is how the original code looks, the main function only contains a call to the Create() function:\n\n```\nvoid Create()\n{\n    STARTUPINFO si;\n    PROCESS_INFORMATION pi;\n\n    SecureZeroMemory(&si, sizeof(si));\n    si.cb = sizeof(si);\n    SecureZeroMemory(&pi, sizeof(pi));\n\n    if (!CreateProcess(L\"C:\\\\Windows\\\\system32\\\\calc.exe\", NULL, NULL, NULL, FALSE, 0, NULL, NULL, &si, &pi))\n    {\n        printf(\"failed, error: %d\", GetLastError());\n    }\n    else {\n        printf(\"Process successfuly started!\");\n    }\n}\n\n```\nEDIT:\n\nI added to linked PDB file that was in the Release folder and IDA works great and it immediately detects the main function!\n\nBut I say to myself, if I'm a malware analyst, I will get the EXE file without any PDB file, so what am I to do?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "300",
  "tags": [
    "ida",
    "disassembly",
    "malware",
    "c"
  ],
  "user": "just_C",
  "time": "Oct 1, 2019 at 11:17",
  "comments": [
    {
      "user": "Rup",
      "text": "Is that start function definitely the main() function, and not the CRT start? Can you look at the imports window to find CreateProcessW and look for XRefs for it? Can you click on the \"DATA XREF\" for the path string to see where it's used?",
      "time": null
    },
    {
      "user": "Rup",
      "text": "It might also be worth giving IDA the PDB for your code. It should fill in all the symbols correctly for you.",
      "time": null
    },
    {
      "user": "just_C",
      "text": "ok, once I added the pdb file, IDA works like magic! I recognize all the user code easily, but I don't understand what am I to do if I only get the exe file, how will I analyze it..?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Eventually, I analyzed how the program looks with all the symbols from the PDB file so that I'll know the actual Main function address.\n\nAfter finding that out, I just searched the file without the PDB to understand what path do I need to take in order to get to the main function from the start function that the MSVC creates.\n\nThis solves my problem for future programs compiled with the MSVC aswell.\n\n",
      "votes": "0",
      "user": "just_C",
      "time": "Oct 12, 2019 at 12:03",
      "is_accepted": true,
      "comments": []
    }
  ]
}