{
  "title": "Malware Samples that defeats emulators by using uncommon API calls [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/22231/malware-samples-that-defeats-emulators-by-using-uncommon-api-calls",
  "content": "I am looking for a few malware samples that detects sandboxes using uncommon API calls. I understand that one of the drawbacks of OS emulated sandboxes is that the malware can use uncommon API calls to crash the emulator/sandboxes. Does anyone know of such samples? It would be great if different samples asking for different APIs could be supplied.\n\nThank you!\n\n",
  "votes": "2",
  "answers": 2,
  "views": "180",
  "tags": [
    "malware",
    "emulation",
    "sandbox"
  ],
  "user": "deTermInate",
  "time": "5 years ago",
  "comments": [
    {
      "user": "peter ferrie",
      "text": "I'm voting to close this question as off-topic because it's not about reverse-engineering.  It's sample collection.",
      "time": null
    },
    {
      "user": "deTermInate",
      "text": "@peterferrie Is there some other forum/website where I can ask for such help if it is deemed as off-topic here?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I don't have any experience with this directly, so take it with a grain of salt. If you take a look at what Sandboxie does, on top of their driver they also have a huge number of ring3 hooks on WinAPI. There are also lots of other things to check for, even as simple as their module being loaded. Point being that I don't think an individual example will really do much good because there are so many countless ways to detect it. The same goes for other sandbox emulation, VM's, etc.\n\n",
      "votes": "0",
      "user": "Pickle Rick",
      "time": "Oct 3, 2019 at 9:43",
      "is_accepted": false,
      "comments": [
        {
          "user": "deTermInate",
          "text": "I am actually looking for malware with specific techniques in order to test it against different sandbox architecture as part of a research project.",
          "time": null
        }
      ]
    },
    {
      "content": "I don't have the samples but here's the report on the malware which does sandbox detection: https://www.root9b.com/sites/default/files/whitepapers/PoS%20Malware%20ShellTea%20PoSlurp_1.pdf so that you can be more specific in your samples search.\n\n",
      "votes": "0",
      "user": "Anton Kukoba",
      "time": "Oct 3, 2019 at 14:46",
      "is_accepted": false,
      "comments": []
    }
  ]
}