{
  "title": "Can a debug-apk be reverse engineered to make it a release-apk?",
  "link": "https://reverseengineering.stackexchange.com/questions/2223/can-a-debug-apk-be-reverse-engineered-to-make-it-a-release-apk",
  "content": "I am making a system in which the users can create Android applications. I want them to give an option to download a debug apk so that they can try it out first. After that, they have to pay for it to get the apk in release mode, so that it can be distributed in the Google Play Store.\n\nI of course don't want them to be able to reverse-engineer the debug apk so that they can extract the needed files from it and then sign it themselves. Hence my question: \n\nIs it possible to reverse engineer a debug apk to extract the classes and everything needed to build it in release mode?\n\nIf so, would there be any way to secure the debug versions so that it isn't possible anymore?\n\n",
  "votes": "5",
  "answers": 1,
  "views": "2k",
  "tags": [
    "decompilation",
    "unpacking",
    "android",
    "copy-protection",
    "apk"
  ],
  "user": null,
  "time": "Jun 10, 2013 at 16:04",
  "comments": [],
  "answers_data": [
    {
      "content": "The difference between a debug apk and a release apk is that a debug apk is signed by a particular key which is provided with the SDK, whereas a release apk is signed by some other key. There's nothing to reverse engineer: all you have to do to make a release apk and sign it.\n\nNobody but you can create an apk signed by you. But anyone can make their own release apk by signing them.\n\nA solution in your case would be to produce a binary including some DRM and refuse to run except on your customer's pre-registered device. How to implement such DRM, especially while letting your customer debug his applications, is left as an exercise to the reader.\n\n",
      "votes": "7",
      "user": "Gilles 'SO- stop being evil'",
      "time": "Jun 10, 2013 at 19:02",
      "is_accepted": true,
      "comments": [
        {
          "user": "Antimony",
          "text": "Of course, we all know how reliable client side DRM is.",
          "time": null
        },
        {
          "user": "Gilles 'SO- stop being evil'",
          "text": "@Antimony I didn't say it was an easy (or indeed solvable) exercise.",
          "time": null
        },
        {
          "user": "Mehul Joisar",
          "text": "@Antimony: I don't understand the solution.can you please explain it?",
          "time": null
        }
      ]
    }
  ]
}