{
  "title": "What type of data structure is it?",
  "link": "https://reverseengineering.stackexchange.com/questions/2232/what-type-of-data-structure-is-it",
  "content": "I have the following data:\n\n```\n.data:004305FC word_4305FC     dw 1583h                \n.data:004305FC                                         \n.data:004305FE word_4305FE     dw 35B6h                \n.data:00430600                 dw 6835h\n.data:00430602                 dw 6553h\n.data:00430604                 dw 6351h\n.data:00430606                 dw 23F5h\n.data:00430608                 dw 6845h\n.data:0043060A                 dw 6344h\n.data:0043060C                 dw 6823h\n.data:0043060E                 dw 2342h\n.data:00430610                 dw 2474h\n...\n\n```\nIn addition, I have the following disassembly of the code accessing the data:\n\n```\n...\nmov     eax, [ebp+Variable_1]\nxor     ecx, ecx\nmov     cx, word_4305FE[eax*2]\n...\nmov     eax, [ebp+Variable_1]\nxor     edx, edx\nmov     dx, word_4305FC[eax*2]\n...\n\n```\nIt looks like array within another array. Am I correct? If not, what do you think the data structure is? If it is a single array, why is it been accessed through 2 different \"heads\" word_4305fc and word_4305FE?\n\nThank you.\n\nADDED:\n\nThe following is in response to the comments below. Thank you, guys, so much for your input! I really do appreciate it and RE community in general. I feel as if my question needs certain clarification. I do realize that this is an array. I also clearly see that Variable_1 is an index to the array. In addition, I can see iteration. However, it is not my question. What I am really looking for is clarification or possibly an explanation. How would I be able to distinguish if this array is indeed more complex data type? Why did compiler choose to refer to this data type with 2 different angles: using 2 global variables both word_4305fc and word_4305FE? Is there a specific reason for it? Is it an indication of more complex data type? \n\n",
  "votes": "3",
  "answers": 1,
  "views": "377",
  "tags": [
    "disassembly",
    "assembly",
    "ida",
    "struct"
  ],
  "user": "PSS",
  "time": "Jun 11, 2013 at 21:35",
  "comments": [
    {
      "user": "DCoder",
      "text": "It's an array of words starting at 0x4305FC, that code is accessing its members at indices [Variable_1 + 1] and [Variable_1] respectively.",
      "time": null
    },
    {
      "user": "dna",
      "text": "I agree with the above comment. Moreover it looks like a part of an iteration loop.",
      "time": null
    },
    {
      "user": "DCoder",
      "text": "To amend my previous comment, it's not a \"more complex data type\" because changing the value of Variable_1 changes the accessed offset by 2 bytes, and the exactly same amount of bytes gets read from that offset. In a more complex data type, the members of the array would be larger.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "As Dcoder indicated, an array of short data types begins at the lower address, and the increment of the base of the array by 2 corresponds to adding 1 to the index.  Consider the following C code:\n\n```\nshort array[256];\n\n// ...\ncx = array[variable_1+1];\n// ...\n\n// ...\ndx = array[variable_1];\n// ...\n\n```\nConsider the choices that the compiler has in compiling these snippets of code.  It could produce code like this:\n\n```\nmov eax, [ebp+Variable_1]\nxor ecx, ecx\nmov cx, word_4305FC[eax*2+2] ; note the +2 and the -FC address\n\n```\nOr maybe:\n\n```\nmov eax, [ebp+Variable_1]\ninc eax ; note this\nxor ecx, ecx\nmov cx, word_4305FC[eax*2] ; note the -FC address\n\n```\nOr, in the case of what you posted, this is an equivalent code sequence:\n\n```\nmov eax, [ebp+Variable_1]\nxor ecx, ecx\nmov cx, word_4305FE[eax*2] ; note the -FE address\n\n```\nWhat the compiler did was to eliminate the \"+2\" in the address displacement, or the \"inc eax\" in the index computation, and replaced it by adding 1*sizeof(short) to the address of the array.  This allows for a more optimized computation that does not have any increments taking place at runtime.\n\n",
      "votes": "8",
      "user": "Rolf Rolles",
      "time": "Jun 11, 2013 at 22:15",
      "is_accepted": true,
      "comments": [
        {
          "user": "PSS",
          "text": "And elimination of +2 by the compiler made IDA present it as 2 variables, didn't it?",
          "time": null
        },
        {
          "user": "Rolf Rolles",
          "text": "IDA represented it as two variables because as far as IDA was concerned, it IS two variables, since it's accessed from two different locations.  If you want to alter that, you can go to the earlier address and use the alt-numpad* key combination to create a single array at that location.",
          "time": null
        }
      ]
    }
  ]
}