{
  "title": "Google Maps, Android serialisation format",
  "link": "https://reverseengineering.stackexchange.com/questions/22375/google-maps-android-serialisation-format",
  "content": "I've come across an SQLite database (gmm_storage.db) used by Google Maps on Android, and I'm unsure as to how the data it contains is serialised. For example:\n\n\n\nI'm saying serialised, as from the header 0xACED it appears to be a Java serialised object.  However, as I have no idea what the serialised class actually looks like, I've been unable to deserialise it.\n\nI'm also not entirely sure it's standard Java serialisation, as I've tried a number of different tools, and Java itself,  and all of them report that the stream is corrupt.\n\nYou can see some references to standard Java classes, such as java/util/Set, but also a lot of smaller references to things like 'fic', or 'vot'.  I'm guessing these are either obfuscated class names, or they are part of some kind of lookup/offset table.\n\nMy other guess is that as it's a Google product, it's probably using a Google serialisation library, like GSON or protobuf, but the data doesn't look like either of those.\n\nAnyone come across this before, or can shine some light on it?\n\n",
  "votes": "2",
  "answers": 0,
  "views": "340",
  "tags": [
    "binary-analysis",
    "android",
    "java"
  ],
  "user": "Tony",
  "time": "Oct 23, 2019 at 17:44",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "Have you tried decompiling the app and finding the code which reads this db?",
      "time": null
    },
    {
      "user": "Tony",
      "text": "I haven't no.  I was hoping to avoid doing that, but it's certainly an option.",
      "time": null
    },
    {
      "user": "Biswapriyo",
      "text": "@IgorSkochinsky Are we allowed to reverse eng. Google Maps? If yes I'm on!",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "@Biswapriyo check your local laws but AFAIK in most jurisdictions reverse engineering is allowed for interoperability purposes etc.",
      "time": null
    },
    {
      "user": "Biswapriyo",
      "text": "@Tony Where and how did you get the database file?",
      "time": null
    }
  ],
  "answers_data": []
}