{
  "title": "What's the pattern in this sequence extracted from a LYR document, used by the ESRI ArcGIS",
  "link": "https://reverseengineering.stackexchange.com/questions/22419/whats-the-pattern-in-this-sequence-extracted-from-a-lyr-document-used-by-the-e",
  "content": "I'm trying to reverse engineer a binary format, and I'm running up against a variable-length sequence of numbers which varies between files. I can't work out the pattern here and how to determine how long this sequence is. I'm 99% sure that the sequence is self-contained and isn't reliant on any information from the preceding parts of the file.\n\nAn example (in hex) of the sequence is:\n\n```\n06 00 00 00    01 00 00 00    fd ff ff  ff     08 00 00 00    f7 ff ff ff     0e 00 00 00 \n\n```\nTo me, this looks like a sequence of little endian signed integers (i.e. 6, 1, -3,  8, -9,  14)\n\nHere's some sequences I've collected:\n\nAny ideas?\n\nUpdate: \nAs requested, some extra context:\n\n",
  "votes": "2",
  "answers": 0,
  "views": "187",
  "tags": [
    "binary-analysis"
  ],
  "user": "ndawson",
  "time": "Nov 2, 2019 at 18:48",
  "comments": [
    {
      "user": "Rup",
      "text": "Obvious observation that in most cases the first number is the length, if there's any scope for a missing number first or last in the others? My first thought would be to find the code that reads this though, if you can, and reverse engineer that.",
      "time": null
    },
    {
      "user": "julian",
      "text": "As currently written, the question isn’t about RE and does not provide enough information or context. What is the binary format? What kind of data is encoded in such files? What kind of application generates this kind of binary files? As Rup mentioned, what application is responsible for parsing this data? Are these sequences of numbers found in a header field? Are they appended to the end of the binary? Are they cherry-picked from wherever? Etc. etc. Please provide the details necessary to answer the question. Provide complete binaries as samples if possible.",
      "time": null
    },
    {
      "user": "ndawson",
      "text": "Thanks -- lots more context posted!",
      "time": null
    }
  ],
  "answers_data": []
}