{
  "title": "How do I reverse engineer a game using dnSpy?",
  "link": "https://reverseengineering.stackexchange.com/questions/22436/how-do-i-reverse-engineer-a-game-using-dnspy",
  "content": "I've been reading some about reverse engineering and decided to try to learn as I go, which has proven somewhat difficult. Sorry about the generic title, I'll try and give enough info so it can be properly answered. I have attempted to view the code of both the exe of the game and the game assembly dll, the game was written in c# with unity, every time I import any of the files into dnSpy it only has a PE tab containing header info I think? BTW the second screenshot is how it is on every item, I've seen some video's where they can edit the c# right in here, is it a security measure or am I an idiot and screwed up? If my question is really retarded feel free to direct me to some beginner resources. I may even just be using the wrong tool. Let me know if you need clarification and thanks in advance for answering my noob question\n\n\n\n",
  "votes": "0",
  "answers": 1,
  "views": "4k",
  "tags": [
    "decompilation",
    "game-hacking"
  ],
  "user": "Matthew",
  "time": "Nov 1, 2019 at 0:17",
  "comments": [
    {
      "user": "Randi123",
      "text": "It doesn't look like a .net assembly file. Calculate file entropy (ie using binwalk, rabin2 etc whichever tool you like) if it is high it is very likely it is packed, maybe try using DiE on the exe and see if it gives you the packer name, from there you can probably find some tools to get it to unpack and get at the contained .net assembly.",
      "time": null
    },
    {
      "user": "invoked",
      "text": "hello download a program called detect it easy. it will tell you the language a program was written in. 99% sure its c/c++. dnspy is useless against it.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "These sections indicate that this is a standard PE, or binary executable loaded by OS. That means that the code is in assembly, and you need a x64 dissambler(probably) . Try IDA.\n\nJust notice that you have to know quite a bit to reverse a game, and I would start with easy crackme excersices. \n\n",
      "votes": "0",
      "user": "eyal karni",
      "time": "Nov 1, 2019 at 8:57",
      "is_accepted": true,
      "comments": []
    }
  ]
}