{
  "title": "How to decrypt a file who encryption and key is unknown? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/22442/how-to-decrypt-a-file-who-encryption-and-key-is-unknown",
  "content": "Here is the file that I am trying to findout a way to decrypt.\nsettings.ini\nThis file is from the settings of the MetaTrader 5. The same is the name of the application.\nKindly suggest a better way so that I could read what is there in the encrypted settings file.\n\n",
  "votes": "0",
  "answers": 1,
  "views": "632",
  "tags": [
    "decompilation",
    "decryption"
  ],
  "user": "Jaffer Wilson",
  "time": "5 years ago",
  "comments": [
    {
      "user": "sudhackar",
      "text": "Add more context such as where's this file from? Which application parses this file?",
      "time": null
    },
    {
      "user": "Jaffer Wilson",
      "text": "@sudhackar Look I have updated the question. please let me know now what I can do.",
      "time": null
    },
    {
      "user": "Michael Pittino",
      "text": "RE the binary to investigate how the binary decrypts/reads that file.",
      "time": null
    },
    {
      "user": "Jaffer Wilson",
      "text": "@MichaelPittino How I can do that? I am clueless. Hence I am here. May be I will get some clue. Can anyone suggest a methodology for that?",
      "time": null
    },
    {
      "user": "Jaffer Wilson",
      "text": "@MichaelPittino Cn you help me with that? Please let me know.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "There’s very little chance of success if both encryption algorithm and the key is unknown (besides trivial cases like single byte XOR) so you need to work on discovering those things. \nSince you have the program which can read the file, the information must be inside it. You can try to find the decryption function by static analysis (disassembly/decompilation) or dynamic (debugging). Once you found it, you can either try to determine the algorithm (e.g. from the magic constants used by the code) or treat it as a black box and reproduce the algorithm in your own implementation. One more approach is to use the code as is and either call it with your own data or run the program normally and capture the data in memory one it’s been decrypted. \n\nIn summary, there is no magic one click solution but as long as you have something which can decrypt the file and can inspect/observe it, the task is solvable. \n\n",
      "votes": "2",
      "user": "Igor Skochinsky",
      "time": "Nov 7, 2019 at 8:22",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jaffer Wilson",
          "text": "Thank you very much for your insightful reply. But I have tried debugging the program which decrypt these file do not let me debug it. I have tried install Scylla Hide plugin which avoid the detect of the debugger, still not working.",
          "time": null
        },
        {
          "user": "Jaffer Wilson",
          "text": "Is there anything else you could help me with. I will certainly accept the answer if you can help me decrypt this file. if you need I can share the program that will decrypt this file. If you can help me let me know.",
          "time": null
        }
      ]
    }
  ]
}