{
  "title": "How to use the libc.so.6 file?",
  "link": "https://reverseengineering.stackexchange.com/questions/22485/how-to-use-the-libc-so-6-file",
  "content": "I'm new to Linux operating system.\nLast day, I practice \"heap exploitation\", and they give me an ELF file, and a libc.so.6 file, and they said I must debug/exploit with that libc file, but I don't know how to use it.\n\nI try to run the ELF file, and I receive \"Illegal instruction (core dumped)\". After googling, I try with LD_PRELOAD, LD_LIBRARY_PATH but no luck. I'm using LUbuntu 18.04.\n\nSo can you guys help me with this case?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "1k",
  "tags": [
    "libc"
  ],
  "user": "Nguyễn Quốc Trung",
  "time": "Dec 17, 2019 at 22:55",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "If it fails when attempting to run it, it doesn't appear to be GLIBC or is a modified or older version or one that has been modified. Or do you mean another ELF file? Because on a system for which GLIBC was built, you can execute it as a standalone binary and it will output version and copyright information and some other stuff. Could you perhaps give us the output of running file on both your specific libc.so.6 and the ELF file you were given?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I can almost guarantee 'they' are wanting you to perform a return to libc exploit.\n\nSome good references\n\n",
      "votes": "1",
      "user": "0xC0000022L",
      "time": "Jan 17, 2023 at 10:14",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "I didn't doubt that. My point was this one. The problem could be succinctly called \"link rot\". So it makes sense to include an excerpt to aid future internauts to find sources once those links have gone stale ...",
          "time": null
        },
        {
          "user": "kr1tzy",
          "text": "Fair enough. Thanks for the tip.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "And just as if to make my point, the second link in the list went stale. And unfortunately it also hadn't been archived by archive.org at the time. But fortunately a (Google) search with operator inurl:Return_to_libc.pdf turned up another source for the same file, it seems (going by author and original URL components).",
          "time": null
        }
      ]
    }
  ]
}