{
  "title": "What, tools do I need to break down the N64 console for private study? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/22621/what-tools-do-i-need-to-break-down-the-n64-console-for-private-study",
  "content": "Alright, I need to know this ASAP, I'm breaking down my own n64 console for private study on the n64 firmware and how it does what it does best.\n\nSo, what tools would I need To break down this console?\nwould I need an n64 chip reader and writer for reading from the N64 chip inside of the console?\n\n",
  "votes": "3",
  "answers": 1,
  "views": "185",
  "tags": [
    "firmware",
    "hardware"
  ],
  "user": "jayloo",
  "time": "5 years ago",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "what's the hurry?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I'm making an assumption that you are talking about the Nintendo 64.\n\nFirstly this is a gaming console, and as such, the revenue model of its creators is selling videogames. Therefore consoles should be difficult to hack and reverse engineer. This is achieved through security PLUS obscurity. This means the inner hardware is often not documented anywhere, or It is completelly custom. It is called a black box system.\n\nThe N64 is a rather old console so you should be able to find information on the internet regarding reverse engineering it, and even pirating it (understanding enough of how It works to make It load copies of games, you might or might not have bought).\n\nIf there is no public information you could begin by inspecting the hardware. Search for a YouTube video that shows how to unscrew the console without breaking it, a teardown. After that you should try to identify all the possible electronic elements: memories (flash, nand,RAM,etc.) , DVD drive, cartridge reader, processor, ribbons going to displays,... and most importantly, their manufacturers and if they have any name printed on them, or model number, to look for possible public datasheets on the internet.\n\nAfterwards it's quite possible that you are going to need your own custom hardware to interact with such components. You would like to dump any non-volatile memory on the board, to intercept any traffic on the different bus lines, etc. And understand how the protocols used work.\n\nThe next \"steps\" are certainly subjective, specific and dependant on the architecture and security measures implemented, and what you found on the previous stages, so I cannot give you further \"general\" answer.\n\n",
      "votes": "1",
      "user": "78dtat78da",
      "time": "Nov 26, 2019 at 21:55",
      "is_accepted": true,
      "comments": []
    }
  ]
}