{
  "title": "Making Visual C++ harder to reverse engineer",
  "link": "https://reverseengineering.stackexchange.com/questions/2266/making-visual-c-harder-to-reverse-engineer",
  "content": "This is similar in nature to this question and this question; I'm interested in what compiler settings to enabled/disable to make a Visual C++ harder to reverse engineer.\n\nHere's a few compiler flags I've already got which I believe should be set:\n/Ox Full optimization. This appears to be the equivalent of gcc's -O3\n/Oy Omit frame pointers. (x86 only)\n/GR- Disable Run Time Type Information\n/MT flag is used to static link the various libraries.\n\nVisibility - I don't think  the MSVC compiler has any options to turn off visibility like -fvisibility=hidden offered in gcc, but is this necessary for MSVC since the debugging symbols are stored in the PDB file?\n\nAre there any other things I should include to ensure minimal information is distrubuted in the application?\n\n(I might add that I am creating a standalone executable)\n\n",
  "votes": "7",
  "answers": 2,
  "views": "2k",
  "tags": [
    "windows",
    "obfuscation",
    "c++"
  ],
  "user": "Sticky",
  "time": "Apr 13, 2017 at 12:49",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "In MSVC the visibility is hidden by default - you have to explicitly export symbols you want to be accessible.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You should disable /DEBUG (linker option), which is enabled by default even for Release configurations.\n\nNote that although certain compiler/linker options will make reverse engineering your software slightly more difficult, they won't have much of an effect regarding overall reversability.\n\n",
      "votes": "4",
      "user": "Jason Geffner",
      "time": "Jun 16, 2013 at 14:43",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Apart from the compiler, because they dont have remedy for RE security. You can use obfuscation and anti debugger tricks. If you want there are lots of good packer, use them \n\n",
      "votes": "3",
      "user": "Blue Indian",
      "time": "Jun 19, 2013 at 12:13",
      "is_accepted": false,
      "comments": []
    }
  ]
}