{
  "title": "Is there a way to edit structure field value in memory during debug",
  "link": "https://reverseengineering.stackexchange.com/questions/22668/is-there-a-way-to-edit-structure-field-value-in-memory-during-debug",
  "content": "I'm debugging some code and I know that there's a structure in memory, I have a definition of the structure, I apply it on memory, then I look at the structure field values, and I see that one of the fields of the structure contains the wrong value. Is there any way to change the structure field value?\n\nCurrently I have to look for the offset of the field in structure definitions, then undefine the structure in memory, then go to the proper offset, change the value and reapply the structure again.\n\n",
  "votes": "3",
  "answers": 2,
  "views": "780",
  "tags": [
    "ida"
  ],
  "user": "Anton Kukoba",
  "time": "Dec 3, 2019 at 15:24",
  "comments": [
    {
      "user": "Biswapriyo",
      "text": "Add the new definition, press Y upon that structure in memory, enter. Does this change it? Or How about creating a memory snapshot?",
      "time": null
    },
    {
      "user": "Anton Kukoba",
      "text": "Y is for changing the type, not the value of the field. I want to change the value, not the representation.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You still need to know the offset of the field, but you can get away with not having to redefine it. Open a hex dump subview and sync it with your disassembly view(right click -> sync with). Put your cursor on the relevant bytes of the struct, hit F2 to enter edit mode, change the data, and hit F2 again to commit your changes to memory. You could probably also do this using the IDC or IDAPython consoles.\n\n",
      "votes": "0",
      "user": "Avery3R",
      "time": "Dec 6, 2019 at 2:10",
      "is_accepted": true,
      "comments": [
        {
          "user": "Anton Kukoba",
          "text": "kind of workaround, but since there's no \"legal\" way to do it, it's ok.",
          "time": null
        },
        {
          "user": "Avery3R",
          "text": "If you need to do this a lot, make a plugin. If you published it I'm sure plenty of people would be greatful",
          "time": null
        }
      ]
    },
    {
      "content": "In IDA, you can setup a breakpoint and use its condition property in Edit Breakpoint.\nThis way you can modify registers, memory, or even perform very complex actions using IDC scripting, for example:\n\n```\npatch_dbg_byte(rcx+2,0),0\n\n```\nAbove will clear byte at address rcx+2 when breakpoint is hit.\n\n",
      "votes": "0",
      "user": "Viktor",
      "time": "Jan 20, 2023 at 0:18",
      "is_accepted": false,
      "comments": []
    }
  ]
}