{
  "title": "Understanding output of rabin2",
  "link": "https://reverseengineering.stackexchange.com/questions/22745/understanding-output-of-rabin2",
  "content": "I am wondering what the crypto, linenum, pcalign, relocs and va values mean in the output of rabin2.\n\nI took a look in the source code of radare2 and it seems for ELF va is always true, I assume it means virtual addressing?\n\nhttps://github.com/radareorg/radare2/blob/1d3698bc96a09e45c4fff4c090278623f146929c/libr/bin/format/elf/elf.c#L2132-L2134\n\n```\nint Elf_(r_bin_elf_has_va)(ELFOBJ *bin) {\n    return true;\n}\n\n```\nI would assume relocs refer to the presence of the relocation table however from my testing that does not seem to be the case.\n\nFor linenum I think it refers information relating to the line numbers in the source code? But this still seem to appear true when there is no DWARF information on the ELF binary.\n\nAs for the other 2 I have no idea what they are referring to.\n\n```\narch     x86\nbaddr    0x0\nbinsz    6618\nbintype  elf\nbits     64\ncanary   true\nsanitiz  false\nclass    ELF64\ncrypto   false\nendian   little\nhavecode true\nintrp    /lib64/ld-linux-x86-64.so.2\nladdr    0x0\nlang     c\nlinenum  true\nlsyms    true\nmachine  AMD x86-64 architecture\nmaxopsz  16\nminopsz  1\nnx       true\nos       linux\npcalign  0\npic      true\nrelocs   true\nrelro    full\nrpath    NONE\nstatic   false\nstripped false\nsubsys   linux\nva       true\n\n```\n",
  "votes": "4",
  "answers": 1,
  "views": "1k",
  "tags": [
    "radare2"
  ],
  "user": "PotatoDrug",
  "time": "Dec 15, 2019 at 9:32",
  "comments": [],
  "answers_data": [
    {
      "content": "The output of rabin2 is definitely a bit cryptic, here is some of the information I found for the components that you asked about.\n\nBoolean flag that indicates if a binary is encrypted/packed\n\nIndicates that the binary performs run time relocation\n\nIndicates that virtual addressing is in use, it will be false if rabin2 is run with the -p flag\n\nThe linenum information that is present in the DWARF debug section of the ELF binary\n\nRelated to data structure alignment, could refer to the p_align member in the ELF program header. p_align gives the value to which segments are aligned in memory and in the file. The values 0 and 1 mean no alignment is required\n\nSome links that could provide more context\n\n",
      "votes": "2",
      "user": "descara",
      "time": "Nov 30, 2020 at 6:14",
      "is_accepted": true,
      "comments": []
    }
  ]
}