{
  "title": "Blank binwalk and binvis.io",
  "link": "https://reverseengineering.stackexchange.com/questions/22897/blank-binwalk-and-binvis-io",
  "content": "I've been trying to extract a Bluetooth door lock's firmware. When I tried extracting it, I got an empty output.\n\n\n\nI then found a post which I thought would help me but when I tried using binvis.io, this is what I got:\n\n\n\nI'm a newbie so that means it's empty right?\n\nSo my question is, what could've cause this to happened? Because when I extract it from a nRf51 chip using OpenOCD and ST-Link V2, it does show that what I extracted is 256kB.\n\nMy guess right now is that it is encrypted? Or could it be because im using Windows to execute this? If so, I can try using Kali Linux since I run dual boot. Or maybe I did something wrong when extracting the bin file with OpenOCD? Below is the command used.\n\n```\ndump_image stock_nrf51.bin 0x0 0x40000\n\n```\nSorry if I sound silly. Newbie here. Please let me know if I'm not being specific enough or not providing enough information. Would gladly provide them if you need them such as bin file etc.\n\n",
  "votes": "3",
  "answers": 0,
  "views": "344",
  "tags": [
    "binwalk"
  ],
  "user": "Calvin9",
  "time": "Jan 3, 2020 at 4:45",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "what does hex dump show? is it all zeroes?",
      "time": null
    },
    {
      "user": "julian",
      "text": "binwalk -E failed because you don’t have matplotlib installed",
      "time": null
    },
    {
      "user": "Calvin9",
      "text": "@IgorSkochinsky yeah, all zeroes. Any idea?",
      "time": null
    },
    {
      "user": "Calvin9",
      "text": "@julian but even if I installed matplotlib installed, I still wouldn't be able to extract it since it shows nothing right?",
      "time": null
    },
    {
      "user": "julian",
      "text": "It’s not encrypted. All zeros means you have no data and the firmware dump was not successful",
      "time": null
    }
  ],
  "answers_data": []
}