{
  "title": "Is there a way to confirm and decompress files that I suspect are compressed with a very early format of PKZIP?",
  "link": "https://reverseengineering.stackexchange.com/questions/22925/is-there-a-way-to-confirm-and-decompress-files-that-i-suspect-are-compressed-wit",
  "content": "I have a very large number of files (tens of thousands) who's binary all begins with 0x00 0x06.  They do not open with 7-ZIP.  I notice also that all Office files seem to share the same next 32 bytes.\n\n```\nA03D8B002E542C0DE10000C41EF0016000007FFF120030483E09F883AD3C0362\n\n```\nIt is a very old format, so I cannot find a decompression program, and do not even know how to confirm that it is the indeed an old PKZIP format.\n\nThe compressed file is indeed compressed by about 50%.\n\n",
  "votes": "5",
  "answers": 2,
  "views": "2k",
  "tags": [
    "file-format",
    "encryption",
    "decompress"
  ],
  "user": "youcantexplainthat",
  "time": "Jan 9, 2020 at 12:41",
  "comments": [
    {
      "user": "Avery3R",
      "text": "Do the file contents start with PK?",
      "time": null
    },
    {
      "user": "youcantexplainthat",
      "text": "No, with 0x00 0x06",
      "time": null
    },
    {
      "user": "tibar",
      "text": "Do you have the application that created those files ? Can you share one of them ? There are plenty of pkzip-like compression programs out there, so we would need more context to actually provide something meaningful.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "On Linux, creating a fake file using\n\n```\nperl -e 'print \"\\x00\\x06\\xde\\xad\\xbe\\xef\";' > foo\n\n```\nand running file foo yields\n\n```\nfoo: TTComp archive data\n\n```\nThen it's easy: http://fileformats.archiveteam.org/wiki/TTComp_archive which says that it used the early PKWARE \"implode\" algorithm\n\nThere are decoders for it, for example this one written in Go.\n\n",
      "votes": "2",
      "user": "Leo B.",
      "time": "Jan 14, 2020 at 23:42",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I would first confirm the file format. Without the entire file this is difficult. Recommend you run the application through a signature based identification program to identify matches.\n\nFor example TridNet which detects over 12,000 different file types:\n\nTriDNet\nOnline TriDNet\n\nBased on the file bytes provided (which may not be sufficient to determine) expect file type is TTComp archive compressed (bin-4K).\n\nIf TTComp format, the first byte 0x0 indicates binary file; 0x06 indicates a 4096 byte dictionary which was the most common size dictionary for this file type. \nThese files can be decompressed with TTDecomp \n\n",
      "votes": "1",
      "user": "chentiangemalc",
      "time": "Jan 15, 2020 at 6:40",
      "is_accepted": false,
      "comments": []
    }
  ]
}