{
  "title": "ARMv8 (AArch64, ARM64) opcodes list",
  "link": "https://reverseengineering.stackexchange.com/questions/23030/armv8-aarch64-arm64-opcodes-list",
  "content": "I'm sorry for such as questions where answer would seem to be easily searched in google...\n\nSome time ago I have seen table/list of ARMv8 instructions with opcodes and it was perfect, but I lost link. Now I'm trying to find at least some sources where opcodes of instructions listed and can't.\n\nThere're some C headers, where opcodes defined in non-readable form, lot of different scientific publications with 1k+ pages (containing no opcodes), etc., but I can't find simple list.\n\nCould somebody point me?\n\n",
  "votes": "12",
  "answers": 3,
  "views": "16k",
  "tags": [
    "assembly",
    "arm",
    "arm64"
  ],
  "user": "Olvin Roght",
  "time": "Jan 17, 2020 at 14:43",
  "comments": [],
  "answers_data": [
    {
      "content": "This doc may be interesting for you:\nhttps://github.com/CAS-Atlantic/AArch64-Encoding\n\n",
      "votes": "11",
      "user": "Axifive",
      "time": "Jan 17, 2020 at 16:14",
      "is_accepted": true,
      "comments": [
        {
          "user": "Olvin Roght",
          "text": "It's definitely better source that I provided. Thank you a lot!",
          "time": null
        }
      ]
    },
    {
      "content": "Eureka!\n\nHERE IS THIS TABLE\n\nP.S. It's really hard to google it (keywords I used - \"b arm64 opcode\"), so I decided to post it as answer. Hope it'll be helpful for others.\n\n",
      "votes": "7",
      "user": "Olvin Roght",
      "time": "Jan 17, 2020 at 15:01",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "The canonical source is the ARM Architecture Reference Manual. \nIf you prefer machine readable format, the  XML files are available too. \n\n",
      "votes": "5",
      "user": "Igor Skochinsky",
      "time": "Jan 18, 2020 at 21:12",
      "is_accepted": false,
      "comments": [
        {
          "user": "Olvin Roght",
          "text": "Yes, I've tried to work with official docs, but it takes too much time to extract needed information (at least for me), that's why I searched for something well structured with minimal amount of information doesn't related to subject. But anyway thank you for sharing links to official documents, it definitely will be useful for future researchers.",
          "time": null
        },
        {
          "user": "Biswapriyo",
          "text": "@OlvinRoght For my case the accepted answer does not provide any useful info about the opcodes. The above ARM manual does it well. Here is a direct link static.docs.arm.com/ddi0596/a/….",
          "time": null
        },
        {
          "user": "Olvin Roght",
          "text": "@Biswapriyo It means that our cases are completely different. I've needed opcodes for patching obfuscated application and even table I provided in my answer was enough.",
          "time": null
        }
      ]
    }
  ]
}