{
  "title": "How should I go about investigating an IC's functionality without destroying it?",
  "link": "https://reverseengineering.stackexchange.com/questions/230/how-should-i-go-about-investigating-an-ics-functionality-without-destroying-it",
  "content": "I found a 14 pin integrated circuit with no visible markings. I have no information about its functioning. How should I go about trying to explore its functionality without destroying it ?\n\nI have a lot of analog components such as resistors, capacitors and inductors, a variable power source (1V-14V) and a multimeter at hand.\n\n",
  "votes": "8",
  "answers": 1,
  "views": "251",
  "tags": [
    "hardware",
    "integrated-circuit"
  ],
  "user": "asheeshr",
  "time": "Apr 13, 2017 at 12:49",
  "comments": [
    {
      "user": "nopnopgoose",
      "text": "From your discussion of components on hand, it sounds like the chip is loose, but if it is on a PCB you can make assumptions based on what parts the pins are wired to.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Given you have a 14 pin package it could be almost anything from a op-amp(s) to 74XX series logic.\n\nStart with a continuity tester and see if there are any pins that are obviously shorted together.  If so that would be a big hint that they maybe power rails.  Also look for common pinouts (Vcc, Vss on corners pins 7,14 etc.).  THen use a diode checker and to determine the connectivity of these pins, where to you see opens and shorts, Vforward etc.  You will start to see which pins are wired and likely which are +'ve rails and ground -'ve rails.  Do keep in mind that there will be ESD protection diodes you will see.  If there are no diodes at all then there is a chance that that pin might be a Analog input.\n\nNext set your power supply current limit to very low and power up the device via the pins that you thing are the rails.  Be aware that you can power up a device through an input pin through the ESD structures, but that is noticeable because outputs will have a output voltage that is one diode drop below rails on them.  Increase current limit and test probe and slowly work your way into understanding the chip, eliminating possibilities as you go.  IS it an op-amp or logic?  An open loop op-amp will act somewhat \"digital\" but probably won't go to the rails.\n\nThe permutations and combinations of possibilities and techniques rapidly expand from this point forward.\n\n",
      "votes": "10",
      "user": "placeholder",
      "time": "Mar 24, 2013 at 16:56",
      "is_accepted": true,
      "comments": [
        {
          "user": "rslite",
          "text": "I just want to add that if the IC has anything but a simple function to execute (for example is it's a microcontroller) you won't be able to infer too much using black box testing.",
          "time": null
        }
      ]
    }
  ]
}