{
  "title": "Protected shell in embedded linux",
  "link": "https://reverseengineering.stackexchange.com/questions/23111/protected-shell-in-embedded-linux",
  "content": "When I run telnetd -l /bin/sh on an embedded Linux device and use Putty to telnet to it, the provided shell is /bin/psh (protected shell).\n\nOn this device, /bin/sh is a symbolic link to /bin/busybox.\n\nWhere I can see on this system that /bin/sh redirects to /bin/psh?\n\nHow can I change it if /bin is read only?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "765",
  "tags": [
    "linux",
    "embedded"
  ],
  "user": "Meryy",
  "time": "Jan 26, 2020 at 20:35",
  "comments": [
    {
      "user": "multithr3at3d",
      "text": "Maybe the user's shell is set to /bin/psh in /etc/passwd?",
      "time": null
    },
    {
      "user": "Meryy",
      "text": "@multithr3at3d no. There is /bin/sh",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@Meryy that's not the point. The point was whether the user is configured to use /bin/psh when logging in. That is, /etc/passwd has the shell set that way (see chsh on full-blown systems). Typically your alternative shells will also have to be in /etc/shells so as to be eligible as login shells.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "First you can ask where the shell lies with which sh. The command tells the full path. \n\nThen, you can use ls - al to view whether or not that is a symbolic link on its own or not.\n\nOnce you have found the original shell you know whether or not it fits your need.\n\nTo change the shell for the user you are using, you have plenty of choices, depending on whether or not you are root. Have a look here to have an idea.\n\nIf, instead, you want to change where the symbolic link points, you can you have to be root and use the ln command. Keep in mind that changing the shell in this way can have serious unwanted consequences. \n\n",
      "votes": "1",
      "user": "Yennefer",
      "time": "Feb 7, 2020 at 6:43",
      "is_accepted": false,
      "comments": []
    }
  ]
}