{
  "title": "Sniffing vacuum cleaner",
  "link": "https://reverseengineering.stackexchange.com/questions/23163/sniffing-vacuum-cleaner",
  "content": "First of all I'm a noob. I have a basic cheap chinese vacuum cleaner robot. I want to be able to use it from anything but the official app, but I am not intelligent enough to make a custorm firmware or anything like that to avoid the servers. So I thought \"it will be easy, just sniff the traffic from the APP and then replicate it from a python script or whatever\". I did that with mitmproxy. I am able to see the login process(url and parameters), and some other actions of the APP. However when I click on \"start cleaning\", the robot starts moving but the APP doesn't seem to send anything according to mitmproxy.\n\nAny advice about what to look for or how does it work?\n\nThank you in advice.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "225",
  "tags": [
    "sniffing"
  ],
  "user": "JohnSpa",
  "time": "Jan 31, 2020 at 22:01",
  "comments": [
    {
      "user": "multithr3at3d",
      "text": "More information needed; does the app ever try to connect directly over the local network not using HTTP?",
      "time": null
    },
    {
      "user": "JohnSpa",
      "text": "Hi thank you for your answer. I don't know how to check what you say. All I know is that mitmproxy doesnt show anything when click on \"start cleaning\". Obviously it has to comunicate with the robot in some way but I dont know how to check it.",
      "time": null
    },
    {
      "user": "multithr3at3d",
      "text": "what kind of phone do you have? Is it rooted? If so, you could do a packet capture and sniff all traffic from it. Otherwise, you will need to sniff traffic on your network in some other way, perhaps by using ARP spoofing to become a man in the middle.",
      "time": null
    },
    {
      "user": "multithr3at3d",
      "text": "Also more info about the vacuum/app could help.",
      "time": null
    },
    {
      "user": "JohnSpa",
      "text": "Hi, I am already sniffing the traffic with mitmproxy but I only see the login request that the app do to the server, any other activity (like \"start cleaning\") is not logged on mitmproxy.  The robot is a Jisiwei i3",
      "time": null
    }
  ],
  "answers_data": []
}