{
  "title": "How to reverse engineer an exe built using nexe?",
  "link": "https://reverseengineering.stackexchange.com/questions/23186/how-to-reverse-engineer-an-exe-built-using-nexe",
  "content": "I am working on an express application. I obfuscate the source code using javascript-obfuscator.\nI am using nexe cli for generating a single exe from the obfuscated code. Can anyone tell me if there is any way to reverse engineer the exe genertaed by nexe?\n\nThanks in advance!!!\n\n",
  "votes": "3",
  "answers": 2,
  "views": "4k",
  "tags": [
    "decompilation",
    "obfuscation",
    "deobfuscation",
    "security"
  ],
  "user": "Krish",
  "time": "Feb 4, 2020 at 13:47",
  "comments": [
    {
      "user": "Ian Cook",
      "text": "Yes. If it's runnable, it's possible to reverse engineer it.",
      "time": null
    },
    {
      "user": "tmr232",
      "text": "Are you looking for a \"yes\", or something more detailed? Please try and be specific as to what you're looking for.",
      "time": null
    },
    {
      "user": "Krish",
      "text": "@tmr232 I want to know if it is possible to reverse-engineer the exe generated by nexe, then what tool/method should be used to test it?",
      "time": null
    },
    {
      "user": "Cync 7X",
      "text": "I think yes. But it would require a lot of time.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Yes. nexe embeds the code in the built binary. Here's a simple example\n\n```\nroot@67989c78b131:/tmp# echo \"console.log('habibibibi');\" | nexe --build\nℹ nexe 4.0.0-beta.17\n✔ Already downloaded...\n✔ Compiling result\n✔ Entry: '[stdin]' written to: tmp\n✔ Finished in 0.24s\nroot@67989c78b131:/tmp# ./tmp\nhabibibibi\nroot@67989c78b131:/tmp# strings tmp | grep habibi\n    })();;console.log('habibibibi');<nexe~~sentinel>\nroot@67989c78b131:/tmp#\n\n```\nSo a simple hex editor would be enough to extract js code from it and defeat nexe. javascript-obfuscator on the other hand would be a bit trickier but motivated attackers can do that too.\n\n",
      "votes": "1",
      "user": "sudhackar",
      "time": "Nov 18, 2021 at 9:26",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Of course there is.\n\nI will quote an example of the py2exe or PyInstaller module of Python that “converts” Python code to executable, or also of most Java to exe that convert Java files to executables – what happens in reality is that a compressed executable is created, that is, your environment is copied into an executable to run.\n\nFollowing my examples, if you take any Java executable converted to executable and extract it, you will get the equivalent of a JVM runtime, similar to the Python example, and if you have dazzled, some types of obfuscation are very simple to remove, so choose well.\n\n",
      "votes": "0",
      "user": "MarianD",
      "time": "Dec 26, 2021 at 0:23",
      "is_accepted": false,
      "comments": [
        {
          "user": "Happy",
          "text": "Read this for an nice exemple: blog.nviso.eu/2017/01/03/decompiling-py2exe-executables/….",
          "time": null
        }
      ]
    }
  ]
}