{
  "title": "Freely available resource hacking applications",
  "link": "https://reverseengineering.stackexchange.com/questions/2319/freely-available-resource-hacking-applications",
  "content": "I am using Resource Hacker as a tool to extract out resources like icon, images, etc. from .dll or .exe file. In addition, I am using it to crack some small Windows application. However, it does not work with all Win32 Application, especially with those that are zipped by .exe compressor.\n\nAre there any other open source applications, that I can use to crack and extract resources out of .dll and .exe files?\n\n",
  "votes": "13",
  "answers": 5,
  "views": "19k",
  "tags": [
    "tools",
    "windows",
    "dll",
    "executable",
    "pe-resources"
  ],
  "user": null,
  "time": "Jun 25, 2013 at 13:55",
  "comments": [
    {
      "user": "ekse",
      "text": "Regarding compressed binaries, you will probably need to unpack them before you can use tools on them.",
      "time": null
    },
    {
      "user": "Rolf Rolles",
      "text": "Though not open source, another option is Resource Hacker:  angusj.com/resourcehacker",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "If the previously suggested resource editors aren't to your liking, you can find descriptions and reviews of several resource editors here: http://www.woodmann.com/collaborative/tools/index.php/Category:Resource_Editors\n\nIn case you have trouble accessing that page (as per the comments below), here is the list of resource editors as of 2022-10-12:\n\nPS: Woodman.com was referenced a few times above and archived versions of it can be found here\n\n",
      "votes": "10",
      "user": "5 revs, 2 users 54%Jason Geffner",
      "time": "Oct 12, 2022 at 10:20",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "You can use ResEdit which is a resource editor for Windows programs available in both 32 Bit and 64 Bit versions.\n\nYou can download this freeware application from this link\n\n",
      "votes": "4",
      "user": "Stolas",
      "time": "Jun 25, 2013 at 9:30",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I personally recommend CFF Explorer for reversing purposes as it provides a large volume of additional information on a binary.\n\n\n\n",
      "votes": "4",
      "user": "Ditmar Wendt",
      "time": "Jul 2, 2013 at 8:14",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "\n\n\n\n",
      "votes": "4",
      "user": "3 revs, 3 users 89%Mick",
      "time": "Oct 12, 2022 at 10:12",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "Not true that it's not under a free license, see here",
          "time": null
        }
      ]
    },
    {
      "content": "I am not so sure what you mean with \"zipped by .exe compressor\", but if you mean packed executables, then the easiest to EXTRACT packed resources is as follows:\n\nN.B.: You can try with more than one Resource editor e.g. ResEdit since many resource editors out there follow weird rules for PE header as they only expect typical PE headers.\n\nIronically, one resource editor expects the resources to be embedded in a section named .rsrc, otherwise it rejects them. Others don't see resources if embedded in a section marked as IMAGE_SCN_CNT_UNINITIALIZED_DATA 0x80.\n\nOne the other hand if you can attach to the running process without problems (No or bypassed Anti-Attaching tricks), you can use OllyDbg v1.10 for that as follows:\n\nHope it helps\n\n",
      "votes": "1",
      "user": "waliedassar",
      "time": "Jun 26, 2013 at 15:39",
      "is_accepted": false,
      "comments": [
        {
          "user": "khk",
          "text": "Yes... I mean packed execuable files, anyway thanks for your contribution.",
          "time": null
        }
      ]
    }
  ]
}