{
  "title": "No false positive on binwalk",
  "link": "https://reverseengineering.stackexchange.com/questions/23371/no-false-positive-on-binwalk",
  "content": "I have the same problem from my previous post but this time, I don't think it's the same culprit again as I have solved the problems.\n\nThis time, I'm very sure I had extracted the firmware. On my hexdump, here is what I got:\n\n\nOn binvis.io:\n\n\n\nAnd lastly, binwalk:\n\n\nFrom the entropy, it shows that it's compressed rather than encrypted, right?\n\nI tried to ignore the false positive and decided to proceed disassembling with Ghidra. But I got tons of error (I think so) because there were red and orange indicator on the side scroll bar, in the code browser, like the one you would get in Android Studio if there's an error.\n\nOn other websites, I found out that getting an output from the false positive is a crucial part to extract/disassemble.\n\nSo what seems to be the problem? Do I have to install something like matplotlib for it to work? If there's anything you want me to add, please don't hesitate to let me know. Thanks in advance.\n\nOh, it's a firmware from a Smart Door Lock using a nRF51802 if it matters.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "339",
  "tags": [
    "firmware",
    "binwalk"
  ],
  "user": "Calvin9",
  "time": "Mar 2, 2020 at 4:41",
  "comments": [
    {
      "user": "julian",
      "text": "Entropy close to 1 would indicate compression or encryption. Correct disassembly requires identifying the right target architecture of the code as well as the correct image base/entry point",
      "time": null
    },
    {
      "user": "Calvin9",
      "text": "Any advice on where/how I should start? I'm feeling rather lost when all the guides I referred to has output on their false positive and would let them to proceed to the next step.",
      "time": null
    },
    {
      "user": "julian",
      "text": "nordicsemi.com/Products/Low-power-short-range-wireless/nRF51802, leveldown.de/blog/svd-loader, youtu.be/q4CxE5P6RUE",
      "time": null
    },
    {
      "user": "Calvin9",
      "text": "Thanks! I'll start there and see where it goes.",
      "time": null
    },
    {
      "user": "Calvin9",
      "text": "@julian hello there again. I still don't understand why I still get a lot of error bookmark after analyzing. Should I ignore it? I have not seen anyone having this problem on the net. Here's my file to see what I meant: filebin.net/059ks2hdhl9b9qkt  Architecture used was the Arm v6 LE 32-bit",
      "time": null
    }
  ],
  "answers_data": []
}