{
  "title": "How to dump flash memory with SPI?",
  "link": "https://reverseengineering.stackexchange.com/questions/2337/how-to-dump-flash-memory-with-spi",
  "content": "Often flash memory is connected via SPI (Serial Peripheral Interface Bus) to a processing unit like an ARM core or a micro controller.\n\n",
  "votes": "22",
  "answers": 1,
  "views": "34k",
  "tags": [
    "hardware",
    "spi"
  ],
  "user": "samuirai",
  "time": "Jun 26, 2013 at 11:30",
  "comments": [
    {
      "user": "cb88",
      "text": "This question is too general. Acessing an SPI flash is practically trivial. And if you want any more specifics you should be refering to the datasheet of your device rather than stackexchange. If you had a question about a specific device.... that might be easier to answer.",
      "time": null
    },
    {
      "user": "samuirai",
      "text": "It may be trivial for you, but it may be not trivial for others. For some people it is the first time they do this and they are seeking for guidance. Why not have some general tips on this RE Q&A site? Dumping flash memory is a common task in reversing hardware. So ew coukd point at the BusPirate or Arduino code to do it. My question is an attempt to get hardware more exposure.",
      "time": null
    },
    {
      "user": "cb88",
      "text": "Then they should ask on the EE stackexchange. There is no reason to ask a question about something that is most likely plainly documented on RE. If someone does ask a question about a specific device then they will be welcome to do so otherwise the quesiton turns into a list of datasheets essentially!",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "EE people often have labs with special hardware and know exactly which chips they're dealing with. In short, they don't necessarily operate in similar conditions. An answer from RE viewpoint will be useful.",
      "time": null
    },
    {
      "user": "Cybergibbons",
      "text": "I think this is a relatively good question - there are a number of points that can be raised like in-situ reading or removed, reading out entire contents vs sniffing in use.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Although I think the questions are too broad and I agree with @cb88 that the datasheet should give you all you need to know, I'll try to answer some.\n\nYou can also use a clip that is designed to attach the analyzer to the chip in-system.\n\nIn general I'd really recommend to desolder the chip. They're almost, if not always edge packaged (e.g. having clearly visible pins on the outside of the package) and not Ball Grid Array (BGA) packages. This makes them easy to remove and also easy to put back. It will save you the headaches you might encounter that I described in the pitfalls section below.\n\nSome things to keep in mind;\n\n",
      "votes": "25",
      "user": "Elan Hasson",
      "time": "Jun 30, 2016 at 8:27",
      "is_accepted": false,
      "comments": [
        {
          "user": "frunk420",
          "text": "I would first see if I couldn't just hold the processor in reset and then just scan out the spi port. No point in desoldering a whole chip when you can force it into high-z. The other note would be see if there are any zero ohm/100ohm inline resistors on the clk/ SDI/SDO pins and remove those if so and replace with your probe. But good comments... just some additional things to think about.",
          "time": null
        }
      ]
    }
  ]
}