{
  "title": "How to call strongly encrypted DLL from Resources?",
  "link": "https://reverseengineering.stackexchange.com/questions/23378/how-to-call-strongly-encrypted-dll-from-resources",
  "content": "There is a program. This program accepts plugins. Plugins written with C#. I have to encrypt it. But when I use strong obfuscators I have exception. Program doesn't read. How can I fix that ? How can I call strongly encrypted dll from an application. Just confuserex working but its not strong enough. \n\n```\n private static void LoadDll(byte[] dll, string namespacePlusClass)\n        {\n            try\n            {\n                var a = Assembly.Load(dll);\n                var myType = a.GetType(namespacePlusClass);\n                var methon = myType.GetMethod(\"Main\", BindingFlags.Public | BindingFlags.Static);\n\n                if (methon != null)\n                {\n                    methon.Invoke(null, null);\n                }\n            }\n            catch (Exception ex)\n            {\n                Console.WriteLine(ex);\n            }\n        }\n\n```\n",
  "votes": "0",
  "answers": 0,
  "views": "142",
  "tags": [
    "dll",
    "encryption",
    "obfuscation"
  ],
  "user": "dfsvs",
  "time": "Mar 3, 2020 at 16:20",
  "comments": [
    {
      "user": "Robert",
      "text": "Why do you \"have to encrypt\" your plugin dll? If the main app requires it then it should exactly specify how to encrypt it.",
      "time": null
    },
    {
      "user": "dfsvs",
      "text": "yes but program isn't mine so it doesn't expect that way.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "Hi and welcome to RE.SE. Now please be specific are we talking encryption or obfuscation. Either one is likely not used and your wording suggests just that. Obfuscation is merely the attempt to hide something from plain view. Encryption requires some sort of key as additional ingredient. And what's more, encryption in a scenario like the one you describe makes little to no sense. That software would have to carry the private key (or passphrase) in order to decrypt anything. So this makes the whole exercise pointless.",
      "time": null
    },
    {
      "user": "dfsvs",
      "text": "Obfuscation I meant",
      "time": null
    }
  ],
  "answers_data": []
}