{
  "title": "Tools for annotating/describing disassembly [duplicate]",
  "link": "https://reverseengineering.stackexchange.com/questions/2381/tools-for-annotating-describing-disassembly",
  "content": "When using IDA Pro, there are a number of features that can be used to make reading the disassembled code far easier - renaming variables, defining data structures, colouring blocks of code, moving blocks of code about (in addition to the graph, which is very useful).\n\nIf you use a conventional disassembler, this isn't available.\n\nTraditionally, I would use a combination of printed out code and pencil along with annotated text files to analyse the disassembly, but I feel this is a long way from what IDA Pro provides.\n\nAre there any tools to make this job easier? I am not looking for alternative graphical disassemblers to IDA as there will always be times when you are limited to the output from tools such as objdump or proprietary command line utilities.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "1k",
  "tags": [
    "tools",
    "disassembly"
  ],
  "user": "Cybergibbons",
  "time": "11 years ago",
  "comments": [
    {
      "user": "Jason Geffner",
      "text": "\"there will always be times when you are limited to text listings\" -- I'm not sure I agree with this. Aside from people posting short snippets of assembly code on forums such as this one from time to time, I find I'm never \"limited to text listings.\" Can you provide more context regarding the situations in which you find yourself?",
      "time": null
    },
    {
      "user": "PSS",
      "text": "Are you trying to find improved ways to document your work ? Please clarify.",
      "time": null
    },
    {
      "user": "Cybergibbons",
      "text": "PSS, I'm looking for tools to help read, annotate, describe and work with disassembled code.",
      "time": null
    },
    {
      "user": "Cybergibbons",
      "text": "Jason Geffner, if I objdump some code from a hex file, all I am left with is a text listing of disassembly.",
      "time": null
    },
    {
      "user": "Jason Geffner",
      "text": "@Cybergibbons - If you want to annotate a disassembly then you should be using IDA, not objdump. A big part of reverse engineering is using the right tool for the right job.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I agree with comments above. IDA Pro does offer everything one might need to annotate your work and keep it organized. IDA Pro offers four types of comments: \n\nIt almost feels like you are trying to find ways to improve your workflow. What makes the most sense to me is to have your workflow organized in certain predetermined and structured way, get consistent with it, and constantly improve on it.\n\nSeveral things might help you organize your workflow:\n\nEventually, we are users, who 'drive' tools. \nRemember, at times a great tool is as good as one who uses it ;)\n\n",
      "votes": "5",
      "user": "PSS",
      "time": "Jun 30, 2013 at 2:21",
      "is_accepted": false,
      "comments": [
        {
          "user": "Cybergibbons",
          "text": "Thanks, this is a great answer. Can you load arbitrary disassembly into IDA? All three microcontrollers I am working with at the moment aren't supported, and writing a new processor module seems very time consuming.",
          "time": null
        },
        {
          "user": "PSS",
          "text": "I am not sure. I never had to deal with anything that IDA doesn't support in my line of work. It is a great question to ask next though :)",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "\"writing a new processor module seems very time consuming\" - You may want to take a look at hexblog.com/?p=116 - still time consuming, but hopefully less so.",
          "time": null
        },
        {
          "user": "PSS",
          "text": "@cybergibbons You should consider opening another question and provide specifics on what microcontroller you are working with.",
          "time": null
        }
      ]
    }
  ]
}