{
  "title": "Origin of \"Hacker Protection Factor\"",
  "link": "https://reverseengineering.stackexchange.com/questions/2384/origin-of-hacker-protection-factor",
  "content": "Dexguard claims a \"hacker protection factor\" of 35 without any explanation of where the number comes from or what it means. I figure the actual statement is meaningless, but I'm very curious to see who is assessing these protection factors. \n\nA Google search didn't turn up anything, so I thought that the Dexguard authors probably made it up themselves. But this Twitter post implies that there are other \"hacker protection factors\", out there which 35 can be compared with. \n\nDoes anyone know what the deal with this is? Is it just more pointless puffery? Is there an actual group that is assigning these numbers?\n\n",
  "votes": "5",
  "answers": 3,
  "views": "1k",
  "tags": [
    "obfuscation"
  ],
  "user": "Antimony",
  "time": "Jun 30, 2013 at 20:50",
  "comments": [],
  "answers_data": [
    {
      "content": "\"Hacker Protection Factor\" is a geeky play of words on \"Sun Protection Factor\" -- how much longer can an application be attacked before being damaged. The numbers are based on empirical evidence (\"Based on our experience,...\"). I thought it was cute; it is not an industry standard, but it does serve as a simple indication that an application processed with ProGuard is more difficult to reverse-engineer than the original application, and an application processed with DexGuard is a lot more difficult to reverse-engineer.\n\n(I am the developer of ProGuard and DexGuard)\n\n",
      "votes": "3",
      "user": "Eric Lafortune",
      "time": "Jul 4, 2013 at 2:15",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "When you look at their cheaper product you see it has it HPF of 5. Throwing with numbers or something people understand is a common trick when trying to sell something customers don't understand but want (e.g. IT security, volcano insurance).\n\nBut a rating of 35 is high. And hardly seen in the industry, other known packers like UPX, ASPack and y0da don't even have a rating of 1. So you should have a strong consideration.\n\n",
      "votes": "6",
      "user": "Stolas",
      "time": "Jul 1, 2013 at 9:27",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "shouldn't the sentence start \"Throwing with numbers or something people don't understand\"? ;)",
          "time": null
        },
        {
          "user": "Stolas",
          "text": "Oh no it should have been: \"Throwing with numbers or something people think they do understand, but don't\"  I've also heard about \"ThreatsPerSecond\" or \"ThreatIndex\". It's great for techys to convince their manager! ;)",
          "time": null
        }
      ]
    },
    {
      "content": "It's something that their marketing team made up.\n\nThere is no such \"hacker protection factor\" rating in the industry.\n\n",
      "votes": "5",
      "user": "Jason Geffner",
      "time": "Jun 30, 2013 at 21:00",
      "is_accepted": false,
      "comments": [
        {
          "user": "Rolf Rolles",
          "text": "Particularly in the area of software protection, vendors are wont to throw around meaningless and/or patently incorrect terminology in order to convince prospective buyers of the efficacy of their systems.  It's a good source of amusement to those with the ability to break them.",
          "time": null
        }
      ]
    }
  ]
}