{
  "title": "Remote Android debugging using IDA 32 bit - bind: Address already in use error",
  "link": "https://reverseengineering.stackexchange.com/questions/2411/remote-android-debugging-using-ida-32-bit-bind-address-already-in-use-error",
  "content": "When I try to get remote debugging working with IDA, using an Android emulator, I get the following error on the command prompt.\n\n```\n./android_server \nIDA Android 32-bit remote debug server(ST) v1.15.\nHex-Rays (c) 2004-2012 bind: Address already in use\n\n```\nI instead need the following: \n\n```\n./android_server IDA Android 32-bit remote debug server(ST) v1.15.\nHex-Rays (c) 2004-2012 Listening on port #23946...\n\n```\nHow do I correct this?\n\n",
  "votes": "4",
  "answers": 2,
  "views": "3k",
  "tags": [
    "ida"
  ],
  "user": "user2388",
  "time": "Jul 4, 2013 at 9:30",
  "comments": [],
  "answers_data": [
    {
      "content": "The error indicates (exactly what it states) that the android_server application failed to bind to IP address/port. What it means is that the address/port that the android_server is trying to use is most likely already used by other process or application.\n\nClearly, it is not enough of information to provide you with an exact answer. Please provide detailed information on your setup. \n\nBelow is an article of a sample setup for Android debugging with IDA:\n\nDebugging Android Libraries Using IDA\n\n",
      "votes": "3",
      "user": "PSS",
      "time": "Jul 6, 2013 at 5:16",
      "is_accepted": false,
      "comments": [
        {
          "user": "user2388",
          "text": "I followed that exact resource and steps. so how can I solve it? or to be more specific - how can I disconnect it from other process or application? please be specific regarding the exact actions I need to take in IDA and/or Android emulator as I am stack (exchange). I almost succeeded in getting it to work and they trying later with the process and steps I got this error I cannot handle.",
          "time": null
        },
        {
          "user": "PSS",
          "text": "Please describe your setup indicating what os you are running, VM, android version, IDA version, etc. What does it mean \"I almost succeeded...\"? A lot depends on how you ask a question. If you seek specific answer, you have to ask detailed question.",
          "time": null
        }
      ]
    },
    {
      "content": "You should try a different port. The bind failing simply means there is another application that uses that IP/PORT combination. The only way around such an error would be to modify the source to properly set the socket option to SO_REUSEADDR (Assuming the process using it hasnt defined SO_EXCLUSIVEADDRUSE). But that isnt possible in your case. If you are running on Windows, and have VM available, try a clean install of Windows, otherwise use a tool such as ProcessHacker to see if the port you are trying to use is not already in use. \n\nTLDR: Try a different IP/Port combination.\n\nAlso ensure you're running it priviledged.\n\n",
      "votes": "1",
      "user": "gandolf",
      "time": "Jul 9, 2013 at 16:31",
      "is_accepted": false,
      "comments": [
        {
          "user": "Cream Cracker",
          "text": "he is using android, not windows.",
          "time": null
        }
      ]
    }
  ]
}