{
  "title": "Windows binwalk refuses to extract files",
  "link": "https://reverseengineering.stackexchange.com/questions/24575/windows-binwalk-refuses-to-extract-files",
  "content": "I'm trying to reverse engineer the firmware for an AutoDrive AD-520 dashcam. The firmware is available for download here. I've installed binwalk on windows, I can get it to read the file just fine, here's a screenie of a regular binwalk SD_CarDV.bin\n\n \n\nHowever, if I try pretty much anything else it doesn't work. I can't do -E, it just sits there for a minute then reads out the file contents like --signature, but doesn't do anything else, and trying to save the -E to a png I get an error saying \"failed to import matplotlib module\". When I try -e, I get a readout just like with --signature, but no actual files are created in the working directory. If I use -e -C=./tmp I get the normal readout, a tmp folder is created, but no files. I've tried --dd=\".*\", as well as --log=binwalk.log, literally copied from the github manual, and I get this error (same error with -dd and --log)\n\n\n\nI can't seem to get this thing to work. I'm wondering if it's me, windows, the firmware file itself...I can't figure it out. Can anyone help me?\n\n",
  "votes": "1",
  "answers": 0,
  "views": "3k",
  "tags": [
    "firmware-analysis",
    "binwalk"
  ],
  "user": "HaLo2FrEeEk",
  "time": "Mar 31, 2020 at 0:21",
  "comments": [
    {
      "user": "Yotamz",
      "text": "The syntax for binwalk arguments is \"-arg value\", not \"-arg=value\". If you want to extract image data you have to install matplotlib library for Python. Also, not sure if that matters but \"./\" is not the correct notation in Windows. use \"C:\\\\tmp\" instead (note the double \\).",
      "time": null
    },
    {
      "user": "HaLo2FrEeEk",
      "text": "Looking at the manual, I see that -D does use that syntax, but -dd requires the = sign. Either way, I've tried both. I installed matplotlib, I can now get an output from the -E command, I had to resize it so the labels wouldn't hide the graph: i.imgur.com/WRnDo0p.png Also here's a screenshot of the command window after running the -E --verbose commands i.imgur.com/AKe0tTS.png I still can't get anything to extract though, with -e or -dd.",
      "time": null
    }
  ],
  "answers_data": []
}