{
  "title": "CreateToolhelp32Snapshot() access denied (while running as admin or even NT AUTHORITY\\SYSTEM)",
  "link": "https://reverseengineering.stackexchange.com/questions/24618/createtoolhelp32snapshot-access-denied-while-running-as-admin-or-even-nt-auth",
  "content": "I've come across a troublesome process which refuses to allow CreateToolhelp32Snapshot().\n\nI also noticed that in sysinternals process explorer it shows \"Access Denied\" for other things too, such as file path, even when running as admin or even NT AUTHORITY\\SYSTEM.\n\nDoes anyone have any idea how they could've achieved this? The only way I could think of would be using some sort of kernel mode driver and doing some voodoo magic.\n\nI'd appreciate any ideas\n\n",
  "votes": "3",
  "answers": 1,
  "views": "400",
  "tags": [
    "windows"
  ],
  "user": "Cherona",
  "time": "Apr 5, 2020 at 9:03",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "There are numerous ways to achieve this. Arguably the easiest would be to set the ACEs of the process appropriately. Being LocalSystem doesn't mean access everywhere, because that's still governed by the ACEs. However, being LocalSystem means you can forcibly take ownership of objects and basically replace whole ACLs. Other possibilities include some kind of SSDT hooking from a driver. Nebbett describesd how the ToolHelp32 APIs work and so by looking at the underlying native APIs you will get a feeling which ones could be hooked to prevent access.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "Another potential cause could be a PPL (protected process light). Which has been introduced in Windows 8, IIRC. Antimalware solutions use that sometimes. But you don't give enough details to give you more than guesses (not to mention that you answered your question).",
      "time": null
    },
    {
      "user": "Cherona",
      "text": "@0xC0000022L I apologise, i'm new to this, what sort of information and details about the process would be helpful?",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "Names, perhaps the files themselves or at least their file names and versions. Just put yourself in the shoes of someone not having access to your computer (and brain) and try to fill in all the blanks compared to the existing question. No need to apologize. The mechanism on this site used for the purpose is upvotes and downvotes. Basically the goal is to create a library of questions and answers that are useful for future visitors. And while your question certainly has some \"meat\" it provides too little of it to give you more than guesses in turn.",
      "time": null
    },
    {
      "user": "Cherona",
      "text": "@0xC0000022L You mentioned that they could've used SSDT hooking - how are they allowed to do this? Does Windows not have some sort of anti tampering in place? Or does it turn a blind eye to system drivers",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Turns out the process was using a driver, now I don't know what exactly that driver was doing (probably some voodoo magic). But it was preventing CreateToolhelp32Snapshot() and some other stuff.\n\n",
      "votes": "-1",
      "user": "Cherona",
      "time": "Apr 5, 2020 at 20:27",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "Hi and welcome to RE.SE. While this may answer your immediate question from your own perspective, it won't be helpful to any future visitors finding this answer.",
          "time": null
        }
      ]
    }
  ]
}