{
  "title": "GDB - Send Python output to the program after SIGINT",
  "link": "https://reverseengineering.stackexchange.com/questions/24610/gdb-send-python-output-to-the-program-after-sigint",
  "content": "I am trying to learn GDB to better understand buffer overflows but I can't find an answer to my problem which is how can I send a Python-generated output to the program when the program asks for user input (the gets function in my code below). I can type CTRL+C to send SIGINT but I have not found any way to send the output back to the program.\n\nSample program (disregard the buffer overflow):\n\n```\n#include \nint main(int argc, char **argv)\n{\nchar buf[8];\ngets(buf);\nprintf(\"%s  \n\", buf);\nreturn 0;\n}\n\n```\nSample Python script I want to do:\n\n```\n\npython -c \"print 'A' * 10\"\n\n```\nThe Python output I want the gets function to read:\n\n```\n\nAAAAAAAAAA\n\n```\n",
  "votes": "0",
  "answers": 1,
  "views": "2k",
  "tags": [
    "gdb",
    "python"
  ],
  "user": "Tomik",
  "time": "Apr 4, 2020 at 14:00",
  "comments": [
    {
      "user": "perror",
      "text": "You can also see this question.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can specify the input you want to pass to the program when executing \"run\" via GDB:\n\n```\n(gdb) r <<< $(python -c \"print 'A' * 10\")\n\n```\nExample:\n\n```\n(gdb) r <<< $(python -c \"print 'A' * 10\")\nStarting program: /media/sf_CTFs/stackoverflow/24610/test <<< $(python -c \"print 'A' * 10\")\nAAAAAAAAAA\n[Inferior 1 (process 953) exited normally]\n(gdb)\n\n```\n[Edit, based on comment]\n\nIf you want to be able to interactively decide what the next input you want to send is, without scripting the whole thing beforehand (and assuming that you can't or don't want to use a library such as pwntools to automate the decision process), you might be able to make use of named pipes. However I can't promise that this is the best or most convenient way. At the very least, this method is OS dependent. \n\nFirst, create a named pipe:\n\n```\nroot@kali:~# mkfifo my_pipe\n\n```\nThen, open two shells. \n\nOn one shell, redirect GDB's input as the pipe's output:\n\n```\nroot@kali:/media/sf_CTFs/stackoverflow/24610# gdb -nh test < ~/my_pipe\n\n```\nOn the other shell, open a Python REPL and connect to the named pipe:\n\n```\n>>> f = open(\"/root/my_pipe\", \"w\")\n\n```\nThe moment you open the pipe, you should see GDB get unblocked on the first shell:\n\n```\nReading symbols from test...\n(No debugging symbols found in test)\n(gdb)\n\n```\nNow, define the following function in the Python REPL:\n\n```\n>>> def cmd(f, s): f.write(s); f.write(\"  \n\"); f.flush()\n...\n\n```\nYou should be able to enter input for GDB using the newly defined cmd command. For example, to run the program, enter:\n\n```\n>>> cmd(f, \"r\")\n\n```\nThis will run the program in the other shell:\n\n```\n(gdb) Starting program: /media/sf_CTFs/stackoverflow/24610/test\nPlease enter input\n\n```\nYou can break GDB with CTRL+C, just remember that all commands need to be entered via cmd.\n\nWhen the time is right, you can send your Python command:\n\n```\n>>> cmd(f, 'A' * 10)\n\n```\nIt will be received in the other side:\n\n```\n(gdb) Continuing.\nAAAAAAAAAA\n[Inferior 1 (process 1187) exited normally]\n\n```\nDon't forget to close the named pipe when you're done:\n\n```\n>>> f.close()\n\n```\nIf this works for you, you can go ahead and create a Python script that acts as an interactive shell, instead of using the REPL.\n\n",
      "votes": "0",
      "user": "Dvd848",
      "time": "Apr 4, 2020 at 19:04",
      "is_accepted": true,
      "comments": [
        {
          "user": "Tomik",
          "text": "For this to work, if the program requested more inputs, I would have to script all inputs that are sent from STDIN. Is it possible to do this if I interrupt the program manually and then want to perform another redirection from STDIN?",
          "time": null
        },
        {
          "user": "Dvd848",
          "text": "Edited my answer with a suggestion (if I've understood your intention correctly). There might be a straightforward way to achieve the same thing which I'm not aware of.",
          "time": null
        },
        {
          "user": "Tomik",
          "text": "This is exactly what I needed, thank you. I tried it and it works. It is not as convenient and straight-forward as I hoped, but it gets the job done.",
          "time": null
        }
      ]
    }
  ]
}