{
  "title": "ld-uClibc.so.0: No Such file or directory when running qemu-mipsel-static",
  "link": "https://reverseengineering.stackexchange.com/questions/24634/ld-uclibc-so-0-no-such-file-or-directory-when-running-qemu-mipsel-static",
  "content": "BLUF: When executing sudo chroot . ./qemu-mipsel-static ./bin/busybox from the squashfs-root folder the error /lib/ld-uClibc.so.0: No such file or directory is returned. Failing to figure out how to fix the error.\n\nI am in the early stages of analyzing a firmware update for a consumer router. Busybox is included with the firmware and I am trying to see what I can run with it in an emulated environment. \n\nI see that a version of the uClibc library is included with the firmware: /lib/ld-uClibc-0.9.29.so\n\nI tried symlinking ld-uClibc-0.9.29.so to ld-uClibc.so.0 but I receive ln: failed to create symbolic link 'ld-uClibc.so.0': Operation not permitted so my understanding of the symbolic linking process in this context is certainly coming up short.\n\nHow can I get qemu-mipsel-static to recognize the library? Do I need to install a different library?\n\n",
  "votes": "0",
  "answers": 2,
  "views": "4k",
  "tags": [
    "qemu"
  ],
  "user": "garv",
  "time": "Apr 6, 2020 at 20:35",
  "comments": [],
  "answers_data": [
    {
      "content": "You need to pass the path to the device files directory using the -L switch\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Apr 7, 2020 at 22:13",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "The issue turned out that the directories I was working in were mounted as a share in a VirtualBox guest. By default symbolic linking is not enabled on a shared folder as the host OS might not be able to understand a symbolic link. More information can be found here in the second comment: https://www.virtualbox.org/ticket/18572?cversion=0&cnum_hist=2\n\nMy problem was solved once enabling symbolic linking for my shared drive and then creating a symbolic link from squashfs-root/lib/ld-uClibc-0.9.29.so to squashfs-root/lib/ld-uClic.so.0\n\n",
      "votes": "0",
      "user": "garv",
      "time": "Apr 8, 2020 at 20:16",
      "is_accepted": true,
      "comments": []
    }
  ]
}