{
  "title": "ASLR and its effect",
  "link": "https://reverseengineering.stackexchange.com/questions/24727/aslr-and-its-effect",
  "content": "I was debugging some programs with gdb, I already set the disable-randomization to on, but I was having trouble, I set a break point and examined that the $sp is different everytime, what causes this randomization besides ASLR?\n\n",
  "votes": "1",
  "answers": 2,
  "views": "480",
  "tags": [
    "gdb"
  ],
  "user": "Sumanto Dinar",
  "time": "Dec 20, 2024 at 15:49",
  "comments": [
    {
      "user": "multithr3at3d",
      "text": "It's different every time you run it, or is the breakpoint reached multiple times within a single run? I suspect you mean the former.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "ASLR causes the base executable and external libraries (.so, .dll, etc) to load at random base addresses in order to make exploitation harder.\n\nThe stack is not part of the loaded image, it is dynamically allocated when the process starts. The changes of stack address is not related to ASLR.\n\n",
      "votes": "1",
      "user": "Yotamz",
      "time": "Apr 17, 2020 at 9:36",
      "is_accepted": false,
      "comments": [
        {
          "user": "multithr3at3d",
          "text": "Not quite. ASLR definitely does affect loading of stack and heap as well.",
          "time": null
        },
        {
          "user": "Yotamz",
          "text": "When enabled it affects the stack and heap (and other mmap'd areas) as well, but not the other way around. These pages will have some randomization by their nature even when ASLR is disabled.",
          "time": null
        },
        {
          "user": "multithr3at3d",
          "text": "sure, but with ASLR disabled, you should be able to run a simple program multiple times and have the stack addresses remain constant. I just confirmed on my system. Look at some simple no-NX buffer overflow challenges; they also depend on the behavior of stack addresses remaining the same between runs.",
          "time": null
        }
      ]
    },
    {
      "content": "So, the address stored in your stack-pointer ($sp) is greatly dependent of the environment variables which are stored prior to the main() function in the stack (due to the envp argument used in main(int argc, char* argv[], char* envp[]).\n\nIf you change the size of some environment variables, it may push down or up the beginning of your stack a little and this change may be amplified if you enter many functions inside your program.\n\nThe main reason the position of $sp may change at start include (not exhaustive):\n\nTo render the stack addresses more reliable, try to avoid changing the initial conditions (where you execute the binary and the arguments passed to the binary) and you may unset some variables (unset in gdb). For example:\n\n```\n$> gdb ./mybinary\n...\n(gdb) unset LINES\n(gdb) unset COLUMNS\n(gdb) run\n\n```\n",
      "votes": "0",
      "user": "perror",
      "time": "Dec 18, 2024 at 16:50",
      "is_accepted": false,
      "comments": []
    }
  ]
}