{
  "title": "What are some ways to pass raw bytes to a program via the Linux terminal?",
  "link": "https://reverseengineering.stackexchange.com/questions/24755/what-are-some-ways-to-pass-raw-bytes-to-a-program-via-the-linux-terminal",
  "content": "I want to pass raw bytes to a (C) program using the Linux Bash shell. I find that when I try to pass for example \"\\x00\\xFF\\xAB\", the program receiving the input actually gets the ASCII character codes for the string, rather than interpret them as the raw bytes.\n\nOne way I've seen people accomplish this is by calling python -c 'print(\"\\x00\\xFF\\xAB\")' and piping output to the program under test. Is there a way to do this without using Python by just using the Bash shell?\n\n",
  "votes": "15",
  "answers": 2,
  "views": "11k",
  "tags": [
    "binary-analysis",
    "binary",
    "fuzzing"
  ],
  "user": "the_endian",
  "time": "Apr 23, 2020 at 5:12",
  "comments": [
    {
      "user": "bart1e",
      "text": "You can use ‘printf \\xbb’, where you replace ‘bb’ by the byte you want. The only problem is, you cannot pass null byte this way.",
      "time": null
    },
    {
      "user": "the_endian",
      "text": "Ah thanks do you know how I could pass a null byte?",
      "time": null
    },
    {
      "user": "bart1e",
      "text": "Unfortunately, I don't. :/",
      "time": null
    },
    {
      "user": "the_endian",
      "text": "@bart1e thanks I don't think there is a way to do it like this. For null bytes I may have to run execve manually and pass the args I believe.",
      "time": null
    },
    {
      "user": "rici",
      "text": "@bart1e: you can print NUL bytes with printf. You just can't save them in a variable.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Use echo -e and pipe to your program's input.\n\nExample:\necho -e \"\\x41\\x42\\x43\\x44\" | <executable>\nWill write ABCD as input.\n\nedit:\nYou can pass null-bytes\n\n",
      "votes": "11",
      "user": "Yotamz",
      "time": "Apr 19, 2020 at 9:53",
      "is_accepted": true,
      "comments": [
        {
          "user": "Woodrow Barlow",
          "text": "would you mind adding an example on how to pass bytes as an argument to the executable?",
          "time": null
        },
        {
          "user": "Yotamz",
          "text": "Put the echo -e command after the executable name, surrounded by backticks: (`). Null bytes are ok in this method too. (Newline chars, however, will break the string)",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@Yotamz yikes ... backticks? That's so 1990s. Drop the backticks and use $(...) to dodge the escaping nightmare that ensues as soon as you start nesting backticks ... null bytes will work in arguments? I find that surprising, since they're treated as zero-terminated. Can you substantiate that claim?",
          "time": null
        },
        {
          "user": "Yotamz",
          "text": "Yes, tried it with ls, echo -e \"\\x2E\\x2E\" (ls ..) works the same as ls with echo \"\\x2E\\x00\\x2E\", even though it supposedly ends the string. I'd expect the latter to be treated as just \"\\x2E\" and list the current folder but it doesn't. I agree with you on the backticks-escaping though.",
          "time": null
        }
      ]
    },
    {
      "content": "If you need null bytes, you can write them to a file and use the file as input for the program, e.g.:\n\nYou can use also use xxd to convert hex to binary:\n\n",
      "votes": "18",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": false,
      "comments": [
        {
          "user": "Hermann",
          "text": "Upvoted for the use of xxd – it is much more convenient without the backslashes.",
          "time": null
        }
      ]
    }
  ]
}