{
  "title": "Recognize binary architecture",
  "link": "https://reverseengineering.stackexchange.com/questions/24795/recognize-binary-architecture",
  "content": "I have binary that run on Arm Thumb cpu, in embedded devive that not running Linux.\n\nWhen I tried to run bimwalk or file ,and even open it with Ida ,but they didn't find out that this binary run on Arm processor.\n\nI succeed open it with Ida only when I look on the Cpu board and find out this is Arm.\n\nIs there any tool(without look on Cpu board)  that can find out know which processor is for to binary?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "ida",
    "binary-analysis",
    "arm",
    "binwalk"
  ],
  "user": "yfr24493AzzrggAcom",
  "time": "Apr 22, 2020 at 20:15",
  "comments": [],
  "answers_data": [
    {
      "content": "Binwalk has this feature but you need to enable it explicitly:\n\nA project which explicitly tries to determine an architecture of a given binary is cpu_rec from Airbus. \n\nPlease note that both solutions can only handle a small set of processors: binwalk has a short list of hardcoded opcode sequences and cpu_rec relies on a small corpus of training files. If your binary uses unusual instructions or processor it might be not recognized. \n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Apr 22, 2020 at 20:58",
      "is_accepted": false,
      "comments": [
        {
          "user": "yfr24493AzzrggAcom",
          "text": "What do you mean unusual instructions? In Arm for example there are list of instruction that can be used.    Which one of those tools do you recommend?",
          "time": null
        },
        {
          "user": "julian",
          "text": "ISAdetect is far superior to cpu_rec. Paper: Towards usable automated detection of CPU architecture and endianness for arbitrary binary files and object code sequences",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "@julian feel free to add your own answer with detailed description and maybe some comparisons",
          "time": null
        }
      ]
    }
  ]
}