{
  "title": "Decompile and recompile C?",
  "link": "https://reverseengineering.stackexchange.com/questions/24817/ida-pro-recompilable-c-code",
  "content": "What tools produce C code that does not produce errors when you try to recompile it again? Can Hex-Rays decompiler convert everything to project files in a single folder and just compile it?\n\n",
  "votes": "11",
  "answers": 2,
  "views": "10k",
  "tags": [
    "c",
    "decompile"
  ],
  "user": "R4444",
  "time": "Aug 9, 2013 at 13:59",
  "comments": [
    {
      "user": "Rolf Rolles",
      "text": "Regarding the limitations of machine-code decompilation, see this answer:  reverseengineering.stackexchange.com/questions/311/…",
      "time": null
    },
    {
      "user": "T.Todua",
      "text": "There have been a long story already on this topic as SO. Better to look through: stackoverflow.com/questions/273145/…",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The primary purpose of decompilation is not to produce code that is compiled back with no errors, but rather recover logical flow of a binary. Hex-Ras Decompiler comes with its own set of limitation noted in Hex-Rays Decompiler Manual, to mention few:\n\n```\nBelow are the most important limitations of our decompilers (all processors):\n     * exception handling is not supported\n     * type recovery is not performed\n     * global program analysis is not performed\n\n```\n",
      "votes": "5",
      "user": "PSS",
      "time": "Aug 9, 2013 at 15:14",
      "is_accepted": false,
      "comments": [
        {
          "user": "user8005",
          "text": "My question was: Is there any decompiler that produces code that can be recompiled easily?",
          "time": null
        },
        {
          "user": "PSS",
          "text": "@user8005: Your question is and I quote: \"...does not produce errors when your try to compile it\"... There is no tools like that.",
          "time": null
        },
        {
          "user": "user8005",
          "text": "When the source is C# and not C, ILSpy works great btw...",
          "time": null
        },
        {
          "user": "PSS",
          "text": "@user8005: sure...However, your question is about C...not C#.",
          "time": null
        },
        {
          "user": "David Hoelzer",
          "text": "In fact, it would be trivial to produce cleanly compiling C code that simply inlines any questionable assembly code that it can't understand.  As PSS points out, recompilation is not the point of decompilation.",
          "time": null
        }
      ]
    },
    {
      "content": "Yes you can recompile C but the decompilation has be be manual. As far as I know there is no automatical tool that provide Recompilable C from assembly.\n\nddisasm is a tool to make recompiling asm from a binary file.\n\nA good starts should be to:\n\nAnd back to the step 2 again and again until your program is enough decompiled for you.\n\nNote that ddisasm is really slow: it requires around 150 GB of swap / ram to disassemble a 100 MB file.\n\n",
      "votes": "1",
      "user": "ultimate-anti-reversing",
      "time": "Aug 11, 2023 at 21:36",
      "is_accepted": false,
      "comments": []
    }
  ]
}