{
  "title": "How to Launch and debug Ghidra from Eclipse with two Modules I'm developing at the same time?",
  "link": "https://reverseengineering.stackexchange.com/questions/24951/how-to-launch-and-debug-ghidra-from-eclipse-with-two-modules-im-developing-at-t",
  "content": "Ghidra comes with its own Eclipse extensions that allows you to develop new Scripts and Modules for Ghidra.\n\nI'm working on several new Modules for Ghidra that will work together. But I've basically never used Java or Eclipse before.\n\nNormally you're just working on one Module at a time and to test it you launch it in debug mode from the Eclipse IDE.\n\nBut Ghidra creates one Configuration for each project and will only include the current Module. Everything in your other Modules won't be linked in to Ghidra, even if you've had all their files open in the IDE and you're switching between them, you can only debug with one present at a time.\n\nHow can I get Ghidra to launch with three Modules I'm working on all together?\n\nI've been going through the configuration dialogs and I've Googled various wordings of the problem in relation to Ghidra, in relation to Eclipse, and both together, to no avail.\n\nI did clone one of the configurations and add the other modules' projects to that configuration in the \"classpath\" window, but on launching, only the main module is there. What am I missing?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "2k",
  "tags": [
    "debugging",
    "java",
    "ghidra",
    "development"
  ],
  "user": "hippietrail",
  "time": "Oct 22, 2020 at 7:03",
  "comments": [],
  "answers_data": [
    {
      "content": "I figured it out by trial and error.\n\nFrom the main Eclipse window:\n\nIn the Configuration Editor:\n\nThat's it. You'll now get the functionality from the main project and the other projects together. You can now verify that by clicking on \"Debug\" in the bottom right.\n\n\n\n",
      "votes": "3",
      "user": "hippietrail",
      "time": "May 9, 2020 at 2:56",
      "is_accepted": true,
      "comments": []
    }
  ]
}