{
  "title": "Interact with a network-less Chinese MP3 player running a modified version of Linux",
  "link": "https://reverseengineering.stackexchange.com/questions/25105/interact-with-a-network-less-chinese-mp3-player-running-a-modified-version-of-li",
  "content": "My friend gave me this cheap little chinese MP3 player. I'm curious about exploring it learning more about the hardware, and potentially seeing if I could expand it's functionality in some way or run my own code on it to make it into something simple like a digital picture frame. Anything really I'm just curious about what it could potentially do but I don't know much about how feasible that would potentially be. \n\nIt doesn't have wifi or anything just a USB port, Bluetooth (audio), and an SD card slot. When I plug it in to my computer it shows up as a USB Mass Storage Gadget, which I understand is just an interface for transferring files to it. I asked the manufacturer about the processor inside and all he told me was \"ATJ\". My main machine is a mac with an Ubuntu dual boot. \n\nI'd just like to get an idea of what might be feasible with this device and what might not be, as well as any tools or first steps for finding out more about the hardware or potentially being able to communicate with the device over USB or through the SD card. I don't care if I brick. I'm just curious about like, if an it was someone's job to figure out anything they could about this device, or make it run \"Hello World\" or something, what steps they might take to or what tools they might use to try to accomplish that. I also might be able to ask the company for more simple details but I'm not sure how much they would provide me. \n\n",
  "votes": "1",
  "answers": 1,
  "views": "195",
  "tags": [
    "firmware",
    "hardware",
    "usb",
    "firmware-analysis"
  ],
  "user": "Conor Henry",
  "time": "May 24, 2020 at 0:46",
  "comments": [
    {
      "user": "morsisko",
      "text": "How do you know if the MP3 is running Linux? From my experience old Chinese mp3s are just simple MCU capable of decoding MP3 and controling the LCD, not powerful enough to run Linux",
      "time": null
    },
    {
      "user": "Conor Henry",
      "text": "I read online that it runs something based on Linux in a few different places. It’s a full capacitative touch screen device with a few default “apps”, and it implements Bluetooth so it didn’t seem too far fetched to me.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I was looking for the same thing and I recently found www.rockbox.org, an  open source firmware for audio players. Their idea is the owners would capable to customize that firmware and make it more functional in some cases. Always is good enough to learn something and in the way have some fun too...\n\n",
      "votes": "1",
      "user": "Rdest DJ",
      "time": "Jun 14, 2020 at 0:49",
      "is_accepted": false,
      "comments": []
    }
  ]
}