{
  "title": "Check DEP , ASLR and SafeSEH enabled or not , immlib",
  "link": "https://reverseengineering.stackexchange.com/questions/2510/check-dep-aslr-and-safeseh-enabled-or-not-immlib",
  "content": "How to check if DEP, ASLR and SafeSEH defense mechanism are enabled or not in a program using immlib library of Python in Immunity Debugger ? \n\nActually I am looking for small code snippet for each.\n\n",
  "votes": "3",
  "answers": 3,
  "views": "6k",
  "tags": [
    "debuggers",
    "python",
    "immunity-debugger",
    "seh"
  ],
  "user": "in3o",
  "time": "Sep 3, 2013 at 19:19",
  "comments": [],
  "answers_data": [
    {
      "content": "You need to check the PE headers of the modules, the offset is dependent on the OS version (the settings can be different for the executable and each loaded DLL). You can look at the mona.py script for examples on how to do that. The script is very large but you should find what you are looking for in the class MnModule, for example the flag for ALSR is checked at line 1726. (Note: in this script dbglib is an abstraction class to support both Immunity Debugger and WinDBG, it maps directly to immlib).\n\nScript source : http://redmine.corelan.be/projects/mona/repository/entry/mona.py\n\n",
      "votes": "5",
      "user": "ekse",
      "time": "Jul 21, 2013 at 1:21",
      "is_accepted": true,
      "comments": [
        {
          "user": "in3o",
          "text": "Good answer but i want a script that i can understand( i am a newbie ) . U can use pefile library also if you want.",
          "time": null
        },
        {
          "user": "Hello Goodbye",
          "text": "Link is currently dead",
          "time": null
        },
        {
          "user": "ekse",
          "text": "mona is now hosted on github, github.com/corelan/mona",
          "time": null
        }
      ]
    },
    {
      "content": "If you are under GNU/Linux, you may want to look at checksec.sh. If you are under Windows, you could take at look at it; maybe you'll find some interesting stuff that you could backport in Python.\n\n",
      "votes": "2",
      "user": "jvoisin",
      "time": "Jul 26, 2013 at 13:25",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "To add to @jvoisin's answer, you can have a look at checksec - python implementation of checksec.sh\n\nBoth these scripts are simple (compared to mona.py) and should help you get started. \n\n",
      "votes": "2",
      "user": "7h3rAm",
      "time": "Sep 3, 2013 at 18:53",
      "is_accepted": false,
      "comments": []
    }
  ]
}