{
  "title": "How to log CPU instructions executed by program with x64dbg?",
  "link": "https://reverseengineering.stackexchange.com/questions/25124/how-to-log-cpu-instructions-executed-by-program-with-x64dbg",
  "content": "How to log CPU instructions executed by program with x64dbg?\n\nI saw x64dbg - see the current position? question, but I can't find the way to log instructions.\n\nThanks!\n\n",
  "votes": "1",
  "answers": 1,
  "views": "822",
  "tags": [
    "x64dbg"
  ],
  "user": "Darius",
  "time": "May 26, 2020 at 15:42",
  "comments": [
    {
      "user": "morsisko",
      "text": "What do you mean by log CPU instructions? You want to track the instructions that are executed when program is paused and you execute the instructions one by one?",
      "time": null
    },
    {
      "user": "Darius",
      "text": "@morsisko, I want to see what instructions are executed in current time of running program. Thanks!",
      "time": null
    },
    {
      "user": "morsisko",
      "text": "But there are thousands or maybe even million instructions executed per second while the program is running. Are you sure you want to do exactly this? Also where do you want to save the output? In the program GUI or file?",
      "time": null
    },
    {
      "user": "Darius",
      "text": "Yes, @morsisko. It would be great to get in file.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "As far as I understand reading your comments - you want to log all the executed instructions in the file. To do this you need to:\n\nyou can select the Log Text format, you can use the proposed 0x{p:cip} {i:cip} which will log the data to file like 0x006E8749 mov ebp, esp. It is also good idea to set the Maximum trace count and the Log File... where the data will be stored. After you are done just press OK and the x64dbg will start executing your program and log all the instructions. Keep in mind that the program won't work really fast during the trace procedure.\n\n",
      "votes": "1",
      "user": "morsisko",
      "time": "May 26, 2020 at 18:11",
      "is_accepted": false,
      "comments": [
        {
          "user": "mrexodia",
          "text": "This is not the recommended method of doing this anymore. You can use the trace tab to do this natively from x64dbg.",
          "time": null
        },
        {
          "user": "morsisko",
          "text": "@mrexodia But can you log the instructions to file with your own format using trace tab?",
          "time": null
        },
        {
          "user": "mrexodia",
          "text": "When you start the trace everything is logged to a file, you can open this file later from x64dbg again",
          "time": null
        }
      ]
    }
  ]
}