{
  "title": "Are there some assemblers or disassemblers that allow dw/defw etc directives with specified endianness?",
  "link": "https://reverseengineering.stackexchange.com/questions/25221/are-there-some-assemblers-or-disassemblers-that-allow-dw-defw-etc-directives-wit",
  "content": "I've been working with reverse engineering tape image and disk image formats and the files and filesystems they contain.\n\nIt struck me that sometimes there are data fields that are not in the same endian as the platforms these represent, sometimes there are even fields of both endians. (I bet this is even more common in networking.)\n\nIt would be really beneficial to have variants of the assembly directives dw/defw, dd/defd, etc that include endian information so you can see at a glace what the intended numeric value is and also when the endian is not the expected one.\n\nThis makes me wonder if there are already assemblers that let the programmer define words, longs, etc in specific endian formats. And if there are not assemblers that do it, perhaps there are some disassemblers that do.\n\nI'm thinking of adding a feature request for this in Ghidra but first I want to know if it's already in some tools, and what syntax they use if so.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "58",
  "tags": [
    "assembly",
    "disassemblers"
  ],
  "user": "hippietrail",
  "time": "Jun 6, 2020 at 3:56",
  "comments": [
    {
      "user": "Jongware",
      "text": "When needed in real world assembly, I would add it as a macro.",
      "time": null
    },
    {
      "user": "hippietrail",
      "text": "@usr2564301: Great point! I have no idea if advanced disassemblers like Ida Pro supports reverse-macros.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Specifically for IDA, there is no such feature built in  but you should be able to create a custom data format  to handle this:\n\nhttps://www.hex-rays.com/blog/custom-data-types-and-formats/\n\n(The post is somewhat old so some details may have changed but the functionality is still there)\n\n",
      "votes": "2",
      "user": "Igor Skochinsky",
      "time": "Jun 7, 2020 at 9:09",
      "is_accepted": false,
      "comments": []
    }
  ]
}