{
  "title": "How to debugging activeX with Ida",
  "link": "https://reverseengineering.stackexchange.com/questions/25289/how-to-debugging-activex-with-ida",
  "content": "When I enter to some site it ask me to install ActivX to my Internet Explorer browser so this site will work well.  I installed that,and that site works well.\n\nHow can I see this ActiveX code(where does the code located)  and debug this code with Ida?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "1k",
  "tags": [
    "ida",
    "windows",
    "debugging"
  ],
  "user": "yfr24493AzzrggAcom",
  "time": "Jun 13, 2020 at 19:19",
  "comments": [],
  "answers_data": [
    {
      "content": "ActiveX controls (.ocx) are actually simple DLLs conforming to the COM standard. In practice, it means that it exports standard COM entry points such  as:\n\n```\n DllRegisterServer\n DllUnregisterServer\n DllCanUnloadNow\n DllGetClassObject\n\n```\nThe most important for us is DllGetClassObject as this is the one called by the host process to create the ActiveX control(s).\n\nTo see where the code is located, you need to find the file implementing it. in IE, it can be done from \"Manage Add-Ons\" dialog. \n\nFor example, here are the details for the Flash control:\n\n```\nName:                   Shockwave Flash Object\nPublisher:              Microsoft Windows Third Party Application Component\nType:                   ActiveX Control\nArchitecture:           32-bit and 64-bit\nVersion:                32.0.0.387\nFile date:              ‎3 ‎June, ‎2020, ‏‎03:53\nDate last accessed:     ‎16 ‎June, ‎2020, ‏‎21:19\nClass ID:               {D27CDB6E-AE6D-11CF-96B8-444553540000}\nUse count:              52850\nBlock count:            18\nFile:                   Flash.ocx\nFolder:                 C:\\Windows\\System32\\Macromed\\Flash\n\n```\nSo, we need to analyze Flash.ocx (in C:\\Windows\\System32\\Macromed\\Flash for 64-bit or C:\\Windows\\SysWow64\\Macromed\\Flash for 32-bit IE).\n\nTo debug, set the full path to the file in Debugger-Process Options-Input File, set breakpoint on DllGetClassObject then attach to the IE process. Once a page with a Flash control is loaded the breakpoint should trigger.\n\n",
      "votes": "2",
      "user": "Igor Skochinsky",
      "time": "Jun 16, 2020 at 20:03",
      "is_accepted": false,
      "comments": [
        {
          "user": "yfr24493AzzrggAcom",
          "text": "I looking at IE Manage Add-Ons and found my activeX path, tgere in no ocx file there, only few dll, but when I open the dll and put breakpoint in place that I know it called and attach to IE process, after few seconds Ida detach from process without break in this place",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "@yfr24493AzzrggAcom check if you see the dll load event in the output window. Maybe the path is wrong.",
          "time": null
        }
      ]
    }
  ]
}