{
  "title": "What are general guide lines for reversing COM objects",
  "link": "https://reverseengineering.stackexchange.com/questions/2530/what-are-general-guide-lines-for-reversing-com-objects",
  "content": "I'm interested in revers engineer COM objects. How can I find interfaces that a particular object implements if I know what interface it is?\n\nPlease tell if I need to change or rephrase the question.\n\n",
  "votes": "8",
  "answers": 1,
  "views": "3k",
  "tags": [
    "windows"
  ],
  "user": "PhoeniX",
  "time": "Jul 23, 2013 at 18:02",
  "comments": [],
  "answers_data": [
    {
      "content": "If you're looking to reverse engineer the COM library programatically, you should refer to Improve Your Debugging by Generating Symbols from COM Type Libraries\n\nIf you're looking to reverse engineer the COM library statically via IDA Pro, you can use Class Informer.\n\nIf you're looking to reverse engineer the COM library via a nice GUI, I recommend COMView.\n\n",
      "votes": "5",
      "user": "Biswapriyo",
      "time": "May 21, 2018 at 9:30",
      "is_accepted": false,
      "comments": [
        {
          "user": "PhoeniX",
          "text": "Regarding COM Type libs - if I understood correctly from the article, I need the TLB files to be able to generate the symbols? If I only have a dll file, I'm in trouble?",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "You don't need the .TLB file since the type information is embedded in the COM library's PE resources.",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "TLB is usually embedded (especially if it's an ActiveX object or intended to be used for Automation) but it's not actually guaranteed.",
          "time": null
        },
        {
          "user": "PhoeniX",
          "text": "What tips can you give if there is no type information in the file?",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "microsoft.com/msj/0399/comtype/comtype.aspx works fine for me -- i.imgur.com/IjdM3NO.png",
          "time": null
        }
      ]
    }
  ]
}