{
  "title": "How to quickly/easily make an analysis (reverse engineering) of the code of unknown CMS or framework on PHP? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/2534/how-to-quickly-easily-make-an-analysis-reverse-engineering-of-the-code-of-unkn",
  "content": "I would like to know what tools and techniques do you use for rapid analyze of unknown code CMS or framework. If more specifically that for the following tasks:\n\n1. To locate the file (s) html template layout of the output to the browser.\n2. Identifying the mechanism of routing on the URL that is both on the basis of the URL, the system determines which content and form in which to display or put in short - a mechanism  controller  in the pattern of MVC.\n3. Identifying the mechanism of the assembly of the main content of the modules, and work with a database that is everything for which usually must meet  model  in the pattern of MVC.\n4. Determination of the mechanism of assembly of the entire html page before. That is,  view  in the pattern of MVC.\n\nThis is a basic, in my opinion, problems arising when creating / redoing projects in PHP, of course is a kind of generalization of more specific tasks.\n\nFor example, for me, it's probably become traditional: Xdebug, IDE for PHP (Eclipse). Also a very special service helps to visualize the trace files Xdebug - Recognizer. It is good because it builds a comfortable working sequence diagram of a trace log. Maybe enough for someone to read documentation, view the source code or running in the debugger, but for me chart tracing helps to form in my head the system and has become a really rapid way of analysis.\n\nWhat is the average time you spend on the above tasks?\n\nEncourage effective tools for quick/easy analysis (reverse engineering) of unknown CMS or framework?\n\n",
  "votes": "3",
  "answers": 0,
  "views": "390",
  "tags": [
    "tools",
    "debuggers",
    "dynamic-analysis",
    "php",
    "cms"
  ],
  "user": "Kattlet",
  "time": "11 years ago",
  "comments": [
    {
      "user": "JMcAfreak",
      "text": "If you're looking for a better way to do those tasks, you'll need to reword your question. As it is, this looks more like a survey than a legitimate question. The second question you ask seems a bit ambiguous; are you looking for tools for those tasks, or just asking what people like? (Note: asking what people like is poor form)",
      "time": null
    }
  ],
  "answers_data": []
}