{
  "title": "C++ Unary equals (unary operator=)",
  "link": "https://reverseengineering.stackexchange.com/questions/25367/c-unary-equals-unary-operator",
  "content": "In C++ binaries, I find Qt methods like ??4QString@@QEAAAEAV0@AEBV0@@Z which demangle to\n\n```\npublic: class QString & __ptr64 __cdecl QString::operator=(class QString const & __ptr64) __ptr64\n\n```\nor in shorter form, QString& QString::operator=(QString const&). The return value does not appear to be used. What is the purpose of this \"unary equals\", given that it does not seem to be a construct people write in the original code?\n\nEdit\n\nI found the source of my confusion. I'm perfectly award of the calling convention with this, and what operator= is supposed to do. It's common, in my experience, for people to indicate this as a direct argument when reversing software. This is, for instance, what IDA does. It was what I was intending to do as well. So, it would have been considered unary, as I wrote it only take on argument (this).\n\nIt turns out that IDA somehow incorrectly assigned the type, and gave it the signature __int64 __fastcall QString__operator_(_QWORD) instead of QString* __fastcall QString__operator_(QString *, QString const *). I don't know what caused this. The output from [demangler.com], which I put in the first half of my post, did not include the implicit this, contrary to my expectations.\n\n",
  "votes": "3",
  "answers": 2,
  "views": "612",
  "tags": [
    "binary-analysis",
    "c++",
    "qt"
  ],
  "user": "Alex Meiburg",
  "time": "Jun 22, 2020 at 17:38",
  "comments": [
    {
      "user": "MSalters",
      "text": "The return type seems to be a reference, not a pointer. C++ allows you to choose any return type for operator=, including void. But the default behavior is to return *this as a reference.",
      "time": null
    },
    {
      "user": "HolyBlackCat",
      "text": "It's not unary. The single parameter you see is the second operand, and the first operand is this (it's a class member function, not a free function).",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "It is rather C++ question, but nonetheless:\n\nwhat you see is an assignment operator for the class QString. It enables you to write things like a = b, where a, b are of QString type.\n\nThe reason why it returns value is to enable you to write: a = b = c instead of a = c and b = c and you may see this pattern in case of other operators overloading (see question for instance).\n\nC++ standard demands the compiler to generate the = operator if it wasn't written by a programmer, so you can expect it to be present even if not used directly.\n\n",
      "votes": "6",
      "user": "bart1e",
      "time": "Jun 22, 2020 at 7:28",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "The default assignment operator for primitives returns a value, and the standard convention for operator overloading is to not deviate from the behavior of the operator you are overloading. This is why it's good practice to continue to return the assigned reference from the assignment overload operator.\n\nBecause of this behavior, there's a well-used idiom in C (and to C++ by extension) regarding checking the return value of a function upon assignment.\n\nFor example, consider an invocation of realloc:\n\n```\n// int *ptr;\n// size_t size;\n\nsize *= 2;\nint *nptr = realloc(ptr, size);\nif (nptr)\n    ptr = nptr;\nelse\n    return ERROR;\n\n```\nWe can simplify the code by moving assignment expressions inside the if condition. Here, we take advantage of two assignment expressions, size *= 2, which returns the value of the variable after doubling, and the assignment to nptr, which will be NULL (0) on failure.\n\n```\n// int *ptr;\n// size_t size;\n\nint *nptr;\nif (nptr = realloc(ptr, size *= 2))\n    ptr = nptr;\nelse\n    return ERROR;\n\n```\n",
      "votes": "1",
      "user": "Tyzoid",
      "time": "Jun 22, 2020 at 14:23",
      "is_accepted": false,
      "comments": []
    }
  ]
}