{
  "title": "Call of a suspicious method cannot be found",
  "link": "https://reverseengineering.stackexchange.com/questions/25378/call-of-a-suspicious-method-cannot-be-found",
  "content": "i have a strange apk which I took a closer look at, among others with jadx-gui. It is a gaming app that requires an unusual amount of permissions according to the manifest file. I installed and played the game on a testphone. The requested permissions are not allowed for the game at all. Found a class in the code with the following suspicious method:\n\n```\npublic void doInBackground()\n{\n  ...\n  String deviceId = ((TelephonyManager) this.a.getSystemService(\"phone\")).getDeviceId();\n  ...\n  a.add(new BasicNameValuePair(new String(\"imei\"), deviceId)); \n  ...\n  try {\n        httpPost.setEntity(new UrlEncodedFormEntity(a));\n      } catch (UnsupportedEncodingException e) {\n  ...\n\n```\nThis method collects sensitive data and sends it via http.\nI don't see that this class is called with this method. Searched for the name of the method, but found nothing. Is there a way to call this method without seeing it in the jadx-gui?\nOtherwise I ask myself why this method was implemented if it is never used.\n\n",
  "votes": "0",
  "answers": 1,
  "views": "62",
  "tags": [
    "android"
  ],
  "user": "fellower4",
  "time": "Jun 24, 2020 at 7:01",
  "comments": [],
  "answers_data": [
    {
      "content": "In Android there is a class named AsyncTask, designed for running processes in the background without blocking the UI.\n\nThe developer extends AsyncTask and implements doInBackground() member function which is called by the system. After instancing the derived class and calling the instance's .execute() method, Android will, asynchronously call doInBackground().\n\nThe program does not call functions of AsyncTask directly.\n\nLink to documentation:\nhttps://developer.android.com/reference/android/os/AsyncTask\n\n",
      "votes": "1",
      "user": "Yotamz",
      "time": "Jun 24, 2020 at 8:46",
      "is_accepted": false,
      "comments": []
    }
  ]
}