{
  "title": "dll injection (assembly code)",
  "link": "https://reverseengineering.stackexchange.com/questions/25459/dll-injection-assembly-code",
  "content": "I need some tip to undrestand what is the best way to execute external code from DLL or command line.\n\nI like to add the force feedback support to different games that not support it.\n\nI can write a DLL or a commnad line exe that execute the FFB. The problem is how I call these function from the game.\n\nFor the moment I have disassebled one game with IDA and found the point to put the call.\n\nI don't have any experience in assembly. So I'am not sure if I'am in the right way.\n\nThere are some tool like: wininject so I was think to use it to add the dll dependency to my exe game.\n\nAfter I need to do the call of my function inside the DLL in assembly (ex. exectute_ffb(par1) ), but I don't known the code to do the call.\n\nHere the screenshot about the call.\n\n\n\n\n\n```\nint __cdecl sub_43AC70(char *a1, int a2)\n{\n  call my_function(a1) from mylibrary.dll\n\n  int i; // [esp+0h] [ebp-4h]\n\n  for ( i = sub_43BC50(); i; i = *(_DWORD *)i )\n  {\n    if ( *(_DWORD *)(i + 88) == a2 && (!a1 || !stricmp((const char *)(i + 4), a1)) )\n      return i;\n  }\n  return 0;\n\n```\nCan you help me please ?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "1k",
  "tags": [
    "disassembly",
    "assembly",
    "dll-injection"
  ],
  "user": "user3449922",
  "time": "Jul 8, 2020 at 14:12",
  "comments": [
    {
      "user": "morsisko",
      "text": "Not sure if I understand you correctly, you want to make game call your function from your dll?",
      "time": null
    },
    {
      "user": "user3449922",
      "text": "yes I confirm, in short I like that a game call my function inside a external dll or if it is too difficoult, I like that a game call an external command line exe with parameters.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "It is indeed possible, and not that hard to do - providing the game doesn't have any anti-cheat nor integrity checks.\n\nThe thing you are looking for is called function hooking. If you don't want to mess with assembly there are few good libs that can do the most important and tedious part of work for you.\n\nTake a look into examples, for example that one in PolyHook`s repository. Here they hook (intercept) printf function, but there is no problem to intercept game function at 43AC70 to call your function from mylibrary.dll.\n\nIf you want to write your own detour you can take a look at my other reply on that site: here\n\n",
      "votes": "1",
      "user": "morsisko",
      "time": "Jul 11, 2020 at 13:59",
      "is_accepted": true,
      "comments": [
        {
          "user": "user3449922",
          "text": "Hi morsisko, your example with PolyHook, is very interesting, there is a video tutorial that do this ? if is possible, I like to create the dll in C# or if is not possible, create a \"generic\" DLL in c++ that call my dll in C#.",
          "time": null
        },
        {
          "user": "morsisko",
          "text": "I think you will find a lot of tutorials, just search with the phrase \"function hooking\". I think it will be better to inject native .dll into native code, and then eventually call your C# dll",
          "time": null
        },
        {
          "user": "user3449922",
          "text": "thank you ! last question: I suppose before do a function hooking, I need to inject the DLL. Do you confirm ? if yes what is the best tool in this case ?",
          "time": null
        },
        {
          "user": "morsisko",
          "text": "DLL injection would be the easiest I think. You may write your own injector (that's fairy easy), or use some existing one as Cheat Engine, or even better make proxy dll which will inject your payload on game start.",
          "time": null
        }
      ]
    }
  ]
}