{
  "title": "Best way to find the entropy of an EXE file?",
  "link": "https://reverseengineering.stackexchange.com/questions/25466/best-way-to-find-the-entropy-of-an-exe-file",
  "content": "I want to write a script to extract the entropy of each sections of an EXE file. What is the best tool that I can use to do this?\nI tried Ghidra but it doesn't have an entropy API which I can use.\n\n",
  "votes": "-1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "disassembly",
    "pe",
    "entropy"
  ],
  "user": "Sajjad Zulphekari",
  "time": "Jul 10, 2020 at 11:17",
  "comments": [
    {
      "user": "morsisko",
      "text": "You are looking for script or just a tool to calculate entropy?",
      "time": null
    },
    {
      "user": "Sajjad Zulphekari",
      "text": "@morsisko I am looking for a script to save the output of the entropy.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can use r2 to get the data and r2pipe to script it.\n\niS entropy produce the entropy values for each section. Adding j will produce it in JSON format and scripting it with r2pipe is easy.\n\n```\nimport r2pipe\np = r2pipe.open('<path_to_exe>')\nres = p.cmdj('iSj entropy')\nprint([(x['name'],x['entropy']) for x in res['sections']])\n\n```\n",
      "votes": "1",
      "user": "Paweł Łukasik",
      "time": "Jul 10, 2020 at 12:10",
      "is_accepted": true,
      "comments": [
        {
          "user": "Sajjad Zulphekari",
          "text": "Thank you so much, this is what I wanted. For some weird reason I am getting a keyerror when I try to print the entropy. If I remove x['entropy'] from your code, I get the section names.",
          "time": null
        },
        {
          "user": "Paweł Łukasik",
          "text": "try printing the whole x and see what properties are available - one of them should be the entropy",
          "time": null
        },
        {
          "user": "Sajjad Zulphekari",
          "text": "When I just print res or x as you mentioned, I can see the entropy values for each section, but it shows a keyerror when I try to just get the entropy value",
          "time": null
        },
        {
          "user": "Paweł Łukasik",
          "text": "well, keyerror means there's no such entry and since there is such entry maybe there's a subtle typo? hard to guess w/o actual code",
          "time": null
        },
        {
          "user": "Sajjad Zulphekari",
          "text": "I  realized why I am getting the error. The radare didn't calculate the entropy of .bss section of the file. {'name': '.bss', 'size': 0, 'vsize': 4096, 'perm': '-rw-', 'paddr': 0, 'vaddr': 4214784} That is why it shows a keyerror",
          "time": null
        }
      ]
    }
  ]
}