{
  "title": "How to know where a sequences of bytes are used in a .NET application with Dnspy?",
  "link": "https://reverseengineering.stackexchange.com/questions/25470/how-to-know-where-a-sequences-of-bytes-are-used-in-a-net-application-with-dnspy",
  "content": "There are a sequence of bytes that i need to find out where are used in dnspy\n\ni tried going to hex editor and found the bytes, but right clicking and saying go to code or structure or follow reference wont work\n\nhow can i know where these bytes are used if there is no reference? is it possible to set breakpoint on location access just like IDA, or any easier way?\n\nThe sequence of bytes are right before the IAT in the .text section, around 0x70 bytes after this string which seems to be in a lot of .net files :\n\nMicrosoft.VisualStudio.Editors.SettingsDesigner.SettingsSingleFileGenerator\n\n",
  "votes": "1",
  "answers": 1,
  "views": "2k",
  "tags": [
    "windows",
    "malware",
    ".net",
    "c#",
    "dnspy"
  ],
  "user": "Mery Ted",
  "time": "Jul 11, 2020 at 6:05",
  "comments": [],
  "answers_data": [
    {
      "content": "I figured it out:\n\nRight click and go to hex editor, then search the bytes you are looking for, then after finding it right click and select go to code reference.\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Jul 14, 2020 at 8:07",
      "is_accepted": true,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "It's completely fine to answer your own question, it may be useful to someone else who runs into the same issue.",
          "time": null
        },
        {
          "user": "Paweł Łukasik",
          "text": "@IgorSkochinsky this option works for code references. In this particular example this is not and this option doesn't work as this is part of attribute. I know how to find thuis code manually but I think there's no option in the current dnSpy to go directly from hex editor to the part of the source where it is used.",
          "time": null
        }
      ]
    }
  ]
}