{
  "title": "How to extract .nsh file?",
  "link": "https://reverseengineering.stackexchange.com/questions/25543/how-to-extract-nsh-file",
  "content": "I am trying to edit the graphics on a game and have a .nsh file where post-process effect data is contained. I cannot seem to find a program to extract/read its contents.\n\nGoogling it, I see something about NSIS packages but nothing past that.\n\nEdit: Link added for the file. This is for Naruto Ultimate Ninja Storm 3 Full Burst HD on PC (dx11), and I have also uploaded the corresponding nsh files for ps3, xbox360, ps4, and dx9 (win32)\nhttps://drive.google.com/drive/folders/17JZi-H8DpZZsOcyTZ_xQUvrgV-cnmnbd?usp=sharing\n\n",
  "votes": "0",
  "answers": 2,
  "views": "320",
  "tags": [
    "decompress",
    "game-hacking",
    "graphics"
  ],
  "user": "Nikk Mann",
  "time": "Jul 26, 2020 at 3:01",
  "comments": [
    {
      "user": "Jongware",
      "text": "Such file extensions are usually useless, unless they are shared by multiple games (and have been dissected before). Add a link to such a file to your post (but providing more files would be more helpful). What kind of data format do you hope to retrieve? What should \"post-process effect data\" look like? Graphic shaders?",
      "time": null
    },
    {
      "user": "Nikk Mann",
      "text": "yes, I am hoping to extract some editable text based files which govern the graphical effects of the game. Specifically things like bloom and motion blur. This is for Naruto Ultimate Ninja Storm 3 Full Burst HD on PC, and I have also uploaded the corresponding nsh files for ps3, xbox360, ps4, and dx9 (win32).",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The files you linked, whilst all having an NSH extension actually appear to be slightly different archive formats.\n\nEach of these archive file appears to contains a number of graphics shaders compiled to bytecode for the various architectures. The binary formats of these shaders vary significantly between architectures.\n\nA couple have very obvious clues detailing the version of the shader compilers (and hence formats) used -\n\n```\nnuccPostEffect_win32.nsh      Microsoft (R) HLSL Shader Compiler 9.29.952.3111\nnuccPostEffect_dx11.nsh       Microsoft (R) HLSL Shader Compiler 6.3.9600.16384\n\n```\nThe shaders in the dx11 file can be identifed easily as they begin with the magic bytes DXBC.  One resource for understanding these is here.\n\n",
      "votes": "2",
      "user": "Ian Cook",
      "time": "Jul 25, 2020 at 11:28",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": ".NSH is only a windows installer format provided/designed by NSIS. The reason why you can't extract the file is because it has been compressed by NSIS (Nullsoft Scriptable Install System) software.\n\nThis is most likely the best source for your solution:\n\nhttps://nsis.sourceforge.io/Can_I_decompile_an_existing_installer\n\nI apologize for not having enough time to pick the important info for you. But I am more than honest that this documentation will solve your problem!\n\nHope I Helped.\n\n",
      "votes": "0",
      "user": "Noor",
      "time": "Jul 25, 2020 at 5:37",
      "is_accepted": false,
      "comments": []
    }
  ]
}