{
  "title": "Secure resources from being extracted?",
  "link": "https://reverseengineering.stackexchange.com/questions/2560/secure-resources-from-being-extracted",
  "content": "I have a jar file with a resources folder, and I have converted it to EXE using Launch4J.\n\nHow can I protect my resources from being extracted using winzip/winrar ?\n\n",
  "votes": "3",
  "answers": 3,
  "views": "528",
  "tags": [
    "executable",
    "java",
    "pe-resources"
  ],
  "user": "geek_guy",
  "time": "Aug 5, 2013 at 8:38",
  "comments": [
    {
      "user": "Antimony",
      "text": "You don't. You can add some trivial obfuscations to discourage script kiddies, but you aren't going to stop anyone determined.",
      "time": null
    },
    {
      "user": "geek_guy",
      "text": "but obfuscations will not modify anything in the resources.Right now one can just right click and extract all the resources. I just to want to prevent that.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The only real protection is to not deliver the resources!\n\nAs long as you give the resources out of your hand they can be extracted. It may be difficult but it is possible to extract them.\n\nThe most secure way would be to store the resources on a server and access them in a remote way. But also then if the resource is on the client computer it is possible to extract them from memory.\n\n",
      "votes": "7",
      "user": "Uwe Plonus",
      "time": "Aug 2, 2013 at 6:14",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "The only real option you have here is to store the resources as encrypted data and decrypt them prior to loading in java. You could store the encrypted data as a byte array, and use some kind of xor encryption.\n\nThis is NOT secure, and you should NOT store any important keys, passwords, or credentials in any resource files.\n\n",
      "votes": "2",
      "user": "Ditmar Wendt",
      "time": "Aug 1, 2013 at 17:42",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I know few ways to prevent resources extraction/reading:\n\nHowever, none of these increases security. Resources will be able to get decrypted or extracted, these are only \"simple tricks\" to prevent standard reading / extraction. But people with enough knowledge will be able to bypass them and fix the files.\n\n",
      "votes": "2",
      "user": "galoget",
      "time": "Oct 29, 2021 at 7:33",
      "is_accepted": false,
      "comments": []
    }
  ]
}