{
  "title": "IDA hex != String",
  "link": "https://reverseengineering.stackexchange.com/questions/25619/ida-hex-string",
  "content": ", Hello. to learn reverse engineering, I would like to simply change a string via IDA.\nI select my string, get the adress, and select Change Bytes to get the Hex value :\n\n\n\nAfter That, I try to convert this Hexa value to string, via this website : https://www.mobilefish.com/services/latin_utf_base64_to_hex/latin_utf_base64_to_hex.php#text_hex_output\nAnd the result is not the same,\n\n\n\nDo you known how to get the complete Hex value from my string ?\n\nThanks a lot.\n\n",
  "votes": "-1",
  "answers": 2,
  "views": "736",
  "tags": [
    "ida",
    "hex"
  ],
  "user": "twenty94470",
  "time": "Aug 6, 2020 at 21:45",
  "comments": [
    {
      "user": "user22363",
      "text": "Use debugger like x64dbg which is far easier than IDA and more suited for this.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "where is the problem the hex bytes Were Converted properly\n45 00 =E , 6d 00 == m,......73 00 == s\nand that is what is shown in your screen shot\n\nif you need the hex for the complete string select all the bytes of the string\n\ntry synchronizing between IDA Hex-View and Ida View windows or try clicking the small down arrow to see if all the bytes are shown in the popup\n\n",
      "votes": "1",
      "user": "blabb",
      "time": "Aug 7, 2020 at 22:24",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Patch bytes shows only 16 bytes at a time, which is not enough to display the entire string.\n\nEasier to use the Hex Dump view to edit the string. This can be opened with View -> Open Subviews -> Hex Dump. If necessary right click \"Synchronize with ...\" and specify view to sync with.\n\nYou can right click to select option to \"Edit...\" in this view. Once done editing right click again and you can select option to \"Apply Changes\" or hit F2.\n\n",
      "votes": "1",
      "user": "chentiangemalc",
      "time": "Jan 5, 2021 at 0:19",
      "is_accepted": false,
      "comments": []
    }
  ]
}