{
  "title": "Embedding URL call into an image / movie",
  "link": "https://reverseengineering.stackexchange.com/questions/2561/embedding-url-call-into-an-image-movie",
  "content": "Is there a way to embed a URL call in the raw data of an image or movie file, such that when the image or movie is opened, it makes a call to a webserver? I want to be able to obtain someone's external IP by sending an image to them, and then having the image make a call back to a webserver I control.\n\nI just wonder if some PHP script could be embedded into the image file.\n\n",
  "votes": "7",
  "answers": 2,
  "views": "290",
  "tags": [
    "file-format",
    "embedded",
    "exploit"
  ],
  "user": "thefragileomen",
  "time": "Aug 4, 2013 at 14:09",
  "comments": [],
  "answers_data": [
    {
      "content": "Any such functionality is dependent on the player or viewer used. I know of no image formats that require any kind of interaction from the viewer, but some video formats do (or, rather, did) use it.\n\nIn addition to Quicktime mentioned by 0xea, the Windows Media/ASF format allows embedding of script commands, and one of them is opening an URL:\n\nhttp://support.microsoft.com/kb/828026\n\nHowever, this behavior:\n\nSo, I would not rely on it.\n\nEDIT\n\nSpeaking of images, I've just realized that SVG is using XML. XML files may contain references to extenal URLs, such as DTDs or schemas. Additionally, SVG itself supports referring to other elements in the same document or sometimes external ones:\n\nhttp://www.w3.org/TR/SVG/struct.html#Head\n\nI've just tried it and opening the following SVG results in a fetch to the remote server in Opera, but not IE:\n\n```\n<?xml version=\"1.0\" standalone=\"no\"?>\n<!DOCTYPE svg PUBLIC \"-//W3C//DTD SVG 1.1//EN\" \"http://www.w3.org/Graphics/SVG/1.1/DTD/svg11.dtd\">\n<svg width=\"8cm\" height=\"3cm\" xmlns=\"http://www.w3.org/2000/svg\" version=\"1.1\">\n  <desc>Local URI references within ancestor's 'defs' element.</desc>\n  <defs>\n    <linearGradient id=\"Gradient01\">\n      <stop offset=\"20%\" stop-color=\"#39F\" />\n    </linearGradient>\n  </defs>\n  <!-- reference to a local definition -->\n  <rect x=\"1cm\" y=\"1cm\" width=\"6cm\" height=\"1cm\" \n        fill=\"url(#Gradient01)\"  />\n\n  <!-- this element triggers a fetch of the specified URL in Opera -->\n  <rect x=\"1cm\" y=\"1cm\" width=\"6cm\" height=\"1cm\" \n        fill=\"url(http://example.com/test1)\"  />\n</svg>\n\n```\nSo, once again it's viewer-specific but you probably have more chance of this working.\n\n",
      "votes": "6",
      "user": "Igor Skochinsky",
      "time": "Aug 3, 2013 at 20:13",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "What you ask for would be very near remote code execution, which is usually a security no-no. \nTho there are some formats that allow similar things. \n\nAs far as i remember MOV file format allows you to embed urls or aliases in it for alternative versions of the movie. I think it's usually used for streaming purposes, so that a player can request a higher or lower quality movie and similar things. \n\nI do not know many details about this, but you can check out MOV file format. The atom that contains urls is DREF. Apple should have more info. Check out QuickTime File Format specifications for details.\n\nFor example , here's the sample file (from mplayer samples database, which has proven to be a very valuable resource for all sorts of media files)  that actually contains only the reference to another file, hosted at http://stream.qtv.apple.com/events/jan/cat_power/cat_power_ref_28.mov. The server will definitely be able to determine the client's IP address this way. \n\n",
      "votes": "5",
      "user": "0xea",
      "time": "Jul 30, 2013 at 21:19",
      "is_accepted": false,
      "comments": []
    }
  ]
}