{
  "title": "How to zip or compress resources of your .NET application",
  "link": "https://reverseengineering.stackexchange.com/questions/2572/how-to-zip-or-compress-resources-of-your-net-application",
  "content": "I am a Windows application developer, I'd build a few .NET applications and I can see It is very easy to crack out resources of my Application even some simple applications like Resource Editor are able to crack my application by just deleting the Registration Dialog Box to make my application a freeware without having a proper license key.\n\nIs there any .EXE compressor or any other other tool which I can use to save my application resources as well as my scripts, Can anyone suggest me How can I avoid Recompilation of my script. Any help will be appreciated.\n\n",
  "votes": "3",
  "answers": 3,
  "views": "391",
  "tags": [
    "decompilation",
    "unpacking",
    "compilers"
  ],
  "user": "khk",
  "time": "Aug 2, 2013 at 11:33",
  "comments": [
    {
      "user": "Ditmar Wendt",
      "text": "You need to explain what a \"script\" is.",
      "time": null
    },
    {
      "user": "khk",
      "text": "I mean assemblies",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The idea of truly protecting resources is impossible -- every protection you implement can and will be broken. Assume this, and do not put credentials or private data in your resources/code. \n\nThe idea behind resource encryption/compression is summarized well in this codeproject article, the same ideas apply to .NET. You use some encryption method, add the encrypted file to your project, load it via your code, and run your decryption/decompression algorithm on it.\n\nRealistically, though, it sounds like you're looking for a .NET obfuscator with compression features. I don't believe stackexchange is the place for product advertisement, so here is a good objective list: http://en.wikipedia.org/wiki/List_of_obfuscators_for_.NET\n\nIn regards to making cracking your application more difficult, you should consider using asymmetric encryption as described here and license key files. Think of creative ways to perform license checks throughout your application. Using a keyfile you're preventing the possibility of anyone ever writing a keygen for your application, and adding a large number of checks for the license will make it arduous for anyone attempting to crack the application.\n\n",
      "votes": "3",
      "user": "Ditmar Wendt",
      "time": "Aug 2, 2013 at 12:37",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "",
      "votes": "1",
      "user": "stakx",
      "time": "Aug 3, 2013 at 10:25",
      "is_accepted": false,
      "comments": [
        {
          "user": "Antimony",
          "text": "Signing it will only help against MiTM and even then only if you get the key through a seperate channel.",
          "time": null
        }
      ]
    },
    {
      "content": "If you are looking for freeware tools to zip your resources and to keep your scripts secure, then I'll recommend you to use Confuser\n\nThis is a freeware application, even you can download its source code.\n\n",
      "votes": "1",
      "user": "Chitransh",
      "time": "Aug 3, 2013 at 12:17",
      "is_accepted": false,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "A link and a little description of the tool wouldn't hurt.",
          "time": null
        }
      ]
    }
  ]
}