{
  "title": "ghidra scripting: ghidra unable to resolve string type",
  "link": "https://reverseengineering.stackexchange.com/questions/25888/ghidra-scripting-ghidra-unable-to-resolve-string-type",
  "content": "I have following code:\n\n```\n#include <stdio.h>\n\nchar somes[10] = \"good job!\";\nchar somes1[8] = \"another\";\nchar somes2 [5] = \"job\";\n\nint func()\n{\n  printf(\"You did a %s  \n\", somes);\n  // func(10);\n}\n\nint main()\n{\n  printf(\"You did a %s  \n\", somes1);\n  printf(\"You did a %s  \n\", somes2);\n  printf(\"garb\");\n  printf(\"sharp\");\n  func();\n}\n\n```\nI want to get sizes of strings defined in the code. Ghidra behaves strangely in such cases, even with symbol information. For e.g. in the above program, ghidra accurately detects lengths (or sizes of) all strings except. \"garb\" - it says that its size is 1 and defined as a single character \"g\" (s.getObject()). I feel this very strange, as even with debugging information, ghidra fails to detect this. Is there anything I can do to get such sizes (or correct string representations)?\n\nI am doing something like:\n\n```\nsymbols = set(currentProgram.getSymbolTable().getAllSymbols(True))\nfor s in symbols:\n    if s.isGlobal():\n        // gives me size of object\n        print(s.getObject().getLength())\n\n```\n\n\nNote that I have also posted this question here - https://github.com/NationalSecurityAgency/ghidra/issues/2274\n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "ghidra"
  ],
  "user": "R4444",
  "time": "Sep 14, 2020 at 18:05",
  "comments": [],
  "answers_data": [
    {
      "content": "If you are trying to change and individual string, you can right click on the first character of the string and under Data, convert it to TerminatedCString.\n\nIf you have a problem with how Ghidra is recognizing strings, you can tweak the settings in the ASCII Strings analyzer to have it recognize shorter strings, change alignments ettings or use a different word model.\n\n",
      "votes": "1",
      "user": "Shane Reilly",
      "time": "Sep 14, 2020 at 18:29",
      "is_accepted": false,
      "comments": [
        {
          "user": "R4444",
          "text": "yes, I can change the type that way (i.e. in gui), but is there any way to do this automatically with headless analyzer python script?",
          "time": null
        },
        {
          "user": "Shane Reilly",
          "text": "You can change the settings on the ASCII Strings analyzer to change the minimum amount of characters or to use a different word model. This may help it recognize different strings that it's not catching in its current settings.",
          "time": null
        },
        {
          "user": "R4444",
          "text": "thanks shane, I found such options under ascii strings and data references in GUI analysis pane. But, question is how to enable these options in scripting mode.",
          "time": null
        }
      ]
    }
  ]
}