{
  "title": "How to calculate value inside stack segment (SS)",
  "link": "https://reverseengineering.stackexchange.com/questions/25892/how-to-calculate-value-inside-stack-segment-ss",
  "content": "I have an assembly row which the following information:\n\n```\nEBP = 006FFB50\nSS  = 002B  \n\n```\nWhen I looked on this row:\n\n```\nmov eax,dword ptr ss:[ebp+8]  \n\n```\nI assumed that EBP + 8 = 006FFB50 + 8 = 006FFB58.\nBut according to x64DBG, this is the result:\n\n```\ndword ptr [ebp+8]=[006FFB58]=006FFC98  \n\n```\nI don't understand how it was calculated.\nWhy ss:[006FFB58] is equal to 006FFC98?\n\nPicture for reference with more information:\n\n\n",
  "votes": "1",
  "answers": 1,
  "views": "554",
  "tags": [
    "assembly",
    "x64dbg",
    "stack"
  ],
  "user": "E235",
  "time": "Sep 15, 2020 at 11:49",
  "comments": [],
  "answers_data": [
    {
      "content": "Registers ss, cs, ds, es, gs, fs are special. They are called segment registers and contain not addresses but selectors.\n\nA selector is used by the CPU as a reference to a segment - area of memory with a specific base (start address), limit (end address) and permissions.\n\nSelectors and segments are set up by the OS and in theory there may be many different segments, however in practice all modern OSes use flat memory segments (0 to 0xFFFFFFFF for 32-bit processes) for the standard code and data segments (ss, cs, ds)1. This means that in the expression ss:[ebp+8], only the value of EBP is used for calculating the address. In your case it is indeed correct that\n\nEBP + 8 = 006FFB50 + 8 = 006FFB58\n\nwhich matches the value shown in brackets.\n\nHowever, the value after the = sign in the debugger is not the result of the calculation but the value which is present in memory at that address. If you open a memory dump and go to address 006FFB58, you should see 006FFC98 there.\n\nThe brackets in the debugger hint signify memory dereference, similarly to the assembly syntax.\n\n1 gs and fs are treated differently and are usually used for Thread Local Storage (TLS) block which is different for every thread and does not start at 0 so e.g. fs:0 does not map to the RAM address 0.\n\n",
      "votes": "3",
      "user": "Igor Skochinsky",
      "time": "Sep 15, 2020 at 15:00",
      "is_accepted": true,
      "comments": []
    }
  ]
}