{
  "title": "Legality of publishing decompiled code",
  "link": "https://reverseengineering.stackexchange.com/questions/26060/legality-of-publishing-decompiled-code",
  "content": "The situation is the following:\n\nMy question:\n\nWhat is the legal situation in USA and EU regarding publication of the reverse-engineered source code, e.g. on github? I suppose the art work (gfx and sound) is protected, but what about the source code itself? I see that the reverse-engineered source code of the old Pokemon games has been online for many years, same for the C64 kernal and the Amiga microkernel (exec), but that doesn't mean of course that it is legal to do so.\n\nNote: There have been already a couple of questions on the legal aspects of reverse engineering here, but none of them fits my situation. For example\nhere, here, or here.\nMost of the existing questions are about using reverse-engineered code in your own code. This is not the case here.\n\n",
  "votes": "4",
  "answers": 0,
  "views": "512",
  "tags": [
    "disassembly",
    "decompilation",
    "law"
  ],
  "user": "trunklop",
  "time": "Oct 5, 2020 at 11:06",
  "comments": [
    {
      "user": "peter ferrie",
      "text": "I’m voting to close this question because this is a legal question not a reversing question.",
      "time": null
    },
    {
      "user": "Rainb",
      "text": "most likely nobody cares",
      "time": null
    },
    {
      "user": "Blacklight MG",
      "text": "@Rainb software development companies: \"Allow us to introduce our lawsuits.\"",
      "time": null
    },
    {
      "user": "Rainb",
      "text": "@BlacklightMG it's from 34 years ago...",
      "time": null
    },
    {
      "user": "Blacklight MG",
      "text": "@Rainb \"As a general rule, for works created after January 1, 1978, copyright protection lasts for the life of the author plus an additional 70 years.\" - FAQ | U.S. Copyright Office. It's absurd, but that's how law works in the 21st century. But I guess, since he mentioned he couldn't find the authors, it can be classified as abandonware.",
      "time": null
    }
  ],
  "answers_data": []
}