{
  "title": "Extract PYZ Error",
  "link": "https://reverseengineering.stackexchange.com/questions/26072/extract-pyz-error",
  "content": "I successfully recovered some PYC files from an ELF built by PyInstaller (https://github.com/extremecoders-re/pyinstxtractor/wiki/Extracting-Linux-ELF-binaries). There is a PYZ archive in the dump. I tried to use pyi-archive_viewer to open and/or extract some modules from the PYZ. I receive an AttributeError \"ZlibArchive object has no attribute open openEmbedded.\"\n\nThe error occurs on line 134 of the source (https://github.com/pyinstaller/pyinstaller/blob/develop/PyInstaller/utils/cliutils/archive_viewer.py)\n\nI believe something is incorrectly parsed/output during extraction...? Has anyone else seen this?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "2k",
  "tags": [
    "decompilation",
    "elf",
    "python"
  ],
  "user": "armor",
  "time": "Oct 6, 2020 at 19:36",
  "comments": [],
  "answers_data": [
    {
      "content": "For anyone else this happens to... Ensure you use the same Python version as the original author.\n\nThat is, I originally created the ELF with Python 3.7. But I tried the reversing process on a different machine - with Python 3.8. Learn from my mistake!\n\n",
      "votes": "0",
      "user": "armor",
      "time": "Oct 6, 2020 at 20:23",
      "is_accepted": false,
      "comments": [
        {
          "user": "Abdullah Mohamed",
          "text": "I'm curious on how did you discover that it was a mismatching Python version issue? Was it coincidence? Or you've done some kind of static analysis to the source code of the python files and figured it out?",
          "time": null
        },
        {
          "user": "armor",
          "text": "a dash of trial and error, and a dash of reading the python release notes. though I cannot recall what tipped me off in the latter :/",
          "time": null
        },
        {
          "user": "Abdullah Mohamed",
          "text": "That was definitely a nice and thorough learning experience, thanks for sharing the answer!",
          "time": null
        }
      ]
    }
  ]
}