{
  "title": "how to get all \"called functions\" in idapython",
  "link": "https://reverseengineering.stackexchange.com/questions/26099/how-to-get-all-called-functions-in-idapython",
  "content": "I am using following function to generate a call graph using idapython:\n\n```\ndef generate_graph():\n    callees = dict()\n    # loop through all functions\n    for function_ea in idautils.Functions():\n        f_name = idc.get_func_name(function_ea)\n        # For each of the incoming references\n        for ref_ea in idautils.CodeRefsTo(function_ea, 0):\n            # Get the name of the referring function\n            caller_name = idc.get_func_name(ref_ea)\n            # Add the current function to the list of functions\n            # called by the referring function\n            callees[str(caller_name)] = callees.get(str(caller_name), set())\n            callees[str(caller_name)].add(str(f_name))\n    return callees\n\nfunction_graph = generate_graph()\nprint(function_graph)\n\n```\nThis gives me a dictionary with function names as a key and functions called by that function as a value.\n\nFor e.g. if \"main\" calls \"foo\" and \"func\", then the dictionary will be:\n\nmain:{\"foo\", \"func\"}\n\nThis is working correctly if function is called directly. But in the case like:\n\n```\nvoid function1(char * buf)\n{\n  /*  BAD  */\n  buf[4105] = 'A';\n}\n\nint main(int argc, char *argv[])\n{\n  void (*fptr)(char *);\n  char buf[10];\n\n  fptr = function1;\n\n  fptr(buf);\n\n\n  return 0;\n}\n\n```\nAs the function gets called through a register, like:\n\n401140: call   rdx\n\nIs there any way I can modify above script (or create a new) to detect such cases?\n\n",
  "votes": "3",
  "answers": 0,
  "views": "2k",
  "tags": [
    "ida",
    "idapython"
  ],
  "user": "R4444",
  "time": "Oct 11, 2020 at 14:31",
  "comments": [
    {
      "user": "Rolf Rolles",
      "text": "This is a notoriously difficult problem in binary analysis: determining where an indirect call goes. The short answer to your question is \"no\". Not just in IDA, but any reverse engineering tool in general, will usually not be able to provide you with information about indirect calls. The only exception will be in cases where the data flow between the assignment to the function pointer, and the call site itself, is simple enough where it can be tracked. If the data flow starts to involve multiple functions, or has memory accesses in between, today's tools aren't going to do it.",
      "time": null
    },
    {
      "user": "R4444",
      "text": "thanks for your comment. I asked this question because I can see the function is being detected in the gui mode (i.e. in the above case). I am aware that this problem is hard. But in above case, I was able to detect the function call by iterating over function items like - for h in idautils.FuncItems(function_ea) and then searching through the xrefs like - for r in idautils.XrefsFrom(h, 0): caller_name = idc.get_func_name(r.to)",
      "time": null
    },
    {
      "user": "Rolf Rolles",
      "text": "Do you want to know \"the fact that indirect calls are being made\", or \"which functions might be targeted by an indirect call\"? In the former case, just iterate through the instructions in the function and look for indirect call instructions -- that is, call instructions that don't have a fixed destination. For the latter case, that's the thing I was describing as being hard.",
      "time": null
    },
    {
      "user": "R4444",
      "text": "got it. thanks Rolf",
      "time": null
    }
  ],
  "answers_data": []
}