{
  "title": "How to inform Hex-Rays decompiler (7.0) of known register values?",
  "link": "https://reverseengineering.stackexchange.com/questions/26118/how-to-inform-hex-rays-decompiler-7-0-of-known-register-values",
  "content": "I'm currently working on a binary that has encrypted strings, using IDA 7.0. The encrypted data is copied to another location in memory, which is then decrypted. I have already decrypted the strings in-place, but due to the way the strings are accessed the decompiler is having trouble resolving them.\n\nThis is an example of ASM that accesses a decrypted string:\n\n```\nmov     rcx, cs:StringTableOffset\nlea     rax, cs:180000000h\nlea     rcx, [rcx+rax+130A4h]\ncall    cs:GetModuleHandleA\n\n```\nFor the purpose of reversing, StringTableOffset can be considered 0, so the final lea instruction effectively just moves the value 0x1800130A4 into rcx. The decompiler doesn't know that, though, and shows pointer arithmetic instead.\n\n|| ((v11 = GetModuleHandleA((LPCSTR)(StringTableOffset + 0x1800130A4i64))\n\nIs there any way to signal to the decompiler that the value of rcx (the argument to GetModuleHandleA) is known, so that it can display the defined string?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "274",
  "tags": [
    "ida",
    "decompilation"
  ],
  "user": "quickgame",
  "time": "Oct 15, 2020 at 18:56",
  "comments": [],
  "answers_data": [
    {
      "content": "The answer to the specific question that you asked is: not directly through the UI, but it's possible with a plugin. Sample plugin #18 in the Hex-Rays SDK. The comment at the top of the plugin says:\n\n```\n* It shows how to specify a register value at a desired location.\n* Such a functionality may be useful when the code to decompile is\n* obfuscated and uses opaque predicates.\n\n```\nHowever, there's a better answer to your question. The assembly code that you displayed is commonly generated by MSVC when accessing global arrays or data structures on x64. Basically, one register will be set to the base address of the containing module (rax in your snippet above), and then array accesses will be encoded as [rax+r64+RVA_of_array], where r64 is some register being used for indexing purposes.\n\nHex-Rays trips over snippets like this one, but there is a way to fix it: namely, by turning the numeric offset in the memory expression into an RVA. As far as I know, there's currently no way to do that through the GUI (EDIT: in the comments below, Igor Skochinsky informs us how to do this through the GUI), but you can do it through a small IDAPython script.\n\n```\ndef make_rva(ea, n):\n    idaapi.op_offset(ea, n, ida_nalt.REFINFO_RVAOFF | ida_nalt.REF_OFF64, idaapi.BADADDR, idaapi.get_imagebase(), 0)\n\n```\nNow, you can run the make_rva function by providing the address of the instruction with the memory expression as the first argument. The second argument is the operand number: 0 for left-hand side, 1 for right-hand side. Here's an example from a database I have open. Before:\n\n```\n0000000180019AEC cmp     byte ptr [rcx+rdx+138C84h], 0\n\n```\nAfter executing make_rva(0x0000000180019AEC,0):\n\n```\n0000000180019AEC cmp     rva stru_180138C80.sectors_per_cluster[rcx+rdx], 0\n\n```\nI recently released a database of a malware sample that I had analyzed exhaustively, where I used these tricks as part of the analysis. You can get the database here, and then jump to address 0000000180014607 to check out the effects.\n\nEDIT, 08/24/2021: I reported the issue discussed above to Hex-Rays, who fixed it as of 7.6.\n\n",
      "votes": "3",
      "user": "Rolf Rolles",
      "time": "Aug 24, 2021 at 17:35",
      "is_accepted": true,
      "comments": [
        {
          "user": "quickgame",
          "text": "This is exactly what I was looking for. Thanks!",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "via UI: Ctrl-R,  OFF64 and \"use imagebase as offser base\"",
          "time": null
        }
      ]
    }
  ]
}