{
  "title": "Edit Windows protected systemfiles in VMWARE?",
  "link": "https://reverseengineering.stackexchange.com/questions/2617/edit-windows-protected-systemfiles-in-vmware",
  "content": "How can I edit Windows protected system internal files in VMWARE?\nOn a normal PC, I can simply reboot the PC and use a different Operating System to prevent the 'access denied' error... But how do I edit those protected files when inside VMWARE?\n\n",
  "votes": "4",
  "answers": 2,
  "views": "367",
  "tags": [
    "windows"
  ],
  "user": "user88004",
  "time": "Aug 11, 2013 at 1:25",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "\"In VMware\" mean inside the guest or what? It's pretty unclear what you are asking although the existing answer assumes a particular scenario.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can easily map or mount VMWare virtual disk to the host system and access needed files. To quote VMWare Workstation 9 Documentation Center:\n\nThe menu is accessed by:\n\n",
      "votes": "6",
      "user": "PSS",
      "time": "Aug 11, 2013 at 2:31",
      "is_accepted": false,
      "comments": [
        {
          "user": "PSS",
          "text": "@User88004: Within VMware Workstation Menu. What VMWare product are you using?",
          "time": null
        },
        {
          "user": "user88004",
          "text": "For some reason VMware does not allow me to read+write on those mounted virtual disks.",
          "time": null
        },
        {
          "user": "PSS",
          "text": "Before you do that, make sure your virtual machine is in shut down state, not suspended.",
          "time": null
        }
      ]
    },
    {
      "content": "You could also use another operating system, for example boot from a Linux LiveCD and make the changes you want. VMware allows you to use an ISO file directly for the dvd drive, you can do that by going in the hardware settings of your VM, selecting the CD/DVD drive and then selecting the ISO image. Your VM should then boot on the Livecd and you can now do your changes as you normally would.\n\n",
      "votes": "2",
      "user": "ekse",
      "time": "Aug 15, 2013 at 13:36",
      "is_accepted": false,
      "comments": [
        {
          "user": "user88004",
          "text": "How do you do that inside VMWARE?",
          "time": null
        },
        {
          "user": "ekse",
          "text": "edited my answer with a bit more details",
          "time": null
        }
      ]
    }
  ]
}