{
  "title": "How to attach IDA Window back to be part of the IDA main window",
  "link": "https://reverseengineering.stackexchange.com/questions/26209/how-to-attach-ida-window-back-to-be-part-of-the-ida-main-window",
  "content": "I accidently maximized the functions Window and now it is de attached from the main window:\n\n\nHow can I attach it back to be part of the main window? I tried to drag it but it doesn't work. Also re opening IDA didn't help.\n\n",
  "votes": "1",
  "answers": 2,
  "views": "2k",
  "tags": [
    "ida",
    "windows"
  ],
  "user": "E235",
  "time": "Nov 1, 2020 at 12:50",
  "comments": [],
  "answers_data": [
    {
      "content": "You can reattach your window by placing your mouse on the thin gray bar, as in this screenshot :\n\n\n",
      "votes": "2",
      "user": "Guillaume",
      "time": "Nov 1, 2020 at 20:21",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "In your screenshot, you can see a thin strip of gray between the title of the window (Functions window) and the column headers (e.g. Function name). If you hover your mouse in that gray area, it will expand and the title text (Functions window) will appear again, as in the following screenshot:\n\n\n\nOnce that happens, hold down the left click button and move the window. You will see a number of icons appear around the edges, and in the center of the IDA window, as follows:\n\n\n\nYour first option is to ignore those icons, and drag the window into the area with the tabbed window names (e.g IDA View-A, Pseudocode-A, etc). The window will become an ordinary tab again. This is probably what you want.\n\nAlternatively, you can drag your mouse onto one of the aforementioned icons to get a split-screen view. I recommend playing with them to get an intuitive feel for what the icons do, but here's a textual description:\n\n",
      "votes": "0",
      "user": "Rolf Rolles",
      "time": "Nov 1, 2020 at 20:37",
      "is_accepted": false,
      "comments": []
    }
  ]
}