{
  "title": "Where is the persistent storage on this router?",
  "link": "https://reverseengineering.stackexchange.com/questions/26383/where-is-the-persistent-storage-on-this-router",
  "content": "I am working on reversing a router for which I cannot find downloadable firmware anywhere. I managed to get a root shell on the router. I am now confused as I cannot see any persistent writeable mounts. Most are tmpfs filesystems, one is a sysfs which as far as I understand is not an actual filesystem, and /dev/mtdblock7 which is a squashfs filesystem (and is readonly). Where is the persistent storage that keeps my configurations? What am I missing here?\n\n```\n# mount\n/dev/mtdblock7 on / type squashfs (ro,relatime)\n/proc on /proc type proc (rw,relatime)\ntmpfs on /var type tmpfs (rw,relatime,size=15360k)\ntmpfs on /mnt type tmpfs (rw,relatime,size=16k)\nsysfs on /sys type sysfs (rw,relatime)\ntmpfs on /tmp type tmpfs (rw,relatime,size=3096k)\nnone on /proc/bus/usb type usbfs (rw,relatime)\n\n```\nUpdate:\n\nBoard\n\nThis is a ZTE router, the board has a printed label that says: ZXHN H367N V1.0\n\nThe default update file that uboot looks for when booting over tftp is called H367N_image.bin\n\nRunning zcu signature on the config file gives ZXDSL 931VII V3.0\n\nThe decryption password used to decrypt and encrypt the file is the same as the one used in ZXHN H208N according to this.\n\nAlso, I remember seeing H368N somewhere, but I'm not sure where.\n\nFinally I found paths that have the directory H367N_Develop_UGW5.4 in them.\n\nmtdblocks\n\n(This is a summary of what binwalk found)\n\nmtdblock0:\n\nmtdblock1:\n\nmtdblock2:\n\nmtdblock3:\n\nmtdblock4:\n\nmtdblock5:\n\nmtdblock6:\n\nmtdblock7:\n\nmtdblock8:\n\nmtdblock9:\n\nmtdblock10:\n\nmtdblock11:\n\nmtdblock6 and mtdblock8 are identical\nmtdblock7 and mtdblock9 are identical\nmtdblock3 contains the same binary as mtdblocks 6,7,8 and 9, and likely others as well.\n\nI tried remounting /dev/mtdblock7 but failed. Maybe I did something wrong but my understanding is that squashfs should not be writable in any case.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "328",
  "tags": [
    "firmware"
  ],
  "user": "alex10791",
  "time": "Nov 30, 2020 at 20:12",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "Hi and welcome to RE.SE. Please add a little more information. For starters, if it's small bits of information it may not end up in a different type of device (and specifically who says it has to be in a file system?). Also, in theory, a device could full well remount a certain file system read-write on-demand and then revert back to read only after being done saving data. What other MTD devices are there? What have you tried?",
      "time": null
    },
    {
      "user": "alex10791",
      "text": "I tried adding some information. About the filesystem question, I don't know, I assumed it would. What do you mean by \"if it's small bits of information it may not end up in a different type of device\"?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Some Routers use a NVRAM for storing settings. That would give you exactly this result: No writable partitions but some binary is taking care of reading and writing to that NVRAM (wherever that might be). Check if there's anything called nvread, nvconf or something like that.\n\nIf that's not successful you can always try to find a binary that uses a configurable option, load it into a Disassembler and see what's going on there.\n\n",
      "votes": "2",
      "user": "Richi",
      "time": "Nov 29, 2020 at 11:59",
      "is_accepted": false,
      "comments": [
        {
          "user": "multithr3at3d",
          "text": "Yeah, the command nvram should exist on the device.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "... and a device with a name containing nv probably also exists.",
          "time": null
        },
        {
          "user": "alex10791",
          "text": "there is no nvram command or device with nv in its name",
          "time": null
        },
        {
          "user": "multithr3at3d",
          "text": "@alex10791 by device, you mean you checked /dev? If still no, I'd suggest looking at some of the binaries to see if they load config at the beginning.",
          "time": null
        }
      ]
    }
  ]
}