{
  "title": "How can I get the inferred register value for an instruction in Ghidra scripting?",
  "link": "https://reverseengineering.stackexchange.com/questions/26397/how-can-i-get-the-inferred-register-value-for-an-instruction-in-ghidra-scripting",
  "content": "I'd like to get the inferred value of a register at a particular point in the disassembly listing in a Ghidra script.\n\nIn my case the target instruction is a rdmsr or wrmsr instruction, which reads or writes the MSR at ecx. While I could walk back through the previous instructions and look for a simple mov ecx, const pattern, there are significantly more ways to set ecx to some known value that the decompiler is capable of inferring.\n\nI've tried calling getRegisterValue on the rdmsr instruction, passing in a Register type describing ecx, but this just returns None. Is there a way to infer register values at a particular instruction?\n\nHere's the disassembly:\n\n\n\nAnd the decompiled result:\n\n\n\nHere's the P-Code:\n\n\n\n",
  "votes": "5",
  "answers": 1,
  "views": "3k",
  "tags": [
    "x86",
    "ghidra",
    "x86-64",
    "register",
    "script"
  ],
  "user": "Polynomial",
  "time": "Dec 1, 2020 at 16:15",
  "comments": [
    {
      "user": "Florian Magin",
      "text": "Can you post a screenshot of the actual code you are trying this with? I assume that your issue is that you are getting None for a case where it should be obvious, but adding an image would make this clearer.",
      "time": null
    },
    {
      "user": "Florian Magin",
      "text": "Also, what getRegisterValue method are you talking about specifically? IDE tells me there are 11 methods with that name, with varying signatures on different classes, none of them available by default in the Jython context (which I assume you are using because you say None instead of null)",
      "time": null
    },
    {
      "user": "Polynomial",
      "text": "@FlorianMagin I've tried a number of different variants of that method, but primarily the Instruction one and the ProgramContext one.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "After looking into this a bit, I think that it will heavily depend on the exact context.\n\nThe decompiler can definitely do a basic form of this:\n\n\nIn this cases the PCode operation for the call instruction is already:\n(register, 0x0, 4) CALL (ram, 0x125180, 8) , (const, 0x1, 4) , (const, 0x5413, 8)[0]\ni.e. it contains the propagated constants already, without any references that they were read from a register.\n\nIf you are lucky the associated PCode operations for a rdmsr or wrmsr contain this information already. I don't have a binary to test how these instructions are handled exactly though. If they in any form contain the information that they depend on the value of ecx then I would expect that the decompiler will optimize the PCode instruction to directly use the constant as the PCode argument instead if possible, like in the attached image. A quick glance into x86.sla seems like RDMSR is indeed defined in a way that should allow this to happen.\n\nThe general results of any kind of value analysis that happens inside the decompiler is not exposed in a way that I know of though.\n\n[0] This is not the PCode from the instruction but from the decompiler token. You can get this by clicking on a token (like ioctl in the decompiler and then accessing currentLocation.token.pcodeOp in the Jython shell\n\n",
      "votes": "2",
      "user": "Florian Magin",
      "time": "Dec 1, 2020 at 19:32",
      "is_accepted": false,
      "comments": [
        {
          "user": "Polynomial",
          "text": "Sadly it does not appear that RDMSR gets populated with these constants.",
          "time": null
        },
        {
          "user": "Florian Magin",
          "text": "Can you tell me the PCode OP of RDMSR instruction and the surrounding code? There are cases where the decompiler has this information but it doesn't get propagated to the PCode OP but might still be available with a little scripting. Getting RDMSR to lift as something that depends on ecx should be possible in some way if this really isn't the case yet.",
          "time": null
        }
      ]
    }
  ]
}