{
  "title": "how can I disassemble a Nand binary file from an iPod nano?",
  "link": "https://reverseengineering.stackexchange.com/questions/26450/how-can-i-disassemble-a-nand-binary-file-from-an-ipod-nano",
  "content": "Ive got a Nand image in bin format not encrypted armv4, cpu 80 MHz ARM 7TDMI processor it is a iPod nano 1st generation I want to see what calls the Nand makes because it is married to the motherboard. I have IDA Pro the cpu and version say they are supported by ida on their website but I do not see these options in the cpu selection. how would you go about disassembling a Nand dump to figure out how and why the chip is married to the motherboard. Like the iPhone I think you have to flash an identifier to the new Nand for security reasons.\n\n",
  "votes": "0",
  "answers": 1,
  "views": "93",
  "tags": [
    "disassembly",
    "decryption",
    "ipod"
  ],
  "user": "Peter Robertson",
  "time": "Dec 6, 2020 at 0:25",
  "comments": [],
  "answers_data": [
    {
      "content": "The 32-bit ARM ISA is (mostly) backwards compatible so just pick the generic ARM processor, you don’t necessarily have to match it exactly.\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Dec 6, 2020 at 1:20",
      "is_accepted": false,
      "comments": [
        {
          "user": "Peter Robertson",
          "text": "well I used Arm little endian and I found an option for armv4 nd things are making a little more sense but it doesnt seem to be quite there. What cpus might be backwards compatible with 80 MHz ARM 7TDMI PortalPlayer PP5021C \"system on a chip\"",
          "time": null
        },
        {
          "user": "Peter Robertson",
          "text": "Ok that works now its in assembly  and shows all the registers hw can I go farther / where are some resources where I can learn how to fully disassemble. this is the file : app.box.com/s/t3k2qk67d82whwasub3fuzg2qbfibytx ive been doing a lot of reading but its always extremely basic and doesnt explain much. should I use different decompiler for assembly?",
          "time": null
        }
      ]
    }
  ]
}