{
  "title": "What is difference between Digital Forensic and Reverse Engineering",
  "link": "https://reverseengineering.stackexchange.com/questions/2652/what-is-difference-between-digital-forensic-and-reverse-engineering",
  "content": "I am not able to understand exact difference in Digital Forensic and Reverse Engineering. Will Digital Forensic has anything to do with decompilation, assembly code reading or debugging?\n\n",
  "votes": "7",
  "answers": 2,
  "views": "2k",
  "tags": [
    "tools",
    "disassembly",
    "decompilation",
    "debuggers",
    "digital-forensics"
  ],
  "user": "Pranit Kothari",
  "time": "Aug 19, 2013 at 11:01",
  "comments": [],
  "answers_data": [
    {
      "content": "It might be said that the goals (motive) of the investigation rather than the tools or techniques determine whether some work would be classified as digital forensics or reversing.\n\nDefinitionally digital forensics is the examination and analysis of digital evidence for use in a legal proceeding. It is certainly true that not all DF is for legal cases, but that is what forensics means :)\n\nReverse engineering is the process of , well, reversing someone else's engineering. There are plenty of reasons to use RE techniques that don't have anything to do with legal investigations, including reversing to gain and maintain compatibility or purely for education and knowledge.\n\nDecompilation/disassembly, debugging, and reading code/assembly, are all techniques that can be used in DF (DFIR), development and testing of software and hardware, as well as RE.\n\n",
      "votes": "6",
      "user": "adric",
      "time": "Aug 17, 2013 at 16:37",
      "is_accepted": true,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "Missing a very important difference in the approach itself. In forensics one has to be very careful not to change anything, whereas in RCE \"anything goes\".",
          "time": null
        },
        {
          "user": "adric",
          "text": "Thanks for commenting. Although I agree much more could be said about the forensic perspective differing from that of RE I don't agree with either of your suggestions. I would say that desired outcome dictates techniques in both fields. Most forensics processes take great care to be reproducible and not to destroy evidence. I think the same is true in a very different way of RE.",
          "time": null
        }
      ]
    },
    {
      "content": "At a very high level...\n\nReverse engineering typically focuses on recovering the functional specifications of code.\n\nDigital forensics typically focuses on recovering data.\n\n",
      "votes": "3",
      "user": "Jason Geffner",
      "time": "Aug 18, 2013 at 22:16",
      "is_accepted": false,
      "comments": []
    }
  ]
}