{
  "title": "BYTE3, does it mean the third or fourth byte of an int? IDB file that's already supplied",
  "link": "https://reverseengineering.stackexchange.com/questions/2657/byte3-does-it-mean-the-third-or-fourth-byte-of-an-int-idb-file-thats-already",
  "content": "I've got a program that i'm trying to debug a little bit by trying to make sense of a function or two, there's already some info that i've downloaded via a idb file and it's helped me get somewhere. But i'm kind of stuck on a part where i've got something like this:\n\n```\nBYTE3(v1) = 0;\n\n```\nThis is from the ida hex-rays plugin which has made some nice c-pseudo code for me. I can't double click the function and get it translated in some way so i don't really know how to understand what it does, my guess is that it takes either the third or fourth byte of an int. So my question is, how would i be able to find this function and look at it's disassembly at least if it can't be translated by hex-rays? The signature if that helps at all looks like this according to ida: _BYTE __fastcall(int)\n\n",
  "votes": "9",
  "answers": 1,
  "views": "6k",
  "tags": [
    "disassembly",
    "ida",
    "c",
    "c++"
  ],
  "user": "lfxgroove",
  "time": "Aug 18, 2013 at 10:05",
  "comments": [
    {
      "user": "DCoder",
      "text": "Yes, it sets the fourth byte of v1. Place your cursor inside the expression BYTE3(v1), hit Tab, it'll switch to the corresponding place in the disassembly view.",
      "time": null
    },
    {
      "user": "lfxgroove",
      "text": "Oh, didn't know about that, thanks alot!",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "All Hex-Rays macros are defined in <IDA directory>\\plugins\\defs.h. It's also available at https://github.com/nihilus/hexrays_tools/blob/master/code/defs.h\n\nFor BYTE3(x):\n\n```\n...\n#define BYTEn(x, n)   (*((_BYTE*)&(x)+n))\n...\n#define BYTE3(x)   BYTEn(x,  3)\n...\n\n```\nSo BYTE3(x) yields (*((_BYTE*)&(x)+3)), which effectively means the fourth byte of the value x.\n\n",
      "votes": "15",
      "user": "caot",
      "time": "Jun 12, 2018 at 21:21",
      "is_accepted": true,
      "comments": []
    }
  ]
}