{
  "title": "How can I find a value in Tricore(TC1766) Arch?",
  "link": "https://reverseengineering.stackexchange.com/questions/26591/how-can-i-find-a-value-in-tricoretc1766-arch",
  "content": "I recently work on Tricore Processor, but I have some problems.\nWith reading memory value. I do not know if I am right or not, but I think a part of flash memory copied to RAM and now in my algorithm used of RAM cell.\nI have shown Code in below:\n\n```\nld32.a          a15, [a0]-0x7BA4 ; a0 = 0xD00032E0\n\n```\nAs you see, a15 is an address that point to a constant value(store in RAM or FLASH) and a0 is the base address of RAM memory. To calculate a15, I subtract a0 from 0x7BA4 but the result is 0xCFFFB73C. This Address is not a valid address of RAM.\nEDITED:\nI saw a freaky sentence in Tricore document.(I have shown in below)\n\nAs you see, A[0] can be protected by user application.\nCould it be protected in this case as well?\nWhat is my wrong? What should I do? How can I get the correct value of a15?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "368",
  "tags": [
    "ida",
    "firmware",
    "static-analysis"
  ],
  "user": "Unicornux",
  "time": "Dec 21, 2020 at 12:28",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "did you find where a0 is initialized? Maybe it's not 0xD00032E0.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "It seems the address falls into the Scratchpad RAM region, so it’s probably initialized somewhere else. Try to look for references to C4000000 or C8000000, or other occurrences of -0x7BA4 - maybe you’ll find the place where the variable is written to.\n\n\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Dec 20, 2020 at 23:44",
      "is_accepted": false,
      "comments": [
        {
          "user": "Unicornux",
          "text": "♦ Interesting. I've never given it much thought. I edited my question. Maybe it will help us to solve the problem.",
          "time": null
        }
      ]
    }
  ]
}