{
  "title": "Where to find (free) training in reverse engineering? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/265/where-to-find-free-training-in-reverse-engineering",
  "content": "Can someone give a list of websites with good (and free) reverse engineering training exercises ?\n\n",
  "votes": "64",
  "answers": 6,
  "views": "33k",
  "tags": [
    "obfuscation",
    "cryptography"
  ],
  "user": "perror",
  "time": "12 years ago",
  "comments": [
    {
      "user": "asheeshr",
      "text": "meta.reverseengineering.stackexchange.com/questions/53/…",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@perror: Kris Kaspersky did offer something like that some time ago.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The organisation OpenSecurityTraining offers free training materials under creative commons type licenses. Many of the training's are videos, while others are slide decks and related class materials (scripts, malware samples and so on). The course-ware comes under 3 categories and features the following items (Which I have edited to include the RE related material):\n\nBeginner:\n\nIntermediate:\n\nAdvanced:\n\nDisclosure: I am not associated with OpenSecurityTraining in any way and have only worked through a small portion of their total offerings. Seems like a great resource though.\n\n",
      "votes": "50",
      "user": "AminM",
      "time": "Jun 30, 2017 at 14:44",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Here are my favorite. I started with Lena's tutorials, they are really awesome.\n\n",
      "votes": "21",
      "user": "samuirai",
      "time": "Mar 26, 2013 at 10:23",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "The Legend of R4ndom has a long series on a variety of reversing topics. http://thelegendofrandom.com/blog/sample-page\nhttp://octopuslabs.io/legend/blog/sample-page.html\n\n",
      "votes": "16",
      "user": "Megabeets",
      "time": "Feb 12, 2018 at 8:34",
      "is_accepted": false,
      "comments": [
        {
          "user": "Mick",
          "text": "These tutorials are awesome.",
          "time": null
        },
        {
          "user": "JAL",
          "text": "Unfortunately it looks like the link is now dead.",
          "time": null
        },
        {
          "user": "AltairAC",
          "text": "web.archive.org/web/20150526025225/http://thelegendofrandom.com/…",
          "time": null
        },
        {
          "user": "TheGameiswar",
          "text": "New link: octopuslabs.io/legend/blog/sample-page.html",
          "time": null
        }
      ]
    },
    {
      "content": "Here are the websites I know:\n\n",
      "votes": "15",
      "user": "perror",
      "time": "Feb 15, 2021 at 10:29",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I typed out this answer and then realized that you wanted free (as in beer) materials.  Minus 100 points for me.  This answer assumes that you want to learn how to reverse engineer in a software environment.\n\nUnder this assumption, and assuming you have a base understanding of a programming or scripting language, such as C/C++ or Python respectively, there are many, many topics to begin with to learn how to \"reverse engineer\" in a software environment.  A good first task for a beginner is to obtain a working knowledge of the Assembly Language.  A good resource for this (at least for me) was the Windows Debugging: Practical Foundations book by Dmitry Vostokov.  The book costs $14.\n\nThe objective of the book is to teach you how to use WinDbg to debug Windows Applications; however, along the way you will get an excellent, hands on introduction to the Assembly Language.\n\nPlease Note: I am in no way associated with Dmitry; however, I did buy the e-book.\n\n",
      "votes": "10",
      "user": "Joe Gatt",
      "time": "Mar 25, 2013 at 23:56",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "The classes by Dan Guido at http://pentest.cryptocity.net/ are pretty good too.  I used them as a reference when I first started getting into RE.  They cover a large subject area in addition to RE and are well taught.\n\n",
      "votes": "8",
      "user": "Modoc",
      "time": "Mar 26, 2013 at 11:18",
      "is_accepted": false,
      "comments": []
    }
  ]
}