{
  "title": "Is there an easier way to break on a rootkit driver load, other than disassembling IopLoadDriver?",
  "link": "https://reverseengineering.stackexchange.com/questions/26700/is-there-an-easier-way-to-break-on-a-rootkit-driver-load-other-than-disassembli",
  "content": "The only method i know to break on a DriverEntry of a rootkit driver when its loaded is to disassmble nt!IopLoadDriver and find an indirect call in it and break on it. Setting a break point on rootkitDriverName!DriverEntry doesn't work either for some reason.\n\nIs there any easier way to break on the rootkit driver entry? Why does rootkitDriverName!DriverEntry not work?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "274",
  "tags": [
    "malware",
    "windbg",
    "kernel"
  ],
  "user": "Notoriouss",
  "time": "Jan 5, 2021 at 12:59",
  "comments": [
    {
      "user": "DoomedRaven",
      "text": "Here are more info about this, and nicely explained few different methods blogg.pwc.no/styringogkontroll/…",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Try enabling break on module load:\n\n```\nsxe ld rootkitDriverName\n\n```\nSee also https://reverseengineering.stackexchange.com/a/2638/60\n\n",
      "votes": "3",
      "user": "Igor Skochinsky",
      "time": "Jan 4, 2021 at 20:16",
      "is_accepted": true,
      "comments": [
        {
          "user": "Notoriouss",
          "text": "Thanks, but the problem is, this still doesnt break on the driverEntry of the rootkit driver and instead its in a kernel function related to debugging, and using bu rootkitDriver!DriverEntry doesnt work, it gives this error \"Couldn't resolve error\". (I am loading the driver using OSRloader)",
          "time": null
        },
        {
          "user": "blabb",
          "text": "with sxe ld you also need !gflag +ksl and a valid pdb and /or .reload /f  (couldnt resolve is because you do not have a symbol file )",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "@Notoriouss: I think !drvobj should display the entry address so you can set breakpoint there.",
          "time": null
        },
        {
          "user": "Notoriouss",
          "text": "@IgorSkochinsky but !drvobj gives the symbol error as well, i do not have the pdb file for the driver tho, should the symbol get resolved considering i don't have the pdb?  i use !drvobj rootkitdrivername, the same name that i registered with OSRloader, and the same one that lm shows",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "@Notoriouss are you sure the error is about the driver and not kernel symbols which are necessary for the command to work?",
          "time": null
        }
      ]
    }
  ]
}