{
  "title": "Restoring online functionality of an obsucure Korean PS2 horror game",
  "link": "https://reverseengineering.stackexchange.com/questions/26723/restoring-online-functionality-of-an-obsucure-korean-ps2-horror-game",
  "content": "Last year I posted for help in order to reverse-engineer and translate a Korean exclusive Horror game for the Playstation 2 called Mystic Nights. Here is the Original Post.\n\nThanks to the kind folks here as well as a lot of trial and error, I finally finished the translation 6 or so months ago.\n\nThe game has an online mode to play with Friends [Network Mode] but Sony's korean servers for this game have been down for several years. Is there a way to ge this mode working again with hamachi or something? Any help would be greatly appreciated. There is no footage online about this game's multiplayer mode so this is very interesting.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "110",
  "tags": [
    "networking",
    "game-hacking",
    "hexadecimal"
  ],
  "user": "Shpack",
  "time": "Jan 6, 2021 at 23:06",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "Well, I guess it depends how much of the logic was offered by the server-side. If the clients are all basically syncing their state it may be possible to recreate the server-side, but I'd say this will be a rather painstaking process. However, if a lot of the logic resided server-side it will be hard to fill these gaps. Well, perhaps not hard per se, but since your goal seems to be a reconstruction of the server, it implies you don't just want to make up server-side behavior, you want to create a proper replica of what a server was originally.",
      "time": null
    },
    {
      "user": "Shpack",
      "text": "@0xC0000022L I bypassed DNAS but then I'm greeted with a message saying \"Failed to connect to a server.\" It would seem I would have to find some way to recreate the logic that was residing on the server. Is it even possible to reverse engineer this? I don't have the source code.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "as I was trying to explain, for anything that resides purely on the server side you'd have to make up stuff as you go. With a server still available (or if you got your hands on a server against which you can run the game somehow), you could make up stuff to recreate the feel as closely as possible. But without that available, you would literally make up things from thin air and it would not be recreating the original, but rather you reimagining it. So I think you're out of luck unless you can get your hands on a copy of the server-side somehow or recordings of actual game play ...",
      "time": null
    }
  ],
  "answers_data": []
}