{
  "title": "How devices such as smart Wi-Fi power plugs and Wi-Fi ip cameras connect to a private Wi-Fi network?",
  "link": "https://reverseengineering.stackexchange.com/questions/26729/how-devices-such-as-smart-wi-fi-power-plugs-and-wi-fi-ip-cameras-connect-to-a-pr",
  "content": "How devices such as smart Wi-Fi  power plugs and  Wi-Fi ip cameras connect to a private Wi-Fi network ?\n\nThe usual steps are the following :\n\nWhat are the technologies/protocol behind that steps ?\n\nLet's say that in 10 years the maker application will not exists anymore. How I will be able to connect my device to my network ?  What about password security during step 4?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "219",
  "tags": [
    "hardware"
  ],
  "user": "Erwan",
  "time": "Jan 8, 2021 at 12:33",
  "comments": [
    {
      "user": "Robert",
      "text": "Typically the Wifi password is sent in plain text obfuscated from app the adapter using Wifi. The app sends broadcast packets into the encrypted network and the smart WiFi power plug scans the networks for encrypted broadcasts (it can not read). The password is usually transmitted bit-for-bit e.g. using the packet length of the encrypted broadcast packets as data (the packet length can be determined even if you can not decrypt the Wifi payload). Decompiling the Android app should show you the exact way that us used to transmit the password.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "Simply make sure to purchase equipment that allows you to be flashed with firmware you can control, such as Tasmota. If you make this a conscious decision, you are \"voting with your wallet\".",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "There are many ways this can be done, only really limited by capabilities of smartphones, but here are a few common examples:\n\n",
      "votes": "0",
      "user": "multithr3at3d",
      "time": "Jan 11, 2021 at 22:30",
      "is_accepted": false,
      "comments": [
        {
          "user": "masterX244",
          "text": "for REers: First method occassionally contains a entrance into the device, too if the script/program handling the configuration request is buggy.",
          "time": null
        }
      ]
    }
  ]
}