{
  "title": "Frida reading files is slow",
  "link": "https://reverseengineering.stackexchange.com/questions/26737/frida-reading-files-is-slow",
  "content": "I need to read a file around 2 MB into a byte array.\n\n```\nvar fis = Java.use(\"java.io.FileInputStream\");\nvar file = fis.$new(\"/data/local/file.txt\");\nvar fileBytes = new Uint8Array(file.available());\nvar x;\nwhile ((x = file.read()) != -1)\n    fileBytes.push(x);\n\n```\nI'm using the code above but it's reading ~100 kb/s which takes ~20 seconds in my case.\n\nI also tried with ByteArrayOutputStream with 1, 4, 16kb buffers but result isn't any different.\n\nI believe a native Java function which takes Inputfilestream and returns a bytearray will fix my issue, but I couldn't find any.\n\nHow can I make this process faster?\n\nI'm actually trying to use it with okio.ByteString which has a .read() method, but I can't access it from Frida. It's undefined.\n\n",
  "votes": "3",
  "answers": 2,
  "views": "2k",
  "tags": [
    "android",
    "java",
    "function-hooking",
    "frida"
  ],
  "user": "Cagri",
  "time": "Jan 10, 2021 at 0:25",
  "comments": [],
  "answers_data": [
    {
      "content": "The reason why your code is slow is not Frida but your code. Your code would be also slow when executed in plain J2SE Java.\n\nThe simple reason is because you are reading the file byte by byte using an unbuffered FileInputStream which is the worst way you can read a file. Typically IO operations work on blocks of at least 4096 bytes (a typical block site in a file-system).\n\nTherefore a simple modification would be to wrap the FileInputStream in an BufferedInputStream:\n\n```\nvar fis = Java.use(\"java.io.FileInputStream\");\nvar bis = Java.use(\"java.io.BufferedInputStream\");\nvar file = bis.$new(fis.$new(\"/data/local/file.txt\"));\n...\n\n```\nHowever this does not the read calls which will take significant time. Therefore the following code reads byte blocks and procesess them.\nThis should be a lot faster:\n\n```\nvar fis = Java.use(\"java.io.FileInputStream\");\nvar file = fis.$new(\"/data/local/file.txt\");\nvar fileBytes = new Uint8Array(file.available());\nconst buffer = Java.array('byte', new Array(4096).fill(0));\nvar x;\nwhile ((x = file.read(buffer)) != -1) {\n    for (int i = 0; i < x; i++) {\n        fileBytes.push(buffer[i]);\n    } \n}\n\n```\nThe fasted way would be if your app would contain Java code that directly read a file to a byte array. The less Frida JavaScript calls you have to perform the faster the result.\n\nTherefore check if your app contains a libraray like Apache common IO. Then you could directly execute org.apache.commons.io.IOUtils.toByteArray(java.io.InputStream).\n\n",
      "votes": "2",
      "user": "Robert",
      "time": "Jan 11, 2021 at 8:06",
      "is_accepted": false,
      "comments": [
        {
          "user": "Cagri",
          "text": "Thanks for your answer, however I already tried with buffer previously and speed is almost the same. I had not tried Java.array but it doesn't seem to work too. I've posted an answer which worked for me",
          "time": null
        }
      ]
    },
    {
      "content": "Unfortunately using buffer still didn't help me.\n\nI guess doing JS -> Java -> JS -> Java takes a bit long. I have found this solution:\n\n```\nvar Files = Java.use(\"java.nio.file.Files\");\nvar Paths = Java.use(\"java.nio.file.Paths\");\nvar URI = Java.use(\"java.net.URI\");\n\nvar fileBytes = Files.readAllBytes(Paths.get(URI.create(\"file:///sdcard/file.jpg\")));\n\n```\nIt does reading in Java and returns a byte array which is pretty fast.\n\n",
      "votes": "1",
      "user": "Cagri",
      "time": "Jan 11, 2021 at 8:26",
      "is_accepted": false,
      "comments": [
        {
          "user": "Robert",
          "text": "Indeed I forgot that Files.readAllBytes is a Java7 function and is therefore available on Android. But how to you convert this to an Uint8Array? I would assume that converting it byte for byte is still a very slow operation.",
          "time": null
        },
        {
          "user": "Cagri",
          "text": "@Robert I have checked and yes, new Uint8Array(fileBytes) is still slow. typeof fileBytes shows it as an object, so I'm not exactly sure about the type, and if we even need to convert it, because the converted one looks same. I'm actually passing this array (without converting) to okio.ByteString to use it in the Android application, which works pretty fast",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "This is not a forum; please use the answer box only for answers to the asked question.",
          "time": null
        }
      ]
    }
  ]
}