{
  "title": "Recreating ping command injection using curl instead using web page on Huawei router",
  "link": "https://reverseengineering.stackexchange.com/questions/26837/recreating-ping-command-injection-using-curl-instead-using-web-page-on-huawei-ro",
  "content": "I have an ARM based Huawei router and Im trying to do injection vulnerability on page under diagnostics where's \"ping\" feature is. So first I tried this command -c 1 127.0.0.1 and it worked\n\n```\n--- DNS Statistics ---\nServer Response = Non-Existent Domain\nWanIP = xxx.xxx.xxx.xxx\nName = -c 1 127.0.0.1\nAddress = -\nAliases = -\nTime = 15ms\n--- Ping Statistics ---\nOperation failed.\n\n```\nthen I tried this command 127.0.0.1; echo -c 4 but I get\n\n```\nTest failed.\n--- Ping Statistics ---\nOperation failed.\n\n```\nand after some more google-ing I found this command ping -c 5 \"$(id)\" and when I click on start ping` it seams that's get stuck in some loop\nI suspect that maybe shell is open, here is how it looks\n\n\n\nSo I want to recreate sending that command with curl, I created mine curl like this\n\n\n\nI think maintenancend.cgi is resposable for ping requests. In zip you will find Diagnose Ping Configuration.html and ARM web utility which is responsible for\n.cgi web requests\n\nEdit:\nSo I made request directly to my web ping page and it look's like this\n\n\n\nfirst button should be start and second stop but they are in java so I need a way to refer to them by name. Also I found example of POST method on web end here it is\n\n```\ncurl -X POST -F 'name=linuxize' -F '' https://example.com/contact.php\n\n```\nbut I need names of buttons/fields to supply and there is non in that \"java button's\". Here you can find emulated web UI\n\n",
  "votes": "0",
  "answers": 1,
  "views": "811",
  "tags": [
    "injection",
    "command-line",
    "router"
  ],
  "user": "Vido",
  "time": "Jan 22, 2021 at 21:29",
  "comments": [
    {
      "user": "multithr3at3d",
      "text": "You may not be able to see the output; try a command that creates a connection or something. If you don't know how to use curl, you should read the manpage",
      "time": null
    },
    {
      "user": "Vido",
      "text": "man page for curl is huge but it seams that I need to read it all",
      "time": null
    },
    {
      "user": "multithr3at3d",
      "text": "Well the -F is usually for multi-part POST data, you should probably just use --data or its variants instead.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Use the browser tools (F12 in most browsers) and check how request is sent when you perform the action in the web UserInterface. Some browsers even have a 'copy as cURL' context menu item for network requests.\n\n",
      "votes": "1",
      "user": "Vido",
      "time": "Jan 29, 2021 at 18:25",
      "is_accepted": false,
      "comments": [
        {
          "user": "Vido",
          "text": "I found how requests looks like https://192.168.100.1:80/html/management/complex.cgi?x=InternetGatewayDevice.IPPingDiagnostics&RUNSTATE_FLAG=Ping&RequestFile=html/management/diagnose_common.asp but I can't recreate java button pressed thing",
          "time": null
        },
        {
          "user": "Vido",
          "text": "you did no read my post I did used  browser tools to create my curl command",
          "time": null
        }
      ]
    }
  ]
}