{
  "title": "How can I decompile my (dot)NET .EXE file into its source code [duplicate]",
  "link": "https://reverseengineering.stackexchange.com/questions/2688/how-can-i-decompile-my-dotnet-exe-file-into-its-source-code",
  "content": "I was working on a C#.NET application on windows platform, I was just testing the code and I don't know somehow I messed it up and after making too much efforts on undoing, I am still not able to recover my code. I don't want to write the whole code again.\n\nI only left with its .EXE file that executes well here, I want to know about some techniques or tools so that I can decompile my EXE code into its source code, Is it possible if it is, then please tell me some good decompilers. Any help will be appreciated, Thanks.\n\n",
  "votes": "4",
  "answers": 2,
  "views": "52k",
  "tags": [
    "decompilation",
    "executable"
  ],
  "user": "khk",
  "time": "10 years ago",
  "comments": [
    {
      "user": "DCoder",
      "text": "reverseengineering.stackexchange.com/questions/2217/…",
      "time": null
    },
    {
      "user": "khk",
      "text": "I visited this link, but it is about anti decompilation",
      "time": null
    },
    {
      "user": "Kevin",
      "text": "Thank you ph0sec for your answer. It helped me out. I have my Projects spread over 11 hard drives and 4 USB drives but my last update to one of my best programs I cannot find anywhere. With this I was able to recover the missing code in that update.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "you can get pretty decent results with:\n\n",
      "votes": "4",
      "user": "PhoeniX",
      "time": "Aug 26, 2013 at 13:57",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "To build off of what the last user said, either Reflector or IlSpy will do the job. However that being said I'd recommend IlSpy over Reflector. Both of them will decompile the program into the intermediate language to roughly the same results but I've had better experiences (i.e. smoother, easier) parsing variable values using IlSpy.\n\nBut if it's your own code and you remember what all of your variable values are then either one will work fine. Just my two cents.\n\n",
      "votes": "1",
      "user": "Fewmitz",
      "time": "Aug 26, 2013 at 2:20",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "This should have been a comment or edit.",
          "time": null
        }
      ]
    }
  ]
}