{
  "title": "Is the code like this reverse able? (from Assembly - UnityScript)",
  "link": "https://reverseengineering.stackexchange.com/questions/26949/is-the-code-like-this-reverse-able-from-assembly-unityscript",
  "content": "\n\ni try to reverse this code but cant figure it out what is this number mean or how to call it...\n\n",
  "votes": "0",
  "answers": 1,
  "views": "124",
  "tags": [
    "disassembly",
    "assembly",
    "decompilation",
    "disassemblers",
    "byte-code"
  ],
  "user": "EntryEmb",
  "time": "Feb 5, 2021 at 9:25",
  "comments": [
    {
      "user": "sudhackar",
      "text": "Please post code as text instead of an image. Makes it easier for others to read/copy and for sites like google to index.",
      "time": null
    },
    {
      "user": "sudhackar",
      "text": "If you look at the if clauses they don't have any additional variables present. Any optimizing decompiler can handle this pretty well. google \"opaque predicates\" and how to deal with them.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You did not understand why your code is using an obfuscador, first you need to remove the obfuscador used by the developer to only then start the process of reconstructing the algorithm, use appropriate tools for this task like DIE (Detect It Easy), after discovering the name of the obfuscador look for a way to clear its torque, there are many ways for almost all obfuscadores.\n\n",
      "votes": "0",
      "user": "Happy",
      "time": "Feb 5, 2021 at 11:07",
      "is_accepted": true,
      "comments": [
        {
          "user": "Happy",
          "text": "Also be aware to differentiate a Protector from an Obfuscator, Obfuscators are relatively easy to remove since Protector requires a high knowledge of the IL(.NET architecture).",
          "time": null
        },
        {
          "user": "EntryEmb",
          "text": "Thank you im very new about this thing and... should the number just clean without anything left? because i found that it has .net reactor ,and after i cleaned all and i fell like just the number is gone because the file size just decrease like half of old size.   Thank you",
          "time": null
        },
        {
          "user": "EntryEmb",
          "text": "like this one Before : ibb.co/NFYPfd4 file size : 22 KB after clean protector (.Net reactor) : ibb.co/W3r9hNX file size 16 KB",
          "time": null
        },
        {
          "user": "Happy",
          "text": "Yes, now the structure of your software is rebuilt and ready to be analyzed, obfuscadores such as .Net Reactor add more routines to confuse your analysis, thus increasing the size of your final executable, now you can start your code analysis, stay tuned for some references as they may have been lost...",
          "time": null
        },
        {
          "user": "EntryEmb",
          "text": "Thank you so much 0x0A",
          "time": null
        }
      ]
    }
  ]
}