{
  "title": "Reverse engineering and copyright?",
  "link": "https://reverseengineering.stackexchange.com/questions/27003/reverse-engineering-and-copyright",
  "content": "I am surprised this question is not asked by anyone else yet.\n\nLegally, which software -- aside from open source software -- am I able to explore to basically enhance my knowledge of how computer systems work? I would like to add that I am not interested in doing something professional or advanced more suitable to the employees of IT industry. I just want to make myself more intelligent and knowledgeable, possibly delaying dementia and preventing chronic diseases. That is, I am not interested in maintaining virtual machines to reverse engineer malware/illegal software. Thank you.\n\n",
  "votes": "-1",
  "answers": 1,
  "views": "154",
  "tags": [
    "law",
    "copy-protection"
  ],
  "user": "ToraneHS",
  "time": "Feb 14, 2021 at 20:19",
  "comments": [
    {
      "user": "Ricardo",
      "text": "Do you know about crackmes?",
      "time": null
    },
    {
      "user": "ToraneHS",
      "text": "I had no idea about crackmes. Thank you. A simple DuckDuckGo search enhanced my knowlege.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "For your private leisure you are always able to inspect anything you please. When it comes to disclosing your findings or using said knowledge to clone the software functionally, that's when you touch the copyright/IP domain. But even then it depends on what this is about. For example to work toward interoperability (with a file format or protocol) a lot is allowed in several jurisdictions. But cloning a software based on reverse engineering it, in order to compete with the original maker is probably going to get you in trouble. But IANAL and probably few if any user here.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "As a side note: similar questions have indeed been asked; some were closed, some probably deleted. Such question is arguably also not a reverse engineering question. But the answer depends on time and jurisdiction. So instead of asking a bunch of laypeople (regarding law) about advice for a jurisdiction they may never have physically visited (and which you don't even specify) you'd be better off seeing a lawyer in your jurisdiction and asking pointed questions about the stuff you care about. That said: what you do within your own four walls won't cause issues until you publish.",
      "time": null
    },
    {
      "user": "hairlessbear",
      "text": "If you're in the US, EFF has a good page on the laws surrounding reverse engineering: eff.org/issues/coders/reverse-engineering-faq",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "There are these binary that people make call crackmes. Usually made by the community for other people to learn without braking the law. Crackmes have different levels that sometimes is even harder to crack than softewares published by companies. I really like this website https://crackmes.one/\n\nThere is also CTF or capture the flag which are security competitions of different parts of security. Companies like goggle have one per year a believe.\n\nYou can google about this two and you will get a lot of material\n\nHappy hacking\n\n",
      "votes": "0",
      "user": "Ricardo",
      "time": "Feb 14, 2021 at 14:47",
      "is_accepted": true,
      "comments": [
        {
          "user": "ToraneHS",
          "text": "Thank you for your helpful answer.",
          "time": null
        }
      ]
    }
  ]
}