{
  "title": "CaptureBAT equivalent on Windows 10?",
  "link": "https://reverseengineering.stackexchange.com/questions/27051/capturebat-equivalent-on-windows-10",
  "content": "Hello RE community on stack !\n\nI am a beginner, so please pardon any commonplace errors\n\nI am looking to run CaptureBAT on a Windows 10 VM, to capture network activity of different kinds of Malwares\n\nI specifically need to run CaptureBAT since it is capable of filtering out the noise from Windows' usual services\n\nHowever, i cannot find any installer on the  internet for the utility\n\nI have found a github repository here but i am not quite sure how to compile it\n\ncan  anyone suggest any good alternatives to CaptureBAT on windows 10 or tell me a method to run this tool on Windows 10 ?\n\ni would be grateful for your kind help\n\nP.S : alternatively i am open to using any other tool, except wireshark, that would help capture network activity of the  malicious executable. I am looking forward to the suggestions of this community in this regard\n\n",
  "votes": "1",
  "answers": 3,
  "views": "2k",
  "tags": [
    "windows",
    "malware",
    "dynamic-analysis",
    "networking",
    "wireshark"
  ],
  "user": "Muhammad Yasir",
  "time": "Feb 19, 2021 at 9:36",
  "comments": [],
  "answers_data": [
    {
      "content": "Alternatively, you can use Microsoft Network Monitor tool to filter the traffic of a specific process.\n\n\n\nArchive Download Link:\nhttps://www.microsoft.com/en-us/download/details.aspx?id=4865\n\nEDIT: Figured out the problem with CaptureBAT, most likely because of it being 32 bit, while win10 is 64 bit.\n\n",
      "votes": "2",
      "user": "Abdullah Mohamed",
      "time": "Feb 21, 2021 at 8:21",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Really, if all your after is the procmon filters from CaptureBAT, go to the git hub page and download just them.  They will be about a decade old, though.  I guess they'll give you a start.  You can add to them where necessary:\n\nhttps://github.com/ph0sec/CaptureBAT-client/tree/master/ExclusionLists\n\n",
      "votes": "1",
      "user": "waydaws",
      "time": "Nov 11, 2021 at 5:31",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "An alternative to CaptureBAT on Windows 10 is FakeNet-NG.\n\n",
      "votes": "1",
      "user": "0xC0000022L",
      "time": "Nov 11, 2021 at 10:51",
      "is_accepted": false,
      "comments": []
    }
  ]
}