{
  "title": "I'm trying to clear all the Ghidra instances in my machine before reinstalling it and I'm seeing some anomalies",
  "link": "https://reverseengineering.stackexchange.com/questions/27054/im-trying-to-clear-all-the-ghidra-instances-in-my-machine-before-reinstalling-i",
  "content": "I downloaded 3 different instances of Ghidra without realizing, and after I did the locate Ghidra command, it returned:\n\n\n\nThe second folder ghidra_scripts is unimportant and doesn't contain any instances in it,\nbut the .ghidra folder had 2 instances in it and I went inside it and removed both 9.1 and 9.2 instances from it already and did the locate ghidra command again, and it was still there for some reason, so I tried to 'rm' it and it returned no such file or directory under this directory\n\nI restarted my computer to see if it would still be there, and it is.\n\nI also see a ghidra.rb file under /usr/local/Homebrew/Library/Taps/homebrew/homebrew-cask/Casks/ghidra.rb\n\nI already did the brew uninstall Ghidra command and it returned\n\n\n\nShould I remove this file under Casks before I continue towards redownloading Ghidra again?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "ghidra"
  ],
  "user": "PsOom",
  "time": "Jul 26, 2021 at 9:16",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "Try SuperUser for package management/installation issues. Just because it involves Ghidra doesn’t make your problem to be about RE.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Yes, you can safely remove these directories. These directories are created by default in your home directory (System.getProperty(\"user.home\")). These directories contain preferences, script/application logs and other “cached” files. (This cache path is decided using getUserSettingsDirectory()) divided by you Ghidra version.\n\nAlso, if you reinstall, rerun Ghidra, they get recreated.\n\n",
      "votes": "1",
      "user": "MarianD",
      "time": "Aug 20, 2022 at 14:28",
      "is_accepted": false,
      "comments": []
    }
  ]
}