{
  "title": "Golang program reversing with Radare2",
  "link": "https://reverseengineering.stackexchange.com/questions/27091/golang-program-reversing-with-radare2",
  "content": "I'm trying to understand how to reverse golang programs with radare2. In order to practice, i create a minimal program in Go:\n\n```\npackage main\nimport \"fmt\"\nfunc main() {\n    fmt.Println(\"Hello World!\")\n}\n\n```\nIn the resulting assembly code below, i found the main function (main.main) but i can't figure how to display the string passed in argument to Println.\n\n```\n;-- sym.go.main.main:\nmov rcx, qword fs:[0xfffffffffffffff8]\ncmp rsp, qword [rcx + 0x10]\njbe 0x485097\nsub rsp, 0x48\nmov qword [var_40h], rbp\nlea rbp, [var_40h]\nxorps xmm0, xmm0\nmovups xmmword [var_30h], xmm0\nlea rax, [0x004958e0]\nmov qword [var_30h], rax\nlea rax, obj.main.statictmp_0 ; 0x4c8490\nmov qword [var_38h], rax\nlea rax, [var_30h]\nmov qword [rsp], rax\nmov qword [var_8h], 1\nmov qword [var_10h], 1\ncall sym.fmt.Println\nmov rbp, qword [var_40h]\nadd rsp, 0x48\nret\ncall sym.runtime.morestack_noctxt\njmp sym.main.main\n\n```\nAny tips ? Im new in reverse.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "radare2"
  ],
  "user": null,
  "time": "Feb 24, 2021 at 14:58",
  "comments": [],
  "answers_data": [
    {
      "content": "Here is the set of tools that I use in my GO analysis and reverse engineering, I'm sure it will be very useful for you to use it until it is simplified, but you still need a knowledge of IA-32/64, GO-RE KIT, another tip I have to give you is \"Keep an eye on the debbug sections\", GO developers often forget the debbug section and this can make your life easier when analyzing, here is a list of useful materials cured by me that will help you:\n\n",
      "votes": "3",
      "user": "Happy",
      "time": "Jun 15, 2021 at 11:19",
      "is_accepted": false,
      "comments": [
        {
          "user": "user35935",
          "text": "Thanks for the resources ! But why do i need to use specialized tools ? Is this impossible with just radare2 ?",
          "time": null
        },
        {
          "user": "Happy",
          "text": "It is not impossible, on the contrary it is excellent to use tools like radare2, we will take into account the difference between languages for example when we compile in C we have some more code represented by the functions in which we already know, for example a printf, already in GO for being a new language some tools do not have this support or if it is still very initial and for beginners using a specific tool will help to better understand the source decompiled, and consequently understand faster and analyze in different and simplified ways.",
          "time": null
        },
        {
          "user": "Happy",
          "text": "After some time doing the reverse engineering for specific tools as mentioned by me you will have a new vision and consequently you will be able to better differentiate the machine code in tools like radare2 or other excellent tools that help our life.",
          "time": null
        }
      ]
    }
  ]
}