{
  "title": "Bypassing motion control on LED light PCB",
  "link": "https://reverseengineering.stackexchange.com/questions/27144/bypassing-motion-control-on-led-light-pcb",
  "content": "I am a super noob at any type of reverse engineering and electrical in general but I think I can do this.\n\nI bought these lights Artika Cabinet Lights Model# UCLT and found that the motion/light sensor sucks. I would love to just have a physical button.\n\nI took the light apart and found a small PCB with the motion sensor and power in. The product can dim the lights if you keep your hand near the sensor. I am assuming that is what a lot of the other parts of the PCB are.\n\n\nComing off this board are 3 wires labelled LED+ LED- and LED-.\n\nMy idea is to unsolder the motion sensor and put a simple button that I have replacing it. The button is a JST 2-pin Extension. I am assuming the solder points for the motion sensor is + and - and when it senses motion, it completes the circuit. But I am assuming...\n\nI have no idea what the power in is and my toggle button might not be regulated for such power.\n\nMy questions are:\n\nAny input or warnings would be greatly appreciated!\n\n",
  "votes": "2",
  "answers": 3,
  "views": "986",
  "tags": [
    "integrated-circuit"
  ],
  "user": "Alex",
  "time": "Mar 3, 2021 at 18:02",
  "comments": [
    {
      "user": "peter ferrie",
      "text": "I’m voting to close this question because this would be better suited for electronics.stackexchange.com",
      "time": null
    },
    {
      "user": "dvrguyhotmailcom",
      "text": "Thx Ron, your simple fix worked brilliantly!",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "It's probably useful to understand a bit of how this works.  Generally, the parts you have outlined in red are an infrared (IR) transmitter and receiver.  It works by shining infrared light and then trying to see if there is any reflected, which happens if there is something (like a hand) that reflects IR.  The transmitter is just an IR LED and the receiver is typically going to be a phototransistor or light-dependent resistor (LDR).\n\nBoth kinds of sensors work, in essence, by reducing resistance when they receive more light.  So something as simple as a momentary contact pushbutton might be sufficient here.\n\nIC2 in the upper left of the top picture is marked 78L05 which indicates it's a 5V regulator providing power for the rest of the board.  The 8-pin IC1 in the upper right is probably a small microcontroller or single-purpose IC.  It's the brains of the operation and is probably responsible for both the sensing and control of brightness. Generally, brightness control with such things is done by rapidly turning the LEDs on and off.  If the switching is done fast enough, the human eye does not notice the strobing and we perceive it as dimming.\n\nYou'll need to figure out which of the two small parts is transmitting and which is a receiver.  One simple way to do that is to use an old digital camera that doesn't have an IR filter.  I use an old Palm Pilot for this purpose.  The sensor can see IR light.  Be aware that recent phones typically have IR filters, so if you can see anything at all, it's likely to be very dim.  Try it with an infrared remote control to see if you can see anything.\n\nOnce you identify which is the receiver, it may be sufficient to simply wire a momentary contact pushbutton in parallel with it.  Hitting the button would be the equivalent of the device detecting a hand.\n\nIt's probably best to measure voltages, and particularly, to make sure there are no unsafe voltages here.  It appears that it uses a USB-like connector, so it's probably fine, but make sure!\n\nAlso, it might be worth considering that even if the sensing is working perfectly, there might be a problem with the programming of IC1, so you might find the performance just as dismal with a pushbutton as with the original version.  For that reason, I'd suggest making only easily reversed modifications.  That way, if something doesn't work, you can back up and try something else.\n\n",
      "votes": "2",
      "user": "Edward",
      "time": "Mar 3, 2021 at 23:52",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I ran into the same question/issue. Not happy with having to wave my finger at the exact (finicky) distance and speed, I discovered that you simply wire it opposite of the directions - basically wire/connect from the plug in power supply and chain to all other lights EXCEPT for the one near the sensor. All 3 lights will stay on and ignore the sensor. I have it wired into a better motion sensing wall outlet instead. Works great in all the closets of my new home.\n\n",
      "votes": "1",
      "user": "Ron",
      "time": "Jul 19, 2022 at 17:48",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I got the Maestro model (UCL-S2C-C1) from Costco with a barrel jack connector from the power supply. I found that covering the sensor makes the light stay on. I just taped over the sensor and added a switch interrupting the low power cable to the first light.\n\n",
      "votes": "0",
      "user": "Oliman",
      "time": "Sep 2, 2023 at 14:23",
      "is_accepted": false,
      "comments": []
    }
  ]
}