{
  "title": "Do Stack frames grow upwards?",
  "link": "https://reverseengineering.stackexchange.com/questions/27152/do-stack-frames-grow-upwards",
  "content": "I am currently learning RE and I came upon this piece of code which made me question whether  stack frames grow upward:\n\n```\n0x080483f4 <main+0>:    push   ebp\n0x080483f5 <main+1>:    mov    ebp,esp\n0x080483f7 <main+3>:    and    esp,0xfffffff0\n0x080483fa <main+6>:    sub    esp,0x60\n0x080483fd <main+9>:    mov    DWORD PTR [esp+0x5c],0x0\n\n```\nSo I understand that from <main+0> until <main+6>, we're setting up the stack frame. Being that the stack grows downwards, it makes sense that we sub esp,0x60 thereby allocating 96 bytes for the main function's stack frame.\n\nMy confusion/doubts, however start on <main+9> mov    DWORD PTR [esp+0x5c],0x0 which from what I understood stores the value 0 in a location 4 bytes above the stack pointer and we know that the stack grows downwards, but this operation seems to indicate that the data in the stack frame is stored bottom up.\n\nSo my question is, does that mean that while the stack as a whole grows downwards individual stack frames actually grow upwards?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "103",
  "tags": [
    "disassembly",
    "assembly",
    "stack"
  ],
  "user": "Yuran Pereira",
  "time": "Mar 4, 2021 at 14:39",
  "comments": [],
  "answers_data": [
    {
      "content": "In order to see what is going on, let's use the value of 0x1080 for the initial sp.\n\nThe stack pointer at the beginning:\n\n```\nesp -> 0x1080\n\n```\nafter sub    esp,0x60:\n\n```\nesp -> 0x1020\n\n```\nSo the stack frame of the function is between 0x1080 and 0x1020.\n\nThe stack grew from 0x1080 to 0x1020, that why it grows under - from the higher value to the lower.\n\nThen, esp+0x5c is: 0x107c.\n\n0x107c Is within the stack frame of the function.\n\n",
      "votes": "2",
      "user": "macro_controller",
      "time": "Mar 4, 2021 at 16:39",
      "is_accepted": true,
      "comments": [
        {
          "user": "Yuran Pereira",
          "text": "Thank you, I understand that it is within the stack frame, but what I actually want to understand is if the \"Stack frame itself or the data in it\" grows upwards(from lower next to the stack pointer to higher). Say two variables 'a' and 'b' are created which one will be closer to the stack pointer the first or the second variable?",
          "time": null
        }
      ]
    }
  ]
}