{
  "title": "$$Lambda$(number) when decompiled Java bytecode",
  "link": "https://reverseengineering.stackexchange.com/questions/27239/lambdanumber-when-decompiled-java-bytecode",
  "content": "Why when I decompile a Java bytecode (which further was decompiled from .dex), I get $$Lambda$(number), in Java files, and it's not possible to build project with these java codes as it's insufficient architecture for building project.\n\nPlease, read through the README file (on my repository page), as it's explained everything, how I got $$Lambda$(number), in first place (what I used to decompile).\n\nI'm trying to build project (to decompile APK, to get Java and resources), for now, I got resources, and half of java files, but still not enough of java files to build it.\n\nThe only problem is I get $$Lambda$(number) from some decompiled Java files, what I'm missing, or this is obfuscation of code. What that lambda means after all? How can I reverse engineer that troubling $$Lambda$?\n\nAnd to say it again, I talked with developer about this, I just want to make it open source, so others can contribute, developer is stubborn, even if app is free, and he wanted to share it with others, so why not share source code, why just he decides what will be in app, as he already made a lot of bugs in recent versions.\n\nHelp me to decompile this Java code without this lambda, to make it open source because developer is too stubborn to do it himself, and I don't know why I'm doing translation, when I don't like new versions of app as it's buggy and slow in performance.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "459",
  "tags": [
    "android",
    "deobfuscation",
    "apk"
  ],
  "user": "pishies",
  "time": "Nov 30, 2021 at 8:19",
  "comments": [
    {
      "user": "Col-E",
      "text": "These are most likely just synthetic method artifacts, not obfuscation. See: infoworld.com/article/2073578/java-s-synthetic-methods.html",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I fixed it with Procyon decompiler.\nNow i need to do manual fixing when all java code is at one place at least\n\nrepository:\nhttps://github.com/mstrobel/procyon.git\n\nand if you don't find download link for decompiler as it's not updated in last time, check here for download:\n\nhttps://github.com/pishiepow-coder/java_decompiler.git\n\n",
      "votes": "0",
      "user": "pishies",
      "time": "Mar 15, 2021 at 19:13",
      "is_accepted": false,
      "comments": []
    }
  ]
}