{
  "title": "How to modify a file from the process context of iexplore.exe? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/2746/how-to-modify-a-file-from-the-process-context-of-iexplore-exe",
  "content": "When I use Process Monitor to check iexplore.exe, I see some operations like lock/read/write from iexplore.exe to a specific file.\n\nHow can I do a modification to this specific file as iexplore.exe?\n\nIn short: how can I make a running Internet Explorer instance modify a file?\n\n",
  "votes": "0",
  "answers": 2,
  "views": "187",
  "tags": [
    "debuggers"
  ],
  "user": "studentofmp",
  "time": "11 years ago",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "Please refrain from using all-caps. Thanks.",
      "time": null
    },
    {
      "user": "studentofmp",
      "text": "@0xC0000022L yes this is wanted question thanks",
      "time": null
    },
    {
      "user": "PhoeniX",
      "text": "you want iexplore.exe to modify the specific file with your own data?",
      "time": null
    },
    {
      "user": "studentofmp",
      "text": "@ph0sec yes iexplore or any other process ...",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Create a DLL with your code in it.\n\nYou can then write an EXE to perform the following steps:\n\nThese steps are discussed in greater detail at http://resources.infosecinstitute.com/using-createremotethread-for-dll-injection-on-windows/\n\n",
      "votes": "3",
      "user": "Jason Geffner",
      "time": "Sep 4, 2013 at 14:38",
      "is_accepted": false,
      "comments": [
        {
          "user": "studentofmp",
          "text": "thanks for the reply ! it sounds the best way , just one think how to make static constructor since the dll is called a function starts ?",
          "time": null
        }
      ]
    },
    {
      "content": "One of the ways is to load your code into that process (iexplore.exe) and hook the file creation/writing APIs. This will give you the way to alter that process IO.\n\nBut why would you do that? This will look like pretty malicious activity.\n\nAre you sure, there is no way to solve your problem without doing what you've asked?\n\nUpdate - I hope what you are saying is true.\n\nAlso, do some searching on the subject of hooking, there are a lot info on the Net.\n\n",
      "votes": "3",
      "user": "PhoeniX",
      "time": "Sep 4, 2013 at 14:44",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "Given past questions, I would reckon that this is an attempt at circumventing the DRM scheme somehow?!",
          "time": null
        },
        {
          "user": "studentofmp",
          "text": "@ph0sec yes i know that is the way but how to load my code inside iexplore.exe on the load and executer it, AND NO THERE IS NO MALICIOUS JUST WANT TO DO IT",
          "time": null
        }
      ]
    }
  ]
}