{
  "title": "Twitter scraping using Python",
  "link": "https://reverseengineering.stackexchange.com/questions/27491/twitter-scraping-using-python",
  "content": "I've been working on a project to reverse-enginner twitter's app to scrape public posts from Twitter using an unofficial API, with Python. (I want to create an \"alternative\" app, which is simply a localhost that can search for a user, and get its posts)\n\nI've been searching and reading everything related to REST, AJAX, and the python modules requests, requests-html, BeautifulSoup, and more.\n\nI can see when looking at twitter on the devtools (for example on Marvel's profile page) that the only relevant requests being sent (by POST and GET) are the following: client_event.json and UserTweets?variables=... .\nI understood that these are the relevant messages being received by cleaning the network tab and recording only when I scroll down and load new tweets - these are the only messages that came up which aren't random videos (I cleaned the search using -video -init -csp_report -config -ondemand -like -pageview -recommendations -prefetch -jot -key_live_kn -svg -jpg -jpeg -png -ico -analytics -loader -sharedCore -Hebrew).\n\nI am new to this field, so I am probably doing something wrong. I can see on UserTweets the response I'm looking for - a beautiful JSON with all the data I need - but I am unable, no matter how much I've been trying to, to access it.\n\nI tried different modules and different headers, and I get nothing. I DON'T want to use Selenium since it's tiresome, and I know where the data I need is stored.\n\n\nI've been trying to send a GET reuest to:\nhttps://twitter.com/i/api/graphql/vamMfA41UoKXUmppa9PhSw/UserTweets?variables=%7B%22userId%22%3A%2215687962%22%2C%22count%22%3A20%2C%22cursor%22%3A%22HBaIgLLN%2BKGEryYAAA%3D%3D%22%2C%22withHighlightedLabel%22%3Atrue%2C%22withTweetQuoteCount%22%3Atrue%2C%22includePromotedContent%22%3Atrue%2C%22withTweetResult%22%3Afalse%2C%22withUserResults%22%3Afalse%2C%22withVoice%22%3Afalse%2C%22withNonLegacyCard%22%3Atrue%7D\n\nby doing:\n\n```\nfrom requests_html import HTMLSession\nfrom bs4 import BeautifulSoup\n\nresponse = session.get('https://twitter.com/i/api/graphql/vamMfA41UoKXUmppa9PhSw/UserTweets?variables=%7B%22userId%22%3A%2215687962%22%2C%22count%22%3A20%2C%22cursor%22%3A%22HBaIgLLN%2BKGEryYAAA%3D%3D%22%2C%22withHighlightedLabel%22%3Atrue%2C%22withTweetQuoteCount%22%3Atrue%2C%22includePromotedContent%22%3Atrue%2C%22withTweetResult%22%3Afalse%2C%22withUserResults%22%3Afalse%2C%22withVoice%22%3Afalse%2C%22withNonLegacyCard%22%3Atrue%7D')\nresponse.html.render()\ns = BeautifulSoup(response.html.html, 'lxml')\n\n```\nbut I get back an HTML script that either says Chromium is unsupported, or just a static page without the javascript updating the DOM.\n\nAll help appreciated.\n\nThank you\n\n",
  "votes": "2",
  "answers": 0,
  "views": "145",
  "tags": [
    "python",
    "networking",
    "websites"
  ],
  "user": "TripleS",
  "time": "Apr 17, 2021 at 7:26",
  "comments": [],
  "answers_data": []
}