{
  "title": "Are there any 64 bit MIPS decompilers",
  "link": "https://reverseengineering.stackexchange.com/questions/27515/are-there-any-64-bit-mips-decompilers",
  "content": "I’ve found many mips 32 bit decompilers.  I’m trying to decompile a simple 64bit elf from mips to c. Ida doesn’t seem to have much of a problem with disassembly. After some fixings I tried the decompiler and found ida only supports 32 bits. Then I went down the google rabbit hole.\n\nDoes anyone know of a 64bit mips decompiler?\n\n",
  "votes": "1",
  "answers": 4,
  "views": "1k",
  "tags": [
    "decompile",
    "mips"
  ],
  "user": "Peter Robertson",
  "time": "Apr 21, 2021 at 2:04",
  "comments": [],
  "answers_data": [
    {
      "content": "https://ghidra-sre.org/\n\nGhidra supports a lot of processors including mips64\n\n",
      "votes": "4",
      "user": "mumbel",
      "time": "Apr 21, 2021 at 3:10",
      "is_accepted": false,
      "comments": [
        {
          "user": "Peter Robertson",
          "text": "Does it do decompilation as well most support 64bit disassembly but not decompilation.",
          "time": null
        },
        {
          "user": "mumbel",
          "text": "@PeterRobertson  Ghidra is setup such that any processor supported will have disassembly, decompilation, and other analysis tools/scripts included  (this goes for their release at least, out of tree processors may have only added support for disassembly)",
          "time": null
        }
      ]
    },
    {
      "content": "Mumbel is correct, Ghidra supports decompilation of MIPS64 binaries; see \"What Processors are Currently Supported\" in their FAQ.\n\nHere is a screenshot of decompilation of the main() function of readelf compiled to target MIPS64 architecture:\n\n\n\n",
      "votes": "3",
      "user": "julian",
      "time": "Apr 21, 2021 at 17:21",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "https://github.com/uxmal/reko\n\nReko is a binary decompiler that supports a lot of processors, including Mips64. Feel free to reach out to us for assistance on https://gitter.im/uxmal/reko.\n\n",
      "votes": "2",
      "user": "John Källén",
      "time": "Apr 21, 2021 at 15:16",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Ghidra was the way to go, no other reverse engineering software had 64 bit MIPS. Reko came close and when I mailed that team they said they would implement it in the coming days. IDA only disassembles partly and cant decompile. Ret from Avast 32 bit only as well.  Once JDK 11 was installed disassembled and decompiled the .o elf easily. There is some problem with the dwarf analyzer not working or doing the symlinks, so ill have to find a fix for that.  I don't love Ghidra but I think I'm starting too.\n\n",
      "votes": "1",
      "user": "Peter Robertson",
      "time": "Apr 22, 2021 at 13:59",
      "is_accepted": false,
      "comments": []
    }
  ]
}