{
  "title": "Remote debugging android native lib(.so) No connection could be made because the target machine actively refused it. when connecting to",
  "link": "https://reverseengineering.stackexchange.com/questions/27510/remote-debugging-android-native-lib-so-no-connection-could-be-made-because-the",
  "content": "I have a running IDA debug-server on my virtual android device(check attachments).\nThe problem is: when I try hit Attach procces it gives me an error(check title).\nHere is some kinda params that I'm using: \n\n\n\n\n\n\n\nI have already seen similliar question here: Failed to use IDA to remote android debug\nAs @0xC0000022L said: You need to select Remote Linux in the debugger attach menu of IDA, but I don't have this particular option. Is there any ideas? I appreciate any help. Thank you!\n\n",
  "votes": "1",
  "answers": 1,
  "views": "2k",
  "tags": [
    "ida",
    "android"
  ],
  "user": "Vladislav Ovcharkin",
  "time": "Apr 20, 2021 at 15:57",
  "comments": [
    {
      "user": "0xec",
      "text": "Check the hostname in Process options. Should be the IP of the virtual android device. Another way is to adb port forward port 23946 from the PC to the virtual device.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "See your emulator, your ADB communication probably failed, open your terminal and check that your emulator is displayed with an ADB device, generate a new RSA certificate and try again, I recently had the same problem with debugger from IDA and its competitor JEB, and that was the solution that worked for me.\n\nSee also how to properly configure the ADB for your IDA or emulator / device.\n\nTry to allow local connections via adb using:\n\n",
      "votes": "1",
      "user": "Happy",
      "time": "Apr 20, 2021 at 16:17",
      "is_accepted": true,
      "comments": [
        {
          "user": "Happy",
          "text": "Pay attention to the emulator that is using some like NOX usually use a differently configured ADB, if using a physical device is much better, and in the same way check the RSA generated for the connection, please consider a reading time for that article.",
          "time": null
        },
        {
          "user": "Vladislav Ovcharkin",
          "text": "That actually worked! Thank you, pal.",
          "time": null
        }
      ]
    }
  ]
}