{
  "title": "Any good places to learn about JS de-obfuscation?",
  "link": "https://reverseengineering.stackexchange.com/questions/27565/any-good-places-to-learn-about-js-de-obfuscation",
  "content": "I am trying to make a bot on a specific website, so I have to reverse a lot of JS scripts. The reversing it self is not that hard but the de-obfuscation is. Lots of the scripts are obfuscated with things like JScrambler. I see people able to de-obfuscate JScrambler but for me it is very difficult. So I wanted to know if there was any place I could learn about JS de-obfuscation.\n\n",
  "votes": "1",
  "answers": 2,
  "views": "4k",
  "tags": [
    "deobfuscation",
    "javascript"
  ],
  "user": "MoTheGreat",
  "time": "Apr 26, 2021 at 15:44",
  "comments": [],
  "answers_data": [
    {
      "content": "Here are some cool materials that can assist in your analysis and learning about analysis techniques for obfuscated Javascript, notice that the best way is still to debug the obfuscated code through your own browser debugger (as different from virtualized codes, the logic does not change).\n\nHere are some tools that help your life as well:\n\n",
      "votes": "1",
      "user": "Happy",
      "time": "Apr 26, 2021 at 16:13",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "You can also add to your list\n\njavascript deobfuscator\njavascript obfuscator\n\nI hope i don't get banned for sharing these links my intention is only to help\n\n",
      "votes": "0",
      "user": "scriptmaster",
      "time": "Oct 1, 2022 at 16:17",
      "is_accepted": false,
      "comments": [
        {
          "user": "dingo_kinznerhook",
          "text": "Can you describe the contents and significance of these links?",
          "time": null
        },
        {
          "user": "Community",
          "text": "Your answer could be improved with additional supporting information. Please edit to add further details, such as citations or documentation, so that others can confirm that your answer is correct. You can find more information on how to write good answers in the help center.",
          "time": null
        }
      ]
    }
  ]
}