{
  "title": "How to find event functions called by UI components in a C++/DirectX program",
  "link": "https://reverseengineering.stackexchange.com/questions/2764/how-to-find-event-functions-called-by-ui-components-in-a-c-directx-program",
  "content": "I have a program written in C++ with DirectX (as far as I know). The user interface has menus with buttons and other UI components. To automate a process I would like to find the function called by an event (eg. click on a specific button). \n\nHow can I identify such routines? Are there tools to help analyze and find those locations?\n\n",
  "votes": "6",
  "answers": 1,
  "views": "413",
  "tags": [
    "c++"
  ],
  "user": "samuirai",
  "time": "Sep 7, 2013 at 5:01",
  "comments": [
    {
      "user": "PhoeniX",
      "text": "Can you identify on what UI framework this program is based?",
      "time": null
    },
    {
      "user": "fileoffset",
      "text": "DirectX is a raw framework for graphics drawing. It doesn't actually have any native 'button' classes, all of the drawing on the screen is controlled by DirectX, but any user interface is built by the programmers, or the programmers of the UI framework. There is no silver bullet here, unfortunately. You might be able to find the default/main message loop (ala WndProc) and set a conditional break on a mouse event, like a button press.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can use this tool MyNav. You can see some video examples here: Hex-Rays Plug-In Contest 2010. I think you're interested exactly on Analyzing Adobe Acrobat Reader's JavaScript plugin.\n\nAlso, you can use the commercial tool BinNavi.\n\n",
      "votes": "2",
      "user": "joxeankoret",
      "time": "Feb 23, 2014 at 13:32",
      "is_accepted": false,
      "comments": [
        {
          "user": "Irbis77",
          "text": "not clear of how to use BinNavi for the task above. The Analyzing Adobe Acrobat... link is no longer working. It would be nice to have an example of how it can be used for the problem very similar to the original one...",
          "time": null
        }
      ]
    }
  ]
}