{
  "title": "Kernel debug two physical MacBook pro devices",
  "link": "https://reverseengineering.stackexchange.com/questions/27645/kernel-debug-two-physical-macbook-pro-devices",
  "content": "I've asked the same question at stackoverflow, but i'm gonna copy-paste it here as i might get more relevant answers(?):\n\nI'm trying to kernel debug a physical Macbook pro device.\nWhen my setup contains a VM, between a host MacOS and guest MacOS, its working with no problem using lldb -o \"kdp-remote <guest_machine_ip>\"\n\nmy boot-args on my remote (to debug) Macbook are:\n\n```\nuser$ nvram boot-args\nboot-args       debug=0x44 kext-dev-mode=1 pmuflags=1 -v kcsuffix=debug\n\n```\nWhen i'm triggering kernel debug using either\nsudo dtrace -w -n \"BEGIN { breakpoint(); }\"\nor LEFT CMD + RIGHT CMD + PowerButton, the system is in halt mode, not responsive to anything (Mouse not moving, etc)\nBut when I'm trying to connect to the machine from the host using the lldb command provided earlier, it's not working.\nI've made sure the machines can ping each other and I can set up a SSH connection.\n\nTo the best of my understanding, I had to user special Apple adapters (Real™ Ethernet adapter), so I'm using the following adapters to debug the remote machine:\n\nThe physical connections setup looks like that:\n\nMacOS-Debugger --(USBC to Ethernet adapter)--> Ethernet cable <-- (ThunderBolt to Ethernet adapter) <-- (ThunderBolt3 to ThunderBolt2 adapter) <-- MacOS-debuggee\n\nGenerally for the debugging I used the following tutorial, which worked for VM debugging:\nhttps://knight.sc/debugging/2018/08/15/macos-kernel-debugging.html, I didn't find the exact KDK version, but I don't think it should be the problem here\n\nMy debugger is BigSur, and my debugee is Catalina\n\nAny ideas to what the problem may be will be helpful\n\n",
  "votes": "1",
  "answers": 1,
  "views": "177",
  "tags": [
    "debugging",
    "kernel",
    "lldb",
    "macos"
  ],
  "user": "0xAK",
  "time": "May 9, 2021 at 9:15",
  "comments": [],
  "answers_data": [
    {
      "content": "So there is an answer in the original post, but what i was missing is the interface where i'll be attaching the debugger at in the boot-args\nso I have to add kdp_match_name=en24, where en24 is the physical interface the machines are communicating at\n\nJust adding here the answer as well, as it might help someone in the future\n\n",
      "votes": "2",
      "user": "0xAK",
      "time": "May 9, 2021 at 11:36",
      "is_accepted": false,
      "comments": []
    }
  ]
}