{
  "title": "How to reverse *.pkg file? This is a firmware file of a router",
  "link": "https://reverseengineering.stackexchange.com/questions/27717/how-to-reverse-pkg-file-this-is-a-firmware-file-of-a-router",
  "content": "I am a newbi for reversing engineering.\nI am going to reversing a firmware file. (*.pkg)\nI could find many tutorials for reversing *.bin, but I can't find any tutorials for reversing *.pkg file.\nAnd I don't have the router device yet, so I can't dump a bin file from the device now.\n\n*I wanna know how to reversing .pkg and what is the best tool for this reversing work.\n\n====================================================\n\nPS:\nThis pkg file was not a firmware, it's a MacOS install file.\nBut I downloaded my router firmware, it's also *.pkg.\nAnd it works well with firmware reversing tools.\nThank you for your answers.\n\n",
  "votes": "-1",
  "answers": 3,
  "views": "1k",
  "tags": [
    "firmware"
  ],
  "user": "three2zero",
  "time": "May 28, 2021 at 10:13",
  "comments": [
    {
      "user": "Robert",
      "text": "A .pkg file is just a file with that extension. Without knowing the file content this question can not be answered.",
      "time": null
    },
    {
      "user": "three2zero",
      "text": "As I said, this is a firmware file. I wanna reverse and view firmware contents, so I asked this question. Sorry for my stuppid question. But I want you to help me please.",
      "time": null
    },
    {
      "user": "Robert",
      "text": "There is no standardized format for firmware files. It could be compressed, encrypted, or whatever. How should we know what file you want to reverse? Why don't you apply one of the \"bin tutorials\" on your pkg file and see what happens?",
      "time": null
    },
    {
      "user": "three2zero",
      "text": "You are right. I also think *.pkg is not a standard format for firmware, so I need help for this. You means my *.pkg  can be a compressed, encrypted file of real firmware file, right? I will check my file again soon.  Thank you for your advice.",
      "time": null
    },
    {
      "user": "Alonia",
      "text": "I have had a case where the file was renamed as .pkg to make it more obvious as a packet. In my case it was a tar.gz archive.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "*.pkg is also firmware file format.  But it's not standard firmware format, it's custom format. You can use unpack tools like *.bin files.\n\n",
      "votes": "0",
      "user": "Rabbit",
      "time": "May 28, 2021 at 10:09",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "PKGs are (usually) installer files for macOS. If this is a normal Mac package, you can use a tool called Pacifist. However, this may not be the case. If you know the router brand, we may be able to help you more if you tell us the name.\n\n",
      "votes": "1",
      "user": "John R.",
      "time": "May 26, 2021 at 19:57",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "There’s no “standard” format for .pkg firmware files.\n\nMost likely it’s some custom format used by the vendor, so look for a vendor-specific tutorial or simply analyze it as unknown format (i.e. .bin)\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "May 26, 2021 at 21:27",
      "is_accepted": false,
      "comments": []
    }
  ]
}