{
  "title": "Retrieve user data as if it were the game making the request",
  "link": "https://reverseengineering.stackexchange.com/questions/27790/retrieve-user-data-as-if-it-were-the-game-making-the-request",
  "content": "Don't think the title really summed it up but here goes.\n\nThere's a game built in Unreal Engine 4 that displays your (and other users) in-game statistics e.g a leaderboards page.\n\nI can determine some possible IPs that the game must be talking to in order to retrieve this data but the payload is simply a hex dump and is unreadable (looks to be encoded)\n\nJust wondering if there is a way to determine how the game is making the request, the details of that request and how it's interpreting the returned data.\n\n(To summarise: I'm trying to get in-game statistics without any external api provided - since the developers don't have one)\n\nMany thanks :)\n\n",
  "votes": "2",
  "answers": 1,
  "views": "294",
  "tags": [
    "game-hacking",
    "unknown-data"
  ],
  "user": "John",
  "time": "Jun 4, 2021 at 13:36",
  "comments": [],
  "answers_data": [
    {
      "content": "EDIT: Just realized that I completely misunderstood your question. It seems you already have IPs. You're just trying to decode packet information, in which case I have no answer. However, I'll leave this here as it may still be useful for others.\n\nMost games nowadays use relay servers in which all players (clients) connect to in order to disseminate such statistics like you see in the leaderboards. You used to be able to get player IPs from P2P (client hosted) games, just like in MW2 for example, as all participating clients had to connect to your computer. That is, of course, if you are picked as host.\n\nIf the game in question uses P2P, then you could throw something together in Wireshark. It will require a bit of trial-and-error, but I suggest finding the port being used by the game, then put that into a filter in Wireshark to get IP addresses of all clients.\n\nIf P2P, try this:\n\nKeep the following points in mind when performing the steps above:\n\nHowever, if the game doesn't use P2P, then I'm not entirely sure of your options.\n\nI will edit this post if I forgot anything.\n\n",
      "votes": "1",
      "user": "Steve",
      "time": "Jun 5, 2021 at 18:07",
      "is_accepted": false,
      "comments": []
    }
  ]
}