{
  "title": "Reversing Logitech G933 Battery Charge Values",
  "link": "https://reverseengineering.stackexchange.com/questions/27812/reversing-logitech-g933-battery-charge-values",
  "content": "I have a Logitech G933 headset. I replaced the stock battery with a larger capacity. The headset now lasts many hours longer than it was originally designed, and the software is configured to give audible \"low\" and \"critical\" notifications every few minutes.\n\nThis notification goes on for several hours and I'd like to re-calibrate the software so that \"low\" and \"critical\" are properly defined at around 5% and 2% respective of the new battery's remaining capacity.\n\nMy google fu brought me to a configuration file (%AppData%\\Local\\Logitech\\Logitech Gaming Software\\settings.json) where these values are defined, but I cannot find anywhere that tells how to interpret the values (are they a standard unit of measurement?) or how to read them from the device manually:\n\n```\n\"Critical\" : 1623032924\n\"Low\" : 1623022186\n\n```\nI'm hoping there's some sort of USB reverse engineering techniques I can use to retrieve current values from the headset; this would enable me to get a full range of values from the new battery as reported by the headset, and I could then adjust the notification values accordingly.\n\nIf it helps, I'm familiar with Python but have zero experience with hardware or drivers.\n\nUpdate: Upon some further thinking, my brain matter somehow deduced that these values might be Unix Epoch timestamps. I checked the current Unix Epoch time ('1623079890'), and sure enough, it fits right in...\n\nI'm going to guess that these values are updated every time the headset is turned on? I'm not sure, but more testing is required. I'll keep this updated as I find out more.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "231",
  "tags": [
    "windows",
    "hardware",
    "tools",
    "usb"
  ],
  "user": "webjocky",
  "time": "Jun 7, 2021 at 15:33",
  "comments": [
    {
      "user": "Robert",
      "text": "Do you really need the software? Usually headsets work without any additional software on Windows. You can try if the warnings still occur if you deinstall the the Logitech software. If they still occur then the software on PC side is irrelevant and the notifications  are created by the headset itself.",
      "time": null
    }
  ],
  "answers_data": []
}