{
  "title": "How can I get a value from a memory address that changes almost every millisecond?",
  "link": "https://reverseengineering.stackexchange.com/questions/27818/how-can-i-get-a-value-from-a-memory-address-that-changes-almost-every-millisecon",
  "content": "After a lot of time, I found an address in the memory that has the target value but there is something unusual in that address! that address changes every millisecond.\n\nScreenShot:\n\n\nI did a hardware breakpoint on that line MOV ecx, [DOSBox.exe+210BF4].\nWhen the turn comes to that line, this memory address DOSBox.exe+210BF4 becomes holder to the target value and then the ECX register takes that value from it.\n\nI am sure that the target value comes from this address but I don't know how can I get the value from that strange address. Is there a solution?\n\n",
  "votes": "0",
  "answers": 0,
  "views": "341",
  "tags": [
    "memory",
    "game-hacking",
    "cheat-engine"
  ],
  "user": "Lion King",
  "time": "Jun 8, 2021 at 17:57",
  "comments": [
    {
      "user": "Brendan Dolan-Gavitt",
      "text": "How about a hardware breakpoint on the memory location? That will stop the program and enter the debugger whenever the location is changed.",
      "time": null
    },
    {
      "user": "Robert",
      "text": "If the value is really changing so often then (without a proper synchronization) the code also doesn't know what value it will get. Assuming the values follow a pattern it might be an anti-debugging measure. By reading it's value multiple times one could try to assume the execution time and thus detect a debugger.",
      "time": null
    },
    {
      "user": "Lion King",
      "text": "@BrendanDolan-Gavitt: I have updated my question, and I have answered your words.",
      "time": null
    },
    {
      "user": "Lion King",
      "text": "@Robert: Unfortunately, this matter is not easy to predict, and one must know the mechanism to that pattern, although that game is very old from the dos era.",
      "time": null
    },
    {
      "user": "blabb",
      "text": "no hwbp on mov ecx , line set hwbp on like (windbg syntax)  ba w1 DOSBox.exe+210BF4  it should stop when someone writes to that location  then look at the call stack kb in windbg",
      "time": null
    }
  ],
  "answers_data": []
}