{
  "title": "Mono.Cecil throws SymbolsNotMatchingException, how to find out Method line number?",
  "link": "https://reverseengineering.stackexchange.com/questions/27937/mono-cecil-throws-symbolsnotmatchingexception-how-to-find-out-method-line-numbe",
  "content": "I tried to use a PDB file to map the Instructions to the Sequencepoints in Mono.Cecil and find out the line number of a method. But none of the answers in any forum seems to work, because no matter what I try the SymbolsNotMatchingException is thrown with the error message\n\nBy the way, my target \"application\" is a Unity Game.\n\nHere is some code I use (side note: ProjectPath is the path to my target *.dll):\n\n```\nvar resolver = new DefaultAssemblyResolver();\nresolver.AddSearchDirectory(GetDLLsFolderToResolve(ProjectPath));\n\nusing var assembly = AssemblyDefinition.ReadAssembly(ProjectPath,\n                new ReaderParameters { ReadWrite = true, AssemblyResolver = resolver, \n                    SymbolReaderProvider = new PdbReaderProvider(), ReadSymbols = true });\n\n```\nI have already the Mono.Cecil.dll and Mono.Cecil.Pdb.dll in the same folder due to import Mono.Cecil via NuGet. Also, the target DLL and the PDB also are in the same folder.\n\nDoes anybody have a working example? Or any idea how this error could be solved? Would be happy for any help.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "533",
  "tags": [
    "debugging",
    "debuggers",
    "c#",
    "exception",
    "pdb"
  ],
  "user": "programming_is_bae",
  "time": "Jul 3, 2021 at 13:06",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "are you sure PDB actually matches the file?",
      "time": null
    },
    {
      "user": "programming_is_bae",
      "text": "I don't know if they are matching each other, but the *.dll's and *.pdb's were created in the same folder after the build process. Maybe I choose the wrong settings for the Unity build process. I will have a look, thank you! :)",
      "time": null
    },
    {
      "user": "programming_is_bae",
      "text": "Can't believe that this hint helped me to solve it. I have modified the *.dll with Mono.Cecil before and it doesn't match afterwards with the *.pdb file. Thank you so much!",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@programming_is_bae please write this up as an answer and accept it. It's perfectly fine to do that here and you may even get some upvotes for it. Most importantly it will help others who ran into the same issue.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "So all the steps above are correct the way they were described. The only thing I have done wrong was, that my target DLL was modified by Mono.Cecil before (I already had read and wrote my target DLL and modified it by this way). So the DLL and the PDB was not the same anymore.\n\nSo if you want to run Mono.Cecil just once and you get the exception above do the following things:\n\nNote: This is only a solution if you want to run Mono.Cecil once. If you want to run it again over your target DLL, you have to make all steps above again.\n\nHopefully this will help someone!\n\n~Sulan\n\n",
      "votes": "3",
      "user": "MarianD",
      "time": "Jul 5, 2021 at 16:22",
      "is_accepted": true,
      "comments": []
    }
  ]
}