{
  "title": "Strategies for Deciphering RS-232 Data",
  "link": "https://reverseengineering.stackexchange.com/questions/27961/strategies-for-deciphering-rs-232-data",
  "content": "I'm working with an old irrigation controller that is connected to a PC via the DB9 serial port.\nI was able to capture that data (tapped into the appropriate TX wire) on a separate laptop, but now I'm stuck translating it into meaningful information.\n\nWhen idle, the controller continuously broadcasts the line current to the PC and because variable data stands out among static values, this seemed like a logical place to start deciphering the data. Below is an excerpt of the serial data while the system is idle:\n\n```\nff 3a 30 32 34 49 30 30 38 34 3b 30 30 30 30 0d 0a\nff 3a 30 32 34 49 30 30 38 36 3b 30 30 30 30 0d 0a\nff 3a 30 32 34 49 30 30 38 35 3b 30 30 30 30 0d 0a\nff 3a 30 32 34 49 30 30 38 34 3b 30 30 30 30 0d 0a\nff 3a 30 32 34 49 30 30 37 45 3b 30 30 30 30 0d 0a\nff 3a 30 32 34 49 30 30 37 43 3b 30 30 30 30 0d 0a\nff 3a 30 32 34 49 30 30 37 43 3b 30 30 30 30 0d 0a\n\n```\nThe bytes that I suspect of carrying the line current information are indicated with __ below, as all of the other bytes remain static when system is idle:\n\n```\nff 3a 30 32 34 49 30 30 __ __ 3b 30 30 30 30 0d 0a\n\n```\nThere is a test cycle that can be run to check current before, during, and after activation of a particular sprinkler head. Here is an excerpt of that:\n\n```\nff 3a 30 32 34 49 30 30 38 31 3b 30 30 30 30 0d 0a  (system idle, typical current ~130 mA)\nff 3a 30 34                                  0d 0a  (system wait)\nff 3a 30 32 34 49 30 30 38 36 3b 30 30 30 30 0d 0a  (system active, typical current ~550 mA)\nff 3a 30 34                                  0d 0a  (system wait)\nff 3a 30 32 34 49 30 30 38 35 3b 30 30 30 30 0d 0a  (system idle, typical current ~210 mA)\n\n```\nThere are two pairs of wires leaving the controller, but I suspect the controller reports the total combined current rather than reporting them separately.\n\nCurrent values approximately 130 mA while idle, and around 550 mA while active, but I'm struggling to find a way to translate \"38 34\", \"37 45\" etc. into meaningful values.\n\nThis is my first foray into this sort of puzzle, so any related advice/tips/suggestions for deciphering serial data would be welcome.\n\nEdit:\nOmitting the leading \"ff\", below is the appearance in ASCII form.\n\nidle state:\n\n```\n:024I007D;0000\n:024I0082;0000\n:024I0080;0000\n:024I0084;0000\n:024I0086;0000\n:024I0082;0000\n:024I0081;0000\n:024I0080;0000\n:024I0082;0000\n:024I0086;0000\n:024I0084;0000\n:024I007E;0000\n:024I007E;0000\n:024I0080;0000\n:024I0081;0000\n:024I0080;0000\n:024I007E;0000\n:024I0081;0000\n:024I0085;0000\n:024I0085;0000\n:024I0086;0000\n:024I0081;0000\n\n```\nrunning:\n\n```\n:024I0081;0000  (system idle)\n:04             (system wait)\n:024I0086;0000  (system running) \n:04             (system wait)\n:024I0085;0000  (system idle)\n:04\n:04\n:04\n:024I0080;0000\n:04\n:024I0081;0000\n:04\n:024I007E;0000\n\n```\n",
  "votes": "0",
  "answers": 1,
  "views": "99",
  "tags": [
    "hex",
    "serial-communication",
    "hexadecimal"
  ],
  "user": "CragMonkey",
  "time": "Jul 7, 2021 at 3:30",
  "comments": [
    {
      "user": "Ian Cook",
      "text": "There's not enough change in those 3 records to convey that much information about the current.  Are you sure you are including all the relevant records ?  Also, apart from the initial FF, all the characters are printable ascii. e.g. :024I0085;0000.  It'll probably be easier to see what's going on like this.  I would have guessed that  'I' stands for current  and 0085 is the mA value in hex (132mA) - but this doesn't work for your non-idle examples.",
      "time": null
    },
    {
      "user": "CragMonkey",
      "text": "Yes - the packets all look like the above example, with the same bits changing.",
      "time": null
    },
    {
      "user": "CragMonkey",
      "text": "Added ASCII representation above in case someone else can see a pattern.",
      "time": null
    },
    {
      "user": "Ian Cook",
      "text": "So the message being sent during 'system running' also appears in the idle state data.  Unfortunately, I don't think you are going to get very far with with this data/approach.  Perhaps try to reverse engineer the program that is translating these messages to the displayed mA values ?",
      "time": null
    },
    {
      "user": "CragMonkey",
      "text": "Correct - while the system is running the program uses the current draw to infer whether the solenoids responded. It's possible they're using a lookup table of some sort, but I was hoping there was just some simple translation that I was overlooking.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "So I managed to work it out... most importantly I needed to view it in ASCII as suggested in the comments.\n\nTurns out the samples I shared didn't contain examples of the 500+ mA readings like I expected after all.\n\nAt any rate, it turns out that given the format....\n\n```\n:024IXXXX;YYYY\n\n```\n... then XXXX converted from hex to decimal + YYYY converted from hex to decimal = current displayed by software.\n\n",
      "votes": "0",
      "user": "CragMonkey",
      "time": "Jul 10, 2021 at 4:44",
      "is_accepted": true,
      "comments": []
    }
  ]
}