{
  "title": "Find a string that I entered in ollydbg",
  "link": "https://reverseengineering.stackexchange.com/questions/2796/find-a-string-that-i-entered-in-ollydbg",
  "content": "Say, there's an input box and I enter a text. Can I somehow find the location that text is entered?\n\n",
  "votes": "8",
  "answers": 3,
  "views": "15k",
  "tags": [
    "ollydbg"
  ],
  "user": "aclowkay",
  "time": "Sep 16, 2013 at 23:43",
  "comments": [],
  "answers_data": [
    {
      "content": "Set breakpoints on GetWindowText() and GetDlgItemText() and have the target program read your input text. If the breakpoint is hit, you can trace up the call-stack to \nsee what code is reading your input text and where in memory it's being stored. If neither breakpoint is hit, you can try setting a conditional breakpoint on SendMessage(), filtering it to only break on the WM_GETTEXT message.\n\nIf the above methods fail, you may want to statically analyze the program to find where it's creating the text box window and how it's handling input to the text box. Searching for window creation API calls and/or cross-references to strings related to the text box (static labels, error message strings, etc.) can be helpful.\n\n",
      "votes": "8",
      "user": "Jason Geffner",
      "time": "Sep 16, 2013 at 18:13",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "In addition to what Jason said, I'd add that there is another potentially helpful way:\n\nI agree that this could be an overkill, but still could be helpful in some situations.\n\n",
      "votes": "1",
      "user": "PhoeniX",
      "time": "Sep 16, 2013 at 22:03",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "in addition to all the above solutions after you have entered your text string press f12 and pause the debuggee\nnow there are several options to search for the string \nview call stack (ctl+k) and set a break point on the return address in the stack and press f9  to run\nollydbg will most probably break on some system call\nwhen it breaks you can search the entire memory of the process\n(alt+m right click search ctrl+l for repeating)for the string you entered\nset an access breakpoint (hardware break point on read) on the location \nif the application is not much obfuscated call stack may show you the applications code where it entered system you can also follow from there\nif the application hasn't sub classed its controls setting a break point on windowproc or classproc will also get you the right context to follow your string   if the app uses directx you can set breaks at SendInput() apis or DrawText(...) apis\n\n",
      "votes": "1",
      "user": "blabb",
      "time": "Sep 17, 2013 at 12:45",
      "is_accepted": false,
      "comments": []
    }
  ]
}