{
  "title": "Basic Block generated by IDAPython code are different compared to BN generated output file",
  "link": "https://reverseengineering.stackexchange.com/questions/27977/basic-block-generated-by-idapython-code-are-different-compared-to-bn-generated-o",
  "content": "I have a query regarding different BB count using two different tools.\n\nI have an output file (.txt) against a binary which contains different features about it. I have written IDAPython code to produce the same result as number of BB's and number of instruction in each BB etc. and address as well.\n\nWhen I compared my result with the one already generated by the BN tool, they are different. Number of BB's are almost 1000 less compared to BN.\n\nMay anyone guide me to understand the issue? Regards.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "70",
  "tags": [
    "ida",
    "idapython"
  ],
  "user": "Nav60",
  "time": "Jul 11, 2021 at 7:57",
  "comments": [
    {
      "user": "R4444",
      "text": "what type of binary are u using for the test? how big is that? these two are different tools, so there could be algorithmic differences. it is also possible that your tools are incorrectly implemented or not identical in their operation",
      "time": null
    },
    {
      "user": "Nav60",
      "text": "Sir, i am using bot.exe and botcmd.exe of carbanak malware because BN analysis is available. Sir, there were many files for the different verion of carbanak. I have found 1 version of the malware which result is almost equal to my results in case of number of basic blocks. but now no of instructions per BB is different. I am working on it yet but no useful outcome.  static analysis of binary with different binary will be different but difference of 1000 BB is not possible.",
      "time": null
    },
    {
      "user": "Nav60",
      "text": "after some working, i have found problem in my converted code and now result are similar to BN file.",
      "time": null
    }
  ],
  "answers_data": []
}