{
  "title": "How to move function names, comments, local variable names and structs to a database for a new version of the executable?",
  "link": "https://reverseengineering.stackexchange.com/questions/27974/how-to-move-function-names-comments-local-variable-names-and-structs-to-a-data",
  "content": "I have reversed a number of functions and added definitions for some structs in an Intel x64 PE  executable. A program got an update. I moved old executable with the old database into another folder and I opened new executable and IDA created new database.\n\nNow I'd like to move information I gathered in the old executable into the new database: function names, comments for specific assembly lines, defined structures, renamed offsets(in the assembly instruction ) to represent offets of structs, etc.\n\nI googled it and found BinDiff plugin for IDA, and successfully ported function names and comments to the same executable(in a small VC++ test solution) opened in another folder with debugging symbols stripped.\n\nBut it didn't touch the defined structures. The reason I used a small test project is because when I tried it on a real IDB, it was taking IDA too long to BinDiff the databases: the IDBs are 1.4GB in size with 180k functions recognized by IDA. I left it for half an hour and then decided to try it on a small project.\n\nSo how to move all relevant information to the new database for the new version of the executable?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "410",
  "tags": [
    "ida"
  ],
  "user": "KulaGGin",
  "time": "Jul 9, 2021 at 20:21",
  "comments": [
    {
      "user": "KulaGGin",
      "text": "After googling more, I found: github.com/joxeankoret/diaphora . I'll try it, looks like it will just might be able to do what I'd like to do.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Diaphora is the closest thing to what I'd like to have.\n\nIt doesn't port everything, though: doesn't port stack variables(arguments, local variables), which is a good enough and important enough chunk of reversing functions.\n\n",
      "votes": "0",
      "user": "KulaGGin",
      "time": "Feb 7, 2022 at 13:25",
      "is_accepted": true,
      "comments": [
        {
          "user": "Mahmoud Abdelkader",
          "text": "Have you found anything to migrate local variable, arguments as well as global names?",
          "time": null
        }
      ]
    }
  ]
}