{
  "title": "Display open handles in IDA pro, just like xdbg?",
  "link": "https://reverseengineering.stackexchange.com/questions/27983/display-open-handles-in-ida-pro-just-like-xdbg",
  "content": "I want to know for example that if a ReadFile is happening and the handle number is 100, which file or whatever this handle belongs to?\nlets assume for whatever reason i cannot trace CreateFiles to note handles myself.\n\nObviously i want this during debugging, so is there any handle table, just like the one that exist in xdbg?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "342",
  "tags": [
    "ida",
    "idapro-sdk",
    "ida-plugin"
  ],
  "user": "Notoriouss",
  "time": "Jul 12, 2021 at 13:30",
  "comments": [],
  "answers_data": [
    {
      "content": "A handle is an abstract object.\n\nI am assuming that you are using IDA for static analysis, and that you are not using any embedded debugger through IDA. Correct me if it's not the case.\n\nFrom a static analysis point of view, you can't trace back the object where is comes from only with its value (100 in your exemple). The handle value is going to be different each time it is being used, so it is not relevant for a static analysis with IDA.\n\nSince you are specifically asking for IDA, take a look at what is happening before your ReadFile() call.\n\nAs ReadFile() take a handle as an input, you should find a place in the code where this handle is being open. Something like a call to CreateFile (for instance). This is where you'll find the filename mapped with this handle value.\n\nYou can always try to search for cross-reference (shortcut 'X' in IDA) to the local variable that is holding your handle to retrieve the place where the handle is being open.\nIf the handle is not saved to a local variable, just trace back the register that is holding your handle.\nOr simple search for imports that are coherent with what you are looking\n\nTake a look at this small example:\n\n```\nHANDLE hFile = CreateFile(    \"C:\\\\filename.txt\",                // <- what you are looking for\n                              GENERIC_READ,           \n                              FILE_SHARE_READ,        \n                              NULL,                   \n                              OPEN_EXISTING,          \n                              FILE_FLAG_OVERLAPPED,   \n                              NULL);   \n[...]               \nint result = ReadFile(        hFile,                            // <- what you are looking at\n                              ReadBuffer, \n                              BUFFERSIZE-1, \n                              &ol, \n                              FileIOCompletionRoutine);\n\n```\nYou need to go back a bit in the code's flow to search where this handle was opened first.\n\nIf you want to go the lazy way, you can either use a debugger, they all supports handle tracing. As you exclude x64dbg in your question, try with another one. If a tool is not working, pick another one and see.\n\nIf it's still not working (anti-debug/static analysis too painful), I would rather try to investigate the 'whatever reason' that prevent you from tracing CreateFiles() calls.\n\n",
      "votes": "1",
      "user": "Guillaume",
      "time": "Jul 12, 2021 at 13:28",
      "is_accepted": false,
      "comments": [
        {
          "user": "Notoriouss",
          "text": "Well I'm asking about during debugging, i thought it was obvious since i was comparing to xdbg. Is there any handle table tab in IDA pro, just like xdbg?",
          "time": null
        },
        {
          "user": "Guillaume",
          "text": "My bad; I'm not a big fan of IDA for anything other than static analysis. So I can't really answer that. But why using IDA, and not something that is meant to be used as a debugger (Olly, x64dbg, WinDbg) ? Anyway, an ugly option would be to break somewhere where your handle is opened, and use ProcessHacker or something else (like the 'Handle' tools from the sysinternals utils) that is able to inspect opened handles for a given process.",
          "time": null
        }
      ]
    }
  ]
}