{
  "title": "Program won't crash on heap overflow",
  "link": "https://reverseengineering.stackexchange.com/questions/2803/program-wont-crash-on-heap-overflow",
  "content": "I'm trying to learn about heap overflows for this exploitation challenge I have to solve.\n\nIn short, the program allocates 3 consecutive buffers on the heap, and I have access to write whatever I want to all of them. Even though I write over the pointers used by the heap manager, which are located at the end of each buffer, no exception is raised when the buffers are HeapFree()d.\n\nWhy is that so? Shouldn't an exception be raised? How can I check on this further on?\n\nthank you\n\n",
  "votes": "6",
  "answers": 1,
  "views": "304",
  "tags": [
    "buffer-overflow"
  ],
  "user": "user2835",
  "time": "Sep 17, 2013 at 19:02",
  "comments": [
    {
      "user": "0xea",
      "text": "could you add some more information to your question, like platform/os (i get that it's windows, but which) , compiler used, source code ...",
      "time": null
    },
    {
      "user": "user2835",
      "text": "haha so sorry.  I'm running it on Windows XP SP3 with DEP disabled. I don't have the source code as I'm supposed to exploit the program. No idea which compile was used (can't tell from the strings).  I'm using ollydbg for debugging - can this possibly be the reason no exception is being thrown? on the other hand, olly doesn't catch anything either.",
      "time": null
    },
    {
      "user": "Stolas",
      "text": "Tell us the program and the code you are sending towards it. By the text we can't see what you overwrite etc, etc. So long answer short: \"More info required\" Just saying: \" area51.stackexchange.com/proposals/58554/exploit-development \"",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "AFAIR Windows XP does not necessarily crash on heap corruption, you need to specifically turn this behavior on using gflags.exe (from debugging tools)\n\n```\ngflags /p /full /enable foo.exe\n\n```\nPageheap.exe might work as well, see http://support.microsoft.com/kb/286470\n\nIn any case, the point of exploitation is not to crash the process but to get it to run your code, so you don't need to worry why it does not crash.\n\n",
      "votes": "7",
      "user": "Vitaly Osipov",
      "time": "Sep 18, 2013 at 13:02",
      "is_accepted": false,
      "comments": []
    }
  ]
}