{
  "title": "How to bypass anti-debugging C++",
  "link": "https://reverseengineering.stackexchange.com/questions/28063/how-to-bypass-anti-debugging-c",
  "content": "So I have a crackme my friend sent to try and crack it but the problem that I cannot bypass the anti-debugging or even patching it.\n\nI even tried using ScyllaHide at max settings but still it detects that there's a debugger and close itself without any message, and it encrypts its strings in memory, so I can't get the key.\n\nHow can I prevent it from detect if there was a debugger or getting the key from memory? (BTW I knew that it encrypts string being entered and compares it to the another encrypted string)\n\n",
  "votes": "0",
  "answers": 1,
  "views": "2k",
  "tags": [
    "x64dbg",
    "anti-debugging",
    "crackme",
    "anti-dumping"
  ],
  "user": "Ahmed minegames",
  "time": "Aug 11, 2021 at 4:32",
  "comments": [
    {
      "user": "Guillaume",
      "text": "Have you tried to identify what type of anti-debugging is present in this binary ? If not, it's going to be difficult to answer your question without more details ...",
      "time": null
    },
    {
      "user": "Ahmed minegames",
      "text": "in IDA there was a functions like: UnhandledExceptionFilter IsDebuggerPresent CheckRemoteDebuggerPresent CloseHandle GetTickCount QueryPerformanceCounter GetModuleHandle GetExceptionCode  and other ones",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "use a debugger, single step the code, and watch what it does.  Odds are, it's one of the windows API functions that Ahmed mentions in another response.  But, step 1 would be figure out what it's doing, and then using the debugger, just jump OVER that code.\n\n",
      "votes": "0",
      "user": "FrankRizzo",
      "time": "Aug 11, 2021 at 21:06",
      "is_accepted": true,
      "comments": [
        {
          "user": "Ahmed minegames",
          "text": "i made a program that will gonna instead edit it in memory and it worked without patching the file itself (because it's have an Anti File-Patching anyway), but i will mark your answer as solved, because why not.",
          "time": null
        }
      ]
    }
  ]
}