{
  "title": "Are there ready-to-go reverse engineering VMs?",
  "link": "https://reverseengineering.stackexchange.com/questions/283/are-there-ready-to-go-reverse-engineering-vms",
  "content": "In computer forensics & pentesting, there are live CDs that have a bunch of tools installed. This makes it easy to boot a machine and have a variety of tools for examining the HDD (for example).\n\nAre there VMs or live CDs with a bunch of RE tools preinstalled?\n\nThis would be a great starting point for learners. It would also allow the community to answer questions more easily, by pointing out techniques that use tools already in said VM.\n\n",
  "votes": "19",
  "answers": 7,
  "views": "10k",
  "tags": [
    "tools"
  ],
  "user": "EfForEffort",
  "time": "Mar 26, 2013 at 14:58",
  "comments": [],
  "answers_data": [
    {
      "content": "One good distro is Kali Linux, from the creators of BackTrack (BackTrack is no longer supported). Kali is Debian-based (unlike its predecessor, which was Ubuntu-based), and it has tools for reverse engineering, data collection and analysis, HDD analysis, forensics, and many other purposes. I can't name the tools off the top of my head; you'd have to boot into it to know the full set of tools (if you've used BackTrack, it's a similar toolset, but simplified based on certain specifications).\n\nKali Linux is meant to be booted as a live disk (the docs cover how to do that), but you can also install it as a VM (which is what I've done). Persistence can be set up (see the documentation). Additionally, you can actually install it as an operating system, but I'd recommend against it.\n\nOne further thing about Kali is that you can customize it for your purposes (minimal install, certain types of install, etc.). I'm not going to go into detail about it. The docs contain further information, as does the main website itself (there is some information about the distro found on the site that isn't necessarily in the docs).\n\nKali Linux has an irc channel #kali-linux on irc.freenode.net. Be sure to read the docs before asking questions.\n\n",
      "votes": "11",
      "user": "JMcAfreak",
      "time": "Mar 26, 2013 at 16:50",
      "is_accepted": false,
      "comments": [
        {
          "user": "cb88",
          "text": "FYI backtrack was also based on Slackware.",
          "time": null
        }
      ]
    },
    {
      "content": "Here is what I have found so far:\n\nREMnux is a lightweight Linux distribution for assisting malware analysts in reverse-engineering malicious software. The distribution is based on Ubuntu and is maintained by Lenny Zeltser.\n\n",
      "votes": "11",
      "user": "4 revs, 3 users 50%EfForEffort",
      "time": "Jan 2, 2014 at 22:10",
      "is_accepted": false,
      "comments": [
        {
          "user": "asheeshr",
          "text": "Please add a small description for the link. Link only answers are not considered answers.",
          "time": null
        },
        {
          "user": "EfForEffort",
          "text": "@AshRj, added the description.",
          "time": null
        }
      ]
    },
    {
      "content": "Much of my reverse engineering environment (IDA and Hex-Rays on Windows) consists of commercial software, so I strongly expect there would be no legitimate free VMs floating around.\n\n",
      "votes": "8",
      "user": "Rolf Rolles",
      "time": "Mar 27, 2013 at 6:49",
      "is_accepted": false,
      "comments": [
        {
          "user": "EfForEffort",
          "text": "Is there anything really significant besides IDA Pro? (The IDA free version could be used, though it's not nearly as nice.) I was thinking the VM would include things like binwalk, distorm, wireshark, python-elfesteem, python-pefile, etc. Stuff like that.",
          "time": null
        },
        {
          "user": "Rolf Rolles",
          "text": "IDA Pro ($1689), Hex-Rays ($2339), Windows (~$200).  Over $4k worth of software without adding anything else.",
          "time": null
        },
        {
          "user": "ixje",
          "text": "@bueno Hex-rays depends on IDA Pro so that's a loss. You could use radare2 as alternative for IDA Pro but to my knowledge there is no plugin for it like Hex-Rays. For OSX there is Hopper which seems to develop nicely, but I can't judge how mature it is.",
          "time": null
        }
      ]
    },
    {
      "content": "You probably already know about this since you are familiar with pentesting LiveCDs, but Kali Linux (formerly BackTrack) from Offensive Security is an operating system with built-in tools for penetration testing that is based on Debian. \n\nI have not ever used it for performing reverse-engineering, but it is available to download both as a .iso and as a VMWare image. It is available at http://www.kali.org/ \n\n",
      "votes": "6",
      "user": "dingo_kinznerhook",
      "time": "Mar 26, 2013 at 16:37",
      "is_accepted": false,
      "comments": [
        {
          "user": "mrhobbeys",
          "text": "Yes BT includes tools such as IDApro and ollydbg",
          "time": null
        }
      ]
    },
    {
      "content": "Another option is Fireye's Windows-based Flare VM.\n\nUnlike the Linux-based examples on this page, Flare VM only provides an installer script, not the VM itself. Fortunately, you can get a free Windows VM straight from Microsoft.\n\nTheir GitHub page has the full (very long) list of tools; here is a snippet:\n\n",
      "votes": "4",
      "user": "hairlessbear",
      "time": "Jan 17, 2019 at 13:18",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "",
      "votes": "3",
      "user": "Ange",
      "time": "Jul 30, 2013 at 9:29",
      "is_accepted": false,
      "comments": [
        {
          "user": "JMcAfreak",
          "text": "An answer like this doesn't offer very much information. Anyone can compile a list of links. It would be nice to get a little more of a description about each OS you're linking to without having to click the actual links. Please expand the answer to include some of the features.",
          "time": null
        }
      ]
    },
    {
      "content": "FSL - Fedora Security Lab (also known as ​Fedora Security Spin).\n\n",
      "votes": "3",
      "user": "hairlessbear",
      "time": "Jan 17, 2019 at 7:04",
      "is_accepted": false,
      "comments": []
    }
  ]
}