{
  "title": "Mitsubishi MAC-577IF2-E WIFI controller Firmware file",
  "link": "https://reverseengineering.stackexchange.com/questions/29084/mitsubishi-mac-577if2-e-wifi-controller-firmware-file",
  "content": "I recently installed Mitsubishi AC with Mitsubishi MAC-577IF2-E\nWi-Fi controller, and as always nowadays these devices communicate with Cloud servers first, then with you, which practically means you need to wait minutes for your changes to take effect.\n\nSo after setting this one up with Wireshark I found out (via DNS responses) that it communicates with https://production.receiver.melcloud.com/ as its TLS 1.2 (if connecting with Firefox or Chrome I get ERR_SSL_VERSION_OR_CIPHER_MISMATCH, so I guess it's using a different cipher also) I cannot see anything\n\nBut the device has  HTTP server on port 80 (not the first setup server where you enter Wi-Fi password, but when it's already connected to Wi-Fi if you go to its IP address it has HTTP server there) and requires HTTP basic auth when trying to communicate with it.\n\nSo my first step is to fire up binwalk and look at the firmware, but I don't know how to get the firmware, looking in the app is looks like that there is no firmware update option, so I was wondering is there any way to get the firmware somehow (maybe someone has it already) so I can start to play around?\n\nI already found this: https://github.com/ncaunt/meldec\nbut since my AC uses HTTPS, I am out of luck here.\n\n",
  "votes": "3",
  "answers": 2,
  "views": "3k",
  "tags": [
    "firmware-analysis",
    "https-protocol"
  ],
  "user": "Hojzerice",
  "time": "Jul 30, 2023 at 23:52",
  "comments": [
    {
      "user": "stefanopulze",
      "text": "I have the same issue. I need to control my mitsubishi from my network without the use of the melcloud app. I have already dump the traffic but it is in https and I can’t read the content. Now i'm trying to bruteforce the http-basic-auth but I don’t think it would works I don’t understand why Mitsubishi don’t expose the rest api to the internal lan",
      "time": null
    },
    {
      "user": "peter ferrie",
      "text": "I’m voting to close this question because it's a request for software, not reverse-engineering.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Maybe found a better solution, see https://github.com/SwiCago/HeatPump/\nShould work on all Mitsubishi devices with a CN105 connector and needs no Melcloud service.\n\n",
      "votes": "2",
      "user": "Helge",
      "time": "Aug 14, 2022 at 9:32",
      "is_accepted": false,
      "comments": [
        {
          "user": "Helge",
          "text": "I'd still be interested in reverse engineering this, since there's a use case (controlling my own device from my own LAN, not over the cloud) and not just a request for a software (you could just use Melcloud if that was all you wanted).",
          "time": null
        }
      ]
    },
    {
      "content": "Any luck with the basic auth from the device? Same issue here..\n\nI think its \"empty username\" and the Password printed on the back. But then all pages are just \"Page Not Found\". Only Endpoint woring is IP/config with username \"user\" and Password printed on the device. But it allowes only to enable/disable the device...\n\n",
      "votes": "0",
      "user": "Stackraven",
      "time": "Jul 6, 2023 at 14:37",
      "is_accepted": false,
      "comments": []
    }
  ]
}