{
  "title": "Debugging Native Lib using IDA Pro Fails to Load Registers and other Information",
  "link": "https://reverseengineering.stackexchange.com/questions/29096/debugging-native-lib-using-ida-pro-fails-to-load-registers-and-other-information",
  "content": "Currently, I am debugging a native library in a test APK, however I am running into issues. First of all, I can connect to the debugger and attach to the process without any issues. In the first image below, I select \"Same\" as the one on my local machine is the decompiled .so file, and the one from the Android remote, which is on my Emulator, is the actual .so file.\n\n\n\nAfter I select that, I don't get the typical \"Moving Cross References\" one would expect and stuff, and only get a popup saying it's \"Downloading Symbols\". Nevertheless, the dialog completes and the debugger attaches to the process. Here is part of my output Window in IDA Pro:\n\n```\nC100000: loaded /data/app/com.example.hellojni-1/lib/arm/libImageProcessing.so\nC000000: loaded /system/lib/arm/nb/libdl.so\nC7638000: loaded /system/bin/linker\nDebugger: attached to process /system/bin/app_process32 (pid=18383)\n\n```\nHowever, all my registers are blank:\n\n\n\nAnd IDA Pro doesn't let me step through the code, or do anything else expected of the debugger. What could the issue be here? What am I doing incorrectly? The debugger attaches to the process just fine, but all I seem to be able to do is pause and start the process. For reference, these are my processor options:\n\n\n\nEdit: This is the verbose output, where read_regs gives -1.\n\n\n\n",
  "votes": "2",
  "answers": 1,
  "views": "713",
  "tags": [
    "ida",
    "debugging",
    "android",
    "debuggers"
  ],
  "user": "Display",
  "time": "Aug 4, 2021 at 18:14",
  "comments": [
    {
      "user": "IgorGanapolsky",
      "text": "Were you loading an APK or just .so files?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Most likely the execution is currently in the kernel or Dalvik code. Put some breakpoints in code that should be executed (e.g. JNI exports) and do some actions in the app to trigger them.\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Aug 5, 2021 at 12:06",
      "is_accepted": false,
      "comments": []
    }
  ]
}