{
  "title": "TEST instruction and ZF flag",
  "link": "https://reverseengineering.stackexchange.com/questions/29113/test-instruction-and-zf-flag",
  "content": "In the part 07 of lena151 RE tutorial, we arrive to these instructions:\n\n```\nAL = 0\nTEST AL,AL\nJNZ ...\n\n```\n\n\nAnd notice:\n\nMy question is: Why the AL must be different from zero? If 2 value (0=0) are equal, the Z flag set to 1, because the result of comparison is true! Is this right?\n\n",
  "votes": "2",
  "answers": 3,
  "views": "2k",
  "tags": [
    "assembly",
    "register"
  ],
  "user": "Jason",
  "time": "Aug 11, 2021 at 10:31",
  "comments": [],
  "answers_data": [
    {
      "content": "It is a little confusing, but the Zero Flag is set (i.e. its value is 1), if the last result IS zero:\n\nIn general, a flag is set to show that the appropriate condition is true, or the appropriate event arised. (We also say that the flag is on (1) or off (0)).\n\nBTW., this may be also a little counter-intuitive: JNZ (Jump if Not Zero) jumps if ZF is zero (because it means “not zero in the last result”, not “not zero in the Zero Flag”).\n\nIt's better to think only in terms of results, ignoring Zero Flag - flags are mainly technical tools for machines, not for us humans.\n\nNot quite:\n\n",
      "votes": "4",
      "user": "MarianD",
      "time": "Aug 11, 2021 at 0:53",
      "is_accepted": true,
      "comments": [
        {
          "user": "Jason",
          "text": "Thank you very much. i edit my question. you help me alot. lena says the al must be different from 0. why? 0=0 is true and set the z flag! and jump . right? but in this case if AL is set to 1 again 1=1 and set the z flag and agin will jump. The Z flag will never be clean by any number. that's why i confused",
          "time": null
        },
        {
          "user": "MarianD",
          "text": "@Jason, please don't change directly your question if it has already an answer, because it may the existing answer invalidate. It is better to append an EDIT: to it. So now I will answer your comment in the following one:",
          "time": null
        },
        {
          "user": "MarianD",
          "text": "@Jason, if AL is zero, then TEST AL,AL is zero, too, and the next instruction JNZ ... will do nothing - and you want to jump over the bad boy, don't you? So the zero value in the AL is not what you want.",
          "time": null
        },
        {
          "user": "Jason",
          "text": "Yes , i want to jump over the badboy. i know how do it. but i'm confusing in TEST AL,AL section. The value of AL=0 , TEST AL,AL will set the zero flag. and if AL=1 TEST AL,AL will clear the zero flag. and i confusing for this one!",
          "time": null
        },
        {
          "user": "MarianD",
          "text": "@Jason, as I explained in my answer, it may be a little to counter-intuitive. My recipe is not to concentrate on the ZF (it's only a flag), but only to the result. (OK, the TEST instruction only set or reset the Zero Flag, but we have no difficulty to pretend that it give the (discarded) result.",
          "time": null
        }
      ]
    },
    {
      "content": "You seem to have the idea that ZF generally means that the operands were equal. This is wrong. It is not a property of the ZF that it shows whether the operands were equal. Instead, it is a property of CMP that it sets the zero flag if the operands are equal. This code snippet does not execute CMP.\n\nInstead, this code snippet executes TEST, which works differently. It says ZF exactly in those cases where no bit is set in both the first and the second operand. So if AL is nonzero, TEST AL,AL will find that some bits (all that are set in AL) are set in both the first and the second operand, and clear ZF. On the other hand, if AL is zero, no bit in AL is set, so there is no bit that is set in either the first or second operand, and ZF will be set.\n\nThe test for zero can be performed with the same effect using either TEST, AND or OR, where both operands are the same register. You will find all three variants in real-world code to test whether a register is zero.\n\n",
      "votes": "2",
      "user": "Michael Karcher",
      "time": "Aug 9, 2021 at 21:23",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Let's go into the important instructions in the reversed order.\n\nYou have some natural possibilities to reach your desired behavior (jumping over the \"bad boy\"), but at first I remind the original order of instructions:\n\n```\nCALL ...\nTEST AL,AL\nJNZ ...\n\n```\n",
      "votes": "1",
      "user": "MarianD",
      "time": "Aug 10, 2021 at 1:14",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jason",
          "text": "Thank you very much. i'm lost in assembly code. JNZ mean : Jump if Not Zero Set (zf = 0) right? And it must have 0 value? am i right?",
          "time": null
        },
        {
          "user": "Jason",
          "text": "JNZ is same JNE ? i saw that in CMP instruction like : (EAX = -1 )CMP EAX,-1 , JNE Short ... . So in this case we must see that the comparison is equal or not. right? or we should see result of EAX?",
          "time": null
        },
        {
          "user": "MarianD",
          "text": "@Jason -  \"JNZ mean : Jump if Not Zero Set (zf = 0) right?\" - No. Forget about flags, they will confuse you. JNZ means: Jump if the last result was Not Zero.",
          "time": null
        },
        {
          "user": "MarianD",
          "text": "@Jason - \"JNZ is same JNE ?\" - Yes, it is. One and the same machine instruction may have more than 1 mnemonics to help us, humans. - \"CMP EAX,-1 , JNE Short ... . So in this case we must see that the comparison is equal or not. right? \" - Yes, you're right. - \"or we should see result of EAX?\" - No. The CMP instruction internally makes the difference between the first and the second operand, set a flag (or more flags), and then discards the result. No operand is changed, so you will not see the result in EAX, because it keeps its original value.",
          "time": null
        },
        {
          "user": "MarianD",
          "text": "@Jason - \"I saw oldest post that someone said the JNZ mean, Jump if Not Zero Flag Set !\" - it is not correct, of course... - All your other questions you answered yourself correctly. - May I recommend you A Crash Course in x86 Assembly for Reverse Engineers? (PDF, only 26 pages.)",
          "time": null
        }
      ]
    }
  ]
}