{
  "title": "Change manifest file using ResourceHacker CLI",
  "link": "https://reverseengineering.stackexchange.com/questions/29120/change-manifest-file-using-resourcehacker-cli",
  "content": "I want to automate some manifest file changes (change requestedExecutionLevel level to requireAdministator from asInvoker) so I have to use ResourceHacker CLI.\n\nI have managed to extract the resources file using the command\n\nResourceHacker.exe -open rh.exe -save rh.res -action extract -mask MANIFEST, -log CONSOLE\n\nAfter modifying the rh.res file  and after running \n\nResourceHacker.exe -open \"rh.exe\" -save \"rh2.exe\" -action addoverwrite -res \"rh.res\" -mask MANIFEST, -log CONSOLE\n\nI get the rh2.exe file which works perfectly fine, but doesn't have any changes as far as I can see. However, checking the MD5 I can observe that the hash is different.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "1k",
  "tags": [
    "windows",
    "pe",
    "executable",
    "pe-resources"
  ],
  "user": "ChillSheep",
  "time": "Aug 10, 2021 at 17:26",
  "comments": [],
  "answers_data": [
    {
      "content": "Your commands to correct replace the manifest are correct. The likely problem is you are corrupting the .res file; note this is a compiled binary format, you cannot just modify it in a simple text editor, despite it containing the manifest contents in a text format. After exporting, if you make the text longer you will need to modify the .res file header, some basic details here https://docs.microsoft.com/en-us/windows/win32/menurc/resource-file-formats\nAlternately edit the .res file in Resource Hacker or Visual Studio then compare the files at a binary level to see what is being modified. Once you have a valid .res file to import your commands will work.\n\nYou can manually confirm your .res file is the problem by using Resource Hacker to manually replace your .res file, if you have corrupted it you will get a failure message.\n\nWith a corrupt .res file you will see something like this:\n\n\n\nWith a valid .res file you will see output like below:\n\n\n\n",
      "votes": "1",
      "user": "chentiangemalc",
      "time": "Aug 17, 2021 at 6:39",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "However, there are tools to extract \"decompiled\" .res files (that is .rc scripts without the symbolic names given to IDs) which could be used to extract a textual form, then patch that and then reintroduce it into the binary. Don't recall, though, if ResourceHacker has this ability.",
          "time": null
        },
        {
          "user": "chentiangemalc",
          "text": "Yes resource hacker can do this via the gui",
          "time": null
        }
      ]
    }
  ]
}