{
  "title": "Reversing a .LIB file",
  "link": "https://reverseengineering.stackexchange.com/questions/29253/reversing-a-lib-file",
  "content": "So I found an mp3 player the other day and I thought it'd be fun to try and reverse engineer the files I found on it (and maybe even try to modify it). When I plugged it in to my pc I was surprised to see more than just folders with mp3 files, I could see a few .LIB files named \"AUDIBLE.LIB\", \"EBOOK.LIB\", \"M3U.LIB\", \"MUSIC.LIB\", \"MUSIC2.LIB\", \"PICTURE.LIB\", \"VIDEO.LIB\". I wanted to see what they looked like so I tried to find out how to read .LIB files using google, however I did not succeed. I tried dumpbin, hxd and ida, but none of them worked (dumpbin said it was an invalid file format, hxd didn't help with finding a magic number and ida couldn't open it). Each file starts with the name of the file (eg: \"PICTURE\"), followed by some 00 bytes, the 8th byte is 01 and then come another 5 00 bytes followed by \"ALLFILE\". I'm new to reverse engineering so I'm sorry if this question is stupid, but how would I go about reverse engineering this?\n\nFile example (only the first few lines of bytes):\n\n```\n45 42 4F 4F 4B 00 00 00 01 00 01 00 00 00 00 00\n41 4C 4C 46 49 4C 45 00 00 00 00 00 00 00 00 00\n00 00 00 00 02 00 03 00 00 00 00 00 00 00 00 00\n00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00\n00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00\n00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00\n\n```\nIn case it matters, the mp3 player is a Xemio-240.\n\n",
  "votes": "1",
  "answers": 2,
  "views": "924",
  "tags": [
    "libraries"
  ],
  "user": "Matthias",
  "time": "Sep 6, 2021 at 12:08",
  "comments": [
    {
      "user": "MaxUgly",
      "text": "I have a set of Bluetooth ear buds (Axloie S7) that have a GB of storage built in and also function as an mp3 player. There is a file that stays exactly 1,500KB no matter what I put on the drive titled “MUSIC.LIB” in the root of the drive. I will try to describe how it. Here is the first little chunk, minus the asterisks *MUSIC ALLSONG ALBUM ARTIST GENRE * Then a bunch of zeros Then metadata for each song with zeros in between Then a bunch of random characters that look like code or encrypted data Then *UUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUULAME3.89 (beta)UUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUU",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I guess the files you found are index files. They contain the list of all pictures, ebooks, playlists (m3u) and so on, so the player doesn't have to open each individual file when you search for a specific song or video.\nThis means these files are most like a custom database format. The first header line might be something like the \"database name\", and the second header line, always \"ALLFILES\" might be a \"table name\".\n\nI don't recognize this file as the storage format of a well-known open-source database engine, but that would be the area where I suggest you to start researching. It might be a completely custom format, though.\n\n",
      "votes": "2",
      "user": "Michael Karcher",
      "time": "Sep 6, 2021 at 15:12",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "My BT-Voice-Recorder DVR-188 has also these files:\nDevice-Memory:\n\n```\n AH        384.000 AUDIBLE.LIB\n AH        384.000 EBOOK.LIB\n AH      1.485.312 M3U.LIB\n AH      1.536.000 MUSIC.LIB\n AH        384.000 PICTURE.LIB\n AH        384.000 VIDEO.LIB\n   D               RECORD\\\n                   \\A\\\n                    \\REC001.WAV\n                   \\B\n                   \\C\n                   \\D\n                    \\REC001.MP3\n                    \\REC002.WAV\n\n```\nTF (SD-Card):\n\n```\n AH        384.000 AUDIBLE.LIB\n AH        384.000 EBOOK.LIB\n AH      1.485.312 M3U.LIB\n AH      1.536.000 MUSIC.LIB\n A           5.632 MUSICBMK.BMK\n AH        384.000 PICTURE.LIB\n AH         26.624 USERPL1.PL\n AH         26.624 USERPL2.PL\n AH         26.624 USERPL3.PL\n AH        384.000 VIDEO.LIB  \n   <DIR>          MUSIC\\\n                   … *.mp3\n                   … *.wav\n                   … *.wma\n   <DIR>          RECORD\\\n\n```\nI'm not sure if it can also play FLAC or APE.\nDo you need hex-Code?\n\n",
      "votes": "0",
      "user": "Mäx",
      "time": "Jan 21, 2024 at 17:09",
      "is_accepted": false,
      "comments": []
    }
  ]
}