{
  "title": "Ida Pro doesn't recognize known function",
  "link": "https://reverseengineering.stackexchange.com/questions/29281/ida-pro-doesnt-recognize-known-function",
  "content": "I open statically Arm binary with Ida Pro.\n\nWhile I reversing I find out some function like strstr and memcpy and etc. That Ida doesn't understand that those function are strstr and memcpy(for example)\n\nWhy is that? Why Ida cannot recognize such famous function? How can I \"help\" Ida to recognize functions like that.\n\nThat makes my reversing more easier.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "502",
  "tags": [
    "ida",
    "static-analysis",
    "ida-plugin",
    "libraries",
    "libc"
  ],
  "user": "yfr24493AzzrggAcom",
  "time": "Sep 12, 2021 at 16:21",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "The IDA \"SDK and Utilities\" download from the Hexrays website has all the tools required to roll your own. In fact the purpose of these is that within your very own niche you can create signatures for well-known functions for oft-used targets without having to rely on those from the makers.",
      "time": null
    },
    {
      "user": "R4444",
      "text": "Does this answer your question? IDA pro and default windows (lib) functions",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I think you are looking for something called FLIRT signature. You can use them to identify common definitions from various libraries. You just need to download the flirt signatures, and let IDA do the work.\n\nA public flirtdb repo can be found on github here. You can search for others on google too.\n\nEdit: My bad, totally missed out the ARM linux part. Unfortunately, these signatures are not built into IDA, although I think IDA might have provided some default ones. For ARM linux, I can't seem to find any public ones online, so you may have to generate your own signatures. To do so, you basically generate signatures off precompiled library files. Check out this guide I found and see if it works for you.\n\n",
      "votes": "1",
      "user": "0xC0000022L",
      "time": "Sep 13, 2021 at 11:28",
      "is_accepted": false,
      "comments": []
    }
  ]
}