{
  "title": "Finding AES Key in binary using Ghidra and FindCrypt",
  "link": "https://reverseengineering.stackexchange.com/questions/29315/finding-aes-key-in-binary-using-ghidra-and-findcrypt",
  "content": "I would like to learn more about RE.\n\nI wrote a simple program on a STM32F107 which does nothing else than encrypting and decrypting a text once using AES128-ECB.\n\nHere is the C code (I intentionally left out the key so far):\n\n```\n    struct AES_ctx TestAes;\nuint8_t key[16] =\n        { MY_KEY_IS_HERE };\nuint8_t InputText[16] =\n        { 1, 2, 3, 4, 5, 6, 7, 8, 9, 0xa, 0xb, 0xc, 0xd, 0xe, 0xf, 0 };\nAES_init_ctx(&TestAes, key);\nAES_ECB_encrypt(&TestAes, InputText);\nAES_ECB_decrypt(&TestAes, InputText);\n\n```\nNow I want to find the 16 byte private key in my binary.\n\nWhen I open the binary in a hex editor and search for my key I find all 16 bytes in a row.\n\nI loaded the binary in Ghidra, installed FindCrypt before and now run the analysis.\n\nFindCrypt now finds AES_Decrytion_SBox_Inverse and AES_Ecryption_SBox.\n\nBut both are not my AES key but the SBox. How does it go on after that? In all tutorials I find it looks quite simple, because the Functions Finder finds the AES functions - but since the project is Bare Metal this will probably not work.\n\nI thought FindCrypt looks for some kind of hex pattern which could result in a key...\n\nI have attached the binary. endian is little, architecture is ARM Cortex (I think?!)\n\n\n\n",
  "votes": "3",
  "answers": 1,
  "views": "3k",
  "tags": [
    "disassembly",
    "ghidra",
    "decryption"
  ],
  "user": "guenthernagel",
  "time": "Sep 20, 2021 at 15:49",
  "comments": [],
  "answers_data": [
    {
      "content": "FindCrypt is not supposed to find your key, it's supposed to find fixed, known constants associated with well-known cryptographic algorithms. You can see the byte patterns it's looking for in its database.json. It has done exactly what it was supposed to do. Your job as a reverse engineer is to look at the cross-references to the tables that it found and see if you can determine the key being passed as argument to the encryption or decryption routines.\n\n",
      "votes": "7",
      "user": "Rolf Rolles",
      "time": "Sep 21, 2021 at 4:59",
      "is_accepted": false,
      "comments": []
    }
  ]
}