{
  "title": "Bypassing unsupported android TV box!",
  "link": "https://reverseengineering.stackexchange.com/questions/29433/bypassing-unsupported-android-tv-box",
  "content": "I have an android TV box called Proximus decoder v4, anyway the android TV box is not supported anymore by the company. When I turn it on I get an update checking, you can't even cancel it, and then I get an error message update has been failed because like I said the decoder v4 it is not supported anymore, then the device restarts and goes into a loop, also the device opens 3 ports one of them is ssh, but all ports are closed! Which means I cannot connect to the device using any of these ports! Anyway, my intention is to bypass the update somehow and access the device menu! Anybody has any idea what can I try?\n\nIf you need more information, let me know!\n\nSorry English not my first language!\n\n",
  "votes": "1",
  "answers": 0,
  "views": "279",
  "tags": [
    "firmware",
    "android",
    "patch-reversing",
    "api-reversing",
    "smart-devices"
  ],
  "user": "Zakaria Halloumi",
  "time": "Oct 19, 2021 at 22:25",
  "comments": [
    {
      "user": "Robert",
      "text": "First try the easy things like capturing the network traffic with Wireshark to learn which server it tries to contact. If you are luck the call is unencrypted HTTP and you can read everything. Otherwise try to set-up mitmproxy and hope that the box does not perform any cert validation. If you know the network request you can start to set-up a little server on your own and redirect calls to it so you can send your own responses. If you are lucky a simple \"OK\" response is enough to let the box continue.",
      "time": null
    },
    {
      "user": "Zakaria Halloumi",
      "text": "Thanks for your comments I tried the Wireshark thing it seems not working i tried to intercept the packets between router and device, all I can see on Wireshark is a tiny packet sent to the router with nothing useful on it (encrypted I guess) I was thinking probably the server that the device trying to contact perhaps no longer exist or changed because the device is a bit old (not much early 2014) I didn't try the last methods, I might need some more information about setting up my own server and redirecting calls to it, thank you!",
      "time": null
    }
  ],
  "answers_data": []
}