{
  "title": "libuv - spoofing user-agent problem",
  "link": "https://reverseengineering.stackexchange.com/questions/29466/libuv-spoofing-user-agent-problem",
  "content": "Im trying to give an app \"second life\" (gamedev \"banned\" User-Agent of this tool to avoid requests from it).\nThis app is using websocket to get real-time result and then use this result in a GET request.\n\nWhere is header data stored in libuv (what function is using header data - more specified)?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "97",
  "tags": [
    "c++"
  ],
  "user": "CospriMalice",
  "time": "Oct 27, 2021 at 20:02",
  "comments": [],
  "answers_data": [
    {
      "content": "A quick review of libuv, if that's the one you are referring to, does not show any HTTP functionality. So you may be looking in the wrong place for header information. My suggestion is to recover the original string, then grep for it in the binaries you have. Looking at other strings that are also referenced nearby may make it easier to identify the component that uses this string. If you do not know what the string is, at least trying User-Agent itself will lead you to the HTTP library. You can also try Mozilla, curl, etc. as those are often contained in user agent strings.\n\n",
      "votes": "3",
      "user": "exampl3",
      "time": "Oct 28, 2021 at 13:22",
      "is_accepted": false,
      "comments": [
        {
          "user": "CospriMalice",
          "text": "User-Agent is {AppName}/{AppVersion}, it's not hardcoded and I dont know yet how I can find AppName/AppVersion function. About the libuv, when this program failed to connect (for example because of 403 error) it tries to reconnect (and there is \"uv_tcp_connect\" to reconnect - this function is used \"in loop\" per ~5sec). About the Websocket, as far as I remember when the program worked fine the function \"ws2_32 send\" was called, but now it's not.  Thats why I thought libuv is used atleast to \"check if server is available\" then start a websocket and then send GET request.",
          "time": null
        }
      ]
    }
  ]
}