{
  "title": "Known publicly available modified UPX ELF packer [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/2947/known-publicly-available-modified-upx-elf-packer",
  "content": "Anyone know of any publicly available modified versions of UPX for ELF? I.e. one that is not able to be unpacked using upx -d. The unpacking stub in the binary is slightly obfuscated. I am looking to identify the source of these modifications.\n\n",
  "votes": "3",
  "answers": 1,
  "views": "1k",
  "tags": [
    "elf",
    "packers",
    "upx"
  ],
  "user": "Raindog",
  "time": "11 years ago",
  "comments": [
    {
      "user": "Ange",
      "text": "Please give more details - I am not aware of such a list.",
      "time": null
    },
    {
      "user": "Raindog",
      "text": "Jason, this had to do with reverse engineering because unpacking binaries and indentifiying the packer is reverse engineering.",
      "time": null
    },
    {
      "user": "Ange",
      "text": "but your question is just about a list (not unpacking or identifying), thus we can't contribute in that direction.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "UPX is already managing ELF (see: UPX supported executable formats). Or, did I miss the point of your question ?\n\nBut, note that UPX is not designed for obfuscation purpose, it mainly aims at compressing the executable.\n\n",
      "votes": "1",
      "user": "perror",
      "time": "Oct 24, 2013 at 22:51",
      "is_accepted": false,
      "comments": [
        {
          "user": "Raindog",
          "text": "I know it supports ELF. I have a binary that used a modified version of UPX in that the compression schemes, but that the unpacking stub is slightly obfuscated.",
          "time": null
        },
        {
          "user": "perror",
          "text": "I better understand your question now. But, the best way to have an accurate answer would be to show the modification you found and/or part or the whole asm code of the packer prelude.",
          "time": null
        }
      ]
    }
  ]
}