{
  "title": "Attack on wireless interconnection [duplicate]",
  "link": "https://reverseengineering.stackexchange.com/questions/2956/attack-on-wireless-interconnection",
  "content": "Scenario: \n\nWhich instruments are best for discovering carrier frequency?\n\nHow encrypted-text should be gathered to attack on it ( kind of software, e.g. something like horst, but more broad )?\n\n",
  "votes": "3",
  "answers": 2,
  "views": "229",
  "tags": [
    "tools",
    "hardware",
    "encryption",
    "physical-attacks"
  ],
  "user": "polar bear on the white snow",
  "time": "11 years ago",
  "comments": [
    {
      "user": "Fewmitz",
      "text": "What do you mean wifi-like? Are they connected using WPA2 or a similar protocol or is it something different? Is the device an AP and a client of some kind? More details about the specific situation would make it easier to give a proper answer.",
      "time": null
    },
    {
      "user": "polar bear on the white snow",
      "text": "I make little changes. Question should looks like \"How to attack encrypted wi-fi, where I don't know even carrier frequency?\"",
      "time": null
    },
    {
      "user": "0xea",
      "text": "A more specific question would probably get you some better answers. Give a bit more details on what you know about this system.",
      "time": null
    },
    {
      "user": "asheeshr",
      "text": "I closed this as a dupe of the other as they cover the same thing, but that seems to be a better iteration of the question. In the future, please edit your initial question itself rather than asking a newer one with minor changes.",
      "time": null
    },
    {
      "user": "polar bear on the white snow",
      "text": "Close, but please, don't delete, there are two pretty answers.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "If \"something like wi-fi\" means it's radio but not really 802.11, you might want to take a look at Software Defined Radio projects. As the question isn't really clear, your mileage may vary. \n\nThere are numerous hardware tools you can use. \nFrom relatively expensive tools like bladeRF and hackRF to really cheap alternatives like rtl-sdr. You'd probably need to do some research on how to actually use them for what you want. \n\n",
      "votes": "3",
      "user": "0xea",
      "time": "Oct 26, 2013 at 19:37",
      "is_accepted": true,
      "comments": [
        {
          "user": "polar bear on the white snow",
          "text": "Your answer is very nearby for what I'm looking for. Exactly, something like wi-fi or GSM. Simple clarification may be only \"Radio\". Me need to detect carrier, thereafter sniff packets to make similar to WPA2 attack, if it's possible. I'll probably create another question about only detection of carrier.",
          "time": null
        }
      ]
    },
    {
      "content": "I would say this guide is a good place to start. However, this is assuming when you say \"wifi-like\" you mean very similar to authentication using WPA2.\n\nCracking WPA2 is a little more complex than WEP, for example. The initialization code for WPA2 uses a four-way handshake to properly initialize all of the vectors that are used in the actual encrypting. So in order to properly break it you need to sniff the traffic that gets sent back and forth during a session initialization. However, because this is a WiFi it's not uncommon for packets to not be sniffed properly. So you should be aware that you may have to initialize the connection more than one time. Again, see the link I posted.\n\nAs for not knowing the carrier frequency there are a few ways to approach the issue. As the link pointed out they suggest getting an antenna. This is the best option when you're doing anything with WiFi. However, if you have reason to believe the access point is on a standard frequency discovering it could be as simple as an App on a smartphone to search for networks. But if you're doing this with any kind of frequency you should get an antenna and look for some guides on how to interact with it; they're all over the place.\n\nAnother approach would be to look at the client. Since you asked this question on an RE forum I'm assuming you have access to at least one of the access points so you can attack it from that angle and try to trace what happens when the connection is initiated.\n\n",
      "votes": "4",
      "user": "Fewmitz",
      "time": "Oct 26, 2013 at 18:02",
      "is_accepted": false,
      "comments": []
    }
  ]
}