{
  "title": "Is it legal to publish details on how to reverse engineer a non commercial game?",
  "link": "https://reverseengineering.stackexchange.com/questions/29577/is-it-legal-to-publish-details-on-how-to-reverse-engineer-a-non-commercial-game",
  "content": "Say I used a game engine and made a game (from scratch on my own). Further, I provide details on how to reverse engineer my game, including methods and details.\n\nTwo questions.\n\n",
  "votes": "3",
  "answers": 1,
  "views": "623",
  "tags": [
    "law"
  ],
  "user": "111",
  "time": "Nov 19, 2021 at 10:45",
  "comments": [
    {
      "user": "hairlessbear",
      "text": "If you're in the US, EFF has a good page about laws and court decisions surrounding reverse engineering: eff.org/issues/coders/reverse-engineering-faq",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You should ask a lawyer about legal questions -- I am not one, and my understanding of this topic is not more valuable than an actual lawyer's. That said, to my knowledge: generally speaking, for someone to land in legal trouble for reverse engineering, they either need to have:\n\nBoth of the above center around unauthorized uses of reverse engineering. Given that you are talking distributing software for free, with explicit authorization of reverse engineering, with source code, and with instructions on how to reverse engineer it, you are effectively waiving your rights to the types of civil proceedings that generally surround reverse engineering. If you were to sue somebody for reverse engineering your software, they would simply point to your own authorization as a defense as to why their actions were legal. On the criminal side, nobody's commercial interests are being harmed -- which is the cornerstone of criminal penalties against reverse engineering -- and so the government has no reason to care about it. Somebody with a stake in the matter has to be upset in order for a reverse engineer to go to jail or get sued.\n\nThe idea of people creating software for the express purpose of other people reverse engineering it is not new. Capture The Flag and crackme contests have already been doing this for decades. Although it's less common, sometimes commercial software allows reverse engineering by license agreement. For example, here's a bit of text from Hex-Rays' license agreement:\n\nOne thing I might note is that, if your code relies upon third-party libraries: you, yourself, do not have legal standing to authorize people to reverse engineer other peoples' code. I.e., if the game engine that you're using has license provisions against reverse engineering, your declaration that it is okay to reverse engineer your own code ultimately does not supplant the engine developers' own license terms surrounding reverse engineering of their code. I imagine it's possible that the engine developer could hold you liable for breaches of their license terms. But, if the engine is open source, then intellectual property interests like that are a moot point, since people can simply read the source code much easier than they could reverse engineer it.\n\n",
      "votes": "7",
      "user": "Rolf Rolles",
      "time": "Nov 19, 2021 at 1:02",
      "is_accepted": true,
      "comments": [
        {
          "user": "Michael Karcher",
          "text": "Note that the Hex-Rays license allows you to reverse engineer IDA, but it still doesn't allow you to create patched versions (\"derived works\") of IDA. This is a separate issue in most copyright regulations and would need a second permission. Using knowledge gained from reverse engineering to create IDA plugins would be fine, though.",
          "time": null
        }
      ]
    }
  ]
}