{
  "title": "Understanding Loop Statements: For & While [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/29653/understanding-loop-statements-for-while",
  "content": "Hello! New user. I am working on a personal computer science project that involves research on loop statements such as the for and while loops in C - these loops can apply to other programming and scripting languages but, to keep things simple I want to focus primarily on C.\n\nI would like to know how developers of programming and scripting languages are able to create for and while loops for those same languages. How can I achieve this for experimentation purposes? Do I have to learn assembly? If so, can anyone provide me with guidance?\n\nApologies if my original question was too vague.\n\nCheers!\n\n",
  "votes": "0",
  "answers": 2,
  "views": "113",
  "tags": [
    "c"
  ],
  "user": null,
  "time": "3 years ago",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "what do you mean by \"recreate\"? Please explain what is the problem you're trying to solve; maybe add some examples.",
      "time": null
    },
    {
      "user": "user29031",
      "text": "I thought I was clear. I guess not. I am not trying to do anything fancy. I just want to know how developers of programming and scripting languages were able to create for and while loops. I do not know how to do this. Given this is site is focused on reverse engineering, I assumed it would be appropriate to ask my question here. Do you have any suggestions on how I should edit my question?",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@MichaelŠòdéké it really still isn't very clear. Are you asking about specific scripting languages and their implementation of for and while loops? If so, you'd have to give the language at least some reference to find a sample and an interpreter for said language. Are you asking conceptually how one would implement such a thing? In that case it's not reverse engineering at all. Please edit the details into your question and then vote to Reopen (link right under your question)",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "basic construct in c,.... languages\n\n```\nfor (index =start_value; index< end_value; (pre/post) inc/dec(index))\nlike \nfor (i = 0; i< 10; i++) , ( i=10,i>0;i--) , (i=35; i> 25; --i) ,(i=35; i< 25; ++i)\n\n```\nthe compiler takes this human readable code and converts it into assembly for the specific platform\n\nfor x86 this could look like\n\n```\nmov end_value to another register like mov edx,10 \nmov index to a register like mov,ecx,0\nbody {\ndo anything but preserve  ecx,edx\n}\ninc/dec regsiter ecx\ncompare ecx with edx,\ndo an if < or > decision and either go back to doing the body or exit \n\n```\na real world example\n\n```\nint main (void) {\n    register int a =4;\n    for (register int i =3; i<10; i++){\n        a = a + i*2;\n    }\n    return a;\n}\n\n```\ncompiled and disassembled using vs and windbg\n\n```\n:\\>ls\nloopy.cpp\n\n:\\>cl /Zi /W4 /analyze:autolog- /Od /EHsc /nologo -GS loopy.cpp  /link /release /subsystem:windows /entry:main /fixed\nloopy.cpp\n\n:\\>ls\nloopy.cpp  loopy.exe  loopy.obj  loopy.pdb  vc140.pdb\n\n```\ndisassembly of compiled code\n\n```\n:\\>cdb -c \"uf loopy!main;q\" loopy.exe | awk \"/Reading/,/quit/\"\n0:000> cdb: Reading initial command 'uf loopy!main;q'\nloopy!main:\n00000000`00401000 55              push    rbp\n00000000`00401001 8bec            mov     ebp,esp\n00000000`00401003 83ec08          sub     esp,8\n=====================\nmemory location instead of register  used\n00000000`00401006 c745f804000000  mov     dword ptr [rbp-8],4 \n00000000`0040100d c745fc03000000  mov     dword ptr [rbp-4],3\n=====================\n00000000`00401014 eb09            jmp     loopy!main+0x1f (00000000`0040101f)\n\nloopy!main+0x16:\n00000000`00401016 8b45fc          mov     eax,dword ptr [rbp-4]\nincrement ==================\n00000000`00401019 83c001          add     eax,1\n00000000`0040101c 8945fc          mov     dword ptr [rbp-4],eax\n\nloopy!main+0x1f:\n============ comparison and decision\n00000000`0040101f 837dfc0a        cmp     dword ptr [rbp-4],0Ah\n00000000`00401023 7d0e            jge     loopy!main+0x33 (00000000`00401033)\n============== body\nloopy!main+0x25:\n00000000`00401025 8b4dfc          mov     ecx,dword ptr [rbp-4]\n00000000`00401028 8b55f8          mov     edx,dword ptr [rbp-8]\n00000000`0040102b 8d044a          lea     eax,[rdx+rcx*2]\n00000000`0040102e 8945f8          mov     dword ptr [rbp-8],eax\n00000000`00401031 ebe3            jmp     loopy!main+0x16 (00000000`00401016)\n=========== body end goes back to re doing again \n================ exit\nloopy!main+0x33:\n00000000`00401033 8b45f8          mov     eax,dword ptr [rbp-8]\n00000000`00401036 8be5            mov     esp,ebp\n00000000`00401038 5d              pop     rbp\n00000000`00401039 c3              ret\nquit:\n\n```\nin laymans terms\nthis assembly is now further converted to binary (base 2 ,or 0,1) and fed into a network of logic gates which use and , or , not , nand ,xor, xnor circuitry to do the  actual work\nso simply a not gate might  return false or true based on the input of index 0b101 versus 0b1000\n\nif you need the basic electronics and logic gate circuitry you should look for electronics stack exchange\n\nyou can also check online logic simulators like this\n\n\n\n",
      "votes": "0",
      "user": "blabb",
      "time": "Dec 3, 2021 at 4:06",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "I'll assume you're slightly familiar with machine code / assembly language. The high-level statement\n\n```\nwhile (x >= 0) {\n    print(x);\n    --x;\n}\n/* rest of code */\n\n```\nneeds to be translated down to simple machine code instructions like add, compare, call, and -- specifically for the loop, jump and branch instructions. Every processor has a different instruction repertoire, but similar instructions tend to be present in most modern CPU architectures\n\nHere is one possible translation of the while loop for the Intel x86 architecture (in 64-bit mode):\n\n```\n    jmp    loop_test\nloop_body:\n    mov rcx,rsi\n    call print\n    dec rsi\nloop_test:\n    test  rsi,rsi\n    jns loop_body\n; rest of code\n\n```\nThe very first instruction is a jmp instruction that jumps past the loop body directly to loop_test. The reason for doing this has to do with efficiency, and is worth a separate question. Here, we'll content ourselves with knowing that the next instruction will be the one after the label loop_test.\n\nThe instructions between the labels loop_body and loop_test correspond to the body of the loop. The compiler has decided to put the high-level language variable x in the rsi register. Because calling the procedure print requires its parameter to be in the rcx register, the mov rcx,rsi copies the value of rsi into rcx. Then the procedure print is called. Finally the value in the rsi instruction is decremented by one.\n\nControl then falls into the loop_test block. Here, the statement test rsi,rsi compares rsi with itself. As a side effect, it happens to set or clear the processor's S flag, which indicates whether the value in rsi was negative or not -- that is, whether the highest order bit 63 was set or not. On the x86 architecture, signed numbers are represented in two's complement, so negative numbers will have their high order bit set.\n\nIf the high order bit of rsi is not set, then the S flag will be cleared by the test instruction. The next instruction jns jumps back to loop_body if the S flag is not set (hence the jns - \"jump if not signed\" if you want). The jns instruction is a conditional jump; the jump is either taken back to loop_body or it falls through to the code following the loop.\n\nFor-loops are basically while-loops with extra chrome. With some exceptions, a for-loop\n\n```\nfor (x = 0; x < 42; ++x) {\n    /* loop body */\n}\n\n```\nis transformed into\n\n```\nx = 0;\nwhile (x < 42) {\n    /* loop body */\n    ++x;\n}\n\n```\nand then the compiler will translate that into something similar to the while-loop above.\n\n",
      "votes": "1",
      "user": "John Källén",
      "time": "Dec 3, 2021 at 2:10",
      "is_accepted": false,
      "comments": []
    }
  ]
}