{
  "title": "Help identifying a 433.92 MHz signal modulation?",
  "link": "https://reverseengineering.stackexchange.com/questions/29979/help-identifying-a-433-92-mhz-signal-modulation",
  "content": "\n\nI have this report for the remote for the blinds.   https://fccid.io/YC5AC123-02/Test-Report/RF-Report-2498699\n\nIt says os OOK modulated.  However I don't understand the signal I recorded when pushing the remote buttons.\n\nDoes anyone know what I am looking at here?  Sorry I am very new to reversing RF signals.  THanks!\n\n",
  "votes": "4",
  "answers": 1,
  "views": "404",
  "tags": [
    "rf"
  ],
  "user": "ril3y",
  "time": "Feb 4, 2022 at 2:59",
  "comments": [
    {
      "user": "Ian Cook",
      "text": "The 433 MHz devices I've looked at all begin with some form of signal to wake and and synchronize the receiver before the actual message is sent. This type of preamble or similar may be what you have captured here.  As the posted answer says it's highly likely that your picture is far from the full transmitted message.  Perhaps share the captured file ?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I'm pretty sure that what is on your picture is not the full message. You can see digital code in the FCC document.\n\nWhat system have been used to capture the signal?\nRTL_433 might have the code implemented for your remote, otherwise URH might be good if you need to reverse it by yourself.\n\n",
      "votes": "1",
      "user": "dieter reichl",
      "time": "Feb 4, 2022 at 17:46",
      "is_accepted": false,
      "comments": [
        {
          "user": "ril3y",
          "text": "I used a HackRF and a RTL device to capture the signal.  Its not the full message yes. However I was trying to understand what I was seeing.  It does not look like the OOK modulation I was expecting.  I am very new to this so perhaps I am missing something.",
          "time": null
        },
        {
          "user": "dieter reichl",
          "text": "Try to use URH, it is a software suite exactly for that what you want. OOK does have some pulse length coding and the signal will be typically have much more pulses",
          "time": null
        }
      ]
    }
  ]
}