{
  "title": "inspecting the .hex file generated by gpasm",
  "link": "https://reverseengineering.stackexchange.com/questions/30005/inspecting-the-hex-file-generated-by-gpasm",
  "content": "To answer my own question here, I wrote a small sample program, example.asm:\n\n```\nvar_1 equ H'0001'\n\n    constant var_2=H'0002'\n\n#define var_3 H'0003'\n\ncblock H'0004'\n    var_4\nendc\n\n    END\n\n```\nand compiled it with gpasm using the instructions here, Makefile\n\n```\nall: example.asm    \n    gpasm -p p10f200 example.asm \n\nclean:\n    rm -f *.hex *.lst *.cod *.asm~ \n\n```\nNow inspecting the example.hex file with hexdump -C example.hex, I get:\n\n```\n\n00000000  3a 30 32 30 30 30 30 30  34 30 30 30 30 46 41 0a  |:020000040000FA.|\n00000010  3a 30 30 30 30 30 30 30  31 46 46 0a              |:00000001FF.|\n0000001c\n\n```\nwhich I have no clue how to interpret, and the objdump -d example.hex, throws this error:\n\n```\n\nexample.hex:     file format ihex\n\nobjdump: can't disassemble for architecture UNKNOWN!\n\n```\neventually I want to know what are the differences between the above four different methods of defining a constant and compare their performance and memory efficiency.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "157",
  "tags": [
    "disassembly",
    "objdump"
  ],
  "user": "Foad",
  "time": "Feb 7, 2022 at 22:14",
  "comments": [
    {
      "user": "Peter Cordes",
      "text": "Isn't .hex already a text file?  Looks like you're hex-dumping an ASCII hex dump, not a .bin",
      "time": null
    },
    {
      "user": "Foad",
      "text": "Dear @PeterCordes , My apologies. I am absolutely ignorant about the topic. My final goal is to compare the compiled version of the above four syntax and see the differences.  Where did I go wrong, and how should I do that instead?",
      "time": null
    },
    {
      "user": "Peter Cordes",
      "text": "They're text files, so diff -u foo1.hex foo2.hex.  And/or just look at them with a text editor you know how to use, or a GUI diff tool like meld.  Of course, you don't use any of the constants, so like we explained in comments on your SO question, no part of the assemblers output corresponds to them at all; your output is the same as for an empty file.  And if you did use them, they'd all be equivalent (or would be if you'd used the same numbers)",
      "time": null
    },
    {
      "user": "blabb",
      "text": "you are defining not using there will be no assembly generated for defines and no efficiency calculations can be done you need to burn cycles for calculating efficiency performance , etc",
      "time": null
    },
    {
      "user": "blabb",
      "text": "there seems to be a gpdasm available as per the doc link you posted which is capable of taking the hex file and disassemble it why not try using it instead of hexdump or objdump ?",
      "time": null
    }
  ],
  "answers_data": []
}