{
  "title": "What is the meaning of jmp dword ptr off_XXXXXXXX + 8 in IDA?",
  "link": "https://reverseengineering.stackexchange.com/questions/30025/what-is-the-meaning-of-jmp-dword-ptr-off-xxxxxxxx-8-in-ida",
  "content": "What is the meaning of this kind of jmp instruction in x86 assembly in IDA?\n\n\n\nDoes it mean that we should jump to the address [6CA2E9B0] + 8 or [6CA2E9B0+8]?\nWhen I follow that off_XXX, I get to the memory region that looks like this:\n\n\n\nIs this some kind of a jump table? loc_6C954360 is indeed pointed by the address 6CA2E9B0, does it mean that the instruction in question jumps to the address pointed by 6CA2E9B0+8? If that's the case, then I must've messed something up in the debugger as the computed address didn't seem to be the same as the one stored in memory.\n\nEDIT:\nI read about the FF /5 jump which I believe is present here:\n\n\nIt should load to EIP the far address stored in the memory location specified by the 4 bytes next to the FF 25. And it seems like it is how it works, as I managed to see that happening in the debugger. However, the address after FF 25 is slightly modified when the library is loaded into a process, are those addresses somehow adjusted once the process starts using the library?\nAlso what is the point of this kind of jumps, why are functions defined in this way?\n\n",
  "votes": "3",
  "answers": 1,
  "views": "995",
  "tags": [
    "ida",
    "assembly",
    "x86"
  ],
  "user": "Moteke",
  "time": "Feb 12, 2022 at 12:56",
  "comments": [
    {
      "user": "blabb",
      "text": "dereference the pointer add the displacement to the dereferenced value and jump to the resultant  normally a method in a class",
      "time": null
    },
    {
      "user": "Moteke",
      "text": "@blabb so in other words EIP = [6CA2E9B0] + 8 = 6C954360 + 8?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "IDA displays +8 because the target address is in the middle of a data item (xmmword is 16 bytes).\n\nYou should undefine the oversized item and create two separate qwords, the second one should be actual pointer used by the instruction.\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Feb 12, 2022 at 12:56",
      "is_accepted": false,
      "comments": [
        {
          "user": "Moteke",
          "text": "Thanks, it makes more sense now. Do you know though why the referenced function shown in IDA is different from the one actually being called when the library is loaded? It looks like those offsets were changed and now point at different functions.",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "@Moteke sorry I don’t know. Possibly something changed during debugging.",
          "time": null
        }
      ]
    }
  ]
}