{
  "title": "Reverse-engineering a weird 32-bit possibly not CRC checksum",
  "link": "https://reverseengineering.stackexchange.com/questions/30133/reverse-engineering-a-weird-32-bit-possibly-not-crc-checksum",
  "content": "I am trying to decode Arad/Master Meter utility water meter RF transmission.\nSo far, I had success with reading the meter serial number and counter reading.\nThe transmission looks like that:\n\nwhere:\n\n00000000 is preamble.\n\n3e690aec7ac84b is fixed in time and the same for other meters in the neighborhood. Probably gearing ratio.\n\nfa1c9073 is Meter serial number. fa1c90 = 9444602, little endian 73= 'S'\n\n00 no idea.\n\na80600 is the counter reading little endian = 1704\n\n000 no idea.\n\n5 is fixed in time and the same for other meters in the neighborhood.\n\n06cd192cc probably some kind of CRC or checksum  - here is where I need help.\n\n8 is getting either 8 or 0 same for other meters in the neighborhood.\n\nf8 is fixed in time and the same for other meters in the neighborhood.\n\nRunning:\n\n```\nreveng -w 32 -s 3E690AEC7AC84BDAB18C7300390E000005BFF1DB9F\n3E690AEC7AC84B13FE8B7300100500000507CBFECD\n3E690AEC7AC84BDAB18C73003B0E0000055C91EB1C\n3E690AEC7AC84B3EC68C7300720E000005C6E1CCD5\n\n```\nI get immediately :\n\nSo if I am not doing anything wrong, Reveng doesn't seem to find anything with brute force.\nAny other idea?\n\nHere is a list of different transmissions I collected:\n\n",
  "votes": "2",
  "answers": 1,
  "views": "360",
  "tags": [
    "crc",
    "checksum",
    "rf"
  ],
  "user": "Avi",
  "time": "Mar 15, 2022 at 6:25",
  "comments": [],
  "answers_data": [
    {
      "content": "I still cannot directly comment and this is my only option to respond:\n\nhere is description of other parameters from same supplier, maybe same model. Some might be transmitted via RF such as battery status. Meter with 9 digits will consume some of the \"0\"s. Gives opportunity to improve your protocol description.\n\nYou highlighted 9 nibbles. Very unlikely for CRC, for CRC-32 result is 8 nibbles.\n\nMeans that it is unknown at the moment but changes and it is probably in use and included in Checksum. And the same maybe for final \"F8\".\n\nFor your data it is true that\n\n```\n0x3e690aec7ac84bfa1c9073005**0**0600000533712209f0f8 ^ 0x3e690aec7ac84bfa1c9073005**1**0600000552c9bdbf50f8 == 0x3e690aec7ac84bfa1c9073005**2**06000005d011128ae8f8 ^ 0x3e690aec7ac84bfa1c9073005**3**06000005b1a98d3c48f8\n\n```\nwhich is true for CRC. So it is not excluding CRC method.\n\nSo some options to play with, find right position and length and get a lucky punch with Reveng.\n\n",
      "votes": "1",
      "user": "dieter reichl",
      "time": "Mar 15, 2022 at 8:35",
      "is_accepted": false,
      "comments": [
        {
          "user": "Avi",
          "text": "Could you explain some more as I am new to CRC? Does * in your code line mean wildcard. Does ^ mean power?",
          "time": null
        },
        {
          "user": "dieter reichl",
          "text": "the \"wildcards\" came from highlighting \"0\", \"1\" etc with bold, which looks a bit weird in code. Just to present difference better. \"^\" is function (at least in Python) for Xor.",
          "time": null
        },
        {
          "user": "Avi",
          "text": "You are correct. My mistake. The counter should be shifted one nibble left. I have corrected that in my original post. Thank you.",
          "time": null
        }
      ]
    }
  ]
}