{
  "title": "Instructions to compare two strings",
  "link": "https://reverseengineering.stackexchange.com/questions/30192/instructions-to-compare-two-strings",
  "content": "I made a list of which instructions compare two strings in disassembly so that when I get to intermodular calls in x64dbg, I can simply type this instructions to see if there is a comparison have been made. Unfortunately, I lost this list. Can someone get me these instructions please. I only remember lstrcmpiA.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "488",
  "tags": [
    "disassembly",
    "windows",
    "debugging",
    "x64dbg"
  ],
  "user": "Kıvanç Cantimur",
  "time": "Apr 2, 2022 at 11:26",
  "comments": [
    {
      "user": "sudhackar",
      "text": "Do you mean strcmp?",
      "time": null
    },
    {
      "user": "Kıvanç Cantimur",
      "text": "Thank you... Are there few more instructions which compare two strings that has \"str\" or \"cmp\" in it?",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@KıvançCantimur not exactly instructions. Those are functions you seem to be looking for.",
      "time": null
    },
    {
      "user": "Kıvanç Cantimur",
      "text": "I wonder if there is a method to set a breakpoint on every conditional state (ect... test eax, eax) in x64dbg or ollydbg?",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@KıvançCantimur if you have another question, please use another question. This isn't a forum. It's a Q&A site and there should be only questions and answers. Comments exist, but they aren't meant for extensive discussions. Turn to our help center if you want to know more.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Hmm this probably isn't an exhaustive list, but feel free to add to it:\n\nBut in all likelihood you are looking for the C runtime ones. The n variety usually is counted (n being the number of characters)\n\nAlso beware that there exist a number of related functions. E.g. with Windows conventionally you can build with _UNICODE defined or not, using <tchar.h>. This will then alias the respective \"bare\" function names to those with trailing A (ANSI) or W (wide character, i.e. \"Unicode\") version.\n\nOn Windows you will also encounter instead of str...something (e.g. strcmp) functions prefixed:\n\n",
      "votes": "3",
      "user": "0xC0000022L",
      "time": "Mar 28, 2022 at 10:29",
      "is_accepted": true,
      "comments": [
        {
          "user": "Kıvanç Cantimur",
          "text": "0xC0000022L, I tried each and every comparison function above but I couldn't find which function is responsible for comparing two strings. I want to crack the serial number. Is there have any other clue of how to find the functions if the \"String references\" window doesn't show any helpful strings to look for?",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@KıvançCantimur it's hard to help any further without having a sample at hand. As far as a crack is concerned: it could be that your string is used as input to a function whose output is then compared to an expected value or range. It could just as well be that the respective functions have been inlined. In particular the C runtime functions will often have compiler runtime counterparts which will be used rather than an imported symbol (via DLL/shared object). But I am afraid without some actual code I cannot help. Also, please use a separate question (but feel free to reference this one).",
          "time": null
        }
      ]
    }
  ]
}