{
  "title": "How to reverse engineer this router firmware using binwalk?",
  "link": "https://reverseengineering.stackexchange.com/questions/30485/how-to-reverse-engineer-this-router-firmware-using-binwalk",
  "content": "I want to modify router firmware so I can enable telnet. What steps should I take? The router is hg630v2; the firmware can be found at this link. It's Linux based.\n\nWhen I do\n\n```\nbinwalk --signature --term HG630V2-12V100R001C36B023_multicast_restore_default_pack.bin\n\n```\nit gives this output:\n\n```\nDECIMAL       HEXADECIMAL     DESCRIPTION\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n307           0x133           LZMA compressed data, properties: 0xB7, dictionary size: 262144 bytes, uncompressed size: 808333686 bytes\n12909         0x326D          LZMA compressed data, properties: 0x5D, dictionary size: 8388608 bytes, uncompressed size: 121464 bytes\n198089        0x305C9         Squashfs filesystem, little endian, version 4.0, compression:xz, size: 6088994 bytes, 1254 inodes, blocksize: 1048576 bytes, created:\n                              2017-03-14 13:21:06\n6288841       0x5FF5C9        uImage header, header size: 64 bytes, header CRC: 0xCE31434, created: 2017-03-14 13:20:27, image size: 1426862 bytes, Data Address:\n                              0x81208000, Entry Point: 0x81208000, data CRC: 0xE377A30F, OS: Linux, CPU: ARM, image type: OS Kernel Image, compression type: lzma,\n                              image name: \"Linux-2.6.30\"\n6288905       0x5FF609        LZMA compressed data, properties: 0x5D, dictionary size: 8388608 bytes, uncompressed size: 3823840 bytes\n\n```\nI want to able to repack the router after extraction and fix CRC issue to be uploaded and installed.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "436",
  "tags": [
    "firmware",
    "router"
  ],
  "user": "Hosni",
  "time": "Jun 7, 2022 at 17:59",
  "comments": [
    {
      "user": "Jon",
      "text": "Have you ruled out that it can't be enabled by another means such as downloading a config backup, modifying a parameter and restoring?  Or whether there are any hidden fields in requests to the web interface that could be modified?  Or was there a specific reason you wanted to do it by modifying the firmware?",
      "time": null
    },
    {
      "user": "Hosni",
      "text": "i tried decrypt backup file i successfully decrypt it but i don't see option for enable telnet i gain access to telnet and ssh but when i tried to write any command it says command failed and when i login it give me a message Server refused to allocate pty",
      "time": null
    }
  ],
  "answers_data": []
}