{
  "title": "LLDB debugging on android?",
  "link": "https://reverseengineering.stackexchange.com/questions/30493/lldb-debugging-on-android",
  "content": "I currently don't have a pc. I have two rooted devices Arm64 host device with Debian rootfs and the device to be debugged which contains the lldb-server binary armv7. I am trying to remote debug my android device using LLDB. I pulled the lldb-server binary from android ndk24 and put it in /data/local/tmp. Installed Debian sid on another term and apt installed lldb.\n\nI connected client device via wifi-hotspot (one with lldb-server) using the host with the linux rootfs.\n\nThe commands I ran on server device\n\n```\n./data/local/tmp/lldb-server platform --listen \"*:2000\"  --server\n\n```\nChecked using netstat and the lldb-server had bound to all addresses(0.0.0.0:2000)\n\nOn host(client lldb) device in debian sid terminal I ran:\n\n```\napt install lldb\nlldb\nplatform select remote-android\nplatform connect connect://192.168.201.132:2000\n\n```\nThen I got error failed connect port.\n\nHowever, using GDB and gdbserver everything worked perfectly. I have tried installing lldb on debian buster but same result and even ran the lldb-server binary on the host(device with debian sid) but same result. Right now I'm stuck here. How do I solve this?\n\nHelp will be greatly appreciated. Thank you.\n\nEdit Here is output of telnet\n\n```\nroot@localhost:~# telnet 192.168.43.1 2000\nTrying 192.168.43.1...\nConnected to 192.168.43.1.\nEscape character is '^]'.\nConnection closed by foreign host.\nroot@localhost:~# telnet 192.168.43.1 5555\nTrying 192.168.43.1...\nConnected to 192.168.43.1.\nEscape character is '^]'.\nKilled\nroot@localhost:~#\n\n```\nAnd heres same network output from lldb.\n\n```\nlldb) platform select remote-android\n  Platform: remote-android\n Connected: no\n(lldb) platform connect connect;//192.168.43.1:2000\nerror: Invalid URL: connect;//192.168.43.1:2000\n(lldb) platform connect connect://192.168.43.1:2000\nerror: Failed to connect port\n(lldb)\n\n```\nAnd now I dont really know the problem. Should i try installing on a different rootfs? Let me do that.\n\nEdit 2\n\nInstalled ubuntu focal and still got same results on lldb 10.0.0.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "2k",
  "tags": [
    "debugging",
    "android",
    "arm",
    "lldb"
  ],
  "user": "Silent",
  "time": "Jun 12, 2022 at 2:20",
  "comments": [
    {
      "user": "Robert",
      "text": "May be a different program like Android Studio or Visual Studio has automatically connected to the remote lldb instance and thus the port is blocked (because only one connection is allowed)? Especially Android Studio is known to be \"greedy\" establishing connections automatically in background and thus blocking other programs. Have you checked on the Android device if there is already a network connection?",
      "time": null
    },
    {
      "user": "Silent",
      "text": "i actually have neither of them installed. Its just a small Debian rootfs in a proot environment and from netstat output i found no established connection but listeners only.",
      "time": null
    },
    {
      "user": "Robert",
      "text": "You wrote that gdb connection works, so in generat TCP seems to work. Just to be sure what happens if you try to connect to port 2000 using telnet instead of lldb? If that works then something is wrong in the communication between lldb and lldb-sever.",
      "time": null
    },
    {
      "user": "Silent",
      "text": "Okay let me try and I will reply what happens. Although could it be a lldb-server problem maybe i should compile lldb-server myself maybe the android ndk provided one have been stripped off other features and cant be connected to using original lldb?",
      "time": null
    },
    {
      "user": "Silent",
      "text": "@Robert I have edited the question",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I don't know if this should be an answer or not. I finally managed to use lldb remote debugging but again faced more challenges but eventually prevailed.\n\nWhat I did was instead of using lldb platform command I used lldb gdbserver command which function correctly but had a caveat of accepting local connections only and rejecting connections from external addresses. So I had to use iptables' nat table to finally make it work.\n\n```\niptables -I INPUT -t nat -p tcp -d 192.168.43.1 --dport 2000 -j SNAT --to-source 192.168.43.1:50000\n./data/local/tmp/lldb-server g 192.168.43.1:2000\n\n```\nThen on lldb client I did\n\n```\ngdb-remote 192.168.43.1:2000\n\n```\n",
      "votes": "1",
      "user": "Viktor",
      "time": "Jun 12, 2022 at 17:37",
      "is_accepted": true,
      "comments": []
    }
  ]
}