{
  "title": "IDA export settings hotkey",
  "link": "https://reverseengineering.stackexchange.com/questions/30517/ida-export-settings-hotkey",
  "content": "People, good afternoon. Tell me please, can anyone know: how to export hotkey IDA? I understand - IDA saves these settings somewhere in the registry, but I can not find this place\n\n",
  "votes": "3",
  "answers": 1,
  "views": "293",
  "tags": [
    "disassembly"
  ],
  "user": "zolik",
  "time": "Jun 14, 2022 at 17:46",
  "comments": [],
  "answers_data": [
    {
      "content": "IDA doesn't stores hotkeys in registry rather it stores gui, terminal user interface(tui), analysis etc. related settings in configuration files which have .cfg extension, this approach provides flexibility in fine tuning/exporting configurations to user.\n\nThese configuration files are stored in cfg/ directory which you can easily find in your IDA installation directory.\nFor example\nIDA_DIR/cfg/ida.cfg\n\nHowever, plugin related configurations are stored in  IDA_DIR/plugins/plugins.cfg\n\nBut the most important configuration files are those that govern the use of IDA and they are the following:\n\nI assume you want to change or reuse your IDA hotkeys. Therefore, you can open idagui.cfg files in any text editor and change settings as per your preference.\n\nAll configuration files are well documented using comments and so does the idagui.cfg file, it has been divided into three sections:\n\nHowever, if you do not feel comfortable editing idagui.cfg directly, then you should create idauserg.cfg in the same directory and add to it all of the options that you wish to override. In this case you only need to edit the last line in idagui.cfg to contains a directive to include idauserg.cfg file. For example:\n\n#softinclude <idauserg.cfg>\n\nNext time in case you upgrade/reinstall/use IDA on some other platform, you can simply copy idauserg.cfg into cfg/ directory. Similar method can be applied for ida.cfg but user provided configuration file should be named as idauser.cfg and include directive in ida.cfg should be appended as above.\n\n",
      "votes": "2",
      "user": "Viktor",
      "time": "Jun 15, 2022 at 13:59",
      "is_accepted": false,
      "comments": []
    }
  ]
}