{
  "title": "Reverse-engineering the S-Note (.spd) file format?",
  "link": "https://reverseengineering.stackexchange.com/questions/30532/reverse-engineering-the-s-note-spd-file-format",
  "content": "Samsung phones have an application called 'S Note' that let you use the stylus/keyboard to take notes in a free-form format, similar to Microsoft OneNote. These notes are stored in files ending in .spd.\n\nSee here for more information: https://fileinfo.com/extension/spd\n\nAs the link above mentions, the SPD file is itself a zip file containing other files. I unzipped one of my .spd files and saw the following:\n\n```\n│   17_thumbnail_simplenote_06.png\n│   51703992-741e-11e3-b172-0790741041a6.page\n│   5bac0f76-741e-11e3-8113-a785f13b0c03.page\n│   end_tag.bin\n│   note.note\n│   pageIdInfo.dat\n└─── media\nimage0.png\nmediaInfo.dat  \n   \n\n```\nThe .page file is vaguely explained here: https://fileinfo.com/extension/page (See File Type 2), but it doesn't contain any additional information about how to extract data from it.\n\nQ1: Does anyone know if the S-Note format is documented or described anywhere in further detail than what is linked above?\n\nQ2: Does anyone know if work has been done on reverse-engineering the S-Note format, specifically to support conversion to PDF? (The Samsung Note app itself includes the ability to export notes as PDF, but for those without access to the application it's useless.)\n\nI can provide several SPD files for use, if anyone is actively working on a reverse-engineering effort.\n\n",
  "votes": "3",
  "answers": 0,
  "views": "259",
  "tags": [
    "file-format"
  ],
  "user": "Raleigh L.",
  "time": "Jun 20, 2022 at 17:34",
  "comments": [
    {
      "user": "Robert",
      "text": "I don't think that the file format is documented officially by Samsung. You can try to reverse the viewer app e.g. apkmirror.com/apk/samsung-electronics-co-ltd/s-note-viewer/… But it makes heavy use of native .so libraries.",
      "time": null
    }
  ],
  "answers_data": []
}