{
  "title": "[Ghidra]How to set global variable type?",
  "link": "https://reverseengineering.stackexchange.com/questions/30567/ghidrahow-to-set-global-variable-type",
  "content": "I have created a script in Java and I have a structure type as a string name which I want to set at given global variable which I have the Address of.\n\nHowever I can't seem to find a way to do this - like I can get the symbol or something but this doesn't allow me to change the type.\n\nAny ideas?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "2k",
  "tags": [
    "ghidra",
    "java"
  ],
  "user": "rec",
  "time": "Jul 26, 2022 at 23:39",
  "comments": [
    {
      "user": "dingo_kinznerhook",
      "text": "This seems like a better fit for Stack Overflow because it doesn't contain any reverse engineering elements.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@dingo_kinznerhook: as the OP pointed out here this is indeed RE-related, given the Ghidra complex. Java alone would be for StackOverflow, of course, but in the context of Ghidra and asking about how to interface with that to accomplish something is clearly a fit.",
      "time": null
    },
    {
      "user": "user42008",
      "text": "well you can open .data section where u will find all initialized data",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "First get the DataType that you want, for example struct foo:\n\nDataType dt = getDataTypes(\"foo\")[0];\n\nOr if it's just a pointer you'll have to get the pointer of that type.\n\nYou said you already have the address, you'll need to make sure it's an Address if not already:\n\nAddress addr = toAddr(0x12345678);\n\nThen create the data:\n\nData data = createData(addr, dt);\n\nIt may already have something there if that fails, you can clear out that memory (there is another API for this if you need more control, this is the simple case):\n\nclearListing(addr, addr.add(dt.getLength() - 1);\n\n",
      "votes": "6",
      "user": "mumbel",
      "time": "Jul 2, 2022 at 21:32",
      "is_accepted": true,
      "comments": []
    }
  ]
}