{
  "title": "Radare2 - Saving information/metadata from a debugging session",
  "link": "https://reverseengineering.stackexchange.com/questions/30562/radare2-saving-information-metadata-from-a-debugging-session",
  "content": "I'd like to know how I can save/restore comments or possibly other metadata during a debugging session.\n\nI know how to save this data when running radare without the -d flag but I often need to debug the binary and would like a way to save at least the comments I made during this.\n\nI know about the Ps Po commands but this is what radare2 tells me\n\n```\n[0x7ff33eba18a0]> Ps xxx\nradare2 does not support projects on debugged bins.\nCannot save project.\n\n```\nI am using version:\n\n```\n> r2 -v\nradare2 5.6.8 0 @ linux-x86-64 git.\ncommit: 5.6.8 build: 2022-06-22__12:33:33\n\n```\nAny help or other way of achieving this is also welcome.\n\n",
  "votes": "3",
  "answers": 1,
  "views": "339",
  "tags": [
    "debugging",
    "radare2"
  ],
  "user": "Gordon Zar",
  "time": "Jun 27, 2022 at 12:28",
  "comments": [],
  "answers_data": [
    {
      "content": "Projects has been disabled in debugger mode because not all metadata is rebased when aslr is involved which may result on confusing analysis/comments information. If you disable aslr, or your target is always loading in the same place you can do a couple of things:\n\nor just save the comments into a file:\n\nyou can reload the script with the . comments.r2 or starting the session with r2 -i comments.r2 ... to get the comment lines loaded into the session.\n\nSame goes for all the analysis information. if you append * to any command you get the output in r2 commands script.\n\n",
      "votes": "2",
      "user": "pancake",
      "time": "Jul 1, 2022 at 13:06",
      "is_accepted": true,
      "comments": [
        {
          "user": "Gordon Zar",
          "text": "Can aslr be disabled on a per-binary basis? I think gdb can do it but i am not sure.",
          "time": null
        }
      ]
    }
  ]
}