{
  "title": "Help starting with UEFI/SMM exploits",
  "link": "https://reverseengineering.stackexchange.com/questions/30609/help-starting-with-uefi-smm-exploits",
  "content": "I have a 845 g7 with a bios 1.06, which has a load of CVEs which allow SMM and DXE exploits:\n\nhttps://support.hp.com/ca-en/drivers/selfservice/hp-elitebook-845-g7-notebook-pc/37506818 (under the UEFI bios versions > 1.06).\n\nHowever, I have no real idea how to exploit these. I'm a programmer (C++), however mostly just corporate applications and data management. It would be great if someone could forward me to how to initiate SWSMI for example and how to actually push arbitrary code execution in the SMM, etc.\n\nI think I understand on a very high level what needs to be done:\n\nI think I'd have to start with a kernel level driver which writes to an io port to initiate an SMI, particularly SWSMI (0xb2) to initiate SMM? Which would also read from \"shell code\" which is written to registers that are inside the SWRAM.\n\nHowever, I'm trying to figure out even where to start. At the moment I'm looking into writing to ioports as a starter, which need to be kernel level drivers, such as here for example: https://github.com/tandasat/SmmExploit.\n\nThere is the BRLY stuff which shows something that could be useful to someone who could understand it:\n\nhttps://www.binarly.io/advisories/BRLY-2021-003/index.html\n\nIdeas on some fun stuff like changing the motherboard serial number, etc.? The exploits give all the way down to -2 ring access.\n\nThanks\n\n",
  "votes": "1",
  "answers": 1,
  "views": "128",
  "tags": [
    "disassembly",
    "memory",
    "buffer-overflow",
    "uefi"
  ],
  "user": "s33ds",
  "time": "Jul 9, 2022 at 7:16",
  "comments": [],
  "answers_data": [
    {
      "content": "OST has a couple of courses that should give you all the background information you need:\n\nhttps://opensecuritytraining.info/IntroBIOS.html\n\nNow that Xeno has relaunched OST as OST2 there is also this one, but I'm not sure how much overlap/rebranding is in it:\n\nhttps://p.ost2.fyi/courses/course-v1:OpenSecurityTraining2+Arch4001_x86-64_RVF+2021_v1/about\n\nN.B. I haven't taken either of these courses myself, but I've been through several others on OST and they were excellent, these are on my todo list\n\n",
      "votes": "1",
      "user": "Mega Tonnage",
      "time": "Jul 11, 2022 at 0:04",
      "is_accepted": true,
      "comments": [
        {
          "user": "s33ds",
          "text": "Amazing thank you so much! I can't upvote you as I don't have enough reputation. But it's truly appreciated.",
          "time": null
        }
      ]
    }
  ]
}