{
  "title": "What is j__ftol2_sse_excpt in IDA?",
  "link": "https://reverseengineering.stackexchange.com/questions/30608/what-is-j-ftol2-sse-excpt-in-ida",
  "content": "I was inspecting the c-pseudocode for a PE executable in IDA.\n\nI found some function called j__ftol2_sse_excpt()\n\n\n\nWhen I open that function I see that the function is calling another function named _ftol2_sse_excpt.\n\n\n\nWhen I open that function, I saw this(I can't understand it)\n\n\n\nDissassembly around function calls:\n\n\n\n\n\n\n\n\n\n\n\n",
  "votes": "1",
  "answers": 1,
  "views": "236",
  "tags": [
    "ida",
    "disassembly",
    "assembly"
  ],
  "user": "Galaxy226",
  "time": "Jul 9, 2022 at 5:09",
  "comments": [
    {
      "user": "raspiduino",
      "text": "From what I found on the Internet, for example this, this and this, it seems that _ftol2_sse_excpt is a standard function from msvcrt and is used to round a number from float to int.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "j_ prefix is used by IDA for functions which do not do anything besides jumping to another function, likely the real implementation. So the real function you need is ftol2_sse_excpt.\n\nThis function doesn’t seem to be documented anywhere but the name is very close to ftol which is the standard CRT function for converting a float to a long int.\n\nAccording to this MASM forum post:\n\nThe _excpt suffix probably means it can raise an exception (e.g. if called with a NaN value).\n\nBecause the function is internal, the function prototype is not known and the decompiler did not detect the arguments, probably because they’re passed in FPU registers and not on stack. If the function is really equivalent to ftol, you can try renaming it to that and the decompiler should recognize it. Alternatively, you can try specifying a manual function prototype using __usercall calling convention.\n\n",
      "votes": "4",
      "user": "Igor Skochinsky",
      "time": "Jul 9, 2022 at 12:00",
      "is_accepted": false,
      "comments": [
        {
          "user": "Viktor",
          "text": "Like j_ prefix, are there some other types of prefixes or suffixes which are used by IDA under specific disassembly. Please, can you provide/list them? Thank you.",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "@Viktor that's a subject for a whole another question but here's some of  them: hex-rays.com/blog/igors-tip-of-the-week-34-dummy-names",
          "time": null
        }
      ]
    }
  ]
}