{
  "title": "How to reverse a game and inject a dll in client program?",
  "link": "https://reverseengineering.stackexchange.com/questions/30611/how-to-reverse-a-game-and-inject-a-dll-in-client-program",
  "content": "I am trying to make a bot for a game. But when I open the game in debugger like Ollydbg or in x64dbg the game simply closes and also it doesn't appears in the Attach to the process list in File menu of debugger.\n\nI have a source code for a client that if is not the same is almost the same. Can it help?\n\nAnd if you guys can tell me steps to create a dll to inject on the client it would be awesome.\n\nhttps://joguewydbr.com/WYDBR2022.msi - this is the application I want to reverse.\n\nNote: Link will start download immediately. If you don't want to download the file, Please do not click.\n\n",
  "votes": "4",
  "answers": 2,
  "views": "641",
  "tags": [
    "ollydbg",
    "c++",
    "x64dbg",
    "game-hacking",
    "injection"
  ],
  "user": "Lftbrito",
  "time": "Dec 15, 2022 at 8:38",
  "comments": [
    {
      "user": "Mast",
      "text": "Warning: link goes directly to the MSI itself so will start downloading when you click it.",
      "time": null
    },
    {
      "user": "Lftbrito",
      "text": "Ty, I edited the questio with the warning",
      "time": null
    },
    {
      "user": "raspiduino",
      "text": "Debug protection?",
      "time": null
    },
    {
      "user": "Lftbrito",
      "text": "For what I could get from the open soucer client is just a if the program is open or not it closes",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Dont know if this will help or not. I had a similar situation for an android game which killed it self the moment it detected debuggers. What I did was, catch syscall kill() and find the instruction which caused it and then changed the condition that caused the call to kill() function. You could do a similar approach but when doing that I used gdb.\n\n",
      "votes": "1",
      "user": "Silent",
      "time": "Jul 10, 2022 at 13:13",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "o_O where my sources, dude?\n\ntry to use ScyllaHide. How to hide Remote Windows Debugger in IDA Pro?\n\nhttps://www.unknowncheats.me/forum/grand-theft-auto-v/209725-easiest-inject-dll-files.html\n\nhttps://www.unknowncheats.me/forum/c-and-c-/345937-injection-executable-code.html\n\nhttps://www.unknowncheats.me/forum/team-fortress-2-a/74219-noob-question-inject-code.html\n\n",
      "votes": "1",
      "user": "0xC0000022L",
      "time": "May 1, 2023 at 20:15",
      "is_accepted": false,
      "comments": []
    }
  ]
}