{
  "title": "Intercept android app DNS lookup with Frida",
  "link": "https://reverseengineering.stackexchange.com/questions/30679/intercept-android-app-dns-lookup-with-frida",
  "content": "I have been attempting to intercept when an app performs a DNS lookup using Frida. I assumed that ultimately a DNS lookup will end up in a libc call to gethostbyname or  getaddrinfo but this does not seem to be the case. For example this Frida trace command does not hit either function\n\n```\nfrida-trace -U -i \"gethostbyname\" -i \"getaddrinfo\" \"com.android.my_app\"\n\n```\nAccording the answer to this question, the netd daemon might be responsible for DNS resolution on android\n\nHowever hooking this daemon doesn't result in any hits either:\n\n```\nfrida-trace -U -i \"gethostbyname\" -i \"getaddrinfo\" \"netd\"\n\n```\nI am new to Frida so I am not sure if I am missing something here. I would appreciate some insight into how I can hook the DNS lookup call\n\n",
  "votes": "3",
  "answers": 0,
  "views": "651",
  "tags": [
    "android",
    "frida"
  ],
  "user": "SivaDotRender",
  "time": "Jul 21, 2022 at 14:50",
  "comments": [
    {
      "user": "SivaDotRender",
      "text": "The functions are being hooked properly as far as I can tell and handlers are being created. I will explore a few other options and try to update this question",
      "time": null
    },
    {
      "user": "Robert",
      "text": "Is the app base on standard DEX code (e.g. compiled from Java or Kotlin) or does it use a different framework like Xamarin, ReactNative, Dart? Some of those language may implement DNS resolving on their own so that it works on all platforms. I do remember that Firefox for Android e.g. does implement DNS resolving on it's own.",
      "time": null
    },
    {
      "user": "SivaDotRender",
      "text": "@Robert this is just a standard Kotlin app. I believe I found the function performing the lookup. Its android_getaddrinfofornet which is present in the libc that my Android app is using",
      "time": null
    }
  ],
  "answers_data": []
}