{
  "title": "Reverse engineering XKCD 1190",
  "link": "https://reverseengineering.stackexchange.com/questions/306/reverse-engineering-xkcd-1190",
  "content": "The latest (as of now) comic is titled \"Time\". It's a standard-looking comic though without much action, but the picture's alt title says \"Wait for it.\". I waited but nothing happened (tried in Opera and IE9) so I took a look at the page source.\n\nNext to the picture's <img> tag there was a <script> which included the following URL:\n\nhttp://imgs.xkcd.com/static/time07.min.js\n\nI tried to make sense of it, but I can't figure it out. Can someone explain how it works and what was supposed to happen?\n\n",
  "votes": "8",
  "answers": 1,
  "views": "1k",
  "tags": [
    "javascript",
    "websites"
  ],
  "user": "Igor Skochinsky",
  "time": "Mar 27, 2013 at 9:46",
  "comments": [
    {
      "user": "Gilles 'SO- stop being evil'",
      "text": "explainxkcd can and did (at least partially)",
      "time": null
    },
    {
      "user": "Igor Skochinsky",
      "text": "@Gilles: interesting! However, there doesn't seem to be much explanation on what exactly the script does, but more of \"here's the URLs it fetches\". I hope someone can post an overview of the script's main parts and how they interact. I, for one, am lost in all the callbacks and closures.",
      "time": null
    },
    {
      "user": "d1str0",
      "text": "Perhaps it is a social experiment and is counting how long a person will wait for the image to change?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Somebody at XKCD fora pasted a link to this gist which contains a deobfuscated and annotated source along with some explanations: \n\nAs far as I can tell, it has no magic in it and serves just as a simple way for the server to let the client know when there is a new image. \n\n",
      "votes": "9",
      "user": "0xea",
      "time": "Mar 27, 2013 at 21:50",
      "is_accepted": true,
      "comments": []
    }
  ]
}