{
  "title": "What is the most effective tool to analyze apk file",
  "link": "https://reverseengineering.stackexchange.com/questions/30710/what-is-the-most-effective-tool-to-analyze-apk-file",
  "content": "I have experience with android reverse engineering through modification of smali codes after de-assembling. I did modify some apps already for educational purposes.\nHowever, I am facing an issue for signle apk app that has so many files and obfuscations. I can deal with obfuscations but I want to analyze the code flow, for example I want to see what methods and return values are triggered after pressing a button. Android studio has smali add-ons but stopped working and cannot get even the specified return values at given debugging point.\nI read about Frida, IDA pro and ghidra. I want to start one of them at least so I can do the most difficult tasks. I will dedicate my time to master it but I want a hint from experts in this regard. Could you please suggest a direction for me.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "1k",
  "tags": [
    "ida",
    "ghidra",
    "frida"
  ],
  "user": "Riva11",
  "time": "Jul 30, 2022 at 0:03",
  "comments": [
    {
      "user": "Robert",
      "text": "An experienced developer may use any of the mentioned tools. Questions that require an opinion-based answer (respectively personal preference) are considered off-topic as this site focuses on answers that are based on facts not opinions. My personal opinion is that Frida is good for starting as it is not too complex as long as You are an experienced Android and JavaScript developer.",
      "time": null
    },
    {
      "user": "Riva11",
      "text": "Great, thanks Robert",
      "time": null
    },
    {
      "user": "Willem Hengeveld",
      "text": "I usually use github.com/skylot/jadx,  it decompiles classes*.dex to java, and also converts the .xml files to readable format.  For the .so library files you would need a tool like IDAPro, or ghidra.",
      "time": null
    },
    {
      "user": "Riva11",
      "text": "Thank you Willem, I have jadx and use it sometimes to trace. I learnt many think in ghidra in the past days.",
      "time": null
    }
  ],
  "answers_data": []
}