{
  "title": "Changing Offset Value with frida",
  "link": "https://reverseengineering.stackexchange.com/questions/30861/changing-offset-value-with-frida",
  "content": "So I found this offset in ghidra, and I want to change that offsets value in Frida\n\nwith this picture I have deduced that the offset is 0x6ae210\n\nWhat I want to do with this is change game.brawlstarsgame.com to something else\n\nIm using Frida on iOS in \"code_signing\": \"required\" mode which means that it will run on non jailbreak (the only drawback is that I cannot use Interceptor)\n\nI've tried using this code, but it failed:\n\n```\nvar base = Module.findBaseAddress(\"Brawl Stars\");\nvar connector = base.add(0x6ae210).writeUtf8String(\"my_ip\");\n\n```\nthis has however failed\n\nI have also tried just changing the value in a hex editor, but the ipa does not install: Sideloadly gives me an error and Altstore refuses to install it\n\nSideloadly error: ERROR: Guru Meditation e78e76@447:14dd8f ('expected 55, found 54', SwitchError('no default case defined'))\n\nis there some way to replace the value of game.brawlstarsgame.com without using interceptor, or could someone explain the process of changing strings in a macho binary with hex patching?\n\n",
  "votes": "3",
  "answers": 0,
  "views": "418",
  "tags": [
    "patch-reversing",
    "frida",
    "mach-o"
  ],
  "user": "Rebel Gaming",
  "time": "Sep 7, 2022 at 19:24",
  "comments": [
    {
      "user": "Robert",
      "text": "As far as I know method interception is possible on a non-jailbroken device. I did this by injecting Frida gadget and resigning the app some time ago. What iOS version is installed on the phone? Besides that I would first try to read the calculated address and check if you really find the expected host name before overwriting it.",
      "time": null
    },
    {
      "user": "Rebel Gaming",
      "text": "I am 100% sure I have found the correct host name",
      "time": null
    },
    {
      "user": "Robert",
      "text": "If IPA installing fails why don't you just install it using ideviceinstaller from libimobiledevice tools? As the installation already fails you should elaborate in detail what modifications you do to the IPA.",
      "time": null
    },
    {
      "user": "Rebel Gaming",
      "text": "I modified one string: game.brawlstarsgame.com to my ipv4",
      "time": null
    },
    {
      "user": "Jon",
      "text": "One problem may be that your IP address will be a different length to the hostname your trying to replace.  Have you tried changing it to something of the same length just to confirm that is not the issue? Also what errors did you get when it failed with frida?",
      "time": null
    }
  ],
  "answers_data": []
}