{
  "title": "How to force IDA to show size of pointer dereference?",
  "link": "https://reverseengineering.stackexchange.com/questions/31078/how-to-force-ida-to-show-size-of-pointer-dereference",
  "content": "IDA's default x86 assembly syntax is not very clear about pointer dereferences. One of these is dereferencing the memory operand, and one is simply moving the address to the register:\n\n```\nmov     ecx, offset dword_130B78\nmov     eax, off_130AF8\n\n```\nYou can improve this slightly by selecting Borland TASM in Ideal Mode in Options > General > Analysis > Target Assembler:\n\n```\nmov     eax, [off_130AF8]\n\n```\nBut what I would like is to make it even less ambiguous by always displaying the size qualifier with ptr:\n\n```\nmov     eax, dword ptr [off_130AF8]\n\n```\nIs there a way to force IDA to do this? It does it in some cases but not others, and I'd like it to always do it.\n\n",
  "votes": "4",
  "answers": 1,
  "views": "287",
  "tags": [
    "ida",
    "x86"
  ],
  "user": "thejoelpatrol",
  "time": "Nov 4, 2022 at 1:47",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "I'm confused. I never \"missed\" that at all. Could you elaborate why you need it?! As a reverse engineer you really have to filter through a lot of information and adding this would distract from the important stuff, because the information is right there anyway. You can tell from the target operand what the size of the source must be, so there's no need for dword ptr. Things are different with something like movzx   eax, word ptr [eax+esi*2] where the source gets zero-expanded into the target. And then it's not evident whether it's a single or two byte source ...",
      "time": null
    },
    {
      "user": "thejoelpatrol",
      "text": "It’s not actually the size of the register that I care about. What I want is to make it clearer that the pointer is being dereferenced, which as you can see from the first two instruction example can be unclear in IDA’s syntax. It’s really only a problem with x86 (as opposed to RISC machines) because mov can move between both registers and memory.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "But that's what the square brackets are for. They tell you something gets dereferenced. If they aren't there, nothing gets dereferenced. And conversely if you imagine dword_130B78 as a C/C++ variable, you can think of offset dword_130B78 as &dword_130B78 ... on the other hand mov eax, [off_130AF8] could be thought of as eax = *off_130AF8 (where off_130AF8 is clearly a 32-bit pointer). I have the issue the other way around, since I rarely read RISC assembly. But once you become accustomed to it, it's no issue.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "If you really need this and are a paying customer, make a feature request or ask the Hex-Rays support if they already have this sort of feature and where it is hidden. There is also a forum for paying customers. I have not much hope it's already there, since even scouring ida.cfg and idagui.cfg nothing seemed to match your requirement, but who knows? ;)",
      "time": null
    },
    {
      "user": "thejoelpatrol",
      "text": "As I said from the start, the brackets in the alternate syntax help. It’s at least usable that way. What’s frustrating is that sometimes IDA thinks it should display the size qualifier with some instructions but not others, so it’s just fairly inconsistent. So yes, maybe I will make a feature request.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "IDA typically displays that size qualifier (byte, word, dword, qword) when the target of the reference is a different size than the operand. This pretty much happens when the size of data referenced by the operand is wrong, but can also happen since multiple instruction may access the memory address differently.\n\nSo, (technically) you can force IDA to display the size for each instruction operand by undefining all the data referenced by that operand that you're looking at. This literally undoes all the work that you and IDA did...but hey, why not?\n\nI wrote some IDAPython to do this pretty quickly for the current function. Hopefully you find it effective.\n\n```\nfor ea in idautils.FuncItems(ADDRESS):\n    for xr in idautils.XrefsFrom(ea):\n        if not xr.iscode:\n            idaapi.del_items(xr.to)\n        continue\n    continue\n\n```\nOr better yet, if you want to \"fix\" your entire database:\n\n```\nfor sidx in range(idaapi.get_segm_qty()):\n    s = idaapi.getnseg(sidx)\n    for ea in idautils.Heads(s.start_ea, s.end_ea):\n        if idaapi.get_flags(s.start_ea) & idaapi.MS_CLS == idaapi.FF_DATA:\n            idaapi.del_items(ea)\n        continue\n    continue\n\n```\n",
      "votes": "3",
      "user": "Ali Rizvi-Santiago",
      "time": "Feb 9, 2023 at 18:01",
      "is_accepted": false,
      "comments": []
    }
  ]
}