{
  "title": "Reversing Novation's Circuit Tracks firmware",
  "link": "https://reverseengineering.stackexchange.com/questions/31095/reversing-novations-circuit-tracks-firmware",
  "content": "Motivation:\n\nThe Circuit Tracks is a great little groovebox made by Novation, but it feels like they intentionally limited it's capabilities. They also sell the Circuit Rhythm, which has some of the features the Tracks is missing but lacks others. It has several MIDI outputs and would make a fantastic MIDI controller, but it's firmware only allows the intended use (many users feel this way).\n\nFirst steps:\n\nThe Circuit Track's firmware can be updated using the Components website (and a standalone version) via MIDI Sysex messages. This led me to discover a bunch of their firmwares, all directly accessible with incrementing indices :)\n\nNOTE: This link won't work without the authetication from Components:\nhttps://circuit-librarian.s3.eu-west-1.amazonaws.com/uploads/firmware/file/89/circuittracks-firmware-3891.syx\n\nI was able to download the firmware as a .syx file (416 KB) and first tried running binwalk. No results. As I'm pretty new to this kind of reverse engineering I'm not quite sure how to continue.\nAs I understand it, the file probably is compressed and/or encrypted. Looking at it with binvis.io yields an interesting pattern, though I have no idea what to make of it or whether it holds any relevance:\n\n\nSo my question is: How/where should I continue? I'm thankful for any kind of pointer, even if it's related literature/resources so I'll have some clue :)\n\n",
  "votes": "3",
  "answers": 1,
  "views": "792",
  "tags": [
    "firmware"
  ],
  "user": "Kosro",
  "time": "Nov 6, 2022 at 20:17",
  "comments": [
    {
      "user": "Kosro",
      "text": "Thanks for the replies :) It just so happens that someone else uploaded the file here: fromsmash.com/circuittracks-fw-3891 Convenient!  I haven't opened my unit and there seems to be no teardown information on the web.. guess I'll have to be the first. In case I do manage to open it non-destructively, I'll document the whole thing.",
      "time": null
    },
    {
      "user": "fourthtuna",
      "text": "I registered to comment this. I just want you to know that there are lots of people who use CT and agree that its deliberately limited, and would be grateful if someone did some work on it, if it's reasonable. Thanks for trying and good luck!",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The criss cross pattern is propably coming from some framing, maybe related to the midi sysex file.\nIt appears Novation has made a version of their firmware for the Launchpad-pro open source in 2015. There are github projects e.g. https://github.com/dvhdr/launchpad-pro\n\n",
      "votes": "1",
      "user": "digitalShaman",
      "time": "Sep 10, 2023 at 7:07",
      "is_accepted": false,
      "comments": [
        {
          "user": "Kosro",
          "text": "Thanks a lot for the insight and link! It's been a while and I've been busy, but I still haven't given up on this idea ;)",
          "time": null
        }
      ]
    }
  ]
}