{
  "title": "Instead of doing a (long) analysis of an .exe, can i run that .exe, attach Ida Pro's debugger to it, and get the pseudo code of functions i want?",
  "link": "https://reverseengineering.stackexchange.com/questions/31181/instead-of-doing-a-long-analysis-of-an-exe-can-i-run-that-exe-attach-ida-p",
  "content": "Basically, I have this 64 bits game.exe file which is about 400mb. It takes about 24 hours to do the analysis of the file in Ida pro 64 bits free version.\nProblem is i have to do it again cause there were some errors apparently.\nSo my question is this, when i run that game.exe and i attach xdbg64 to it, it shows me the assembly code of the whole process, but when i instead run that game and try to attach Ida Pro's debugger to it i don't get the same kind of information, so is there a way to display the whole program's assembly in Ida pro and also use the decompiler on some of the function while the game.exe is running?\nMy goal is to make a single player mod for this game by hooking a specific funtion.\nI attached two screenshots that show the same address for both programs:\n\nxdbg64:\n\n\n\nidaProFree:\n\n\n\n",
  "votes": "2",
  "answers": 1,
  "views": "595",
  "tags": [
    "ida",
    "x64dbg"
  ],
  "user": "EncoderX",
  "time": "Nov 26, 2022 at 19:45",
  "comments": [],
  "answers_data": [
    {
      "content": "As far as I can see, you are using the STEAM-version of the game. And also the fact that the publisher of the game: Bethesda, which reliably protects its investments and likes to sue others.\n\nThat was the preface, and now, about the case:\n\nSTEAM games are very often packaged. Therefore, it is not always possible to work with them in IDA Pro directly without unpacking.\n\nFrom here your first question should be: is the game packaged?\nyes - find unpacker or download drm-free image from gog.com\n\nin addition, the game may have anti-debugging tricks and IDA Pro has a tool to bypass them:\n\nHow to hide Remote Windows Debugger in IDA Pro?\n\nHow to determine if an executable is packaged?\n\nIf you can open this file in IDA Pro without problems and see a bunch of functions, then most likely this file is not packaged.\n\nIf the file is packed and there is a call to STEAM-api functions\nthen, there is a solution for a long time:\n\nSteamless, active fork\n\nIf your goal is to write a cheat - try using the Cheat Engine, as well as the specialized forums:\nhttps://unknowncheats.me\n\n",
      "votes": "1",
      "user": null,
      "time": "Nov 26, 2022 at 20:23",
      "is_accepted": true,
      "comments": [
        {
          "user": "EncoderX",
          "text": "Thank you, is there a way to determine if/when a game is packaged or should i just assume they are on Steam ? However, the general method of using the debugger of ida to analyse/decompile certain specific functions of the running .exe makes sense compared to analyse the whole .exe file when it's not running?",
          "time": null
        }
      ]
    }
  ]
}