{
  "title": "How to debug windows EFI modules during boot using IDA Pro's windbg?",
  "link": "https://reverseengineering.stackexchange.com/questions/31232/how-to-debug-windows-efi-modules-during-boot-using-ida-pros-windbg",
  "content": "I wanted to debug winload.efi using IDA Pro 7.7, but for some weird reason there is no windbg in the list of debuggers in case of EFI files, even tho I can easily debug the kernel using IDA Pro's windbg.\n\nI can already debug winload.efi using windbg and there is no problem with that, so how can I force IDA pro to list windbg in the list of debuggers in case of EFI files?\n\nI can run IDA pro and attach during boot, thus technically debug the winload.efi, but when I open the IDB file of the winload.efi, there is no windbg option in the debuggers.\n\nNote that I have used bcdedit /bootdebug {current}, therefore debugger will break In winload.efi during boot.\n\n",
  "votes": "4",
  "answers": 0,
  "views": "374",
  "tags": [
    "ida",
    "kernel-mode",
    "uefi"
  ],
  "user": "OneAndOnly",
  "time": "Jun 23, 2023 at 6:54",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "This sort of questions is probably best asked by sending an email to the Hex-Rays support. Within your software maintenance period you can usually expect rather swift responses. With some luck Igor will pop by and see and answer it here, though.",
      "time": null
    },
    {
      "user": "OneAndOnly",
      "text": "@0xC0000022L Correct, but using stackexchange is better because the answer would help other people who would face the  same problem in the future.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "Uhm, actually taking the direct route doesn't preclude answering your own Q&A, once you learned something new from contacting their support, does it?",
      "time": null
    },
    {
      "user": "raspiduino",
      "text": "If you are allowed to run this efi in an emulator like QEMU, do gdb debug instead. I tried it and it works well. Just remember to rebase the program.",
      "time": null
    }
  ],
  "answers_data": []
}