{
  "title": "Solved: Unable to hook Apple binary on iOS 14.x with Frida",
  "link": "https://reverseengineering.stackexchange.com/questions/31256/solved-unable-to-hook-apple-binary-on-ios-14-x-with-frida",
  "content": "I'm attempting to analyze a binary from iOS 14.8 (searchpartyd). I'm using Frida to try to hook it like I normally would with other binaries. However, I'm getting an error message that I'm unable to attach to it. Frida is running as root. I've attempted to hook some other binaries from the device and it seems like native Apple ones give me the same error message, whereas ones I've installed myself like Bash are able to be hooked. I get the impression that there is some kind of security mechanism preventing the hook from taking, but I'm not sure exactly what. I've tried playing with entitlements of the Frida server to see if that would help but I haven't had any luck with that either.\n\nDoes anyone have any suggestions as to how to successfully analyze this binary dynamically? Is there indeed a security control in-place preventing this that I'm unfamiliar with? I can't seem to find anything online describing my exact issue, so I'm not sure if there is a control and if so what it is.\n\nEDIT: For whatever reason it seems that hooking some binaries via the USB option for Frida wasn't working, however using the network host option (-H) and listening with the server on 0.0.0.0 allowed me to connect and properly hook the binary in question.\n\n",
  "votes": "3",
  "answers": 0,
  "views": "205",
  "tags": [
    "dynamic-analysis",
    "ios",
    "frida",
    "hooking"
  ],
  "user": "AGreen BHM",
  "time": "Dec 11, 2022 at 20:03",
  "comments": [
    {
      "user": "Robert",
      "text": "Which version of Frida do you use (server and client on PC side)? I do remember some iOS 14 problems mentioned in one of the last minor Frida version changelog.",
      "time": null
    },
    {
      "user": "AGreen BHM",
      "text": "Thanks for the reply.  I was using the most recent version for both (16.0.7).  I've managed to resolve my issue (update in OP).",
      "time": null
    },
    {
      "user": "Robert",
      "text": "As this is a Q&A platform you should better write a separate answer instead of including the answer into the question.",
      "time": null
    }
  ],
  "answers_data": []
}