{
  "title": "Does IDA Freeware 8.x support plugins?",
  "link": "https://reverseengineering.stackexchange.com/questions/31351/does-ida-freeware-8-x-support-plugins",
  "content": "According to the information I searched, it is not supported in IDA 7.x and before.\n\nHas this changed in 8.x? Because now the 8.x decompiler cloud version is free, which is different from before.\n\nrefer: Do IDA Python plugins work with IDA free or only IDA pro?\n\n",
  "votes": "4",
  "answers": 0,
  "views": "640",
  "tags": [
    "ida",
    "idapython",
    "ida-plugin"
  ],
  "user": "huang",
  "time": "Jan 4, 2023 at 17:16",
  "comments": [
    {
      "user": "sudhackar",
      "text": "I mean just refer to the documentation. NO",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@sudhackar That's quite rude as a comment. While I agree that own research should have been done up front, I don't think this was a very welcoming tone. For example the comparison table here makes no mention of plugins and it's also not listed as a limitation.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "Hi and welcome to RE.SE. Doesn't this Q&A have the answer you are looking for? Although admittedly it probably isn't the answer you want. This ticket may be equally interesting.",
      "time": null
    },
    {
      "user": "huang",
      "text": "@0xC0000022L Thanks your reply. I've read all the easy-to-search answers or manuals, either from a few years ago, or not clearly stated. Since the 8.x decompiler is free, I came here to ask a seemingly stupid question with full of hope.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@JoeHuang just one thought. I know that they don't officially provide support for the freeware version, but I suppose if you ask them nicely you could find out by sending an email to support@ Hex-Rays ... and once you have the authoritative answer, you could answer your own question here for the benefit of others?!",
      "time": null
    }
  ],
  "answers_data": []
}