{
  "title": "Is \"PE_LOAD_ALL_SECTIONS = YES\" synonymous with \"Load resources\" from the \"Load a new file\" dialog?",
  "link": "https://reverseengineering.stackexchange.com/questions/31393/is-pe-load-all-sections-yes-synonymous-with-load-resources-from-the-load",
  "content": "As per this recent blog article one can set the PE loader to default to loading all sections. I even knew that. So setting the following setting in cfg\\pe.cfg does the trick:\n\n```\nPE_LOAD_ALL_SECTIONS = YES\n\n```\nI often find myself needing to load at least the file header (sometimes in hindsight) but there is no explicit option for the file header on the load dialog:\n\n\n\nInstead we have the \"Load resources\" checkbox, which -- if checked -- avoids having to do a full manual load, but seems to load both the resources (.rsrc \"segment\") and the file header (HEADER \"segment\").\n\n\n\nThat also seems to be the effect of configuring PE_LOAD_ALL_SECTIONS = YES. Alas, if you set the configuration inside the cfg\\pe.cfg, the \"Load resources\" checkbox doesn't get default-checked or so.\n\nSo my question is: are these two methods to load the file header and resources synonymous? If not, are they overlapping? What are the differences?\n\nHere's the outcome of the various settings on a PE file with IDA Pro 8.2.221215:\n\nThe odd outcome is 3., because it loads the .rsrc section although it hadn't been asked for it. That's also the reason why I asked this question in the first place.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "107",
  "tags": [
    "ida"
  ],
  "user": "0xC0000022L",
  "time": "Jan 13, 2023 at 13:28",
  "comments": [
    {
      "user": "Mega Tonnage",
      "text": "I don't see 3 as an odd case. What you have is 2 different methods to change the behavior of IDA. Setting PE_LOAD_ALL_SECTIONS = YES in the config file does what it says, loads all sections (including .rsrc). Checking Load resources in the GUI also does what it says, ensures that .rsrc is loaded. These 2 configuration methods are independent of each other.",
      "time": null
    },
    {
      "user": "Mega Tonnage",
      "text": "Just to clarify, these 2 methods only make changes when they are set to YES or checked. When they're set to NO or unchecked, they do nothing.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "I guess they are indeed independent of each other. Thanks.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I only get the HEADER segment when PE_LOAD_ALL_SECTIONS is set to YES in cfg\\pe.cfg.\n\nChecking Load Resources with PE_LOAD_ALL_SECTIONS = NO only adds the .rsrc segment for me (7.6 SP1).\n\n",
      "votes": "2",
      "user": "Mega Tonnage",
      "time": "Jan 12, 2023 at 23:35",
      "is_accepted": true,
      "comments": []
    }
  ]
}