{
  "title": "What is your vulnerability discovery process? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/313/what-is-your-vulnerability-discovery-process",
  "content": "I myself am a static analysis guy; I mostly gave up dynamic reverse engineering ten years ago.  So these days, my process is usually to locate where my input enters the module that I am interested in, and then perform heavy static analysis to determine how my input manipulates the state of the program.  I have found some neat bugs such as information disclosure this way; however, I am undoubtedly a lot slower than my counterparts who employ a lot of dynamic analysis and dynamic input generation (e.g., randomized fuzzing).  \n\nWhat steps do you usually take to discover vulnerabilities in closed-source programs?\n\n",
  "votes": "8",
  "answers": 1,
  "views": "811",
  "tags": [
    "vulnerability-analysis"
  ],
  "user": "Rolf Rolles",
  "time": "12 years ago",
  "comments": [
    {
      "user": "JMcAfreak",
      "text": "This sounds very much like a poll, which generally doesn't go over well on StackExchange sites.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "This is how I typically do it, although it largely depends on the target/project and it's only how I like to do it myself:\n\nPS: Reading documentation is also a good way to find some vulnerabilities, as well as reading change logs, diff patches, commit messages, etc... if you have access to source code (sometimes you can have partial access to the target's source code, even for closed source applications).\n\nJust my 2 cents.\n\n",
      "votes": "6",
      "user": "joxeankoret",
      "time": "Mar 27, 2013 at 18:18",
      "is_accepted": false,
      "comments": [
        {
          "user": "ixje",
          "text": "could you elaborate a bit more on \"write rules/scripts to find similar vulnerabilities\". Say you found a vulnerability through fuzzing what kind of rules are you going to write? Do you mean something like limiting the parameter input search space for your fuzzer or?",
          "time": null
        },
        {
          "user": "joxeankoret",
          "text": "I mean creating rules/scripts for finding similar patterns to the code where you found a vulnerability, in the binary code. It's very probably that there will be more vulns/bugs similar to the one you found. Although not a vulnerability, this can give an example.",
          "time": null
        }
      ]
    }
  ]
}