{
  "title": "The same notepad.exe runs in both WoW64 and x64 modes",
  "link": "https://reverseengineering.stackexchange.com/questions/31407/the-same-notepad-exe-runs-in-both-wow64-and-x64-modes",
  "content": "When I run notepad.exe with x64dbg it runs as WOW64 process. But when I run it with x32dbg it runs as x64 process with x64 instructions. I am running it from the same directory C:\\Windows\\System32  \notepad.exe, but in process explorer I see different executable location for WOW64 process -C:\\Windows\\SysWOW64  \notepad.exe\n\nHowever, when I open both executables in WOW64 and System32 directories in PE-Bear, both have the same OptionalHeader.Magic = NT32 and both have the same 32-bit instructions\n\n\nWhy is this happening and where can I find the x64 executable?\n\n",
  "votes": "3",
  "answers": 1,
  "views": "163",
  "tags": [
    "windows"
  ],
  "user": "SSSSSXXXXX",
  "time": "Jan 15, 2023 at 12:35",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "You could try specify the file as C:\\Windows\\Sysnative  \notepad.exe (can't be browsed, but should be possible to give as path) and should always get the same file. The rest is explained by WOW64 file system redirection as outlined in the answer and the comment on the answer.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "It looks like you are running on 64 bit windows.  For legacy compatibility, system32 contains 64-bit programs and wow64 contains 32-bit programs.  When something is requested by a 32-bit program from system32, it is redirected to syswow64.\n\nA full explanation is here Windows Club\n\nWOW stands for Windows on Windows and syswow64 is a compatibility layer for 32 bit programs running on 64-bit Windows.\n\nA fuller explanation is here Wikipedia\n\nMy guess is that file explorer (and/or PE bear) is getting redirected and you are actually looking at the same file.\n\nThey are two different files with different headers as seen in the image\n\n\n\n",
      "votes": "2",
      "user": "Rohit Gupta",
      "time": "Jan 15, 2023 at 12:56",
      "is_accepted": false,
      "comments": [
        {
          "user": "SSSSSXXXXX",
          "text": "Then how it's possible that I see different instructions for both processes (Image added to the question).",
          "time": null
        },
        {
          "user": "Rohit Gupta",
          "text": "x32dbg and x64dbg are seeing different exes as they are 32 and 64 bit applications.  I was suggesting that perhaps file explorer is seeing the same exe, because  File explorer itself is a program.",
          "time": null
        },
        {
          "user": "josh poley",
          "text": "@SSSSSXXXXX, see Wow64DisableWow64FsRedirection for additional context on the automatic file-system redirection.",
          "time": null
        }
      ]
    }
  ]
}