{
  "title": "How to select sequence bytes in IDA Pro Hex View?",
  "link": "https://reverseengineering.stackexchange.com/questions/31414/how-to-select-sequence-bytes-in-ida-pro-hex-view",
  "content": "As you see below gif, I can't select the sequence bytes what I want, the selections range is a rectagle, it's against humanity. How can I select sequence bytes?\n\n\n\nAnnotated variant of the above (obtained from IDA 8.2.221215):\n\n\n\n",
  "votes": "3",
  "answers": 1,
  "views": "510",
  "tags": [
    "ida"
  ],
  "user": "huang",
  "time": "Jan 16, 2023 at 9:28",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "I edited your question to add another GIF which makes the issue you seem to be referring to more obvious.",
      "time": null
    },
    {
      "user": "huang",
      "text": "@0xC0000022L It's unbelievable that a software with such poor basic functions can be sold so expensive.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "Hmm, IDA is not a good hex editor, agreed, but the result in a hex editor such a 010 Editor is also often suboptimal when the selected range doesn't end exactly at the same boundaries as the lines. So I'm not sure I totally agree with your assessment; even though I certainly would expect this to be fixed eventually. Have you contacted Hex-Rays?",
      "time": null
    },
    {
      "user": "huang",
      "text": "@0xC0000022L No, I use Freeware version, I don't think they'll pay me any attention.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "Actually I think they might, since it also affects paying customers. Eventually I or another paying customer will probably get in touch with them unless Igor raises this internally already.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Currently (as of 8.2), the selection in Hex View is fixed to rectangular shape (I think it was done to sidestep the issue of the text block to the side), so the answer to the question as asked is \"it's impossible\".\n\nFor extracting contiguous data it may be more convenient to use IDA View instead of the Hex View. You can use Export Data (Shift-E) to get the selection in different formats, including as a structure instance (if you have a struct defined):\n\nhttps://hex-rays.com/blog/igors-tip-of-the-week-39-export-data/\n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Jan 17, 2023 at 19:14",
      "is_accepted": false,
      "comments": [
        {
          "user": "huang",
          "text": "You're right. But this feature is hidden a bit deep. It should appear inside right click context menu when I selected data in IDA View. :)",
          "time": null
        },
        {
          "user": "huang",
          "text": "I don't know if I should accept this as an answer because while it addresses my needs, but it doesn't match the original question.",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "the context menu is already very crowded, adding all possible actions to it would not fit most monitors.",
          "time": null
        }
      ]
    }
  ]
}