{
  "title": "Frida hook X509Certificate",
  "link": "https://reverseengineering.stackexchange.com/questions/31470/frida-hook-x509certificate",
  "content": "I have an android application. It connects to a web socket server and uses the X509Certificate to verify the connection.\n\n```\n newBuilder.trustManagers(WebSocketClient.sTrustManagers);\n\n```\nBy using Frida I was able to get TrustManager[] trustManagerArr\n\n```\ntrustManagerArr: [\"<instance: javax.net.ssl.TrustManager, $className: im.sum.connections.Client$1>\"]\n\n```\nHow can I get certificate to use it for the purpose of establishing a connection from python?\n\nMy Frida script\n\n```\nW1ebSocketClient[\"setTrustManagers\"].implementation = function (trustManagerArr) {\n     console.log(' !setTrustManagers is called' + ', ' + 'trustManagerArr: ' + JSON.stringify(trustManagerArr));\n   \n          \n     let ret = this.setTrustManagers(trustManagerArr);\n      console.log(' !setTrustManagers ret value is ' + ret);\n      return ret;\n };\n\n```\n",
  "votes": "3",
  "answers": 1,
  "views": "343",
  "tags": [
    "android",
    "frida"
  ],
  "user": "user123",
  "time": "Feb 5, 2023 at 19:09",
  "comments": [],
  "answers_data": [
    {
      "content": "If you use an TLS interception proxy and have a rooted phone it may be easier to add the used root CA certificate as system certificate (like described in mitmproxy doc. Afterwards the certificate verification will work unless the app uses cert/key pinning.\n\nAlternatively you can use anti-SSL/TLS verification/pinning scripts included in Objection.\n\nIf you want to develop a script yourself it is easier to hook the javax.net.ssl.X509TrustManager method checkServerTrusted and replace it with an empty method.\n\n",
      "votes": "2",
      "user": "Robert",
      "time": "Jan 25, 2023 at 9:37",
      "is_accepted": true,
      "comments": [
        {
          "user": "user123",
          "text": "Thanks for the answer. I'm not trying to see the content of the requests, I want to establish a connection to the server. When I try to establish a connection with a python script, the server drops the connection. As I understand it, the problem is the lack of a certificate. I am trying to read the certificate that is in the trustManagerArr variable.",
          "time": null
        },
        {
          "user": "Robert",
          "text": "@user123 Then your question was already talking the wrong path. For selecting a client certificate (and key) an implementation of KeyManager respectively X509ExtendedKeyManager is responsible in plain Java/Android HTTPS connection. The TrustManager is only responsible for verifying the server certificate.",
          "time": null
        },
        {
          "user": "Robert",
          "text": "Another possibility is that the server preforms TLS fingerprinting and thus Python is recognized as \"not an Android device\" and thus the server drops the connection. Therefore it is crucial to identify when the connection is closed. If the handshake is successfully completed, a missing client certificate is very unlikely an issue.",
          "time": null
        },
        {
          "user": "user123",
          "text": "Thank you. This is good advice.",
          "time": null
        }
      ]
    }
  ]
}