{
  "title": "How to use dnSpyEx or some other .NET debugger to attach to a .NET process started with a process-hollowing technique?",
  "link": "https://reverseengineering.stackexchange.com/questions/31472/how-to-use-dnspyex-or-some-other-net-debugger-to-attach-to-a-net-process-start",
  "content": "I have a .NET executable that is started using the process-hollowing technique. Here's how it looks from the Detect-It-Easy tool:\n\n\n\nI can open the image file for that process (from disk) with dnSpyEx, but when I try to attach to it with a debugger while it's running (after it was process-hollowed), my breakpoints don't hit:\n\n\n\nAny idea how to attach to such process with a debugger - dnSpy or some other one?\n\n",
  "votes": "5",
  "answers": 1,
  "views": "940",
  "tags": [
    "debugging",
    "unpacking",
    ".net",
    "packers",
    "dnspy"
  ],
  "user": "c00000fd",
  "time": "Jan 25, 2023 at 8:55",
  "comments": [],
  "answers_data": [
    {
      "content": "You can insert an infinite loop in the code that you can find once you attach to the process.\n\nThis is similar to the EBFE technique.\n\nNote that the definition of bool a = true; and the if surrounding the while(true) is needed to trick the debugger to avoid that compilation remove the rest of the code. If the compiler is still able to remove it, you can try a bit more difficult condition to trick the debugger such as int a = 3; int b = 2; if(a*2-b+1==5){while(true){}};\n\n",
      "votes": "3",
      "user": "Ana María Martínez Gómez",
      "time": "Jan 25, 2023 at 12:36",
      "is_accepted": false,
      "comments": [
        {
          "user": "c00000fd",
          "text": "Hmm, that's an interesting idea. But how would I insert my code into it if my breakpoints don't hit? See that second screenshot.",
          "time": null
        },
        {
          "user": "Ana María Martínez Gómez",
          "text": "You need to insert the code before the sample is run. Note running the sample is step 4.",
          "time": null
        },
        {
          "user": "c00000fd",
          "text": "Thanks. That's an interesting technique. I tried it, but step 5 doesn't produce the result that you described. The dnSpy breaks but then it doesn't switch to the source code line. And even if I click \"Show next statement\", nothing happens. My guess is that it can't find symbols.",
          "time": null
        }
      ]
    }
  ]
}