{
  "title": "Decompile and Re-compile iOS app (.ipa file)",
  "link": "https://reverseengineering.stackexchange.com/questions/31537/decompile-and-re-compile-ios-app-ipa-file",
  "content": "As a part of college project, I have to showcase how I can get ios app from jailbroken devices and reverse-engineer it. In the first part of slide, I am showing how we can get the IPA file from jailbroken device, also can decrypt the iOS app (either through clutch2 or ipainstaller). I am showing how attacker can use class-dump-z and enumerate classnames and method names.\n\nI am also trying to add a scenario, where I not only get the decrypted app from jailbroken iPhone but also can change few things in it. I am trying to change parameters in Info.plist file.\n\nBelow are the steps I performed:\n\nQuestion:\nNow, how do I recompile the unzipped_app directory back to .ipa file?\n\nI came across this question Disassemble, edit and re-assembly iOS ipa apps but this is not providing solution to my question.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "4k",
  "tags": [
    "ios",
    "decompile"
  ],
  "user": "node_analyser",
  "time": "Feb 13, 2023 at 12:46",
  "comments": [
    {
      "user": "Robert",
      "text": "IPA files are simply renamed ZIP files. So what you call \"recompiling\" is just zipping the data. For the correct directory structure just see the original IPA file (can be downloaded using old iTunes versions).",
      "time": null
    },
    {
      "user": "node_analyser",
      "text": "That worked like charm. Had to do some tweaks but thank you so much for this pointer. :) :)",
      "time": null
    },
    {
      "user": "Robert",
      "text": "May be you should create an answer and describe the \"teaks\" you had to apply?",
      "time": null
    },
    {
      "user": "node_analyser",
      "text": "Thanks @Robert.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "With the help of Robert's comment, I explored that path and found a solution.\n\nIPA file is basically a form of ZIP file and likewise we can unzip it easily.\n\nThis will give us directory format as\n\nOnce appropriate modifications are done in Info.plist, we can save the Info.plist file.\n\nNow, transfer the Payload directory from macbook to jailbroken ios device.\n\n-- On Jailbroken Device --\n\nOpen Filza app and go to /var/root. This is the location where we sent Payload directory via scp.\n\nDone. This will install the new ipa file.\n\nSelf signing or any other type of signing is not required as (up to my limited knowledge) AppSync disables the code signing checks on jailbroken device.\n\nWriting self answer hoping that someone might get help from this.\nThank you.\n\n",
      "votes": "1",
      "user": "node_analyser",
      "time": "Feb 15, 2023 at 14:04",
      "is_accepted": true,
      "comments": [
        {
          "user": "Robert",
          "text": "For installing an IPA I prefer ideviceinstaller from libimobiledevice tools.",
          "time": null
        }
      ]
    }
  ]
}