{
  "title": "Decrypt PPPoE password of Huawei ONT HG8145V5",
  "link": "https://reverseengineering.stackexchange.com/questions/31663/decrypt-pppoe-password-of-huawei-ont-hg8145v5",
  "content": "I am trying to get the PPPoE password of my Huawei ONT, model HG8145V5. When I access the ONT user interface and go to WAN settings, I can clearly see the PPPoE username. However, the password is behind asterisks. I tried changing the password field to plain text by right-clicking and inspecting its properties. These gives me following text: be5ea9e2094a958af22b0110ef2b6899398e2d3122b8cd61b069eac793b13f06.\n\nI also tried downloading the configuration file and inspecting the PPPoE section of it (it is an xml file). But again, the PPPoE username is clearly visible but the password is encrypted to the following: $2y\"EQHU.|JI\\uk&*7p6IDTq}]D02Kd/}hfqAl.wAA$.\n\nI would really appreciate any suggestions to get the actual PPPoE password. My stupid ISP refuses to give that information for residential connections.\n\n",
  "votes": "4",
  "answers": 2,
  "views": "6k",
  "tags": [
    "decryption"
  ],
  "user": "Brandon",
  "time": "Mar 13, 2023 at 7:09",
  "comments": [
    {
      "user": "secfren",
      "text": "Did you try the tools/methods mentioned here: reverseengineering.stackexchange.com/questions/31659/… ? Maybe there is also an easily accessible EEPROM.",
      "time": null
    },
    {
      "user": "Brandon",
      "text": "@secfren Sorry to answer your question here. Since I am a new user I am not allowed to make comments yet. Yes, I did found those previous posts and tried their suggestions but none of them worked. That is why I am searching for new alternatives.",
      "time": null
    },
    {
      "user": "secfren",
      "text": "If there is no error on your side then maybe Huawei changed the code for password encryption. You need to get your hands on the firmware. There are some older links but you need to at least register for that. The other way is to get it from the device itself. I only found blurry pictures of the PCB. So you need to disassemble the device and dump the memory in some way. There is some risk of bricking, certainly loss of guarantee and you need additional equipment. Either you find the password in clear in the dump or you need to reverse engineer the firmware and look for the encryption routine.",
      "time": null
    },
    {
      "user": "Aka",
      "text": "Hello Your password : VBEYS03037",
      "time": null
    },
    {
      "user": "Yo Godows",
      "text": "Can someone help me with: 64cd2624aa74439caad2c157534d296a2e3e1da229ef08d2aa5f88e0b4e12254",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can use this website to decrypt the password\n\n",
      "votes": "2",
      "user": "0xC0000022L",
      "time": "Aug 10, 2023 at 22:17",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Your password for ppoe is VBEYS03037\n\n",
      "votes": "0",
      "user": "FoX",
      "time": "May 2, 2023 at 12:40",
      "is_accepted": false,
      "comments": [
        {
          "user": "Remko",
          "text": "This answer is helpful for the OP but not for others in the future. Please desribe how you obtained the password from the hash/encrypted form.",
          "time": null
        }
      ]
    }
  ]
}