{
  "title": "UART Interface Router (HUAWEI) V724 Typ A",
  "link": "https://reverseengineering.stackexchange.com/questions/31708/uart-interface-router-huawei-v724-typ-a",
  "content": "I am trying to identify the UART pins on the board in order to debrick the router. Any help would be appreciate it.\n\n\n\n\n",
  "votes": "2",
  "answers": 0,
  "views": "76",
  "tags": [
    "router"
  ],
  "user": "Alma",
  "time": "Mar 26, 2023 at 16:25",
  "comments": [
    {
      "user": "secfren",
      "text": "Picture from underside (and maybe without cooler/shielding)? This seems to indicate some header visible only at the bottom side (TP25-TP28 middle bottom) openwrt.org/_media/media/t-com/… openwrt.org/_media/media/t-com/speedport_w724vtypa_pcb_back.jpg",
      "time": null
    },
    {
      "user": "Alma",
      "text": "Great hint! Shall try TP25-T28. .. but what about the pin-out? Similar to Typ B and Typ C? There is no Typ A listed on openwrt.org!?",
      "time": null
    },
    {
      "user": "secfren",
      "text": "Dunno. Check voltages, GND ... there are not many possibilities (if it is serial). Maybe helpful: openwrt.org/docs/techref/hardware/port.serial",
      "time": null
    },
    {
      "user": "Alma",
      "text": "Thanks again, Bro! Hv measured resistance as well voltage against GND - unfortunately, all pins 0 Ohm as well as  0 Volt!??? Strange!  Made also control measurement against USB pin-out on the board & multi meter works fine and shows 5V",
      "time": null
    },
    {
      "user": "secfren",
      "text": "Found GND? Try to trace back the connection from the header to the CPU. Sometimes there is no (continuous) connection and a e.g. a resistor is missing. Also check voltages under different conditions (like during boot) and also on other components. NAND at least seems to be 3V. There is of course still the possibility that it is not the serial header or not connected ... There are other marked testpoints and lots of unmarked ones. But it is lots of work to figure out if and where there is a serial connection in this case.",
      "time": null
    }
  ],
  "answers_data": []
}