{
  "title": "Determining power supply needs for a first class, reclining airplane seat",
  "link": "https://reverseengineering.stackexchange.com/questions/31742/determining-power-supply-needs-for-a-first-class-reclining-airplane-seat",
  "content": "I have a Sicma Majesty 1606 seat pair from a retired Boeing 767-300. My goal is to provide power and get them working as reasonably functional and fun home furniture for a living room. I'm documenting the process on a GitHub repo, and there may be useful background information there.\n\nThese seats have motors that control several seat position functions and appear similar to the kind that are used in powered recliners typically sold as home furniture. There is an electronics box under the left seat (labeled \"PGA Electronic PN: P78621B470 'ECU Electronic Control Unit (FCBE)'\") that appears to take input from two passenger control panels. I would like to provide power to this box so that the power-recliner functions of these seats can be used in the home.\n\nThere is a second box under the right seat (also labeled \"PGA Electronics\") wired to the ECU, which appears to be a power supply for this ECU. A label on the back of this box suggests that it takes 115V 400Hz power as input. However, there is no indication on the outside of the box what power it would provide through a multi-conductor wire that connects to the ECU box. I haven't been able to remove this power box from the seats in order to open it up, and I haven't been able to open it up yet while it's still inside the seat. Home recliners (or, rather, the motors used by these recliners) appear to work on 24-29V DC power, and often have a power adapter that takes mains AC power from a wall source to a DC voltage that the recliner control box can use, so my hypothesis is that this box under the right seat is a power supply that will take the aircraft power (115V 400Hz AC) and convert it to a DC voltage that is used by the ECU.\n\nI can find various DC power supplies for powered recliners for sale online, so if my hypothesis is correct, I think I can simply replace the power supply box under the right seat with something that will take wall power and output the appropriate DC voltage, in order to get the ECU under the left seat to operate as it normally would when installed in the aircraft.\n\nSince I'm unable to provide 115V400Hz AC power at home, however, I need some other way to determine what voltage is output by this power supply box, and which of the output conductors is which--power and ground.\n\n",
  "votes": "3",
  "answers": 0,
  "views": "80",
  "tags": [
    "hardware"
  ],
  "user": "Eric Jackson",
  "time": "Apr 2, 2023 at 23:37",
  "comments": [
    {
      "user": "masterX244",
      "text": "Researching atm if you could abuse a high-wattage audio amplifier as a 400Hz AC source",
      "time": null
    },
    {
      "user": "Eric Jackson",
      "text": "I don't see why it's off topic; is it not trying to reverse-engineer how to provide the right kind of power, to get this kind of seat to work? (It's hardware-focused, not software-focused, but the general topic of \"reverse engineering includes both.) I certainly don't see how it's self-promotion. Could you explain why you think that?",
      "time": null
    }
  ],
  "answers_data": []
}