{
  "title": "xdbg64 Unable to find string.. Need help cracking a program",
  "link": "https://reverseengineering.stackexchange.com/questions/31746/xdbg64-unable-to-find-string-need-help-cracking-a-program",
  "content": "Ive been trying to crack my friends program for quite some time. He gave me permission and we are trying to see if his mod menu is ready to hit the market. Ive watched a couple youtube videos and I am completely stuck.. Can anyone help me?? Would really appreciate it\n\nWhen I input an incorrect password, I get this prompt.\n\n\n\nAlternatively, I have an outdated subscription code, when I enter that code I get this prompt\n\n\n\nAfter running the program through x64dbg and going to search for an associated string.. nothing comes up.. Can someone please help me?\n\nhttps://gyazo.com/0853f4006a130d3922f1966b983c3970\n\n(A Picture incase it is too small in the gif) ->\n\n\n\n",
  "votes": "2",
  "answers": 1,
  "views": "464",
  "tags": [
    "debugging",
    "x64dbg"
  ],
  "user": "Alen",
  "time": "Oct 19, 2023 at 14:11",
  "comments": [
    {
      "user": "The one word assaulter",
      "text": "Were you able to get through this? I'm facing a similar problem, and it'll be helpful to get a followup on this question.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I don't really know x64dbg, but are you sure the string search handles wide-char strings correctly?\n\nWhen do you run the search? Are you sure the strings are available at the time?\n\nI would recommend making a deadlisting, using whatever disassembler you're comfortable with, and having a look for the strings and xrefs to them. You tend to get a very narrow view of the logic in a debugger, and you need the wide one for this.\n\nEdit: x64dbg apparently only searches the module currently shown in the disassembly. Open up the symbols window, clickety-click your friend's module, and try searching again. Or you could set a breakpoint on MessageBox() and see where it's called.\n\n",
      "votes": "3",
      "user": "Tobias",
      "time": "Apr 24, 2023 at 8:33",
      "is_accepted": false,
      "comments": []
    }
  ]
}