{
  "title": "Is it possible to use GHIDRA to decode .NET ? (1 lvl crackmes with solution, but not in GHIDRA)",
  "link": "https://reverseengineering.stackexchange.com/questions/31814/is-it-possible-to-use-ghidra-to-decode-net-1-lvl-crackmes-with-solution-but",
  "content": "I am a beginner, I want to decode 1 lvl in crackmes, I downloaded a GHIDRA as my main tool. I've got a simple keygen app.\n\nHere it is: https://crackmes.one/crackme/5ab77f6433c5d40ad448cb2d. The solution is simple\n\nThe source appears to be like this :\n\n```\n  private void CloseApp()\n  {\n      string str = \"papanyquiL\";\n      for (int i = 0; i < this.textBox1.Text.Length; i++)\n      { etc..\n\n```\nI won't ask how to get this function if the name would be different. But there are other problems - All my functions aren't visible in the decompiler, only enter function is available. I can't find an Assembler code and code in the solution.\n\nIs GHIDRA ever available to decompile this type of file? It says that it is .NET CLR Managed Code, and that's all I've found.\n\n\n\n",
  "votes": "8",
  "answers": 1,
  "views": "4k",
  "tags": [
    "ghidra",
    ".net",
    "crackme",
    "byte-code",
    "dotnet-clr"
  ],
  "user": "OREN YT",
  "time": "Jul 31, 2024 at 22:25",
  "comments": [
    {
      "user": "mimak",
      "text": ".NET compiles to IL bytecode that requires a runtime to be executed. To my best knowledge Ghidra doesn't support this architecture, you should use a .NET decompiler like the popular ILSpy or Reflector as you mentioned",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You mentioned that you are a beginner so I'll give you a more generic answer with a concrete recommendation in the end.\n\nCompared to other industries, like software development, or generally white-collar type jobs, reverse engineering (RE) is a bit of a niche-industry. So while you might be used to using \"one tool for everything\" in other place, I don't believe that this will be the case in RE any time soon. So imho you should be getting used to having a larger tool \"box\" of software that is more specialized for particular tasks.\n\nIn your situation, for example, you want to analyze a .NET-based sample. And while Ghidra is, in principal, able to analyze .NET-based samples, it is not the most powerful tool. Think of it like this: you can use a screwdriver to hammer in a nail — and one sometimes does that, if there is no hammer around for example — but if you are being serious about nails, you should get a proper hammer. And your hammer in this case is dnSpy.\n\nAlternatives \"hammers\" have also been mentioned in the comment section: ILSpy and Reflector.\n\n",
      "votes": "4",
      "user": "born",
      "time": "Oct 17, 2023 at 11:37",
      "is_accepted": false,
      "comments": []
    }
  ]
}