{
  "title": "Packers/Protectors for Linux",
  "link": "https://reverseengineering.stackexchange.com/questions/3184/packers-protectors-for-linux",
  "content": "I was wondering if anyone had come across a packer/protector which could be used for ELF binaries. There seem to be quite a few articles on writing packers and protectors for the PE format -- however, there don't seem to be very many for Linux.\n\nThis is just a hobby and so far I've come across1 which is seems to be a very basic(but neat) introduction to SMC.\n\nAre there any resources/source code that you could point me to that I could refer and learn from?\n\n",
  "votes": "6",
  "answers": 3,
  "views": "12k",
  "tags": [
    "linux",
    "elf",
    "packers"
  ],
  "user": null,
  "time": "Dec 14, 2013 at 22:16",
  "comments": [],
  "answers_data": [
    {
      "content": "Apart from the classix UPX, you should take a look at Burneye (With its crackers, UNFburninhell and Burndump) and elfuck. They are pretty old, but still interesting.\n\nIf you are interested about tricks that can be used, this is a good introduction by aczid, and I would also recommend Binary protection schemes for a more complete overview. \n\nSomeone also presented a CanSecWest a packer named Shiva that was broken at Blackhat. Unfortunately, there is no sources available.\n\n",
      "votes": "8",
      "user": "jvoisin",
      "time": "Dec 14, 2013 at 19:12",
      "is_accepted": false,
      "comments": [
        {
          "user": "Krypton",
          "text": "any update on this list? Except UPX, those listed are really old and not maintained.",
          "time": null
        },
        {
          "user": "jvoisin",
          "text": "Feel free to write your own if you're impatient ;)",
          "time": null
        },
        {
          "user": "Rui F Ribeiro",
          "text": "Unfortunately many of the links above seem not to be working anymore.",
          "time": null
        }
      ]
    },
    {
      "content": "Click on the tool names to download. Some will be source code only, others binary only. Use at your own risk.\n\nThere are 4 sections: \n\nThe majority of modern ELF binaries are protected using UPX or a variant thereof. 1,2\n\nA taxonomy of self-modifying code for obfuscation (2011) concisely summarizes some of these tools and discusses a variety of obfuscation techniques.\n\n",
      "votes": "1",
      "user": "julian",
      "time": "Aug 11, 2019 at 5:47",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "UPX is an open-source packer that works on ELF binaries.\n\n",
      "votes": "0",
      "user": "Jason Geffner",
      "time": "Dec 14, 2013 at 15:05",
      "is_accepted": false,
      "comments": []
    }
  ]
}