{
  "title": "Reverse Engineer 16 Bit error checking byte calculation",
  "link": "https://reverseengineering.stackexchange.com/questions/31858/reverse-engineer-16-bit-error-checking-byte-calculation",
  "content": "Hello =) I am attempting to reverse engineer a communications protocol to some obsolete equipment. Communication happens on an RS485 line.\n\nI have captured several exchanges and seem to have figured out a bit the structure.\n\nWhat I am missing at the moment is to see how I would calculate the last 2 bytes which seem to be a CRC, Checksum, LRC,... some sort of Calculated bytes depending on the data.\n\nThis is a Master -> Slave Communication.\nM: Hex bytes sent by master\nSx: Hex Bytes replied by Slave x\n\nSerial Numbers of Slaves:\nS1: F376150801196\nS2: F306103101122\nS3: F306093001029\n\nDevices getting enumerated :\n\nAcknowledgement of recieved command from different slaves to the commands of move slave from Master\n\nCommands, acknowledged by the acknowledge command of each respective Slave accordingly\n\nS3 Go to\n\nFrom my observations the Structure I have the following identified:\n\nff    fb    f3    41 ff 05 9a 01 c2 01 00 03 05     04     9c     05\n\nbyte1 byte2 byte3 --------------------------------- byte13 byte14 byte15 byte16\n\nI have been manually attempting to calculate and compare several 16 bit CRCs and also tried running several frames through Reveng with out much luck, no models ever get found.\n\nAny help and insights would be greatly apreciated.\n\nThanks!\n\n",
  "votes": "3",
  "answers": 1,
  "views": "242",
  "tags": [
    "serial-communication",
    "crc",
    "checksum"
  ],
  "user": "Pau Coma Ramirez",
  "time": "May 12, 2023 at 0:11",
  "comments": [],
  "answers_data": [
    {
      "content": "So, after reviewing This following Stack Overflow Question\n\nI opened up an excel and made some tests and effectively\n\nSum of all bytes is the calculation\n\nSometimes we search for too complicated answers to simple things.\n\nThanks anyway for having a look.\n\n",
      "votes": "2",
      "user": "Pau Coma Ramirez",
      "time": "May 12, 2023 at 0:19",
      "is_accepted": false,
      "comments": []
    }
  ]
}