{
  "title": "What is the meaning of 32 bit offset in x86 16 bit jump",
  "link": "https://reverseengineering.stackexchange.com/questions/31911/what-is-the-meaning-of-32-bit-offset-in-x86-16-bit-jump",
  "content": "Consider x86 16 bit mode instruction:\n\n```\n$ echo 66 EA 66 55 44 33 22 11 | xxd -p -r | ndisasm -b16 -\n00000000  66EA665544332211  jmp dword 0x1122:0x33445566\n\n```\nI thought 16 bit code jumps work by combining two 16 bit parts, while 32 bit code just uses 32 bit offset without segment part. What's the meaning of having both segment offset and 32 bit offset?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "204",
  "tags": [
    "x86"
  ],
  "user": "Uprooted",
  "time": "May 28, 2023 at 11:30",
  "comments": [],
  "answers_data": [
    {
      "content": "It's a far/long jump, which sets loads the code segment descriptor using the selector specified.\n\nA jmp to a code segment selector which is the same as the existing CS value reloads the descriptor.\n\nSee the Intel Software Developer's Manual Section 7.3.15.2 \"Far Control Transfer Instructions\" and the description of the JMP instruction:\n\n",
      "votes": "2",
      "user": "matja",
      "time": "May 28, 2023 at 15:26",
      "is_accepted": true,
      "comments": [
        {
          "user": "Uprooted",
          "text": "What do numbers 1122 and 33445566 mean here, how exactly are they combined to determine jump target?",
          "time": null
        },
        {
          "user": "matja",
          "text": "@Uprooted 0x1122 there is the selector which is an offset (multiple of 8, the descriptor size in bytes) into the GPT (en.wikipedia.org/wiki/Global_Descriptor_Table).  0x1122 would be invalid because it is not a multiple of 8.  The segment descriptor (en.wikipedia.org/wiki/Segment_descriptor) is loaded, which can change the privilege level, base address, and default operation size of the new code.  0x33445566 is an offset from the base address specified in the segment descriptor, which may be different to the physical address if paging is also used.",
          "time": null
        },
        {
          "user": "peter ferrie",
          "text": "@matja There's nothing here to suggest that it's running in protected mode at the time.  It is a perfectly valid unreal-mode address.",
          "time": null
        }
      ]
    }
  ]
}