{
  "title": "How to debug armel and armhf binaries on x86-64 Ubuntu simultaneously?",
  "link": "https://reverseengineering.stackexchange.com/questions/31999/how-to-debug-armel-and-armhf-binaries-on-x86-64-ubuntu-simultaneously",
  "content": "I'm working on the challenges on ROP Emporium. For the ARMv5 version of the callme challenge, we are given two binaries and two shared libraries: callme_armv5 with libcallme_armv5.so and callme_armv5-hf with libcallme_armv5-hf.so. The first pair appears to be using the armel EABI, while the second pair is using the armhf EABI.\n\nIn Appendix B of ROP Emporium's Beginner's Guide, they show how to set up an environment for cross-platform debugging for ARM like so:\n\n```\n$ sudo apt install qemu-user libc6-armel-cross gdb-multiarch\n$ sudo mkdir /etc/qemu-binfmt\n$ sudo ln -s /usr/arm-linux-gnueabi /etc/qemu-binfmt/arm\n\n```\nThat works great for armel, but it doesn't work for armhf. So I found this post, showing how to set up an environment for cross-platform debugging of armhf binaries.\n\n```\n$ sudo apt install qemu-user libc6-armhf-cross gdb-multiarch\n$ sudo mkdir /etc/qemu-binfmt\n$ sudo ln -s /usr/arm-linux-gnueabihf /etc/qemu-binfmt/arm\n\n```\nThis works fine for armhf, but not for armel ...\n\n```\n$ qemu-arm ./callme_armv5-hf  # Okay\n...\n$ qemu-arm ./callme_armv5     # FAIL\n./callme_armv5: error while loading shared libraries: libcallme_armv5.so: cannot open shared object file: No such file or directory\n\n```\nThe problem is that both setups create the same symlink, but to different directories, so I can debug armel and armhf binaries individually, but each time I want to switch, I have to change the symlink. Is there some way to set up an environment so I can debug both binaries simultaneously?\n\nIn case it's relevant, I'm running Ubuntu 20.04 under WSL2.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "131",
  "tags": [
    "debugging",
    "arm",
    "qemu"
  ],
  "user": "jinscoe123",
  "time": "Jun 25, 2023 at 22:59",
  "comments": [],
  "answers_data": []
}