{
  "title": "Bluetooth speaker firmware modification",
  "link": "https://reverseengineering.stackexchange.com/questions/32008/bluetooth-speaker-firmware-modification",
  "content": "I don't know if this is the right community to ask this to but I have this speaker and I want to change the startup, shutdown sound effect of it. It is not a chinese BT speaker but a Hama soundbarrel. I can't disassemble it to reveal the circuit board. Any way to pull the firmware to my PC and then push back the modified firmware? I only have an AUX, USB and a Type C port.\n\n",
  "votes": "0",
  "answers": 1,
  "views": "152",
  "tags": [
    "firmware-analysis",
    "bluetooth"
  ],
  "user": "B3nceee",
  "time": "Jun 28, 2023 at 12:48",
  "comments": [
    {
      "user": "masterX244",
      "text": "as what device does it appear if it is connected to a PC? And posting pictures of the device label with model# and regulatory information can be a good pointer, too. Depending on the model it can be done but that needs information on whats inside (which can be googled with some base pointers)",
      "time": null
    },
    {
      "user": "B3nceee",
      "text": "Well if I just connect it to the PC with a type C cable it appears as a sound device in the device manager and I can get the device properties in the device manager",
      "time": null
    },
    {
      "user": "masterX244",
      "text": "Take a picture of the label on the device itself, that should give me enough pointers to google around. Also: whats the hardwareid/vendorid of the device under windows?",
      "time": null
    },
    {
      "user": "B3nceee",
      "text": "The hardwareid is: \"BTHENUM\\{0000110b-0000-1000-8000-00805f9b34fb}_LOCALMFG&005d\", I could only find the link to the product on their website which is: hama.com/00188217",
      "time": null
    },
    {
      "user": "masterX244",
      "text": "Damnit... making it hard to tickle out information. was hoping for a FCC id when i asked for the label on the device (FCC ID points to a US regulation database where some information is mandatory published, often you can gleam off some information on the inner parts there). and no trace of a firmware update file either so far...",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "No, you would have to disassemble it to find ISP or JTAG connectors. I suggest you always do it on a device you will not use or you are not currently using because there is always a chance of bricking the device or shorting circuitry so if you want to do it on your speaker just buy another one and try it on that second one.\n\n",
      "votes": "1",
      "user": "Josip Stjepanović",
      "time": "Jul 2, 2023 at 7:54",
      "is_accepted": false,
      "comments": []
    }
  ]
}