{
  "title": "Is it legal in the US to reverse engineer a product and then share the CAD for free to whoever needs it?",
  "link": "https://reverseengineering.stackexchange.com/questions/32034/is-it-legal-in-the-us-to-reverse-engineer-a-product-and-then-share-the-cad-for-f",
  "content": "First some background.\n\nI have this 3D printer that sucks, is pretty expensive, and unreliable. Whenever you need a spare part, the manufacturer sells you the entire kit! I needed a thermistor and they wanted to sell me the entire kit for $250, not only that, some pieces came 3D printed with pretty lousy quality and broke over the last 8 years, and not only that I've had to send the printer back 3 times because of many issues.\n\nThat said, I reverse-engineered all the entire 3D-printed parts, and want to share the STL files to whoever needs them. Also, I'm working on a mod to get rid of their crappy hotend and once I'm done I want to share it for free with whoever needs it. It's hard to spend a lot of money on a piece of useless crap, and if the manufacturer is not going to do anything to help or fix the issue then it is up to us the users to do it.\n\nKnowing that the manufacturer won't provide these parts even if you ask them, they will sell you the 3D-printed parts with the lousy quality they initially came.\n\nSo my question is, is it legal for me to share these STLs after I reverse-engineered them, as well as any mods I come up with for this printer? The last thing I would want is to get into trouble for trying to help someone.\n\n",
  "votes": "3",
  "answers": 0,
  "views": "94",
  "tags": [
    "assembly"
  ],
  "user": "Andres Cobos",
  "time": "Jul 5, 2023 at 3:00",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "Hi and welcome to RE.SE. While your question is on point -- i.e. you state the case and the jurisdiction you care about -- only a small subset of reverse engineers will have a law degree, be from the US and be willing to give you free-of-charge advice. I know what you want to do would fall into \"interoperability\" and in the EU should be legal. But no idea for the US.",
      "time": null
    }
  ],
  "answers_data": []
}