{
  "title": "Need help decrypt xxtea encrypted Lua file from cocos2D game",
  "link": "https://reverseengineering.stackexchange.com/questions/32262/need-help-decrypt-xxtea-encrypted-lua-file-from-cocos2d-game",
  "content": "I was trying to recreate this game because it was down but I really love it.\n\nI tried to decompile the apk and I got the java code and the assets then I looked around the code and found out the main code is not in the java but the lua folder inside the assets but the thing is that it get encrypted by XXTEA (For Example: this is main.lua).\n\nSo I'm trying to use IDA to read the lib .so file to find the key but it's a bunch of stuff that doesn't let me get the key easy so I tried to use frida to trace and print out the key when the decrypt get called but sadly because the server was down so the function never get called.\n\nPlease help me decrypt all the lua file or at least pls help me get the key to decrypt it, I really need it.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "712",
  "tags": [
    "decryption",
    "apk",
    "lua"
  ],
  "user": "NoName",
  "time": "Sep 13, 2023 at 17:08",
  "comments": [
    {
      "user": "user7290573",
      "text": "I'm way out of my depth here but opened the .so file in IDA just to have a look - I notice there's a getGameTeaKey function with a hardcoded string of \"kaiqigu-chuangshiji\" - might be a start? Also the main.lua file you posted doesn't seem to be encrypted.",
      "time": null
    },
    {
      "user": "NoName",
      "text": "sorry wrong main.lua file",
      "time": null
    },
    {
      "user": "NoName",
      "text": "also XXTEA require 16 bytes key and \"kaiqigu-chuangshiji\" is not 16 bytes so it's not XXTEA key",
      "time": null
    },
    {
      "user": "NoName",
      "text": "i edit and give the right main.lua link right now sorry about that",
      "time": null
    },
    {
      "user": "user7290573",
      "text": "Maybe it's the first 16 bytes, i.e. \"kaiqigu-chuangsh\".",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "xxteakey for decrypt lua: aaa\n\nxxtea_decrypt function jump to cocos2dx_lua_loader+F6\n\n\nPress F5 (decompile to pseudocode)\n\nvoid * xxtea_decrypt(const void * data, size_t len, const void * key, size_t * out_len)\n\nv22 is a key load from off_5E4660\n\n\nGoto address 5E4660\n\n\nkey is: aaa, full key size 16 from hex: 61 61 61 00 00 00 00 00 00 00 00 00 00 00 00 00\n\n",
      "votes": "2",
      "user": "xax",
      "time": "Sep 8, 2023 at 7:17",
      "is_accepted": true,
      "comments": [
        {
          "user": "NoName",
          "text": "thanks for your comment and the tutorial of how to get it but i had to tell u that i tried \"aaa\" and even a (cause on the image it's v22[0] so i tried it after aaa fail) but \"aaa\" and \"a\" is both fail it said wrong key. I removed the XXTEA at first cause i know we need to remove it before we decrypt it too but still fail",
          "time": null
        },
        {
          "user": "NoName",
          "text": "i don't know if i did it wrong or sth. Can you try to decrypt the lua file to see if it work or not please",
          "time": null
        },
        {
          "user": "xax",
          "text": "You need to ignore the first 5byte header : XXTEA sample decrypted game.lua",
          "time": null
        },
        {
          "user": "NoName",
          "text": "oh sorry i decrypt the wrong folder. Thanks a lot to help me with this. I'll comeback and up vote for you when i can",
          "time": null
        },
        {
          "user": "NoName",
          "text": "um, i decrypt the game.lua now and removed XXTEA header but the xxtea on python still said it's the wrong key. Can u tell me what thing did u use to decrypt?",
          "time": null
        }
      ]
    }
  ]
}