{
  "title": "Retrieve & dump type information from IDA Pro",
  "link": "https://reverseengineering.stackexchange.com/questions/32271/retrieve-dump-type-information-from-ida-pro",
  "content": "I want to retrieve IDA Pro .idb database's each type info, such as:\n\nAnd dump it to a .h file in a formatted manner. (\"Create C header file...\" just dumps without sizes and offsets and does not allow to pre-format it.) How to do this?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "292",
  "tags": [
    "ida",
    "c++",
    "idapython",
    "dumping",
    "script"
  ],
  "user": "void_17",
  "time": "Sep 8, 2023 at 6:06",
  "comments": [
    {
      "user": "mimak",
      "text": "You can use ida_struct API to retrieve the needed information via Python terminal/plugins",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "It's obviously doable (you already noted the Create C header file functionality), but if you want to customize the output, you'll have to code it yourself.\n\nHere's what you'll need:\n\nThat's all you need. However, if you've never worked with types programmatically before, you're going to find it tricky. It is already evident from the above that tinfo_t is a mutually recursive data structure, i.e., the tinfo_t for a structure contains other data structures (like udt_type_data_t) that themselves contain tinfo_t objects to describe structure field types. Due to the mutual recursion in the data structures, functions involving tinfo_t objects are often mutually recursive.\n\n",
      "votes": "4",
      "user": "Rolf Rolles",
      "time": "Sep 8, 2023 at 20:28",
      "is_accepted": true,
      "comments": [
        {
          "user": "void_17",
          "text": "Thank you so much for such a detailed answer! I will try this",
          "time": null
        },
        {
          "user": "KulaGGin",
          "text": "Very nice. Thanks for the explanation. It took me like 2 hours to find your answer and only then I managed to understand how I have to walk up the inheritance tree all the classes and also walk all the members of classes.",
          "time": null
        }
      ]
    }
  ]
}