{
  "title": "How to run exe program loaded into IDA Pro or Ghidra",
  "link": "https://reverseengineering.stackexchange.com/questions/32378/how-to-run-exe-program-loaded-into-ida-pro-or-ghidra",
  "content": "I'm new to reverse engineering, just learning. After the exe program is loaded into IDA or Ghidra, how do I run the exe program that loaded into IDA/Ghidra? so I can interact with the exe program? and see what data is loaded into memory and what pseudocode is used.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "1k",
  "tags": [
    "ida",
    "assembly",
    "ghidra",
    "idapython",
    "c"
  ],
  "user": "valaGQ237",
  "time": "Nov 16, 2023 at 12:21",
  "comments": [],
  "answers_data": [
    {
      "content": "I would recommend not running the program from IDA or Ghidra directly but use a much more powerful debugger like x64dbg. It is a bit annoying to translate between the memory within your debugger and the memory within Ghidra but imho that's well worth it.\n\nIf you are still committed on doing it all within IDA/Ghidra, expect some extra work:\n\n",
      "votes": "1",
      "user": "born",
      "time": "Oct 17, 2023 at 11:27",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "Could you explain the rationale to recommend against using the debugger in either. There are also emulation frameworks which work with IDA, btw. And it allows you to communicate with a remote using the gdbserver protocol.",
          "time": null
        },
        {
          "user": "born",
          "text": "Those debuggers are just not the focal point of IDA/Ghidra. While they fundamentally do their job, x64dbg is just far more powerful. That's why I suggest OP familiarizes themselv with it.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "Undoubtedly x64dbg specializes in debugging much more than either of the other two tools. But when it comes to the other aspects of RCE, Ghidra and IDA excel and they are able to show pseudocode as was asked. It's that aspect that is lacking from your answer, IMO. I'm not aware that x64dbg would be able to do that. Am I missing something here? Also, those tools to sync across the main RCE tools are indeed nothing to rely on - not just because they often replace each other.",
          "time": null
        }
      ]
    }
  ]
}