{
  "title": "How to use IDA environment to run python scripts?",
  "link": "https://reverseengineering.stackexchange.com/questions/32497/how-to-use-ida-environment-to-run-python-scripts",
  "content": "I am trying out following technique:\n\nhttps://github.com/CMUSTRUDEL/DIRTY\n\nThis is a deep learning approach for type and name recovery. It uses ida scripts to generate and preprocess the dataset.\n\nIt first requires me use IDA to generate the dataset.\n\n```\npython3 generate.py --ida /path/to/idat64 -b BINARIES_DIR -o OUTPUT_DIR_Step1\n\n```\nThis extracts function information from the dataset. After that, I have to run preprocessing scripts as follows (the instruction on their GitHub are incomplete).\n\n```\n# Inside the dirty directory.\n\npython -m utils.preprocess OUTPUT_PATH PATH_TO_DATASET_FILENAMES OUTPUT_DIR_Step1\n\n```\nBut, the problem is that, the scripts don't take IDA path and they use idapython libraries such as ida_typeinf\n\nCheck - https://github.com/CMUSTRUDEL/DIRTY/blob/main/binary/dire_types.py\n\nHowever, if I run the above python script, as it lies outside the ida environment, gives me lib not found errors (because it can't see ida_typeinf).\n\nIs there any way to run this script within ida environment (that's what I believe is the issue, but I could be wrong). It is also possible that the above command python -m utils.preprocess OUTPUT_PATH PATH_TO_DATASET_FILENAMES OUTPUT_DIR_Step1 may not be accurate and I need Ida command line to run that command. Note that I know how to run idat on individual binaries.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "452",
  "tags": [
    "ida",
    "idapython"
  ],
  "user": "R4444",
  "time": "Nov 13, 2023 at 3:24",
  "comments": [
    {
      "user": "Robert",
      "text": "The scripts don't take IDA path as it contains them in idastubs directory (not sure if this is a copy or just a similar re-implementation).",
      "time": null
    },
    {
      "user": "mimak",
      "text": "you can find the Python libs at <your IDA root dir>/python",
      "time": null
    },
    {
      "user": "R4444",
      "text": "@Robert and mimak I tired to add both of them and set the PYTHONPATH, but no luck.",
      "time": null
    },
    {
      "user": "Ali Rizvi-Santiago",
      "text": "Are you looking for the -S parameter as in hex-rays.com/blog/… (or to be more verbose hex-rays.com/blog/…)? Afaik, those libraries are meant to be used from inside since they're calling into the disassembler/decompiler API. Hence, it's sorta weird to run the python interpreter to use them directly.  You can run scripts from the UI with Alt+F7 (File -> Script File), or use the -S parameter from the commandline to explicitly run a script in IDA once it has loaded the database.",
      "time": null
    }
  ],
  "answers_data": []
}