{
  "title": "How should I determine the format of this audio file?",
  "link": "https://reverseengineering.stackexchange.com/questions/324/how-should-i-determine-the-format-of-this-audio-file",
  "content": "I have an audio file in an unknown format. How should I try to determine its format ?\n\nAlso, is it possible to do this by manual observation and not using any automated tool ?\n\n",
  "votes": "13",
  "answers": 3,
  "views": "14k",
  "tags": [
    "file-format"
  ],
  "user": "asheeshr",
  "time": "Mar 27, 2013 at 14:20",
  "comments": [],
  "answers_data": [
    {
      "content": "As for the automated approach, the file command is the classic recommendation. It's a tool which tries to guess the file type from the data contained in the file. It implements many of the well known file format signatures via libmagic. If you have a composite file you could try binwalk which will try to find files as subsets of a larger file.\n\nIf you want to go the manual route, you need to match some subset of the file to a known signature or pattern. This applies especially when it comes to file formats which are likely to be compressed as data patterns will be less regular. Therefore you usually need to find a pattern, usually called a signature or fingerprint, in the file structure. Most file formats have magic numbers either in the header or the footer of the file in order to make it easy for programs to check what type of file they are about to load. There are a couple of good resources for well known file signatures:\n\n",
      "votes": "12",
      "user": "Peter Andersson",
      "time": "Mar 27, 2013 at 16:42",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Peter's suggestions are, as usual, excellent. I'd like to add a few points.\n\n",
      "votes": "5",
      "user": "0xC0000022L",
      "time": "Mar 27, 2013 at 17:04",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "In addition to the fine suggestions in the other answers, here are some suggestions specific to audio:\n\n",
      "votes": "5",
      "user": "nneonneo",
      "time": "Mar 31, 2013 at 8:41",
      "is_accepted": false,
      "comments": []
    }
  ]
}