{
  "title": "APK/Apktool If I decompile and recompile sources the app does not start",
  "link": "https://reverseengineering.stackexchange.com/questions/32590/apk-apktool-if-i-decompile-and-recompile-sources-the-app-does-not-start",
  "content": "I'm trying to reverse an apk but there is a strange thing that happens, probably something new for me, basically if I decompile only the resources (not dex files) and recompile it zipalign/sign, the app installed works fine.\n\nIf I decompile also or only the sources (dex files), recompile it then zipalign/sign the app remain stuck on splash screen or sometimes crash going to background.\n\nNO error messages from Android (crash dialog), NO usefull logs from logcat (I tried also making app debuggable and doing some trials), AFAIK NO signature verification methods or anti-tampering mechanism (I researched and added breakpoint on PackageManager methods, looking at some pattern for those mechanism and so on....), I was trying to look also the .so but I'm not so good at going through them (I don't have a good \"starting point\" to look at it).\n\nThen, I'm not able to understand what is happening. When I decompile sources, there is some poorly recompilation that I made? I tried everything, I'm using latest version of apktool (2.9.1) and so on...\n\nJust this, the decompilation / recompilation of dex files break the app (not loading the main activity) without any usefull stack trace.\n\nI will appreciate a lot your help, thanks in advance!\n\n(Tell me eventually everything you need, logs, bugreports from adb, informations, etc...)\n\n",
  "votes": "0",
  "answers": 1,
  "views": "177",
  "tags": [
    "debugging",
    "decompilation",
    "android",
    "patch-reversing"
  ],
  "user": "zwave",
  "time": "Dec 21, 2023 at 18:17",
  "comments": [
    {
      "user": "Robert",
      "text": "In such cases it is better to use the original APK and run it on an rooted phone and then trace execution of certain functions using e.g. frida-trace.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Feels like recompiling problem. I'll suggest you to try out with MT Manager, as it tries to fix lot of problems while recompiling, that'll help to pin point the problem.\n\nAlso, please try to provide a link to the sample apk.\n\n",
      "votes": "0",
      "user": "Vansh Santoshi",
      "time": "Jul 22, 2024 at 9:44",
      "is_accepted": false,
      "comments": []
    }
  ]
}