{
  "title": "Looking for a packet forwarder on Android that redirects all packets to PC",
  "link": "https://reverseengineering.stackexchange.com/questions/32714/looking-for-a-packet-forwarder-on-android-that-redirects-all-packets-to-pc",
  "content": "I want to capture packets from Android apps. I need an packets forwarder on phone that creates a VPN to redirect all TCP packets to PC, then capture them with 'mitmproxy'. I want to use mitmproxy because it supports python addons, and it's free/opensource.\n\nBut I can't find a suitable packet forwarder. Here are what I've tried so far:\n\nAny suggestion?\n\n",
  "votes": "1",
  "answers": 2,
  "views": "85",
  "tags": [
    "android",
    "packet"
  ],
  "user": "aj3423",
  "time": "Feb 8, 2024 at 17:51",
  "comments": [
    {
      "user": "user3840170",
      "text": "I have actually had some success setting up mitmproxy with PCAPdroid, using the SOCKS5 proxy option. There is even a plug-in for PCAPdroid that runs mitmproxy on the Android device.",
      "time": null
    },
    {
      "user": "aj3423",
      "text": "@user3840170 Oh thanks, didn't know there is socks5 mode, it does work.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You don't need external tools. Mitmproxy since version 9 has built-in WireGuard support which allows you to use the official Wireguard VPN app on Android side to forward all traffic to Mitmproxy running on your PC.\n\nYou just have to start mitmproxy with in Wireguard mode:\n\n```\nmitmweb --mode wireguard\n\n```\nIt will then display the connection info in text and as QR for easy set-up of the WireGurd connection profile.\n\nIn rare cases where the computer running Mitmproxy doesn't know the correct IP address that should be used for the VPN server you may have to manually correct the WireGuard server IP in the installed VPN profile.\n\n",
      "votes": "2",
      "user": "Robert",
      "time": "Feb 9, 2024 at 10:05",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Assuming you have ADB access, you can use \"reverse tethering\" - share the PC's internet connection with the Android device, effectively routing all traffic through.\n\nThere are two useful tools in this thread:\nhttps://stackoverflow.com/questions/7119793/android-usb-debugging-with-pc-internet-connection\n\nIf you prefer not to compile APK's, there are a few available on Google Play, like this one:\nhttps://play.google.com/store/apps/details?id=com.curiouscompany.relink&hl=en_US\n\n",
      "votes": "0",
      "user": "Yotamz",
      "time": "Feb 9, 2024 at 7:51",
      "is_accepted": false,
      "comments": []
    }
  ]
}