{
  "title": "How to decrypt Zyxel's 'Backup_Restore' config file?",
  "link": "https://reverseengineering.stackexchange.com/questions/32857/how-to-decrypt-zyxels-backup-restore-config-file",
  "content": "I have a VMG3625-T50B running an ISP-dedicated firmware version (V550ABTL0b2r). I managed to get the supervisor password yet I can't enable open an SSH port because my SP disabled that option.\n\nI've been doing some research and found this blog that on getting a root access on a similar modem (the differences are merely zero). In the blog, Thomas describes how he gets root access by modifying the Backup_Restore JSON file. Unfortunately, mine is openssl-encrypted. The first line of the file is:\n\n```\nSalted__D-\"\u000b¶و9#-|ڈèق…[تµمزâ#:xUقطد¦é‏¨ں\" ء6Œ…5Iير\fّ×@ c‎µٹئ_6cه¶k\n\n```\nI've read somewhere on GitHub that I can decrypt the file using the supervisor password and I tried every password generated by boginw's keygen but I had no luck. (The password that works for my modem is generated using zcfgBeCommonGenKeyBySerialNumMethod3).\n\nI need to enable SSH so that I can debrand that modem and flash the global firmware, but that won't happen until I disable 'firmware ID check' aka fwidcheck using zycli.\n\nDoes anyone have any idea how to enable SSH on that modem by modifying the Backup_Restore file? or any other way really\n\n",
  "votes": "2",
  "answers": 1,
  "views": "261",
  "tags": [
    "decompilation",
    "decryption"
  ],
  "user": "Khalid",
  "time": "Apr 1, 2024 at 2:04",
  "comments": [
    {
      "user": "the busybee",
      "text": "Are you sure you are allowed to enable a feature that your SP disabled? Didn't you accept the contract?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I'm trying same thing on a Zyxel dx5401-b1 (TM firmware). Looks like they have made huge effort to close all sw gaps, boginw's keygen is not working as my serial number has no Y in it and the backup cfg has been encrypted probably (my guess) with the supervisor pw. The bootloader(cfe) has been locked and needs pw to unlock, serial console flash checks for hash!\nMaybe you can try to run some metasploit modules (I had no luck there!) that are available for your router to try to get a root shell. It seems like ssh, telnet and smb are enabled but restricted (fw).\nAnother option is to exploit the dns port, which is allways open. I will try that next !\nLast resort is taking the nand flash off the board and flash it.\n\n",
      "votes": "0",
      "user": "intrax",
      "time": "Jul 20, 2024 at 14:40",
      "is_accepted": false,
      "comments": []
    }
  ]
}