{
  "title": "Does a Windows MSI/installer function similarly to a portable file in PE format?",
  "link": "https://reverseengineering.stackexchange.com/questions/32939/does-a-windows-msi-installer-function-similarly-to-a-portable-file-in-pe-format",
  "content": "I'm trying to determine whether a Windows MSI or installer .exe is considered the same as a portable file .exe in the Portable Executable (PE) format, or if it's considered a dropper. What are the differences between them?\n\n",
  "votes": "0",
  "answers": 2,
  "views": "100",
  "tags": [
    "windows",
    "pe"
  ],
  "user": "c0d3r",
  "time": "May 4, 2024 at 13:28",
  "comments": [],
  "answers_data": [
    {
      "content": "Below is simplified comparison between MSI (Microsoft Installer), Portable Executables (PE), and EXE Installers\n\nMSI files, EXE installers, and Portable Executables (PE) have distinct internal structures, processing mechanisms, and purposes in the context of Windows software installation and execution. While MSI files rely on the Windows Installer service for installation management, EXE installers embed installation logic within executable files, and Portable Executables serve as the standard format for executable code and libraries on Windows.\n\nHere we can see 3 different files MSI (Microsoft Installer), Portable Executable (PE), and EXE Installer\n\n\n\n\n\n\n\n\n\n\n\n\n\nHope That Helped!\n\n",
      "votes": "3",
      "user": "CPUKiller",
      "time": "May 4, 2024 at 23:16",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": ".msi files are based on the OLE file format and has d0cf11e0 header as opposed to MZ header for a PE file format. you could use a tool such as oledump (oledump) to parse it, or a tool called orca (orca) which is part of the windows SDK to analyze the scripts in the msi. be careful while using orca with malware, use it in a safe vm environment since it might execute some scripts.\n\n",
      "votes": "2",
      "user": "rotem.salinas",
      "time": "May 5, 2024 at 11:17",
      "is_accepted": false,
      "comments": []
    }
  ]
}