{
  "title": "Is there a way to check how much of GB was written to hiberfil.sys (windows hibernation file)?",
  "link": "https://reverseengineering.stackexchange.com/questions/33016/is-there-a-way-to-check-how-much-of-gb-was-written-to-hiberfil-sys-windows-hibe",
  "content": "I switched from intel macbook to M3 for development work. The Intel one is used now by my wife for generic stuff, powered by Windows. The thing is that it has plenty of RAM, 64GB, way more than she needs for simple web browsing. As you might know the SSD cannot be replaced so I started wondering if it's better to limit the available RAM via boot params to protect the SSD lifespan, hence I would like to monitor how much GB was actually written to hiberfil.sys.\n\nFor example, task manager shows at this moment: memory in use(compressed) 21.7GB, available 41.9GB. How much GB will Windows write to disk upon hibernation?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "50",
  "tags": [
    "windows",
    "dump"
  ],
  "user": "nachrichten",
  "time": "Jun 8, 2024 at 12:27",
  "comments": [],
  "answers_data": [
    {
      "content": "I think you are mixing up hiberfil.sys with pagefile.sys.\n\nHiberfil.sys is only written when Windows performs a suspend to disk. I use that mode often instead of shutdown and base on own experience Windows only write used ram to this file: the more RAM is used the longer suspend to disk takes.\n\nIt may also be used when you perform a full reboot (not just the \"fast reboot\" that is done usually which is a partial suspend to disk where only the kernel memory is saved).\n\nIn both cases the maximum amount of RAM available makes on difference. Therefore you don't have to care about the maximum RAM available to Windows, it should not have an effect on the life-time of the SSD.\n\nAnyway if you are still concerned you can simply disable hibernation via powercfg -h off, then the file will be removed.\n\nIn general you can monitor SSD usage via TBW S.M.A.R.T value. Not sure about Apple devices, but on most SSDs you can get ream the S.M.A.R.T how much data has ben written for the whole SSD life time. But on modern SSDs the available life time is usually not a problem, as long as the SSD is not very very small (<256GB) and has only very little free space. Otherwise wear leveling an SSD TRIM does it's job well.\n\n",
      "votes": "1",
      "user": "Robert",
      "time": "Jun 9, 2024 at 10:13",
      "is_accepted": false,
      "comments": [
        {
          "user": "nachrichten",
          "text": "No confusion I meant hiberfil.sys. Disabling it is a risky game for a laptop. You surely want hibernate it before putting into a bag. Now I have even more to worry, I can't read SMART data from the SSD in Windows.",
          "time": null
        },
        {
          "user": "Robert",
          "text": "@nachrichten For a laptop hibernate makes sense, but even without Suspend to RAM would still be available and if the hardware supports it the \"Modern Standby\" mode should also be available. I wouldn't worry about the missing option to read SMART values, IMHO more important is that TRIM works. Together with an SSD that has always at least 30% free space, this should eliminate all your worries. Normal users shouldn't be able write so much data that the SSD fails.",
          "time": null
        }
      ]
    }
  ]
}