{
  "title": "Setting breakpoint on Win32 API does not work in Ollydbg",
  "link": "https://reverseengineering.stackexchange.com/questions/3305/setting-breakpoint-on-win32-api-does-not-work-in-ollydbg",
  "content": "I attached Ollydbg to a process, and try to set breakpoint on CreateWindowExW. I typed\n\n```\nbpx CreateWindowExW\n\n```\nin command line. Then I checked the Breakpoints window and found it's totally empty.\n\nThe same thing works smoothly in IDA pro -- I attached IDA pro to the process I'm going to debug, then in \"Modules\" window, I choose user32.dll and right click on CreateWindowExW and choose \"Add breakpoint\".\n\nActually, I found setting breakpoint on Win32 API in Ollydbg is very very hard to use. Based on all information I got by Google, I only need to run bpx xxxxx to set this kind of breakpoints, but in fact, it's rarely success. Most of time, no breakpoints were set by this.\n\nDid I miss something?\n\nBTW: The process I debugged loaded a lot of DLLs dynamically. Is this the problem?\n\n",
  "votes": "3",
  "answers": 2,
  "views": "8k",
  "tags": [
    "ollydbg"
  ],
  "user": "Lingfeng Xiong",
  "time": "Dec 28, 2013 at 23:07",
  "comments": [],
  "answers_data": [
    {
      "content": "With input focus on the disassembly pane in the CPU window, press Ctrl+G, then type CreateWindowExW to navigate to the first instruction of that function. Then press F2 to set a breakpoint on the first instruction of that function.\n\nThis is all documented very clearly in OllyDbg's help file.\n\n",
      "votes": "3",
      "user": "Jason Geffner",
      "time": "Dec 28, 2013 at 20:44",
      "is_accepted": true,
      "comments": [
        {
          "user": "Lingfeng Xiong",
          "text": "Thanks for your answer. Your method does worked. However, before I ask this question, I tried my best to search and read related materials including this FAQ page. In section 3, it described exactly the method I mentioned above but not yours. Could please tell me the difference between these two methods, and where is the help file you mentioned?",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "The BPX method described in the FAQ appears to set breakpoints on all static CALLs to the target function made from the current module, which is a really bad way to set a breakpoint. You should disregard that part of the FAQ (Alt+F1 doesn't do anything in OllyDbg 2.0, anyway). The help file in ollydbg.de/odbg110.zip is OLLYDBG.HLP; the help file in ollydbg.de/odbg200.zip is help.pdf.",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "I just noticed @blabb's post below regarding BPX vs. BP. Even so, probably best to just use OllyDbg 2.0 and skip the command line interface.",
          "time": null
        },
        {
          "user": "Lingfeng Xiong",
          "text": "Thanks for your help. I can only use Ollydbg 1.10 because every time i attach Ollydbg 2.0 to the process I'm debugging will hang both Ollydbg and target process(Ollydbg become no responding when analyzing some modules which used by this process, like user32.dll). Also, Ollydbg 1.10 can only be attached to the target process once -- when I restarted the process I'm debugging, I need to restart Ollydbg too or attaching to target process will hang it, although Ollydbg said it's running. Maybe a bug.. :-(",
          "time": null
        }
      ]
    },
    {
      "content": "ollydbg command line plugin accepts BP for Address and BPX for labels\n\nso if you require that breakpoint be set in Address use bp CreateWindowExW\n\nif you used bpx and no calls existed plugin will open a search for intermodular calls window for you to manually search for the interested api\n\nif you have a call like this\n\n```\n010020ED FF15 A4110001   CALL    NEAR DWORD PTR DS:[<&USER32.CreateWindow>; USER32.CreateWindowExW\n\n```\nplugin will set a break on this call with BPX style \nfor bp style you would need to use bp 10020ED\n\n",
      "votes": "0",
      "user": "blabb",
      "time": "Dec 29, 2013 at 17:25",
      "is_accepted": false,
      "comments": []
    }
  ]
}