{
  "title": "How to get rid of this \"Additional Parent Function\" visual block in IDA",
  "link": "https://reverseengineering.stackexchange.com/questions/33139/how-to-get-rid-of-this-additional-parent-function-visual-block-in-ida",
  "content": "I'm using IDA (free) 8.4. Each time I open a function (Windows x64) I get a possibly huge block of \"Additional Parent Function\" list on the right.\n\nIt's useless to me and I'd like to know if I can get rid of it completely. I know I can hide the block (right click menu) but the space taken is still taken when hidden, and I would like to never see it anyway.\n\n\n\nIs there any option in IDA to do this? I kinda remember this \"block\" wasn't shown like few years ago.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "82",
  "tags": [
    "ida",
    "disassembly"
  ],
  "user": "Alfonso-Rachid Huilda",
  "time": "Aug 2, 2024 at 14:58",
  "comments": [
    {
      "user": "Ali Rizvi-Santiago",
      "text": "those are related to ms c++ rt exception handling for x64, either frame unwinding or the handling themselves. their implementation depends on the handler associated with the boundaries specified in the IMAGE_EXCEPTION_DIRECTORY... hence, they're associated with the function through an implied data reference.  if you're actually trying to remove them, you can undefine the code with the ui.... however, i prefer to just remove the function chunk from each parent function with a script. you can also disable SEH or EH analysis (not sure which one) in the options during database creation.",
      "time": null
    },
    {
      "user": "Alfonso-Rachid Huilda",
      "text": "@AliRizvi-Santiago - can I use a script with IDA free and if yes, which script? Otherwise I've unchecked Kernel Option/Options 3/Enable EH analysis but it still shows this \"block\", I don't even know what that is... Are you sure it's related to SEH? Here is a closer look i.imgur.com/zthR59K.png",
      "time": null
    },
    {
      "user": "Alfonso-Rachid Huilda",
      "text": "I've also tried the \"IBM PC specific analyzer options\"/ Disable SEH/EH analysis but this block is still there",
      "time": null
    },
    {
      "user": "Ali Rizvi-Santiago",
      "text": "I disable \"Options 3 -> Enable EH Analysis\", and enable proc options, \"Disable SEH/EH analysis\", and it results in not processing the IMAGE_EXCEPTION_DIRECTORY. Simple confirmation is that if it's properly disabled, you won't see the \"unwind\" or \"try\" posterior/anterior comments in the disassembly. If you xref that basic-block (0x1800EF166), and then xref the labels for that ref'd data (then repeat it a few times for those refs), you should be able to detect what is referencing it and adding it as a function chunk for each of those functions. If you hit RUNTIME_FUNCTION, it's EH. However..",
      "time": null
    },
    {
      "user": "Ali Rizvi-Santiago",
      "text": "As mentioned, it's still a function chunk. You can remove these as documented at hex-rays.com/blog/igors-tip-of-the-week-86-function-chunks, or you can even undef the code at that address if lazy. If all else fails, and it does turn out to be EH related (despite your doubt), you can zero out the address of the IMAGE_EXCEPTION_DIRECTORY in the origin binary. To script removing chunks with IDC, (which I am no expert at), you can likely use remove_fchunk from hex-rays.com/products/ida/support/.idadoc/1077.shtml. Either way, if it's not marked as code, it won't be displayed.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Using IDA 9, we can now hide the visual block:\n\n\n\nAnd call \"Layout graph\" to reset the view:\n\n\n\nAnd the huge block is now hidden\n\n\n\n",
      "votes": "1",
      "user": "Alfonso-Rachid Huilda",
      "time": "Jan 3 at 11:50",
      "is_accepted": true,
      "comments": [
        {
          "user": "0xC0000022L",
          "text": "Technically not an answer to your question, since you asked about 8.4 specifically. Still good to know. +1",
          "time": null
        }
      ]
    }
  ]
}