{
  "title": "Extracting / converting an unknown 1990s graphics file format (.ATR)",
  "link": "https://reverseengineering.stackexchange.com/questions/33177/extracting-converting-an-unknown-1990s-graphics-file-format-atr",
  "content": "For about a month I've been working towards trying to crack the file structure on the graphical assets from the old JumpStart CD-ROM games. A large percentage of these games do not have their sprites archived, and despite community efforts the unfamiliar file formats have stumped everyone else I've asked about this. These had been contained in a format called .rsc, but someone else had managed to make a script to extract these assets out. Unfortunately that still doesn't fix the issue, as the sprites are seemingly contained within another unknown file type that was contained within the .rsc files.\n\nNow I want to see if it's possible to extract or convert the data for the sprites into something that can be turned into a sprite sheet (.png, .bmp, etc). Here are the details:\n\nAny help / information would be super appreciated, as if it's possible to turn these back into viewable images, that would solve the years long preservation problem that these games have. I'd like some more opinions on what this could all mean to hopefully get a better idea on if these are compressed, or if they're encrypted, or if they can be converted at all. Here is a link to download some of these files (.ATR, .SCN, and .SCR) for one particular section of the game: https://drive.google.com/file/d/1pIe6AKtKstM1ViIZ7aFkHLnU5cvvdcUt/view?usp=sharing. Thanks!\n\n",
  "votes": "0",
  "answers": 0,
  "views": "103",
  "tags": [
    "binary-analysis",
    "file-format",
    "decompress",
    "binary-diagnosis",
    "unknown-data"
  ],
  "user": "bearyberriez",
  "time": "Aug 23, 2024 at 13:32",
  "comments": [
    {
      "user": "Ian Cook",
      "text": "Do you have screenshots of the section of the whichever game the linked files are from correspond too ?",
      "time": null
    },
    {
      "user": "bearyberriez",
      "text": "@IanCook I do! The separate sections use specific naming formats, this room (ChalkBoard001) appears like this : imgur.com/a/d62TPXW",
      "time": null
    }
  ],
  "answers_data": []
}