{
  "title": "Which Windows kernel function is responsible for creating a crash dump file?",
  "link": "https://reverseengineering.stackexchange.com/questions/33211/which-windows-kernel-function-is-responsible-for-creating-a-crash-dump-file",
  "content": "If I understand correctly, when a bug-check happens, the KeBugCheckEx function saves the contents of physical memory pages in a swap-file and then the actual .dmp file is created only when the system boots back up.\n\nWhich NT function is used to save the .dmp file during the boot? And is it in ntoskrnl or in crashdmp.sys?\n\nI also wonder if the same function is responsible for creating different types of crash dump files, i.e. full dump, kernel dump, small dump, live kernel dump?\n\n",
  "votes": "3",
  "answers": 1,
  "views": "89",
  "tags": [
    "windows",
    "kernel-mode"
  ],
  "user": "c00000fd",
  "time": "Sep 9, 2024 at 23:59",
  "comments": [],
  "answers_data": [
    {
      "content": "The minidumps are generated in ntoskrnl.exe by IoWriteCrashDump, called from KeBugCheck2.\n\n",
      "votes": "4",
      "user": "joxeankoret",
      "time": "Sep 8, 2024 at 12:26",
      "is_accepted": false,
      "comments": [
        {
          "user": "c00000fd",
          "text": "Thanks. I wonder if the format of that minidump file was reversed by anyone before?",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@c00000fd absolutely, the structures are for the most part also documented. This may be of relevance for your question/comment.",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@joxeankoret are  you certain that this already creates all the actual dump structures? To the best of my knowledge the dump is written upon next reboot as outlined in the question. But I admittedly never booted a Windows machine into Linux (or so) between a bug check and the reboot. So I don't know.",
          "time": null
        },
        {
          "user": "c00000fd",
          "text": "This answer is wrong. The actual .dmp file is created in user mode after a reboot by the smss.exe process as a part of initializing the page file. smss!SmpCheckForCrashDump has something to do with it. I need to check it further.",
          "time": null
        }
      ]
    }
  ]
}