{
  "title": "Help me find how the RFID copier writes the values in the tag",
  "link": "https://reverseengineering.stackexchange.com/questions/33250/help-me-find-how-the-rfid-copier-writes-the-values-in-the-tag",
  "content": "At first it may seems that it uses ascii but the values don't match.\nThe numbers 1-15 seem to written in the first nibble(without knowing what the rest bits mean)\nFor higher values i don't have a clue.\n\nThe data received seems to be correct because the header is always right.\n\nBefore the header and after the data received there are many zeros.\n\nI don’t have any information on the RFID writer I use. Is a generic Chinese with no documentation. The tag is the EM4305. And the reader I use is based on EM4095 in read only config.\n\n",
  "votes": "0",
  "answers": 1,
  "views": "54",
  "tags": [
    "encodings",
    "serial-communication",
    "protocol"
  ],
  "user": "arisk4",
  "time": "Oct 7, 2024 at 18:41",
  "comments": [
    {
      "user": "jsotola",
      "text": "when dealing with binary data, stop using decimal notation ... use hexadecimal or binary notation ... keep the decimal values only as comments",
      "time": null
    },
    {
      "user": "arisk4",
      "text": "@jsotola the decimals are just number I put to the RFID writer to write in the tag. The keypad has only decimals.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Investigating the values you show I assume this encoding, with bit numbered from 15 (the left most) to 0 (the right most).\n\n",
      "votes": "0",
      "user": "the busybee",
      "time": "Oct 7, 2024 at 12:17",
      "is_accepted": true,
      "comments": [
        {
          "user": "arisk4",
          "text": "I think that make sense!!! the tags memory is 32 bits for each address, but I posted only the 16bits because the rest was zero. Ill do more tests with bigger numbers (the rfid copier can write up to 10 digits number). An interesting fact is that when I put 9999999999(10 digits of 9) it doesn't let me maybe it has something to do with the memory...",
          "time": null
        },
        {
          "user": "the busybee",
          "text": "@arisk4 (32 bits - 4 XOR bits) / 5 bits per 4-bit data = 5 4-bit groups, giving you a maximum of 2^20 - 1 = 1048575. You might want to check that this value works, and 1048576 does not. You can try powers of 2 to find the actual usable width. -- If you extend your question with more and bigger values, I will extend my answer.",
          "time": null
        }
      ]
    }
  ]
}