{
  "title": "What is this file format? First byte 0x04, found in Macintosh environment circa 2001",
  "link": "https://reverseengineering.stackexchange.com/questions/33282/what-is-this-file-format-first-byte-0x04-found-in-macintosh-environment-circa",
  "content": "Example file: https://imagej.net/nih-image/download/user-macros/Inclusion%20Counter/Inclusion%20Counter%20Manual%20v1.0.html\n\nNeedless to say, it is not an HTML file.\n\nFirst byte is 0x04, which it shares with several other files I have in this format. Otherwise there appears to be no common signature other than perhaps 0039 0039 0039 0039 0039 0039 at offset 22 and 0002001C58B1000A at offset 88.\n\nIt appears to be a composite or container format that can include data in blocks, for example it can include plain text or image data in a variety of formats, such as GIF.\n\nI see many four-byte human-readable tags such as MLIP, DSET, FNTM, CUTS, DSUM, HDNI, STYL, 8BIM, HASH, LKUP, NAME, CELL, RULR, GRPH, but I am unsure of their purpose, as they do not all seem to introduce blocks of embedded data. At the end of the file are two font names in plain text, Helvetica and Geneva.\n\nThe files are from a Macintosh environment in 2001 and 2002. Unfortunately their resource forks have not survived. I found them alongside Microsoft Excel files (Compound Documents format) and FileMaker Pro 5.x (or 6) files.\n\nI tried opening these files in Excel (also Word and PowerPoint) from MS Office 98 for Mac on a G3 running OS 9.2. No luck - \"unknown file format\" or something like that.\n\n",
  "votes": "1",
  "answers": 2,
  "views": "72",
  "tags": [
    "file-format"
  ],
  "user": "njahnke",
  "time": "Oct 25, 2024 at 18:59",
  "comments": [
    {
      "user": "jsotola",
      "text": "en.m.wikipedia.org/wiki/List_of_file_signatures",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "AppleWorks / ClarisWorks version 4\n\nThe ASCII text BOBO is visible at index 4.  The Wikipedia article for AppleWorks notes:\n\nHere's a project hosted on Github with a format description: https://github.com/teacurran/appleworks-parser/blob/master/docs/header.adoc\n\nThe normal file extension is .cwk\n\nLibreOffice has support for ClarisWorks files - If you rename the file with a .cwk extension, then it will open it.\n\n",
      "votes": "1",
      "user": "matja",
      "time": "Oct 25, 2024 at 23:45",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "matja's answer cracked the case for me. My other files in this format replace the BOBO string with CWKJ which threw me off. Maybe I should have known that CWKJ stands for the Japanese version of ClarisWorks. I was able to open these CWKJ files in the Japanese version of AppleWorks 6 (running under the Japanese version of Mac OS 9.2 in a SheepShaver VM) and save them as AppleWorks 6 documents, then open them in LibreOffice as suggested by matja.\n\n",
      "votes": "1",
      "user": "njahnke",
      "time": "Oct 26, 2024 at 20:47",
      "is_accepted": false,
      "comments": []
    }
  ]
}