{
  "title": "Modifying CreationFlags in CreateProcessA with OllyDBG2 with CREATE_SUSPENDED",
  "link": "https://reverseengineering.stackexchange.com/questions/33305/modifying-creationflags-in-createprocessa-with-ollydbg2-with-create-suspended",
  "content": "I am trying to attach the OllyDBGv2 debugger to an external program that is created by CreateProcessA found in a win32 based binary but I strongly suspect that the process is created/ran and terminated too quickly for OllyDBG to actually attach even if I turn on the option to attach to child process using the Options>Debugging found in OllyDBv2\n\nI have a found the callsite in the parent process and it appears in the main window of OllyDBG that the creationFlags is actually a value of 0, and the arguments in the stack prior to the instruction is actually PUSH EBX's only with no value. Thus it appears that the new process is created with no flags and is independant of the parent process.\nI had an idea to modify the creationFlags to set a value of CREATE_SUSPENDED(0x00000004) in order to force it to create the process in the suspended state so I can attach another instance of OllyDBGv2 to it and continue debugging.\n\nNormally I would expect to see a MOV instruction with the correct value to the register before but here appears to be PUSH EBX only. I've attached a picture to illustrate the issue.\n\nI have tried to modify the REGISTERS directly (labeled as 1) and then resume the execution of the debugger but by then the instruction in EBX is setting the ApplicationName? (also empty). Thus I don't think that modification corresponds to the CreateFlags argument.\n\nI have also tried to modify the value seen in Memory (labeled as 2) but it doesn't seem to accept it?\n\nThe ultimate goal is to essentially pause the current debugging process on the parent and switch over to the newly launched process and work on that until it terminates.\n\nWhere is the correct place to modify the creationFlags argument in this instance? Also is there another flag that is better than that one (potentially DEBUG_ONLY_THIS_PROCESS?)\n\nThanks for any help\n\n\n\n",
  "votes": "1",
  "answers": 1,
  "views": "53",
  "tags": [
    "debugging",
    "ollydbg",
    "binary-editing"
  ],
  "user": "Sevren",
  "time": "Nov 9, 2024 at 12:28",
  "comments": [],
  "answers_data": [
    {
      "content": "Right click in stack window.\nYour label 2\nHit modify if there and modify the 0 to 4\n\nOr follow in dump and edit  ctrl +e and change the 0 to 4\n\nBefore stepping into create process\n\nThe process should be created suspended\n\nAttach another instance to the suspended process.\n\n",
      "votes": "1",
      "user": "blabb",
      "time": "Nov 9, 2024 at 13:37",
      "is_accepted": true,
      "comments": []
    }
  ]
}