{
  "title": "Extracting NES roms from a modern Famiclone",
  "link": "https://reverseengineering.stackexchange.com/questions/33350/extracting-nes-roms-from-a-modern-famiclone",
  "content": "Somewhat recently FiveBelow started selling \"fancy\" famiclones branded under Vivitar. It's styled to look like an old CRT TV.\n\nA video for those curious.\n\nIntrigued in the possibilities for hardware hacking, I picked one up myself. Although because of the low quality of the PCB I ended up accidentally destroying it soon after due to lifting multiple pads. Oops.\n\nBut hey, it didn't die completely in vain because not only did I dump it's flash chip (which contains the games), but I also managed to de encapsulate the IC!\n\nHere's the firmware dump.\n\nBut unlike that Coleco Head-to-Head plug and play I decapped, this modern famiclone is SIGNIFICANTLY more complex! The former was little more then an NES and accompanying cartridge crammed down into two chips, but the latter is on par with mid range microcontrollers!\n\nThis is a problem, because the firmware dump I have looks like absolute nonsense to me. Not even a single ASCII string in sight!\n\nI also haven't found any part numbers on the NOAC silicon die, so I can't find a lead that way.\n\nAny help would be appreciated!\n\n",
  "votes": "0",
  "answers": 1,
  "views": "88",
  "tags": [
    "firmware-analysis"
  ],
  "user": "qwerty keyboard",
  "time": "Dec 20, 2024 at 2:57",
  "comments": [],
  "answers_data": [
    {
      "content": "I would like to give a massive shoutout and thank you to \"NewRisingSun\" who is knowledgeable about these modern Chinese famiclones. They managed to figure out the \"\"\"\"encryption\"\"\"\" used by the rom, and it works in their VTxx \"onebus\" emulator \"NintendulatorNRS\".\n\nSeriously, without them I would've never figured it out!\n\n",
      "votes": "-2",
      "user": "qwerty keyboard",
      "time": "Dec 29, 2024 at 16:45",
      "is_accepted": false,
      "comments": [
        {
          "user": "the busybee",
          "text": "And what is the answer to solve your issue?",
          "time": null
        }
      ]
    }
  ]
}