{
  "title": "Cross-referencing object fields",
  "link": "https://reverseengineering.stackexchange.com/questions/3387/cross-referencing-object-fields",
  "content": "I'ld like to see which functions are operating with certain object's fields that I already processed, meaning I created the structure and assigned it to the correct places in the functions in IDA, without having to run a dynamic debugger. (for example, I would like to see a list of the functions accessing/writing/reading the Foo data field of the Bar object), but as far as I know it's not implemented in IDA. \n\n",
  "votes": "1",
  "answers": 2,
  "views": "787",
  "tags": [
    "ida",
    "ida-plugin",
    "idapython",
    "struct"
  ],
  "user": "Dominik Antal",
  "time": "Jan 7, 2014 at 13:58",
  "comments": [],
  "answers_data": [
    {
      "content": "IDA has been able to show cross-references to structure members since version 6.2:\n\n\n\n",
      "votes": "3",
      "user": "Jason Geffner",
      "time": "Jan 7, 2014 at 14:10",
      "is_accepted": true,
      "comments": [
        {
          "user": "Dominik Antal",
          "text": "You need to have HexRays decompiler plugin for this, right?",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "No. Just regular IDA Pro. Hex-Rays isn't required.",
          "time": null
        }
      ]
    },
    {
      "content": "Unfortunately this IDA feature doesn't always work as needed especially if you define your objects in Hex-Rays.\n\nIf your problem is around using Hex-Rays, you can use the XRefs plugin with the hexrays-python API in IDA 6.4.\n\nAs far as I understand latest version of IDAPython with support of IDA 6.5 at\ngoogle code already contains these bindings in IDA API module, but it is not fully operational yet (at least I'm not succeeded to make it work). \n\n",
      "votes": "3",
      "user": "perror",
      "time": "Jan 8, 2014 at 0:25",
      "is_accepted": false,
      "comments": []
    }
  ]
}