{
  "title": "What tools exist for excavating data structures from flat binary files?",
  "link": "https://reverseengineering.stackexchange.com/questions/3495/what-tools-exist-for-excavating-data-structures-from-flat-binary-files",
  "content": "I have a file composed entirely of data structures; I've been trying to find a tool that will enable me to open this file, and declare (perhaps) a type and offset such that i may work with the presumed primitive data type individually.\n\ne.g. I declare the 4 bytes located at offset 0x04 to be a 32-bit unsigned integer, and would like to inspect the value at this location (read as big-endian perhaps) and then work with this integer individually (perhaps see what it looks like encoded as a 4-byte ascii string and attempt to read it, etc.)\n\nI have a 4096 byte file containing C-structs with member elements as integers ranging from 16-64 bits in length; the following is an example:\n\n```\nstruct my_struct {\nuint_32 magic\n} // sizeof(my_struct) == 0x04\n\n```\nIn this case, magic = 'ball', and so when the file is opened in a text editor it reads as 'llab...', and obviously can also be represented as a 32-bit integer\n\nIs there a tool that enables static analysis of flat data structure files?\n\nI've considered writing a command line tool in Python to do this, but if something already exists I'd prefer to save time, and perhaps learn more about this topic by using a tool designed by someone more experienced. If it seems to you that I am going about this incorrectly (this is my first serious exploration into this kind of reversing) please guide my understanding, thanks.\n\nGoogled 'reverse engineering tools' and browsed the links\n\nChecked wikipedia's reverse engineering pages\n\nTried some first principles reasoning\n\nChecked pypi\n\nThere are three completely valid and correct answers, but I've marked the most detailed and least expensive of them as correct, because it is the most accessible to members of the community reviewing this question.\n\n",
  "votes": "23",
  "answers": 5,
  "views": "11k",
  "tags": [
    "disassembly",
    "tools",
    "static-analysis"
  ],
  "user": "gal",
  "time": "Jun 17, 2020 at 9:54",
  "comments": [
    {
      "user": "Dominik Antal",
      "text": "I guess you've tried IDA already. Check this link out, I'm not sure this is what you need though.",
      "time": null
    },
    {
      "user": "oliver",
      "text": "probably related: stackoverflow.com/questions/492751/…",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "010 Editor's Binary Templates feature is ideal for this type of work. It not only supports static struct definitions, but also allows for dynamically sized struct fields and supports a powerful scripting language.\n\n\n\n\n\n",
      "votes": "13",
      "user": "Jason Geffner",
      "time": "Jan 20, 2014 at 14:13",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "I use Hex Workshop for this. It has a bunch of useful flat-file reversing features, but my favourite is that it lets you declare structures in C-style syntax and load them on top of a file. It's not free, but it's more than worth the $90 price tag.\n\nFeatures I find most useful:\n\n",
      "votes": "6",
      "user": "Polynomial",
      "time": "Jan 20, 2014 at 10:14",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "IDA can be used for working with data-only files. You can convert bytes to data items (bytes/words/dwords/qwords/floats/strings etc.), group them into structures or arrays (or arrays of structures), represent integers as offsets, add names and comments and so on.\n\nHere's an example of some random BMP file represented in IDA:\n\n```\n0000 BmHeader     db 'BM'     ; Signature\n0002              dd 146h     ; Size\n0006              dw 0\n0008              dw 0\n000A              dd offset pixel_array ; offset to image data\n000E ; DIB header\n000E              dd 40       ; size of this header\n0012              dd 33       ; bitmap width\n0016              dd 33       ; bitmap height\n001A              dw 1        ; number of color planes\n001C              dw 1        ; bits per pixel\n001E              dd 0        ; compression: none\n0022              dd 108h     ; size of image data\n0026              dd 4724     ; horizontal resolution (pixels per meter)\n002A              dd 4724     ; vertical resolution (pixels per meter)\n002E              dd 0        ; colors in the palette\n0032              dd 0        ; number of important colors\n0036 ; Color table\n0036              dd 0, 0FFFFFFh\n003E ; pixel data\n003E pixel_array  db 1, 73h, 13h, 6, 80h, 3 dup(0), 7Dh, 4Bh, 0E0h, 56h\n\n```\n",
      "votes": "4",
      "user": "Igor Skochinsky",
      "time": "Jan 20, 2014 at 12:25",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Hexinator\nhas a similar feature to binary templates of 010 Editor that is called a \"grammar\". It allows to insert numbers, strings, structs, and binary blobs. If that's not enough, it has scripting capabilities in Python and Lua.\n\nThe values can then be edited nicely (e.g. in decimal instead of hex). The hex area can be highlighted.\n\nDrawbacks:\n\nAt the time of writing it seems to have issues with more than one open grammar + one open file. When opening a second file for the same grammar, it crashed. Save early and save often.\n\nScreenshot of a partially analyzed file:\n\n\n\n",
      "votes": "3",
      "user": "tripleee",
      "time": "Jul 30, 2024 at 8:24",
      "is_accepted": false,
      "comments": [
        {
          "user": "jumpjack",
          "text": "this is the only free one supporting structures! But I have yet to figure out how to install them: \"download\" menu item does not work, and I see no option to load a grammar from disk. But if I double-click a .grammar file, it looks like it gets \"installed\"...",
          "time": null
        },
        {
          "user": "Thomas Weller",
          "text": "@jumpjack: do you have such a menu: i.sstatic.net/3x39O.png ? Other than that, it's not exactly free. Many features require a license after the trial period expires.",
          "time": null
        },
        {
          "user": "jumpjack",
          "text": "A grammar appears in the dropdown list only if I double click a .grammar file in explorer; else I only have the option to CREATE a grammar.",
          "time": null
        }
      ]
    },
    {
      "content": "I use my Binary Editor for this kind of task\nhttp://www.nyangau.org/be/be.htm\n\n",
      "votes": "2",
      "user": "Andy Key",
      "time": "Dec 11, 2014 at 12:03",
      "is_accepted": false,
      "comments": []
    }
  ]
}