{
  "title": "Is there any tool to quantitatively evaluate the difference of binary?",
  "link": "https://reverseengineering.stackexchange.com/questions/3507/is-there-any-tool-to-quantitatively-evaluate-the-difference-of-binary",
  "content": "I know some binary diff tool like VBinDiff and others.\n\nCurrently I have a large number of binary, around 500.\n\nSo I am looking for a binary tool to quantitatively evaluate the difference of binaries..\n\nLike evaluate the difference of binary 10 and binary 100 is 56%. Difference of binary 50 and binary 200 is 78%.\n\nIs there any tool like this? \n\nThank you!\n\n",
  "votes": "7",
  "answers": 4,
  "views": "2k",
  "tags": [
    "binary-analysis",
    "bin-diffing"
  ],
  "user": "lllllllllllll",
  "time": "Sep 30, 2016 at 21:59",
  "comments": [],
  "answers_data": [
    {
      "content": "You may want to give a try to ssdeep:\n\n",
      "votes": "6",
      "user": "jvoisin",
      "time": "Jan 21, 2014 at 17:37",
      "is_accepted": false,
      "comments": [
        {
          "user": "lllllllllllll",
          "text": "Hi jvoisin,Thank you for your answer! So tools like VBinDiff can highlight all the different bytes in hex, and I am thinking to find a tool to sum up all the highlighted bytes, thus can get the number of different bytes... Do you know certain tools like this..?",
          "time": null
        },
        {
          "user": "lllllllllllll",
          "text": "Hi jvoisin, I finally find out how to do it, I write it down.",
          "time": null
        }
      ]
    },
    {
      "content": "Here is my solution.\n\n",
      "votes": "3",
      "user": "perror",
      "time": "Jan 21, 2014 at 22:01",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "Given that you're looking to compare ~500 binaries to each other, what you really want is VxClass.\n\nUnfortunately, Zynamics/Google is no longer selling VxClass. If anyone knows of a way to buy it or download it though, feel free to share the information here.\n\n",
      "votes": "3",
      "user": "Jason Geffner",
      "time": "Jan 22, 2014 at 1:12",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jason Geffner",
          "text": "BTW, you probably could reimplement VxClass's functionality via BinDiff/DarunGrim/etc. and custom code, but it would be non-trivial.",
          "time": null
        },
        {
          "user": "newgre",
          "text": "zynamics@google employee here: unfortunately there is no way to buy vxclass and I don't think that will change in the future.",
          "time": null
        }
      ]
    },
    {
      "content": "This is probably a bit further outside the normal reverse engineer's toolchest, but still a possibility. Courgette is the codename of the update mechanism behind Chromium and thus Chrome. Quote:\n\nOf course this is limited by the number of CPU architectures. You didn't state your requirements (unless it was written with invisible pixels ;))\n\n",
      "votes": "3",
      "user": "0xC0000022L",
      "time": "Jan 22, 2014 at 11:43",
      "is_accepted": false,
      "comments": []
    }
  ]
}