{
  "title": "Difference Between Binary Exploitation and Reverse Engineering?",
  "link": "https://reverseengineering.stackexchange.com/questions/3550/difference-between-binary-exploitation-and-reverse-engineering",
  "content": "I am a beginner in Reverse Engineering and am trying to improve my skill by participating in any CTF's I can and solving CrackMe's. I am trying to find out why Binary Exploitation and Reverse Engineering are always separated as two different topics.\n\nMy Question is simple:\n\n",
  "votes": "4",
  "answers": 1,
  "views": "3k",
  "tags": [
    "ida",
    "ollydbg",
    "binary-analysis"
  ],
  "user": "bi0s.kidd0",
  "time": "Jan 25, 2014 at 11:34",
  "comments": [
    {
      "user": "bi0s.kidd0",
      "text": "Exact Duplicate of : security.stackexchange.com/q/49320/37911 which also is posted by me.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Yes, it is different. Binary exploitation intended to change behaviour of the binary, and reverse engineering intended to understand how it works.\n\nBInary exploitation requires some reverse engineering, reverse engineering doesn't necessarily requires binary exploitation.\n\nThe best example I know about it is overcoming DRM protections of media content.\nIt requires a lot of reverse engineering and almost not requires binary exploitation.\n\n",
      "votes": "5",
      "user": "w s",
      "time": "Jan 25, 2014 at 11:41",
      "is_accepted": true,
      "comments": [
        {
          "user": "bi0s.kidd0",
          "text": "So writing patches and cracking licenses is actually binary exploitation and includes reverse engineering just so to know which part of the code should be patched? Besides this is there any other area which reverse engineering is used? The example you gave is way over my head even after trying to read about it.",
          "time": null
        },
        {
          "user": "w s",
          "text": "Cracking licenses is not always binary exploitation: for example all keygenme riddles do not require binary exploitation at all. You need reverse engineering as ability to understand how to exploit something. You also need reverse engineering when you trying to reproduce some functionality.",
          "time": null
        },
        {
          "user": "bi0s.kidd0",
          "text": "Can you give me another example when Binary Exploitation is used?",
          "time": null
        },
        {
          "user": "w s",
          "text": "Everywhere you need to exploit the binary, which means change behavior of the specific program to do something that it was not supposed to do.",
          "time": null
        }
      ]
    }
  ]
}