{
  "title": "Strange behaviour of Wine dlls under OllyDbg [duplicate]",
  "link": "https://reverseengineering.stackexchange.com/questions/3553/strange-behaviour-of-wine-dlls-under-ollydbg",
  "content": "I've noticed something strange. OllyDbg seems to correctly load Wine's own dlls. But when I check PE header in OllyDBG it differs from that what I would expect. In all other cases file content is an exact match of PE header in OllyDbg. But in case of Wine libraries even the file signature is different.\n\nFirst three bytes in file: \n4D 5A 40\nOllyDbg memory dump: \n4D 5A 90\n\nThen the rest of loaded library differs as well. I did not notice such behaviour with few Windows dlls that I have checked. Googling didn't help either. Does anybody know what's going on?\n\nExample of differences\n\nin file - OllyDbg PE header\n\nDOS_PEOffset 60 - 40\n\nNumber of Sections 3 - 2\n\nOllyDbg seems to be able to read exported Wine dll symbols despite of my own file analysis expecting Export Table RVA and Export Table Size to be 0. Please note that my own analysis works correctly on normal Windows dll files.\n\nAbove differences are from oleaut32.dll, but I’ve noticed similar when checking other Wine dlls. Location of Wine dlls:\n~/.wine/drive_c/windows/system32 \n\nI'm using wine-1.4.1 and OllyDbg 2.01.\n\n",
  "votes": "2",
  "answers": 1,
  "views": "437",
  "tags": [
    "ollydbg",
    "dll",
    "wine"
  ],
  "user": "ruby_object",
  "time": "11 years ago",
  "comments": [
    {
      "user": "ruby_object",
      "text": "It's not a duplicate, but related question. I still do not understand how loaders work, but my previous question was about parts of Imports table being overwritten by the loader. In this case very beginning of PE header differs from that on file. does Wine's loader have to do anything with it?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "As far as we can see from Wine's loader codes\nhttps://github.com/mirrors/wine/blob/master/libs/wine/loader.c\n\n```\ndos->e_magic    = IMAGE_DOS_SIGNATURE;\ndos->e_cblp     = 0x90;                           <-- hardcoded 0x90 val\ndos->e_cp       = 3;\ndos->e_cparhdr  = (sizeof(*dos)+0xf)/0x10;\ndos->e_minalloc = 0;\ndos->e_maxalloc = 0xffff;\ndos->e_ss       = 0x0000;\ndos->e_sp       = 0x00b8;\n\n```\nI dont know, but maybe WINE processes section with IMAGE_SCN_MEM_DISCARDABLE flag ( which is used only in r0 drivers in Windows ), so when you are standing on EntryPoint - those sections are not mapped already ?\n\n",
      "votes": "3",
      "user": "helloworld",
      "time": "Jan 28, 2014 at 11:41",
      "is_accepted": false,
      "comments": []
    }
  ]
}