{
  "title": "Turning Technologies RF receiver",
  "link": "https://reverseengineering.stackexchange.com/questions/3637/turning-technologies-rf-receiver",
  "content": "At my university we're required to purchase these RF clickers with an lcd screen so professors who choose to take attendance can do so in an automated fashion, and occasionally administer simple quizzes without having to take time to grade them. The clicker costs about $50, so I thought, why not buy a receiver and write some code to interface with it and do cool things if I've already got half the hardware?\n\nResearch turned up the receiver unit with no price listed, but some quick amazon and ebay checks revealed the going rate to be about $400 which is well outside the range that I as a student am willing to spend to hack on some hardware, no matter how cool.\n\nIs there an alternate generic receiver module I could look into, something in the $10-$30 range? Is the signal employed by this particular clicker encrypted so I cannot access it anyway? $50 on the clicker is a fortune to spend as a student on a piece of technology that will essentially turn into a brick once I graduate.\n\nAre there any resources out there that can provide any information on the signal and how I could extract meaningful data? I'm looking to be able to read clicker ID and responses, and hack together a controller for my laptop or a simple voting system I can use with my friends to mediate movie choices and meal debates.\n\n",
  "votes": "6",
  "answers": 1,
  "views": "2k",
  "tags": [
    "hardware",
    "decryption",
    "security"
  ],
  "user": "Cyclone",
  "time": "Feb 7, 2014 at 3:30",
  "comments": [
    {
      "user": "Cyclone",
      "text": "Unable to create new tags presently but I feel 'signal analysis' would be an apt tag for this question.",
      "time": null
    },
    {
      "user": "D. Woods",
      "text": "There appears to be DIY Arduino receiver option out there: github.com/nickmooney/turning-clicker/blob/master/…",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can build your own USB RF receiver fairly cheaply, for example:\n\nhttp://hackaday.com/2012/03/20/software-defined-radio-from-a-usb-tv-capture-card/\n\nThis might be a good starting point, run the usb receiver, sniff the RF, press some buttons and see what happens :)\n\n",
      "votes": "3",
      "user": "fileoffset",
      "time": "Feb 7, 2014 at 3:58",
      "is_accepted": false,
      "comments": [
        {
          "user": "fileoffset",
          "text": "Admittedly I don't see the frequency range the clicker uses, maybe if you can find a manual online for the receiver?",
          "time": null
        },
        {
          "user": "Cyclone",
          "text": "Any chance for a pre-assembled unit? I'm not great with circuitry and don't have the proper tools at school",
          "time": null
        },
        {
          "user": "Cyclone",
          "text": "Addendum: I looked for a manual and can't seem to locate one with any sort of tech specs, seems they've got their tech locked down",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "Regarding the frequency, see reverseengineering.stackexchange.com/a/2985/1562",
          "time": null
        },
        {
          "user": "Cyclone",
          "text": "Found the frequency! 2401.0 - 2482.0 MHz, great tip @JasonGeffner",
          "time": null
        }
      ]
    }
  ]
}