{
  "title": "help in finding a specific function of a game",
  "link": "https://reverseengineering.stackexchange.com/questions/3707/help-in-finding-a-specific-function-of-a-game",
  "content": "After playing around with pointers I'm trying to get the address of a specific function in a game. this function prints player input to the screen and broadcasts it to all online players since it's a multiplayer game. One can say that it's a chat.\n\nI have really no clue how to find the address because I got no real entry point. Any clues are much appreciated.\n\nMy goal is to call this chat function within a simple Dll.\n\nI'm using OllyDbg if this matters.\n\n",
  "votes": "2",
  "answers": 2,
  "views": "4k",
  "tags": [
    "ollydbg"
  ],
  "user": "user3183815",
  "time": "Feb 17, 2014 at 19:49",
  "comments": [],
  "answers_data": [
    {
      "content": "The usual approaches to this:\n\n",
      "votes": "7",
      "user": "nrz",
      "time": "Feb 26, 2014 at 14:43",
      "is_accepted": false,
      "comments": [
        {
          "user": "user3183815",
          "text": "Hello and thanks for your reply. Sorry for the late answer - been very busy. I tried to follow your approaches and came to the result, that nothing really was working for me. The game's called GTA San Andreas and the dll of the multiplayer mod SA:MP is loaded straight into the gta_sa process.  1. input string showed up not completely, the last character was cut off and I actually don't know why. WSA functions (send, recv, connect) are located in the gta_sa module which is some kind of a joke because it's a offline game with no possibilities to do anything online if you don't use the mod.",
          "time": null
        },
        {
          "user": "user3183815",
          "text": "However I tried to breakpoint it - didn't even trigger. I was exploring the use of the packets, how they are send and what is send. I came to the result that these packets have been encrypted and send via UDP but I did not found anything in the dll module about WS. Quite confusing. Looking to hear from you.",
          "time": null
        },
        {
          "user": "higaki",
          "text": "The packet-related functions you want to hook should be located in ws2_32.dll or wsock32.dll. The packets being encrypted and sent by UDP is normal and what I would expect from a multiplayer game, especially if they're using a peer-to-peer model. Hook/BP send/sendto/WSASend/WSASendTo in the dll's I mentioned, then trace back and attempt to reverse engineer the packet encryption process.",
          "time": null
        }
      ]
    },
    {
      "content": "user3262342 gave a good answer; you can also try setting breakpoints on the following common text-drawing functions and then look at the callstack to see what function in your program drew the text:\n\n",
      "votes": "5",
      "user": "Jason Geffner",
      "time": "Feb 18, 2014 at 0:37",
      "is_accepted": false,
      "comments": [
        {
          "user": "user3183815",
          "text": "Very useful, thanks. Going to try this now.",
          "time": null
        }
      ]
    }
  ]
}