{
  "title": "\\??\\C:\\ Question Marks in Paths",
  "link": "https://reverseengineering.stackexchange.com/questions/3798/c-question-marks-in-paths",
  "content": "I often come across paths similar to \\??\\C:\\Windows when looking in memory.  I have been unable to understand why the double '?' is appended to some paths. My google-fu is failing me with the ability to find a reason for the double '?'.Any assistance would be appreciated.\n\n",
  "votes": "7",
  "answers": 2,
  "views": "7k",
  "tags": [
    "windows",
    "memory"
  ],
  "user": "user4089",
  "time": "Apr 18, 2017 at 16:33",
  "comments": [],
  "answers_data": [
    {
      "content": "From Windows Internals, Part 1 (6th Edition) --\n\n",
      "votes": "5",
      "user": "Jason Geffner",
      "time": "Jan 13, 2018 at 19:02",
      "is_accepted": true,
      "comments": [
        {
          "user": "Alec Wenzowski",
          "text": "-1 this does not answer the question and should not be the accepted answer. OP asked about \\??` and not \\\\?`",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "You're absolutely right. I wasn't able to delete my answer because it was already marked as accepted, but I edited it to reflect the correct answer.",
          "time": null
        }
      ]
    },
    {
      "content": "I have been searching for an answer to this question for a while and I know this question is years old but on the off chance someone else comes across this question I will leave my response here. \n\nThe above answer is referring to non-canonicalized device paths where as you are asking about \\??\\ not \\\\?\\ there may only be a small difference in the question but the answer is completely different.\n\n\\?? is a \"fake\" prefix which refers to per-user Dos devices, so here is an image that will hopefully help you understand what the process is: \n\nSome definitions that may help you understand:\n\n",
      "votes": "14",
      "user": "woffles2.0",
      "time": "Apr 18, 2017 at 9:22",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jem Tucker",
          "text": "This should be accepted as the correct answer",
          "time": null
        },
        {
          "user": "Paul",
          "text": "Why's the \"Blah\\..\\\" there in the orange box?",
          "time": null
        }
      ]
    }
  ]
}