{
  "title": "Binary file search tools [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/3947/binary-file-search-tools",
  "content": "Is there a open-source Linux tool / utility for Linux platform that would recursively search for binary files (executable, shared / static objects, etc), in a folder and display?\n\n",
  "votes": "1",
  "answers": 1,
  "views": "355",
  "tags": [
    "tools",
    "linux"
  ],
  "user": "ThrivingWithLinux",
  "time": "11 years ago",
  "comments": [
    {
      "user": "w s",
      "text": "What do you mean by binary file ? Is, for an instance, mp3 music file binary ?",
      "time": null
    },
    {
      "user": "ThrivingWithLinux",
      "text": "I have mentioned in the parenthesis: executable, shared / static objects, etc. I am not interested in .mp3 or .ogg or .gif or .jpeg :).",
      "time": null
    },
    {
      "user": "perror",
      "text": "This question appears to be off-topic because it is about basic Unix shell commands. Not about reverse-engineering.",
      "time": null
    },
    {
      "user": "ThrivingWithLinux",
      "text": "@perror, I believe, answer to the question helps to begin reverse-engineering a binary knowing that it belongs to 'a' architecture and one can process the binary alive on a compatible virtual or physical platform, the answer very much helps in disassembly or decompilation, it definitely helps to begin with, \"...explore the principles of a system through analysis of its structure, function, and operation ...\", so what if it is a basic Unix Shell Command?, requesting you to review your opinion, it is not necessary that only experts visit here.",
      "time": null
    },
    {
      "user": "perror",
      "text": "Your question is way to basic and weak compared to the scope of this website. It could have been covered in Unix & Linux or in SO with no problem.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "When looking for files containing executable code in a well known format, you could search using find and file:\n\n```\nfind . -type f -print0 | xargs -0 file | grep -i \"i386\\|x86\\|arm\\|ar archive\"\n\n```\nThis will get you all files which file labeled with the processor name for i386, x86 or arm.\n\nNote that there are many filetypes which file does not recognize.\nIt will for instance not recognize java jar files, or android apk files as executable.\nNor will it recognize raw firmware images.\n\nWhat I actually usually do when researching an unknown system:\n\n",
      "votes": "3",
      "user": "Willem Hengeveld",
      "time": "Mar 25, 2014 at 9:29",
      "is_accepted": true,
      "comments": [
        {
          "user": "w s",
          "text": "This will not find static libraries. You should add \"i386\\|x86\\|arm\\|ar\\ archive\"",
          "time": null
        }
      ]
    }
  ]
}