{
  "title": "Is there any Dynamic Binary Instrumentation frameworks for Windows exposing an Intermediate Representation?",
  "link": "https://reverseengineering.stackexchange.com/questions/4003/is-there-any-dynamic-binary-instrumentation-frameworks-for-windows-exposing-an-i",
  "content": "There are some excellent DBI frameworks for Windows (Intel PIN, DynamoRIO...) but unfortunately none of them expose an IR afaik.\nI am looking for something like Valgrind's VEX that works on Windows.\n\nAny pointers / references would be greatly appreciated. Thanks in advance!\n\n",
  "votes": "6",
  "answers": 3,
  "views": "945",
  "tags": [
    "windows",
    "dynamic-analysis"
  ],
  "user": "Carlos Garcia",
  "time": "Apr 1, 2014 at 13:04",
  "comments": [],
  "answers_data": [
    {
      "content": "If you are searching for lifting assembly to IR,\nlook at either BAP or RevGen.\n\nEdit 2018: There is also great McSema (supports x86, x64 and aarch64).\n\n",
      "votes": "3",
      "user": "w s",
      "time": "Feb 28, 2018 at 6:39",
      "is_accepted": true,
      "comments": [
        {
          "user": "Carlos Garcia",
          "text": "This may be what I was looking for. I always avoided BAP since it is written in OCAML but I guess I'll have to check it out nevertheless.",
          "time": null
        },
        {
          "user": "Carlos Garcia",
          "text": "On a closer look, it does not seem that BAP supports Windows. Any experiences with compiling this on a Windows OS?",
          "time": null
        },
        {
          "user": "Carlos Garcia",
          "text": "Nevermind, it accepts PE files as input. Suboptimal for my purposes but it'd make do. Sorry for the little self-chat here.",
          "time": null
        }
      ]
    },
    {
      "content": "dynamoRIO does expose an IR (see documentation).\nThere is just no \"written textual\" form of it, it is basically a 1:1 mapping of the underlying assembly language and thus very close to the underlying architecture.\n\n",
      "votes": "3",
      "user": "newgre",
      "time": "Apr 1, 2014 at 13:48",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Intel's Pin is probably what you want.\n\nMicrosoft's Vulcan is great, but I don't think it was ever released publicly, at least not in a standalone form.\n\n",
      "votes": "1",
      "user": "Jason Geffner",
      "time": "Apr 1, 2014 at 13:31",
      "is_accepted": false,
      "comments": [
        {
          "user": "Carlos Garcia",
          "text": "Intel Pin would be my DBI framework of choice but I could not find any reference to an IR similar to VEX.",
          "time": null
        }
      ]
    }
  ]
}