{
  "title": "How does WinLoad.exe load the rest of the operating system?",
  "link": "https://reverseengineering.stackexchange.com/questions/4145/how-does-winload-exe-load-the-rest-of-the-operating-system",
  "content": "I have disassembled the file WinLoad.exe as a 32-bit PE for i386 ISA, and I'll show some of the instructions I do not get are for:\n\n```\ncall   0x00408b6d <---\n\ntest   al,al \n\nje     0x0040109f \n\nlea    eax,[esp+0x20] <--- \n\n```\nFirst of all, what is at the memory address the call instruction is at? Second, what is the leave instruction do?\n\n```\ncmp    BYTE PTR [esp+0x12],0x0 <---\nmov    eax,DWORD PTR [esp+0x20]\nmov    DWORD PTR [esp+0x1c],eax\n\n```\nThird, how does the compare instruction make sense?\n\nLast, what does this do?\n\n```\nrep movs DWORD PTR es:[edi],DWORD PTR ds:[esi]  \n\n```\nAlso, how I can tell if this file is statically or dynamically linked? I mean, when executed, if it's statically linked it must've been compiled that way. If dynamic there must be other program running. Basically, this is suppose to be the first executable on boot of a PE.\n\n",
  "votes": "0",
  "answers": 1,
  "views": "775",
  "tags": [
    "disassembly",
    "assembly",
    "pe",
    "operating-systems"
  ],
  "user": "ba-sle",
  "time": "Apr 25, 2014 at 21:16",
  "comments": [
    {
      "user": "Jonathon Reinhart",
      "text": "You might consider getting more familiar with reverse engineering of x86 user-mode software before digging into bootloaders.",
      "time": null
    },
    {
      "user": "SSpoke",
      "text": "REP commands are always a type of loop that copies everything from one thing to another thing. like memcpy I usually use IDA PRO to figure out what each assembly instruction does. NOP alot of code at some address in some application and assemble which ASM you want to figure out then Press F5 and see what the code translates too in C for IDA PRO.",
      "time": null
    },
    {
      "user": "Milind R",
      "text": "winload.exe is NOT the first PE. bootmgr.exe is the first PE to run in the boot process of Windows NT6. See www.nvlabs.in/uploads/projects/vbootkit/nitin_vipin_vista_vbootkit.ppt . bootmgr.exe is embedded inside the file bootmgr that you can find on your system partition.",
      "time": null
    },
    {
      "user": "Milind R",
      "text": "@JonathonReinhart I think bootloaders are easier for people without much professional programming experience : they are simpler and not threaded.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The call instruction is nothing but a fancy jump to a location in the code. Usually, it's a basic block ending with a ret instruction, namely a function. So at the address 0x00408b6d, you'll find a function.\n\nThe lea instruction has nothing to do with the leave instruction. lea stands for 'load from effective address' meaning that the eax register will contain the value pointed out by the address in esp+0x20.\n\nIf you want to understand what's going on with the cmp and rep you should check these two links : cmp, rep. The explanations are clear and you'll know what flags are set and what happens when an instruction is executed.\n\nFor the remaining part I just couldn't guess what you tried to say and I prefer to ask you to provide more clarifications if possible. \n\n",
      "votes": "3",
      "user": "perror",
      "time": "Apr 26, 2014 at 13:41",
      "is_accepted": false,
      "comments": []
    }
  ]
}