{
  "title": "ARM shellcode for linux - svc 0 vs svc 1",
  "link": "https://reverseengineering.stackexchange.com/questions/4217/arm-shellcode-for-linux-svc-0-vs-svc-1",
  "content": "Checking out Linux ARM shellcode I see that the system call is made by using the svc 1 instruction. However, I have also seen examples where they use svc 0 as the instruction that calls the system call.\n\nEvidently, system calls in Linux on ARM can be performed using both svc 0 and svc 1. Why is this the case as opposed to architectures such as x86. Are the kind of interrupts generated by both these instructions the same?\n\n",
  "votes": "6",
  "answers": 1,
  "views": "7k",
  "tags": [
    "arm",
    "shellcode"
  ],
  "user": null,
  "time": "Apr 30, 2014 at 20:03",
  "comments": [
    {
      "user": "Vitaly Osipov",
      "text": "It's the same interrupt. The #imm parameter part (0, 1 etc) is ignored by Linux IIRC.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I suppose you should check this part of the ARM documentation, and this description of svc and its parameters. By cross referencing the two links you'll find an answer to your question.\n\nFrom the links above you'll be able to understand what the parameter of the svc instruction represents. It is supposed to be ignored by the CPU but the exception handler can use that parameter to determine the service being requested : ARM instruction if the value is between 0 & 16777215, or Thumb instruction if the value is between 0 & 255.\n\nThe thumb instruction set is a compact 16bit encoding for ARM instructions. It was mainly designed & implemented for compact code-density. You can check the Wikipedia page about the ARM architecture for more information, but I would recommend you going through the ARM documentation for accurate technical details.\n\n",
      "votes": "3",
      "user": "yaspr",
      "time": "May 2, 2014 at 11:23",
      "is_accepted": false,
      "comments": [
        {
          "user": "0xea",
          "text": "could you add a short answer derived from those links ?",
          "time": null
        },
        {
          "user": "yaspr",
          "text": "Here we go :done !",
          "time": null
        }
      ]
    }
  ]
}