{
  "title": "Alternative to CaptureBAT on Windows 7?",
  "link": "https://reverseengineering.stackexchange.com/questions/4294/alternative-to-capturebat-on-windows-7",
  "content": "I am working on some malware that currently only runs with Windows 7 is detected. I would like to use CaptureBAT, but it doesn't work on Windows 7 (with the exception of network monitoring). Is there an alternate to this that will capture deleted files? \n\nI imagine this will need to work at the Kernel leverl for API hooking as well. I have looked at a couple of alternatives including using PowerShell to monitor file changes (http://dereknewton.com/category/powershell/) and also to use the WMI process for logging data, but neither of them are a great solution and I want all captured files that the malware attempts to delete.\n\nDoes anyone know of a tool that will work on Windows 7 for this?\n\n",
  "votes": "3",
  "answers": 2,
  "views": "4k",
  "tags": [
    "tools",
    "malware"
  ],
  "user": "user3413087",
  "time": "May 8, 2014 at 12:43",
  "comments": [],
  "answers_data": [
    {
      "content": "Capture BAT is open-source. Why not just rebuild it for Windows 7?\n\nAnd based on my 10 seconds of skimming Capture BAT's described functionality, it seems that Process Monitor might be a viable alternative.\n\n",
      "votes": "1",
      "user": "Jason Geffner",
      "time": "May 8, 2014 at 13:33",
      "is_accepted": false,
      "comments": [
        {
          "user": "user3413087",
          "text": "First, I am not a coder so wouldn't know where to begin coding. Second, Process Monitor only observes the system as it runs and dues not capture deleted files of network pcaps",
          "time": null
        },
        {
          "user": "drum",
          "text": "You don't have to code anything. Just compile it under your own local machine.",
          "time": null
        }
      ]
    },
    {
      "content": "This is a kind of hackish method, but works.\n\nTry to run Rohitab API Monitor. This will monitor process creations. If a process is started you will be notified and able to catch its parameter and more :) \n\n",
      "votes": "0",
      "user": "Unc3nZureD",
      "time": "Feb 28, 2019 at 15:01",
      "is_accepted": false,
      "comments": []
    }
  ]
}