{
  "title": "OllyDbg and XMM0 vs MM0 registers",
  "link": "https://reverseengineering.stackexchange.com/questions/4362/ollydbg-and-xmm0-vs-mm0-registers",
  "content": "How can I view the XMM0-XMM7 registers within OllyDbg? I can right click on the registers window and go to view MMX registers, but I'm not exactly sure that these are the same. I see an instruction: MOVSS DWORD PTR DS:[ESI+8],XMM0 and as step through that instruction, the value shown in MM0 on the register window does not become the value stored at [ESI+8].\n\nSo, I suppose another question is: Are the XMM0 and MM0 registers different?\n\n",
  "votes": "2",
  "answers": 2,
  "views": "2k",
  "tags": [
    "ollydbg"
  ],
  "user": "zz3star90",
  "time": "May 18, 2014 at 7:20",
  "comments": [],
  "answers_data": [
    {
      "content": "To answer properly your question, yes. xmm registers were introduced by Intel with the SSE instruction set (IS) in 1999 with the Pentium III CPU. SSE stands for Streaming SIMD Extension and is a set of vector instructions. xmm registers are 128bit wide and can hold 4 floats, 2 doubles, or 16 chars. SSE can speed up signal processing applications (image processing, sound processing, compression, ...), encryption, and others quite dramatically when used properly. \n\nOn the other hand, mm registers are part of the MMX IS, another vector instruction set older than SSE (1997 I suppose), and are 64bit wide. \nNowadays the vector instruction sets are becoming quite a fashion in a certain way (vector CPUs were the standard for supercomputers back in the 70s & 80s - Cray's, ThinkingMachine's, ... computer were all vector based). In the past few years, Intel came up with many versions of SSE and two new IS called AVX & AVX2 (Advanced Vector Extension) with 256bit wide vectors implemented on SandyBridge/IvyBridge/Haswell, and AVX-512 first implemented on the KNC (Knight's Corner) of the Xeon Phi processor & co-processor line.\n\nI encourage you to check the Intel documentation & Wikipedia for more information.   \n\n",
      "votes": "2",
      "user": "yaspr",
      "time": "May 18, 2014 at 18:17",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "So it turns out the SSE Registers (XMM0-7) are not supported within OllyDbg v1.10, but are in v2.0 which I found, and downloaded here, and works great so far. The newest version does not, however, support plugins.\n\n",
      "votes": "3",
      "user": "zz3star90",
      "time": "May 18, 2014 at 4:50",
      "is_accepted": false,
      "comments": []
    }
  ]
}