{
  "title": "IDA Pro 6.4 android_server processattach failed",
  "link": "https://reverseengineering.stackexchange.com/questions/4383/ida-pro-6-4-android-server-processattach-failed",
  "content": "I would like to ask if anyone knows how to solve the above mentioned problem I encounter. I was reverse engineering an apk, and met a part where static analysis with IDA Pro is not enough, so I thought that I could use the android_server provided by IDA Pro to debug the .so library during runtime. However, I kept getting an error from IDA Pro when trying to attach to any process within my emulator: 'The debugger could not attach to the selected process. This can perhaps indicate the process was just terminated, or that you don't have the necessary privileges.' I used adb to push the android_server to my emulator, and then used adb shell and executed the script as root, but I'm still having this error. Any ideas on what am I doing wrong? Thanks in advance!\n\n",
  "votes": "6",
  "answers": 2,
  "views": "3k",
  "tags": [
    "ida",
    "debugging",
    "android"
  ],
  "user": "csharpnewbie",
  "time": "May 20, 2014 at 8:35",
  "comments": [],
  "answers_data": [
    {
      "content": "As mentioned, you have pushed the android_server to your emulator and executed it. So I guess you may forget forward your data from your development machine to your emulator.\n\nAs you executed the android_server, you can see Listening on 0.0.0.0:23946... in your emulator, which means android_server could kown what it should do by getting information from the emulator's port 23946.\nNow, you need transfer the information from IDA to your emulator.\n\nTo do this, you need:\n\n",
      "votes": "2",
      "user": "C JT",
      "time": "Sep 13, 2022 at 1:11",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I saw such issue in following situations:\n\nSo, please make you sure that you do everything exactly in correct way:\n\n```\nsu\ncd /data/local/tmp\n./android_server\n\n```\nOtherwise it may not work.\n\n",
      "votes": "0",
      "user": "Vitalii",
      "time": "Dec 3, 2018 at 20:53",
      "is_accepted": false,
      "comments": []
    }
  ]
}