{
  "title": "Dump TEB/PEB in immunitydbg",
  "link": "https://reverseengineering.stackexchange.com/questions/4394/dump-teb-peb-in-immunitydbg",
  "content": "I am trying to learn actually how to get to the PEB inside of TEB. I have tried this with windbg but could not manage to dump the PEB with stuff like:\n\n```\n!peb\n\n```\nor \n\n```\ndt nt!_PEB_LDR_DATA\n\n```\nAnd others. But, I could not manage to get the PEB dumped. So also my favorite debugger is still immunitydbg. So, I was trying to get to the information using immunitydbg CLI. But the nearest thing I have managed to get to PEB is dumping the TEB.\n\n```\nd fs:[0]\n\n```\nSo, I there anyhow someway inside of immunity do get the contents of TEB/PEB? I also tried to use the Ollysdbg PE Dump plugin but that only gave me another exe file with different contents. And also i am not sure if the PE Plugin does the right thing for me. \n\n",
  "votes": "3",
  "answers": 2,
  "views": "4k",
  "tags": [
    "windows",
    "immunity-debugger",
    "operating-systems"
  ],
  "user": "Dirk",
  "time": "May 21, 2014 at 7:10",
  "comments": [],
  "answers_data": [
    {
      "content": "Open the Memory Map window in OllyDbg/ImmunityDbg, scroll down to the bottom, and double click on the entry that contains Process Environment Block. This will open a dump of the PEB in OllyDbg/ImmunityDbg:\n\n\n\n",
      "votes": "3",
      "user": "Jason Geffner",
      "time": "May 21, 2014 at 13:39",
      "is_accepted": true,
      "comments": [
        {
          "user": "Dirk",
          "text": "i have tied that but i could not manage to find the Entry which contains \"Process Environment Block\" there is no such line when i open $application inside of OllyDbg/ImmunityDbg :\\ . But i found some plugin called mona which also solves my problem. Being capable But doing this by hand would be much more awesome.",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "ImmunityDbg is terribly outdated. What version of OllyDbg did you test this on?",
          "time": null
        },
        {
          "user": "Dirk",
          "text": "The one i used at home was v1.10",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "OllyDbg v1.10 is 10 years old. Please try with OllyDbg v2.01 - ollydbg.de/version2.html",
          "time": null
        }
      ]
    },
    {
      "content": "```\nalt + f1 d fs:[30] ollydbg 1.10  raw peb  \n\n```\nwith stolly plugin for 1.10 select the first byte in dump->right click->sructure\nselect _peb  from drop down box for decoded peb .\n\n```\nal+g fs:[30] in ollydbg 2.01 fully decoded _peb in dump / disasm window\n\n```\n",
      "votes": "3",
      "user": "blabb",
      "time": "May 21, 2014 at 17:55",
      "is_accepted": false,
      "comments": []
    }
  ]
}