{
  "title": "How to find the version number of Android Ad libraries from reverse engineered apps?",
  "link": "https://reverseengineering.stackexchange.com/questions/4430/how-to-find-the-version-number-of-android-ad-libraries-from-reverse-engineered-a",
  "content": "I am analysing Android ad libraries. I have downloaded apps from Google play and used dex2jar and JDGUI to recover the Java code of the app. As expected a lot of apps use ad libraries (such ad Google Ads, Inmobi, Millenalmedia etc.). As one would expect, ad libraries come in different versions (for eg. the latest version of inmobi is 4.3). Some apps that I downloaded use Inmobi 4.3 but a larger no. of apps use older versions of Inmobi (staring from version 3.6). \n\nHence, I wish to find the version of the ad library contained in apps. One novice approach is to search for the string \"version\" inside the app. Is there any better way of doing it? Will the ad libraries typically mention/register their version with Android framework through some code snippet? If so, I could search for that. \n\nPlease suggest some professional/appropriate way of doing it.\n\n",
  "votes": "1",
  "answers": 2,
  "views": "196",
  "tags": [
    "android",
    "java",
    "libraries",
    "software-security"
  ],
  "user": "Annamalai N",
  "time": "Jul 21, 2014 at 15:40",
  "comments": [],
  "answers_data": [
    {
      "content": "There is no perfect answer for this, it will greatly depend on your tolerance to false positives. Though there are three answers that come to mind depending on you level of effort you're willing to put in. The options are listed from easiest/least work to hardest/most work - if each one is done correctly - the risk of FP also should go down as well.\n\nDepending on what the exact output you want is, you might choose a different answer. Though the first step would definitely to be start cataloging the SDKs you want and find the actual different between them. \n\n",
      "votes": "2",
      "user": "diff",
      "time": "Jul 21, 2014 at 4:17",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Have you tried JEB's library signatures?\n\nhttps://www.pnfsoftware.com/blog/jeb-1-3-how-to-sign-and-match-third-party-library-code/\n\nThis was implemented in the earliest versions of that decompiler platform and I think will only get better over time\n\n",
      "votes": "0",
      "user": "Nederealm",
      "time": "Feb 12, 2019 at 17:45",
      "is_accepted": false,
      "comments": []
    }
  ]
}