{
  "title": "Reading Memory to bypass ASLR",
  "link": "https://reverseengineering.stackexchange.com/questions/4448/reading-memory-to-bypass-aslr",
  "content": "Modern exploits use different techniques to bypass ASLR. One of the technique used in some IE exploits is to leak memory using a BSTR overwrite.\n\nHow can an attacker leak memory, and how can he use it to effectively bypass ASLR?\n\n",
  "votes": "3",
  "answers": 2,
  "views": "892",
  "tags": [
    "exploit",
    "vulnerability-analysis"
  ],
  "user": "john4tech",
  "time": "Jun 23, 2014 at 13:47",
  "comments": [],
  "answers_data": [
    {
      "content": "this is how a BSTR represented in memory:\n\nLength Data string Terminator\n\nso an attacker will try to get an aligned heapspray and then trigger a vulnerability that will modify the Length part of a BSTR, it can be:\n\nthen the length of the BSTR will be so big that you can read a big block of memory, that simply contain pointers to DLLS, from that you get the base address of those DLLS, AND BOOM!!! ASLR bypassed!\n\n",
      "votes": "5",
      "user": "Ange",
      "time": "May 26, 2014 at 8:07",
      "is_accepted": true,
      "comments": [
        {
          "user": "john4tech",
          "text": "Awesome. Thanks. Can you give me an example exploit that uses this technique? If possible, could please provide me a psuedo code that can be used to demonstrate ASLR bypass on windows using this technique? Thanks you very much.",
          "time": null
        }
      ]
    },
    {
      "content": "Use GetModuleHandle() to get the base address of the module and the offset.\nThe offset is just current address - base address.\n\n",
      "votes": "0",
      "user": "perror",
      "time": "May 27, 2014 at 20:02",
      "is_accepted": false,
      "comments": [
        {
          "user": "john4tech",
          "text": "But in order to call GetModuleHandle() we need to first bypass DEP. And to bypass DEP we need to first bypass ASLR. Let me know in what context GetModuleHandle() will work?",
          "time": null
        }
      ]
    }
  ]
}