{
  "title": "How to deobfuscate an obfuscated javascript file like this? [duplicate]",
  "link": "https://reverseengineering.stackexchange.com/questions/4561/how-to-deobfuscate-an-obfuscated-javascript-file-like-this",
  "content": "I'm having serious problems deobfuscating a JavaScript file at work. This file is inside a web app that I was left in charge to improve it. The problem is that I can do it without having access to this file and the previous programmer that obfuscated it is not reachable.\n\nI tried many ways of deobfuscation but none worked.\n\nCan someone please help?\nThe code it's in the link bellow:\n\nLink for The code\n\n",
  "votes": "16",
  "answers": 1,
  "views": "125k",
  "tags": [
    "obfuscation",
    "deobfuscation",
    "javascript"
  ],
  "user": "MaizerG",
  "time": "10 years ago",
  "comments": [
    {
      "user": "DCoder",
      "text": "Did you look through this question? While you will probably be able to reverse most of the obfuscation, editing the resulting file will still be a big headache.",
      "time": null
    },
    {
      "user": "Dave",
      "text": "The link is dead. I'm suprised people didn't ask you to include the code in the body of the question",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "There are a few tools that you might try when wanting to analyze JavaScript:\n\nSee also a few tutorials on analyzing obfuscated JavaScript:\n\nAnd, finally, a few questions that have been already answered here:\n\n",
      "votes": "24",
      "user": "perror",
      "time": "Mar 8, 2022 at 10:21",
      "is_accepted": false,
      "comments": [
        {
          "user": "Han",
          "text": "poisonJS leads to porn site and malware. DO NOT CLICK",
          "time": null
        },
        {
          "user": "perror",
          "text": "@Han Thanks for mentioning it, I removed the link.",
          "time": null
        },
        {
          "user": "Sujal Singh",
          "text": "@perror the JSDetox link does not work, actually a lot of the links don't work. And why is v8 in this list?",
          "time": null
        }
      ]
    }
  ]
}