{
  "title": "Can IDA Pro on Linux disassemble a Windows PE (or Mac OS X app)?",
  "link": "https://reverseengineering.stackexchange.com/questions/4590/can-ida-pro-on-linux-disassemble-a-windows-pe-or-mac-os-x-app",
  "content": "I am thinking of buying IDA Pro for my Linux programming environment after reverse engineering a bit with OllyDBG (under WINE)... But before I endorse into such a costly purchase I ask the following question(s):\n\nSome renowned programs I'd like to reverse (for fun) are Windows executables, so if it can't disassemble a Windows executable from Linux, I'll have to multi boot (tedious)\n\nIf it helps, I have a 32-bit machine with a x86 processor\n\n",
  "votes": "0",
  "answers": 4,
  "views": "6k",
  "tags": [
    "ida",
    "windows",
    "tools",
    "x86",
    "linux"
  ],
  "user": null,
  "time": "Jun 17, 2020 at 9:54",
  "comments": [],
  "answers_data": [
    {
      "content": "Current IDA versions (as of 6.5) are pretty much equivalent for all three platforms. You can disassemble all file formats on all three platforms. You can definitely analyze PE and Mach-O files on Linux. Most debuggers are also available on all platforms.\n\nA couple of features are available only in the Windows version:\n\nNote: the last function is available on Linux and OS X if you can run the win32_remote.exe debugger on a Windows system/emulator.\n\n",
      "votes": "10",
      "user": "Igor Skochinsky",
      "time": "Jun 11, 2014 at 15:26",
      "is_accepted": false,
      "comments": [
        {
          "user": "Stolas",
          "text": "I recommend using IDA Linux over IDA in Virtual Windows.",
          "time": null
        }
      ]
    },
    {
      "content": "Yes﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿\n\n",
      "votes": "3",
      "user": "Jason Geffner",
      "time": "Jun 11, 2014 at 13:48",
      "is_accepted": false,
      "comments": [
        {
          "user": "Edward",
          "text": "Is that intended to mean \"Yes it can dissassemble Windows PE\" or \"Yes it can disassemble Mac OSX\" or both?  It's a bit terse.",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "IDA Pro on any platform can disassemble Windows PE files and Mac OS X Mach-O files.",
          "time": null
        }
      ]
    },
    {
      "content": "I think the reason that the first answer to this question was terse is that the information to answer your question is easily accessible on the Hex-Rays website. \n\nTake a look at the ordering page on the website. There are .pdf forms that break out the pricing for IDA/IDA Pro. You must purchase the Linux and Windows version separately. As far as I understand, the disassemblers for IDA/IDA Pro are the same across platforms. You can see the differences in included disassemblers per edition here. As one of the other answers to this question has pointed out, some of the integrated debuggers are not included on non-Windows versions.\n\n",
      "votes": "2",
      "user": "dingo_kinznerhook",
      "time": "Jun 11, 2014 at 15:45",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "One other thing to mention:\nDisassembling .NET applications is only possible in Windows Version. IDA uses some Microsoft dll's for parsing.\n\nAnother point:\nAs IDA is a 32bit application (even the 64bit disassembler) you always have to use remote debuggers for handling 64bit applications.\n\nIDA works well for me with Wine under Linux. So I bought the Windows version to have all the features and use it either native under Windows or via Wine(Crossover) under Linux.\n\n",
      "votes": "0",
      "user": "user2011659",
      "time": "Jun 12, 2014 at 5:07",
      "is_accepted": false,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "Not anymore, we implemented .NET parser for Linux and OS X a couple versions ago.",
          "time": null
        }
      ]
    }
  ]
}