{
  "title": "STM32 DFU tools for Windows",
  "link": "https://reverseengineering.stackexchange.com/questions/4746/stm32-dfu-tools-for-windows",
  "content": "I'm currently investigating an embedded system with a STM32F4-model. I'm able to enter in DFU mode and use the dfu-util. I'd also like to use STM32's original Dfuse tools, just for completeness sake. Unfortunately the embedded device has a changed USB vendor and device, so the original STM drivers don't recognize the device. \n\nAny ideas how to work around that?\n\n",
  "votes": "3",
  "answers": 2,
  "views": "12k",
  "tags": [
    "firmware"
  ],
  "user": "bot47",
  "time": "Jul 1, 2014 at 8:04",
  "comments": [
    {
      "user": "Spektre",
      "text": "try to change PID VID in inf file to match your device. If the DFU protocol/fuses is the same it should work ... but is highly possible you can have USB inf conflicts if the original inf is already installed. (at least on Windows are USB drivers a mess so keep trying ...) the best will be do it on clean machine (or virtual machine)",
      "time": null
    },
    {
      "user": "bot47",
      "text": "Already tried this. There are no original drivers, the port is just for manufacturer debugging and charging. It seems as if the driver also checks for the ids and refuses to load.",
      "time": null
    },
    {
      "user": "Spektre",
      "text": "in that case the only thing you can do is make your own driver (my favorite is JUNGO) and make simple App for DFU yourself. I did not do such thing my drivers usually just access bulk transfers but most DFU I have seen have pretty good documentation including source codes ...",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I used these drivers which seemed to work. These also installed but didn't make the device work.\n\nI have no idea of their authenticity.\n\n",
      "votes": "1",
      "user": "Topper Harley",
      "time": "Dec 6, 2016 at 12:35",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Old question I know. I have installed DfuSe Demo Tool, available from ST website. \n\nAfter installing this tool, install the driver that came with it, it is located in the installation directory of DfuSeDemo directory. Mine is in: \"C:\\Program Files (x86)\\STMicroelectronics\\Software\\DfuSe v3.0.6\\Driver\" Update the driver in device manager and point to this directory.\n\nYou can also download (=upload) the current firmware with this.\n\n\n\n",
      "votes": "1",
      "user": "Codebeat",
      "time": "Dec 3, 2018 at 19:26",
      "is_accepted": false,
      "comments": []
    }
  ]
}