{
  "title": "How to match disassembled instructions back to C/C++ source?",
  "link": "https://reverseengineering.stackexchange.com/questions/4762/how-to-match-disassembled-instructions-back-to-c-c-source",
  "content": "Basically here's what I want to know, if you have a disassembled instruction say:\n\n```\njz 0x8048e1a\n\n```\nAnd, you also have the source code. How do you go about figuring out what this instruction relates to in the source code ? At the very least, would it be possible to figure out the basic block that this instruction comes from ?\n\nBasically I have an application that spits out a disassembled instruction for an ELF binary that I have compiled myself (source available), and now I have to find out what/where this disassembled instruction maps to in the source code. \n\nLet's also assume that I do not use any of the optimization flags while compiling. \n\nI should probably mention that I am using Intel's PIN as the application that spits out these disassembled instructions. So, I know which function/routine these instructions belong to. But, I just want to be a bit more precise at the assembly level.\n\nThanks for any help/hints !\n\n",
  "votes": "4",
  "answers": 6,
  "views": "11k",
  "tags": [
    "decompilation",
    "c++",
    "c",
    "elf"
  ],
  "user": "Faheem",
  "time": "Jul 2, 2014 at 16:16",
  "comments": [
    {
      "user": "Dominik Antal",
      "text": "My old question might relate to yours somehow, not saying it's a duplicate, just a heads up : reverseengineering.stackexchange.com/questions/3166/…",
      "time": null
    },
    {
      "user": "Dmitry Janushkevich",
      "text": "Is the instruction address available as well? This is not obvious from the example above.",
      "time": null
    },
    {
      "user": "Faheem",
      "text": "@DmitryYanushkevich Yes, all the addresses are available.",
      "time": null
    },
    {
      "user": "Dmitry Janushkevich",
      "text": "Have you checked this yet?",
      "time": null
    },
    {
      "user": "Hackndo",
      "text": "May I suggest you a very helpful training website with plenty of small examples binary-auditing.com : With a very slowly increasing difficulty, you'll manage to extract various HLL (High Level Language) patterns from ASM. It starts with variable assignations, goes through loops, conditions, objects, structures, and so on.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You have to read and interpret the assembly. There is no substitute for reading the assembly. If you know what the assembly instructions mean, and you have the source code the relationship between the two should be quite clear. There will be no direct marker that shall tell what line of the source the assembly came from. \n\nSo learn how your basic structures in C/C++  look in ASM. \n\nWhat does a loop look like? (Hint: There are several ways to write loops in ASM)\n\nWhat does a struct look like?\n\nWhat does a function look like? \n\nWhat does a pointer look like?\n\nIf you learn ASM well, this will all be clear. \n\nAlso, learn how compilers work, and learn to debug running code. \n\nEdit: \nYou can actually generate debugger symmbols to relate code to individual line numbers, so what I said above is not exactly true. \n\n",
      "votes": "4",
      "user": "MrSynAckSter",
      "time": "Jul 2, 2014 at 15:42",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jason Geffner",
          "text": "\"There will be no direct marker that shall tell what line of the source the assembly came from.\" -- That's not quite true given that he can generate symbols from his source code.",
          "time": null
        },
        {
          "user": "MrSynAckSter",
          "text": "He could. I was assuming that just wanted to work with the assembly without giving himself hints. I edited the post to reflect the truth.",
          "time": null
        }
      ]
    },
    {
      "content": "EDIT: The answer below is specific to PE files, which doesn't answer the question above now that @Achilles specified that his question is in regard to ELF files.\n\nGiven that you have the source code and can produce symbols for your program, you can use the Debug Interface Access SDK to map assembly code instruction addresses to source code line numbers. In particular, you would want to use the IDiaLineNumber class.\n\n",
      "votes": "4",
      "user": "Jason Geffner",
      "time": "Jul 2, 2014 at 16:18",
      "is_accepted": false,
      "comments": [
        {
          "user": "Faheem",
          "text": "Sorry, I forgot to mention, I need to do this on Linux.",
          "time": null
        },
        {
          "user": "Dmitry Janushkevich",
          "text": "This is not completely true and depends on whether one can reproduce the build perfectly. In case the binary was PGO-optimised, I don't think there is a chance for that. Not to mention having the same version of compiler and build environment.",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "I assumed he was looking at the build he himself created. I also assumed this was on Windows :)",
          "time": null
        }
      ]
    },
    {
      "content": "Mostly intuition and experience. Given the high-level overview from the source code, one could spot the function and possibly the line where the instruction belongs, but so far I know no program that could do the same. Having debug info certainly helps a lot, but is not a panacea, and in general, not always available.\n\nIn general, no. In certain cases, yes. Modern compilers tend to optimize code too aggressively. Even having all the debug info the compiler produces is sometimes not enough to map the precise location of the given insn, which can be demonstrated by trying to do source-level debugging on such an application.\n\nEDIT: Didn't properly notice you build the binary by yourself. Then yes, it should be possible to at least map the instruction to a function given the debug info.\n\n",
      "votes": "2",
      "user": "Dmitry Janushkevich",
      "time": "Jul 2, 2014 at 15:46",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Which compiler are you using? My background is more in Windows development (as opposed to Linux/BSD/OSX), so I can only speak to that case.\n\nBut in Visual Studio, you can see the generated assembly while debugging C/C++. See this MSDN article for detail.\n\nIf you are only interested in the ASM, you may want to change some of the compilation settings within your Visual Studio project so that it reduces debug information included with the project. Detail on how to do that is here.\n\nPrimarily involves:\n\n\n\nEmbarcadero C++ Builder and Delphi (formerly Borland) offer the same functionality as well. Usage detail here.\n\n\n",
      "votes": "2",
      "user": "Mick",
      "time": "Jul 2, 2014 at 15:46",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "If you compiled it yourself, and can compile it with dwarf information, then you can use addr2line from gnu binutils. \n\nIf you have less information, I just try to get the lay of the land, often using references to arguments or function calls as major landmarks. Obviously, that's not applicable to every binary, though.\n\n",
      "votes": "2",
      "user": "broadway",
      "time": "Jul 2, 2014 at 21:33",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "If you have the full source available. Here's what I propose (and currently do): \n\n",
      "votes": "1",
      "user": "Faheem",
      "time": "Aug 27, 2015 at 13:50",
      "is_accepted": false,
      "comments": [
        {
          "user": "mackycheese21",
          "text": "Awesome! Thanks!  This solved my problem perfectly and easily.",
          "time": null
        }
      ]
    }
  ]
}