{
  "title": "Learning disASM, other things",
  "link": "https://reverseengineering.stackexchange.com/questions/5847/learning-disasm-other-things",
  "content": "I am somewhat interested in learning how to RE but right now am learning C, and was wondering if anyone could give me a link to a good tutorial on how to use gdb\n\nAlso, in reference to registers...if rax is 64-bit and eax is 32, then ax must be 16, right? What's 8bit...or was 8bit ASM not a thing?\n\n",
  "votes": "-1",
  "answers": 1,
  "views": "103",
  "tags": [
    "gdb"
  ],
  "user": "user8058",
  "time": "Jul 14, 2014 at 2:41",
  "comments": [
    {
      "user": "0xec",
      "text": "Just use Google for gdb tutorials. AH, AL, BH, BL, CH, CL, DH, DL are all 8-bit registers on the x86 platform.The \"H\" and \"L\" suffix on the 8 bit registers stand for high byte and low byte.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "When I was learning RE (and I'm always still learning!), I found reading \"CODE\" by Charles Petzold to be extremely informative and really helped me understand WHY computers work the way that they do on a low level. Sample chapter available here.\n\nIt's a book about first principles, but reads like a fiction book, not a computer science book. At one point Petzold walks the reader through how to build a computer counting machine using only parts that would've been available ~100 years ago. If you've never taken an electronics class and concepts such as gates and boolean logic aren't very clear, start here. You'll learn about these concepts without even realizing it.\n\nAfter reading that (which you can finish in a couple evenings), then you could move on to GDB. I'm sure others can make better recommendations than me on GDB, but I found this book helpful the times I've used GDB: The Art of Debugging with GDB and DDD\n\nTo answer the question about registers, I think an image can make this most clear. Note that this only covers 32-bits, but should be easy enough to see how the 64-bit registers expand on this.\n\n\nsource: http://www.cs.virginia.edu/~evans/cs216/guides/x86.html\n\n",
      "votes": "0",
      "user": "Mick",
      "time": "Jul 14, 2014 at 14:00",
      "is_accepted": true,
      "comments": []
    }
  ]
}