{
  "title": "How to change the export function name of android so file (ELF format)",
  "link": "https://reverseengineering.stackexchange.com/questions/5873/how-to-change-the-export-function-name-of-android-so-file-elf-format",
  "content": "Here are my .so files:\n\nBelow are export functions inside .so files:\n\nIn Java project, I define the function like this and call (using JNI call):\n\n```\npackage com.jlc.BubbleChat;\n\npublic class libJlcVideoEncoder\n{\n   static {\n      System.loadLibrary(\"JlcVideoEncoder\");\n   }\n   private native int JNIJlcInit();\n   private native int JNIJlcVideoEncoder(byte[] camdata,byte[] stream,int qp);\n\n   public int JlcInit() {\n       return JNIJlcInis();\n   }    \n   public int JlcVideoEncoder(byte[] camdata,byte[] stream,int qp) {\n       return JNIJlcVideoEncoder(camdata, stream, qp);\n   }    \n}\n\n```\nBut, I want to change the export function:\n\nSo, I opened any so file and edited the function name in winhex.\nBut it does not work.\n\nAnd, there are no other files that import this so file. the problem is that after changing the function name, loadlibrary is success but can't find address of export function.\n\nEditing export function name does not work. Do you know the reason ?\n\nOr, somewhere there is checksum check when android load so files ?\n\nI do not want  decompile or modifying. My final aim is to call the original function with different name.\n\n",
  "votes": "1",
  "answers": 0,
  "views": "2k",
  "tags": [
    "android",
    "elf"
  ],
  "user": "cute_star",
  "time": "Jul 16, 2014 at 15:43",
  "comments": [
    {
      "user": "zetavolt",
      "text": "Totally unfamiliar with android's usage of ELF, so this is not much more than a reiteration of how you might go about it on an ELF w/ non PIC/PIE code using shared libraries and the standard relocation fixup facilities: Editing an entry from the linkage table will not be sufficient, depending on how you are using this file you may have to objcopy a new .got.plt .$LDHASHTYPE.hash & .rela.X and maybe even  .symtab/.dyntab etc.  It is very possible your ELF requests a custom program interpreter in which case you are just going to have to get down and dirty.",
      "time": null
    },
    {
      "user": "cute_star",
      "text": "My need is so to change original name ,so simple. now i think android check hash value when loading .so file .",
      "time": null
    },
    {
      "user": "zetavolt",
      "text": "objcopy can readily take care of that for you if function dispatch is accomplished in a similar fashion to what were are used to on desktop use of ELF.I will reiterate however that my intuition leaves doubt as to if Android's method of relocations of symbols and procedures shares much in common with the form we are all familiar with.",
      "time": null
    },
    {
      "user": "0xec",
      "text": "Use objcopy --redefine-sym. Use the version from Android NDK.",
      "time": null
    }
  ],
  "answers_data": []
}