{
  "title": "Reversing DDRAW application",
  "link": "https://reverseengineering.stackexchange.com/questions/5935/reversing-ddraw-application",
  "content": "I have an old game that I am wanting to increase the resolution on. The problem is that the game is ancient and was written using DDRAW and GDI .A few things are weird with this application, First starting from the entry point all the program does is create the process. secondly all the other code is indeed executed just I can't break over it (Making reversing a very slow process).\n\nHas anyone tried to reverse a DDraw application?\n\nI so far, have it to where I have expanded the resolution in such, that the application is still showing the default resolution just pushed to the left top corner and everything is still the 640x480 and is surrounded by black BUT the cool thing is I can click out of the 640x480 in the black area and click on objects and move to them. Would anyone know how to possibly resolve this?\n\nAnother thing, it doesn't seem to matter what kind of break point I set in this(outside of EP) area of code the program never breaks there. Is there something I am missing here?\n\nI can try to come up with a picture as an example if that would help ; if no one understands how I am describing resolution.\n\nAlso, I only see a call for DirectDrawCreate  and it looks like it would point to an object or window but I cant tell entirely cause I cant break here.\n\n",
  "votes": "3",
  "answers": 1,
  "views": "245",
  "tags": [
    "windows",
    "ollydbg",
    "interoperability"
  ],
  "user": "LUser",
  "time": "Jul 25, 2014 at 2:24",
  "comments": [],
  "answers_data": [
    {
      "content": "DDRAW is an object based interface. DirectDrawCreate creates DDRAW interface object (based on GUID provided as paramter). Regarding black area, most probably rendering part uses internally  smaller resolution. Could you share the game's name?\n\n",
      "votes": "1",
      "user": "malikcjm",
      "time": "Jul 25, 2014 at 8:49",
      "is_accepted": true,
      "comments": [
        {
          "user": "LUser",
          "text": "Thanks for the fast reply. The game is hellfire the expansion of diablo 1. I don't suppose you know why I can't break anywhere in most of the code. I was guessing I will have to use dll injection to continue further .",
          "time": null
        },
        {
          "user": "malikcjm",
          "text": "I've checked hellfire binary. It seems that it just starts itself. Creates another process with the same binary and exits. You could patch binary to skip that part. Just put some NOP instructions. In my binary it was first CALL instruction in WinMain function.",
          "time": null
        },
        {
          "user": "LUser",
          "text": "You must be talking about call 00409283 right ? Looking for main now .",
          "time": null
        },
        {
          "user": "malikcjm",
          "text": "In my binary function that starts at 00409283 is WinMain. In that function there is call 004096B1. That function contains CreateProcessA call.",
          "time": null
        },
        {
          "user": "LUser",
          "text": "And is there a spot to jump to ? Or just nop out the create process",
          "time": null
        }
      ]
    }
  ]
}