{
  "title": "Extracting data from Filemaker application",
  "link": "https://reverseengineering.stackexchange.com/questions/5996/extracting-data-from-filemaker-application",
  "content": "I have an end user version of an application written in FileMaker 10 (FML10.dll) and I need the data behind the software. Anyone knows a way to extract the data?\nLooks like the USR file containts the data, but I don't know how to open it. Is there a way to query it throught c#?\n\n```\nC:\\PROGRAM FILES (X86)\\ASAS 2013-01\n   Asas 2013-01.exe\n   Asas 2013-01.USR\n   DBConverter.dll\n   DBEngine.dll\n   DOMSupport.dll\n   FML10.dll\n   FMLayout.dll\n   FMOLE.dll\n   FMPA Acknowledgements.pdf\n   FMRSRC.dll\n   FMScript.dll\n   FMUserModel.dll\n   FMWrapper.dll\n   GdiPlus.dll\n   HBAM.dll\n   libeay32.dll\n   MFCX.dll\n   NSViews.dll\n   OmniDynamic4.dll\n   OmniORB4.dll\n   OmniThread.dll\n   PlatformSupport.dll\n   ProofReader.dll\n   ssleay32.dll\n   Support.dll\n   uninstal.exe\n   uninstal.ini\n   XalanDOM.dll\n   XalanExtensions.dll\n   XalanSourceTree.dll\n   XalanTransformer.dll\n   XCore.dll\n   XDraw.dll\n   Xerces.dll\n   XercesParserLiaison.dll\n   XFC.dll\n   XGrfx.dll\n   XMLEngine.dll\n   XMLSupport.dll\n   XPath.dll\n   XSLT.dll\n   XText.dll\nExtensions\n   Langs and etc..\nMicrosoft.VC80.CRT\n       ...\nMicrosoft.VC80.MFC\n       ...\nMicrosoft.VC80.MFCLOC\n        ...\n\n```\n",
  "votes": "0",
  "answers": 1,
  "views": "3k",
  "tags": [
    "windows",
    "c#"
  ],
  "user": "appl3r",
  "time": "Aug 1, 2014 at 8:13",
  "comments": [
    {
      "user": "Jason Geffner",
      "text": "This might be of some value to you: woodmann.com/forum/showthread.php?13546-A-Filemaker-Story",
      "time": null
    },
    {
      "user": "Dominik Antal",
      "text": "What \"data\" are we talking about? Please clarify.",
      "time": null
    },
    {
      "user": "appl3r",
      "text": "All the data in the database, text, images, relationships...etc",
      "time": null
    },
    {
      "user": "jmiserez",
      "text": "It's a valid question, albeit poorly worded. If this is a Filemaker runtime solution, then it presents itself as a normal application like any other. Only difference is that it uses a FM database as it's storage engine in the background, with all user-facing FM features being invisible to the user of the runtime solution.",
      "time": null
    },
    {
      "user": "jmiserez",
      "text": "So, did it work?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Not quite sure what you are looking for, so here goes:\n\nIf you just want to open the database of a FM runtime solution, thats easy:\n\nNote: The format is .fp7, there is no .fp10 format. The next higher version would be .fmp12\n\nIf you want to export your FM data into another database (e.g. Oracle database), then are multiple ways to get at your data:\n\nThat said, there isn't much to reverse engineer here, apart from renaming a file for the first scenario. However, you absolutely do need a valid copy of Filemaker 10 (or higher) to access your data. There is no description of the internal Filemaker format anywhere, and you won't be able to read it with any other programs. Note that there is a 30-day trial available from the Filemaker website.\n\n",
      "votes": "3",
      "user": "jmiserez",
      "time": "Aug 3, 2014 at 0:01",
      "is_accepted": false,
      "comments": [
        {
          "user": "appl3r",
          "text": "You need to login to the database and the default account (guest) does not allow you to export your data, only viewing through the filemaker interface. Maybe the ODBC solution you suggested allows me to query through all the data, but I am not sure. I will try it the next time when I got it (probably a few days). Thank you for taking your time and answering!",
          "time": null
        },
        {
          "user": "jmiserez",
          "text": "There are third party tools out there that can recover a Filemaker password. As I understand it, .fp7 files are not encrypted, and these third party tools just swap out the password hash with a known one. If you have FM10, you could create a new database, then change the password and see which parts of the file changed. Most of these tools do not work with Filemaker Pro runtime solutions that have had the admin access remove (see here)",
          "time": null
        },
        {
          "user": "jmiserez",
          "text": "Note: It seems that the third party tool does not support databases which have had their admin access revoked as described in my previous comment. However, according to the FM help, each file must have at least one account. So while you might not be able to edit the database, reading from it should work.",
          "time": null
        }
      ]
    }
  ]
}