{
  "title": "Unable to create FLIRT signature for IDA",
  "link": "https://reverseengineering.stackexchange.com/questions/6089/unable-to-create-flirt-signature-for-ida",
  "content": "I'm trying to create a .sig file for sqlite3. I downloaded the source code from the website, compiled it into a .lib (smoothly), and this is what I get when I try to turn it into a .pat file:\n\n```\nplb.exe -v sqlite.lib\nsqlite.lib: invalid module at offset 143146. Skipping.\nsqlite.lib: invalid module at offset 2587742. Skipping.\nsqlite.lib: skipped 2, total 2\n\n```\nThe resulting .pat file is empty and I cannot proceed to create the final file with sigmake.\n\nGoogle doesn't seem to indicate that anyone has ever had an \"invalid module at offset\" problem in the entire world, so I'm guessing this is pretty unique. I'm stuck. Help?\n\n",
  "votes": "3",
  "answers": 1,
  "views": "2k",
  "tags": [
    "ida",
    "flirt-signatures"
  ],
  "user": "Sleeptime",
  "time": "Aug 17, 2014 at 14:33",
  "comments": [
    {
      "user": "broadway",
      "text": "It's an omf library instead a coff library? I would expect you would want to use pcf.exe instead, omf 32 bit is pretty rare.",
      "time": null
    },
    {
      "user": "Sleeptime",
      "text": "Durr. That's the right answer. I just blindly went with the IDA tutorial without reading the readme.",
      "time": null
    },
    {
      "user": "Sleeptime",
      "text": "If you want, put it down as an answer instead of a comment and I'll give it to you.. :p",
      "time": null
    },
    {
      "user": "broadway",
      "text": "Okay, I didn't do so initially since I wasn't certain how useful it would be to future visitors, but it can't be less useful than a question with no answer I suppose.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "plb.exe is designed for OMF libraries (primarily used for 16 bit Borland compilers). What you probably want is pcf.exe, which parses COFF libraries commonly used in 32 bit windows.\n\n",
      "votes": "7",
      "user": "broadway",
      "time": "Aug 19, 2014 at 21:35",
      "is_accepted": true,
      "comments": []
    }
  ]
}