{
  "title": "Unknown compression algorithm",
  "link": "https://reverseengineering.stackexchange.com/questions/6099/unknown-compression-algorithm",
  "content": "I got data which is compressed but I fail to find the compression algorithm.\nThe data is part of a larger file from which I know the layout, So I managed to find out few things. What I know:\n\nEDIT: There are the 32 first bytes in hex:\nb9daed36cb64bedb61b9dd2cb72afd8ee565b0dd2ea00f0afda2c36eb25b0016\n\nI made histograms of several of those data and they all match a specific pattern. Something is going on with the powers of 2 obviously but I fail to see what.\n\n\n\nAnyone has a idea what it could be? What can I do to gather further information? Does it look Lempel-Ziv based? If yes how could I reverse it?\n\n",
  "votes": "5",
  "answers": 1,
  "views": "4k",
  "tags": [
    "file-format"
  ],
  "user": "search4everNever",
  "time": "Aug 19, 2014 at 14:28",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "If you don't have the executable how did you get this file? Also, show a dump of the 16-32 bytes of the header.",
      "time": null
    },
    {
      "user": "search4everNever",
      "text": "Updated to answer + hex dump of the header",
      "time": null
    },
    {
      "user": "perror",
      "text": "You may find this question and answers interesting to look at: > Are there any tools or scripts for identifying compression algorithms in executables?",
      "time": null
    },
    {
      "user": "Jongware",
      "text": "\"The output is ASCII and nothing else\" - that, coupled with a ratio of \"about 0.30\" actually suggests a simple compression scheme, rather than a complicated: a dedicated text-only compression scheme. Can we see this file?",
      "time": null
    },
    {
      "user": "Jason Geffner",
      "text": "Have you tried contacting the company that made the software?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I'd suggest to write script that runs different decompression algorithms on parts of the data and to observe results.\n\n",
      "votes": "3",
      "user": "w s",
      "time": "Aug 20, 2014 at 7:09",
      "is_accepted": false,
      "comments": []
    }
  ]
}