{
  "title": "memset() in malware",
  "link": "https://reverseengineering.stackexchange.com/questions/6166/memset-in-malware",
  "content": "By analyzing a piece of a trojan code, I have the memset()-function with the following parameters:\n\n```\nchar *s;       //Ollydbg says that it shows to 0012F8A3\nint  c = 0;\nint n = 512;\n\nmemset(s, c, n);\n\n```\nSo, I know what this function does and so on. So my question would be:\nIs there a way to find out which string is at place  0012F8A3 using Olldbg ? \nBy right-clicking and Go to Expression ->  0012F8A3, I came to a place with the following code lines:\n\n```\n  0012F8A3   0000   ADD BYTE PTR DS: [EAX], AL\n\n```\nThis line occurs consecutively. And in the stack window of Ollydbg, there is no such a place labeled with 0012F8A3.\n\nCan someone help ?\n\n",
  "votes": "0",
  "answers": 2,
  "views": "1k",
  "tags": [
    "assembly"
  ],
  "user": "user3097712",
  "time": "Sep 4, 2014 at 11:22",
  "comments": [
    {
      "user": "tuantm",
      "text": "In Ollydbg You can use the CPU windows --> point your pointer to the related instructions and then open the right mouse menu --> Follow .. in Dump",
      "time": null
    },
    {
      "user": "Fewmitz",
      "text": "Use the dump window to watch the address before and after the memset call. If it's just malloc'd then this is just going to set it to 0 so there won't be anything there but if the malware is cleaning up a buffer then stop at the memset call and analyze the address there. The address won't be in the (default) stack window if you step over the call to memset either",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Since you want to look at data, you should use the Dump window at the bottom left of the screen. You can use the Ctrl+G shortcut to move the view to a specific address. \n\nNow, at that point in the code memset() is zeroing out the buffer. So, you probably won't have anything interesting but it will probably be filled later in the code. \n\n",
      "votes": "1",
      "user": "perror",
      "time": "Sep 4, 2014 at 11:23",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "You told OllyDBG to jump to 0012F8A3, which will cause Olly to show it in the disassembly listing. As you can see from the listing:\n\n```\n  0012F8A3   0000   ADD BYTE PTR DS: [EAX], AL\n\n```\nOn the left is the address (0012F8A3), then the bytes at that address (0000), and the opcode they decode to (ADD BYTE PTR DS: [EAX], AL). Note that, indeed, in x86 assembly, two NUL bytes in a row decode to ADD BYTE PTR DS: [EAX], AL.\n\nSince you said that this line repeats over and over again, I infer that this means that the memory region of interest is just filled with zeros. You should skip forward until the region is filled in, then look at it again (preferably in a memory viewer, not the disassembly view) to see what is placed there.\n\n",
      "votes": "0",
      "user": "nneonneo",
      "time": "Sep 7, 2014 at 21:30",
      "is_accepted": false,
      "comments": []
    }
  ]
}