{
  "title": "exploit - Getting started with Java exploitation [duplicate]",
  "link": "https://reverseengineering.stackexchange.com/questions/6314/exploit-getting-started-with-java-exploitation",
  "content": "I am looking to get started with Java exploitation. I have not found a good place start or even how to start, so I am asking here. What are the publicly available exploits for Java that one can study ? Also what would be a good starting point ?(ex. maybe decompilation ) \n\n",
  "votes": "1",
  "answers": 2,
  "views": "536",
  "tags": [
    "exploit",
    "java"
  ],
  "user": "Sreyan",
  "time": "10 years ago",
  "comments": [
    {
      "user": "0xea",
      "text": "See this question and my answer reverseengineering.stackexchange.com/a/2889/304",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "There are about 20 publicly available exploits for Java here, with annotated source code and references to the vulnerabilities being exploited: https://github.com/rapid7/metasploit-framework/tree/master/modules/exploits/multi/browser\n\n",
      "votes": "2",
      "user": "Jason Geffner",
      "time": "Sep 26, 2014 at 12:36",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "So the first question is, what are you trying to exploit?\n\nHistorically, the most popular target is the Java Browser plugin, because the sandboxing relies entirely on in-process Java code, with an attack surface of over 18,000 classes in the standard library. Naturally, this means that it's a frequent source of vulnerabilities, to the point where a lot of people have just disabled the plugin entirely, and even Oracle has made it harder to run applets automatically.\n\nSo if you want to find your own vulnerability, it's just a matter of looking through the standard library code (everything in rt.jar is privileged) and find something that does sensitive operations without properly validating the caller's permissions.\n\n",
      "votes": "2",
      "user": "Antimony",
      "time": "Sep 25, 2014 at 15:18",
      "is_accepted": false,
      "comments": [
        {
          "user": "Sreyan",
          "text": "Are there any publicly available exploits that I can study ? And what is the rt.jar file for ?",
          "time": null
        },
        {
          "user": "Antimony",
          "text": "rt.jar is the jar that contains all the core system classes. The last time I checked, it had over 18000 classes in it.",
          "time": null
        }
      ]
    }
  ]
}