{
  "title": "x86_64 Calling convention",
  "link": "https://reverseengineering.stackexchange.com/questions/6337/x86-64-calling-convention",
  "content": "I am slightly confused by some x86_64 linux code here (generated by llvm):\n\n```\n# BB#0:                                 # %entry\n    push    RBP\n.Ltmp21:\n    .cfi_def_cfa_offset 16\n.Ltmp22:\n    .cfi_offset rbp, -16\n    mov RBP, RSP\n.Ltmp23:\n    .cfi_def_cfa_register rbp\n    push    RBX\n    push    RAX\n.Ltmp24:\n    .cfi_offset rbx, -24\n    mov EDI, .L.urandom\n    mov ESI, 8\n    call    open\n    mov EBX, EAX\n    mov EDI, EBX\n    mov ESI, ptrenc.keys\n    mov EDX, 16\n    call    read\n\n```\nFrom what I read in wikipedia, I would have expected the arguments to open and read to be passed in R-Registers (RDI, RSI, RDX). \n\nThe code uses the 64-bit Registers to build the stack frame. Why does it use the 32-bit registers for the calls? \n\n",
  "votes": "3",
  "answers": 2,
  "views": "990",
  "tags": [
    "disassembly",
    "x86-64",
    "calling-conventions"
  ],
  "user": "John Nemo",
  "time": "Sep 30, 2014 at 8:39",
  "comments": [
    {
      "user": "perror",
      "text": "You should read the System V Application Binary Interface for AMD64. It contains all the answers to your questions!",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "So, your question is mainly about this part of the code (if I do not care about the second call which is similar anyway):\n\n```\nmov EDI, .L.urandom\nmov ESI, 8\ncall    open\n\n```\nIn fact, this is perfectly okay to go through ESI and EDI as it is done here, because the value that are transfered are 32 bits values... and, anyway, in amd64, when manipulating 32 bits registers you will blank the upper 32 bits of the corresponding 64 bits registers (zero-extended). So, you end-up with RSI and RDI which are containing the right values and you only had to transfer 32 bits from the memory to the registers... It may be seen as a small optimization.\n\n",
      "votes": "3",
      "user": "perror",
      "time": "Sep 30, 2014 at 12:36",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "You'll find an answer in here. If you want more details, well, here you'll find everything you need. \n\n",
      "votes": "-2",
      "user": "yaspr",
      "time": "Sep 29, 2014 at 11:56",
      "is_accepted": false,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "Please don't post just links. Try to quote the relevant parts in the answer. P.S. your links don't seem to actually answer the question.",
          "time": null
        },
        {
          "user": "yaspr",
          "text": "Well, the purpose is not to idiotically answer the question, rather to make a point. There's no need to ask a question for which there's already an answer in the documentation. Plus, the links answer the question perfectly, all you have to do is look !",
          "time": null
        },
        {
          "user": "JamalS",
          "text": "@yaspr: \"Idiotically answer the question...\" What on earth is idiotic about answering the question, as you're suppose to be doing on the SE?",
          "time": null
        },
        {
          "user": "yaspr",
          "text": "As I said in my previous comment : The answer is in the documentation ! Redundancy, that's idiotic.",
          "time": null
        },
        {
          "user": "SamB",
          "text": "Sometimes the URLs people use to link to the documentation go dead, so it's best to provide a summary of what the documentation actually says. (And it can take a fair bit of work to actually work out the implications of the documentation, too...)",
          "time": null
        }
      ]
    }
  ]
}