{
  "title": "OllyDbg: Keep comments & labels in rebased DLL",
  "link": "https://reverseengineering.stackexchange.com/questions/6376/ollydbg-keep-comments-labels-in-rebased-dll",
  "content": "My program loads and unloads a DLL of main interest at runtime.\nI try to add comments and labels to the DLLs code, but when it is unloaded and loaded again, they are gone, as the DLL is rebased most of the time.\n\nI'm in search for an OllyDbg plugin to preserve the comments and labels when a DLL gets rebased (for Olly 1, but this task is that important that I'd also switch to Olly 2 if there is a plugin only for 2).\n\nAnyone knowing a plugin or still having the \"Dynamic Debugging\" plugin?\n\n",
  "votes": "3",
  "answers": 1,
  "views": "1k",
  "tags": [
    "ollydbg",
    "binary-analysis"
  ],
  "user": "Ray",
  "time": "Oct 4, 2014 at 12:31",
  "comments": [
    {
      "user": "Jason Geffner",
      "text": "Have you tried the latest OllyDbg 2 to see if this is fixed (without needing any plugins)?",
      "time": null
    },
    {
      "user": "Ray",
      "text": "@JasonGeffner: It's not a bug, it's just a missing feature I guess. I have yet to test if Olly optimizes this behavior. It also happens in IDA. However, I've extended the Labelmaster plugin, s. my answer.",
      "time": null
    },
    {
      "user": "Jason Geffner",
      "text": "Right, but I believe that OllyDbg 2 has that feature built-in already.",
      "time": null
    },
    {
      "user": "Ray",
      "text": "@JasonGeffner: Wow, you're right! At least in my short test it worked. It was definitely rebased and my test comment was still there. Cool stuff!",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "OllyDbg2 supports this.\n\nAnother possibility of forcing ASLR off to get the same bases every time a DLL is loaded did not work for me. For those who want to try it: Start a Visual Studio Developer prompt (yeah, you'd need VS) and type in\n\n```\neditbin /DYNAMICBASE:NO C:\\Game\\game.exe\n\n```\nIt should modify the PE header to disable ASLR in that executable and all DLLs it loads. But as said, it had no effect for me.\n\n",
      "votes": "4",
      "user": "Ray",
      "time": "Jan 8, 2021 at 15:32",
      "is_accepted": true,
      "comments": []
    }
  ]
}