{
  "title": "Log all client requests? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/6416/log-all-client-requests",
  "content": "I'm working with Burp 1.6. Intercept is off, and I want to log all client requests.\n\nVisiting Burp's help page on logging page, there's supposed to be an Options tab or Misc tab (I can't quite ll which it should have). Unfortunately, I don't see either of them. The tabs I have are Targets, Proxy, ..., Alerts. There is an Option tab, but it does not provide any logging options. Only Authentication, Upstream Proxy, etc.\n\nWhere, exactly, do I ensure logging of all requests (and responses) is enabled?\n\n",
  "votes": "1",
  "answers": 2,
  "views": "277",
  "tags": [
    "dynamic-analysis",
    "proxy"
  ],
  "user": "jww",
  "time": "8 years ago",
  "comments": [
    {
      "user": "Jason Geffner",
      "text": "This question is off-topic because it is not about reverse engineering, but rather about using an information security tool. Please post to security.stackexchange.com instead.",
      "time": null
    },
    {
      "user": "jww",
      "text": "@Jason - according to the Help Center, both (1) software analysis and (2) tools commonly used for reverse engineering hardware or software are on-topic a RE.SE.",
      "time": null
    },
    {
      "user": "jww",
      "text": "@Jason - I'm using it to reverse a communication protocol; not find web vulnerabilities.",
      "time": null
    },
    {
      "user": "Guntram Blohm",
      "text": "Reversers are much more likely to use tools like wireshark, and the average security specialist is likely to have more experience with burp than the average network protocol reversal specialist. So, no matter if the question is on- or offtopic, the security.stackexchange.com community will be more experienced and more likely to be able to answer the question, especially as there are no answers after 15 hours,",
      "time": null
    },
    {
      "user": "NirIzr",
      "text": "I'm voting to close this question as off-topic because after reviewing the answers, this indeed seems more appropriate to other SE sites",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You seem to have missed the second tab panel.\nAfter selecting Options in the first tab panel, there is an Misc item in the second tab panel, which seem to be what you are searching.\n\n",
      "votes": "2",
      "user": "SleepProgger",
      "time": "Oct 15, 2015 at 17:07",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Try Fiddler2 instead of BurpSuite.\nIt will log anything (I've had apps that Burp couldn't catch, only Fiddler or Wireshark)\nEach situation requires a different tool.\nAlso, on a lower level, use Wireshark.\n\n",
      "votes": "0",
      "user": "Filipe YaBa Polido",
      "time": "Oct 16, 2014 at 0:12",
      "is_accepted": false,
      "comments": []
    }
  ]
}