{
  "title": "Ollydbg and IDA Pro unable to attach to process",
  "link": "https://reverseengineering.stackexchange.com/questions/6427/ollydbg-and-ida-pro-unable-to-attach-to-process",
  "content": "I have a target application protected with CrypKey.\nWhen i try to attach to the apps in OllyDbg and Ida Pro i receive Unable to attach to this process.\n\nThe bad news is that i want to unpack the main exe after executing of Crypkey loader but after patching main exe and loader to obtain an infinite loop at the end of the code of the loader i am unable to attach to main exe and reach the OEP.\n\nDo you know how or why i am unable to attack? A good solution in this cases?\n\nThank you very much\n\nSee image below:\n\n\n\n",
  "votes": "2",
  "answers": 2,
  "views": "11k",
  "tags": [
    "ida",
    "ollydbg",
    "anti-debugging"
  ],
  "user": "itseeder",
  "time": "Oct 11, 2014 at 16:07",
  "comments": [
    {
      "user": "0xec",
      "text": "You can find interesting anti-attach tricks here",
      "time": null
    },
    {
      "user": "itseeder",
      "text": "Thank you i had see it but my case is different. The problem is that Crypkey loader is attached to main exe as ring 3 debugger. If i try to terminate Crypkey loader also the main exe will terminate. I am stucked here...",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Debug the loader.\n\nSet a breakpoint on CreateProcess (or ZwCreateProcess if needed)\n\nWhen the breakpoint is hit modify the process creation flags on the stack to include CREATE_SUSPENDED. \nMake sure to remove any debugging related flags such as DEBUG_ONLY_THIS_PROCESS etc.\n\nSingle step over the CreateProcess call. At this point, the child process would be created in a suspended state. Now you should be able to attach a debugger to this.\n\n",
      "votes": "3",
      "user": "0xec",
      "time": "Oct 11, 2014 at 16:43",
      "is_accepted": true,
      "comments": [
        {
          "user": "itseeder",
          "text": "The main exe run the loader code that debub the main exe as ring 3 debugger so CreateProcess will be called to instantiate the loader and not the main exe. i am able to debug loader and see the int 3 opcode replaced at runtime in the main exe. At the end of this process i need to return to main exe and continue debugging to reach the OEP. I am unable to do it because the main exe refuse to be attached as process from any debugger. I hope that now the scenario it's more clear.",
          "time": null
        },
        {
          "user": "0xec",
          "text": "@Seed3Key So essentially you mean that the main exe spawns the loader process & the main exe cannot be debugged. If such is the case check whether you can attach to the main process before the loader process is created. If you cannot, then the main exe may well be debugging itself.",
          "time": null
        }
      ]
    },
    {
      "content": "Use a anti-anti-debug plugin that supports \"kill anti-attach\" like ScyllaHide\n\n",
      "votes": "1",
      "user": "pHiL",
      "time": "Oct 11, 2014 at 15:48",
      "is_accepted": false,
      "comments": []
    }
  ]
}