{
  "title": "App prints debug strings but no OutputDebugString used",
  "link": "https://reverseengineering.stackexchange.com/questions/6473/app-prints-debug-strings-but-no-outputdebugstring-used",
  "content": "An application I'm reversing frequently outputs debug strings. Some of them could aid me in locating the code I'm looking for, but somehow, the app doesn't seem the be using OutputDebugString at all (I've used IDA's Imports window, Olly's Search for intermodular calls, and dumpbin /IMPORTS). The program only imports native Windows DLLs and one custom library which does call the function, but I've checked it and all its debug strings are internal stuff, there's no exported logging function for my exe.\n\nAdditionally, the debug strings being printed cannot be found inside the exe (again, tried both Olly and IDA). \n\nIs it possible that the call is somehow hidden by not using WinAPI? Since the program is in no way protected, I find the use of any such techniques highly unlikely, but could that be why I can't find anything using \"ordinary\" methods?\n\n",
  "votes": "2",
  "answers": 3,
  "views": "944",
  "tags": [
    "windows",
    "debuggers"
  ],
  "user": "user4520",
  "time": "Oct 15, 2014 at 19:08",
  "comments": [],
  "answers_data": [
    {
      "content": "Ollydbg\n\nAlt+O -> events -> check mark break on debug string on break \n\nHit Alt+K to view call stack\n\nWinDbg\n\n```\nsx- -c \"kc\" out\n\n```\nThis will print the call stack automatically on each and every DebugString.\n\n```\n0:000> g\n\nThis is from Win32Api\nGoing deeper now\n\nkernel32!RaiseException\nkernel32!OutputDebugStringA\ndbgprints!wmain\ndbgprints!__tmainCRTStartup\nkernel32!BaseProcessStart\nhello from ntdll!DbgPrint \n\n\nntdll!vDbgPrintExWithPrefix\nntdll!DbgPrint\ndbgprints!wmain\ndbgprints!__tmainCRTStartup\nkernel32!BaseProcessStart\n(5d8.950): Unknown exception - code eaceba5e (first chance)\nThis String is from RaiseException argument 1\n\n```\n",
      "votes": "3",
      "user": "Thomas Weller",
      "time": "Nov 14, 2014 at 1:50",
      "is_accepted": true,
      "comments": [
        {
          "user": "user4520",
          "text": "Found it using only OllyDbg and your method - I guess the \"Accept\" goes to you sir.",
          "time": null
        }
      ]
    },
    {
      "content": "Some debuggers can pause the program when it prints a debug message. Then you can go up the stack trace and see whence it is coming.\n\n\n\n",
      "votes": "2",
      "user": "Igor Skochinsky",
      "time": "Oct 16, 2014 at 10:26",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Set a breakpoint on OutputDebugString(); when the breakpoint hits, check the callstack to find the source of the call.\n\nThen the strings aren't being output by the executable. Attach WinDbg to your system and set breakpoints on nt!DbgPrint and nt!DbgPrintEx; when the breakpoint hits, check the callstack to find the source of the call.\n\n",
      "votes": "1",
      "user": "Jason Geffner",
      "time": "Oct 15, 2014 at 19:19",
      "is_accepted": false,
      "comments": [
        {
          "user": "user4520",
          "text": "I can't, that's the point - it doesn't seem to be called, yet the strings are output.",
          "time": null
        },
        {
          "user": "user4520",
          "text": "About the edit: that's what I was talking about - thanks :)",
          "time": null
        }
      ]
    }
  ]
}