{
  "title": "What is a good tools to reverse the effects of Minify on JavaScript?",
  "link": "https://reverseengineering.stackexchange.com/questions/64/what-is-a-good-tools-to-reverse-the-effects-of-minify-on-javascript",
  "content": "Are there any scripts and/or online tools that can reverse the effects of minification?\n\nI'm specifically looking to unminify a minified JavaScript file.  Variable renaming is not a big issue, I want it sufficiently readable to be able to analyze the execution.\n\n",
  "votes": "33",
  "answers": 5,
  "views": "26k",
  "tags": [
    "obfuscation",
    "javascript"
  ],
  "user": "WPrecht",
  "time": "Mar 20, 2013 at 18:23",
  "comments": [
    {
      "user": "user187",
      "text": "Just before anyone goes all downvoty, it's OK to ask and answer your own question. It's cool, actually, and helps the site! Good question, WPrecht :-)",
      "time": null
    },
    {
      "user": "WPrecht",
      "text": "Thanks. I had assumed we were to do stuff like this in the closed beta to help seed the site.",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@Keelan: unfortunately some people disagree. Point in case",
      "time": null
    },
    {
      "user": "SamB",
      "text": "@0xC0000022L Er ... that's deleted. Is that your case?",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "@SamB not the fact that it's deleted. No. It has been deleted within the last six years (in fact it got deleted about one month after it got closed which was approximately at the time of my comment). With enough reputation you'd still be able to see it, though.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Your question title indicates merely reversing minified code, and not necessarily understanding it. But if you are attempting to gain an understanding of it, Opera Dragonfly sounds like a tool you may find very useful...\n\nI have always used Dragonfly for analyzing minified code. In addition to having a pretty printer, it also has incredibly handy analysis functionality.\n\nHere is jQuery.min in all it's minified glory...\n\n\nThe button I circled here is the pretty printer which suddenly turns the code into something like this:\n\n\nWhich is a nice start, but it is still very difficult to understand without some idea of what it looks like during execution.\n\nFirst you need to determine what part of a minified file's functionality you are trying to understand. Event breakpoints are incredibly handy for this because you can set them for almost any user input, or on an element's load. For example, if I wanted to see what happens in jQuery when a mouseover event occurs, I could add an event breakpoint for \"mouseover\". That way I can see where the entry point into the code is when I move my mouse over a specific element.\n\nWhen your code hits a breakpoint, you get into a mode where you can, like in many DOM debuggers, interact with the current state of the code you are inspecting. But you are able to do it by hovering the mouse over sections of code so it's really quite easy to keep the code context in mind.\n\n\n\nYou can also inspect scope and who references what from the \"State\" sub-tab in the Scripts tab in the same way as you can with the source window. So you can see if a variable overrides another, or if fancy closure magic is happening somewhere, or what scope a variable actually originated from. Also if you look at a DOM element, you can mouse over that to highlight it on the page. (See last picture.)\n\n\n\nThe Dragonfly console also has this mouseover functionality... Also everything has tab completion, so you can execute any code from any state, inspect at any level of execution, reassign variables, run tests, or just navigate around with [Tab] completion to do just about anything to figure out what the code you are looking at does.\n\n\nOpera's inspector will definitely aid in reversing and understanding minified or obfuscated code.\n\n",
      "votes": "22",
      "user": "Archenoth",
      "time": "Mar 21, 2013 at 6:55",
      "is_accepted": false,
      "comments": [
        {
          "user": "Erran Morad",
          "text": "So minifiers replace function names, variables etc with short meaningless names? Is it possible to get the original code back under any circumstances of is it impossible ?",
          "time": null
        },
        {
          "user": "Archenoth",
          "text": "Unfortunately not. Without access to the original code itself, there's no way to know what anything used to be named. (Also, this was written a pretty long time ago before Opera switched it's internals, so it's not really accurate. Currently the best debugger imo is actually in Chrome now--a lot has changed since 2013)",
          "time": null
        }
      ]
    },
    {
      "content": "I prefer to use the pretty printer inbuilt in Google Chrome's Developer Tools.\n\nHere is the minified Code:\n\n\nOn pressing the pretty print button, you get the following:\n\n\n",
      "votes": "16",
      "user": "Devdatta Tengshe",
      "time": "Mar 21, 2013 at 5:16",
      "is_accepted": false,
      "comments": [
        {
          "user": "Erran Morad",
          "text": "So minifiers replace function names, variables etc with short meaningless names? Is it possible to get the original code back under any circumstances of is it impossible ?",
          "time": null
        }
      ]
    },
    {
      "content": "A good place to start is JSBeautifier. In general, it depends on the minify method that was used.  This one formats the code and has lots of options.  It can also unpack \"packed\" scripts (packed with Dean Edward's packer).  A handy variant of this code is available as a Firefox plugin Javascript Deminifier.\n\n",
      "votes": "8",
      "user": "WPrecht",
      "time": "Mar 20, 2013 at 18:40",
      "is_accepted": false,
      "comments": [
        {
          "user": "Erran Morad",
          "text": "So minifiers replace function names, variables etc with short meaningless names? Is it possible to get the original code back under any circumstances of is it impossible ?",
          "time": null
        },
        {
          "user": "WPrecht",
          "text": "If the function and variable names have been replaced, there's no way back to their original names.",
          "time": null
        }
      ]
    },
    {
      "content": "I recently tried http://www.jsnice.org/ on 50+KB of a single minified JavaScript file containing lots of dynamic modification code that Cordova's runtime refused to execute (for an app targeted at Windows Phone 8.1 and Windows 10). The results were amazing as it recognises matching code fragments that are available unminified from thousands of opensource projects. I hope it helps you and others in future.\n\n",
      "votes": "6",
      "user": "JulianHarty",
      "time": "Feb 10, 2017 at 18:21",
      "is_accepted": false,
      "comments": [
        {
          "user": "Stuart P. Bentley",
          "text": "jsnice is the best. Minification isn't worth much when the variable names aren't refactored back, and none of the other items on this list will do that for you.",
          "time": null
        }
      ]
    },
    {
      "content": "https://unminify.com/\nFree tool to unminify (unpack, deobfuscate) JavaScript, CSS, HTML, XML and JSON code, making it readable and pretty.\n\n",
      "votes": "0",
      "user": "Guest",
      "time": "Jan 26, 2022 at 12:33",
      "is_accepted": false,
      "comments": []
    }
  ]
}