{
  "title": "Importing C header file with memory location definitions",
  "link": "https://reverseengineering.stackexchange.com/questions/6651/importing-c-header-file-with-memory-location-definitions",
  "content": "Bear with me as I am new to IDA and have not managed to find an answer to my question on google or other related outlets.\n\nI am reversing a firmware blob from an ARM device of which I have a c header file defining various memory locations as follows:\n\n```\n#define IO_LCD_OUT 0x4000000\n\n```\nIs there a way I can load this header file into IDA in order to redefine immediate values?\n\nFor Example, instead of:\n\n```\nMOV     R12, #0x4000000\n\n```\nCould IDA instead print:\n\n```\nMOV     R12, IO_LCD_OUT\n\n```\nAre there other ways to acheive this outcome aside from how I am trying to approach this? I have the header file with memory locations defined and would like to load that information into ida!\n\nI have tried to parse it using File -> Load File -> Parse C Header File and have had no luck! \n\n",
  "votes": "7",
  "answers": 2,
  "views": "2k",
  "tags": [
    "ida"
  ],
  "user": "Thomas",
  "time": "Nov 18, 2014 at 14:44",
  "comments": [
    {
      "user": "Jason Geffner",
      "text": "What error message(s) are you getting when you try Parse C Header File?",
      "time": null
    },
    {
      "user": "Thomas",
      "text": "I'm not getting any error messages, it loads the file perfectly fine. I just don't know how to change the way the immediate values are displayed. When I right click 0x4000000 for example, there are no options that allow me to define it as the variable in the header file",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can use custom enumerations here.\n\nYou can speed up things by:\n\n",
      "votes": "5",
      "user": "Igor Skochinsky",
      "time": "Nov 18, 2014 at 12:23",
      "is_accepted": true,
      "comments": [
        {
          "user": "w s",
          "text": "Will you have ability to cross reference addresses mentioned in defined constants ( for example #define IO_LCD_OUT 0x4000000 ) ? If yes, how is it possible ?",
          "time": null
        },
        {
          "user": "Igor Skochinsky",
          "text": "No, currently cross-references to enums are not maintained, though we're considering adding this feature.",
          "time": null
        },
        {
          "user": "Orwellophile",
          "text": "@IgorSkochinsky How can one perform Synchronize to idb from IDAPython?",
          "time": null
        }
      ]
    },
    {
      "content": "Importing header files will not do this work because there is no general way to find out meaning of any defined constant.\n\nYou'll need to do some manual work for it.\n\nI handling this problem as follows (it requires some IDA scripting, but it should be easy):\n\nAs far as I know there is no general solution for this problem in IDA for now.\n\n",
      "votes": "3",
      "user": "w s",
      "time": "Nov 18, 2014 at 7:38",
      "is_accepted": false,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "When the values are referring to memory and are not just flags or whatnot, this is probably the better approach.",
          "time": null
        }
      ]
    }
  ]
}