{
  "title": "How to decipher \"offset Filename\" as second parameter for lstrcpy() function using IDA PRO?",
  "link": "https://reverseengineering.stackexchange.com/questions/6667/how-to-decipher-offset-filename-as-second-parameter-for-lstrcpy-function-usi",
  "content": "I have the following lines in IDA PRO:\n\n```\n lea  eax, [ebp+Filename]\n push  offset Filename     ;lpString2\n push  eax                 ;lpString1\n call  ds:lstrcpyA\n ...\n\n```\nSo, I know what the function lstrcpy() does. It copies the string at offset Filename into the buffer pointed to by eax. But when I click on offset Filename to navigate to the string, I see the following :\n\n```\nchar Filename[]\nFilename      db 54h dup(0)\n\n```\nThen, I highlight that 54h part of the line and click on the button A, but it causes the error message:\n\n```\nCommand \"MakeAscii\" failed\n\n```\nSo, what can I also do to find out the string which is copied to the buffer ? \n\n",
  "votes": "1",
  "answers": 1,
  "views": "749",
  "tags": [
    "assembly"
  ],
  "user": "user3097712",
  "time": "Apr 23, 2015 at 21:59",
  "comments": [
    {
      "user": "Guntram Blohm",
      "text": "Probably the file name isn't fixed in the code, but gets generated by the program before it reaches your code. Put the cursor on 'Filename' and press x to get cross-references there, this might give you a hint where the filename is written.",
      "time": null
    },
    {
      "user": "SSpoke",
      "text": "Double Click on Filename and it will show the bytes and might even show the string if you are lucky. Opps sorry didn't fully read the question you already did that and it shows 54h dup(0) which means 84 zero's 54h means 54 hexadecimal size of string.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "X to cross reference and see where it's written. The decision to do that might be dynamic enough to evade initial auto analysis in which case run the code and set a watchpoint.\n\n",
      "votes": "1",
      "user": "offbyseveral",
      "time": "Nov 24, 2014 at 17:39",
      "is_accepted": false,
      "comments": []
    }
  ]
}