{
  "title": "How to hack a digital photo frame to remove JPEG compression?",
  "link": "https://reverseengineering.stackexchange.com/questions/6764/how-to-hack-a-digital-photo-frame-to-remove-jpeg-compression",
  "content": "I have purchased this digital photo frame:\n\nhttp://www.globalshiping.com/en/usb-24-tft-16mb-digital-photo-frame-flash-can-store-32-of-your-favorite-photos.html?language=en&currency=USD[1]\n\nI am not sure whether it's the software or the hardware that is doing the JPEG compression, but it's absolutely terrible, especially for text, makes things unreadable.\n\nI would like to either completely remove the compression or lessen it, and it would be perfect. Does anyone have any advice on how to achieve this?\n\nOr do you know someone that could do it for me? I would be willing to send you one of them to do so and pay you for your time.\n\nUPDATE: I have done more research on this, apparently some people have hacked this particular type of photo frame with the APPOTECH AX205 Chipset for various functions.\n\nBelow are links referring to this:\n\nhxxp://bastel.dyndns.info/~dockstar/lcd/\n\nhxxp://flux242.blogspot.com/2012/02/digital-picture-frame-as-router-status.html\nhxxps://forum.openwrt.org/viewtopic.php?id=34133\nhxxp://picframe.spritesserver.nl/wiki/index.php/DPF_with_AppoTech_AX206\nhttp://openschemes.com/2011/08/23/our-turn-with-the-ax206-digital-photo-frames/2/\n\nThe last link provides a development handbook for it: hxxp://openschemes.com/wp-content/uploads/2011/08/ax206_dh_v0.0.2_en_working.pdf\n\nThe last section shows compression rates. So it seems like this is done in hardware, and since others have downloaded, modified, and then uploaded firmware back to the device, is there a way for me to change the compression rate to 0, and upload new firmware to it? I don't even need to store alot of images, 10-15 would be enough. Even at 100% quality in photoshop, a 320x240 image is roughly 100KB so it would be plenty. Please advise. Thank you.\n\nEDIT 2: I've downloaded the firmware from the device, and disassembled it. Unfortunately I do not know how to interpret/read the output to change what I need to.\n\n;2008-09-26\nDB 0,0 ; Max photo supported is 0, i.e. no limit. First digit is\n; low byte. Second digit is high byte.\nDB 1 ; Photo format in 4:1:1 or 1:1:1\nDB 92 ; Compression quality: 1 – 100\n\nThat is the section with the pertinent information. So all I would need now is to change the pertinent section, recompile the bin, and upload back onto the device. Anyone?\n\n",
  "votes": "0",
  "answers": 0,
  "views": "2k",
  "tags": [
    "hardware"
  ],
  "user": "Ben",
  "time": "Dec 9, 2014 at 22:21",
  "comments": [
    {
      "user": "Igor Skochinsky",
      "text": "Does the frame compress files your upload, or it's displaying already compressed files badly? Can you explain a bit more how you're using it?",
      "time": null
    },
    {
      "user": "Ben",
      "text": "When you connect the frame via USB a program called DPFMate pops up for you to be able to upload the pictures. I suspect the software is doing the JPEG compression.  Even if i resize the pictures exactly, it still has JPEG artifacts on it after it is loaded on to the screen.",
      "time": null
    },
    {
      "user": "Guntram Blohm",
      "text": "This sounds very much like you need to hack DPFMate, not the hardware. But, as the photo frame claims to have a 320x240 display, it would need 320x240x3 ~ 230 KB per image, uncompressed. It says it can store 32 images in its 16 MB, which would leave 512 KB per image. Something fishy is going on here.",
      "time": null
    },
    {
      "user": "Jason Geffner",
      "text": "FYI, I just took a quick look at DPFMate.exe, and from a very cursory examination, it's simply a USB file-transfer tool; it doesn't appear to perform JPEG compression.",
      "time": null
    },
    {
      "user": "Ben",
      "text": "Please see my updates above for more information.",
      "time": null
    }
  ],
  "answers_data": []
}