{
  "title": "IDA Pro: Where does newly created structure go to from Pseudocode window?",
  "link": "https://reverseengineering.stackexchange.com/questions/6779/ida-pro-where-does-newly-created-structure-go-to-from-pseudocode-window",
  "content": "Where does newly created structure go to from Pseudocode window? I'm referring to structure that you create via right-click on variable and choosing \"Create new struct type\".\n\nI don't see new structure in View / Open Subviews / Structures but I'd like to modify it afterwards.\n\n\n\nI'm using IDA Pro 6.5\n\n",
  "votes": "2",
  "answers": 2,
  "views": "4k",
  "tags": [
    "ida",
    "hexrays"
  ],
  "user": "expert",
  "time": "Dec 7, 2014 at 19:50",
  "comments": [],
  "answers_data": [
    {
      "content": "The created types get added to the Local Types list (View->Open subviews->Local types, or Shift-F1). To jump directly to the specific type, choose \"Jump to local type...\" from the context menu on a variable of that type.\n\nYou can import any structure from Local Types to the Structures list by double-clicking it or selecting \"Syncronize to idb\" from the context menu.\n\nAdditionally, the structure gets imported automatically if you select \"Jump to structure definition\" (Z) on any of its fields in the pseudocode.\n\n",
      "votes": "2",
      "user": "Igor Skochinsky",
      "time": "Dec 7, 2014 at 20:56",
      "is_accepted": true,
      "comments": [
        {
          "user": "expert",
          "text": "Thank you! I have loosely related question. After I deleted local type my Decompiled got botched and I'm no longer able to use it (i.snag.gy/40Teb.jpg). How can I fix it ?",
          "time": null
        }
      ]
    },
    {
      "content": "Press Ins in the Structures view, press the Add standard structure button, and you'll find in that list the struct you created via the Pseudocode view, which you can then double-click to add it to the list of structures in the Structures view.\n\nUnintuitive, I know; it would be nice for it to automatically get added to the list of structures in the Structures view.\n\n",
      "votes": "1",
      "user": "Jason Geffner",
      "time": "Dec 7, 2014 at 19:59",
      "is_accepted": false,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "Seriously? You don't just use Local Types?",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "Oh yeah, looks like that would work too :)",
          "time": null
        },
        {
          "user": "KulaGGin",
          "text": "@IgorSkochinsky No, because when I press T in an operand to set a structure offset, only structures in the Structures window are available. Why is there 2 different sets of structures in the program? It's even bigger pain to work with them in Python.",
          "time": null
        }
      ]
    }
  ]
}