{
  "title": "General consensus on Lena's tutorials? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/6801/general-consensus-on-lenas-tutorials",
  "content": "I often see Lenas \"reversing for newbies\" talked about as a very solid introduction to reverse engineering. It uses OllyDbg as the primary program. (I'd be more interested personally in using IDA, however). Is that so? I'm very interested in getting more intense into my learning of reverse engineering, and I don't want to go too deeply if it won't provide me with a solid base.\n\nWhat's the general consensus on these tutorials, or is there something better out there?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "9k",
  "tags": [
    "ollydbg"
  ],
  "user": "galois",
  "time": "10 years ago",
  "comments": [
    {
      "user": "Guntram Blohm",
      "text": "I don't know these tutorials. It would help if you provided a link so people don't have to google for them. But a lot of what you'll have to learn is assembler language, OS calls, stack usage, file formats etc., and that isn't really dependent on tools. However, a tutorial that uses a debugger will be more likely to teach that than a tutorial that's about using IDA - IDA takes a \"higher level\" approach, and a lot about reversing is a good understanding of the \"low levels\".",
      "time": null
    },
    {
      "user": "galois",
      "text": "@Guntram Blohm, sorry, I think dummys beat me to it in the answer! I am familiar with x86 so far, but very unfamiliar with the other things you listed. Thanks",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The link is: https://tuts4you.com/download.php?list.17\n\nYou will learn how to crack software.\n\nTo start the best is to buy the book called \"Practical Reverse engineering\" link: http://www.amazon.com/Practical-Reverse-Engineering-Reversing-Obfuscation/dp/1502489309\n\nIf something is not clear for you in this book, then you must learn each topic like asm x86, asm x64 etc...\n\n",
      "votes": "3",
      "user": "dummys",
      "time": "Dec 11, 2014 at 22:24",
      "is_accepted": false,
      "comments": []
    }
  ]
}