{
  "title": "Reverse Engineering Quebec Canada PDF417 restaurant bills",
  "link": "https://reverseengineering.stackexchange.com/questions/6856/reverse-engineering-quebec-canada-pdf417-restaurant-bills",
  "content": "Let me explain what I'm trying to do, and then where I am at...\n\nAs you can see on this image :\n\n\n\nThere is a PDF417 at the end containing a string that at my best guess is some base64 string.\n\nHere it is :\n\nAnd when I decode it, I get the following :\n\n\n\nI kind of found the waitress name \"Julie\" and in front of it, there is a bunch of space characters, which I guess it is because there is a limited size to the name.\n\nSame for the bill number, and the table number.\n\nBut I was wondering what kind of information was in the previous bits, so any idea how to proceed to decode/decrypt this information would be greatly appreciated.\n\nThe machine used for the generation of the base64 string and its content is a \"AEC-6822\".\n\nAnd here is some unrelated information to what I'm trying to do, but may help... (I hope)\nhttp://www.revenuquebec.ca/documents/en/publications/in/in-577-v(2013-08).pdf\n\nThank you very much,\nANY help is greatly appreciated!\n\n",
  "votes": "8",
  "answers": 3,
  "views": "2k",
  "tags": [
    "decryption"
  ],
  "user": "user66792",
  "time": "Dec 19, 2014 at 17:05",
  "comments": [
    {
      "user": "Ilmari Karonen",
      "text": "Never mind the barcode, I'm wondering what those random(?) mathematical symbols at the bottom are about.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "From https://www.ctf.ca/ctfweb/Documents/PDF/2009ctj/09ctj4-ainsworth.pdf --\n\nSo apparently the previous bits in the barcode make up a digital signature, which would explain the high entropy.\n\n",
      "votes": "4",
      "user": "Jason Geffner",
      "time": "Dec 19, 2014 at 17:20",
      "is_accepted": true,
      "comments": [
        {
          "user": "user66792",
          "text": "Hey thanks, I have been looking up for days for this information, and you found it in minutes... sigh...",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "Happy to help. Here's the search that found it for me: google.com/… -- it's the third hit.",
          "time": null
        }
      ]
    },
    {
      "content": "I once had a set of receipts and chewed through the statistics of how often the symbols are repeated.  That shows that there most likely are 256 symbols, which would make the row of symbols contain 96 = 12 * 8 bits.\n\nhttps://www.ietf.org/mail-archive/web/81attendees/current/msg00986.html\n\nChecking the Unicode charts, almost all of the symbols are on the page U+22xx, \"Mathematical symbols\".  I haven't tracked down the rest, some of which are seriously obscure, but some seem to be sans-serif Hebrew letters. I am guessing that the symbols not in U+22xx are to replace some symbols on that page that are too much like others.\n\nThere doesn't seem to be any ordinary data processing purpose that the symbols could serve, since any information you wanted to be machine processable you'd put in the barcode.  My guess is that the symbols are a hash, summary, or subset of the information in the barcode and function as a \"receipt number\" that the recipient can read, so that if two buyers purchase the same thing, the establishment cannot give them two copies of one (recorded) receipt but rather has to record two receipts to give to each of them.\n\nThis explanation accounts for why the symbols are easily human recognizable.  It is also based on an experience in the Musée de la civilisation à Québec:  I purchased a tea from the cafe, and my companion purchased a tea as well, immediately after me, from the same cashier.  Our receipts had the same line of symbols, a surpasingly unlikely event, which suggests that we received duplicate copies of one recorded receipt.\n\n",
      "votes": "1",
      "user": "Dale",
      "time": "Sep 11, 2016 at 14:33",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Based on a few samples, here is an overview of some fields that can be read in clear.\n\nSource: https://github.com/fproulx/tastybits/blob/master/NOTES.md\n\nDatasets: https://github.com/fproulx/tastybits/tree/master/sample-data\n\n",
      "votes": "0",
      "user": "h3xStream",
      "time": "Jan 7, 2020 at 20:40",
      "is_accepted": false,
      "comments": []
    }
  ]
}