{
  "title": "Becoming A Better Reverse Engineer",
  "link": "https://reverseengineering.stackexchange.com/questions/6876/becoming-a-better-reverse-engineer",
  "content": "I have been looking on the net and all I see when it comes to reverse engineering are a bunch of silly crackme tutorials. I want to be better at taking code from assembly to c or c++. I am getting the feeling that I am going to have to have to pick this all in time and or make a bunch of small programs and break them apart.I would like to build on what might be already out there. I am already some what proficient in what I am doing just I want to be better.\n\nFor example:\n\n```\nmov     eax, DDrawPtr\npush    8\npush    1E0h\npush    280h\nmov     ecx, [eax]\npush    eax\ncall    dword ptr [ecx+54h]\n\n```\nHex-rays translates this as \n\n```\nv1 = (*(**DDrawPtr + 0x54))(*DDrawPtr, 640, 480, 8)\n\n```\nwhich is ok.... It should be .\n\n```\nHANDLE v1 = DDrawPtr -> SetDisplayMode(640,480,8);\n\n```\nor sometimes IDA makes mistakes and will say\n\n```\nint __cdecl sub_41B869()\n\n```\nWhere as this code doesn't return anything and is supposed to be a void....\n\nI found a neat question and answer here Stackoverflow question/answer.\nI am wanting to learn more like this because I am realizing that IDA makes mistakes. I want to know how to recognize function types and more importantly do this by hand, because I am seeing IDA make mistakes and I feel that I should learn to recognize better these mistakes and see how I can manually if need bring it back.\n\nHere is a book that does this somewhat but it goes from C to assembly not the other way around. reverse engineering pdf\n\nAny suggestions?\n\n",
  "votes": "9",
  "answers": 1,
  "views": "1k",
  "tags": [
    "decompilation",
    "c++",
    "c"
  ],
  "user": "LUser",
  "time": "Apr 13, 2017 at 12:49",
  "comments": [],
  "answers_data": [
    {
      "content": "These suggestions may help.  One sure way of becoming a better reverse engineer is to become a better \"forward engineer\"!  Here's what I would suggest:\n\nHope that helps.\n\n",
      "votes": "15",
      "user": "Edward",
      "time": "Dec 23, 2014 at 15:22",
      "is_accepted": true,
      "comments": []
    }
  ]
}