{
  "title": "Cannot run game TERA crashes on mov dword ptr ds:[3],0Dh",
  "link": "https://reverseengineering.stackexchange.com/questions/6915/cannot-run-game-tera-crashes-on-mov-dword-ptr-ds3-0dh",
  "content": "My computer meets all the requirements to play this game, I even ran the tool that comes with this game and it passes all checks, even found my graphics card on the list.\nThe game's URL is http://tera.enmasse.com/ and it's about 50 GB to download.\n\nNobody on the Tera customer support website could help me out as their advise is like get a anti-virus scan or run the program in Administrator Mode.\n\nI don't know much about reversing but I'm attempting to grasp it just to be able to play this game.\nBy understanding the WinDBG it seems to crash by accessing memory address 0x3 which doesn't make any sense to me. The game is also packed in Termida/WinLicense, can't unpack it as it keeps crashing during the process, but I managed to get a memory dump and a Dr. Watson crashdump.dmp.\n\nI posted screenshots of WinDBg below and a IDA PRO of the line that it seems to crash on any idea how to repair this?\n\nEverytime I attempt to load up the game I get this a Dr. Watson error box\n\n\n\n\n\n\n\n\n\n\n\nAnyone give me any advise how to fix this game so it loads up? Anything I need to install on my computer to make it run?\n\nHere is the game binaries and dll files.\nhttps://www.mediafire.com/?3g3ro8qt7hbaqr3\n\n",
  "votes": "1",
  "answers": 1,
  "views": "421",
  "tags": [
    "ida",
    "disassembly",
    "assembly",
    "decompile",
    "address"
  ],
  "user": "dfgdf gdfgfd",
  "time": "Dec 28, 2014 at 21:30",
  "comments": [],
  "answers_data": [
    {
      "content": "Based on TERA's message forums, it sounds like it's a poorly developed game. Running an AV product causes it to crash, running TeamSpeak causes it to crash, and using a firewall causes it to crash.\n\nRegarding the mov large dword ptr ds:3, 0Dh, my guess would be that this is code intended to force a crash, and sub_8130E0 logs error messages. The decompilation above may have effectively been written as:\n\n```\nif (InterlockedIncrement(...) == 1)\n{\n    Log_Error(...);\n    Log_Error(..., L\"\\r  \n\", ...);\n    if (something())\n    {\n        ...\n    }\n    FORCE_CRASH();\n}\n\n```\nYou may want to take a closer look at the data at off_203C1C8, unk_1BC2AE8, and a1 to get some more hints. But if it were me, I'd just uninstall the game and move on. I wouldn't be able to trust developers who forcibly crash their program if I have a firewall enabled.\n\n",
      "votes": "2",
      "user": "Jason Geffner",
      "time": "Dec 28, 2014 at 22:16",
      "is_accepted": false,
      "comments": [
        {
          "user": "SSpoke",
          "text": "Just can't resist not playing this game, is it possible to unpack even though it crashes so I could then step line by line to figure out what I need to install or update. I guess I'll just have to keep nopping the crashes and see what's up",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "Yes, it's possible to unpack, but StackExchange isn't an appropriate platform to give a walkthrough on unpacking Themida. And even if you did unpack it, it's not guaranteed that you'd be able to prevent the crash by installing or updating anything. If you really want to pursue this, I'd recommend getting in touch with TERA's support staff.",
          "time": null
        }
      ]
    }
  ]
}