{
  "title": "What is the linux equivalent to OllyDbg and Ida Pro?",
  "link": "https://reverseengineering.stackexchange.com/questions/6922/what-is-the-linux-equivalent-to-ollydbg-and-ida-pro",
  "content": "What is the Linux equivalent to OllyDbg and IDA Pro ? Or if there are multiple tools that do the various functions that OllyDbg and IDA Pro do, where can I find these tools? I'd like to start reversing some elf files on Linux and I'm just looking for a set of tools to get me started.\n\n",
  "votes": "31",
  "answers": 5,
  "views": "58k",
  "tags": [
    "linux",
    "debuggers",
    "disassemblers"
  ],
  "user": "k170",
  "time": "Jul 15, 2015 at 17:52",
  "comments": [
    {
      "user": "0xC0000022L",
      "text": "IDA Pro for Windows runs beautifully under Wine, so no problem to use it this way ... just sayin'.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Ida Pro runs on Windows, Linux and Mac OS, so i guess the Linux equivalent of Ida Pro is Ida Pro. The debugger that's used mostly seems to be gdb, possibly enhanced with a GUI.\n\nHopper and Radare2 run on Linux as well.\n\n",
      "votes": "33",
      "user": "Community",
      "time": "Apr 13, 2017 at 12:49",
      "is_accepted": true,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "IDA includes a debugger too",
          "time": null
        },
        {
          "user": "k170",
          "text": "Thank you for this answer. I had no idea that IDA Pro ran on Linux. Its been a while.",
          "time": null
        },
        {
          "user": "Maijin",
          "text": "@k170 a brief example of the Debugger with Visual view of Radare2. radare.tv/a/71",
          "time": null
        },
        {
          "user": "ikaerom",
          "text": "Meanwhile (2018 onwards) I would also suggest to use github.com/radareorg/cutter.",
          "time": null
        }
      ]
    },
    {
      "content": "edb is a cross platform x86/x86-64 debugger. It was inspired by Ollydbg, but aims to function on x86 and x86-64 as well as multiple OS's.\n\nhttps://github.com/eteran/edb-debugger\n\n",
      "votes": "12",
      "user": "firebitsbr",
      "time": "Aug 3, 2016 at 11:05",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "As an (2019) addition to all the other answers:\n\nTry Ghidra. \n\nIt is the Software Reverse Engineering (SRE) suit of the NSA and it's free and open source. It was leaked as part of Wikileaks' \"Vault 7\" but the NSA decided to release it and they published it as open source software. It's written in Java and is cross platform, supporting Windows, Linux and MacOS.\n\n",
      "votes": "6",
      "user": "NullDev",
      "time": "May 24, 2019 at 8:23",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I would say radare2. It is opensource fast moving project, and it has analysis capibilites similar to that of ida, and supports many architectures like x86 and the 64bit version of x86 plus lots of other architectures you might never hear of. It has nice command line interface and everything is somehow documented.\n\nIt comes with bunch of tools for analysing binary files, patching, generating shellcodes from C, bindiffing, assemblers, and debugging all by default.\n\n",
      "votes": "5",
      "user": "u185619",
      "time": "Sep 21, 2016 at 10:43",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "For gbd try fGs gdbinit\nThere is lldb, too. It's llvm debugger and it's scriptable in python\n\nP.S. I would have commented, but that would have required registering, and earning 50 reputation.\n\n",
      "votes": "3",
      "user": "asdf",
      "time": "Dec 30, 2014 at 11:54",
      "is_accepted": false,
      "comments": []
    }
  ]
}