{
  "title": "What tools are available to trace system resources a program is touching in windows?",
  "link": "https://reverseengineering.stackexchange.com/questions/8034/what-tools-are-available-to-trace-system-resources-a-program-is-touching-in-wind",
  "content": "What is the best tool to trace system resources a program is touching. For example, which registry keys, other files or DLLs it's loading, internet connections it's opening, etc...?\n\nI saw this question on reddit.com/r/ReverseEngineering and the mod had said it would be an excellent question for SE. After searching, I can't find a similar question asked.\n\nSo, what tool do you use/recommend for tracing system resources a program touches in the context of Windows 7/8?\n\n",
  "votes": "5",
  "answers": 1,
  "views": "8k",
  "tags": [
    "windows"
  ],
  "user": "Robert_Musser",
  "time": "Jan 16, 2015 at 20:44",
  "comments": [],
  "answers_data": [
    {
      "content": "\n\nWindows Performance Toolkit\nThe Windows Performance Toolkit (WPT, or xperf) is a free toolset from Microsoft that lets you see everything happening on your system in order to investigate otherwise invisible performance problems in your game. WPT can show Disk IO, registry access, GPU packets, page faults, context switches, kernel activity, and even has a sampling profiler, all integrated into one visualizer.\n\n\n\nAPI Monitor\nAPI Monitor is a free software that lets you monitor and control API calls made by applications and services. Its a powerful tool for seeing how applications and services work or for tracking down problems that you have in your own applications.\n\n\n\nSpyStudio\nSpyStudio shows and interprets calls, displaying the results in a structured way which is easy for any IT professional to understand. SpyStudio can show registry keys and files that an application uses, COM objects and Windows the application has created, and errors and exceptions\n\n\n\n",
      "votes": "7",
      "user": "0xec",
      "time": "Jan 17, 2015 at 5:24",
      "is_accepted": true,
      "comments": []
    }
  ]
}