{
  "title": "Repackaging APK file using baksmali and smali",
  "link": "https://reverseengineering.stackexchange.com/questions/8044/repackaging-apk-file-using-baksmali-and-smali",
  "content": "I am a student interested in Android Security. I was trying to modify a APK file using baksmali and smali. However, I am not able to run the repackaged app in my mobile. When I click on the icon it say \"Unfortunately, test has stopped\" and exists. (Even the icon of the app got changed, now I see default android icon instead of old real colorful icon of the app)    \n\nWhat could be the reason for this ? Actually I haven't even modified code of the apk file. I just unzipped apk to get dex file, then I converted it to smali using baksmali.jar, and then back to dex using smali.jar. Finally zipped and signed. \n\nWhat I have done in detail:\n\nNow I believe I have to sign the APK again, please correct me if am wrong here.\n\nEdited:\n\nWhy doesn't the repackaged app running ? I don't understand what I am missing here ?\n\nEdited:\n\nI tried to repackage the same app using apktool. I extracted the smali files using it and repackaged. But why repackaging is not working with baksmali, smali, zip and signapk. Is zipping the real problem in this procedure? I see the size of the app is reduced drastically when I zip it and rename it to .apk compared to the original apk file :| \n\n",
  "votes": "14",
  "answers": 8,
  "views": "41k",
  "tags": [
    "android",
    "apk"
  ],
  "user": "aMa",
  "time": "Feb 22, 2015 at 11:17",
  "comments": [
    {
      "user": "xDragonZ",
      "text": "You should check your logcat for more information, if possible please post the crash log too.",
      "time": null
    },
    {
      "user": "aMa",
      "text": "@xDragonZ,I  have edited the post. This time I tried to install using \"adb install\" and signed using signapk.jar. This time app got installed in phone. However, when I click on the app it crashes saying \"\"Unfortunately, app has stopped\". One thing I noticed is size of the repacked apk is lesser than the orginal, is it the zip tool reason for that change is size ? Any clue on why the app crashes ? How do I get a log for this? Thank you so much.",
      "time": null
    },
    {
      "user": "evlncrn8",
      "text": "perhaps you also need to zipalign the file?",
      "time": null
    },
    {
      "user": "diff",
      "text": "Are you deodexing (baksmali -x option) on purpose? You are it would appear that since you are performing this option, without providing a \"bootclasspath\" you're going to get some odd smali code that might not be able to converted back into a dex file.  Also, just remove the META-INF folder prior to zipping and trying doing zip -r unsigned.apk * inside the directory with all the contents.  If this still crashes, try posting the logcat output",
      "time": null
    },
    {
      "user": "0xC0000022L",
      "text": "So out of five answers not a single one is acceptable?",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I use apktool for this purpose, and a short little pair of shell scripts for decompiling and recompiling APKs:\n\nUsing apktool has the advantage of being able to view and edit all of the resources as well as the decoded manifest file.\n\n",
      "votes": "21",
      "user": "nneonneo",
      "time": "Jun 20, 2015 at 10:12",
      "is_accepted": false,
      "comments": [
        {
          "user": "Noury",
          "text": "This the only one method that works for me. I've tried dozens, none worked. Thanks a lot.",
          "time": null
        }
      ]
    },
    {
      "content": "After playing with smali/baksmali I got it working. I think you didn't use the recursive flag when zipping. This caused the res folder to be empty which caused the crash. Also I run zipalign after signing the apk.\n\nSteps:\n\n",
      "votes": "2",
      "user": "Gal",
      "time": "Oct 11, 2017 at 14:28",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I can't comment due to reputation, so I will post it here.\n\nSince the job is done correctly with the use of apktool, it seems to me that something is going wrong with the zip process.\n\nAfter repackaging the app, can you verify that the contents of the new APK are identical (as far as file names and structure is concerned) with the contents of the original one?\n\nEDIT: also, since the file is a .dex file, I don't think that you need the -x option in baksmali.\n\nEDIT2: When repackaging, you don't need to include the META-INF directory in the zip file. It will be created when signing the file.\n\n",
      "votes": "1",
      "user": "The Dart Code",
      "time": "Feb 19, 2015 at 13:33",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Using the deodex option \"-x\" is not required since you're not performing baksmali on an odex. Just run baksmali on the dex file. You can also use apktool to unpack/pack everything, which I think is easier.\n\n",
      "votes": "1",
      "user": "Michael Schwartz",
      "time": "Mar 12, 2015 at 2:24",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "Tool Fully automated with GUI..\nIt's updated with recent android framework so no resource decompile error and better handling.\n\nhttps://www.dropbox.com/s/02ifm4veotiuik1/apkstudio-2.0.3b-windows-Updates-Framework.rar?dl=0\n\nAnd this small Paper which includes Tuts on reversing android apps and all basic info regarding to modify/handling apk.\n\nhttps://www.dropbox.com/s/nkkmp4ait71kjku/Android%20Application%20Reversing%20Via%20Android%20Mobile.pdf?dl=0\n\n",
      "votes": "1",
      "user": "perror",
      "time": "Jul 5, 2015 at 14:38",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "If you are interested in Anroid apps RE, then you shall find better tools to use regularly.\n\nWell, one of the tools is Android Cracker Kit (which I developed), it gives you all what you need: Android Cracker Kit (ACK):\n\n",
      "votes": "0",
      "user": "0xC0000022L",
      "time": "Apr 13, 2016 at 15:08",
      "is_accepted": false,
      "comments": [
        {
          "user": "Behrouz.M",
          "text": "Broken link. please fix it.",
          "time": null
        },
        {
          "user": "Yaser Alnajjar",
          "text": "here you go: forum.exetools.com/showthread.php?t=16538",
          "time": null
        },
        {
          "user": "0xC0000022L",
          "text": "@raypixar: link was not broken, just slow.",
          "time": null
        }
      ]
    },
    {
      "content": "I use APK Editor Pro to edit APKs right from my Android device!\n\nhttps://play.google.com/store/apps/details?id=com.gmail.heagoo.apkeditor.pro\n\n",
      "votes": "0",
      "user": "Tyler Brownfield",
      "time": "May 4, 2016 at 19:51",
      "is_accepted": false,
      "comments": [
        {
          "user": "Zekitez",
          "text": "Great tip. The generated apk does not install correctly with the above (de)compile script (why ?) but replacing the classes.dex did it.",
          "time": null
        }
      ]
    },
    {
      "content": "Step 4. You forgot to do it recursively. It won't copy the files in /res when you zip it. Add -r option.\n\n```\nzip -r test.zip AndroidManifest.xml classes.dex res META-INF resources.arsc\n\n```\nStep 6. You don't need to sign it again since you re-packed it with META-INF directory to your apk already. Signing info is inside META-INF.\n\n",
      "votes": "0",
      "user": "Hao Liu",
      "time": "Aug 20, 2016 at 1:10",
      "is_accepted": false,
      "comments": []
    }
  ]
}