{
  "title": "A wiki for IDA? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/8068/a-wiki-for-ida",
  "content": "Everyone knows the state of IDA's documentation... There is a bit of info in idc.idc and the SDK headers, there's Chris Eagle's book (which predates quite a few advances in IDA), and there's the occasional juicy tidbit in the blogs of Ilfak, Igorsk, Daniele and the others.\n\nBut by and large there's mostly Google, reversing IDA.WLL, and copious experimentation. Which means that it's often much slower going than we would like, and quite often things require a lot more effort than necessary because we're unaware of some trick, twist or workaround that somebody else has already discovered. \n\nThe perfect solution would be a community wiki. So, is there a wiki for all things IDA? \n\nIf so then all serious spelunkers needs to know about it: it ought to be linked from here, from IDA's home site and major RCE gathering places...\n\nIf there's no wiki yet then we ought to do something about it (like badgering Ilfak).\n\n",
  "votes": "7",
  "answers": 1,
  "views": "565",
  "tags": [
    "ida",
    "idapython",
    "idapro-sdk"
  ],
  "user": "DarthGizka",
  "time": "8 years ago",
  "comments": [
    {
      "user": "rev",
      "text": "Would help newbies a lot, would have helped me too when I didn't know how to use it. Good idea imo, +1",
      "time": null
    },
    {
      "user": "DarthGizka",
      "text": "LOL: \"Copyright 2003 by |nAbOo| - Don't make this tutorial public and don't give it away!!!\" Apart from that I'm not so much interested in tutorials as in a place where hard-won insights into IDA can be deposited, and found by others. And where I can go look to find out what's really going on. E.g. why calling set_idc_getattr with the result of a previous call - or that of a call to get_idc_getattr - will fail and crash IDA when your plugin is unloaded (it's because IDA returns \"\" for an empty method but you have to pass 0 to reset, not \"\" which fails and leaves things as they are)",
      "time": null
    },
    {
      "user": "DarthGizka",
      "text": "At the moment there doesn't even seem to be one single place where IDC syntax is explained concisely and correctly - i.e. including try ... catch and the fact that objects are associative arrays that are indexed with strings using the . operator instead of [], and for any object o, o.foo == getattr(o, \"foo\") and o[n] == getattr(o, n) == getattr(o, ltoa(n,10)), but o[\"foo\"] is not accepted. Or that ltoa() is really ultoa() (i.e., ltoa(-1,10) is not \"-1\" but \"4294967295\" or \"18446744073709551615\").",
      "time": null
    },
    {
      "user": "rev",
      "text": "@Devolus ida-pro.wikia.com done. I'll be adding info every now and then, and everybody can colaborate!",
      "time": null
    },
    {
      "user": "julian",
      "text": "I'm voting to close this question as off-topic because it should be asked on meta RE.SE rather than here",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I just created a wikia for IDA Pro.\n\nDo add your contributions there! :)\n\nI'll also be adding some info every now and then.\nIt is a community wiki, so please do no evil! =P\n\n",
      "votes": "6",
      "user": "rev",
      "time": "Feb 9, 2015 at 19:54",
      "is_accepted": true,
      "comments": [
        {
          "user": "NirIzr",
          "text": "This now redirects to a \"Not a valid community\" page.",
          "time": null
        }
      ]
    }
  ]
}