{
  "title": "Looking for the specific text in EXE file",
  "link": "https://reverseengineering.stackexchange.com/questions/8131/looking-for-the-specific-text-in-exe-file",
  "content": "I want to find specific string in the EXE file but when I open the EXE file with OllyDBG and search for the All Referenced Strings I get bunch of texts in the comment area which are like this :\n\n```\n ASCII \"\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\\xDD\\xF5\\xE7\"...\n\n```\nWhat should I do? What if I don't find the text in OllyDBG through search but I know it exists in the application (EXE file) ?\n\n",
  "votes": "4",
  "answers": 2,
  "views": "11k",
  "tags": [
    "ollydbg",
    "strings"
  ],
  "user": "FreeMind",
  "time": "Jan 30, 2015 at 14:58",
  "comments": [],
  "answers_data": [
    {
      "content": "(From user11623's answer): Upon opening your file on OllyDbg, press Alt+M. This will show you the whole memory map for your file. Press Ctrl+B for the search window. Try both ASCII and Unicode.\n\nIf the text is generated on runtime, you can use a tool that prevents process termination(such as this). Run your file. If your file is now in the memory, you can use WinHex or HxD to search for the string in memory. Just open your running process in the mentioned Hex viewers and do a search (Ctrl+F). Try the search for both ASCII and Unicode.\n\n",
      "votes": "5",
      "user": "Community",
      "time": "Apr 13, 2017 at 12:49",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "in ollybbg goto View>>select Memory or press alt+M\nrighclick in memory window and select search.\nyou do this way after and before run program,if text not found.also you can search stack window and dump window, these are below the CPU window.\nsorry my english is poor\n\n",
      "votes": "0",
      "user": "user11623",
      "time": "Jan 31, 2015 at 8:55",
      "is_accepted": false,
      "comments": [
        {
          "user": "user11623",
          "text": "also you can use the PEiD>>plugins>>String Viewer",
          "time": null
        },
        {
          "user": "Dominik Antal",
          "text": "Cheat Engine is also an option to search string values.",
          "time": null
        }
      ]
    }
  ]
}