{
  "title": "How was Playstation Portable hacked? How is custom firmware developed? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/8212/how-was-playstation-portable-hacked-how-is-custom-firmware-developed",
  "content": "How was PSP hacked?\nOn first hand, how do people rip the binary out of PSP? I am just curious how all those hardware reverse engineering works. \n\nP.S. Is there a PSP Custom firmware developer community around? \n\n",
  "votes": "1",
  "answers": 2,
  "views": "3k",
  "tags": [
    "firmware",
    "hardware",
    "mips"
  ],
  "user": "Jin Suk Park",
  "time": "10 years ago",
  "comments": [
    {
      "user": "Guntram Blohm",
      "text": "This blog seems to be by a group that hacked at least some consoles. Obviously, you need a lot of time, skill and resources to do this.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I don't know the whole story but AFAIK the initial release of PSP did not use encryption or code signing, so a skilled person was able to make custom code run based off a game. This was used to explore and document the system and develop a customSDK.  later firmware updates did implement encryption, but by this time hackers were able to debug code, so they could analyse the firmware update and extract the keys from it. \n\n",
      "votes": "1",
      "user": "Igor Skochinsky",
      "time": "Feb 12, 2015 at 21:40",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "To answer the question, how did reverse engineers hack the psp? \n\nLike this: \n\nhttp://hackaday.com/2011/03/13/reverse-engineering-the-psp/\nhttp://sec.pn.to/pw/?plugin=attach&pcmd=open&file=tapping.jpg&refer=Bases\n\nFirst the reverse engineer rips the machine apart, and checks all of its components. Then he finds points of interaction. Perhaps the machine has a debugger port, like a JTAG. From there, the engineer attempts to circumvent any security which prevents him from dumping the firmware image. For this stage, researching the exact functionality of each hardware component is critical. \n\nIn the link I gave above, the engineer figures out how the NAND chips communicate by guessing various pin configurations. He then uses that knowledge to overwrite parts of memory, and observe the boot up process. Once you understand how the device's operating system boots, it is often possible to overwrite security protections which are selected during boot. Essentially force the device to boot into developer mode, where it may allow you to view sensitive information. \n\nUsually the firmware image wont have source files. It will be a binary dump, which the reverse engineer may disassemble for further analysis. If you are lucky you will be able to dump a the entire file system, or the kernal the device is running. \n\nOnce the reverse engineer is possession of the firmware image, if it is the goal to recreate their own firmware, they may begin writing it based on the firmware image: \n\nlike this: \n\nhttps://github.com/uofw/uofw\n\nIf you are interested in reverse engineering sony products: \n\nSony's game consoles are kind of unique in terms of computers. They are usually not set up like a typical x86 computer. \n\n",
      "votes": "1",
      "user": "MrSynAckSter",
      "time": "Feb 12, 2015 at 23:07",
      "is_accepted": false,
      "comments": [
        {
          "user": "Igor Skochinsky",
          "text": "Cell was PS3; ps4 is practically off- the -shelf amd64 system with FreeBSD kernel. And even Cell was using PowerPC-based instruction set, which is not exactly obscure",
          "time": null
        },
        {
          "user": "MrSynAckSter",
          "text": "Fixed. Off by one error ;)",
          "time": null
        },
        {
          "user": "MrSynAckSter",
          "text": "Also, while the instruction set is not obscure, programmers have complained quite a bit about cell architecture being hard to use. It does introduce complexities that you have to understand.",
          "time": null
        }
      ]
    }
  ]
}