{
  "title": "Unpacking UPX packed (possibly scrambled) executable",
  "link": "https://reverseengineering.stackexchange.com/questions/8268/unpacking-upx-packed-possibly-scrambled-executable",
  "content": "I've decided to reverse this crackme. Obviously it's packed. I was told by PeID that there is only UPX inside. Ok, but upx -d simple crashed that's why I've concluded that this UPX may be scrambled somehow.\n\n\n\nBinary didn't run properly in debugger(windbg) for unpacking it so I've dumped exe from working process and tried to fix imports. Maybe I should have tried Olly with plugins? However IDA still warns me that some imports might be destroyed(see picture). My question is: did I unpacked it correctly? If no what else should I do to unpack it?\n\nUnpacked\n\n",
  "votes": "7",
  "answers": 2,
  "views": "52k",
  "tags": [
    "unpacking",
    "upx"
  ],
  "user": "see ya",
  "time": "Feb 18, 2015 at 7:47",
  "comments": [],
  "answers_data": [
    {
      "content": "Here you can find bunch of tools for unpacking upx. One of them(Upx Unpacker 0.2) solved my issue. Every unpacker should be used in specific case and this list  may be incomplete. \n\n",
      "votes": "11",
      "user": "see ya",
      "time": "Feb 23, 2015 at 12:04",
      "is_accepted": true,
      "comments": [
        {
          "user": "user966939",
          "text": "Thanks for sharing. upx (\"UPX 3.08w\") is the one that worked for me.",
          "time": null
        },
        {
          "user": "rollsch",
          "text": "There is a massive number of positive detections in those archives. Be extremely warey if you download! virustotal.com/en/file/…",
          "time": null
        }
      ]
    },
    {
      "content": "You should try to unpack it manually and reconstruct the IAT. With UPX, it should be pretty straightforward. Here is a tutorial in case you don't know how to start : https://web.archive.org/web/20080529124107/http://writequit.org/blog/?p=165\n\n",
      "votes": "4",
      "user": "Mohd Shahril",
      "time": "Sep 15, 2020 at 18:00",
      "is_accepted": false,
      "comments": [
        {
          "user": "see ya",
          "text": "I did not succeeded with unpacking my file according instructions in this tutorial, however, I've collected bunch of tools that will unpack almost any upx packed executable.",
          "time": null
        },
        {
          "user": "user2823000",
          "text": "You should really try to unpack UPX manually at least once to understand what's going on before using tools. Otherwise you'll be stuck when you hit a slightly custom packer or if there is a bug in your tool.",
          "time": null
        }
      ]
    }
  ]
}