{
  "title": "How to go into thread function knowing only the thread handle",
  "link": "https://reverseengineering.stackexchange.com/questions/8422/how-to-go-into-thread-function-knowing-only-the-thread-handle",
  "content": "How do I go into the thread function (so I can do step by step tracing), knowing only the handle to the thread. I am using OllyDbg for tracing and the thread is created through the API ZwCreateProcess(). However, the documentation that I have seen for this API does not contain the creation flags and pointer to the defined function which it will execute, which I both need.\n\nIs there a way to go into the thread function, knowing only the thread handle? Also, are there other ways to create suspended threads aside from CreateThread() and CreateRemoteThread()?\n\n",
  "votes": "2",
  "answers": 3,
  "views": "4k",
  "tags": [
    "ollydbg",
    "debugging",
    "thread"
  ],
  "user": "jowabels",
  "time": "Mar 10, 2015 at 5:59",
  "comments": [
    {
      "user": "PhoeniX",
      "text": "Can you check whether there was a previous call to  CreateProcess* API which created the process in suspended state? What do you mean by \"limits my ability to see\"?",
      "time": null
    },
    {
      "user": "jowabels",
      "text": "Actually I've just seen the thread creation API which is ZwCreateProcessEx. However, I cannot find any documentation as to the definition of the parameters of this API, thus I can't still see the thread function itself.",
      "time": null
    },
    {
      "user": "PhoeniX",
      "text": "As you are not providing enough information I'll try to guide you: 1. place break point (BP) on CreateProcessW and ZwCreateProcessEx to check what API is actually called to create the process. 2. Place BP on GetThreadContext and check whether it was hit. Please provide answers to that so we can provide meaningful answer for your context.",
      "time": null
    },
    {
      "user": "jowabels",
      "text": "I'm sorry for having insufficient info. As for your question, ZwCreateProcessEx was used to create the process and GetThreadContext was hit afterwards.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Yes, it's a 2-step process.\n\nStep 1 - Convert the thread handle to a thread ID\n\nIn Process Explorer's menu bar, check the following:\n\nNext, select your target process in Process Explorer's list of processes. You'll then see in the lower pane the list of handles for that process, including thread handles. Find the thread ID associated with your target handle. For the example below, thread handle 0x228 is associated with thread ID 3000:\n\n\n\nThough handle values are shown in hexadecimal in Process Explorer, thread IDs are shown in decimal. Thus thread ID 3000 in decimal is equal to thread ID 0xBB8 in hexadecimal.\n\nStep 2 - Find EIP for the thread ID\n\nIn OllyDbg's menu bar, select View → Threads. Right-click on the thread whose Ident corresponds to the thread ID you found in Step 1 (0xBB8 in the example below), and select Show registers:\n\n\n\nThis will show you the current EIP for that thread, which is the next instruction to be executed once that thread is resumed:\n\n\n\nAlternative Step 2 - Find EIP for the thread ID\n\nIf the target thread was created in a suspended state and not yet resumed then the thread won't show up in OllyDbg's thread window. In this case, you can use LiveKd to find the thread's starting address by issuing the LiveKd command !thread -t <thread ID in hexadecimal>\n\n```\nkd> !thread -t BB8\nCid handle table at 88e01108 with 944 entries in use\n\nTHREAD 86B4E548  Cid 169c.0bb8  Teb: 7ffdb000 Win32Thread: 00000000 WAIT: (Suspended) KernelMode Non-Alertable\nSuspendCount 1\nFreezeCount 1\n    86b4ec28  Semaphore Limit 0x2\nNot impersonating\nDeviceMap                 9a70f9e8\nOwning Process            86b4cd40       Image:         wordpad.exe\nAttached Process          N/A            Image:         N/A\nWait Start TickCount      21829348       Ticks: 1299 (0:00:00:20.264)\nContext Switch Count      1              IdealProcessor: 0\nUserTime                  00:00:00.000\nKernelTime                00:00:00.000\nWin32 Start Address 0x002cb23d\nStack Init 8b777ed0 Current 8b777a40 Base 8b778000 Limit 8b775000 Call 0\nPriority 8 BasePriority 8 UnusualBoost 0 ForegroundBoost 0 IoPriority 2 PagePriority 5\nChildEBP RetAddr  Args to Child\n8b777a58 82a88d3d 85807a60 00000000 82b35d20 nt!KiSwapContext+0x26 (FPO: [Uses EBP] [0,0,4])\n8b777a90 82a87b9b 85807b20 85807a60 85807c28 nt!KiSwapThread+0x266\n8b777ab8 82a8158f 85807a60 85807b20 00000000 nt!KiCommitThreadWait+0x1df\n8b777b34 82abbfd9 85807c28 00000005 00000000 nt!KeWaitForSingleObject+0x393\n8b777b4c 82abbaf4 00000000 00000000 00000000 nt!KiSuspendThread+0x18 (FPO: [3,0,0])\n8b777b90 82e2390f 00000000 00000000 00000000 nt!KiDeliverApc+0x17f\n8b777bb0 82e23b29 00000001 00000000 00000000 hal!HalpDispatchSoftwareInterrupt+0x49 (FPO: [Non-Fpo])\n8b777bc8 82e23ba9 00000000 00000000 8b777c20 hal!HalpCheckForSoftwareInterrupt+0x83 (FPO: [Non-Fpo])\n8b777bd8 82c6450d b553bcc6 00000000 00000000 hal!KfLowerIrql+0x61 (FPO: [Non-Fpo])\n8b777c20 82abb559 00000000 778870d8 00000001 nt!PspUserThreadStartup+0x14\n00000000 00000000 00000000 00000000 00000000 nt!KiThreadStartup+0x19\n\n```\nYou can see Win32 Start Address 0x002cb23d in the output above, which is the starting address for the suspended thread.\n\nYes, you can call ntdll!NtCreateThread() or ntdll!NtCreateThreadEx().\n\n",
      "votes": "3",
      "user": "Jason Geffner",
      "time": "Mar 10, 2015 at 13:34",
      "is_accepted": true,
      "comments": [
        {
          "user": "jowabels",
          "text": "Does this apply to suspended threads or processes? OllyDbg does not seem to show the thread that I wanted to see. Using the steps outlined above, I have seen this thread in Process Explorer but not in Olly.",
          "time": null
        },
        {
          "user": "blabb",
          "text": "if the CreateThread used CREATE_SUSPENDED ollydbg will not show the thread nor its registers only on subsequent SuspendThread / Resume Thread combo ollydbg will show the thread see my other answer for some work around",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "I've updated my answer above with an alternative solution that works for threads that were created in a suspended state.",
          "time": null
        },
        {
          "user": "blabb",
          "text": "@JasonGeffner Win32StartAddress is static initialized once it will not reflect the Threadprocs eip on subsequent resumes try sleeping in the threadproc and checking nt!_ethread Win32StartAddress",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "@blabb, the LiveKd approach above is only for the situation where the thread had never been resumed after being created in a suspended state. Otherwise, the OllyDbg approach above can be used.",
          "time": null
        }
      ]
    },
    {
      "content": "Based on provided information I suspect that the used method here is Dynamic forking of a process or as it also know process hollowing. The idea is to execute some arbitrary process in suspended state and replace its \"guts\" with the contents of another executable image. In general the idea could be implemented as following (based on Dynamic forking by Tan Chew Keong, 2004):\n\nSo, to answer your question I firstly suggest to verify that this indeed happens. Secondly, if it does you can do the following to break on the new created thread entry point. The proposed way is not the only one, but IMHO will be easy done taking into account your relatively small experience in RE/executable analysis:\n\nI hope this is understandable otherwise ask and I'll clarify. \n\n",
      "votes": "0",
      "user": "PhoeniX",
      "time": "Mar 10, 2015 at 12:19",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "if the Thread is Created Suspended and Resume thread is called for the first time ollydbg will not show the thread in its thread window nor will the stack trace for the thread be available in stack window (ALT+K)->Right Click->Thread ->Checkmark \n\nin such cases you can set a  breakpoint on  the following apis \n\nfollow through is based on xp sp3 layout (you may need a bit of tweking in newer os )\n\n```\n1) ntdll!NtContinue / ZwContinue  (can be found without symbol )    \n2) ntdll!ZwRegisterThreadTerminateport (can find this too without symbol)    \n3) CsrNewThread  (needs symbol)   \n4) BaseThreadStartThunk ditto    \n5) BaseThreadStart  ditto     \n\n```\nResume thread will break on either of these apis\n\nif it is broken on Zw/Nt Continue follow the context->eip from the stack [[esp+4] + 0xb8] and set a breakpoint on the eip found (this address normally will be BaseThreadStartThunk which is directly identifiable if you have public symbols loaded )  and hit go  once you are on BaseThreadStartThunk single step f8 few times until you get to an indirect call call dword ptr ds:[R32 + CONST]  this is your ThreadProc    \n\nif it is broken on ZwRegisterTerminatePort you need to just single step (you will return to csrNewThread which you can find if symbols are available) and keep f8ing until you get to the indirect call stated above to land on ThreadProc\n\nthe other apis are included in the above and can reduce the number of single step \n\nntdll!ZwRegisterThreadTerminatePort is the closest break prior to ThreadProc\n\nneeds one ctrl+f9 (execute until return) and 3 f8 (single step)\n\nif windbg / livekd is an option this script can retrieve the eip when broken on ResumeThread call be it  Firsttime Resume or subsequent resumes\n\n```\n.foreach /ps 8 /pS 0n19 (place { !process 0 4 ${$arg1} } ) {.printf \"ETHREAD = %x  \n\", place ; r? $t0 =  (((nt!_ETHREAD *) @@masm( place ))->Tcb) ; r? $t1 = @$t0.StackLimit;r? $t2 = @$t0.InitialStack;.foreach (vlace {s -[1]d @$t1 @$t2 0x23 0x23 } ) {dt nt!_KTRAP_FRAME DbgEip Eip  @@masm(${vlace}-34) }}\n\n```\n",
      "votes": "0",
      "user": "blabb",
      "time": "Mar 11, 2015 at 21:47",
      "is_accepted": false,
      "comments": []
    }
  ]
}