{
  "title": "How do you can you disassemble and dump an entire binary?",
  "link": "https://reverseengineering.stackexchange.com/questions/8568/how-do-you-can-you-disassemble-and-dump-an-entire-binary",
  "content": "It's easy to seek to a particular function and dump it's contents as Assembly language. However, I cannot find an obvious way to immediately disassemble and dump an entire binary. I want to use it more like I use IDA and objdump by seeing the entire disassembly at once. \n\n",
  "votes": "10",
  "answers": 2,
  "views": "14k",
  "tags": [
    "binary-analysis",
    "radare2"
  ],
  "user": "MrSynAckSter",
  "time": "Nov 10, 2018 at 10:25",
  "comments": [
    {
      "user": "MrSynAckSter",
      "text": "Visual mode actually does what I want for the most part. I'm open to other approaches, though.",
      "time": null
    },
    {
      "user": "R4444",
      "text": "one trick -  pd $s | less",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "You can use the special \"'$' variables\" $s to get the size of your binary, and pass it as an argument to the pd command to disassemble the whole file:\n\n```\n[0x004048bf]> pd $s\nDo you want to print 188.0K chars?\n\n```\nFor more information on '$' variables available see ?$?.\n\n",
      "votes": "13",
      "user": "Evan Carroll",
      "time": "Nov 10, 2018 at 10:25",
      "is_accepted": false,
      "comments": [
        {
          "user": "user",
          "text": "I usually use objdump -d binary | less command, is there anything similar can be done using r2. Just output the highlighted disassembly to stdout?",
          "time": null
        },
        {
          "user": "jvoisin",
          "text": "Why not using the radare2 shell instead? If you really want to disassemble the whole binary to stdout, you can use r2 -c 'pi $s', but it's much less convenient.",
          "time": null
        },
        {
          "user": "user",
          "text": "But it does not highlight the syntax, that is one of the reasons I am using radare2 - to get the highlighted syntax.",
          "time": null
        },
        {
          "user": "user",
          "text": "No, it did not disassemble the whole binary, it just disassembled _start function.",
          "time": null
        },
        {
          "user": "jvoisin",
          "text": "That's the whole point. Most of the time, you're like to explore the binary, to use r2's analysis capabilities, instead of dumping the whole disassembly. You can of course do that inside the shell with pi $s.",
          "time": null
        }
      ]
    },
    {
      "content": "If you want more like an Ida experience you could try the GUI project for Radare called Bokken. \n\nhttps://github.com/radare/bokken\n\nUpdate: it seems to have been superseded by the cutter project.\n\n",
      "votes": "3",
      "user": "julian",
      "time": "Nov 10, 2018 at 14:47",
      "is_accepted": false,
      "comments": [
        {
          "user": "jvoisin",
          "text": "Bokken is not really production-ready yet; I wouldn't recommend using it.",
          "time": null
        }
      ]
    }
  ]
}