{
  "title": "Fixing import table of unpacked DLL with ImpREC : ImpRec throws \"invalid OEP!\" error",
  "link": "https://reverseengineering.stackexchange.com/questions/8584/fixing-import-table-of-unpacked-dll-with-imprec-imprec-throws-invalid-oep-e",
  "content": "I am trying to unpack a DLL and fix the import tables with ImpRec. However, I am stuck with this error.  Following is what I have tried. \n\n\n\nWhy is this error? Any pointers to fix it? \n\n",
  "votes": "3",
  "answers": 2,
  "views": "5k",
  "tags": [
    "dll",
    "unpacking",
    "immunity-debugger",
    "dumping",
    "import-reconstruction"
  ],
  "user": "aMa",
  "time": "Oct 23, 2016 at 20:38",
  "comments": [],
  "answers_data": [
    {
      "content": "Your analysis machine is Windows 7, ASLR is modifying your module base addresses between different executions. \n\nTry calculating the offset to your OEP (that is, address - base) and using this value to calculate OEP address with the new base (base2 + offset)\n\n",
      "votes": "1",
      "user": "Carlos Garcia",
      "time": "Mar 28, 2015 at 18:14",
      "is_accepted": true,
      "comments": [
        {
          "user": "aMa",
          "text": "I just tried it with XP machine and it worked. Thank you.",
          "time": null
        },
        {
          "user": "aMa",
          "text": "However, it didn't work with windows 7. I tried to keep EOP as 7100000 (base address found by ImpREC) + BA2A0 (offset found in immunity) = 071BA2A0. Still same error.",
          "time": null
        },
        {
          "user": "aMa",
          "text": "I am again getting same error on XP. This is so weird. How do I find the the new base address, if the problem is ASLR?",
          "time": null
        }
      ]
    },
    {
      "content": "I think this is too late but let's reply though.\nBy default ImpREC has \"Use PE Header From Disk\" enabled. Which means it will NOT use the relocated DLL imagebase. 2 options :\n\n-> First choice is the best for your case.\n\nExplaination : the reason \"Use PE Header From Disk\" is enabled by default, comes from protector which destroys the header in memory so it's best to rely on disk but it's bad for DLL.\n\n",
      "votes": "2",
      "user": "Dessloch",
      "time": "Aug 23, 2016 at 16:52",
      "is_accepted": false,
      "comments": []
    }
  ]
}