{
  "title": "How should I approach debugging a PE which create a large database?",
  "link": "https://reverseengineering.stackexchange.com/questions/8718/how-should-i-approach-debugging-a-pe-which-create-a-large-database",
  "content": "I am reversing several modules which are dynamically and statically linked into an executable.  I have started learning active analysis by attaching one of my database files to the win32 exe using the local win32 debugger (default settings).  \n\nRelocating my idb's annotations to map correctly to the exe seems to be taking longer than it should.   I am currently doing static analysis by comparing one idb against a memory snapshot because the relocation time does not seem to be worth the wait.  This creates, what I think may be, unnecessary work because I have to manually copy the annotations from the single module idb to the snapshot idb.\n\nI want to find out if I can change how I use IDA to speed up relocation.  I have no notion of how long this should take given the database's and exe's size.  \n\n```\nidb:  ~133 Mb\nexe:  ~650 Mb     Size taken from task manager\nrelocation time:  ~15+ minutes\n\n```\nThis is very open ended.  I guess I'm looking for debugger settings, hidden annotation performance hits, etc.  If this is normal I will try to adjust my debugging practice to get the most out of a session.\n\n",
  "votes": "3",
  "answers": 1,
  "views": "581",
  "tags": [
    "ida",
    "debugging",
    "dynamic-analysis"
  ],
  "user": "question_asker_777",
  "time": "Apr 17, 2015 at 22:52",
  "comments": [],
  "answers_data": [
    {
      "content": "If the problem is the time it takes for IDA to rebase the IDB when debugging, then some possible solutions:\n\nHow to: Remove IMAGE_DLLCHARACTERISTICS_DYNAMIC_BASE (0x40) from IMAGE_NT_HEADERS.OptionalHeader.DllCharacteristics.\n\nHow to: change HKLM\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Memory Management\\MoveImages\n\nHow-to: \n\nSimply use different base addresses for all the DLLs (do not apply this on system DLLs).\n\nHow-to:\n\n",
      "votes": "5",
      "user": "Neitsa",
      "time": "Apr 18, 2015 at 12:41",
      "is_accepted": true,
      "comments": []
    }
  ]
}