{
  "title": "Protect data stored in binary",
  "link": "https://reverseengineering.stackexchange.com/questions/8793/protect-data-stored-in-binary",
  "content": "Let's say I've some function(i.e. hash function), that generates value from input seed and some precomputed hash values, that are stored somewhere in binary. What are the possible approaches for:\n\nI understand that the goal of complete algorithm concealment from reverser is impossible but what technique will raise the efforts to do this?\n\nMy thoughts on this topic:\n\nMaybe anybody have better concepts that will suit my goal and be so kind to post it here.\n\nP.S. please do not advice to use packers/protectors. False positive AV does not cost couple functions algorithm concealment.\n\nUPD\n\nHere is the implementation if string protection written in C++. I don't know if this solution be useful for other people but it's worth mentioning though. \n\n",
  "votes": "11",
  "answers": 2,
  "views": "3k",
  "tags": [
    "binary-analysis",
    "obfuscation",
    "static-analysis",
    "encryption"
  ],
  "user": "see ya",
  "time": "May 4, 2015 at 21:53",
  "comments": [],
  "answers_data": [
    {
      "content": "I would start with not have critical strings in memory in linear manner\n\nInstead each character can be offseted by some offset like by table mixing all the strings together. For example you got 0123456789 if you store them in memory like this:\n\n```\n|0x1xx2xxx3xxxx4|\n|xxxxx5xxxxxx6xx|\n|xxxx7xxxxxxxx8x|\n|xxxxxxxx9xxxxxx|\n\n```\nwhere x is anything or another string ... it is pretty hard to get the meaning.\n\nNext level is even better\n\n```\n//---------------------------------------------------------------------------\nconst int N=16384;\nchar txt[N];    // my texts\nint  ofs[N];    // randomized offsets\n//---------------------------------------------------------------------------\nvoid ofs_init()                 // randomize offsets\n    {\n    int i,j,a;\n    // here set RandSeed if you need to reproduce same behavior (like for using with files)\n    for (i=0;i<N;i++) ofs[i]=i;\n    for (i=0;i<N;i++) { j=Random(N); a=ofs[i]; ofs[i]=ofs[j]; ofs[j]=a; }\n    }\n//---------------------------------------------------------------------------\nvoid ofs_write(int adr,char a) // linear to ofset encoding\n    {\n    txt[ofs[adr]]=a;\n    }\n//---------------------------------------------------------------------------\nchar ofs_read(int adr) // linear to ofset decoding\n    {\n    return txt[ofs[adr]];\n    }\n//---------------------------------------------------------------------------\n\n```\nSo create offset table on runtime which will randomly map linear string offsets to nonlinear offsets. This is very hard to decode because it mixes all strings together (and if they are hashes) then without stepping is almost impossible to decode this (not knowing what it does of coarse).\n\nHere an example of how to use it and how output looks:\n\n```\n// [encode] + save to file for output comparison\n// AnsiString s holds oll my texts (an image in this case)\nRandomize();\nofs_init();\nfor (i=0;i<s.Length();i++) ofs_write(i,s[i+1]);\ni=FileCreate(\"picenc.txt\"); FileWrite(i,txt,N); FileClose(i);\n// [decode] you should not decode critical strings to memory rather decode each char only when needed instead\n// I decode the whole thing to save to file for output comparison\nfor (i=0;i<s.Length();i++) s[i+1]=ofs_read(i);\ni=FileCreate(\"picdec.txt\"); FileWrite(i,s.c_str(),s.Length()); FileClose(i);\n\n```\nAnd the results are like this:\n\n\n\nOn the left is decoded text picdec.txt and on the right is encoded text picenc.txt this is how the strings looks in memory.\n\nOn top of this you can add any kind of encryption (not only to text itself but to offset table also ...)\n\n",
      "votes": "9",
      "user": "Spektre",
      "time": "Sep 11, 2018 at 10:27",
      "is_accepted": true,
      "comments": [
        {
          "user": "see ya",
          "text": "Thanks for sharing your techniques! Can you please expand your second part of answer? If I got you correct all values are stored in large buffer and each copy of application is receive its own copy of rng code and the seed. So the full dynamic string/dword generation is achieved and there is no way to compute in statically without stepping through all rng?",
          "time": null
        },
        {
          "user": "Spektre",
          "text": "@seeya updated my answer see the example (used my image to ASCII Art conversion as source input to emphasize the position/pattern distortion)",
          "time": null
        }
      ]
    },
    {
      "content": "There are a number of ways to accomplish what you've stated.  Generally, more robust techniques, while affording a higher level of protection, will also put more burden on the programmer creating the software.  So in approximately increasing order of difficulty, here are some ideas:\n\nThe simplest approach is to simply not store the data contiguously.  That is, store the data in separate pieces and reassemble it at runtime just before you need it.  With this as with all of the other techniques, it's generally recommended to keep the value in memory for as short a duration as is practical.\n\nThere are many ways to obfuscate data.  One simple method is to simply XOR with some fixed constant.  A more sophisticated approach is to encrypt the data, but unless you have some secure way to store the encryption key, this might not actually offer that much more security.  One possibility would be to use a cryptographic hash of the entire program (minus the protected data) as the encryption key.  This would largely prevent alteration of the binary as well as providing a non-obvious way to store the key.\n\nIf you can avoid storing the data at all, we eliminate the problem of being able to derive it from static analysis.  If you are precomputing hashes of certain data for performance reasons, consider doing so at program startup instead of at compile time.  Alternatively, if the data is fixed, consider writing a polymorphic generator which could be included at compile time.  That is, write a program that takes a fixed constant and generates code which, when run, produces that value without explicitly including it.  Then link the generated code with your program.  Because the polymorphic generator would be part of the build process rather than part of the runtime, it is much less likely to trigger a A/V warning.\n\nI wrote a little program in C++ to more fully demonstrate this technique.  Here is the program:\n\n```\n#include <iostream>\n#include <cstdlib>\n#include <random>\n\nint main(int argc, char *argv[])\n{\n    std::random_device rd;\n    std::uniform_int_distribution<> r{-32768,32767};\n\n    for (int i=1; i < argc; ++i) {\n        int y = std::atoi(argv[i]);\n        int x;\n        for (x=r(rd); x==0; x= r(rd));  // make sure x!=0\n        int m = r(rd);\n        int b = y-m*x;\n        std::cout << \"int generate\" << i << \"(int x) { return x * \" << m << \" + \" << b << \"; }  \n\";\n        std::cout << \"\\tassert(\" << y << \" == generate\" << i << \"(\" << x << \"));  \n\";\n\n    }\n}\n\n```\nThis is a very simple program that takes a series of integers as input and creates one linear function per integer.  For example, with this command line:\n\n```\n./linear 39181 3802830 938833 -41418699\n\n```\nThe program generated the following output:\n\n```\nint generate1(int x) { return x * -5646 + 182450149; }\n    assert(39181 == generate1(32308));\nint generate2(int x) { return x * -14922 + 10696794; }\n    assert(3802830 == generate2(462));\nint generate3(int x) { return x * -15424 + -320805807; }\n    assert(938833 == generate3(-20860));\nint generate4(int x) { return x * -8144 + -127093579; }\n    assert(-41418699 == generate4(-10520));\n\n```\nThe asserts are simply there for documentation and testing.  In real usage, if you want to recreate the constant 39181 in your code, you would use generate1(32308).  If we rearrange the lines into a full program, we get this:\n\n```\nint generate1(int x) { return x * -5646 + 182450149; }\nint generate2(int x) { return x * -14922 + 10696794; }\nint generate3(int x) { return x * -15424 + -320805807; }\nint generate4(int x) { return x * -8144 + -127093579; }\n#include <cassert>\nint main() {\n    assert(39181 == generate1(32308));\n    assert(3802830 == generate2(462));\n    assert(938833 == generate3(-20860));\n    assert(-41418699 == generate4(-10520));\n}\n\n```\nObviously, you could multiply or concatenate these if you need longer numbers or strings, and my choice of linear functions with the random number value range I chose was entirely arbitrary.  Feel free to substitute and experiment.\n\nDepending on the environment, it may be possible to store the data remotely and then fetch it securely via something like HTTPS when and as needed.  Be aware that doing this could also mean that even an ordinary network outage or misconfigured firewall would render your software inoperable, but you can decide if that is acceptable for your purposes.\n\n",
      "votes": "6",
      "user": "Edward",
      "time": "May 5, 2015 at 16:01",
      "is_accepted": false,
      "comments": [
        {
          "user": "see ya",
          "text": "For me third method sounds extremely interesting and promising. Can you please either expand it with more possible implementation details or even ready-made solution of this technique if one exists?",
          "time": null
        },
        {
          "user": "Edward",
          "text": "I've updated my answer with code and a sample run, showing how this could work.",
          "time": null
        },
        {
          "user": "see ya",
          "text": "Thank you! I wish I could accept your answer too. Anyway take my upvote.",
          "time": null
        },
        {
          "user": "Edward",
          "text": ":)  No problem!  It was a fun problem to think about.",
          "time": null
        }
      ]
    }
  ]
}