{
  "title": "Is the security of this .net application flawed? [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/8800/is-the-security-of-this-net-application-flawed",
  "content": "Ok, I know that every obfuscated .Net application can be reverse engineered.\n\nAnd I know that it is better if I go the open source way if possible. But unfortunately I cannot because there is no copyright law to protect me where I live.\n\nSo I've come up with a plan to make it harder. Since I'm very very novice regarding the security I hope that you will help me find any loopholes in this plan.\n\nNow if someone cracks the program by bypassing the username/password check the file won't be sent from the server and he won't be able to get the file he wants, something similar software as a service.\n\nNow I want to know if this is the correct way to go? What suggestions to make it better?\n\n",
  "votes": "0",
  "answers": 1,
  "views": "59",
  "tags": [
    ".net",
    "software-security",
    "security"
  ],
  "user": "Vahid",
  "time": "9 years ago",
  "comments": [
    {
      "user": "svick",
      "text": "I don't understand the mention of open source. How could copyright law help you protect your application if you made it open source?",
      "time": null
    },
    {
      "user": "Vahid",
      "text": "I have not. I mean I cannot open the source to the public!",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "If the whole purpose of your application is to let the user input some data and then create a file in a specific file format from that data and you want to prevent unauthorized users from doing that, then yes, moving the file creation to a server will prevent that.\n\nThough there are still some things to keep in mind:\n\n",
      "votes": "2",
      "user": "Community",
      "time": "Jun 17, 2020 at 9:54",
      "is_accepted": false,
      "comments": [
        {
          "user": "Vahid",
          "text": "Thank you so much for the insight svick. Is it that easy to attack the server and steal the code? I'm going to get hosting service not a VPS. Will it be prone to attacks? I cannot make it web-based completely because it is a CAD program and needs its own interface other than a browser.",
          "time": null
        },
        {
          "user": "Vahid",
          "text": "The file itself cannot be reverse engineered. Because it is not trivial. It is a CAD file and is different for each user based on their data.",
          "time": null
        },
        {
          "user": "Vahid",
          "text": "The 2 things I'm concerned about are the attacks on the server and the fact that a user may share their username/pass with others. Any idea how to prevent this?",
          "time": null
        }
      ]
    }
  ]
}