{
  "title": "ELF: How to make IDA show me the correct PLT (Procedure Linkage Table) content?",
  "link": "https://reverseengineering.stackexchange.com/questions/8837/elf-how-to-make-ida-show-me-the-correct-plt-procedure-linkage-table-content",
  "content": "I would like to make IDA disassemble the .plt section of ELF files correctly, e.g. as objdump does: \n\n```\nobjdump -D -M intel asdf | grep \"Disassembly of section .plt\" -A80\n\n```\n\n\nI don't know why but IDA gives me this (Note the dw ? and dq ?):\n\n\nEven the IDA hexeditor does not show me the correct values at the corresponding addresses, but gives me ??s.\n\nI tried selecting and deselecting the settings described in the IDA Online help (search for \"PLT\") but this didn't help...\n\nHow can I configure IDA so that I can access the instructions in the .plt section of an ELF file with IDAPython?\n\n",
  "votes": "4",
  "answers": 1,
  "views": "5k",
  "tags": [
    "ida",
    "disassembly",
    "idapython",
    "elf",
    "plt"
  ],
  "user": "langlauf.io",
  "time": "May 13, 2015 at 16:50",
  "comments": [],
  "answers_data": [
    {
      "content": "For a 32bit (but not 64bit) x86 ELF binary, selecting the following options works:\n\n\n\n\n\nUPDATE:\n\nThere is a bug in IDA 6.8 (and probably earlier versions): For 64bit x86 ELF binaries, I get the desired disassembly result only when additionally deselecting \"Replace PIC form of ...\". \n\nThis was the reason for my confusion and made me post my question.\n\nHex-rays sent me a patch which fixed it (and which will probably be part of future versions... )\n\n",
      "votes": "2",
      "user": "langlauf.io",
      "time": "May 28, 2015 at 8:39",
      "is_accepted": true,
      "comments": [
        {
          "user": "user3097712",
          "text": "hello, how do you reach the settings \"ELF patching (for PIC) and viewing mode\" ? I can not find it",
          "time": null
        },
        {
          "user": "langlauf.io",
          "text": "@user3097712 : In the \"Load a new file\" window, select \"Loading options\". See the checkmark in the left-hand screen shot. After that, the window you are asking for should appear automatically after hitting ok in the \"Load a new file\" window. Please tell me if it works.",
          "time": null
        },
        {
          "user": "langlauf.io",
          "text": "@user3097712 : if this works for you, you can of course upvote my answer :- )",
          "time": null
        }
      ]
    }
  ]
}