{
  "title": "Counting offsets of structure fields [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/8877/counting-offsets-of-structure-fields",
  "content": "i have the following question:\n\nFor example, when I have the structure \n\n```\n    IMAGE_SECTION_HEADER STRUCT         |   C1    |    C2      \n    Name1                     BYTE      |   +0    |    +0\n    union Misc                          |\n        PhysicalAddress       DWORD     |    2    |     2\n        VirtualSize           DWORD     |    6    |\n    ends                                |\n    VirtualAddress            DWORD     |    10   |     6\n    SizeOfRawData             DWORD     |    14   |     10\n    PointerToRawData          DWORD     |    18   |     14\n       ...(etc.)\n\n```\nThen how I must count the offsets? The columns C1 and C2 represent my solutions but i am not sure which of the two is right or if both are wrong.\nDo I have to consider the union in the structure as 1 field, or do I need to consider its fields separately?\n\nbest regards, \n\n",
  "votes": "0",
  "answers": 1,
  "views": "363",
  "tags": [
    "struct"
  ],
  "user": "user3097712",
  "time": "9 years ago",
  "comments": [],
  "answers_data": [
    {
      "content": "A union is a list of fields starting at the same address in memory (except for bitfields, of course). Its size is at least the size of the largest field in it. In your case, it would be 4 bytes.\n\nNote that, like structs, the size can be bigger due to alignment requirements. For example, take this C union:\n\n```\nunion MyUnion {\n    char a[5];\n    int b;\n};\n\n```\nThe a fields is 5 bytes, b is 4. You would expect the union to be 5 bytes, but, as you can check with sizeof(union MyUnion), it is actually 8. This is because ints are aligned to a 4-byte boundary. Similiarly, shorts are aligned to 2 bytes and doubles to 8. Try it on CodingGround.\n\nYou may be asking yourself: why does the compiler align the union size? Isn't aligning the starting address enough? It could well keep the size of MyUnion to 5 and align the start to a 4-byte boundary for the int. The problem comes when you have an array of the union. An array needs to be a contiguous block of memory because of how array and pointer arithmetic works. Given a generic T array[] you have that array[i] == *(array + i) == *((T *) (((char *) array) + i * sizeof(T))). In the example case, MyUnion has a 4-byte alignment requirement (the largest aligment in the union). If you have a MyUnion array[], the starting address will be 4-byte aligned because of the int. This means that array[0] will be correctly aligned. But if the size of the union is 5, then array[1] will be at a 5 bytes offset from the starting address. This is not 4-byte aligned! Aligning the union size to 8 bytes puts array[1] to a 8 bytes offset, which is 4-bytes aligned. Aligning the size by padding the union allows the array to be contiguous while keeping everything aligned.\n\nBottom line:\n\nIn a union (or a struct), both the starting address and the size are aligned to the biggest alignment requirement of the fields.\n\nOf course, alignment requirements may vary between compilers and architectures. Keep that in mind.\n\nNeither C1 nor C2 is correct as far as I can see, since the first field is a byte and not two:\n\n```\nIMAGE_SECTION_HEADER STRUCT         |w/o align| aligned |\nName1                     BYTE      |   +0    |   +0    |\nunion Misc                          |   +1    |   +4    |\n    PhysicalAddress       DWORD     |         |         |\n    VirtualSize           DWORD     |         |         |            \nends                                |         |         |\nVirtualAddress            DWORD     |   +5    |   +8    |\nSizeOfRawData             DWORD     |   +9    |   +12   |\nPointerToRawData          DWORD     |   +13   |   +16   |\n   ...(etc.)\n\n```\n",
      "votes": "3",
      "user": "Andrea Biondo",
      "time": "May 13, 2015 at 13:04",
      "is_accepted": true,
      "comments": [
        {
          "user": "Andrea Biondo",
          "text": "Reading the answer again I realized I wasn't very clear. The int alignment is making the size 8 bytes. This has to do with arrays. I updated the answer, please check it. I also updated the CodingGound sample to show alignment.",
          "time": null
        }
      ]
    }
  ]
}