{
  "title": "Use OllyDbg to identify what happens when a button is pressed",
  "link": "https://reverseengineering.stackexchange.com/questions/8929/use-ollydbg-to-identify-what-happens-when-a-button-is-pressed",
  "content": "I am entirely new to reverse engineering, but nonetheless I have been given the challenge by a friend to crack a computer program he wrote. Having never done this before, my research online suggested that I use OllyDbg to search for an error message given when I try to give an invalid code. The problem is that if the code is invalid, the button to submit it is never enabled. Could I use OllyDbg to find what would happen if I were to click the button and then somehow override it?\n\nHere's all I know about the program:\n\nGiven that I have never dabbled in reverse engineering before, what would be my best plan of attack and how would I go about it?\n\n",
  "votes": "5",
  "answers": 4,
  "views": "6k",
  "tags": [
    "ollydbg",
    "crackme"
  ],
  "user": "DaveTheMinion",
  "time": "May 19, 2015 at 12:38",
  "comments": [
    {
      "user": "Dominik Antal",
      "text": "I suggest you to go trough Lena's tutorials to get familiar with the basics.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "If you have very little experience in binary RE I would suggest to start with preparing for a lot of unknown information that would be \"thrown\" on you, time and patience :-). \n\nNow to the subject. To do the work your are talking about, you'll need tools and you need to know them well:\n\nNext, supposedly the binary is not obfuscated:\n\nAfter the above, I would also suggest, as @Dominik did, go over the fist Lena's tutorials, to cover all the needed info for your type of binary.\n\nI think the above can pretty much get you to the key you are looking for.\nAdd more info from the ongoing analysis and we will try to provide another help.\n\nGood luck!\n\n",
      "votes": "6",
      "user": "DaveTheMinion",
      "time": "Oct 5, 2016 at 17:32",
      "is_accepted": false,
      "comments": [
        {
          "user": "DaveTheMinion",
          "text": "Thank you for your explanation. This is likely going to take me some time since not only do I not know anything about reverse engineering, but I have no past experience with using OllyDbg either, so I have two learning curves here.",
          "time": null
        }
      ]
    },
    {
      "content": "I assume your friend did not utilize tricks like anti-debugging and packing the binary, as your first challenge. Assuming is not right for an answer, so you should provide more details next time :) How I would approach this:\n\n",
      "votes": "3",
      "user": "perror",
      "time": "Jun 9, 2015 at 7:02",
      "is_accepted": false,
      "comments": [
        {
          "user": "DaveTheMinion",
          "text": "Thank you for your explanation. This is likely going to take me some time since not only do I not know anything about reverse engineering, but I have no past experience with using OllyDbg either, so I have two learning curves here.",
          "time": null
        },
        {
          "user": "Dominik Antal",
          "text": "If you listen to me you start with Lena's tutorials, that's really the best I've found so far, and explains everything from the beginning. Also it focuses exactly on these kind of applications that your friend made for you.",
          "time": null
        },
        {
          "user": "DaveTheMinion",
          "text": "I am checking out Lena's tutorials right now.",
          "time": null
        }
      ]
    },
    {
      "content": "The explanation below goes only for native apps:\nIf you want to understand how to find out where buttons' events occur, I advice you to learn coding in these languages: ASM, C++, and Delphi (at least get a general approach about them). Then, try to find where the event occurs of your code in the compiled file.\n\nUse google translation for this page, I wrote about this stuff once:\nhttp://www.at4re.com/f/showthread.php?11276\n\n",
      "votes": "2",
      "user": "Yaser Alnajjar",
      "time": "May 22, 2015 at 9:51",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jongware",
          "text": "\"Delphi\" is not a language, it's an IDE. The language is an object-oriented dialect of Pascal.",
          "time": null
        },
        {
          "user": "Yaser Alnajjar",
          "text": "\"Delphi\" is a language...  wiki: en.wikipedia.org/wiki/Delphi_(programming_language)",
          "time": null
        }
      ]
    },
    {
      "content": "Set a breakpoint on the beginning of that function, hit that breakpoint, and step through to see what happens. That's the most cut and dry answer there is really.\n\n",
      "votes": "1",
      "user": "nrocboc",
      "time": "Oct 6, 2016 at 4:49",
      "is_accepted": false,
      "comments": []
    }
  ]
}