{
  "title": "How to find compressed or encrypted parts in a packed executable?",
  "link": "https://reverseengineering.stackexchange.com/questions/8940/how-to-find-compressed-or-encrypted-parts-in-a-packed-executable",
  "content": "I want to analyze an executable that went through a packer to look for the parts that have been compressed or encrypted. Of course, it also means that I want to find the code for the decompression or decryption procedures in the executable. How can I find these ?\n\n",
  "votes": "1",
  "answers": 2,
  "views": "533",
  "tags": [
    "static-analysis",
    "executable",
    "encryption",
    "decryption",
    "decompress"
  ],
  "user": "Alireza Jafari Fard",
  "time": "Jun 17, 2015 at 7:19",
  "comments": [
    {
      "user": "Jason Geffner",
      "text": "Generically for all executables packed with any packer? Or generically for all executables packed with a specific packer? Or specifically for a single executable packed with a specific packer?",
      "time": null
    },
    {
      "user": "Alireza Jafari Fard",
      "text": "Generally for all packer and all executable.If packer Specified, this work is easy",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "A good way to find compressed or encrypted parts in a binary is entropy investigation, as compressed and encrypted parts show a high degree of disorder (a value of 1 means maximum disorder). I can recommend the tool binwalk which produces a graphical output of the memory's entropy. The picture shows a binwalk output, as an example of such a static analysis of an embedded device, showing typical entropies of different memory parts.\n\n\nThe bottom part is an overlay of the corresponding Ida memory map.\n\n",
      "votes": "4",
      "user": "josh",
      "time": "Jun 16, 2015 at 23:14",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "For most packers out there:\n\n",
      "votes": "3",
      "user": "Jason Geffner",
      "time": "May 21, 2015 at 15:22",
      "is_accepted": false,
      "comments": []
    }
  ]
}