{
  "title": "Analyze a created thread after main thread",
  "link": "https://reverseengineering.stackexchange.com/questions/8957/analyze-a-created-thread-after-main-thread",
  "content": "during an analysis, I had the following situation: The main thread allocates some space, the base address is 002E0000. Then it put opcodes (of the new thread) to that place. So, 002E0000 was the starting address of the new thread and later it called CreateRemoteThread() API and Ollydbg switchs to 002E0000 (dwCreationFlags was set to 0 , so the new thread started immediately)\n\nNow, my question: When I try to set a BP on one of the virtual addresses of the new thread, I get the following error message. \n\n\n\nI also tried on Hardware BPs but it did not help. Why I can not set the BP ? In the main thread, everything was ok. How can I bypass this to analyze the new thread with all the BP setting features of Ollydbg ? Note: I am using Ollydbg v1.10\n\nbest regards, \n\n",
  "votes": "2",
  "answers": 1,
  "views": "242",
  "tags": [
    "assembly",
    "ollydbg",
    "breakpoint",
    "error-messages"
  ],
  "user": "user3097712",
  "time": "Oct 19, 2015 at 22:27",
  "comments": [],
  "answers_data": [
    {
      "content": "The warning message in the screenshot is telling you that you can set the BP.\n\n",
      "votes": "2",
      "user": "Jason Geffner",
      "time": "May 22, 2015 at 15:30",
      "is_accepted": false,
      "comments": [
        {
          "user": "user3097712",
          "text": "yes, but when I set the BP and make one step (F7 or F9 or let it run), I never hit the BP and the process terminates itself. Sry, I should add this to my post.",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "Are you sure the code is being injected into the current process? Or is it being injected into a different process?",
          "time": null
        },
        {
          "user": "user3097712",
          "text": "I have a call to GetCurrentProcess() in the previous lines",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "Please create a new question then regarding the BP not being hit, since it's very different than your current question about not being able to set a BP.",
          "time": null
        },
        {
          "user": "user3097712",
          "text": "I think I've solved the problem. There was an anti-debug mechanism between the current line and the BP. A typical \"BeingDebugged\" - trick.",
          "time": null
        }
      ]
    }
  ]
}