{
  "title": "Load IE symbols in Immunity Debugger",
  "link": "https://reverseengineering.stackexchange.com/questions/9006/load-ie-symbols-in-immunity-debugger",
  "content": "I know Immdbg already recognizes Windows internals function names, like kernel32.dll and user32.dll\n\nWhat I want is to load Internet Explorer symbols the same way WinDbg does. Does someone knows it is possible, like mshtml.dll?\n\n\n\n",
  "votes": "5",
  "answers": 1,
  "views": "2k",
  "tags": [
    "immunity-debugger",
    "debugging-symbols"
  ],
  "user": "jyz",
  "time": "May 28, 2015 at 14:50",
  "comments": [],
  "answers_data": [
    {
      "content": "Immunity Debugger 1.60 and above supports loading of PDB Symbol files both locally or from a symbol server. In order to enable it.\n\n\n\n\n\nUPDATE\n\nIf ImmDbg successfully loaded the pdb symbol for the specified file, you would get a message in the logs in the form Debugging Information (DIA Format) available below the dll loading event. See the image below for reference.\n\n\n\nIf even after all this, you cannot load the appropriate symbol for a file, then \n\nIn such a case you can run the symcheck tool provided with windbg. Example usage\n\n```\nC:\\Program Files\\Debugging Tools for Windows (x86)>symchk C:\\WINDOWS\\system32\\kernel32.dll /s C:\\WINDOWS\\Symbols\n\nSYMCHK: FAILED files = 0\nSYMCHK: PASSED + IGNORED files = 1\n\nC:\\Program Files\\Debugging Tools for Windows (x86)>symchk C:\\WINDOWS\\system32\\mshtml.dll /s C:\\WINDOWS\\Symbols\nSYMCHK: mshtml.dll           FAILED  - mshtml.pdb mismatched or not found\n\nSYMCHK: FAILED files = 1\nSYMCHK: PASSED + IGNORED files = 0\n\n```\nUPDATE 2\n\nScreenshot of Immunity Debugger with symbols for mshtml.dll loaded. This is taken from Windows XP SP3.\n\n\n\nOther Info: ImmDbg could not download symbols from the MS Symbol Server, so had to use the symcheck tool to download symbol for mshtml.dll .\n\n```\nsymchk /r c:\\windows\\system32\\mshtml.dll /s SRV*c:\\symbols\\*http://msdl.microsoft.com/download/symbols \n\n```\nThe symbol directory should look like this.\n\n```\nC:\\symbols>dir\n Volume in drive C has no label.\n Volume Serial Number is 042A-A7E6\n\n Directory of C:\\symbols\n\n06/05/2015  12:39 PM    <DIR>          .\n06/05/2015  12:39 PM    <DIR>          ..\n04/15/2008  09:21 AM         7,965,696 mshtml.pdb\n06/05/2015  11:17 AM                 0 pingme.txt\n\n```\nNext, pointed ImmDbg to C:\\symbols\\. Used loaddll to load mshtml.dll and it automatically picked up the symbol on loading. This can also be seen in the logs.\n\n\n\n",
      "votes": "6",
      "user": "0xec",
      "time": "Jun 5, 2015 at 7:13",
      "is_accepted": true,
      "comments": [
        {
          "user": "Dominik Antal",
          "text": "Just a note, you can also download the symbol file from here.",
          "time": null
        },
        {
          "user": "jyz",
          "text": "I've already done this however look at the image I've updated in my question... the functions name are not shown",
          "time": null
        },
        {
          "user": "0xec",
          "text": "@jyz What does ImmDbg log says? If it indeed loaded the pdb file it would be written in the logs as Debugging Information (DIA Format) available below the dll loading event.",
          "time": null
        },
        {
          "user": "jyz",
          "text": "@ExtremeCoders I tried again, again but this message is not shown. Also, When I start \\Program Files(x86)\\Microsoft Internet Explorer\\iexplorer.exe and navigate mshtml.dll is never loaded! I'm checking in ALT+E and ALT+L modules... any idea?",
          "time": null
        },
        {
          "user": "0xec",
          "text": "@jyz You can use the symcheck tool to manually download the symbols, put it in a local symbol folder, point ImmDbg to it and it should load it automatically. Additionally the symbol support in ImmDbg seems to be immature, so you may encounter problems.",
          "time": null
        }
      ]
    }
  ]
}