{
  "title": "Generating function signatures based on source code WITHOUT compiling",
  "link": "https://reverseengineering.stackexchange.com/questions/9031/generating-function-signatures-based-on-source-code-without-compiling",
  "content": "I'm currently exploring some binaries in IDA aided by source code for some of the functions.\nSome functions are easily found using strings, while others are less easily found.\n\nI don't have access to the compiler due to various reasons. Meaning I can't use the obvious solution of compiling the source and creating signatures with something like IDB2PAT or rizzo.\n\nHow can I create function signatures from the sources without compiling?\n\n",
  "votes": "2",
  "answers": 1,
  "views": "1k",
  "tags": [
    "ida"
  ],
  "user": "Eli K",
  "time": "May 30, 2015 at 18:21",
  "comments": [],
  "answers_data": [
    {
      "content": "Creating signature files for IDA is a 2-step process:\n\nThe tools that come with IDA's FLAIR toolset allow you to automatically generate PAT files for OMF, COFF, ELF, PSX, and Trimedia libraries. The toolset also includes the PAT-to-SIG compiler.\n\nEven though you don't have the library binaries (and thus can't automatically generate the PAT files), given the fact that the PAT file format is documented in the FLAIR toolset's pat.txt file, you can write your own tool to generate a PAT file or even create the PAT file manually (and then compile it to create your signatures file).\n\nHowever, since the patterns are based on the compiled bytes, you'd still need a binary form of the library code, so you'd still might as well use IDB2PAT or IDB2SIG. In other words, if you can't compile the source code and can't (or don't want to) identify the library functions in your IDB, then you're not going to be able to create traditional IDA signature files for that library code.\n\n",
      "votes": "2",
      "user": "Jason Geffner",
      "time": "May 30, 2015 at 20:23",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jason Geffner",
          "text": "(Note that you need to be a licensed IDA user in order to have the credentials to download the FLAIR toolset linked above.)",
          "time": null
        },
        {
          "user": "Eli K",
          "text": "The PAT file relies on the first 32 bytes of the function and several other features. As you already said it requires knowledge of the compiled bytes (and specific compiler flags for optimization btw) so your solution is not really a solution to my problem. using IDB2PAT will require manually identifying hundreds of functions. I'm looking for an automated process.",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "I didn't promise a solution to your problem; I answered the question you asked. Q: \"How can I create function signatures from the sources without compiling?\" A: \"if you can't compile the source code and can't (or don't want to) identify the library functions in your IDB, then you're not going to be able to create traditional IDA signature files for that library code.\"",
          "time": null
        }
      ]
    }
  ]
}