{
  "title": "\"Sound Box\" Custom Message",
  "link": "https://reverseengineering.stackexchange.com/questions/9041/sound-box-custom-message",
  "content": "I am trying to put a custom message on a \"sound box\" in a stuffed animal. Here is a picture of the circuit board:\n\n\nThe blue wires lead are connected to the speaker. I am thinking that those pads coming out of the chip that are not connected to anything might be used to put a new message on there. This board was in an \"animal\" and was not originally supposed to be modified so there is no microphone. Would this be possible? Any ideas on how I would do it?\n\n",
  "votes": "3",
  "answers": 0,
  "views": "106",
  "tags": [
    "hardware"
  ],
  "user": "NULL",
  "time": "Jun 1, 2015 at 14:12",
  "comments": [
    {
      "user": "Guntram Blohm",
      "text": "The two large silver pads below the piece of black gunk seem to be battery holders. And the structure at the top is a capacitor with a few pf, it's probably used to provide some kind of input clock to the chip. Very likely, the chip itself is just a small rom and a divider to produce the sound, it doesn't really need much logic, and i woudln't assume the chip implements something as complex as a SPI header or an I2C bus to actually modify the contents; these things are supposed to be as cheap as possible. Ask at electronics se, those guys could be more familiar with this kind of device.",
      "time": null
    },
    {
      "user": "NULL",
      "text": "Gathering from the discussion at Electronics SE I cannot reprogram this chip. But, just out of curiosity what are those two holes for at the top? The right hole is just above the right battery holder and the other hole is the one nearest it.",
      "time": null
    },
    {
      "user": "Spektre",
      "text": "for testing or programing I guess. If it is PROM then it can be programed just once, but my bet is some sort of test signal output like clock ... have you tried to measure it with oscilloscope or turn to H or L with some resistor to see if behavior changed?",
      "time": null
    },
    {
      "user": "NULL",
      "text": "Not yet..I will definitely try that!",
      "time": null
    },
    {
      "user": "Guntram Blohm",
      "text": "Electrical Engineering question link",
      "time": null
    }
  ],
  "answers_data": []
}