{
  "title": "Binary diffing: Why moving ebx to eax, instead of pushing ebx?",
  "link": "https://reverseengineering.stackexchange.com/questions/9061/binary-diffing-why-moving-ebx-to-eax-instead-of-pushing-ebx",
  "content": "I was doing binary diffing, I want to know why  mov eax,ebx is used instead of push ebx.\n\nThis is the binary diffing image: \n\nBefore patch :\n\nAfter patch : \n\n",
  "votes": "2",
  "answers": 2,
  "views": "535",
  "tags": [
    "assembly",
    "binary-analysis",
    "x86",
    "bin-diffing"
  ],
  "user": "Vlad",
  "time": "Jun 4, 2015 at 13:55",
  "comments": [],
  "answers_data": [
    {
      "content": "The function prototype for ?EnsureCollectionCache@CFormElement@@QAEJXZ is the same before and after the patch. It demangles to:\n\npublic: long int __thiscall CFormElement::EnsureCollectionCache(void)\n\nAnd the calling convention for the parent function, ?DoReset@CFromElement@@QAEJH@Z,  is the same before and after as well:\n\npublic: long int __thiscall CFormElement::DoReset(int)\n\nBefore and after the patch, the CFormElement::DoReset function saves the value of its int argument in register ebx. Before the patch, this value is pushed onto the stack at EIP 639C2C58 because other code in the function will likely make use of it later. After the patch, the mov eax, ebx instruction is effectively a no-op since the call to CFormElement::EnsureCollectionCache will overwrite eax.\n\nAs for why the compiler made this change, it's difficult to say without seeing the rest of the function. Perhaps after the patch, the code in the rest of the function gets the value of the int argument from the stack relative to ebp as opposed to grabbing it from the top of the stack.\n\n",
      "votes": "3",
      "user": "Jason Geffner",
      "time": "Jun 4, 2015 at 14:34",
      "is_accepted": false,
      "comments": [
        {
          "user": "Vlad",
          "text": "Yes! I'm wondering why should the no-op instruction be used.... what about the lines 3 and 4 of the yellow node? here the esi would have a different value according to the first line . am I right?",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "No, in both cases esi will get set to the return value of CFormElement::EnsureCollectionCache.",
          "time": null
        }
      ]
    },
    {
      "content": "It may be because the calling convention changed from __cdecl (using the stack to receive the arguments) to __fastcall or even to a calling convention invented by the compiler (using EAX as the register holding the same information that was pushed on to the stack in the previous version).\n\n",
      "votes": "1",
      "user": "joxeankoret",
      "time": "Jun 4, 2015 at 14:13",
      "is_accepted": false,
      "comments": [
        {
          "user": "Jason Geffner",
          "text": "No, the calling convention didn't change.",
          "time": null
        }
      ]
    }
  ]
}