{
  "title": "Tools for automated deobfuscation",
  "link": "https://reverseengineering.stackexchange.com/questions/9151/tools-for-automated-deobfuscation",
  "content": "To evaluate different Java obfuscators, I want also consider if the obfuscators use preventive techniques against common tools used for automated deobfuscation.\n\nTherefore I plan to obfuscate a test program with different obfuscators and check, if deobfuscators have an impact on the obfuscated programs. \n\nSo I'm searching for common tools for automated deobfuscation to use them in my evaluation. Can you suggest some tools? Thank you!\n\n",
  "votes": "1",
  "answers": 1,
  "views": "6k",
  "tags": [
    "tools",
    "obfuscation",
    "deobfuscation"
  ],
  "user": "la-ga",
  "time": "Jun 16, 2015 at 15:28",
  "comments": [
    {
      "user": "w s",
      "text": "Obfuscation if what exactly ?",
      "time": null
    },
    {
      "user": "la-ga",
      "text": "Obfuscation is the process making source code difficult to understand and difficult to analyse for a reverse-engineer. Therefore you transform your program into another one with the same functionality but with a more complex source code: Wikipedia Article In this special case using preventive transformations to thwart automated deobfuscators and make them to crash.",
      "time": null
    },
    {
      "user": "w s",
      "text": "Obfuscation of what exactly ? For example there are no automatic deobfuscators for binary executables, especially for not x86 ones. Deobfuscators for PHP, JavScript and Java are very different.",
      "time": null
    },
    {
      "user": "la-ga",
      "text": "I'm planning to look at C and Java obfuscators. So if there are no automatic deobfuscators for x86 architectures I'll focus on tools for Java code. ;-)",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Take a look at Jakstab. It defeats the most basic obfuscation techniques and should provide a decent start in the way of automated deobfuscation. \n\nTake its results with a grain of salt though as it is not finished and may have issues with certain binaries.\n\n",
      "votes": "1",
      "user": "Viktor K",
      "time": "Jun 17, 2015 at 7:53",
      "is_accepted": false,
      "comments": [
        {
          "user": "perror",
          "text": "Jakstab is programmed in Java but deals with x86 executables. I am not sure it is a correct answer to the question.",
          "time": null
        },
        {
          "user": "Viktor K",
          "text": "According to a previous comment he is interested in automatic x86 deobuscation, so I figured i'd pitch in what i know.",
          "time": null
        },
        {
          "user": "perror",
          "text": "Ah, the term \"Java obfuscator\" misled me, then... Sorry.",
          "time": null
        },
        {
          "user": "Viktor K",
          "text": "I agree it was not obvious from the initial post ;) No worries.",
          "time": null
        }
      ]
    }
  ]
}