{
  "title": "Reversing encryption by analysing executable",
  "link": "https://reverseengineering.stackexchange.com/questions/9168/reversing-encryption-by-analysing-executable",
  "content": "I have a program that reads data from a file, parses/organizes it, and spits it out as an encrypted XML. The application can also take an encrypted XML and spit out the original file. My objective at this point would be to access the clear-text XML (I'm not interested in the clear text original file as it's not XML organized)\n\nI have no idea what the encryption is yet although one guy on a forum said it was AES-128 (not sure how he got to that conclusion).\n\nI ran PEiD with the KANAL plugin on the application, it doesn't detect any encryption signatures.\n\nBecause I have access to the program and some past some experience with exploiting BO on WinXP with some knowledge of ASM, I figured I could give it a try using a debugger.\n\nIn a nutshell, what are the general steps I should be following to figure this out? In this situation would it be best to start looking for the encryption key itself, or find a way to use the application's encrypt/decrypt functions to my advantage?\n\n",
  "votes": "4",
  "answers": 1,
  "views": "3k",
  "tags": [
    "encryption"
  ],
  "user": "Juicy",
  "time": "Jun 17, 2015 at 22:03",
  "comments": [
    {
      "user": "Abr001am",
      "text": "we need to know more informations , that may help to trace AES process",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "There are typically many ways to start, and which one you want to use depends on your experience. Also, what works for one target might fail on another, and vice versa. What i'd start with is:\n\n",
      "votes": "7",
      "user": "Guntram Blohm",
      "time": "Jun 18, 2015 at 7:27",
      "is_accepted": true,
      "comments": [
        {
          "user": "Abr001am",
          "text": "you forget to tell how to remove junk that obfuscates encryption stages",
          "time": null
        }
      ]
    }
  ]
}