{
  "title": "Books on reversing with GDB?",
  "link": "https://reverseengineering.stackexchange.com/questions/9209/books-on-reversing-with-gdb",
  "content": "I'm getting started with some reverse engineering lately, especially on Linux and ELF format, but I'm struggling here.  \n\nFor now I'm only using GDB to disassemble binaries, and even though I can read and understand the assembly code in general, I don't know \"where\" to look, or what register to check to find the flag (I'm talking about CTFs here).\n\nWhat I'm asking for are books or videos, something to get me used to GDB and give me the thinking methodology (if there's such a thing).\nThanks!\n\n",
  "votes": "3",
  "answers": 3,
  "views": "2k",
  "tags": [
    "disassembly",
    "gdb"
  ],
  "user": "HdjoWattever",
  "time": "Jan 20, 2019 at 16:36",
  "comments": [
    {
      "user": "Spl3en",
      "text": "There is no such \"Look at this register to get the flag\" tutorial. Every good CTF is different and require thinking out of the box. Maybe you should try to do some wargames so you can learn step by step and teach yourself by practice what you need to know : exploit-exercises.com/nebula",
      "time": null
    },
    {
      "user": "adrián",
      "text": "I think CTF write-ups about reversing will help you here 1 2 also I highly recommend: Learning Linux Binary Analysis book also check LiveOverflow channel in youtube",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "Special for beginners Dennis Yurichev wrote this book:\nReverse Engineering for Beginners\n\nYou can find it and download on his site for free.\n\n",
      "votes": "5",
      "user": "Alex Bender",
      "time": "Jun 25, 2015 at 19:14",
      "is_accepted": true,
      "comments": []
    },
    {
      "content": "If you want to learn reverse engineering on Linux, I highly recommend: Learning Linux Binary Analysis.\n\nIt is the only book (that I know of) that goes in depth on the ELF format.\n\nhttps://www.amazon.com/Learning-Binary-Analysis-elfmaster-ONeill/dp/1782167102/ref=sr_1_1?ie=UTF8&qid=1493623237&sr=8-1&keywords=linux+binary+analysis\n\n",
      "votes": "1",
      "user": "JeffreyZ",
      "time": "May 1, 2017 at 7:24",
      "is_accepted": false,
      "comments": [
        {
          "user": "hairlessbear",
          "text": "NoStarch recently released Practical Binary Analysis, which also goes in-depth on the ELF format.",
          "time": null
        }
      ]
    },
    {
      "content": "I highly recommended this position:\nhttps://www.amazon.com/Practical-Reverse-Engineering-Reversing-Obfuscation/dp/1118787315\n\n",
      "votes": "0",
      "user": "fuwiak",
      "time": "May 1, 2017 at 15:28",
      "is_accepted": false,
      "comments": []
    }
  ]
}