{
  "title": "Patch driver loading process [closed]",
  "link": "https://reverseengineering.stackexchange.com/questions/9243/patch-driver-loading-process",
  "content": "Since Windows Vista and higher versions a non-boot kernel-mode driver is installed by validating the certificate issued to sign the catalog file and each file associated with the catalog : .inf, .sys and .dll dependencies.\n\nThis is done by checking whether the certificate chain is valid, that means that the root CA has to be under the local Trusted Root CA and also the leaf certificate (not the root CA) has to be under the Trusted Publisher, so the installation doesn't prompt to ask the user if he trusts in the publisher.\n\nHowever, when the installation finishes the driver fails to load into the kernel. I suppose that winload validates the driver's certificate by looking in its own trusted root CA store, so the only CAs that are supported are in this list : \n\nIs there a way to patch winload to insert a new Root CA so when it loads our driver it validates the certificate correctly? \n\nI know that modifying winload will break its digital signature, so we can resign it using the private key of our new Root CA, that will do the work theoretically.\n\n",
  "votes": "1",
  "answers": 1,
  "views": "599",
  "tags": [
    "windows",
    "kernel-mode",
    "patching",
    "driver",
    "operating-systems"
  ],
  "user": "kub0x",
  "time": "9 years ago",
  "comments": [],
  "answers_data": [
    {
      "content": "Yes, you would need to patch ci.dll (which contains the list of hardcoded Root CAs) and winload.exe (which validates the integrity of ci.dll).\n\nYou can find this discussed in http://www.programdevelop.com/4608016/.\n\n",
      "votes": "2",
      "user": "Jason Geffner",
      "time": "Jun 29, 2015 at 14:21",
      "is_accepted": true,
      "comments": [
        {
          "user": "kub0x",
          "text": "Thanks for your answer. So when a driver is loaded into the kernel in system boot the digital certificate is matched to a root CA stored in ci.dll right? I've seen over there that winload before loading ntoskrnl.exe verifies its digital signature against nt5.cat, do you know any kind of info about this?",
          "time": null
        },
        {
          "user": "Jason Geffner",
          "text": "\"So when a driver is loaded into the kernel in system boot the digital certificate is matched to a root CA stored in ci.dll right?\" -- The driver's certificate chain is verified to be rooted in a CA stored in ci.dll. \"I've seen over there that winload before loading ntoskrnl.exe verifies its digital signature against nt5.cat, do you know any kind of info about this?\" -- What are you looking to know?",
          "time": null
        },
        {
          "user": "kub0x",
          "text": "I'm reading this now: homepage.ntlworld.com/jonathan.deboynepollard/FGA/… . Concretely the section \" How Windows NT6 is bootstrapped by its loader\" you will see that winload is responsible of loading the kernel boot drivers, so my driver is going to be loaded by this process. In this article is said that winload verifies itself against nt5.cat. So what I get from here and from your indications is that I have to patch ci.dll and the signature from winload in the catalog. Thanks again for throwing some light.",
          "time": null
        }
      ]
    }
  ]
}