{
  "title": "Opening program via Ollydbg/Immunity in Win7 causes exception unless in XP Compatibility Mode",
  "link": "https://reverseengineering.stackexchange.com/questions/9313/opening-program-via-ollydbg-immunity-in-win7-causes-exception-unless-in-xp-compa",
  "content": "When opening the reverseme included with Lena's tutorials for debugging in either Immunity or Ollydbg an exception is produced within ntdll that results in termination of the process with code 4000001E.  If I configure the executable for a compatibility mode of Windows XP (Service Pack 3) within the file properties then this exception does not occur and the binary executes as expected.  The executable does not produce an exception when running with a debugger attached.\n\nWhat is the root cause of this exception, and how would I determine it?\n\n",
  "votes": "1",
  "answers": 0,
  "views": "678",
  "tags": [
    "windows",
    "ollydbg",
    "immunity-debugger",
    "exception"
  ],
  "user": "Jeremy McKeown",
  "time": "Jul 9, 2015 at 18:05",
  "comments": [
    {
      "user": "Jason Geffner",
      "text": "What version of OllyDbg are you using? Does this problem still occur with the latest version (2.01)?",
      "time": null
    },
    {
      "user": "Jeremy McKeown",
      "text": "It happens in both Ollydbg 1.10 and Immunity 1.85.  I'll try it with 2.01 and post back.",
      "time": null
    },
    {
      "user": "user15807",
      "text": "funny fact: I've had a similar problem, and switching to XP (SP3) actually did work... there's something fishy going on with Win7 debugger support I suppose.",
      "time": null
    },
    {
      "user": "user15807",
      "text": "Although I'm not entirely sure this is the case, I've stumbled upon this while searching for an answer... it seems that it can be caused by 64-bit/32-bit clash in the debugger. Which version of Win7 are you using? It seems that switching to XP compat. forces 32-bit compatibility, while, for some reason, in native Win7 64-bit even 32-bit apps can (?) sometimes switch to 64-bit code in debugger, resulting in nasty things.",
      "time": null
    }
  ],
  "answers_data": []
}