{
  "title": "Assembly analyze C system() function",
  "link": "https://reverseengineering.stackexchange.com/questions/9327/assembly-analyze-c-system-function",
  "content": "So I made a very simple C program to study how C works on the inside. It has just 1 line in the main() excluding return 0:\n\n```\nsystem(\"cls\");\n\n```\nIf I use ollydebugger to analyze this program It will show something like this(text after the semicolons are comments generated by ollydebugger.\n\n```\nMOV DWORD PTR SS:[ESP],test_1.004030EC     ; ||ASCII \"cls\"\nCALL <JMP.&msvcrt.system>                ; |\\system\n\n```\nCan someone explain what this means, and if I want to change the \"cls\" called in the system() to another command, where is the \"cls\" stored? And how do I modify it?\n\n",
  "votes": "-2",
  "answers": 1,
  "views": "561",
  "tags": [
    "ollydbg",
    "assembly",
    "c"
  ],
  "user": "Dashadower",
  "time": "Jul 11, 2015 at 12:24",
  "comments": [
    {
      "user": "0xec",
      "text": "Ascii string cls is stored at virtual address 004030EC. In Olly press ,Ctrl + G to go there.",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "The Ascii string cls is stored at address 0x004030EC. Why is it stored at that location is probably compiler related. \n\nThe ESP register holds the address of the top of the stack. What your instruction \n\n```\nMOV DWORD PTR SS:[ESP],test_1.004030EC     ; ||ASCII \"cls\"\n\n```\nmeans is to put the value 0x004030EC to the address pointed to by ESP. If the value of ESP is, lets say, ESP = 0x0018FF8C, then the value at address 0x0018FF8C will be 0x004030EC after the above MOV instruction is executed.\n\nIf you want to change the string cls to something else, you can position at the dump window in Olly and press CTRL-G. A popup box will appear and there you will enter 0x004030EC and press Ok. After that right click on the first byte at that address, which should be 0x63 (the letter 'c' from string \"cls\") and choose Binary -> Edit. There you can enter your new string that will be passed to the CALL instruction.\n\n",
      "votes": "1",
      "user": "ubnix",
      "time": "Jul 13, 2015 at 10:16",
      "is_accepted": false,
      "comments": []
    }
  ]
}