{
  "title": "Reverse Engineering Firmware",
  "link": "https://reverseengineering.stackexchange.com/questions/9476/reverse-engineering-firmware",
  "content": "I have a HEX file with a firmware for Attiny45. What I want to do is to extract some kind of formula that is coded inside it. I have done some research (mostly to find out that \"it is not possible\", etc, etc) but I decided I could give it a try since other parts of my research showed me that most of the people that ask this type of question barely knows what a HEX file is.\n\nThe objective of this post is not to came up with a brightly C code from the HEX file but rather build solid knowledge about the subject. I'm aware that the compiler, doing its job, can make my own job harder but there is some kind of structure (maybe primitive) that needs to be followed for the CPU to be able to execute the code.\n\nSo, I sat on my desk and coded a little Python tool to help me in the process. It loads the HEX file, and I interactively can add information to it. Here is what I've got so far:\n\nThe first line of the HEX file, says:\n\n```\n: 02 0000 04 0000 FA\n\n```\nWhich was decoded by the tool to:\n\n```\n:       --> MARK\n02      --> RECORD LENGTH\n0000    --> LOAD OFFSET\n04      --> RECORD TYPE (EXTENDED LINEAR ADDRESS RECORD)\n0000    --> DATA\nFA      --> CHECKSUM\n\n```\nSeems that this line serves the propose of telling that the initial address on which code should be put is 0x0000.\n\nSecond, the next line says:\n\n```\n: 20 0000 00 34C0FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF50C07EEE7EB9 51\n\n```\nThe tool decoded it to:\n\n```\n:    --> MARK\n20   --> LENGHT OF THE RECORD\n0000 --> OFFSET\n00   --> RECORD TYPE (00 -> DATA RECORD) 34C0FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF50C07EEE7EB9 (ACTUAL DATA)\n51   --> CHECKSUM\n\n```\nHere is where the fun and the questions starts.\n\n",
  "votes": "3",
  "answers": 1,
  "views": "830",
  "tags": [
    "firmware",
    "hex"
  ],
  "user": "daniel.franzini",
  "time": "Jul 28, 2015 at 12:46",
  "comments": [],
  "answers_data": [
    {
      "content": "",
      "votes": "2",
      "user": "Guntram Blohm",
      "time": "Jul 28, 2015 at 22:54",
      "is_accepted": false,
      "comments": []
    }
  ]
}