{
  "title": "Undo patch in IDA",
  "link": "https://reverseengineering.stackexchange.com/questions/9515/undo-patch-in-ida",
  "content": "While I'm doing a patching using IDA, I accidentally patch wrong bites and I can't remember what bytes were there before. Is there a way to undo it..?  \n\n",
  "votes": "3",
  "answers": 4,
  "views": "9k",
  "tags": [
    "ida",
    "disassembly"
  ],
  "user": "Ramesh-X",
  "time": "Jul 31, 2015 at 17:31",
  "comments": [],
  "answers_data": [
    {
      "content": "There is a window to see all patched bytes, along with their unpatched versions: in the menu, use View / Open Subviews / Patched Bytes, or press STRG-ALT-P.\n\nThis is for IDA 6.8 (newest version), i don't know if older versions have the same thing.\n\nHowever, i recommend you to install the ida patcher plugin, which improves working with patches greatly; for example, you can copy/paste a patch from somewhere else; you can fill a region with identical bytes, and there is a window that's similar to the standard patcher window, but lets you assign comments to patches, and revert them with a single click to the context menu.\n\n",
      "votes": "7",
      "user": "Guntram Blohm",
      "time": "Jul 31, 2015 at 20:00",
      "is_accepted": true,
      "comments": [
        {
          "user": "Ramesh-X",
          "text": "I'm using a older version. So I think I can't undo it. I will try ida patcher plugin. Thanks for your help..",
          "time": null
        }
      ]
    },
    {
      "content": "Go to View / Open Subviews / Patched Bytes, where patches are.\nRight click on a line and click \"Revert\" . This works in Ida 6.8\n\n",
      "votes": "2",
      "user": "nobody",
      "time": "Nov 25, 2016 at 19:31",
      "is_accepted": false,
      "comments": []
    },
    {
      "content": "I don't know how you could unpatch them, since I think there is no way to do that(I'm talking about IDA 6.5, which I use).\nBut I would recommend you for future to use Database Snapshots in IDA. It's very convenient - you can save the state of all your bytes, function names, comments and so on. If something went wrong you can just restore a snapshot in snapshot manager.\nYou can find the it in View --> Database Snapshot Manager in IDA Pro 6.5\n\n",
      "votes": "1",
      "user": "0xDEADC0DE",
      "time": "Jul 31, 2015 at 19:48",
      "is_accepted": false,
      "comments": [
        {
          "user": "Ramesh-X",
          "text": "Database Snapshot will be a good idea. Thank you for your help..",
          "time": null
        }
      ]
    },
    {
      "content": "An alternative solution, for older IDA versions:\nUse File>Produce file>Create DIF file... to dump all the changes.\nFile format is Offset: Old New for every patched byte in file.\nFind the bytes you want to change back, and do it manually.\nJust remember that offsets are from file start, they are not memory addresses.\n\n",
      "votes": "1",
      "user": "EvgEnZh",
      "time": "Sep 14, 2018 at 7:56",
      "is_accepted": false,
      "comments": []
    }
  ]
}