{
  "title": "How to get current PHP function name in gdb?",
  "link": "https://reverseengineering.stackexchange.com/questions/9558/how-to-get-current-php-function-name-in-gdb",
  "content": "I'm following these steps to locate the current PHP function call as below:\n\n",
  "votes": "6",
  "answers": 1,
  "views": "4k",
  "tags": [
    "debugging",
    "gdb",
    "php"
  ],
  "user": "kenorb",
  "time": "Aug 5, 2015 at 13:38",
  "comments": [
    {
      "user": "Guntram Blohm",
      "text": "If the symbol was unavailable, you'd get a different error message, about an unknown symbol. (Try print (char *) (blarflgrumpf)). This seems like your binary has been compiled with optimization on (which could put some variables into registers, without gdb knowing, and relying on the (wrong) stack value). Try to compile/link php with -O0 and -g. Also, unless you cut some parts of the backtrace, your stack is probably broken, as execute_ex seems to have been called out of thin air. This broken stack may be the reason for all sorts of unexpected behaviour.",
      "time": null
    },
    {
      "user": "kenorb",
      "text": "@GuntramBlohm Thanks, yes, there are more frames in bt (up to #10 with ??), I've re-added. Yes, unknown symbol is printing different message. So that means I can't access/extract that data about the current function without re-compiling the PHP?",
      "time": null
    },
    {
      "user": "Guntram Blohm",
      "text": "Well, some things seem a bit fishy to me: the instructions tell you to move the frame to the last execute call, while you only have execute_ex; if executor_globals is indeed a global variable, the stack frame shouldn't matter, but if it's local, you shouldn't find it in the zif_sleep frame. I wonder how up-to-date the site is you linked to. But as the value of executor_globals is wrong, and your PHP site says \"Important! To get a backtrace with correct information you must have PHP configured with --enable-debug! \", I think you need to recompile.",
      "time": null
    },
    {
      "user": "chx",
      "text": "Highly relevant stackoverflow.com/a/31240030/308851",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "According to this link, it should be possible to find the function in use with the following steps:\n\nFor example:\n\n```\ngdb -p 4584\n(gdb) source PHP_5_5/.gdbinit\n(gdb) zbacktrace\n[0xec906090] addOne() /tmp/yourscript.php:9\n\n```\n",
      "votes": "9",
      "user": "Moshe",
      "time": "Nov 30, 2016 at 1:38",
      "is_accepted": true,
      "comments": [
        {
          "user": "Anna Völkl",
          "text": "Awesome! The link in 2. to the .gdbinit file helped a lot! Thanks!",
          "time": null
        },
        {
          "user": "Akira Yamamoto",
          "text": "This link was also useful for me to install php5-cli-dbgsym wiki.ubuntu.com/DebuggingProgramCrash",
          "time": null
        }
      ]
    }
  ]
}