{
  "title": "Want to get back into reverse engineering havn't for a few years whats a good starting point for getting back into it?",
  "link": "https://reverseengineering.stackexchange.com/questions/9565/want-to-get-back-into-reverse-engineering-havnt-for-a-few-years-whats-a-good-st",
  "content": "I used to make maphacks for a game called Warcraft 3. I want to get back into reverse-engineering but with today's technologies (i.e. with the internet being fast enough to download data instead of it being pre-loaded) is it a lost art?\n\nReverse-engineering applications and software does not interest me at all, can anyone recommend other games I might enjoy reversing? I always wanted to take a stab at reverse engineering games using the Quake engine but never got into it, could anyone recommend any tutorials?\n\nAlso, my method usually involved writing a pure ASM DLL for injection (which just made it easier to create code caves, etc.). Would this work for other games, or are there different methods you have to go about injecting a modification?\n\n",
  "votes": "2",
  "answers": 3,
  "views": "1k",
  "tags": [
    "windows",
    "assembly",
    "ollydbg",
    "x86"
  ],
  "user": "Robert Pounder",
  "time": "Dec 16, 2015 at 17:12",
  "comments": [
    {
      "user": "rev",
      "text": "No, it is not a lost art. Some fun-to-reverse games are Battlefield, Call of Duty, Counter-Strike, DayZ, Rust... among others; it really depends on which games you enjoy playing. Injecting DLLs is the most common method of coding cheats, but I wouldn't code one and inject it straight into the game. You need to evade the anti-cheat first. You can mix C/C++ with ASM, no need to write pure ASM binaries.",
      "time": null
    },
    {
      "user": "Robert Pounder",
      "text": "@AcidShout nice one bud you know where I can find some basic guides to creating those type of games? With WC3 I can play about with while playing but all guides I've read on FPS's have involved disassembling rather than debugging. Thanks",
      "time": null
    },
    {
      "user": "Robert Pounder",
      "text": "@AcidShout if you can give some good references or maybe a little guide or something as an answer I'll give you the bounty",
      "time": null
    },
    {
      "user": "rev",
      "text": "Okay, but just clarify this: you want to create a game or hack an existing one?",
      "time": null
    },
    {
      "user": "Robert Pounder",
      "text": "hack an existing one lol",
      "time": null
    }
  ],
  "answers_data": [
    {
      "content": "I know referring to another sites is not the best answer you want to get but Reddit has a pretty good and active REGames will give you a good revive. \n\n",
      "votes": "3",
      "user": "GelosSnake",
      "time": "Aug 16, 2015 at 20:46",
      "is_accepted": true,
      "comments": [
        {
          "user": "Robert Pounder",
          "text": "This was better than the other answer, nice one.",
          "time": null
        }
      ]
    },
    {
      "content": "Well, I would recommend to start with searching this Community:\n\nIntro to reverse engineering\n\nWhere can I, as an individual, get malware samples to analyze?\n\nWhere to find (free) training in reverse engineering?\n\nUpdate:\nHi Robert\n\nMy response apply to question in topic + first part of Your question, which I understood as \"How can i get back to RE and improve my skills\".\n\nRegarding second part of the question - I am pretty sure that RE of games is violation of their EULA. I am quite sure this is not a proper place to look for this kind of information. Maybe I am wrong :)\n\n",
      "votes": "2",
      "user": "Community",
      "time": "Apr 13, 2017 at 12:49",
      "is_accepted": false,
      "comments": [
        {
          "user": "Robert Pounder",
          "text": "None of these relate specifically to my question :/",
          "time": null
        },
        {
          "user": "Denis Laskov",
          "text": "Hi. You mean - \"return to RE\" part? Or \"how to RE games\" part?",
          "time": null
        },
        {
          "user": "Robert Pounder",
          "text": "Theory on 'how to' RE games is not illegal.",
          "time": null
        },
        {
          "user": "Denis Laskov",
          "text": "I do not agree with what you have to say, but I'll defend to the death your right to say it. (c) Voltaire",
          "time": null
        }
      ]
    },
    {
      "content": "Have you visited the forums of these two sites?\n\nhttp://www.unknowncheats.me\n\nhttp://www.mpgh.net\n\nBoth have dedicated reverse engineering and programming sub-forums specific to games.\n\n",
      "votes": "1",
      "user": "Kalibr",
      "time": "Dec 17, 2015 at 7:21",
      "is_accepted": false,
      "comments": []
    }
  ]
}