{
    "title": "Converting Duden dictionaries for Stardict/Goldendict",
    "link": "https://reverseengineering.stackexchange.com/questions/10629/converting-duden-dictionaries-for-stardict-goldendict",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I’ve a bunch of first-class German dictionaries by Duden (the main German dictionary publisher) which, sadly, use a closed proprietary data format and their dedicated Duden-Bibliothek application (<a href=\"https://de.wikipedia.org/wiki/Duden-Bibliothek\" rel=\"nofollow\">Information in German</a>).</p>\n<p>I’m usually using <a href=\"http://goldendict.org/\" rel=\"nofollow\">Goldendict</a> on my tablet. Is there any possibility to convert my dictionaries to Stardict/Goldendict format so I can use them on my Android devices ?</p>\n<p>I’ve looked into <a href=\"https://code.google.com/p/stardictproject/\" rel=\"nofollow\">stardict-tools</a> but can’t convert.</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "2k",
    "tags": [
        "file-format",
        "encodings",
        "binary-format"
    ],
    "user": "summer.breeze",
    "time": "Aug 25, 2015 at 13:57",
    "comments": [
        {
            "user": "tibar",
            "text": "<span class=\"comment-copy\">Could you post a sample of each files ? Could you also please rephrase \"can't convert\", what do you mean: - does not work - throw an exception - return a file that cannot be read...</span>",
            "time": null
        },
        {
            "user": "summer.breeze",
            "text": "<span class=\"comment-copy\">It means conversion script crashes. It expects .utf file and when given one, it just crashes. Seems it cannot read the format at all. It also doesn't produce any meaningful output.  Please contact me for samples. These files are copyrighted, cannot post them here.</span>",
            "time": null
        },
        {
            "user": "tibar",
            "text": "<span class=\"comment-copy\">since you did not add any info about yourself in SO, let's do it the other way around. Send me an email with this utf file. thx</span>",
            "time": null
        },
        {
            "user": "tibar",
            "text": "<span class=\"comment-copy\">did you check <a href=\"https://pypi.python.org/pypi/stardicter\" rel=\"nofollow noreferrer\">stardicter</a></span>",
            "time": null
        },
        {
            "user": "summer.breeze",
            "text": "<span class=\"comment-copy\">Stardicter supports only free, very low quality dictionaries. Duden is a proprietary format. Android app is totally unusable and so are another great sources of dictionaries for many languages Millennium and Lingea. The way I see it, trying various tools blindly won't help.</span>",
            "time": null
        }
    ],
    "answers_data": []
}