{
    "title": "How to trace every instruction that was executed?",
    "link": "https://reverseengineering.stackexchange.com/questions/10634/how-to-trace-every-instruction-that-was-executed",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>When I use \"trace into\" it doesn't log every single executed instruction in the \"Run Trace\" window only some of them. I have to set breakpoints in order for some of the instructions to be logged. </p>\n<p>For example right now I'm tracing a program with a TLS callback. I break on system entry point, so I start in ntdll and hit \"trace into\" but the TLS callback which is from the main executable is not logged if I don't put a breakpoint on it. If I put a breakpoint on it then it appears in the run trace. How can I log every single instruction without setting breakpoints? </p>\n<p>I have unchecked the box for \"Don't enter system dlls\" and checked the box for \"always trace over string functions\" (and all other combinations thereof). </p>\n<p>I have also tried setting a trace condition \"pause trace when EIP is between 400000-500000\" which only works when I set a breakpoint on the TLS (i.e clicking \"trace into\" will single-step through the TLS code once the breakpoint is hit and will not pause not before the breakpoint I set), and doesn't work if I don't set the breakpoint. There is obviously something I'm missing, but I've tried everything that I can think of. </p>\n<p>Also another thing: When I press \"Execute till user code\" from ntdll, it doesn't stop on the TLS callbacks (unless I put breakpoints on there). Why does that happen? </p>\n<p>UPDATE: Turns out problem was I was using 64 bit OS. I ran it again in 32 bit windows and the TLS was traced fine. </p>\n<p>\"Execute till user code\" still doesn't break on TLS callbacks though. </p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "6k",
    "tags": [
        "ollydbg"
    ],
    "user": "user2108462",
    "time": "Aug 16, 2015 at 13:28",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>how did you confirm that the tls call back is not present in run trace ? </p>\n<p>AFAIK ollydbg properly traces through LdrpCallInitRoutine    </p>\n<pre><code>Run trace, selected line\n Back=1663410.\n Thread=Main\n Module=ntdll\n Address=7C91C4F5\n Command=CALL    ntdll.LdrpCallInitRoutine\n Comment=ELdrpCallInitRoutine &lt;------------\n</code></pre>\n<p>do you log the trace to some file the buffer entries drop out in last in first out fashion (buffer size is configurable and default size of buffer is set at its lowest size )</p>\n<p>even if you configure the buffer to its maximun size there is a chance that the log entries were dropped </p>\n<p>do you know the address of tls callback </p>\n<p>if yes did you try right click -&gt; mark address and using + / - to navigate ?</p>\n<p>here is a tls entry as logged by ollydbg </p>\n<pre><code>Run trace, selected line\n Back=1663399.  &lt;------------------ i have paused the binary so much instruction forward     \nnotice the earlier index is farther back in ldrpcallinitroutine paste above\n Thread=Main\n Module=kernl\n Address=10001000 &lt;ModuleEntryPoint&gt;  &lt;---- a dll (LDR_PROCESS_ATTACH Init Call)\n</code></pre>\n<p>Command=PUSH    EBP</p>\n</div>",
            "votes": "1",
            "user": "blabb",
            "time": "Aug 16, 2015 at 11:12",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user2108462",
                    "text": "<span class=\"comment-copy\">I confirmed it by searching through the run trace written to a text file looking for the address of the TLS callback - it wasn't there. I could not even find anything from user code (starting 401000) even though I definitely know the code in there was executed. The log had something like 560000 entries and most of it was just ntdll code and code from other modules but nothing from the user code. Yes I configured the buffer to maximum size.</span>",
                    "time": null
                },
                {
                    "user": "user2108462",
                    "text": "<span class=\"comment-copy\">I don't know what you mean by \"mark address\". It's not there in the right click menu.</span>",
                    "time": null
                },
                {
                    "user": "user2108462",
                    "text": "<span class=\"comment-copy\">By the way when tracing into with ollydbg 2.01 I got an error \"unable to step over command at address 00000020 memory is not readable\".The log had 41391 entries btw.</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">ollydbg 1.10 mark address / ollydbg 2.01 find address</span>",
                    "time": null
                }
            ]
        }
    ]
}