{
    "title": "Reverse engineering an application's client connection to a host [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/10671/reverse-engineering-an-applications-client-connection-to-a-host",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<div>\n<aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n<div class=\"d-flex fd-column fw-nowrap\">\n<div class=\"d-flex fw-nowrap\">\n<div class=\"flex--item wmn0 fl1 lh-lg\">\n<div class=\"flex--item fl1 lh-lg\">\n<div>\n<b>Closed</b>. This question needs to be more <a href=\"/help/closed-questions\">focused</a>. It is not currently accepting answers.\n                                \n                            </div>\n</div>\n</div>\n</div>\n</div>\n<hr class=\"my12 outline-none baw0 bb bc-blue-400\"/>\n<div class=\"fw-nowrap fc-black-500\">\n<div class=\"d-flex fd-column lh-md\">\n<div class=\"mb0 d-flex\">\n<div class=\"flex--item mr8\">\n<svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\"><path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\"></path></svg>\n</div>\n<p><b>Want to improve this question?</b> Update the question so it focuses on one problem only by <a href=\"/posts/10671/edit\">editing this post</a>.</p>\n</div>\n<div class=\"mb0 mt6 d-flex\">\n<p class=\"ml24 pl2\">Closed <span class=\"relativetime\" title=\"2015-09-01 09:08:56Z\">9 years ago</span>.</p>\n</div>\n<div class=\"ml24 pl2\">\n</div>\n</div>\n</div>\n<div class=\"mt24 d-flex gsx gs8\">\n<a class=\"s-btn s-btn__outlined flex--item js-post-notice-edit-post\" href=\"/posts/10671/edit\">\n                        Improve this question\n                    </a>\n</div>\n</aside>\n</div>\n<p>Ok guys, I'm a web programmer but I'm completely new to reverse engineering..</p>\n<p>So, there's this android app called InstaMessage, I'd like to reverse engineer the client's connection to the server, so that I can emulate it on my computer and see what commands are there, perhaps play with it a bit and further create some scripts to act as my user actions</p>\n<p>I was thinking of monitoring the traffic, seeing where it leads and which port, an try to start from there.</p>\n<p>I know it's a kind of broad question, so if you could give me some tips on where to start off, it would help a lot..</p>\n<p>Thanks</p>\n</div>",
    "votes": "3",
    "answers": 2,
    "views": "4k",
    "tags": [
        "android"
    ],
    "user": "sigmaxf",
    "time": "9 years ago",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">Have you tried <a href=\"http://stackoverflow.com/questions/21010367/how-to-decompile-a-apk-or-dex-file-on-android-platform\">decompiling the app</a>? If not, that might be a good start, rather than trying to monitor the network traffic.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I did this with a lot of Android apps so I'll share what I have learned.</p>\n<p>When thinking of sniffing traffic, the first thing that comes to mind is \"I'll just root the Android device, run tcpdump on it and I'm done\". That works for simple things, but it gets really messy really fast. And if the app uses SSL (like 99% of what's out there) it's even worse.</p>\n<h1>Use a proxy</h1>\n<p>Most apps use HTTP/HTTPS to communicate with the server. The easiest way to sniff that kind of traffic is using a sniffing proxy (also called debugging proxy). Common ones are <a href=\"http://www.charlesproxy.com/\" rel=\"noreferrer\">Charles</a> and <a href=\"http://www.telerik.com/fiddler\" rel=\"noreferrer\">Fiddler</a>. I use Charles, so I'll show you how to work with it, but Fiddler should be similiar.</p>\n<p>First off, you need your computer and your Android device on the same LAN. Upon starting Charles, it will automatically start proxying your computer's traffic. You probably don't want this, so disable it from Proxy -&gt; Proxy Settings... -&gt; Windows. Now point your Android network settings to use your computer as HTTP proxy (Charles default port is 8888). Charles will show you all HTTP traffic from your device.</p>\n<p>If you need SSL (HTTPS) proxying, you have to install the Charles certificate on your device. Android requires you to have a protected (at least pattern) lockscreen to install external certificates. You can find the certificate in the doc/ directory in Charles' install path, or you can visit <a href=\"http://www.charlesproxy.com/getssl/\" rel=\"noreferrer\">http://www.charlesproxy.com/getssl/</a> from your device browser. Then, in Charles, go to Proxy -&gt; Proxy Settings... -&gt; SSL, enable SSL proxying and add the hosts you want to proxy (or just add <code>*</code> to proxy everything).</p>\n<h1>Non-HTTP(S) communication</h1>\n<p>An HTTP debugging proxy will cover most apps out there. In case the app is not using HTTP(S) things get a little more complex. You may want to look into the SOCKS proxy capability of Charles, and how to configure a SOCKS proxy on your device. If that doesn't suffice, then you'll really want to break out tools like tcpdump/Wireshark. You could set up a fake DNS, ARP spoof the device, use a sniffing VPN, etc. There are a lot of ways to go about it. A fake DNS is also good if you want to emulate the server, instead of the client.</p>\n<h1>SSL certificate checking</h1>\n<p>When dealing with SSL, most apps trust what the OS trusts. Since you can intall external certificates on Android, you're good. Rarely, the app will check the server certificate against an embedded CA root. This can be bypassed in a few ways:</p>\n<ul>\n<li>Using tools like apktool and smali, inject your own certificate into the app, replacing the original one;</li>\n<li>Write an xposed module that hooks the data send/receive methods, to sniff the decrypted messages;</li>\n<li>Write an xposed module that hooks the certificate checking routine, bypassing it.</li>\n</ul>\n<p>I would go with the first or the last one.</p>\n<h1>Decompilation</h1>\n<p>At some point you'll have to look at the application code. Maybe it's using a proprietary binary protocol, maybe the traffic is encrypted or compressed, maybe you can't make sense of some values. I suggest trying multiple decompilers/engines. They are not perfect, and a lot of times one works well where the other fails. <a href=\"http://virtuous-ten-studio.com/\" rel=\"noreferrer\">Virtuous Ten Studio</a> is a good one to start with. Then I alway extract the classes.dex file from the APK (it's just a ZIP file) and run it through dex2jar. I then run the resulting JAR through JD-GUI (JD-Core engine) and SecureTeam Java Decompiler (Procyon engine). Also, jadx can target DEX directly, without dex2jar.</p>\n<h1>InstaMessage</h1>\n<p>I checked the app you're trying to reverse. It's using standard HTTPS communication, easy to sniff using either Charles or Fiddler. The server has various GET endpoints and the client sends a base64-encoded <code>data</code> field. This is binary data, I haven't really looked into it but the first 70% is identical in all requests, so I suspect it's some kind of session token. The final part varies with requests, but the whole field is pretty high entropy so I'm thinking it's either compressed or encrypted. I would try to decompile the app and see what's going on. The server response, on the other hand, is plain JSON.</p>\n</div>",
            "votes": "8",
            "user": "Andrea Biondo",
            "time": "Aug 21, 2015 at 18:57",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you want to emulate the server on your own anyway, I would start with the server which just prints out whatever connection data is coming in and point my android there. Much faster and easier than monitoring traffic and filtering out all the stuff that is irrelevant.</p>\n</div>",
            "votes": "0",
            "user": "Devolus",
            "time": "Aug 21, 2015 at 6:13",
            "is_accepted": false,
            "comments": [
                {
                    "user": "sigmaxf",
                    "text": "<span class=\"comment-copy\">the app is binary.. how could I point it to my own server?</span>",
                    "time": null
                },
                {
                    "user": "Devolus",
                    "text": "<span class=\"comment-copy\">Your question is a bit unclear then. You said that you want to emulate the connection, so I was assuming that you want to emulate the server. So you want to emulate the client side only and not the server side?</span>",
                    "time": null
                },
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">Seems he doesn't have (his own) server, wants to analyze the connection first, then write a client to emulate the connection to the server.</span>",
                    "time": null
                }
            ]
        }
    ]
}