{
    "title": "Is it possible to feed data to a function during or outside of runtime using IDA Pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/10682/is-it-possible-to-feed-data-to-a-function-during-or-outside-of-runtime-using-ida",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a function that takes some arguments and returns a char array which is being used by send() function later on (basically a packet encoder). My initial approach was to try and decompile this big encode function but there're at least 20-40 sub functions also data types are not really easy to figure out so i gave up on that. My second approach was to try to use hex-rays decompiler plugin but that also gives some uncompilable c code. As last resort i tried to analyze input data and encoded data but since the input changes all the time during runtime it's really hard to compare results and the only conclusion i could reach was first byte is a header and next two bytes represent packet length. So my question is, is there any way to feed data into a function(subroutine) with IDA Pro or any other disassembly tool ?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "485",
    "tags": [
        "ida",
        "disassembly"
    ],
    "user": "AcarX",
    "time": "Dec 16, 2015 at 17:07",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Yes, you can use Appcall: <a href=\"https://hex-rays.com/products/ida/support/tutorials/debugging_appcall.pdf\" rel=\"nofollow\">https://hex-rays.com/products/ida/support/tutorials/debugging_appcall.pdf</a></p>\n<blockquote>\n<p>Appcall is a mechanism to call functions inside the debugged program\n  from the debugger or your script as if it were a built-in function.</p>\n<p>...</p>\n</blockquote>\n</div>",
            "votes": "2",
            "user": "Jason Geffner",
            "time": "Aug 21, 2015 at 21:08",
            "is_accepted": true,
            "comments": [
                {
                    "user": "AcarX",
                    "text": "<span class=\"comment-copy\">Thanks for the answer. This looks like my best shot. I'm getting some errors like \"Function type is not available or wrong\" but i should be able to get it right somehow.</span>",
                    "time": null
                }
            ]
        }
    ]
}