{
    "title": "Can Reverse Engineering produce code in a different language than the one the program was originally created?",
    "link": "https://reverseengineering.stackexchange.com/questions/10773/can-reverse-engineering-produce-code-in-a-different-language-than-the-one-the-pr",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Does Reverse Engineering always produces the source code in the same language the software was originally written?\nFor example, if the software program(.exe) been reversed was written in C++, the output of the reverse process would necessarily be C++ source code?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "130",
    "tags": [
        "disassemblers",
        "decompile"
    ],
    "user": "Carlinhos Damasceno",
    "time": "Sep 1, 2015 at 23:12",
    "comments": [
        {
            "user": "Abr001am",
            "text": "<span class=\"comment-copy\">i think C would be the most convenable and lowest human-readable level language that a debugger can convert whatever language a code is written with, I think , in more brief terms, any language can be converted to C besides the original soure-compiled language (concrete example: hexrays), but C could not probably be converted to higher levels like python, pascal etc</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Reverse engineering is the process of figuring out how stuff works. The output format of a reverse engineering session is not dependent on the original language in which the target was written, but rather is dependent on the purpose of the session (porting to a new system, stealing a competitor's algorithm, explaining to executives how a malware sample works at a high-level, etc.).</p>\n<p>The final product of a reverse engineering session may be a human-readable report, or pseudo-code, or a data-flow diagram, or a slide show presentation, or a reimplementation of the target in any language the reverse engineer wishes to use.</p>\n</div>",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Sep 2, 2015 at 1:39",
            "is_accepted": false,
            "comments": [
                {
                    "user": "reinierpost",
                    "text": "<span class=\"comment-copy\">It may also be source code. For instance,<b>.exe</b> files consisting of MSIL code can be converted back into various .NET source languages.</span>",
                    "time": null
                }
            ]
        }
    ]
}