{
    "title": "Does Windows 7 Pro use ASLR for win32 executable?",
    "link": "https://reverseengineering.stackexchange.com/questions/10781/does-windows-7-pro-use-aslr-for-win32-executable",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I unpacked a UPX packed PE binary. Both the packed and unpacked binary have fixed image base of <code>0x400000</code> (Checked by various PE tools). </p>\n<p>However, every time I run the program in OllyDbg, the image would located an a different base address. It would change the image base when I reopen the binary and start run it, and would not change the image base when I click the restart icon in OllyDbg. I read at <a href=\"http://www.woodmann.com/forum/archive/index.php/t-3302.html\" rel=\"nofollow noreferrer\">this post</a> saying that win32 exe never use ASLR. Is this true? I have win7 pro and OllyDbg1.10.</p>\n<p>Here is my real question. The unpacked executable have some address reference invalid. They are all using the standard win32 base <code>0x400000</code>. </p>\n<p>For example, I have the following instructions in my unpacked program, the reference to the <code>407018</code> is invalid. </p>\n<ul>\n<li>How could I fix this address reference?  </li>\n<li>How to change all the address references in the format of <code>0x40xxxx</code> to      <code>0x1150000</code> in code section? Is there a tool to do this?</li>\n</ul>\n<p><p></p>\n<pre><code>01153F2B  |. A1 18704000    MOV EAX,DWORD PTR DS:[407018]\n01153F30  |. 8365 F8 00     AND DWORD PTR SS:[EBP-8],0\n01153F34  |. 8365 FC 00     AND DWORD PTR SS:[EBP-4],0\n01153F38  |. 53             PUSH EBX\n01153F39  |. 57             PUSH EDI\n01153F46  |. 74 0D          JE SHORT CrackME.01153F55\n</code></pre>\n</p></div>",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "windows",
        "unpacking",
        "binary"
    ],
    "user": "Harry",
    "time": "Mar 28, 2017 at 15:46",
    "comments": [
        {
            "user": "rev",
            "text": "<span class=\"comment-copy\">The base randomization happens because of ASLR. You can disable ASLR for that specific binary (and thus make the references valid) using <a href=\"http://blog.didierstevens.com/2010/10/17/setdllcharacteristics/\" rel=\"nofollow noreferrer\">this tool</a>: <code>setdllcharacteristics -d your_file.exe</code></span>",
            "time": null
        },
        {
            "user": "Harry",
            "text": "<span class=\"comment-copy\">Hi, @AcidShout Thank you pointing out this. There is one bit in the header that can disable the ASLR in win32 binary. I have done this in CFF explorer. My problem has been solved!!!</span>",
            "time": null
        },
        {
            "user": "rev",
            "text": "<span class=\"comment-copy\">so you used CFF explorer? you can post an answer to your own question, which is <a href=\"http://stackoverflow.com/help/self-answer\">explicitly encouraged</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<h3>Why is this happening in the first place?</h3>\n<p>Changing image bases to a different random address each time an image is loaded is called <a href=\"https://en.wikipedia.org/wiki/Address_space_layout_randomization\" rel=\"nofollow noreferrer\"><em>Address Space Layout Randomization</em></a> (In short, ASLR). Most modern OSes employ ASLR on user mode processes (Some OSes do that for kernel mode code as well, at least partially) where this is possible.</p>\n<p>The major advantage of ASLR is that it increases the difficulty if exploiting memory corruption based exploits (often requires a information leak type of bug to mitigate), and therefore encouraged by the security community.</p>\n<p>In order to be ASLRed, an image must be <em>relocatable</em>. That is, it is required to properly function regardless of where in memory it is located. This tends to be complicated because certain instructions (in certain architecture) are position based. For example, on the x86 architecture the <a href=\"http://x86.renejeschke.de/html/file_module_x86_id_26.html\" rel=\"nofollow noreferrer\"><code>CALL</code></a> instructions can be either <em>relative</em> or <em>absolute</em>, making it impossible to change the addresses at which the image is loaded without risking crashes.</p>\n<p>An image can either make sure it only uses <em>relative</em> instructions (which might be difficult at times) or provide a <a href=\"https://en.wikipedia.org/wiki/Relocation_(computing)\" rel=\"nofollow noreferrer\"><em>relation table</em></a> as part of the image file. A relation table explicitly lists all absolute addresses used in the image for the loader to fix in case the image is relocated.</p>\n<h3>How to avoid ASLR?</h3>\n<p>Obviously, disabling ASLR is not encouraged because of the protection it provides. On 64bit windows user mode ASLR is <em>mandatory</em>, so you simply cannot disable it. However, on 32bit windows, you're allowed to and can disable it by disabling the relevant PE flag, by un-checking the marked checkbox in the following image:</p>\n<p><a href=\"https://i.sstatic.net/W6QfF.png\" rel=\"nofollow noreferrer\"><img alt=\"disabling ASLR\" src=\"https://i.sstatic.net/W6QfF.png\"/></a></p>\n</div>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Mar 28, 2017 at 15:44",
            "is_accepted": false,
            "comments": []
        }
    ]
}