{
    "title": "IDA Pro failed to display the program in graph mode",
    "link": "https://reverseengineering.stackexchange.com/questions/10793/ida-pro-failed-to-display-the-program-in-graph-mode",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>i am a complete beginner with IDA and I have just tried to follow a tutorial on how to unpack UPX. </p>\n<p>In the tutorial IDA looks like this: </p>\n<p><a href=\"https://i.sstatic.net/YU5jN.jpg\" rel=\"noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/YU5jN.jpg\"/></a></p>\n<p>When I try to get the graphical view like in the tutorial an error message appears:</p>\n<p><a href=\"https://i.sstatic.net/QRmr2.png\" rel=\"noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/QRmr2.png\"/></a></p>\n<p>I cannot find the Names window too, please help me.</p>\n<p>Here is how IDA Pro looks like at the moment:</p>\n<p><strong><a href=\"https://i.sstatic.net/cWAQa.png\" rel=\"noreferrer\">https://i.sstatic.net/cWAQa.png</a></strong></p>\n<p>Version: IDA Pro 6.5</p>\n<p>Sorry for those noob questions, but I am confused.</p>\n</div>",
    "votes": "5",
    "answers": 2,
    "views": "8k",
    "tags": [
        "ida",
        "unpacking"
    ],
    "user": "L. Resnik",
    "time": "Sep 4, 2015 at 7:48",
    "comments": [
        {
            "user": "DOD",
            "text": "<span class=\"comment-copy\">I know you are learning  ida, but use ida for unpack/dynamic reverse (my experience) is not good idea.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>IDA can only display functions in graphical mode if they have a well-defined start and end address. Normally, the start and end address are determined from the disassembly - the start address is the target address of <code>call</code> instructions, the end address is where the code has a <code>ret</code> instruction (*).</p>\n<p>In your case, IDA failed to make a function from your code, probably because there is no call to <code>start</code>, and maybe there's not even a <code>ret</code> at the end. You can try to fix that by moving the cursor to the <code>start</code> label and pressing the <code>P</code> key. Once your code is defined as a function, the space key should switch between graphical view and assembly view just like your tutorial says.</p>\n<p>(*) Actually, it's a bit more complicated; some parts of the function may be behind the <code>ret</code>; but IDA detects this from jumps within the function.</p>\n</div>",
            "votes": "5",
            "user": "Guntram Blohm",
            "time": "Sep 4, 2015 at 7:12",
            "is_accepted": false,
            "comments": [
                {
                    "user": "L. Resnik",
                    "text": "<span class=\"comment-copy\">Pressing the \"p\" key on EP results in: <code>UPX1:00486DA3: The function has undefined instruction/data at the specified address. Your request has been put in the autoanalysis queue.</code> Thank you for your answer so far, interesting!</span>",
                    "time": null
                },
                {
                    "user": "tmr232",
                    "text": "<span class=\"comment-copy\">This means that IDA can't define the function. Probably since it is not yet fully unpacked.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I realize this is very old, but in most cases this is solved easily - check if you are under a procedure context, for example if you searched for a string value then go to the place the label is used (pressing x) and then it will show the graphical view</p>\n</div>",
            "votes": "-1",
            "user": "shimi_tap",
            "time": "Jul 9, 2018 at 19:53",
            "is_accepted": false,
            "comments": []
        }
    ]
}