{
    "title": "Is it possible to make an application skip a call?",
    "link": "https://reverseengineering.stackexchange.com/questions/10862/is-it-possible-to-make-an-application-skip-a-call",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have an application that calls a subroutine before sending the data over socket and in that subroutine the packet is being encrypted. Is there any way to make application skip that subroutine and send the packet as non-encrypted ?</p>\n</div>",
    "votes": "4",
    "answers": 2,
    "views": "15k",
    "tags": [
        "ida"
    ],
    "user": "AcarX",
    "time": "Dec 16, 2015 at 17:06",
    "comments": [
        {
            "user": "user2823000",
            "text": "<span class=\"comment-copy\">Replace the call by a NOP if the encryption is in-place, or modify the function to just copy the input if it's not. Without more information about how the program &amp; the call work, it's hard to help you further.</span>",
            "time": null
        },
        {
            "user": "AcarX",
            "text": "<span class=\"comment-copy\">Here's a screenshot from IDA: <a href=\"http://i.imgur.com/zurZc9f.png\" rel=\"nofollow noreferrer\">i.imgur.com/zurZc9f.png</a></span>",
            "time": null
        },
        {
            "user": "Hackndo",
            "text": "<span class=\"comment-copy\">There are two calls in you screenshot. <b>edit</b> : I guess it's <code>encoder_func</code></span>",
            "time": null
        },
        {
            "user": "AcarX",
            "text": "<span class=\"comment-copy\">Yeah that's the subroutine i want to skip.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>As Dillinur wrote, you need to NOP out this call. To do that you may need a hex editor, like <a href=\"http://www.x-ways.net/winhex/\" rel=\"noreferrer\">WinHex</a>. To NOP out the subroutine, you have to determine from which address it is called. To see that address, in IDA go to <strong>Options -&gt; General</strong> and mark <strong>Line Prefixes</strong>. </p>\n<p>It's also nice to see which Opcodes you would like to NOP out. Go to <strong>Options -&gt; General</strong> and write <strong>6</strong> in the field <strong>Number of opcode bytes</strong>. Then your IDA graph mode will look like that:</p>\n<p><a href=\"https://i.sstatic.net/JRKL4.png\" rel=\"noreferrer\"><img alt=\"IDA Graph mode\" src=\"https://i.sstatic.net/JRKL4.png\"/></a></p>\n<p>In my example, if I want to skip the foo-subroutine while execution, I need to set the opcode bytes <em>E8 DF E6 FF FF</em> to <em>90 90 90 90 90</em> (E8 is the call mnemonic and the rest are the offset bytes). 0x90 is the NOP opcode.</p>\n<p>To NOP out these bytes I open the executable in <a href=\"http://www.x-ways.net/winhex/\" rel=\"noreferrer\">WinHex</a> and search the offset 0x31CC (not 0x4031CC, because 0x400000 is the load address of my executable in IDA). Finally, when I've found the offset 0x31CC I look for the sequence of bytes E8 DF E6 FF FF and then edit them to 90 90 90 90 90. Save it.</p>\n<p>Also you may think about NOPing out of the PUSH-instruction(s) preceding your subroutine in order to avoid errors in the succeeding code.</p>\n</div>",
            "votes": "10",
            "user": "0xDEADC0DE",
            "time": "Sep 14, 2015 at 9:46",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Dominik Antal",
                    "text": "<span class=\"comment-copy\">Just a note, it is also possible to edit the function within Ollydbg then save the modified (\"patched\") executable. The advantage with olly is that you can see the instructions you are changing, while with a plain hex editor it can be difficult.</span>",
                    "time": null
                },
                {
                    "user": "TripeHound",
                    "text": "<span class=\"comment-copy\">I don't know if it's still prevalent (in days of DEP - data execution prevention), but with many programs of old, while you could find such a block of code during execution, but it wouldn't appear that way on disk, so you couldn't (easily) make permanent changes (essentially, the \"code\" was a block of data that was decrypted during the start-up phase).  Also, doesn't the <code>add esp,8</code> balance the <code>push</code>es, so they should stay?</span>",
                    "time": null
                },
                {
                    "user": "Milhous",
                    "text": "<span class=\"comment-copy\">You don't need to nop the preceding pushes as there as an add esp, 8 after the function call.</span>",
                    "time": null
                },
                {
                    "user": "0xDEADC0DE",
                    "text": "<span class=\"comment-copy\">In general, you may need to NOP the preceding pushes if the called function uses <i>stdcall</i> as calling convention, where the called function is responsible for cleaning up the stack. That is why I wrote \"you may think about NOPing\".</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There is an <em>ida</em> tag, but your question doesn't mention it, so let's do that with <a href=\"http://radare.org\" rel=\"noreferrer\">radare2</a> instead ;)</p>\n<p><a href=\"https://i.sstatic.net/rhIkR.png\" rel=\"noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/rhIkR.png\"/></a></p>\n<p><code>aa</code> to analyse the binary, <code>pdf</code> to show the current function, <code>wx</code> to write hexpairs, and <code>pdf</code> again to check the result. It's also possible to use <code>\"wa nop;nop;nop;nop;nop\"</code> instead, if you prefer writing instructions, or even better, the magical <code>wao nop</code> command, to replace the <strong>current</strong>\n opcode with nop.</p>\n</div>",
            "votes": "9",
            "user": "jvoisin",
            "time": "Sep 14, 2015 at 12:50",
            "is_accepted": false,
            "comments": []
        }
    ]
}