{
    "title": "How to translate IDA pseudocode to C/C++ code?",
    "link": "https://reverseengineering.stackexchange.com/questions/10896/how-to-translate-ida-pseudocode-to-c-c-code",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to reverse engineer a packet protocol and I was abled to find a subroutine which is likely to be an encryption function. I do not know much about cryptography but it looked like a CBC encryption. Here's the pseudocode I got from IDA: <a href=\"http://pastebin.com/UGYpbthr\" rel=\"nofollow noreferrer\">http://pastebin.com/UGYpbthr</a> and here is a part from the original subroutine: <a href=\"https://i.sstatic.net/EBlQa.png\" rel=\"nofollow noreferrer\">https://i.sstatic.net/EBlQa.png</a> also here's a part from where the subroutine is called: <a href=\"https://i.sstatic.net/2S9Nc.png\" rel=\"nofollow noreferrer\">https://i.sstatic.net/2S9Nc.png</a> . Is it possible to translate this pseudocode to C code without further reverse engineering ? If so how should I do it ?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ida",
        "packet"
    ],
    "user": "AcarX",
    "time": "Dec 16, 2015 at 17:08",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">For me, your function has remarkable simiarity with <code>blowfish_enc</code> from <a href=\"https://tls.mbed.org/blowfish-source-code\" rel=\"nofollow noreferrer\">tls.mbed.org/blowfish-source-code</a>, with the loop in that source unrolled by the compiler. W.S. is right in that the function doesn't access global variables; however, the three parameters (typed <code>int</code> by IDA) are in fact pointers, if you check their usage, so you need the data fields they point to anyway.</span>",
            "time": null
        },
        {
            "user": "AcarX",
            "text": "<span class=\"comment-copy\">Thanks, as you said blowfish_enc is really similar to my function. Is it possible that it is actually the same function ?</span>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">It looks at least similar. If i were you, i'd run the original program until your function, note the data, step over the function, note the data again, then plug that into the blowfish source and check if it does the same stuff. You'll have to call <code>mbedtls_blowfish_setkey</code> first, and i'd guess might find this function in your original code as well if you look for it.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This specific pseudocode is actually regular C code because it doesn't access global variables and stack. You'll probably need to add some typedefs for basic types.\nPlease note that this code should be compiled as 32 bit code (or any other where sizeof int is equal to sizeof of pointer for your specific system) to avoid problems with pointer sizes. </p>\n</div>",
            "votes": "2",
            "user": "w s",
            "time": "Sep 18, 2015 at 9:18",
            "is_accepted": true,
            "comments": []
        }
    ]
}