{
    "title": "Identity of a programmer from a reversed VB.NET application (Visual Studio)",
    "link": "https://reverseengineering.stackexchange.com/questions/10942/identity-of-a-programmer-from-a-reversed-vb-net-application-visual-studio",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have reversed a program I found running on my computer, written in VB.NET using Microsoft Visual Studio.</p>\n<p>I'm pretty sure it is a keylogger. Now since I'm a very careful user, I'm 100% sure I did not download that. I believe it was planted by someone who had access to my computer.</p>\n<p>Is there a way I can identify who wrote it? (Computer name maybe, VS username, etc?)\nAdvanced methods would be appreciated as well in case whoever wrote it found a way around the obvious ones.</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "130",
    "tags": [
        "visual-basic"
    ],
    "user": "user13646",
    "time": "Sep 24, 2015 at 3:21",
    "comments": [
        {
            "user": "0xDEADC0DE",
            "text": "<span class=\"comment-copy\">I dont know how it can be possible. But maybe a <i>Time Date Stamp</i> (a compile time of the executable) could give you some useful information? You can see it in <i>IMAGE_FILE_HEADER</i> with PEView, for example. Sorry, if its not relevant for you, its the only my suggestion.</span>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">There are countless ways to help determine information about the authorship of the program (PE timestamps as @0xDEADC0DE suggested, language of strings used throughout the program, embedded debug paths, remote server hostname or IP address, choice of algorithms, etc.). But without the actual binary available to review, it's difficult to say which indicators are applicable.</span>",
            "time": null
        },
        {
            "user": "Dominik Antal",
            "text": "<span class=\"comment-copy\">I would inspect the binary in a .NET decompiler, such as <a href=\"https://www.jetbrains.com/decompiler/download/\" rel=\"nofollow noreferrer\">Jetbrains</a> or <a href=\"https://ilspy.net/\" rel=\"nofollow noreferrer\">ILSpy</a>. Maybe a simple \"strings -n5\" would result in interesting strings, if he was dumb enough to leave in such information. Also AssemblyInfo.vb is common in .NET apps, so I would <a href=\"https://stackoverflow.com/questions/629206/how-do-assemblyinfo-attributes-map-to-win32-versioninfo\">look into that</a> too.</span>",
            "time": null
        }
    ],
    "answers_data": []
}