{
    "title": "Tools to get started with reading memory during runtime",
    "link": "https://reverseengineering.stackexchange.com/questions/10946/tools-to-get-started-with-reading-memory-during-runtime",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I want to get into reverse engineering and eventually be able to read the memory of a specific game during runtime and work with this data. For this purpose I have been doing research on that topic and was considering to start with a simple task to learn about the proper tools and stuff like finding offsets for various information.</p>\n<p>I wanted to open an instance of the notepad editor, write some text into it and then access this text from another program after figuring out the right addresses. Although it seems as if OllyDbg is a famous choice I had problems to attach it to my notepad process. (Apparently some problem with the 64-bit Windows 10 would be my first guess here.)</p>\n<p>Anyways, I was curious if you can suggest me tools and alternatives for OllyDbg to get into this, especially proving the possibility to search the memory contents with specific patterns, in my sample case the text I entered on screen.</p>\n</div>",
    "votes": "2",
    "answers": 2,
    "views": "12k",
    "tags": [
        "windows",
        "ollydbg",
        "tools",
        "memory"
    ],
    "user": "Christian Ivicevic",
    "time": "Sep 24, 2015 at 19:02",
    "comments": [
        {
            "user": "rev",
            "text": "<span class=\"comment-copy\">Olly is x86-only, which is why you can't attach to x64 notepad.exe. To debug x64 binaries, you can use x64_dbg, IDA's remote x64 debugger, or WinDbg, among others.</span>",
            "time": null
        },
        {
            "user": "Christian Ivicevic",
            "text": "<span class=\"comment-copy\">@AcidShout Actually I tried x64_dbg as well but it seems as if it doesn't have support to search in the memory or I was just unlucky to not find the option. Any advice on that?</span>",
            "time": null
        },
        {
            "user": "rev",
            "text": "<span class=\"comment-copy\">I was actually unable to search, but that may be due to the fact I'm using an old version of x64_dbg. Can't update now, but what you should do is go to the .data section of the process and then right click -&gt; \"Find pattern\", and there you search for your string. I would use Cheat Engine for that, however, as (imo) it has a better UI for this kind of stuff.</span>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">notepad uses memory mapped sections you wont be able to find the data you have written in a notepad in the process memory of notepad.exe</span>",
            "time": null
        },
        {
            "user": "gandolf",
            "text": "<span class=\"comment-copy\">As you venture into modifying game memory. I'd suggest also looking into dll or code injection. Being able to reside inside the games memory space makes the entire process much simpler (direct memory access is much easier and less intrusive than read/writeprocessmemory).</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"http://www.cheatengine.org/\" rel=\"nofollow\">Cheat Engine</a> is probably the most well-known tool for scanning memory for strings.</p>\n<p>Some of the better hex editors (such as <a href=\"http://www.sweetscape.com/010editor/\" rel=\"nofollow\">010 Editor</a> and <a href=\"http://www.x-ways.net/winhex/\" rel=\"nofollow\">WinHex</a>) also allow you to scan a process's memory for strings.</p>\n</div>",
            "votes": "3",
            "user": "Jason Geffner",
            "time": "Sep 24, 2015 at 19:19",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Christian Ivicevic",
                    "text": "<span class=\"comment-copy\">The Cheat Engine seems like a really decent tool to get started with some basics. I really like the search which filters specific memory addresses - helps a lot to narrow down the possible locations for certain strings.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"https://www.unknowncheats.me/forum/general-programming-and-reversing/145833-reclass-2015-a.html\" rel=\"nofollow\">ReClass</a> is used to rebuild structures/classes in memory and will output C/C++ compatible structures that you can easily copy into existing code. Really neat too. I've used it personally to access vtables</p>\n<p>It is also EXTREMELY effective at following pointers in memory and previewing data</p>\n<p><a href=\"https://www.youtube.com/watch?v=K_jj6yF5ac0\" rel=\"nofollow\">How to use ReClass</a></p>\n<p>This guy does a good job of explaining how it is used in game hacking</p>\n</div>",
            "votes": "2",
            "user": "otc",
            "time": "Sep 24, 2015 at 20:03",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Christian Ivicevic",
                    "text": "<span class=\"comment-copy\">This tool will definitely come in handy, however for the beginning the Cheat Engine looks like the very first tool to work with when it comes to finding specific data in memory. ReClass will apparently be the next step of parsing the found data. Thanks for the suggestion :)</span>",
                    "time": null
                }
            ]
        }
    ]
}