{
    "title": "How to deal with code that change its address among different execution",
    "link": "https://reverseengineering.stackexchange.com/questions/10957/how-to-deal-with-code-that-change-its-address-among-different-execution",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I think that this is a basic need of every reverser so this question may have been asked in other places but really, I'm unable to find an answer. Maybe I'm asking the wrong question.</p>\n<p>So, supposing I have a DLL that change base VA among different execution because of ASLR, in windows I can set DLLCharacteristic to make sure is loaded every time at the same address (losing eventually the signature). But what for generic code?</p>\n<p>Suppose that a program allocate a buffer, copy some data, decrypt it then run it. In IDA, of course I can take a snapshot of memory, analyze it, put label and so on, but if I run the program the second time chances are the address are changed, so I can't benefit of my previous analysis.</p>\n<p>Is there a way map an arbiratry address with a previous analyzed section in the database?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "249",
    "tags": [
        "ida",
        "windows",
        "packers"
    ],
    "user": "Marco Ramsay Qualcuno",
    "time": "Sep 25, 2015 at 12:49",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>To map your section to another address use <strong>Edit -&gt; Segments</strong> and than <strong>Move current segment</strong> in IDA, you can even rebase the whole program in this menu.</p>\n<p>I hope I have understood your question. Sorry if not :)</p>\n</div>",
            "votes": "1",
            "user": "0xDEADC0DE",
            "time": "Sep 25, 2015 at 13:45",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Marco Ramsay Qualcuno",
                    "text": "<span class=\"comment-copy\">It works like a charm. Sorry for the dumb question. I've always tried the opposite from the \"program segmentation\" view and it never worked. Thanks, this semplify a lot my work!!</span>",
                    "time": null
                }
            ]
        }
    ]
}