{
    "title": "Debugging digitally signed executable",
    "link": "https://reverseengineering.stackexchange.com/questions/10977/debugging-digitally-signed-executable",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm having trouble debugging a win32 executable file under Windows 7. I've tried using ollyDbg and <a href=\"http://x64dbg.com/\" rel=\"nofollow noreferrer\">x64dbg</a>: the former simply does nothing, while the latter complains with an \"<strong>Error starting process (invalid pe?)!</strong>\" message.</p>\n<p>I <em>think</em> this might have to do with the fact that said executable is digitally signed. I did some quick research and <a href=\"https://stackoverflow.com/questions/341168/can-i-remove-a-digital-signature-from-a-dll\">this SO question</a> came up, where I learned that digital signatures in windows executables are referenced in the file's PE header, which I <em>think</em> might be what x64dbg was complaining about.</p>\n<p>The executable I'm talking about is the Mumble windows client version 1.2.10.\nIt is the only executable signed with <strong>two</strong> different digital signatures, which further reinforces my hypothesis.\nSadly, even after stripping the digital signatures using the delcert.exe linked in the SO question above, the problem remains which brings me to a dead end.</p>\n<p>Is it possible digital signatures are messing these debuggers up? Is it possible that the signature stripping tool doesn't produce a valid pe file for the debuggers I tried? What else could I be doing wrong?</p>\n<hr/>\n<p>As a footnote: I know mumble is free software and I could just compile my own version, but this is Reverse Engineering, right?</p>\n<hr/>\n<p>Update: Following Jason comment, I'm posting the ollydbg log, which doesn't really say anything, unfortunately:</p>\n<pre><code>Log data\nAddress    Message\nOllyDbg v1.10\nBookmarks sample plugin v1.06 (plugin demo)\n  Copyright (C) 2001, 2002 Oleh Yuschuk\nCommand line plugin v1.10\n  Written by Oleh Yuschuk\nFile 'C:\\Program Files (x86)\\Mumble\\mumble.exe'\n</code></pre>\n<hr/>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "740",
    "tags": [
        "windows",
        "debugging",
        "pe"
    ],
    "user": "Damian",
    "time": "May 23, 2017 at 12:37",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">\"I've tried using ollyDbg and x64dbg: the former simply does nothing\" -- What do you mean, \"does nothing\"? Can you paste the logs from OllyDbg's log window?</span>",
            "time": null
        },
        {
            "user": "broadway",
            "text": "<span class=\"comment-copy\">Signing shouldn't have anything to do debugger issues, but if you want to strip it, you need to clear the IMAGE_DIRECTORY_ENTRY_SECURITY data directory.</span>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">You're using an outdated version of OllyDbg. Please try with <a href=\"http://www.ollydbg.de/odbg201.zip\" rel=\"nofollow noreferrer\">OllyDbg v2.01</a>.</span>",
            "time": null
        },
        {
            "user": "peter ferrie",
            "text": "<span class=\"comment-copy\">try copying the file into a different directory, too - the program files directory has protection that x86dbg might not like.</span>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">i had mumble ( standalone zip) somewhere and took a look at it in ollydbg 1.10 and it does not complain it starts the audio setup wizard checks my speaker / mic / and asks me to set a few sliders to make latency lowest and then starts off the connect to server   (it does emit a lot of debug strings i ran it in winitors pestudio and it appears it uses a comodo cert  cert is not a problem for debugging this app you have some other problem</span>",
            "time": null
        }
    ],
    "answers_data": []
}