{
    "title": "Malware analysis - AntiDebugging - Malware slows down the PC while being debugged",
    "link": "https://reverseengineering.stackexchange.com/questions/11017/malware-analysis-antidebugging-malware-slows-down-the-pc-while-being-debugge",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>As part of my work, I'm debugging a malware found and his behavior is pretty basic after execution:</p>\n<ol>\n<li>Being executed</li>\n<li>Decrypt a lot of data from memory and obtain a new PE (from memory)</li>\n<li>Create a child process in suspended state</li>\n<li>Dump the new data obtained into the Created child process</li>\n<li>SetThreadContext</li>\n<li>ResumeThread</li>\n</ol>\n<p>Now one issue i was thinking about, is the fact i dont know what the <code>EntryPoint</code> is so i dont know what part of the memory bytes i would change to <code>EB FE</code> (JMP &lt; ToSelf &gt;) To be able to debug the process from the start</p>\n<p>Once the new process is created and im attaching a debugger to it - OLLYDbg for that case (And the process is on <em>Pause</em> state) Pressing <code>F8 - step over</code> causing the application to have a huge delay of like 10 seconds untill the Opcode is finished - which makes no sense.\nAlso if i watch the newly created process on <code>Sysinternals - ProcessExplorer</code> I can see that after i press F8 the CPU usage of that process is very high 50-90 for all that time, until the opcode is finished. Which also results in all of the computer to run very slowly</p>\n<p>What could cause that? and how would i be able to bypass that?</p>\n<p>It does not happen if i dont debug the process.</p>\n</div>",
    "votes": "3",
    "answers": 0,
    "views": "281",
    "tags": [
        "windows",
        "ollydbg",
        "malware",
        "anti-debugging"
    ],
    "user": "0xAK",
    "time": "Oct 4, 2015 at 11:10",
    "comments": [
        {
            "user": "0xec",
            "text": "<span class=\"comment-copy\">Have you changed <code>EB FE</code> back to the original opcodes? Instead of pressing  F8 you can try to <code>Resume All Threads</code>.</span>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">does attaching to a suspended child process succeed ?</span>",
            "time": null
        },
        {
            "user": "0xAK",
            "text": "<span class=\"comment-copy\">@ExtremeCoders, Yes ofcourse i remembered.</span>",
            "time": null
        },
        {
            "user": "0xAK",
            "text": "<span class=\"comment-copy\">@blabb, and yes it succeedes, basically OllyDbg creates a new thread for him self for debugging the process</span>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">oh ollydbg 2.01 resumes the thread from supended state when attaching to a suspended process i dont think that behaviour is a standard behaviour windbg  or ollydbg 1.10 never succeded in attaching to a suspended process  and that is how it should be i think well in such case you <b>CANT</b>  resume from your parent thread i think and may cause inconsistent result i would bet</span>",
            "time": null
        }
    ],
    "answers_data": []
}