{
    "title": "How to get x and y position from joystick?",
    "link": "https://reverseengineering.stackexchange.com/questions/11067/how-to-get-x-and-y-position-from-joystick",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have VR2 Joystick and I want to hack it. What I think is that, to determine analog voltage of joystick outpin and to mimic this values in Arduino with AnalogWrite function. I tried measure analog voltage of joystick pins but I cannot record this values. Is there any way to find x, y position of joystick? Actually, I don't know whether is this method is correct. Because, values can mislead, maybe. Is there another way you know, you apply?</p>\n<p>Thanks in advance.</p>\n</div>",
    "votes": "0",
    "answers": 2,
    "views": "833",
    "tags": [
        "hardware",
        "arduino"
    ],
    "user": "seda",
    "time": "Oct 9, 2015 at 12:10",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There is a 2-page forum thread <a href=\"http://www.wheelchairdriver.com/board/viewtopic.php?f=2&amp;t=2603\" rel=\"nofollow noreferrer\">here</a> that explains how to interface with the VR2 joystick.</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/8mZ3b.jpg\"/>\n<img alt=\"enter image description here\" src=\"https://i.sstatic.net/6JiRB.jpg\"/>\n<img alt=\"enter image description here\" src=\"https://i.sstatic.net/0A91e.gif\"/>\netc...</p>\n</div>",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Oct 9, 2015 at 13:09",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">lol, Jason .. 2 ppl finding the same forum at the same time :-)</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">Great minds think alike! I voted your answer up since it actually provides extra information, as opposed to mine which basically says, \"hey just go look over there\" :)</span>",
                    "time": null
                },
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">In many cases, a 'there is a real good explanation over there' answer has more value than the short summary that an answer here can provide.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You might be interested in <a href=\"http://www.wheelchairdriver.com/board/viewtopic.php?f=2&amp;t=3261\" rel=\"nofollow\">this forum post</a> where people have already interfaced your joystick to an arduino. It also has a link to the specifications of a <a href=\"http://www.cw-industrialgroup.com/Products/Joystick-Controls/Multi-Axis-Controller/Multi-Axis-Contactless-Joystick-Controller-JC2000.aspx\" rel=\"nofollow\">similar joystick</a>, including a <a href=\"http://www.cw-industrialgroup.com/getattachment/a6bb9db0-f4be-47c9-8e9d-e8931694969f/JC2000_jun07%28EN%29\" rel=\"nofollow\">data sheet</a>.</p>\n<p>Note that each direction uses 2 hall effect sensors, whose outputs correspond, and you should read both of them and compare them. Only if their sum is a constant value, +/- a few percent, can you assume that both of them work. Or, if you want to emulate the joystick in an existing circuit, you'll have to provide both values to \"fool\" the existing logic.</p>\n<p>Also, please not that the standard Arduino <code>AnalogWrite</code> function doesn't do a true analog write; instead, it sets the output to a PWM (<a href=\"https://learn.sparkfun.com/tutorials/pulse-width-modulation\" rel=\"nofollow\">pulse width modulation</a>) signal with a duty cycle ratio that corresponds to the <code>AnalogWrite</code> written value. This is \"analog\" enough to control the brightness of a LED, but won't work with anything that requires a true analog signal. In order to produce a true analog signal, you'll need to use an Arduino Due or Arduino Zero, which have <a href=\"https://www.arduino.cc/en/Reference/AnalogWriteResolution\" rel=\"nofollow\">2 resp. 1 true analog output signal</a> (which isn't enough if you want to simulate the 4 hall sensors that the joystick has), so you'll need a 4-channel digital to analog converter with an arduino library, <a href=\"https://www.adafruit.com/products/1085\" rel=\"nofollow\">something like this</a>.</p>\n<p>If you seriosly consider starting a project, i'd <em>strongly</em> recommend you get a digital oscilloscope that will allow you to check the real voltages on both your joystick and your simulation.</p>\n</div>",
            "votes": "1",
            "user": "Guntram Blohm",
            "time": "Oct 9, 2015 at 13:10",
            "is_accepted": false,
            "comments": []
        }
    ]
}