{
    "title": "Audio file compression identification",
    "link": "https://reverseengineering.stackexchange.com/questions/11197/audio-file-compression-identification",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've been working on reversing file formats from the game of star wars episode 1: the phantom menace. </p>\n<p>I have managed to extract the audio files from the .lab file in which they were contained. I cannot however play the audio files.</p>\n<p>The files are provided at the end of the question.</p>\n<p>I managed to find some of the decompressed files in the game's cache (which do play) and so I have a selection of audio files in both compressed and uncompressed form.</p>\n<p>The compression ratio is about 66%; i.e. the compressed file is 1/3 of the size of the uncompressed size.</p>\n<p>This is an example of the uncompressed and compressed form of the data. (From BDm8906.wav and BDM8906.wv) </p>\n<p>The first 32 bytes of the uncompressed file (Magic is riff) BDm8906.wav</p>\n<pre><code>52 49 46 46 DA 77 00 00 57 41 56 45 66 6D 74 20\n10 00 00 00 01 00 01 00 22 56 00 00 44 AC 00 00\n</code></pre>\n<p>The first 32 bytes of the compressed file (Magic is INDYWV) BDM8906.wv</p>\n<pre><code>49 4E 44 59 57 56 22 56 00 00 10 00 00 00 01 00 \n00 00 F1 2B 00 00 00 00 00 00 B6 77 00 00 00 00\n</code></pre>\n<p>From looking a few of the compressed files I have found that:</p>\n<p>The first 16 bytes are always the same.\nThe next 4 bytes are the size of the compressed file.\nThe next 6 bytes are always zero. </p>\n<p>Here's a more detailed look at the hexdump of the compressed file:</p>\n<p><a href=\"https://i.sstatic.net/FDpGy.jpg\" rel=\"noreferrer\">https://i.sstatic.net/FDpGy.jpg</a></p>\n<p>(SE will not let me upload it).</p>\n<p>From byte 25 (start counting at 0) to the end of the file is always different. The number of bytes from here to the end of the file is the size of the compressed file indicated earlier.</p>\n<p>Attempts to decompress:</p>\n<p>1) Thorough googleing. One other guy on the lucas forums and on the xentax forums attempts to decompress it without success. It is not wavepack.</p>\n<p>2) Trying common compression algorithms on the uncompressed files. Compress, lzma, gzip do not even come close to the compression ratio reported.</p>\n<p>3) Binwalk on the binary:  </p>\n<pre><code>DECIMAL       HEXADECIMAL     DESCRIPTION\n--------------------------------------------------------------------------------\n0             0x0             Microsoft executable, portable (PE)\n715764        0xAEBF4         YAFFS filesystem\n721564        0xB029C         YAFFS filesystem\n746196        0xB62D4         LZMA compressed data, properties: 0x64, dictionary size: 33554432 bytes, uncompressed size: 16777216 bytes\n</code></pre>\n<p>When I run binwalk on windows I get that it includes DMC (<a href=\"https://en.wikipedia.org/wiki/Dynamic_Markov_compression\" rel=\"noreferrer\">https://en.wikipedia.org/wiki/Dynamic_Markov_compression</a>)</p>\n<p>4) Dissembling the Binary and trying to find the location of the decompression code - this is quite difficult</p>\n<p>A sample (two files, one encrypted one unencrypted) can be found here:</p>\n<p><a href=\"https://www.dropbox.com/sh/jvljza0v76mvl56/AAC41MenYP57dVHgAXY-DkSsa?dl=0\" rel=\"noreferrer\">https://www.dropbox.com/sh/jvljza0v76mvl56/AAC41MenYP57dVHgAXY-DkSsa?dl=0</a></p>\n<p>How can I figure out what it is using?</p>\n<p>Thanks </p>\n<p>Edit\nAccording to reaper, decompressed file:</p>\n<p>22.05 sample rate\n16 bits per sample\n15323 samples\n694 ms</p>\n<p>whatever the game does has decoded it into 15323 16 bit integers</p>\n</div>",
    "votes": "8",
    "answers": 1,
    "views": "1k",
    "tags": [
        "unpacking",
        "file-format"
    ],
    "user": "RNs_Ghost",
    "time": "Nov 3, 2015 at 16:54",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">First thing i'd do is run the game with ProcMon. Check where it reads from the .lab file and where it writes the .wav file. Check the stack at these calls to find out which functions from the binary call it. The whole thing is probably quite similar to my answer to <a href=\"http://reverseengineering.stackexchange.com/questions/9168/reversing-encryption-by-analysing-executable/9171#9171\">this</a>.</span>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">INDYWV appears to be a proprietary audio file format used by LucasArts. The game Star Wars: X-Wing Alliance also uses INDYWV files. Best bet is to do what @GuntramBlohm said above.</span>",
            "time": null
        },
        {
            "user": "Aron",
            "text": "<span class=\"comment-copy\">I don't know if this is the answer you're looking for, but you can use an application called SCRUMM Revisited to decompress the SW TPM music  (and sound effect) files to .WAV format <a href=\"http://jsg.id.au/scumm/scummrev/index.html\" rel=\"nofollow noreferrer\">jsg.id.au/scumm/scummrev/index.html</a> the music files are in the \\music directory with a .IMC extension, and the .LAB files contain many sound effects.</span>",
            "time": null
        },
        {
            "user": "Aron",
            "text": "<span class=\"comment-copy\">By the way, the main theme is called \"SQSTALK2.IMC\"</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I was looking at the same problem and couldn't find a solution anywhere, so I implemented it myself!</p>\n<p>smlu (Crt Vavros) had already started working on the format for his <a href=\"https://github.com/smlu/Urgon\" rel=\"nofollow noreferrer\">Indiana Jones and the Infernal Machine Mod Tools</a> but sadly the format was slightly different: Indiana Jones files use WVSM decompression but on Phantom Menace the dialog files are compressed with a variant of ADPCM algorithm.\nMy approach was to use Ghidra to disassemble and locate the algorithm, and also x64dbg for debugging.</p>\n<p>I published everything on my github: <a href=\"https://github.com/justedni/indywvtowav\" rel=\"nofollow noreferrer\">IndyWV to WAV converter</a></p>\n<p>I know it's a very old thread, but I hope this can help anyone who would like to extract the dialog files from Star Wars Episode 1: The Phantom Menace! And if anyone is aware of other games that also use that format, I'd be interested to know!</p>\n</div>",
            "votes": "2",
            "user": "justedni",
            "time": "May 6, 2024 at 7:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}