{
    "title": "How to find WndProc using x64dbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/11210/how-to-find-wndproc-using-x64dbg",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to find a WndProc from explorer.exe that is handling these messages, I've found with Spy++:</p>\n<pre><code>&lt;000001&gt; 00000000000B01C8 P message:0xC02B [Registered:\"SHELLHOOK\"] wParam:00000025 lParam:000F0184\n&lt;000002&gt; 00000000000B01C8 P message:0xC02B [Registered:\"SHELLHOOK\"] wParam:00008006 lParam:000F0184\n</code></pre>\n<p>I'm trying to prevent explorer.exe from flashing the task bar button, it's ruining my Windows 10 experience. In Windows 10 the flashing task bar buttons appear in all desktops, and it's just maddening when focusing on a work on another virtual desktop. Not a feature I want. The above messages are sent to Task switcher in explorer.exe, if I can prevent them being handled I can beat this.</p>\n<p>I've wealth of knowledge about the WndProc which I want to see, and modify from Spy++, following windows are Property Inspector of Spy++ (64 bit version):</p>\n<p>(Note: the 32bit version of Spy++ does not show Window Proc at all, just <code>(Unavailable)(Unicode)</code></p>\n<p><a href=\"https://i.sstatic.net/k5L8n.png\" rel=\"noreferrer\"><img alt=\"Window Proc address?\" src=\"https://i.sstatic.net/k5L8n.png\"/></a></p>\n<p><a href=\"https://i.sstatic.net/OiDsN.png\" rel=\"noreferrer\"><img alt=\"Thread ID\" src=\"https://i.sstatic.net/OiDsN.png\"/></a></p>\n<p>And in x64dbg I have the thread open:</p>\n<p><a href=\"https://i.sstatic.net/DZN8w.png\" rel=\"noreferrer\"><img alt=\"x64dbg open on the same thread\" src=\"https://i.sstatic.net/DZN8w.png\"/></a></p>\n<p>But I just can't figure out how can I find the Window Proc in x64dbg?</p>\n</div>",
    "votes": "7",
    "answers": 1,
    "views": "4k",
    "tags": [
        "windows"
    ],
    "user": "Ciantic",
    "time": "Oct 31, 2015 at 18:50",
    "comments": [
        {
            "user": "T.Todua",
            "text": "<span class=\"comment-copy\">have you been able to find the answer for `x64dgb?</span>",
            "time": null
        },
        {
            "user": "Ciantic",
            "text": "<span class=\"comment-copy\">@T.Todua yes, I have also written a AHK script that gets the WndProc address (see <a href=\"https://github.com/Ciantic/DisableFlashingTaskbarButtons/blob/master/DisableFlashingTaskbarButtons.ahk\" rel=\"nofollow noreferrer\">my script here</a> it also does other things, but one part is WndProc). The correct solution below does work somewhat correctly.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The spy++ is showing the wndproc in your screen shot (it is probably subclassed; you may need to trace but wndproc is shown in your screenshot as <code>361c9880</code>  I don't know what the command is in x64 dbg but if you were on ollydbg you simply do ctrl+g (goto) key in the address as shown in spy++ and break and log the messages for filtering.</p>\n<p>A screen shot of calc.exe -&gt; backspace button windows wndproc in comctl32.dll  (32 bits and 64 bits shouldn't matter much on concept level)</p>\n<p><a href=\"https://i.sstatic.net/Q2tMg.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/Q2tMg.png\"/></a></p>\n<p><a href=\"https://devblogs.microsoft.com/oldnewthing/20031201-00/?p=41673\" rel=\"nofollow noreferrer\">An entry by Raymond Chen</a> talks about cookies being returned instead of wndproc.</p>\n<p>If all else fails assemble GetWindowLongPtrW in place to fetch the actual WndProc</p>\n<ul>\n<li>suspend the process (f12 or esc)</li>\n<li>use ctrl+g to goto user32.GetWindowLongPtrW</li>\n<li>right click set new origin here   (save the rip prior this)</li>\n<li>save the state of register somewhere</li>\n<li>modify rcx and plop the handle into rcx (which was b01c8 in your screen shot)</li>\n<li>use the latest window handle as shown by spy++</li>\n<li>for the existing session do not put 0xb01c8</li>\n<li>modify edx to hold -4 (index of GWLP_WNDPROC)</li>\n<li>step through the Function</li>\n<li>before the function returns rax should hold the actual WndProc</li>\n<li>save or set a bp on the Wndproc</li>\n<li>restore registers and rip to pristine state and continue exploring</li>\n</ul>\n<p>I downloaded x64dbg and ran 64 bit calc.exe spy++ 32 bit doesn't show wndproc. I cooked a script to alloc a page in process memory of calc.exe and assembled a detour using the script language and fetched the actual WndProc.</p>\n<p>A screenshot below:</p>\n<p><a href=\"https://i.sstatic.net/7Jy6A.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/7Jy6A.png\"/></a></p>\n<p>The debuggee must be in a paused state.</p>\n<p>The script allocates memory in the debuggee's address space using alloc; after tabbing once the status bar should show the newly allocated address.\nAlso the variables $lastalloc $result should hold the newly allocated memory address; if you do <code>d address</code> a bunch of 00 00 should stare at you.</p>\n<ul>\n<li>confirm the allocation</li>\n<li>if the memory is allocated tab one step in the script</li>\n<li>push rcx should be assembled in the newly allocated address</li>\n<li>use d address or d $lastalloc to confirm</li>\n<li>like wise assemble all the instruction</li>\n<li>use the proper handle value in ecx (stale or reused window handles may provide incorrect information confirm you assemble mov rcx , HWND right</li>\n<li>now you need to ensure you put the right address in eax  the address should be of user32.GetWindowLongPtrW</li>\n<li>assemble all the cleanup instructions</li>\n<li>one you have done this</li>\n<li>save the existing rip some where (write it down in a paper)</li>\n<li>right click and select the first instruction in the newly allocated address and set it as origin ( new origin here) the rip will be changed to the newly allocated address</li>\n<li>hit f8 and execute the instructions on by one</li>\n<li>when call eax is done eax will hold the Wndproc</li>\n<li>save this (write it in paper)</li>\n<li>execute the cleanup instruction</li>\n<li>hit ctrl+g and enter the old RIP</li>\n<li>right click -&gt; new origin here ( RIP will now point to the old value when you paused the debuggee</li>\n</ul>\n<p>That is it; now you have Wndproc in a paper and you have returned to the original state.</p>\n<p>This  is a detour (making an intentional bypass in the code flow of debuggee to do some extra work and return back to the place where bypass was done as if nothing was done to continue the original flow).</p>\n<p>Use bp to set a breakpoint in the wndproc you have on paper.</p>\n</div>",
            "votes": "6",
            "user": "Glorfindel",
            "time": "Jul 31, 2022 at 4:59",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Ciantic",
                    "text": "<span class=\"comment-copy\">Awesome! Thanks again. Got it working with the script now I get solid result even if I change instances which I think must mean it worked: 00007FF6361C9880. Before this I must have run the 'raw' GetWindowLogPtrW incorrectly all the time. Deleting the messages again.</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">i added details about how to use the script as a detour</span>",
                    "time": null
                },
                {
                    "user": "Ciantic",
                    "text": "<span class=\"comment-copy\">it's in the explorer.exe. And! I've first time prevented FlashWindow from doing it's evil thing in the Task Switcher! I just zeroed the message C02B each time it got there and boom! Now I'm investigating how to make  a memory patch I can run on my computer so I can live patch my explorer.exe</span>",
                    "time": null
                },
                {
                    "user": "Ciantic",
                    "text": "<span class=\"comment-copy\">FYI, I'm chronicling the creation of in-memory patch here: <a href=\"http://ciantic.blogspot.fi/2015/10/in-memory-patching-explorerexe-to.html\" rel=\"nofollow noreferrer\">ciantic.blogspot.fi/2015/10/…</a></span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">nice entry yes you can dump the script and assemble anywhere in the module itself  if you don't need reuse</span>",
                    "time": null
                }
            ]
        }
    ]
}