{
    "title": "Chip obscuring epoxy removal for chip identification?",
    "link": "https://reverseengineering.stackexchange.com/questions/11324/chip-obscuring-epoxy-removal-for-chip-identification",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a chip on a DJI Phantom 3 Advanced controller/remote. It is the RF communications chip, which I believe to be some sort of Analog Devices wireless networking chip, but I'm not sure exactly which one.</p>\n<p>My goal is to identify it in order to interoperate with it from novel hardware. DJI however has obscured the chip (all major chips, actually) on this board with an epoxy goo covering on each.</p>\n<p>I practiced on a couple other chips on the board with limited success. The main CPU (an Altera ARM core) epoxy came off ok with careful in-plane scraping with an xacto knife, but the RF chip is surrounded by a the sides of the RF isolation cage and it isn't easy to scrape that way.</p>\n<p>Per some other recommendations, I tried grinding with a wooden toothpick in a Dremel tool on another chip, but so far that hasn't been effective in revealing the chip ID there, and I don't want to try it on the important chip yet in case I make it illegible.</p>\n<p>What techniques are good for removing an unknown epoxy from an obscured chip?</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "346",
    "tags": [
        "hardware"
    ],
    "user": "XenonofArcticus",
    "time": "Nov 13, 2015 at 17:25",
    "comments": [
        {
            "user": "user14172",
            "text": "<span class=\"comment-copy\">Did you try with an emery board made of glass? PS.: I'm not registered, else I'd have posted this as a comment.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In my experience a heat gun works really well on most epoxies making them soft or brittle and easy to remove where the epoxy used to be rock solid when trying to scrape it away with a knife or similar. Out of the ~10 different ones I've seen there's only 1 that actually became stronger/harder by heating. Unfortunately I don't know what it is or how to remove it, but that one has a whitish color and turns pink when heated. </p>\n<p>Note that there are allot of white color epoxies. Some turn brown, black or dark purple and still come of fine. It's best to just try in a corner and see the effect.</p>\n<p>I also wouldn't worry too much about damaging the chip because on a rework station most chips require &gt; 180 degrees C before you can take the chips off the PCB. </p>\n<p>-update-</p>\n<p>The above might spark the idea to freeze an epoxy using freeze-spray or similar. In my experience this never helped so I wouldn't bet on it.</p>\n</div>",
            "votes": "1",
            "user": "ixje",
            "time": "Nov 19, 2015 at 6:04",
            "is_accepted": false,
            "comments": []
        }
    ]
}