{
    "title": "Adding Features to a Released PC Game",
    "link": "https://reverseengineering.stackexchange.com/questions/11371/adding-features-to-a-released-pc-game",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've just recently finished a C++ class at my university, and I'm curious about game-modding/reverse engineering. My ultimate goal is to add features that were missing from the latest version of a video game that were present in the previous version.</p>\n<p>The latest installment is on PC while the previous installment is on PS2. I already have the discs and am able to view the files from both games.</p>\n<p><strong>* Is reverse-engineering the way to go? Is code-injection the better route? How would I go about doing this? *</strong></p>\n<p>I'm new to programming, so I'm aware that this project won't be accomplished overnight. This project is my ultimate goal and I'm interested in learning a lot of coding techniques along the way.</p>\n<p>TL:DR - I want to add a color-edit mode and the option to listen to a 2nd set of music when playing a PC game (that was present in the PS2 version). What's the best way to approach this?</p>\n<p><strong><em>EDIT: The game I'm referring to is fighting game called \"The King of Fighters 98: Ultimate Match\" on PS2, and \"The King of Fighters 98: Ultimate Match: Final Edition\" on Windows (Steam). The games are made by SNK Playmore.</em></strong> </p>\n<p>Because the Japanese company was going bankrupt, they ported over the crappy Xbox Live Arcade version of the game to Steam without the extras form the PS2. I would like to add said extras to the Windows version.</p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "365",
    "tags": [
        "windows",
        "c++",
        "unpacking",
        "injection"
    ],
    "user": "Swamp",
    "time": "Nov 22, 2015 at 1:09",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Yes, you need to look into reverse engineering discipline.</p>\n<p>There's a lot of books written on this topic, for example:</p>\n<p><a href=\"http://rads.stackoverflow.com/amzn/click/0764574817\" rel=\"nofollow\">Book 1</a>\n<a href=\"http://rads.stackoverflow.com/amzn/click/1593272898\" rel=\"nofollow\">Book 2</a>\n<a href=\"http://rads.stackoverflow.com/amzn/click/1593271441\" rel=\"nofollow\">Book 3</a></p>\n<p>By reading those books, you'll get acknowledged with need tools and instruments, also as reversing techniques.</p>\n<p>If you'll have any more questions after reading those books, please come back and ask.</p>\n</div>",
            "votes": "2",
            "user": "PaulD",
            "time": "Nov 25, 2015 at 16:55",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm not a lawyer, but <strong><em>dont</em></strong> try to RE any sony products, especially playstations, unless you want to end up being litigated like Geohot:</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Sony_Computer_Entertainment_America,_Inc._v._Hotz\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Sony_Computer_Entertainment_America,_Inc._v._Hotz</a></p>\n<p>No one will answer here with how to actually RE it because <strong><em>it will result in massive court costs, lost work time, etc.</em></strong></p>\n<p>Spoke ot the legal department at my company. If this question regarded reverse engineering a crackme or anything of the sort its legal. However, due to the game being Intellectual Property (IP) of a company (Leyou Millenium as of 9AUG2015), we  at stack exchange can't <em>legally</em> point you in the right direction.</p>\n<p>If you want to try cracking non-IP and unlicensed software, e.g. executables on crackmes.de, go ahead but legally in the US we could be prosecuted for giving a specific answer regarding the IP in question.</p>\n</div>",
            "votes": "0",
            "user": "grepNstepN",
            "time": "Nov 24, 2015 at 17:39",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Swamp",
                    "text": "<span class=\"comment-copy\">Thanks for the information! I've added the game name and company information in the original post.</span>",
                    "time": null
                },
                {
                    "user": "rev",
                    "text": "<span class=\"comment-copy\">This is a bit overkill. If he just wants to mod the game for himself, no matter how illegal it is, as long as it stays private for him, nobody will care, not even Sony. Also, geohot exploited PS3's supervisor (which then allowed the PS3 to get dumped and jailbroken); reversing a PC game is not even remotely close to that (and such an old game will probably even get ignored by Sony at all), so OP shouldn't worry <i>that</i> much.</span>",
                    "time": null
                },
                {
                    "user": "grepNstepN",
                    "text": "<span class=\"comment-copy\">keyword being <i>that much</i>. all I told OP was to assess his level of risk and act accordingly. Due to the fact that there's a triple digit viewcount on his question yet myself and someone else are the only ones giving answers, then there's a majority of people that tacitly agree with my risk assessment. I'd like to believe the majority of those on RE.stackexchange have RE experience, especially within the realms of crackmes. For any skill its best to start small and then tackle serious challenges, which is why there are crackmes to begin with: a way to get RE skills without breaking laws.</span>",
                    "time": null
                },
                {
                    "user": "grepNstepN",
                    "text": "<span class=\"comment-copy\">Also @AcidShout, someone got arrested years ago for accessing publicly available information at a faster-than-usual rate on (JSTOR) and committed suicide. Someone different got arrested for sharing a link in a chat room. Someone completely different is hiding out in Libya right now afraid of drone strikes (that someone IMHO is evil but thats off topic) because he accessed a publicly accessible server and leverage an off-by-1 error. The wise <i>always</i> err on the side of caution. Never underestimate the CFAA and a legal department. It is overkill but thats the irrational world we live in</span>",
                    "time": null
                }
            ]
        }
    ]
}