{
    "title": "How does disassembler really work?",
    "link": "https://reverseengineering.stackexchange.com/questions/11466/how-does-disassembler-really-work",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>a simple portable executable file looks like :</p>\n<p><a href=\"https://i.sstatic.net/Jj8Bn.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/Jj8Bn.png\"/></a></p>\n<p>I'm wondering how a disassembler works to parse the .text...to produce assembly code ?</p>\n<p>Because the PE file in his raw format seems to be unusable and does not contain machine instructions in readable format. </p>\n<p>I was thinking about either a tier program is used, or the program is loaded into memory and a dump is performed by the disassembler.</p>\n<p>Thanks !</p>\n</div>",
    "votes": "4",
    "answers": 3,
    "views": "4k",
    "tags": [
        "assembly",
        "executable",
        "disassemblers"
    ],
    "user": "Duke Nukem",
    "time": "Dec 6, 2015 at 11:27",
    "comments": [
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">The instructions do not immediately follow that text <code>.text</code>. You are looking at a table of contents; the binary numbers after the name indicate the offset and length where, in the total file, the actual code can be found.</span>",
            "time": null
        },
        {
            "user": "Vitaly Osipov",
            "text": "<span class=\"comment-copy\">Google \"PE format\". That's what loaders in IDA Pro are partially for. <a href=\"https://msdn.microsoft.com/en-us/library/ms809762.aspx\" rel=\"nofollow noreferrer\">msdn.microsoft.com/en-us/library/ms809762.aspx</a></span>",
            "time": null
        },
        {
            "user": "ratchet freak",
            "text": "<span class=\"comment-copy\">It probably has a byte pattern to match against a function preamble and starts from there. Not to mention the start address is explicitly stated in the file somewhere</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You have basically two options:</p>\n<p><strong>Linear Sweep</strong></p>\n<p>Read the first N-bytes until you get a correct opcode (e.g., 05 14 00 00 00 decompiles to add eax,0x14). Disassemble the next opcode. You will read some data sections and get invalid opcodes. You may skip the process or mark these \"instructions\" as bad and proceed until you get the next valid opcode and resume as described.</p>\n<p><strong>Recursive Traversal</strong></p>\n<p>Read the first N-bytes until you get a correct opcode. Proceed until you disassemble any sort of jump, store your current position, follow the jump and proceed as described. Stop disassembly when you get an invalid opcode and resume at the previously stored position.</p>\n<p>Both approaches require some basic information like</p>\n<ul>\n<li>Where does your program code start?</li>\n<li>What architecture is the code for?</li>\n</ul>\n<p>Some of these information are part of the header (e.g., in PE- oder ELF-Files).</p>\n<p>The Linux Interactive DisAssembler (LIDA) has a short introduction how the program disassembles the code and how objdump does its work. This is a good starting point to get familiar with the topic.</p>\n</div>",
            "votes": "4",
            "user": "user3422070",
            "time": "Dec 9, 2015 at 18:14",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are a number of ways to disassemble a file. And note that .text is only a name for the segment, you can call it .flups for all the OS cares.</p>\n<p>The things that are interesting is that:</p>\n<ul>\n<li>The OEP is within that section</li>\n<li>The section has Read and Execute rights.</li>\n</ul>\n<p>A disassembler can just jump to EOP and start reading bytes (opcodes) (<a href=\"http://ref.x86asm.net/\" rel=\"nofollow\">http://ref.x86asm.net/</a>). It can just start reading from the top down or it can also enumerate the results, eg follow calls/jmps in order to find weird code.</p>\n<p>Also, in the DosHeader there is a reference to where the PE here starts. This one has the OEP for you.</p>\n<p>Reading the radare source code can help you really understanding disassemblers.</p>\n</div>",
            "votes": "1",
            "user": "Stolas",
            "time": "Dec 8, 2015 at 14:07",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There's indeed a bunch of processing happens between having a raw PE, ELF, etc. file, to be able to disassemble it and show in a nice UI: loading and parsing a file, processing executable sections, converting offsets to virtual addresses, mnemonic disassembly itself, annotation of parts of disassembled instructions to allow e.g. to crossreference different parts of code/data and easily navigate among them, etc.</p>\n<p>There're number of open-source disassemblers whose code you can study to get more insight into inner workings (or to improve for your needs!). For example, <a href=\"https://github.com/pfalcon/ScratchABit\" rel=\"nofollow noreferrer\">ScratchABit</a> is written in Python, is very easy to study and hack on.</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/hIr9o.png\"/></p>\n</div>",
            "votes": "1",
            "user": "pfalcon",
            "time": "Dec 26, 2017 at 11:26",
            "is_accepted": false,
            "comments": []
        }
    ]
}