{
    "title": "Decompiling/Unpacking a Compiled/Packed File (Or Somehow Inserting a Flag)",
    "link": "https://reverseengineering.stackexchange.com/questions/11483/decompiling-unpacking-a-compiled-packed-file-or-somehow-inserting-a-flag",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm using a program that can pack/compile a folder with files into a single <strong>*.xyz</strong> file that only that program can decompile and read. In order for the program to create a compiled file the flag:</p>\n<pre><code>[Compile]\nDecompile=1\n</code></pre>\n<p>must be in the file <strong>Meta.ini</strong>. If not, the file cannot be unpacked/decompiled and there is no way to get back the source files.</p>\n<p>I have created a compiled file and have lost the source files. I forgot to add the decompile flag, so I currently have no way to unpack the file and continue my work. I can still compile and decompile files using the program as long as I include the flag. The file produced is in the FoxPro FPT format. The program is written in Visual Basic.</p>\n<p><strong>To Summarise:</strong></p>\n<ul>\n<li>I have a compiled/packed file that I need to decompile/unpack.</li>\n<li>I have access to the program that can compile and decompile the file.</li>\n<li>I don't have the required decompile flag in the file.</li>\n<li>The file produced is in the FoxPro FPT format.</li>\n<li>The program is written in Visual Basic.</li>\n</ul>\n<p>I know where the flag needs to go but I have no way of inserting it without first decompiling/unpacking the file (that I know of). When I open the file with Notepad++ it's mostly gibberish (makes sense as the file contains alot of images and geometry data) but the contents of <strong>Meta.ini</strong> are in plaintext. However, trying to add the flag or replace one of the other flags with it gives <strong>Incorrect String</strong> errors when the program tries to load the file.</p>\n<p><strong>My options are:</strong> </p>\n<ul>\n<li>Insert the flag into the file so the \"Compile\" option becomes available within the program</li>\n<li>Isolate the compiler (maybe it's all in one dll hidden within the program) and skip the program's check for the flag entirely.</li>\n<li>Find the flag check that returns false using a memory editor and changing it to true (suggested by @DarthGizka <a href=\"https://stackoverflow.com/questions/34155076/decompiling-unpacking-a-file-reverse-engineering-the-compiler\">here</a>). </li>\n</ul>\n<p>How should I go about this?</p>\n<p>Thanks</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "3k",
    "tags": [
        "decompile",
        "visual-basic"
    ],
    "user": "Alex Bridges",
    "time": "May 23, 2017 at 12:37",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\"><i>\"I'm using a program that can pack/compile a folder with...\"</i> - What's the name and version number of the program?</span>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">As Jason said. Stating the name of the program greatly improves the possibility of someone knowing about it. However, what you want <i>might</i> just not be feasible. For example, the flag might just be read when you create the file, and if it's set, both source code and compiled version go into the package; if it's clear, the source code is omitted. No amount of patching the finished package will give you the original source back.</span>",
            "time": null
        },
        {
            "user": "Alex Bridges",
            "text": "<span class=\"comment-copy\">@JasonGeffner the program is <a href=\"https://sharmods.donutteam.com/tools/\" rel=\"nofollow noreferrer\">Lucas' Simpsons Hit &amp; Run Mod Launcher Version 1.12.1</a></span>",
            "time": null
        },
        {
            "user": "Alex Bridges",
            "text": "<span class=\"comment-copy\">@JasonGeffner <a href=\"https://mega.nz/#!yZwhURLC!9EMX9anarFonWW2x3zGK4BrVXG4m9WU3Su2YWbPR7IU\" rel=\"nofollow noreferrer\">here is another of my files that has the decompile flag</a>. To load it into the launcher click <b>Open...</b> then <b>Mods</b> and paste the folder there, then click <b>Reload</b>. To decompile the mod right click on it (Audi R8) and click <b>Decompile</b>. The compile process is practically identical. Thanks</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I had a look at the program you mentioned and the compilation means only packaging, so decompilation is always possible. The format of the file seems to be very simple, so if you want you can reverse it easily. However you can insert the decompilation flag into the meta.ini with a hex editor for example in the following way:</p>\n<ul>\n<li>Open the file in your preferred hex editor.</li>\n<li>Locate an <code>[Author]</code> section and modify it by <strong>overwriting</strong> the file content with <code>[Compile]\\x0aDecompilable=1\\x0a</code> (\\x0a means a new line character).</li>\n<li>Fill up the remaining string with spaces until the next section start.</li>\n</ul>\n<p>After these modification you should have a similar entry such in the following picture:<p>\n<a href=\"https://i.sstatic.net/OpWBg.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/OpWBg.png\"/></a></p>\n</p></div>",
            "votes": "1",
            "user": "ebux",
            "time": "Jan 22, 2016 at 14:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Alex Bridges",
                    "text": "<span class=\"comment-copy\">Thanks for taking a look :) Inserting it didn't work initially but I'll do some fiddling and see what happens.</span>",
                    "time": null
                }
            ]
        }
    ]
}