{
    "title": "Unpacking and the ESP trick",
    "link": "https://reverseengineering.stackexchange.com/questions/11490/unpacking-and-the-esp-trick",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I recently heard about the esp trick: some packers push all registers on the stack, and when unpacking is done, they are restored. Placing a hardware breakpoint on esp we can stop there and get the original entry point.</p>\n<p>Why is it necessary to use a hardware breakpoint? <a href=\"http://yangseo.tistory.com/52\" rel=\"nofollow\">This site</a> argues that because software breakpoints modify the code. But why is that a problem here?</p>\n<p>Every example I met uses Ollydbg. How can I set such a breakpoint in gdb?</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "855",
    "tags": [
        "gdb",
        "unpacking"
    ],
    "user": "robert",
    "time": "Dec 9, 2015 at 15:49",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<blockquote>\n<p>Placing a hardware breakpoint on esp we can stop there and get the\n  original entry point.</p>\n<p>Why is it necessary to use a hardware breakpoint?</p>\n</blockquote>\n<p>The value of <code>ESP</code> is an address on the stack. The data at that memory address may get read or written, but won't get executed¹ since it's not code. Software breakpoints are only useful on code that gets executed, and since the data at that memory address won't get executed, a software breakpoint won't be helpful.</p>\n<p><em>¹ There are exceptions to this, but it's out of context for your question.</em></p>\n<blockquote>\n<p>How can I set such a breakpoint in gdb?</p>\n</blockquote>\n<p>In gdb, you can set a hardware breakpoint on the memory address pointed to by <code>ESP</code> by setting a <strong>watchpoint</strong>, which is documented <a href=\"https://sourceware.org/gdb/onlinedocs/gdb/Set-Watchpoints.html\" rel=\"noreferrer\">here</a>.</p>\n</div>",
            "votes": "5",
            "user": "Jason Geffner",
            "time": "Dec 9, 2015 at 16:33",
            "is_accepted": true,
            "comments": []
        }
    ]
}