{
    "title": "Given the files and their parsed content how can I reverse engineer the file format? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/11612/given-the-files-and-their-parsed-content-how-can-i-reverse-engineer-the-file-for",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<div>\n<aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n<div class=\"d-flex fd-column fw-nowrap\">\n<div class=\"d-flex fw-nowrap\">\n<div class=\"flex--item wmn0 fl1 lh-lg\">\n<div class=\"flex--item fl1 lh-lg\">\n<div>\n<b>Closed</b>. This question needs to be more <a href=\"/help/closed-questions\">focused</a>. It is not currently accepting answers.\n                                \n                            </div>\n</div>\n</div>\n</div>\n</div>\n<hr class=\"my12 outline-none baw0 bb bc-blue-400\"/>\n<div class=\"fw-nowrap fc-black-500\">\n<div class=\"d-flex fd-column lh-md\">\n<div class=\"mb0 d-flex\">\n<div class=\"flex--item mr8\">\n<svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\"><path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\"></path></svg>\n</div>\n<p><b>Want to improve this question?</b> Update the question so it focuses on one problem only by <a href=\"/posts/11612/edit\">editing this post</a>.</p>\n</div>\n<div class=\"mb0 mt6 d-flex\">\n<p class=\"ml24 pl2\">Closed <span class=\"relativetime\" title=\"2015-12-22 17:32:10Z\">9 years ago</span>.</p>\n</div>\n<div class=\"ml24 pl2\">\n</div>\n</div>\n</div>\n<div class=\"mt24 d-flex gsx gs8\">\n<a class=\"s-btn s-btn__outlined flex--item js-post-notice-edit-post\" href=\"/posts/11612/edit\">\n                        Improve this question\n                    </a>\n</div>\n</aside>\n</div>\n<p>I have access to a few thousand binary files and I don't have the program that generated them. The files have been parsed and I also have access to the database where the parsed fields are stored. How can I reverse engineer the format of the files, given this information?</p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "280",
    "tags": [
        "file-format"
    ],
    "user": "ramana_k",
    "time": "9 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Short answer: You can't.</p>\n<p>The files may be encrypted. If the encryption is strong, the implementors didn't make any stupid mistakes, and the key is hidden in the original binary, then there's no way to match your files to the readable content.</p>\n<p>Longer answer: It might not be that bad.</p>\n<p>First, try to find out some general information about the files. </p>\n<ul>\n<li><p>Do they all have the same size, or are the sizes different? If the sizes are different, might that be explained by the file contents, or would you expect all sizes to be equal? </p></li>\n<li><p>Is it possible the files are compressed? Try making a .zip of them. If zip is unable to compress them, they probably already are; in this case, try to find out which algorithm has been used on them. <a href=\"http://binwalk.org/\" rel=\"nofollow noreferrer\">Binwalk</a>  might be helpful for that (the web site says firmware analysis, but it will recognize many compressed file formats just fine). If they are compressed, and you can't find out the algorithm/decompress them, you're stuck.</p></li>\n<li><p>Open some of the files in a hex editor, and/or run the strings utility over them. Do the files have parts that look readable?</p></li>\n<li><p>Try matching file names, or file contents you identified, to database rows. Knowing what is in a file helps a lot in identifying specific content.</p></li>\n<li><p>If all of the files have the same size, or almost the same size, try finding out which parts are equal between them and which are different. I did something similar on different blocks of the same file in my answer <a href=\"https://reverseengineering.stackexchange.com/questions/11126/how-to-identify-the-structure-of-this-specific-data-file/11128#11128\">here</a>, this might get you started.</p></li>\n<li><p>If there are some numbers that you think should be in a file, convert them to integer/long/float/double representation, and search for these bytes in a hex editor. Repeat with a few different files. With a bit of luck, you'll find the same information at the same file offset, or in a part of the file that's identifyable, in a few cases.</p></li>\n<li><p>If you can (copyright issues etc.) tell us the name of the software, and upload some example files together with their decoded content. A forum member might know the software, or recognize the file format. And some of use just like this kind of challenge as well.</p></li>\n</ul>\n</div>",
            "votes": "3",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ramana_k",
                    "text": "<span class=\"comment-copy\">Thanks a lot for the detailed guidelines. I find them very valuable and I am sure others will as well. Unfortunately, I am not allowed to post the file contents.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First of all, the question is too broad. Examples would help a lot. </p>\n<p>Here is an algorithm I'd start with without specific knowledge about files.</p>\n<ol>\n<li>First of all I'd try to answer to the question is it standard format. Using linux <a href=\"https://en.wikipedia.org/wiki/File_(command)\" rel=\"nofollow\">file</a> utility on the files may help. If this file appears to be standard I'd try to find documentation on the format and/or to reverse engineer a tool that works with it.</li>\n<li>If the format is not standard I'd try to check the structure of the file. Does all the binaries have similar header ? If yes, where are they differ ? Is it related to file size, number if entities in it, creation date, modification date, etc ?</li>\n<li>After that I'd start to dissect this files to elementary types. Searching for strings related to the data may help to understand a lot. Searching for known values (rarely occurring integer constants for example) may help to connect between these constants and their locations in the file.</li>\n<li>After that I'd try to find almost similar files. Where are the differences ? How this differences related to the data ? If you have a file with a small amount of known differences, you can make binary diff and see where exactly these differences stored.</li>\n</ol>\n<p>After performing all these actions you'll probably enough information to ask more specific questions.</p>\n<p>Good luck.</p>\n</div>",
            "votes": "1",
            "user": "w s",
            "time": "Dec 22, 2015 at 9:33",
            "is_accepted": false,
            "comments": []
        }
    ]
}