{
    "title": "iOS Detect Function Hooking",
    "link": "https://reverseengineering.stackexchange.com/questions/11656/ios-detect-function-hooking",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I would like to find out if there's a way to detect if a C function is hooked in iOS? So for example let's say I hook SSLHandshake,</p>\n<pre><code>OSStatus (*orig_SSLHandshake) (SSLContextRef context);\n\nOSStatus replaced_SSLHandshake (SSLContextRef context)\n{\n    OSStatus result = orig_SSLHandshake(context);\n    if (result == errSSLServerAuthCompleted)\n    {\n        return orig_SSLHandshake(context);\n    }\n    else\n        return result;\n    }\n}\n</code></pre>\n<p>Is there anyway to detect if this function has been hooked?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ios",
        "function-hooking"
    ],
    "user": "d123",
    "time": "Dec 30, 2015 at 17:52",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<h3>Basic way to do it</h3>\n<p>The concept is simple (but implementing it to protect your app from a hacker is a hassle). <strong>Function implementations are stored in memory and hence have a memory address</strong>. That's why you can use a function pointer in your example.</p>\n<p><br/>In order to see if a function has been hooked, you would just :</p>\n<ol>\n<li>Save the address of the original function implementation (get the address of the function pointer using <code>&amp;orig_SSLHandshake</code>). The implementation are all loaded in memory when the app calls the first <code>ApplicationDelegate</code> method.</li>\n<li>Each time you need it, compare the address of the current implementation with the original address you stored.</li>\n</ol>\n<p>If you do not care about being hooked from the outside, then this solution may satisfy you.</p>\n<h3>Protecting your app against hooking done by an attacker</h3>\n<p>Here I assume you want to protect your app against a function hook done by a hacker (and not hook the function yourself).</p>\n<p>One of the easiest ways to hook functions in iOS is using MobileSubstrate. It can hook function implementations early in the application launching process (already hooked when in <code>application:didFinishLaunching...</code>), so that when you would try to get the address of your original function (<code>&amp; originalFunction</code>) you would in fact get the address of the hooked function. You would never be able to get the address of the original one.</p>\n<p>Because function hooking can happen very early in the application launching process, you would have to use some tricks.</p>\n<p>Basically, you would verify that the implementation you want to store as the <em>original</em> function is really the original one. <br/> You could decide to have some global variables (despite it is not a good programming style) and make your original function perform some operations on them and output an expected value.<br/>\nThen if an attacker has already hooked your function, you would know it (after having called your function) because it would not produce the expected output on the global variable. <em>You may add an extra parameter to your function for these checks</em>.</p>\n<p>However, it is important to note that a hacker have access to both your original function implementation and the arguments you pass when trying to call that function.<br/>\nHence, although the previous solution makes the verification secure in cases where the attacker does not call your original function (with the expected arguments), it does not help if he calls your function before or after having done his own modifications.</p>\n<pre><code>void hookedImplementation (type1 arg1, type2 arg2){\n    // ... the hacker does stuffs\n    \n    // he calls your original function with the arguments you passed.\n    originalFunction(arg1,arg2);\n    \n    // .. other hooking\n}\n</code></pre>\n<p>In regards of all this, my only reply is that you cannot be 100% sure that your original function has not been hooked by an attacker. However, you may discourage most hackers, and maybe <em>that</em> is sufficient for your case. <br/>\n<em>Just be councious about that if you work in the IT department of a worldwide bank institute (since it would then matter).</em></p>\n</div>",
            "votes": "1",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}