{
    "title": "Is there a way to import debug/symbol information of a C++ DOS executable to IDA?",
    "link": "https://reverseengineering.stackexchange.com/questions/11660/is-there-a-way-to-import-debug-symbol-information-of-a-c-dos-executable-to-ida",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have an old DOS program compiled using Borland C++ (1991 version)</p>\n<p>The end of the executable contains many strings preceded by an underscore which looks like debug/symbol information :</p>\n<p>eg:  <code>_HandleMemory</code>, <code>_AddKey</code>, <code>_SetPalette</code>, ...</p>\n<p>Most of these strings seems to be functions or variables names.</p>\n<p>However once the exe is opened in IDA, that information is not used, most functions are simply named this way (except some known C functions like <code>_qsort</code>) :</p>\n<pre><code>sub_XXXXX\n</code></pre>\n<p>Is there a way to import that info back to IDA ?</p>\n</div>",
    "votes": "4",
    "answers": 2,
    "views": "3k",
    "tags": [
        "ida",
        "debugging",
        "c++",
        "dos"
    ],
    "user": "tigrou",
    "time": "Dec 31, 2015 at 6:06",
    "comments": [
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">Are you sure it's not actually a list of DLL imported symbols?</span>",
            "time": null
        },
        {
            "user": "tigrou",
            "text": "<span class=\"comment-copy\">By DLL, do you mean an external library ? (since AFAIK, DLL are windows only). I don't think so because these strings are referenced in any other of the program files.</span>",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">DLL is a Windows term, but Microsoft did not invent importing libraries from scratch. I assume you mean \"<i>not</i> referenced\" elsewhere. But: Just a list of symbols is practically useless. Are there any references to it inside the same executable? Can you upload this file and provide a link to it, so others can check?</span>",
            "time": null
        },
        {
            "user": "tigrou",
            "text": "<span class=\"comment-copy\">Yes you are right, I mean \"not referenced\". The program in question is a game (Alone in the Dark 1). It is freely downloadable on many abandonware sites, but i am not sure if it's OK to put a link to the executable here ?</span>",
            "time": null
        },
        {
            "user": "DarthGizka",
            "text": "<span class=\"comment-copy\">The year 1991 pegs this as Turbo C++ 1.0 or thereabouts, and it is indeed very likely that the tail data in question is Borland-style debug info (16-bit TDS format). Experiments show that the available IDA freewares - 3.7 through 5.0 - do not recognise the 16-bit Borland debug info. If the debug info is stripped into a separate TDS file (via tdstrip.exe) then you get a rejection message in the output window for those versions that can deal with TDS in principle but expect the newer 32-bit format (as of BOA 4.0 and beyond). Same for the 'Load TDS' menu item, if present.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In case anyone has same question, here is how I solved it : </p>\n<p>1) I exported all debug symbol information to a text file, using TDUMP.</p>\n<pre><code>TDUMP somefile.exe &gt; 1.txt\n</code></pre>\n<p>2) I cleaned the txt file to keep only useful information : </p>\n<pre><code>[Function name] + [Address]\n</code></pre>\n<p>3) I imported the file back to IDA using a python script : <a href=\"https://reverseengineering.stackexchange.com/questions/11874/how-to-automatically-rename-some-ida-functions-from-a-given-list\">see here</a></p>\n</div>",
            "votes": "4",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've written an IDAPython script which parses the debug information and then performs the corresponding renamings, all from within IDA.</p>\n<p>The script, along with simple usage instructions, are available on <a href=\"https://github.com/ramikg/tdinfo-parser\" rel=\"nofollow noreferrer\">GitHub</a>.</p>\n</div>",
            "votes": "0",
            "user": "ramikg",
            "time": "Oct 22, 2020 at 19:23",
            "is_accepted": false,
            "comments": []
        }
    ]
}