{
    "title": "In Ollydbg, how do I change the path to a source code file without recreating entire directory structure?",
    "link": "https://reverseengineering.stackexchange.com/questions/11888/in-ollydbg-how-do-i-change-the-path-to-a-source-code-file-without-recreating-en",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am bring a .EXE, a .PDB, and a source code .C file into my computer and attempting to look at my program in Ollydbg.</p>\n<p>I am compiling C programs on one machine (XP Vm actually) and running them in Ollydbg 2.01 in Windows 7 on another machine.  I want to look at Release code, so I set the compile and link options as described in <a href=\"http://www.wintellect.com/devcenter/jrobbins/correctly-creating-native-c-release-build-pdbs\" rel=\"noreferrer\">link</a>.  And so I have a 'prog.exe' and 'prog.pdb' in Win7 where Ollydbg is.  I can launch prog.exe in Ollydbg and I see the labels for main() and my other functions, and can go to them with the <kbd>CTRL</kbd>+<kbd>G</kbd> \"Enter Expression to Follow\" dialog.</p>\n<p>But I like to also see the associated source code line, to be able to see it below the code in the CPU window, and to be able to double-click and open the source code .C file.</p>\n<p>But unless I recreate the entire same directory path in my Win7 (Olly) computer Olly can't get at this source code (even though it sees the label names for code blocks).  I've spent some time looking through the settings in both Visual Studio (6 for me) to try not have absolute paths, and Olly to change where it looks.  Any ideas?</p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ollydbg",
        "c",
        "pdb"
    ],
    "user": "Markbotix",
    "time": "Oct 26, 2016 at 21:52",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>pdb is self contained so you can drag and drop it and the debugger can utilize it<br/>\nbut src files are just path references<br/>\neither relative or absolute paths<br/>\nso either you have to copy them to a local directory<br/>\n(think about feasibility of this with a project that has thousands of src files) or<br/>\nset up the directory structure ( a bit easier if you did not compile in c:\\ :) )<br/>\ndiskmgmt.msc wont let you change the drive letter for system boot partition )</p>\n<p>if you were on a partition other than system boot partition<br/>\nsimply dump the directory from base to a removable drive and change the drive letter </p>\n<p>or learn a bit of windbg's environment variables _NT_SOURCE_PATH , _NT_SYMBOL_PATH ,  and let ollydbg use the symsrv.dll from windbg directory </p>\n<p>look at \noptions -&gt; debugging data -&gt; tab</p>\n</div>",
            "votes": "2",
            "user": "blabb",
            "time": "Jan 30, 2016 at 7:13",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Junction points and <code>ntsubst</code>-like tools can always help to cheat your way out of the described conundrum. Unless, of course, you had your source code in something like <code>C:\\Windows\\System32</code> ;)</span>",
                    "time": null
                },
                {
                    "user": "Mawg",
                    "text": "<span class=\"comment-copy\">I have read this answer several times and still don't understand. I have no .PDB, just .EXE and .C - how do I tell it where my .C file is, so that I can breakpoint &amp; step through the code? Thanks in advance</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">no linkage exists between exe and source without pdb file  so you cant tell ollydbg or for that matter any debugger  without having debug symbol information</span>",
                    "time": null
                }
            ]
        }
    ]
}