{
    "title": "Advice about first steps on reversing windows kernel",
    "link": "https://reverseengineering.stackexchange.com/questions/11914/advice-about-first-steps-on-reversing-windows-kernel",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'll appreciate if anyone can give me a couple advices regarding kernel debugging/reversing.</p>\n<p>For instance if i want to know how the heap manager works what should i look for ?</p>\n<p>I have no experience in reversing kernels.</p>\n</div>",
    "votes": "1",
    "answers": 5,
    "views": "3k",
    "tags": [
        "windows",
        "kernel-mode"
    ],
    "user": "JakeAdams",
    "time": "Feb 2, 2016 at 0:01",
    "comments": [
        {
            "user": "Vitaly Osipov",
            "text": "<span class=\"comment-copy\"><a href=\"https://msdn.microsoft.com/en-us/library/windows/hardware/dn553412(v=vs.85).aspx\" rel=\"nofollow noreferrer\">msdn.microsoft.com/en-us/library/windows/hardware/…</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First and most important advice I can give you is to <strong>not</strong> debug on your host machine, use a virtual machine such as hyper-v, VMWare and virtualbox instead. </p>\n<p>Second, your preferred tool is <a href=\"https://msdn.microsoft.com/en-us/windows/hardware/hh852365.aspx\" rel=\"nofollow\">WinDbg</a>. There are many tutorials for setting it up with virtual machines. You can start from <a href=\"https://msdn.microsoft.com/en-us/library/windows/hardware/ff538143(v=vs.85).aspx\" rel=\"nofollow\">MSDN</a>.</p>\n<p>If you want to learn more how \"heap management works\" fast and in great details, you should consider reading the book <a href=\"http://www.opening-windows.com/wmip/overview.htm\" rel=\"nofollow\">What Makes It Page</a> by Enrico Martignetti. </p>\n</div>",
            "votes": "3",
            "user": "GelosSnake",
            "time": "Feb 2, 2016 at 12:09",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Since this is tagged windows, getting that kind of information is fairly easy these days:</p>\n<ol>\n<li>Go read Windows Internals by Russinovich, et all. This is an excellent book (actually two books) on how everything works.</li>\n<li>Read the source code from <a href=\"http://source.winehq.org/WineAPI/ntdll.html\" rel=\"nofollow\">Wine</a> or <a href=\"http://doxygen.reactos.org/dir_133750c6c1d4a2ce5f64c38c0ac0b3cf.html\" rel=\"nofollow\">ReactOS</a> which have already reverse engineered most of the kernel. This is a great way to answer specific questions about individual APIs / code paths.</li>\n</ol>\n</div>",
            "votes": "2",
            "user": "josh poley",
            "time": "Feb 2, 2016 at 20:48",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<ol>\n<li>Set up a VM using virtual box or vmware.</li>\n<li>Configure the VM to boot with debugging enabled. <a href=\"https://msdn.microsoft.com/en-us/library/windows/hardware/ff542279(v=vs.85).aspx\" rel=\"nofollow\">Instructions here</a></li>\n<li>Set up a serial connection from the guest to the host machine.</li>\n<li>Run WinDBG on the host machine and connect over that serial interface.</li>\n<li>Debug.</li>\n</ol>\n<p>This whole process is illustrated very well in <a href=\"https://www.nostarch.com/malware\" rel=\"nofollow\">Practical Malware Analysis</a> a book I recommend to everyone looking to get into RE on windows.</p>\n</div>",
            "votes": "0",
            "user": "Gdogg",
            "time": "Feb 2, 2016 at 23:16",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The great thing about the Windows operating system is that though it is proprietary, the heart of it that really matters has been remarkably well documented over the years. MSDN is a great source. You can start by understanding windows driver model.</p>\n<p>The windows driver model is the core framework of api's from which windows is built on. Consisting of kernal and user mode drivers (additional frameworks wrap much of the boiler plate code into simpler api's). User mode drivers are simply dll's (dynamic link libraries) and kernal mode, dll's with a different file extension (.sys instead of .dll) and explicit linking with <code>GetProcAddress()</code> and <code>LoadLibrary()</code> do not work for kernal. Much of this is well documented though complex in their inner workings. There are some Windows supplied drivers which are proprietary. </p>\n<p>Beyond this there is a root driver called acpi.sys, supplied by microsoft. This is the root node from which all drivers and bus drivers are a child. </p>\n<p>Additionally there are the mechanisms in which windows routes messages from driver to driver called interrupt request packets or irp's. The memory in user mode applications are virtualized by the memory controller in such a way that memory can not be predictably utilized outside the context of the calling handle.</p>\n<p>Given all the constraints you may realize there isn't a single implementation that is unique to windows. Indeed the greatest attributes of windows has been compliance through carefully and skillfully planned guidance, and by virtue of this, tends to be well known or anything but proprietary.</p>\n</div>",
            "votes": "0",
            "user": "marshal craft",
            "time": "Feb 18, 2016 at 8:22",
            "is_accepted": false,
            "comments": [
                {
                    "user": "marshal craft",
                    "text": "<span class=\"comment-copy\">Also \"What Makes It Page?: The Windows 7 (X64) Virtual Memory Manager\" by Enrico Martignetti</span>",
                    "time": null
                },
                {
                    "user": "marshal craft",
                    "text": "<span class=\"comment-copy\">Practical Reverse Engineering: x86, x64, ARM, Windows Kernel, Reversing Tools, and Obfuscation 1st Edition by Bruce Dang  (Author), Alexandre Gazet  (Author), Elias Bachaalany  (Author), Sébastien Josse (Contributor)</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Note that if you're actually interested in the heap manager,\nit's part of the runtime and has nothing to do with kernel\nfunctionality, for instance: <code>HeapAlloc()</code> from <code>kernel32.dll</code>\nforwards to <code>RtlAllocateHeap()</code> from <code>ntdll.dll</code>, you can just open up\n<code>ntdll.dll</code> in your favorite framework and start reversing.</p>\n</div>",
            "votes": "0",
            "user": "MarianD",
            "time": "Apr 26, 2022 at 17:06",
            "is_accepted": false,
            "comments": []
        }
    ]
}