{
    "title": "Adding/Finding Places for Instructions - Game Library IDA",
    "link": "https://reverseengineering.stackexchange.com/questions/11950/adding-finding-places-for-instructions-game-library-ida",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is there any way to add instructions to a library in IDA? My predicament is that there is no room in a game library (.so ELF, android) to fit my own code. There is an empty bss segment but IDA doesn't like to write to it, and I believe the game needs it for it's variables. </p>\n<p>I've tried adding additional bytes to the end of the file with a hex editor, and then opening it with IDA, but IDA will not show it possibly because it's not in a segment.</p>\n<p>Can I make my own library / modify the existing one so that the code segment is larger? My own library would need to be imported by the other library in order to work, I believe, because it needs functions and such from the original library.</p>\n<p>Thanks.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "556",
    "tags": [
        "ida",
        "assembly",
        "android",
        "arm"
    ],
    "user": "Aspire",
    "time": "Feb 4, 2016 at 21:48",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>IDA not the most convenient tool for what you're trying to do. There are basically 3 ways to do it, and it seems you're already mentioning all of them in your question :</p>\n<ul>\n<li>Search for a code cave big enough to fit your payload</li>\n<li>Create a new section in your executable with a sufficient size for your payload</li>\n<li>Proxify your library and add functions or hook existing ones</li>\n</ul>\n<p>Now depending on what exactly you're trying to inject and how you're reaching it, each method has its specific pro/cons and will require a different approach. They should all be fairly well documented on the Internet.</p>\n<p>(Without more context/details about what you're trying to do, it's hard to tell you which one to pick though)</p>\n</div>",
            "votes": "3",
            "user": "user2823000",
            "time": "Feb 4, 2016 at 23:10",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Aspire",
                    "text": "<span class=\"comment-copy\">Thank you for your answer. I am trying to create a new section in my executable, but when I do, IDA will not patch the bytes that I put in the section. Is there any way around this? Thanks</span>",
                    "time": null
                },
                {
                    "user": "user2823000",
                    "text": "<span class=\"comment-copy\">The simplest way would be with either an hex editor or an ELF lib for your favorite language to add a section directly in the ELF header.</span>",
                    "time": null
                },
                {
                    "user": "Aspire",
                    "text": "<span class=\"comment-copy\">What hex editor would you recommend for this? HxD, I believe, does not support adding sections into the ELF header.</span>",
                    "time": null
                },
                {
                    "user": "user2823000",
                    "text": "<span class=\"comment-copy\">010 Editor with an ELF template? But the hex editor is the \"quick and dirty\" way, do it programatically with a lib would be more reliable.</span>",
                    "time": null
                }
            ]
        }
    ]
}