{
    "title": "What is the average time for \"defusing\" malware self-protection mechanisms?",
    "link": "https://reverseengineering.stackexchange.com/questions/11981/what-is-the-average-time-for-defusing-malware-self-protection-mechanisms",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I always wondered how much time is needed to get rid of all that anti-VM/crypto/protector/anti-debug stuff (without analyzing actual payload and purpose), especially if you're dealing with malware on a daily basis? I would definitely like to get answer from AV industry experts.</p>\n</div>",
    "votes": "2",
    "answers": 3,
    "views": "329",
    "tags": [
        "anti-debugging",
        "malware"
    ],
    "user": "assp1r1n3",
    "time": "Feb 9, 2016 at 22:47",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Based on a couple of years of performing and teaching (<a href=\"http://net.cs.uni-bonn.de/wg/cs/teaching-areas/labs-and-project-groups/malware-boot-camp/\" rel=\"nofollow\">Malware Bootcamp at University of Bonn, Germany</a>) reverse engineering with focus on malware analysis, I mostly try to skip any \"easy\" stepping stones (malware capability of detecting analysis environments, be it VM, debugger, ...) to get to an unpacked state of the malware and then focus analysis on this in IDA alongside debugging it.</p>\n<p>Preparation of your own tools, e.g. setting up a reasonably proportioned (cores, HDD space, RAM) and concealed (removal of VM fragments) VM as explained by CrazyFrog can automagically carry a lot of load in this domain. I think I rarely spend more than minutes (i.e. native runtime of packer) to get to that unpacked state.</p>\n<p>For understanding those protections and detections, otherwise +1 for <a href=\"http://anti-reversing.com/Downloads/Anti-Reversing/The_Ultimate_Anti-Reversing_Reference.pdf\" rel=\"nofollow\">Peter Ferrie's reference</a>. \nIf you want to step through those in a debugger, you can use my <a href=\"https://bitbucket.org/fkie_cd_dare/simplifire.antire\" rel=\"nofollow\">defanged open source implementation</a> of those.\nNewer detection approaches not covered by the above source frequently involve utilizing Windows Management Instrumentation (WMI). Often to achieve the same derivation of characteristics that can lead to the conclusion you are in an analysis environment.</p>\n<p>If there is protection in the sample itself, it's most often crypted strings or obfuscated API calls (Andromeda, Dridex, VM-Zeus come to mind), rarely execution-only decryption of code as seen in <a href=\"http://byte-atlas.blogspot.de/2015/08/knowledge-fragment-unwrapping-fobber.html\" rel=\"nofollow\">Fobber</a>. \nIn this case, it obviously becomes part of the analysis itself, or at least a pre-stage.</p>\n</div>",
            "votes": "3",
            "user": "pnX",
            "time": "Feb 11, 2016 at 11:46",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I work in AV industry for about a year now and I can tell you how I see this. How fast can you get rid of certain anti-reversing techniques depends on your experience and will to learn and understand as many of those techniques as possible. </p>\n<p>I mostly work with PE packers and at the beginning I had problems with removing the most simple techniques like <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms680345(v=vs.85).aspx\">IsDebuggerPresent()</a>. Hell, I even remember one time when I spent a whole day of work just figuring out the <a href=\"https://leons.im/posts/anti-debug-with-trap-flag-register/\">anti-debug with trap flag</a> and <em>checksum check</em> techniques. </p>\n<p>Today, when I have some experience under my belt, I move around these common anti-reversing techniques quite fast. You can achieve that with the help of plugins for your tools (like <a href=\"https://tuts4you.com/download.php?view.75\">Olly Advanced</a> for <a href=\"http://www.ollydbg.de/\">Ollydbg</a>). One of the greatest (if not the greatest) piece of resource about this topic is Peter Ferries book <a href=\"http://anti-reversing.com/Downloads/Anti-Reversing/The_Ultimate_Anti-Reversing_Reference.pdf\">The Ultimate Anti-Debugging Reference</a>. Whenever I got stuck with some new anti-reversing technique, I consulted with that book and at the end found the solution.</p>\n<p>So to sum things up, I am not an expert in the field and in the beginning it takes quite some time to get things done but it's like that in everything right? With enough practice and experience I'm sure you can avoid various anti-reversing techniques in a matter of minutes, but I would like if some of the more experienced users would back me up on this.</p>\n</div>",
            "votes": "5",
            "user": "ubnix",
            "time": "Feb 10, 2016 at 15:04",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>most (if not all) anti-VM, anti-debug tricks are well known and easy to bypass using already existing debuggger plugins e.g. ScyllaHide. Some AV company's have dedicated tools for this (emulator, sandbox, virtual machine with auto-dump and rebuild feature). If you do it manualy avg time depends on the sample obfuscation your experience and tools you have to do the job.</p>\n</div>",
            "votes": "2",
            "user": "krusty",
            "time": "Feb 11, 2016 at 10:58",
            "is_accepted": false,
            "comments": []
        }
    ]
}