{
    "title": "What is an easy way to update the addresses of hooked functions in an exe",
    "link": "https://reverseengineering.stackexchange.com/questions/12720/what-is-an-easy-way-to-update-the-addresses-of-hooked-functions-in-an-exe",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have hooked into some functions in an exe. I was wondering if there were any simple ways to detect the memory addresses of these functions after the exe has a new build (not my exe). Is the best way to just scan the exe for the bytes of the function and compare to the previous result? Can this be achieved fast enough to add it to my injection code? </p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "122",
    "tags": [
        "c++",
        "dll-injection",
        "function-hooking"
    ],
    "user": "pokerguy",
    "time": "May 23, 2016 at 3:12",
    "comments": [
        {
            "user": "tmr232",
            "text": "<span class=\"comment-copy\">Just to be clear - you are trying to automatically find the addresses of functions in a new exe, based on the addresses in the old one, right?</span>",
            "time": null
        },
        {
            "user": "pokerguy",
            "text": "<span class=\"comment-copy\">Yeah, I need the new address of the function.  I tried scanning memory and comparing bytes, but that didn't work out so well. Do you have any suggestions?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It really depends on the functions you're hooking. If they're not likely to be changed, then scanning for the bytes would be the naive solution. It should be relatively fast and work perfectly fine.</p>\n<p>If it's likely that the functions will have changed (patches, removal, different compiler/build env, etc) then you could try to find a bytestring 'signature' for those functions. Ideally that signature would be unique (only in that function), but also as small as possible (to reduce the likelihood that those bytes were patched in the new binary). This is going to be fairly hack-y.</p>\n<p>Just a note: if it was a DLL, you could walk the PE export table fairly trivially to find the new offsets.</p>\n<p>There's also Bindiff, which is now free: <a href=\"https://security.googleblog.com/2016/03/bindiff-now-available-for-free.html\" rel=\"nofollow\">https://security.googleblog.com/2016/03/bindiff-now-available-for-free.html</a></p>\n<p>Bindiff is an IDA plugin that would probably solve your problem as well.</p>\n<p>I would say try scanning for the bytes, and see how many you're successful in locating. The easy solution is the best solution! :)</p>\n</div>",
            "votes": "1",
            "user": "Tom Cornelius",
            "time": "May 23, 2016 at 5:48",
            "is_accepted": true,
            "comments": []
        }
    ]
}