{
    "title": "Reverse Engineering 2 byte checksum on RFID card",
    "link": "https://reverseengineering.stackexchange.com/questions/12723/reverse-engineering-2-byte-checksum-on-rfid-card",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am currently researching my studentcard.\nMoney is stored on this card.</p>\n<p>But the vending machine also checks a checksum on the card.\nI already did a lot of effort to find it but didn't succeed.</p>\n<p>The information:</p>\n<p><strong>Studentcard layout:</strong>\n<a href=\"https://i.sstatic.net/FwsQ4.png\" rel=\"noreferrer\"><img alt=\"Studentcard Layout\" src=\"https://i.sstatic.net/FwsQ4.png\"/></a></p>\n<p><strong>Some transaction with the card. Only these values change on the card.</strong>\n<a href=\"https://i.sstatic.net/gKQ6G.png\" rel=\"noreferrer\"><img alt=\"Transactions\" src=\"https://i.sstatic.net/gKQ6G.png\"/></a>\n(Unknown value(pink) is the checksum)</p>\n<p>I did some testing with changing the values and this what I concluded from it:</p>\n<ul>\n<li>Transaction byte is used in the checksum</li>\n<li>Money is also used in the checksum</li>\n<li>Some unique value from the card is also used.</li>\n</ul>\n<p>Thanks for any help!\nMeanwhile I will keep breaking my head :)</p>\n</div>",
    "votes": "13",
    "answers": 0,
    "views": "1k",
    "tags": [
        "crc"
    ],
    "user": "6kgstront",
    "time": "May 23, 2016 at 9:41",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">You could try feeding various parts of your card into <a href=\"http://reveng.sourceforge.net/\" rel=\"nofollow noreferrer\">Reveng</a> to check if it's one of the common CRC algorithms. But i'd read out a few more cards first to get more examples.</span>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">Also, don't get your hopes up too much. You can always upload 50€, read the values, spend 49,80€, then reset the values to 50€ again. But unless the vending machine was designed in the 1990s, it will have an online connection to a server that knows how much money should be on the card, and <i>maybe</i> use the card values as fallback when the online connection doesn't work. In that case, it'll update transactions to the server later. So, cheating won't work in most cases, and if/when it does, you'll be found out later.</span>",
            "time": null
        },
        {
            "user": "6kgstront",
            "text": "<span class=\"comment-copy\">Well I already tried resetting it and that worked. ;) So I actually have free money now.  But that's to easy, I want to \"hack\" it completely. I already checked Reveng and tried something but due lack of knowledge in CRC it was hard to make anything useful.  I made a python scripts which tries to brute force the crc by doing XOR. Didn't succeed.  Now I am making a C program which will bruteforce many CRC16's with the values on the card. Any help for Reveng would be welcome ofcourse.</span>",
            "time": null
        },
        {
            "user": "Npv23g",
            "text": "<span class=\"comment-copy\">@6kgstront Hey op, how does your setup look, I mean its just an RFID reader/writer and a suitable program? Which one did you use?</span>",
            "time": null
        },
        {
            "user": "6kgstront",
            "text": "<span class=\"comment-copy\">@VitalyOsipov  I have permission to test this issue. It's for my thesis. :)</span>",
            "time": null
        }
    ],
    "answers_data": []
}