{
    "title": "Master of Orion and scanmem",
    "link": "https://reverseengineering.stackexchange.com/questions/12798/master-of-orion-and-scanmem",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am looking to use scanmem to change in game credits in the new Master of Orion (2016). </p>\n<p>Steps I have taken: </p>\n<ol>\n<li>Install and run scanmem as root </li>\n<li>Track credits successfully using scanmem </li>\n<li>It accurately tracks between 1 and 3 variables that exactly match the  ingame credits. </li>\n<li>However when I change 1 or all of them, it does not change the actual credits in the game.</li>\n</ol>\n<p>I was going to try Ugtrain but they specifically ask you not to use there product with Steam, so I won't be doing that.</p>\n<p>I am just doing this for fun, if anyone can help it would be appreciated.</p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "324",
    "tags": [
        "linux",
        "memory"
    ],
    "user": "joelcorey",
    "time": "Jun 4, 2016 at 10:56",
    "comments": [
        {
            "user": "Ghassan Idriss",
            "text": "<span class=\"comment-copy\">sometimes when editing game memory the ui wont show the updates until you do an action in game to update the currency such as get more or spend some. Did you try one of those after changing the values?</span>",
            "time": null
        },
        {
            "user": "joelcorey",
            "text": "<span class=\"comment-copy\">Yes, I had tried to update the value. After which I played several turns. No such luck.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This means you only caught the displayed game credits value. Steam is used for multiplayer and online games. So it is very likely that the original value is stored on a server and only the value to be displayed is sent to you in a network package. Cheating by memory modification doesn't help much there. Usually input and graphics hacks are used with online and multiplayer games.</p>\n<p>ugtrain can only help if you want to lock/freeze/refill a local memory value you've already found and successfully modified with scanmem. I'm maintaining both tools. Talk to me on GitHub.</p>\n</div>",
            "votes": "5",
            "user": "Sebastian Parschauer",
            "time": "Jun 23, 2016 at 11:39",
            "is_accepted": true,
            "comments": [
                {
                    "user": "joelcorey",
                    "text": "<span class=\"comment-copy\">Thank you for the information. This stuff is outside of my expertise.</span>",
                    "time": null
                }
            ]
        }
    ]
}