{
    "title": "Get code from protected PIC",
    "link": "https://reverseengineering.stackexchange.com/questions/128/get-code-from-protected-pic",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a <a href=\"http://ww1.microchip.com/downloads/en/devicedoc/39632c.pdf\">PIC18F4550</a> from an old device and I need to see the code. I tried reading it using my ICD3 programmer, but the chip seems to have its code protected. How can I get the code anyway?</p>\n</div>",
    "votes": "11",
    "answers": 1,
    "views": "11k",
    "tags": [
        "hardware",
        "pic",
        "security",
        "dumping"
    ],
    "user": null,
    "time": "Mar 22, 2013 at 18:03",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In the paper <a href=\"http://www.openpcd.org/images/HID-iCLASS-security.pdf\">Heart of Darkness - exploring the uncharted backwaters of HID iCLASS TM security\n</a> is a technique described (section III.C) that might work,but it does require a working device which might not be at hand in your situation.</p>\n<p>In short they use a TTL-232 cable in synchronous bit bang mode to emulate the PIC programmer. They then override the boot block by a special dumper firmware. Why it seems to work:</p>\n<blockquote>\n<p>Microchip PIC microcontrollers internal memory is an EEPROM which means that data are stored and erase by pages (which hold a predefined amount of data).\n  The \"key\" point is that , whenever memory is copy protected, individual blocks can be erased resetting the copy protection bits only for these blocks.</p>\n</blockquote>\n</div>",
            "votes": "6",
            "user": "ixje",
            "time": "Mar 22, 2013 at 7:12",
            "is_accepted": true,
            "comments": [
                {
                    "user": "ixje",
                    "text": "<span class=\"comment-copy\">@Gilles my bad, I'm new to the Stack Exchange network and its ethics (=bad excuse). In my defense, my laziness to read the FAQ lost from my desire to answer the question quickly. I've edited to original response to be more constructive.</span>",
                    "time": null
                },
                {
                    "user": "Gilles 'SO- stop being evil'",
                    "text": "<span class=\"comment-copy\">Thank you! This is exactly the right way to describe an external resource.</span>",
                    "time": null
                }
            ]
        }
    ]
}