{
    "title": "Thought I found serial port - broke embedded device instead! Help?",
    "link": "https://reverseengineering.stackexchange.com/questions/12812/thought-i-found-serial-port-broke-embedded-device-instead-help",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Well another weekend has gone by and my tinkering has caused another device to (potentially) bite the dust. I've been playing around with a couple of Slingboxes, an M1 and a 500. Today was the M1. I had taken it apart (quite easily!) and poked around with my continuity and voltage probes with results as below for a few locations (see image).</p>\n<p>Gnd means continuity existed between the tested part &amp; the metal shield. The voltage in yellow is the voltage while it was plugged in. The spot in the upper left has a voltage that fluctuates somewhat erratically esp earlier on in the booting process.</p>\n<p><img alt=\"front panel with labels\" src=\"https://dl.dropboxusercontent.com/u/23091/m1/front.jpg\"/> <em>full size image at <a href=\"https://dl.dropboxusercontent.com/u/23091/m1/front.jpg\" rel=\"noreferrer\">https://dl.dropboxusercontent.com/u/23091/m1/front.jpg</a></em></p>\n<p>I hooked up a serial to usb and ran minicom on the \"chatty\" one noted towards the top left.. and got a bunch of garbled garbage. Ran <a href=\"https://code.google.com/archive/p/baudrate/\" rel=\"noreferrer\">baud rate</a> and it cycled thru various baud settings but didn't find anything that made sense.</p>\n<p><img alt=\"baud rate\" src=\"https://dl.dropboxusercontent.com/u/23091/m1/baudrate.png\"/> and so on. Tried the other ports as labeled, and nothing else had any \"chatter\" on minicom.</p>\n<p>Any thoughts?</p>\n<p><strong>Update</strong>\nWell I started touching the read probe on various other points on the board. One chip on the right generated a few (but not lots) of random looking data. And as I was touching a the prongs of the chip on the left above the smaller shield, the LEDs on the board turned off and it stopped generating any output. Sad. It won't turn back on or do anything at this point. Can that happen just from touching two pins on a chip? </p>\n<p>Any ideas how to repair this?</p>\n<p>Pretending I didn't fry the board, any ideas on what I could've done differently with minicom?</p>\n<p>Thanks!</p>\n</div>",
    "votes": "5",
    "answers": 2,
    "views": "746",
    "tags": [
        "hardware",
        "serial-communication",
        "embedded",
        "integrated-circuit"
    ],
    "user": "justin",
    "time": "Jun 6, 2016 at 2:32",
    "comments": [
        {
            "user": "Spektre",
            "text": "<span class=\"comment-copy\">Added also some insight to <b>GND</b> as measuring reference which is usually non aware of for rookies in the matter causing them a lot of headaches.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Frying your board:</p>\n<p>Just touching one single pin of a chip, or connecting it to ground over a reasonably high-resistance voltmeter, will generally not fry a board. However, there are ways to fry a board:</p>\n<ul>\n<li><p>static electricity. Every instruction to insert a PCI card in your computer comes with a warning about that, and there is a reason. However, i found computers quite resilient; probably it's cheaper for manufacturers to build some ESD protection into their mainboards than to handle the complaints and returns of 16 year old kids who fried their hardware. But it's reasonable to expect hardware that's not intended to be opened to be more prone to this kind of vulnerability.</p></li>\n<li><p>reversed polarity - some chips are very sensitive to having a pin connected to a voltage lower than their ground level, and some circuits use positive and negative voltages resp. ground. I wouldn't expect these in the digital parts of a device though.</p></li>\n<li><p>short-circuits - it's very easy to slip and have your probe connect two neighboring pins together. Short-circuting an output pin with Gnd (or Vcc) has a good chance to fry the chip when it temporarily generates too much heat.</p></li>\n</ul>\n<p>So, yes, this can happen, and short of identifying replacing the broken chip, there's no way to repair this. (Well, if you're lucky, you could just blow a fuse, but your board doesn't look like it has any fuses).  And in 99% of the cases replacing the board will be cheaper than the labour involved in repairing it.</p>\n<p>To test if a signal is really a serial signal, I typically use a scope. They don't cost you an arm and a leg these days; the one I currently use is <a href=\"http://www.sainsmart.com/sainsmart-dds-140-40m-200m-s-virtual-oscilloscope-signal-generator.html\" rel=\"nofollow noreferrer\">this</a>. (I have no affiliation with them except being a satisfied customer). To qualify as a serial signal, your signal should have sharp, straight vertical edges, and the time between two raising edges will be very constant. From this time, you can determine the baud rate (for example, ~100 µs between edges =&gt; ~1 ms per 10-bit-byte (8 bits + start bit + stop bit) =&gt; 1000 bytes per second =&gt; probably 9600 baud).</p>\n<p>My answer to <a href=\"https://reverseengineering.stackexchange.com/questions/12523/routers-serial-port-only-outputs-garbage/12525#12525\">this</a> question shows what is most probably <em>not</em> a serial signal; this is what a serial signal looks like (<a href=\"http://www.interworldna.com/pico/usb3_scope_logic_analyser.php#tabs-4\" rel=\"nofollow noreferrer\">source</a>):</p>\n<p><a href=\"https://i.sstatic.net/S2VCx.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/S2VCx.jpg\"/></a></p>\n</div>",
            "votes": "9",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": [
                {
                    "user": "justin",
                    "text": "<span class=\"comment-copy\">thanks! just out of curiosity do you see any spots on the board that might have been a hidden serial port?</span>",
                    "time": null
                },
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">My first guess would have been the J603 jumper to the left top. There's 2 jumpers as well right to what looks like a wifi module, but with their symmetric layout next to the quartz oscillators, they're unlikely. The two things to the bottom right seem to be optional front plate connectors (speakers? Optical audio?), i'd discount them.</span>",
                    "time": null
                },
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">The problem is that a serial port should have at least 3 pins (tx, rx, gnd), and there's nothing that looks like that. You could investigate if that isn't an <a href=\"https://en.wikipedia.org/wiki/Serial_Peripheral_Interface_Bus\" rel=\"nofollow noreferrer\">SPI</a> port. Google for the types of the chips close to it (you can't really read them in your image) and check if one of them has an SPI interface and if it's connected to that jumper.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I had to add just a few things to have a clear mind (although the other answer is really good and got my up-vote already).</p>\n<ol>\n<li><p><strong>Single pin touching with a probe can blow up your HW.</strong></p>\n<p>And I do not mean the obvious static charge or what so ever from the common reasons. With nowadays chips some pins runs on very specific voltage ranges and even a high impedance probes can blow them up if connected to wrong voltage. This is usually concerning ADC and semi analog pins of modern <strong>MCU</strong>'s. They should be protected by transils and or diodes but often the costs are reduced and protection omitted.</p>\n<p>Also always be careful even with <strong>GND</strong> to <strong>GND</strong> connections even between galvanicaly \"sealed\" devices (sometimes you forgot shield and then the fun starts). </p></li>\n<li><p><strong>Ground connection</strong></p>\n<p>Many of the nowadays chips have their pins short-circuited to the <strong>GND</strong> to protect them during power off or inactive state so measuring to <strong>GND</strong> resistance is usually not enough. Much safer is to follow the <strong>PCB</strong> paths if visible.</p></li>\n<li><p><strong>Poking around</strong></p>\n<p>If I need to \"Poke around\" the first thing I do is get all the significant or known <strong>IC</strong> numbers and find their datasheet or at least pinout (for those I can). Then find where the power pins are (<strong>Shield,GND,Vcc,Vddio,...</strong>) and locate the <strong>PCB</strong> power paths so I know where to avoid short-circuit by miss placing probe (as I am clumsy).</p>\n<p>Only then I will locate pins I need. For example you want serial port then find the <strong>IC</strong> capable of serial transmition and check the pins capable of them only. Oscilloscope is the way because you will see directly if it is digital or analog signal what is the baudrate etc instead of guessing... But I know not everyone has a decent oscillosope (like me 15 years ago) But usually some friend has one or in work/school usually you need just to ask... Anyway I was not that lucky at that time so I do SW oscilloscope using soundcard instead link to the win32 apps and description can be found here:</p>\n<ul>\n<li><a href=\"https://stackoverflow.com/a/21658139/2521214\">plotting real time Data on (qwt )Oscillocope</a></li>\n</ul>\n<p>Anyway you would need to make some sort of probe <strong>HW</strong> (voltage divider and or amplifier and may be some protection) to make it work with your soundcard safely.</p>\n<p>If you want something really simple and stupid instead use 2 anti-parallel connected <strong>LED</strong>s to see if you got alternating signal (they should both glowing in such case).</p></li>\n<li><p><strong>serial communication</strong></p>\n<p>There are many protocols and even voltage encoding for serial communication these days and simple <strong>RS232</strong> listener can be used only if:</p>\n<ul>\n<li>voltage levels are in <strong>RS232</strong> range <code>(+/-15V)</code> usually works on <code>(+/-5V)</code> for some <strong>IC</strong>s but it is not guaranteed. Many <strong>MCU</strong>s has serial links in <strong>TTL</strong> levels <code>(0/5V)</code> or even <code>(0/3.3V)</code> so you need voltage converter like <strong>MAX232</strong> before connecting to PC.</li>\n<li>if custom protocol/encoding is used you need first to identify it and then decoding usually by some <strong>MCU</strong></li>\n<li>if <strong>RS232</strong> protocol is used you still need to know how many <strong>data,parity,start,stop</strong> bits are present and also the <strong>baud rate</strong>. The frequency and full bit width can be measured by oscilloscope, then you need to play with settings which bits are what until you get the data correctly.</li>\n<li>You should output the data in both string and <strong>Hex</strong> form for easier spotting of patterns ... for example see <a href=\"https://reverseengineering.stackexchange.com/a/9381/4709\">Putting an application in between client and server</a></li>\n</ul></li>\n</ol>\n<p><strong>[PS]</strong></p>\n<p>In case you did not fry the board for good (sometimes chips will recover after time when the charge accumulated in wrong places is gone) so try it in few days again. But make no mistake not fried for good does not mean undamaged. Even in cases the device will run again usually its life span is significantly reduced and often not all pins are functional as should afterwards.</p>\n<p><strong>[Edit1] Measuring against GND</strong></p>\n<p>There are usually more <strong>GND</strong> types in analog/digital mixed device. usually all of them are interconnected at some point (usually very near stabilisator output) but that does not mean they have the same voltage !!!</p>\n<ol>\n<li><p><strong>Power supply GND</strong></p>\n<p>This one is present with widest fully filled <strong>PCB</strong> wirings and can transfer lot of current. Its purpose is to power the components. You should use this one to measure if better option is not present.</p></li>\n<li><p><strong>Blocking GND</strong></p>\n<p>This one is used to annihilate the pulse load of the digital circuits on the power supply. Otherwise the ground and Vcc would float making a lot of troubles along the way. The only thing that should be connected to this are the blocking capacitances (<code>1nF,10nF,100nF</code> very close to each ICs power supply pins). <strong>Do not use this for measuring!!!</strong></p></li>\n<li><p><strong>Shield GND</strong></p>\n<p>This is usually connected to shielding areas (those criss/cross filled <strong>PCB</strong> areas between data and <strong>HF</strong> parts of the <strong>PCB</strong> and cable shielding) to avoid noise affecting critical parts of the circuit. Do not mistake them with <strong>PCB</strong> coils (meanders/zig zag patterns or spirals) they are completely different thing. <strong>Do not use this for measuring!!!</strong></p></li>\n<li><p><strong>Digital/Data GND</strong></p>\n<p><strong>This one should be used if present</strong>. Its sole purpose is to provide reference voltage between digital interfaces. Beware sometimes these are not connected to the main <strong>GND</strong>'s and sometimes even to each other between different interfaces!!! Also the voltage level could be anything there not just 0V !!!</p></li>\n</ol>\n</div>",
            "votes": "8",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}