{
    "title": "Knockoff CGA/EGA to vga firmware update [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/12843/knockoff-cga-ega-to-vga-firmware-update",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<div>\n<aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n<div class=\"d-flex fd-column fw-nowrap\">\n<div class=\"d-flex fw-nowrap\">\n<div class=\"flex--item wmn0 fl1 lh-lg\">\n<div class=\"flex--item fl1 lh-lg\">\n<div>\n<b>Closed</b>. This question needs <a href=\"/help/closed-questions\">details or clarity</a>. It is not currently accepting answers.\n                                \n                            </div>\n</div>\n</div>\n</div>\n</div>\n<hr class=\"my12 outline-none baw0 bb bc-blue-400\"/>\n<div class=\"fw-nowrap fc-black-500\">\n<div class=\"d-flex fd-column lh-md\">\n<div class=\"mb0 d-flex\">\n<div class=\"flex--item mr8\">\n<svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\"><path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\"></path></svg>\n</div>\n<p><b>Want to improve this question?</b> Add details and clarify the problem by <a href=\"/posts/12843/edit\">editing this post</a>.</p>\n</div>\n<div class=\"mb0 mt6 d-flex\">\n<p class=\"ml24 pl2\">Closed <span class=\"relativetime\" title=\"2016-06-26 15:30:56Z\">8 years ago</span>.</p>\n</div>\n<div class=\"ml24 pl2\">\n</div>\n</div>\n</div>\n<div class=\"mt24 d-flex gsx gs8\">\n<a class=\"s-btn s-btn__outlined flex--item js-post-notice-edit-post\" href=\"/posts/12843/edit\">\n                        Improve this question\n                    </a>\n</div>\n</aside>\n</div>\n<p>The problem with this, as I know from experience in dealing with this exact same issue is the firmware in the CGA/EGA/VGA converter board. There is an update that needs to be written to the converter board in order for the POG T340+ boards to work with them, I've had to do the exact same thing. I ordered 40 of the converter boards and then shipped them to a guy in Florida that updated the firmware in all of them to work with my POG T340+ boards. I personally don't have the cables to update the firmware in the converter boards but I think it's done using HyperTerminal in windows.</p>\n<p>I got some(ALOT) of them Chinese CGA/EGA to VGA converter boards, unfortunately I cant get them to work with what I need. After some googling I see it as a common problem with them is a bad batch of firmware.</p>\n<p>GBS-8200 styled board. </p>\n<p><a href=\"https://i.sstatic.net/InvyH.jpg\" rel=\"nofollow noreferrer\"><img alt=\"img\" src=\"https://i.sstatic.net/InvyH.jpg\"/></a> </p>\n<p>Im trying to take the RGBS out of a <a href=\"http://www.gametown.info/pot-o-gold-t340-game-pcb/\" rel=\"nofollow noreferrer\">POG board</a>\n<a href=\"https://i.sstatic.net/98VRh.jpg\" rel=\"nofollow noreferrer\"><img alt=\"img\" src=\"https://i.sstatic.net/98VRh.jpg\"/></a> </p>\n<p>After looking through the POG manuals, I don't see any information on its sync, or clamp settings ext.</p>\n<p>I looked through the GBS-8200 it says there is a i2c isp header for updating the firmware, but no relevant links on where to get it or how to put it on.</p>\n<p>I think either the settings or wrong, or that the boards don't have working firmware. I bought a couple to see if it was a device problem, but dosent seem to be.</p>\n<p>Iv tested the POG board using my friends CGA compatible CRT and it comes up just fine. </p>\n<p>I can get as far as soldering the pins to the I2C interface for updating, but I don't know what the command is nor do I have the firmware.</p>\n<p>I tried pulling the firmware using my MINIPRO-TL866 programmer, but there docent seem to be a setting for the mtv230mv chip.</p>\n<p>Also, my OS is linux.</p>\n<p>UPDATE:\nAfter lurking Russian and Arabic hacker forums (\"And being probably put on several NSA watch-lists for registering on them\") I located what i believe to be the firmware. And some program to flash it with. So, Now i need to figure out how to use Postal2 ext.</p>\n<p>Also, a friend came over and lent me his motherboard with the same chip-set, but different firmware and it worked like a charm. So that proves this can work. I also poped the chip off and used it on my board ant it worked, so its definitely firmware on the MTV230</p>\n<p>Here is the datasheet for the MTV230 <a href=\"http://datasheet.seekic.com/datasheet-picture/1200626_ETC_[ETC]_MTV230M.html\" rel=\"nofollow noreferrer\">datasheet</a></p>\n<p>Clarification:\nHow do I write/read the firmware to the MTV230 using its I2C interface?\nUsing a Arduino, or a USB I2C adapter on Linux. </p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "2k",
    "tags": [
        "linux",
        "firmware"
    ],
    "user": "Steven Venham",
    "time": "8 years ago",
    "comments": [
        {
            "user": "Spektre",
            "text": "<span class=\"comment-copy\">It is not clear what you want .... reprogram <code>mtv230mv</code> chip (or any other? on which board ?) or extract video signal from the POG board or what ?  Those are completely different questions. Specify closer or divide into 2 separate questions otherwise you are risking closing votes. Also the images are not clear enough to read the IC strings ... I would start with the datasheets to look which interface it is and how to use it... Also there is a possibility the firmware is on external EEPROM somewhere ... so you can use programmer for it (if in socket) ...</span>",
            "time": null
        },
        {
            "user": "Steven Venham",
            "text": "<span class=\"comment-copy\">I want to reprogram these boards i have to take the outgoing video signal from the pog and display it on vga.</span>",
            "time": null
        },
        {
            "user": "Spektre",
            "text": "<span class=\"comment-copy\">If I got it right the <b>POG</b> is some kind of console game board outputting <b>CGA/EGA</b> signal ... which is not the problem ... and the problem is the <b>CGA/EGA to VGA</b> board not syncing correctly ... or your monitor does not sync to the outputted VGA signal.  Or do you need also change the <b>POG</b> to add aditional gfx stuff and or gfx chip settings to adjust the output video signal?  Anyway use osciloscope to see what is happening if the signal is present or not, if the timings are within specs ... also some monitors (especially LCD) are very picky and sensitivy to small sync variations.</span>",
            "time": null
        },
        {
            "user": "Spektre",
            "text": "<span class=\"comment-copy\">So do you have a firmware? for which chip/board? it is full memory dump (hex) or just incremental update aplicable only by the device software means? Add the concerned chip IDs o reven link to datasheeds ... detect which interface is used for upgrade ... without any actual info or access to the HW we can not help</span>",
            "time": null
        },
        {
            "user": "Steven Venham",
            "text": "<span class=\"comment-copy\">Firmware? I'm not sure, I have some i found from a Russian site for the GBS, but idk if its any good. And yea, the converter board issent giving me a usable signal. I can see the menu for the GBS board just fine but it reports its not getting a signal. The POG outputs 16.5H and 60V from what the monitor says if i direct connect it. The monitor i'm using is a WGF0003 by wells garner</span>",
            "time": null
        }
    ],
    "answers_data": []
}