{
    "title": "Driver's Licence Last Name Numbering Format (Ontario, Quebec, New Jersey)?",
    "link": "https://reverseengineering.stackexchange.com/questions/12943/drivers-licence-last-name-numbering-format-ontario-quebec-new-jersey",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So I found out that Ontario Driver's Licences have the following format: LXXXX - NNNIY - YMMDD</p>\n<p>L - first letter of last name XXXX - number referring to your last name NNN - number referring to your first name I - number referring to your middle initial (0 if you don't have one) YY - year of birth MM - month of birth - add 50 to month if you are female DD - day of birth</p>\n<p>My question is, what is the encoding system they use for the first 5 alphanumeric digits? The first letter is the first letter of your last name, but what about the numbers? Everyone with the same last name will have the same first 5 alphanumeric digits. I used to think Ontario had propitiatory system with a database of last names, and attached a number onto them, but I discovered that New Jersey and Quebec uses the SAME system as well by looking at their sample licences on google. I wonder if anyone knows how the name is encoded. I've found something about the SoundEx system, but I don't think it applies in this case. This question has been brought up once at <a href=\"https://reverseengineering.stackexchange.com/questions/6440/decoding-new-jersey-drivers-license-codes\">Decoding New Jersey Driver's License Codes</a> but they did not manage to crack the code. Thanks!</p>\n</div>",
    "votes": "2",
    "answers": 2,
    "views": "24k",
    "tags": [
        "encryption",
        "encodings"
    ],
    "user": "jerry70450",
    "time": "Aug 14, 2019 at 23:33",
    "comments": [
        {
            "user": "pat luck",
            "text": "<span class=\"comment-copy\">how do we find the reference number on a quebec liscence ?</span>",
            "time": null
        },
        {
            "user": "Christopher Eatmon",
            "text": "<span class=\"comment-copy\">Anyone know the format for New brunswick drivers licenses ?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I know this is an old thread and probably you either figured it out on your own or gave up and dgaf anymore. But this is I believe Soundex code (It absolutely is the case for the Quebec drivers license atleast), which is based on how names sound rather than spelling. </p>\n<p>For Quebec: SSSSL DDMMYY NN - soundex last name + license type, DOB, NN </p>\n<p>Hope it helps someone. </p>\n</div>",
            "votes": "2",
            "user": "John",
            "time": "Apr 27, 2017 at 1:23",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The NNNI part is wrong, my D/L has my middle name on it and the I position is a 0, you are correct for the First 5 as the Last name and the Last 6 are the birthdate.</p>\n</div>",
            "votes": "0",
            "user": "Stan Salter",
            "time": "Dec 1, 2016 at 10:11",
            "is_accepted": false,
            "comments": [
                {
                    "user": "jerry70450",
                    "text": "<span class=\"comment-copy\">It could be that when the name was entered into the computer, it was entered as a part of your first name (this is the case for me), not a middle name. The lady at DriveTest asked me specifically if the second part of my name was my first name or my middle name, which I presume would be encoded differently.</span>",
                    "time": null
                }
            ]
        }
    ]
}