{
    "title": "How to set a breakpoint on a 64 bit process button with x64dbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/13106/how-to-set-a-breakpoint-on-a-64-bit-process-button-with-x64dbg",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I want to find out what certain buttons do on a 64 bit application, x64dbg is the debugger I have available to me, can anyone help me out? I read that ollydbg has an option to break on user input, such as a button, but since the application is question is 64 bit that's not an option. Any help on where to go from here?</p>\n</div>",
    "votes": "3",
    "answers": 2,
    "views": "10k",
    "tags": [
        "debugging",
        "memory"
    ],
    "user": "PhotoScript",
    "time": "Jul 21, 2016 at 7:49",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Yes, you can use the enhanced <strong>x64dbg</strong> feature for placing <strong>BP</strong> on any window of the debugged app and hence intercept any message being sent to any of them. </p>\n<p>After running the <strong>exe</strong>, go to <code>Handles tab &gt; Right-click &gt;Refresh</code> -and watch over <em>Windows</em> widget and locate the window you want to put the <strong>BP</strong> on. Then Right click-&gt;<em>Message breakpoint</em>, a window will pop up, now select the desired window message based on what you want to pause your program after. In case of a button, <strong>WM_LBUTTONUP</strong> would do it, in case of an editbox <strong>WM_KEYUP</strong> will also work and so on, you got a ton of messages to choose from. Then you got a couple more checkboxes, select \"<em>...current window</em>\" to pause only when the message is passed to the selected window.\nNow, sometimes these windows procs BPs won't work or even pause as expected, in this case, try checking <code>Use TranslateMessage</code> option and that would do it.</p>\n</div>",
            "votes": "7",
            "user": "T.Todua",
            "time": "Dec 1, 2018 at 17:35",
            "is_accepted": false,
            "comments": [
                {
                    "user": "T.Todua",
                    "text": "<span class=\"comment-copy\">where is <code>windows</code> widget?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I did it in the following way:</p>\n<p>1 go to the window \"resources\"\n2 choose the button corresponding to the application\n3 right click and message breakpoint\n4 choose \"WM_LBUTTONUP\"</p>\n</div>",
            "votes": "1",
            "user": "sin_rostro",
            "time": "Jun 3, 2017 at 19:31",
            "is_accepted": false,
            "comments": []
        }
    ]
}