{
    "title": "When I start up a remote thread in an application, why does it always crash when it tries to access data in the thread structure?",
    "link": "https://reverseengineering.stackexchange.com/questions/13229/when-i-start-up-a-remote-thread-in-an-application-why-does-it-always-crash-when",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm  on <em>OS X 10.10 64 bit (x86_64)</em> and created a chunk of memory called code with <code>vm_allocate</code>.  I allocate a chunk of memory for a stack.  I load a library to memory and determine an entry point to the library.  I write the library to my code buffer using <code>vm_write</code>, no problems there.</p>\n<p>I setup the registers and call <code>thread_create_running</code> and run remote thread into another process.</p>\n<p>Over in the other process the thread starts.  I'm using <em>lldb</em> and have it setup so when my thread starts it <em>breaks on that entry point</em>  I see my code.  I step through the code.</p>\n<p>However it crashes when it tries to do the <code>_pthread_set_self</code>.  If I step into <code>pthread_set_self</code>, it crashes in \n<code>_pthread_mutex_lock</code> at the following instruction:</p>\n<pre><code>movq %gs:0x0, %rax\n</code></pre>\n<p>(Note: <code>gs</code> is <code>0x00000000</code> prior to the instruction where the crash occurs)</p>\n<p>It's my understanding this instruction is an operation to retrieve the first segment of <code>gs</code> from a thread segment structure and move it into the <code>rax</code> register.</p>\n<p><strong>My question is what do I need to do to prevent the crash that ensues upon execution of this instruction?</strong>  Upon execution of this instruction I see <code>EXC_BAD_ACCESS</code> in <code>pthread_mutex_lock</code>.</p>\n<p>I tried putting in the code to <code>pthread_mutex_init</code>, followed by <code>pthread_mutex_lock</code> then <code>pthread_set_self</code>.  However when it hits the first <code>pthread_mutex_lock</code>, i get the same issue.  It dies at the same spot.</p>\n<p>Any ideas?</p>\n<p>My target app to which i don't have source code, is multi-threaded.</p>\n</div>",
    "votes": "3",
    "answers": 0,
    "views": "442",
    "tags": [
        "osx",
        "thread",
        "lldb",
        "injection"
    ],
    "user": "Div",
    "time": "Aug 8, 2016 at 5:51",
    "comments": [
        {
            "user": "Lupe",
            "text": "<span class=\"comment-copy\">Did you ever figure this out? I'm having the exact same problem.</span>",
            "time": null
        }
    ],
    "answers_data": []
}