{
    "title": "How does some application get through the block when mobile data plan is exceeded [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/13320/how-does-some-application-get-through-the-block-when-mobile-data-plan-is-exceede",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<div>\n<aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n<div class=\"d-flex fd-column fw-nowrap\">\n<div class=\"d-flex fw-nowrap\">\n<div class=\"flex--item wmn0 fl1 lh-lg\">\n<div class=\"flex--item fl1 lh-lg\">\n<div>\n<b>Closed.</b> This question is <a href=\"/help/closed-questions\">off-topic</a>. It is not currently accepting answers.\n                                \n                            </div>\n</div>\n</div>\n</div>\n</div>\n<hr class=\"my12 outline-none baw0 bb bc-blue-400\"/>\n<div class=\"fw-nowrap fc-black-500\">\n<div class=\"d-flex fd-column lh-md\">\n<div class=\"mb0 d-flex\">\n<div class=\"flex--item mr8\">\n<svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\"><path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\"></path></svg>\n</div>\n<p> This question does not appear to be about reverse engineering within the scope defined in the <a href=\"https://reverseengineering.stackexchange.com/help/on-topic\">help center</a>.</p>\n</div>\n<div class=\"mb0 mt6 d-flex\">\n<p class=\"ml24 pl2\">Closed <span class=\"relativetime\" title=\"2016-08-26 18:01:49Z\">8 years ago</span>.</p>\n</div>\n<div class=\"ml24 pl2\">\n</div>\n</div>\n</div>\n<div class=\"mt24 d-flex gsx gs8\">\n<a class=\"s-btn s-btn__outlined flex--item js-post-notice-edit-post\" href=\"/posts/13320/edit\">\n                        Improve this question\n                    </a>\n</div>\n</aside>\n</div>\n<p>I have a mobile data plan of 2 GBs. When I exceed it, I always get redirected to the network operator's website when I trying to load an URL. For some reason Telegram(Android app only, Desktop app doesn't go through) works without any problem or restriction. I can send and receive texts, audio messages and pictures.</p>\n<p>My question is how does Telegam (or a similar app) goes through the block.</p>\n<p>When inspecting Chrome Dev. console's network tab every website throws an <code>HTTP 302 Moved Temporarily</code> status code, and I get redirected to the network OP's site. I verified that Telegram works on HTTP 1.1/TCP port 80.</p>\n<p>Additionally, is it a bug in network op's software?\nIs it legal to use although my data plan is exceeded? I'm curious.</p>\n<p>The browsing and traffic of other apps are totally blocked, so it's not about that my data plan just got slowed down. And in my country there is no law for enabling some data traffic for emergency text, at least not over data plan. Also my network operator hasn't advertised free network traffic for Telegram, like other network operators for facebook or etc..</p>\n<p>I tried reviewing my network traffic with Wireshark but there was no main difference in the packets of Telegram and Chrome's packets. I also started to search after some connection techniques in Telegram's code(it's on github) but it has a really huge code base.</p>\n<p>I also noticed this behavior with Skype last year, but now it doesn't seem to connect. </p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "119",
    "tags": [
        "debugging",
        "android",
        "networking"
    ],
    "user": "davidgereb",
    "time": "8 years ago",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">I'm voting to close this question as off-topic because it is about network management, not reverse engineering.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>One of the ways to block unauthorized internet access in similar kiosks is by implementing a DNS redirection. Responding to any DNS request with the same server, and having that server redirect you to the \"exceeded data plan\" with 302 Moved Temporarily HTTP response.</p>\n<p>This can be validated by accessing an IP directly instead of a domain name, and might be what Telegram is doing.</p>\n<p>Another method often used could be directly spoofing the HTTP response with a 302 Moved Temporarily response. This usually works when accessing websites using the <code>http://</code> protocol. While most websites will redirect you to the <code>https://</code> URL the connection starts unencrypted and that's a nice opening to hijack it. Telegram might be doing it for security reasons.</p>\n<p>This can be validated by accessing the <code>https://</code> URL of any website.</p>\n<p>The third option is communicating at a level lower than HTTP, thus bypassing the redirection completely. Telegram may be using something more raw as a backup option for when HTTP fails when communicating with its servers, or may use some kind of peer-to-peer communication to use other users as proxies when internet is not directly available.</p>\n<p>I can't think of a simple way to validate that idea.</p>\n</div>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Aug 20, 2016 at 14:29",
            "is_accepted": false,
            "comments": []
        }
    ]
}