{
    "title": "How can I set breakpoint and get value of a register with IDApython",
    "link": "https://reverseengineering.stackexchange.com/questions/13383/how-can-i-set-breakpoint-and-get-value-of-a-register-with-idapython",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>How can I set a breakpoint and get the value of the <code>EAX</code> register with IDApython?</p>\n<p>I want to set a breakpoint, for example at address <code>00b27223</code>, and at each break before execution of that specific address I want to get the value of the <code>EAX</code> register as text.</p>\n<p><a href=\"https://i.sstatic.net/LQhPa.png\" rel=\"noreferrer\"><img alt=\"example\" src=\"https://i.sstatic.net/LQhPa.png\"/></a></p>\n</div>",
    "votes": "7",
    "answers": 1,
    "views": "12k",
    "tags": [
        "ida",
        "debugging",
        "idapython",
        "debuggers",
        "ida-plugin"
    ],
    "user": "user121314",
    "time": "Sep 3, 2016 at 7:15",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I can think of two methods to achieve this:</p>\n<ol>\n<li>Using <code>RunTo</code>.</li>\n<li>Setting a breakpoint, hooking debugger events and implementing <code>dbg_bpt</code></li>\n</ol>\n<h1>1. Using <code>RunTo</code></h1>\n<p>This is nearly trivial to do, but does not give the same amount of control as the second approach. It might be better for quick and dirty type of solutions, if that's what you're after.</p>\n<p>Calling <code>idc.RunTo(ea)</code> will execute the process until an <code>ea</code> is reached, allowing you to then call <code>idc.GetRegValue(name)</code> to get the value of <code>EAX</code>.</p>\n<p>Certain conditions (like an exception thrown or a different breakpoint being hit) will cause <code>RutTo</code> to return before the provided <code>ea</code> is reached. You could then call <code>idc.GetDebuggerEvent</code> to figure out what happened, but if you're gonna do that I suggest switching to the second approach.</p>\n<p>Note <code>RunTo</code> will also start up a process if there's no running process.</p>\n<h1>2. Setting a breakpoint, hooking debugger events and implementing <code>dbg_bpt</code></h1>\n<p>This is the safer and would be my recommended approach, while being harder to implement it allows properly handling other breakpoints and more control.</p>\n<p>For this, you'll have to do three things:</p>\n<ol>\n<li>Set up a breakpoint at given address.</li>\n<li>Monitor for the breakpoint's trigger.</li>\n<li>And finally act upon it.</li>\n</ol>\n<h2>Set up a breakpoint at given address</h2>\n<p>The most basic method of achieving this is by calling the <code>idc.AddBpt(ea)</code>, which sets a software on execution breakpoint at that address.</p>\n<p>Additional methods you could use include:</p>\n<ol>\n<li><code>idc.AddBptEx(ea, size, bpttype)</code> to have more control on the type of breakpoint you're creating.</li>\n<li><code>idc. SetBptAttr(address, bptattr, value)</code> to set the breakpoint's available attributes.</li>\n<li><code>idc.SetBptCnd(ea, cnd)</code> / <code>idc. SetBptCndEx(ea, cnd, is_lowcnd)</code> to set the breakpoint's trigger condition.</li>\n</ol>\n<p>Read the documentation for the exact details.</p>\n<h2>Monitor for the breakpoint's trigger</h2>\n<p>For that, you'll need to install a Debugger Hooking class (any class that inherits <code>idaapi.DBG_Hooks</code>), which implements the <code>dbg_bpt(tid, ea)</code> method, which describe the thread id and linear address in which the breakpoint triggered. Returning 0 from <code>dbg_bpt</code> should prevent IDA from notifying the user it was triggered (assuming you'll handle it internally).</p>\n<p>You'll have to instantiate your class and call the instance's <code>Hook</code> and <code>Unhook</code> methods for it to actually function. Please note it's better practice to install the hooks before creating the breakpoint.</p>\n<h2>And finally act upon it</h2>\n<p>While the debugger is running, you can call <code>idc.GetRegValue(name)</code> providing the register name to receive it's immediate value at that time.</p>\n</div>",
            "votes": "8",
            "user": "NirIzr",
            "time": "Sep 3, 2016 at 21:51",
            "is_accepted": true,
            "comments": []
        }
    ]
}