{
    "title": "Where can I find benign samples with a high potential to false positive?",
    "link": "https://reverseengineering.stackexchange.com/questions/13428/where-can-i-find-benign-samples-with-a-high-potential-to-false-positive",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In the pursuit and development of malware detection algorithms, often a big sample set of both malicious and benign samples is required. Both machine learning or similar automated techniques, as well as manual or partially manual signature generation, often require a good and varied example set of benign samples that are commonly mistaken as malicious.</p>\n<p>Those samples are usually being automatically analyzed and then provided to a Reverse Engineer for further scrutiny, analysis and improvement of said malware detection algorithm.</p>\n<p>Although finding malicious samples is frequently discussed (see <a href=\"https://reverseengineering.stackexchange.com/questions/206/where-can-i-as-an-individual-get-malware-samples-to-analyze\">multiple</a> <a href=\"https://reverseengineering.stackexchange.com/questions/9279/where-can-i-get-linux-malware-samples\">questions</a>), discussion about benign sample sources seems lacking.</p>\n<p>What are good benign sample repositories/feeds, preferably focused on potential/frequent false positive samples? Other sources or \"retrival methods\" (scraping) are also welcome! </p>\n</div>",
    "votes": "5",
    "answers": 3,
    "views": "4k",
    "tags": [
        "malware",
        "benign"
    ],
    "user": "NirIzr",
    "time": "Aug 26, 2018 at 3:26",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can find some of the samples from our work on deobfuscation at <code>hxxp://www.cs.arizona.edu/projects/lynx-project/Samples/</code> (s/x/t/).  The programs---a mix of Linux and Windows binaries---are all benign (you'll have to take my word for this :-), but use a variety of techniques commonly used by malware. These samples formed the basis for the results reported in the following papers:</p>\n<ul>\n<li>Yadegari <em>et al</em>, \"A Generic Approach to Automatic Deobfuscation of Executable Code\", <em>Proc. IEEE Symposium on Security and Privacy</em>, May 2015.  These consist of programs obfuscated using tools such as VMProtect, ExeCryptor, and Themida; and several that use return-oriented programming.</li>\n<li>Qiu <em>et al</em>, \"Identifying and Understanding Self-Checksumming Defenses in Software\", <em>Proc. Fifth ACM Conference on Data and Application Security and Privacy</em> (CODASPY), March 2015.  This is a collection of programs that use a variety of techniques, including self-modifying code, to implement self-checksumming-based anti-tampering.</li>\n</ul>\n<p>We used to have a link to these samples on the project web page, but Google decided that we were distributing malware and put a big red warning next to their link (talk about false positives!), so we ended up removing the link. This is also the reason the link above has been disguised with \"hxxp\".</p>\n</div>",
            "votes": "5",
            "user": "NirIzr",
            "time": "Aug 25, 2018 at 19:40",
            "is_accepted": true,
            "comments": [
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Thanks a lot! Would you be kind enough to explain the origin of the samples? Rough quantities would also be appriciated!</span>",
                    "time": null
                },
                {
                    "user": "debray",
                    "text": "<span class=\"comment-copy\">The obfuscated code consists of several small programs we wrote ourselves  (binary-search, bubble-sort, matrix-multiply, etc.); and some quasi-malware -- code whose source we got from VX Heavens and which we then obfuscated using Themida etc (I call them \"quasi-malware\" because they don't have the actual malicious payload).  The ROP code is a collection of a few small programs we wrote ourselves (bubble-sort, factorial, fibonacci, matrix-multiply).  The self-checksumming programs are all based on an open-source MD5 program.  Please see the publications mentioned for details.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Awesome, thanks! I'll upvote your answer in a few hours, but I'll wait some more before I accept any answer</span>",
                    "time": null
                },
                {
                    "user": "debray",
                    "text": "<span class=\"comment-copy\">@NirIzr: my student mentioned that he thought that some of the samples from VX Heavens might still have questionable content -- he thought he had some problems with some of them.  Just to be safe, I've removed all of those samples from that website, so what is left are just programs we wrote ourselves and are certain about.  Please discard what you took previously and grab them again.  Sorry about that.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<h2>Malicious samples</h2>\n<p>My favorite source for malicious samples is a database i assembled myself by regulary pulling the free examples provided by <a href=\"http://virussign.com/vslist.html\" rel=\"noreferrer\">VirusSign</a>. Please not these samples do require registration, but come with reports indicating the type.</p>\n<p>There may be no better archive for malicious samples than <a href=\"https://www.virustotal.com/\" rel=\"noreferrer\">VirusTotal</a>. If you don't happen to gain (intelligence) access there, you can still try open alternatives like <a href=\"http://www.offensivecomputing.net/\" rel=\"noreferrer\">Open Malware</a>.</p>\n<p>Generally, a good list for places to find malicious samples is here:\n<a href=\"https://zeltser.com/malware-sample-sources/\" rel=\"noreferrer\">LENNY ZELTSER</a></p>\n<h2>Benign Samples</h2>\n<p>As for benign samples, I propose extracting benign executables from a fresh OS installations. You can simply install the target in a virtual machine and get a script to extract them.</p>\n<p>Another source is crawling sites like <a href=\"http://www.portablefreeware.com/\" rel=\"noreferrer\">PortableFreeware</a>. Please make sure you check if executables collected this way to work in your environment.</p>\n<h2>Possible false positives</h2>\n<p>Most malware archives label their samples based on the detection ratio and labels provided by different ant-malware products (like VirusTotal). Asssuming samples with very low detection ratio and generic labels to be false positives is probably the best way to go here. Also, data collected from <em>HoneyPots</em> may yield relatively higher false positive rates.</p>\n<p>I often used the executables included in the <a href=\"https://technet.microsoft.com/de-de/sysinternals/bb842062.aspx\" rel=\"noreferrer\">Sysinternals Suite</a> as a kind of 'false positives'. They are benign binaries utilizing system-near features in order to expose system internal data.</p>\n<p><em>On a sitenode, please take time evaluating your dataset and finding biases hidden within. A lot of current research suffers from biased sample sets and unreproducible results.</em></p>\n</div>",
            "votes": "5",
            "user": "Nordwald",
            "time": "Sep 5, 2016 at 6:47",
            "is_accepted": false,
            "comments": [
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Thanks! For the record I was asking only for white samples</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Some of the techniques i've also came up with, for the sake of completeness (I won't accept my own answer):</p>\n<h2>download from github</h2>\n<p>Some Github repositories have multiple executables either as needed utilities or as build output. Scanning Github for those using a <a href=\"https://github.com/intezer/GithubDownloader\" rel=\"nofollow\">GithubDownloader</a> proved being slow but effective, and I results are really likely to be benign.</p>\n<h2>collect all executables/hashes from accessible machines</h2>\n<p>Since I'm doing this as part of my job, I'm able to ask the IT department to collect hashes and samples from the multiple machines we have at my office. This was a good way to collect many executables for multiple versions of OSes with ease. Collecting hashes and downloading the ones available from VT was also a possibility (perhaps after further scrutiny).</p>\n</div>",
            "votes": "0",
            "user": "NirIzr",
            "time": "Sep 7, 2016 at 22:10",
            "is_accepted": false,
            "comments": []
        }
    ]
}