{
    "title": "OllyDbg can't set permanent breakpoint",
    "link": "https://reverseengineering.stackexchange.com/questions/13495/ollydbg-cant-set-permanent-breakpoint",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am relatively new to the world of RE.\nSo, I am playing with a program, which relies on multiple dlls.\nI am using 32 bit OllyDbg 2.01, and can’t put permanent breakpoints in one dll, others are fine, just this one is making problems.\nOlly accepts breakpoints in session, but forgets their locations after the program gets restarted (meaning all BPs get deleted in this one dll).\nAnalysis of this dll outputs in olly message “Quick statistical test of module reports that its code section is either compressed, encrypted, or contains large amount of embedded data. Results of code analysis can be very unrealiable or simply wrong. Do you want to continue analysis?”.\nI have tried using PEiD and nothing was found.\nI can open dll with a simple hex editor and find all op code hex data, so I think the dll is not encrypted or packed, and it has to do with Olly dbg.\nCan anyone give any suggestion? </p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "631",
    "tags": [
        "ollydbg",
        "dll",
        "breakpoint"
    ],
    "user": "Tree",
    "time": "Sep 12, 2016 at 10:22",
    "comments": [
        {
            "user": "Abr001am",
            "text": "<span class=\"comment-copy\">try to use dynamic bp, at every run set a script to toggle a bp on start_address+offset where the offset is constant, if the code is polymorphic you should lean to some unobfuscator/unpacker</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is this library dynamically loaded? (At runtime, e.g. using API like LoadLibaray, LdrLoadDll)</p>\n<p>Then you may need to set your breakpoints dynamically as well. For example, using Olly's scripting capabilities. If the library is always loaded at the same offset, memory breakpoints could also prove useful.</p>\n</div>",
            "votes": "0",
            "user": "Nordwald",
            "time": "Sep 12, 2016 at 11:04",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Tree",
                    "text": "<span class=\"comment-copy\">Hi, Yes, dll is dynamically loaded, but Olly usually does not have a problem with that. There are at least 10 dlls that get loaded, and only this one is making BP problems. I don’t think dll is packed, or in any way protected, otherwise one could not open it with hex editor (like notepad++) and find hex notation of OP code.  I’ll try to find some resources which explain how to set dynamically BP via scripts.</span>",
                    "time": null
                }
            ]
        }
    ]
}