{
    "title": "Changes on threads and threading system, in new Windows OS",
    "link": "https://reverseengineering.stackexchange.com/questions/13509/changes-on-threads-and-threading-system-in-new-windows-os",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I looked up the source code of the functions like <code>CreateProcess</code> and <code>CreateThreade</code> from <code>kernel32</code>. For example, <code>CreateThread@kernel32</code> leads into <code>kernelbase.dll</code> and ends with a call to <code>NtCreateThreadEx</code>.</p>\n<p>I cannot see any calls to <code>CsrClientCallServer</code> in that function, There are only few checks and a call to <code>RtlActivateActivationContextEx</code>. I wonder if those calls are necessary for a process to function</p>\n<p>I looked up in the <code>ntdll</code> there is no function with the name <code>CsrClientCallServer</code>. However there are functions like <code>NtConnectPort</code> and so on, to use the <strong>LPC</strong> mechanism. </p>\n<p>I assume <code>CsrClientCallServer</code> was built on top of the functions like <code>NtConnectPort</code>, <code>NtReplyPort</code> with some specific parameters.\nMy question is: <strong>is it necessary to notify csrss about the created thread from user mode?</strong></p>\n<p>It is unclear to me from wininternals and other books should this be done or not, for the thread of the existing process. I tried to create the thread using old <code>NtCreateThread</code> on win10 and it works fine, without any notifications via LPC But will the same code work on xp for example?</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "333",
    "tags": [
        "ida",
        "winapi",
        "thread",
        "process"
    ],
    "user": "Vlad",
    "time": "Sep 15, 2016 at 10:35",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>No. It is not <em>necessary</em> to create a connection with the <code>CSRSS</code> service in order for a process to function. The <code>CSRSS</code> server provides a few functionalities that are not needed for most processes, and therefore can be ignored unless it is requried in that specific process for any reason.</p>\n<p>Since NT4, the main functionalities of <code>CSRSS</code> remained mostly the Windows Console GUI and other GUI related services Windows provides to GUI applications. If your process does not require those services it can silently ignore the existance of <code>CSRSS</code>.</p>\n<p>Although I'm aware of it independently, this is also stated in <a href=\"https://en.wikipedia.org/wiki/Client/Server_Runtime_Subsystem\" rel=\"nofollow\">wikipedia</a>:</p>\n<blockquote>\n<p>Client/Server Runtime Subsystem, or csrss.exe, is a component of the Windows NT family of operating systems that provides the user mode side of the Win32 subsystem and is included in Windows NT 4 and later. Because most of the Win32 subsystem operations have been moved to kernel mode drivers in Windows NT 4 and later, CSRSS is mainly responsible for Win32 console handling and GUI shutdown.</p>\n</blockquote>\n<p>Additonally, there's a <a href=\"http://magazine.hackinthebox.org/issues/HITB-Ezine-Issue-005.pdf\" rel=\"nofollow\">decent</a> (see page 38) <a href=\"http://j00ru.vexillium.org/?p=502\" rel=\"nofollow\">amount</a> <a href=\"https://doxygen.reactos.org/dir_289a3749994be3fa0fe2c6a8f7d01078.html\" rel=\"nofollow\">of</a> <a href=\"https://technet.microsoft.com/en-us/library/cc750820.aspx#XSLTsection124121120120\" rel=\"nofollow\">documentation</a> <a href=\"https://technet.microsoft.com/en-us/magazine/2007.03.vistakernel.aspx\" rel=\"nofollow\">about</a> <a href=\"http://j00ru.vexillium.org/?p=2197\" rel=\"nofollow\">CSRSS</a> <a href=\"http://www.reactos.org/forum/viewtopic.php?p=102718&amp;sid=801ce2a73d8c5d6e4a6aa37c4ccaf670\" rel=\"nofollow\">online</a>. </p>\n</div>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Sep 15, 2016 at 11:01",
            "is_accepted": true,
            "comments": []
        }
    ]
}