{
    "title": "Finding a place to inject shellcode",
    "link": "https://reverseengineering.stackexchange.com/questions/13516/finding-a-place-to-inject-shellcode",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am following the <a href=\"https://g0blin.co.uk/rop-primer-0-2-vulnhub-writeup/\" rel=\"nofollow noreferrer\">tutorial</a> for <a href=\"https://www.vulnhub.com/entry/rop-primer-02,114/\" rel=\"nofollow noreferrer\">ROP Primer</a>, level 0.\nThe tutorial sets the memory at the beginning of <code>[vdso]</code> writeable and executable and copies the shellcode there.</p>\n<p>I do not know why, but it seems that <code>mprotect</code> fails for me:</p>\n<pre><code>(python exp.py; cat) | strace ./level0\n...\nmprotect(0xb7fff000, 8192, PROT_READ|PROT_WRITE|PROT_EXEC) = -1 ENOMEM (Cannot allocate memory)\n--- SIGSEGV {si_signo=SIGSEGV, si_code=SEGV_MAPERR, si_addr=0xa7fff804} ---\n+++ killed by SIGSEGV +++\n</code></pre>\n<p>I changed the target address to <code>0x8048000</code> (got with <code>vmmap</code> in gdb-peda).\nNow <code>mprotect</code> does not return <code>-1</code>, but I still receive SIGSEGV:</p>\n<pre><code>(pyhton exp.py; cat) | strace ./level0\n...\nmprotect(0x8048000, 8192, PROT_READ|PROT_WRITE|PROT_EXEC) = 0\n--- SIGSEGV {si_signo=SIGSEGV, si_code=SEGV_MAPERR, si_addr=0x88048804} ---\n+++ killed by SIGSEGV +++\n</code></pre>\n<p>I have examined memory addresses, the single difference from the tutorial was that the shellcode ended up at <code>0xbfff764</code> instead of <code>0xbfff754</code>, and I adjusted the python script accordingly.</p>\n<p>I do not understand why I am getting these errors, especially because I am using a downloaded virtual machine. How can I get the shellcode run?</p>\n<p><strong>UPDATE:</strong> I do not know if it has anything to do with the problem, but if I set a target address for <code>mprotect</code> (and later I expect <code>eip</code> to point there too) to an address that is outside from the mapped address space (according to <code>gdb</code>), <code>si_addr</code> in the above error message will contain this address. But if the address belongs to the program's address space, <code>si_addr</code> will be different (and probably invalid), like above.</p>\n<p>And if I execute it in <code>gdb</code> the region is set properly executable, and even the shellcode is executed.</p>\n</div>",
    "votes": "4",
    "answers": 2,
    "views": "1k",
    "tags": [
        "linux",
        "exploit"
    ],
    "user": "robert",
    "time": "Nov 7, 2021 at 10:02",
    "comments": [
        {
            "user": "Henrik Nordvik",
            "text": "<span class=\"comment-copy\">May be late to the party, but are you mprotect-ing the whole stack? The stack grows the \"oppsite\" way, so you need to mprotect the right part of the stack. Also the stack might be a different place when running in gdb versus outside. Run without and turn on core dumping, and load the dump in gdb afterwards.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm not sure if this will help, but, if you're ever unsure whether or not shellcode is trying to run, try setting your shellcode to either \"\\xeb\\xfe\" (jmp -2) or \"\\xcc\" / \"\\xcd\\x03\" (both are int 0x03).</p>\n<p>In the first case, the program will hang till it receives a signal (like, you kill it). In the latter cases, the program will die with a debug / tracepoint. That makes it really obvious whether or not it's working (it also works super well against remote servers, assuming an infinite loop will automatically get killed, to verify whether or not your code is actually running!)</p>\n</div>",
            "votes": "1",
            "user": "Ron Bowes",
            "time": "May 17, 2017 at 21:10",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Like any development process, bugs can be quite common and understanding them might not be so easy. That's why god created debugging. You should run your exercise program under a debugger and follow through the exploitation process in order to find out what and where things go sideways.</p>\n<p>Without any additional information it's quite hard to guess what's the issue there. I suggest you post your conclusions of debugging the exploit and we can further answer your question.</p>\n</div>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Nov 9, 2021 at 9:31",
            "is_accepted": false,
            "comments": []
        }
    ]
}