{
    "title": "Get driver binary",
    "link": "https://reverseengineering.stackexchange.com/questions/13579/get-driver-binary",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am running an application that just after starting, it creates a service (process hacker tool notifies me that driver_app.sys has been created). Indeed, it says that the location of driver_app.sys is:</p>\n<blockquote>\n<p>\\??\\C:\\Windows\\system32\\Drivers\\driver_app.sys</p>\n</blockquote>\n<p>My problem is that I would like to reverse such driver, but I do not manage to find a way to get the .sys file (I cannot find it anywhere while the app is running, and when it is closed the service stops and the .sys file disappears from the list displayed by process hacker). I am just asking how to do this since I have seen some people on the Internet analyzing this kind of files.</p>\n<p>Thanks in advance.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "236",
    "tags": [
        "static-analysis",
        "driver"
    ],
    "user": "Engineer 007",
    "time": "Sep 24, 2016 at 21:03",
    "comments": [
        {
            "user": "tmr232",
            "text": "<span class=\"comment-copy\">Did you try showing hidden system files?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are some possible reasons for that behavior.</p>\n<ol>\n<li>As @tmr232 wrote you probably do not see an existing file because it is hidden. In this case enable \"show hidden files\" option in your file explorer.</li>\n<li>The file is created before the use and deleted after it. In this case I'd suggest to use one of 2 options: either try to run a script that always tries to copy this file if it exists, or try to trace the program file accesses with <a href=\"https://technet.microsoft.com/en-us/sysinternals/processmonitor\" rel=\"nofollow\">Process Monitor</a> utility from sysinternals package - this will probably show you what exactly happens with the file.</li>\n</ol>\n</div>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Sep 27, 2016 at 13:06",
            "is_accepted": false,
            "comments": [
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">OP specifically said he cannot find when the application is running, so I imagine #2 is not particularly helpful.</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">@NirIzr He says \"I cannot find it anywhere while the app is running\". As far as I understand he knows when it happens.</span>",
                    "time": null
                }
            ]
        }
    ]
}