{
    "title": "Call function of injected dll",
    "link": "https://reverseengineering.stackexchange.com/questions/13667/call-function-of-injected-dll",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am messing around with dll injections. I am able to inject a dll with an exported function into some process, but I have a question now:</p>\n<p>Is there a standard way to call the exported function of my injected dll?</p>\n<p>I can provide code if necessary.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "3k",
    "tags": [
        "dll",
        "dll-injection"
    ],
    "user": "QDA",
    "time": "Oct 8, 2016 at 12:32",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am not sure if I understood correctly, but if you mean calling the exported function from the binary which just got injected the DLL, then do this:</p>\n<pre><code>auto hLib = GetModuleHandleA(\"your_library.dll\");\nauto fn = GetProcAddress(hLib, \"exported_function_name\");\n\n// supposing your function is declared as:\n// extern \"C\" __declspec(dllexport) int __cdecl fn() { ... }\n((int(__cdecl*)(void)) fn)();\n</code></pre>\n<p>You might have to check which calling convention your compiler used for the function, though (if you didn't specify any).</p>\n<hr/>\n<p><strong>Edit</strong>: since you want to call the function from the injector rather than the injected binary, you should do something like this:</p>\n<ol>\n<li>Use <code>VirtualAllocEx</code> to alloc some bytes in the target process</li>\n<li><p>Use <code>WriteProcessMemory</code> to write shellcode on the target process</p>\n<ul>\n<li><p>You will need to write something like this:</p>\n<pre><code>mov eax, 0x0BADC0DE ; the offset of your function\ncall eax\n</code></pre></li>\n<li><p>You can use <a href=\"https://defuse.ca/online-x86-assembler.htm\" rel=\"nofollow\">this online service</a> to generate the shellcode.</p></li>\n</ul></li>\n<li><p>Use <code>CreateRemoteThread</code> to run a thread on the shellcode</p></li>\n</ol>\n<p>Also, be aware that games usually have anti-cheat systems, and they detect this kind of behaviour (it's quite common).</p>\n<hr/>\n<p>But apart from all of this: you could inject your DLL with <code>VirtualAllocEx</code> -&gt; <code>WriteProcessMemory</code> -&gt; <code>LoadLibrary</code> | <code>CreateRemoteThread</code>, and have Windows call your DLL's <code>DllMain</code> instead of you doing it yourself.</p>\n</div>",
            "votes": "0",
            "user": "Martin",
            "time": "Oct 9, 2016 at 14:33",
            "is_accepted": true,
            "comments": [
                {
                    "user": "QDA",
                    "text": "<span class=\"comment-copy\">sry for confusing you. I will explain: I am injecting my dll into the game with my exe and and want to call the exported function of my dll from my injector.  I am trying to write a bot for myself and therefore the \"gui\" needs to call the injected dll</span>",
                    "time": null
                },
                {
                    "user": "Martin",
                    "text": "<span class=\"comment-copy\">@QDA I updated my answer, please see if that's what you meant</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">if your DLLMain function contains everything that you need to do, then Martin's second suggestion is easiest.  Use VirtualAllocEx to allocate memory in the remote process, WriteProcessMemory to write the DLL filename to that buffer, then CreateRemoteThread with the address of the LoadLibrary function, and passing the address of the buffer.  Windows will create a thread which loads the DLL and runs your code.</span>",
                    "time": null
                }
            ]
        }
    ]
}