{
    "title": "What is a good Java decompiler and deobfuscator?",
    "link": "https://reverseengineering.stackexchange.com/questions/1370/what-is-a-good-java-decompiler-and-deobfuscator",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am using <a href=\"http://jd.benow.ca/\">JD-GUI</a> to decompile Java JAR files, but the problem is that it leaves many errors, such as duplicate variables which I have to fix myself and check to see if the program still works (if I fixed the errors correctly).</p>\n<p>I also tried Fernflower, but that leaves blank classes if it's missing a dependency.</p>\n<p>I'd like to know which decompiler:</p>\n<ul>\n<li>gives the least amount of errors</li>\n<li>deobfuscates the most.</li>\n</ul>\n</div>",
    "votes": "63",
    "answers": 7,
    "views": "136k",
    "tags": [
        "decompilation",
        "tools",
        "java",
        "deobfuscation",
        "jar"
    ],
    "user": null,
    "time": "Jun 20, 2020 at 1:01",
    "comments": [
        {
            "user": "Vince",
            "text": "<span class=\"comment-copy\">Just curious, what features do you expect a deobfuscator will offer? Apart from renaming the variables manually, I don't see any way to actually deobfuscate some code.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There is the open source Java decompiler, <a href=\"https://github.com/mstrobel/procyon\" rel=\"nofollow noreferrer\">Procyon</a>.</p>\n<p>I have not tested it against any obfuscated code, but I have seen it decompile many methods that JD-GUI failed to handle. Note that it's a work in progress, and I'm sure you will find plenty of code that it will fail to decompile.</p>\n</div>",
            "votes": "41",
            "user": "5 revs, 4 users 36%tylerl",
            "time": "Mar 14, 2022 at 16:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "ruffin",
                    "text": "<span class=\"comment-copy\">First, his decompiler is Procyon that you see in other answers. Secondly, though I usually balk at, \"Look at my library that does this!\" answers, that would be a mistake here. Strobel's <a href=\"https://bitbucket.org/mstrobel/procyon/wiki/Java%20Decompiler\" rel=\"nofollow noreferrer\">readme</a> that he links to, above, is worth a close read. It would have been a <i>great</i> answer itself, but is admittedly probably a bit too long for SE.</span>",
                    "time": null
                },
                {
                    "user": "YoungDinosaur",
                    "text": "<span class=\"comment-copy\">+10000 This is truly great work and it just decompiled a class that I spent hours trying to reconstruct after JD-GUI had only gotten half of it.</span>",
                    "time": null
                },
                {
                    "user": "signus",
                    "text": "<span class=\"comment-copy\">Even though I personally hate the +1 comments, I'll have to say that you've got a good project going there that helped me in a tight spot. Keep it up!</span>",
                    "time": null
                },
                {
                    "user": "Mike Strobel",
                    "text": "<span class=\"comment-copy\">@Signus Thanks, I'm glad my work proved useful to you :).</span>",
                    "time": null
                },
                {
                    "user": "Mike Strobel",
                    "text": "<span class=\"comment-copy\">@DavidGomes Ah, BitBucket finally made good on their promise to delete Mercurial repos.  Fixed.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><strong>Old and Lacking Entries</strong></p>\n<p><strong>JAD</strong>\nSome time ago, everyone’s decompiler of choice was jad. Currently, the project is dead (in addition, it wasn’t open source), but still you see a lot of people referring to it.</p>\n<p><strong>Java DeObfuscator</strong>\nAlso an older tool from fileoffset.com, but still works more or less. The interface is rather clunky to use for larger projects, but the tool is <a href=\"http://sourceforge.net/projects/jdo/\" rel=\"noreferrer\">open source</a>.</p>\n<p><strong>JODE</strong>\n<a href=\"http://jode.sourceforge.net/\" rel=\"noreferrer\">JODE</a> is a java package containing a decompiler and an optimizer for Java. This package is freely available under the GNU GPL. It hasn’t been updated for quite some time.</p>\n<p><strong>AndroChef</strong>\nProprietary tool to decompile Android programs and Java files, available <a href=\"http://www.neshkov.com/ac_decompiler.html\" rel=\"noreferrer\">here</a>. Not worth the money given the alternatives, just as <a href=\"http://www.neshkov.com/dj.html\" rel=\"noreferrer\">DJ Decompiler</a>.</p>\n<p><strong>Candle</strong>\nAn open source decompiler by Brad Davis. I’m mentioning it for completeness, but is far away from being feature complete.</p>\n<hr/>\n<p><strong>Modern Tools</strong></p>\n<p><strong>JD-Gui</strong>\nProbably one of the most widely used tools for Java decompilation, as it is easy to use and provides a graphical user interface which allows to quickly open up and inspect a class file or JAR. You can find it <a href=\"http://jd.benow.ca/\" rel=\"noreferrer\">over here</a>.</p>\n<p><strong>FernFlower</strong>\nVery new and promising analytical Java decompiler (becoming an integral part of IntelliJ 14).</p>\n<p>It’s a command line tool. This one is able to show the Unicode parameters with their full name.</p>\n<p><a href=\"https://github.com/fesh0r/fernflower\" rel=\"noreferrer\">Download from here.</a>\nIt’s a command line tool. This one is able to show the Unicode parameters with their full name.<br>\nNote that it's also already integrated by default in IntelliJ.</br></p>\n<p><strong>CFR</strong></p>\n<p><a href=\"http://www.benf.org/other/cfr/\" rel=\"noreferrer\">Free, and open source</a>. This one aims to decompile modern Java features, including Java 12 switch expressions, Java 8 lambdas (pre and post Java beta 103 changes), Java 7 String switches etc., though is itself written in Java 6.</p>\n<p>Also a command line tool. This one does an even better job and is slightly faster.</p>\n<p><strong>Procyon</strong></p>\n<p><a href=\"https://bitbucket.org/mstrobel/procyon/wiki/Java%20Decompiler\" rel=\"noreferrer\">Open source</a>, and also aims to deal with Java 8 features (lambdas, :: operator). Needs Java 7 to run.</p>\n<p><strong>Krakatau</strong>\n<a href=\"https://github.com/Storyyeller/Krakatau\" rel=\"noreferrer\">Krakatau</a> is interesting because it has been written in Python. It currently contains three tools: a decompiler and disassembler for Java class files and an assembler to create class files.</p>\n<p>Does not yet support Java 8 features.</p>\n<p><strong>Soot</strong></p>\n<p>Soot is a framework for analyzing and transforming Java and Android applications, originally developed by the Sable Research Group of McGill University. It’s not very commonly used “just” as a decompiler, as it also defines an intermediate byte code language.</p>\n<p><strong>Recaf</strong></p>\n<p>A Java Bytecode editor and reverse engineering tool aimed at being intuitive to use. It can present bytecode through multiple decompilers <em>(CFR, FernFlower, Procyon)</em> or in a table layout to allow displaying class elements that are indecipherable in standard decompilers. Recaf uses context-sensitive menus to interact with classes, methods, and fields, allowing users to search for use cases, rename items, and edit definitions in a disassembled format.</p>\n<p>It supports jars, wars, classes, and extracting classes from running Java processes.</p>\n<p>It is written completely in Java and is fully <a href=\"https://github.com/Col-E/Recaf\" rel=\"noreferrer\">open source</a>.</p>\n<p><strong>Konloch’s Bytecode Viewer</strong></p>\n<p>An Advanced Lightweight Java Bytecode Viewer, GUI Java Decompiler, GUI Bytecode Editor, GUI Smali, GUI Baksmali, GUI APK Editor, GUI Dex Editor, GUI APK Decompiler, GUI DEX Decompiler, GUI Procyon Java Decompiler, GUI Krakatau, GUI CFR Java Decompiler, GUI FernFlower Java Decompiler, GUI DEX2Jar, GUI Jar2DEX, GUI Jar-Jar, Hex Viewer, Code Searcher, Debugger and more.</p>\n<p>Written completely in Java, and it’s <a href=\"https://github.com/Konloch/bytecode-viewer\" rel=\"noreferrer\">open source</a>.</p>\n<p>It uses FernFlower, Procyon and CFR for decompilation, makes this an awesome visual tool using state-of-art decompilers:</p>\n<p><strong>Enigma</strong></p>\n<p><a href=\"http://www.cuchazinteractive.com/enigma/\" rel=\"noreferrer\">A tool specifically geared for deobfuscation</a>:</p>\n<p>Originally used to deobfuscate Minecraft versions. Uses Procyon internally.</p>\n<p>A more up to date fork <a href=\"https://github.com/FabricMC/Enigma\" rel=\"noreferrer\">can be found here</a></p>\n<p><em>It’s fun to note that a lot of effort into decompilers and de-obfuscators for Java is the result of the modding scene around Minecraft, one of the most popular games implemented in Java.</em></p>\n<p>Source: <a href=\"http://blog.macuyiko.com/post/2015/a-quick-look-at-java-decompilers.html\" rel=\"noreferrer\">http://blog.macuyiko.com/post/2015/a-quick-look-at-java-decompilers.html</a></p>\n</div>",
            "votes": "19",
            "user": "4 revs, 3 users 73%Alexandre Dumont",
            "time": "Aug 20, 2020 at 10:43",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Gordolio",
                    "text": "<span class=\"comment-copy\">This answer may need to be updated. It appears that JD-Gui is being actively developed as of March 2019. <a href=\"https://java-decompiler.github.io/\" rel=\"nofollow noreferrer\">java-decompiler.github.io</a></span>",
                    "time": null
                },
                {
                    "user": "Gordolio",
                    "text": "<span class=\"comment-copy\">I have some java 7 code that I'm attempting to write some aspects for. The built-in intellij decompiler in some cases has incorrect variable names and can leave out blocks of code. JD-Gui shows those blocks and also displays what appears to be more accurate variable names. It also shows side-by-side the differences between an old version and new version of JD-Gui. It's worth looking at if you're doing some serious reversing.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I can't speak to which one of these is the best, but there are a few java decompilers out there as indicated by this <a href=\"https://stackoverflow.com/questions/671394/where-can-i-find-a-java-decompiler\">SO question</a>. None of these decompilers appear to attempt to actively handle obfuscation though and many of those projects are abandoned.</p>\n<p>I have not tried <a href=\"https://github.com/Storyyeller/Krakatau/\" rel=\"nofollow noreferrer\">Krakatau</a>, but it sounds like it may help with what you are looking for.</p>\n<ul>\n<li>From the readme: \"The Krakatau decompiler takes a different approach to most Java decompilers.\nIt can be thought of more as a compiler whose input language is Java bytecode\nand whose target language happens to be Java source code. Krakatau takes in \narbitrary bytecode, and attempts to transform it to equivalent Java code. This\nmakes it robust to minor obfuscation, though it has the drawback of not\nreconstructing the \"original\" source, leading to less readable output than a \npattern matching decompiler would produce for unobfuscated Java classes.\"</li>\n<li>This is open source and appears to be actively (as of this writing) maintained.</li>\n</ul>\n</div>",
            "votes": "10",
            "user": "5 revs, 3 users 72%amccormack",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Antimony",
                    "text": "<span class=\"comment-copy\">That is actually the output of the disassembler. The decompiler decompiles to Java output. (P.S. I'm the developer)</span>",
                    "time": null
                },
                {
                    "user": "SSpoke",
                    "text": "<span class=\"comment-copy\">JD-GUI is one of the best Java Decompilers at the moment, But it has to be used in conjunctive with deobfuscators on the Bytecode before decompiling the code. The best deobfuscators for java that I know of come from either <a href=\"http://www.rune-server.org\" rel=\"nofollow noreferrer\">rune-server.org</a> or <a href=\"http://www.moparscape.org/smf\" rel=\"nofollow noreferrer\">moparscape.org/smf</a> or <a href=\"http://www.moparisthebest.org/smf\" rel=\"nofollow noreferrer\">moparisthebest.org/smf</a> those are hacking communities for Runescape Game which is completely written in Java and highly obfuscated.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Try taking a look at Bytecode Viewer <a href=\"https://github.com/Konloch/bytecode-viewer\" rel=\"nofollow\" title=\"https://github.com/Konloch/bytecode-viewer\">https://github.com/Konloch/bytecode-viewer</a> It has the option to decompile using 5 different decompilers:</p>\n<ul>\n<li>FernFlower</li>\n<li>Procyon</li>\n<li>CFR</li>\n<li>Krakatau</li>\n<li>JD-GUI</li>\n</ul>\n</div>",
            "votes": "5",
            "user": "3 revsKonloch",
            "time": "Aug 3, 2015 at 7:03",
            "is_accepted": false,
            "comments": [
                {
                    "user": "nmu",
                    "text": "<span class=\"comment-copy\">This was a really good suggestion - thanks, way better than just using the fernflower cli!</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First of all, there is a fix for Fernflower issue with missing classes <a href=\"https://gist.github.com/agaricusb/4575843\" rel=\"nofollow\">here</a>. You can say thank you to agaricusb for this.</p>\n<p>For now Fernflower remains the best Java decompiler even It was not maintained for last few years. I've tried to reach the author recently, but still no luck.</p>\n<p>As for AndroChef Java Decompiler, It's uses Fernflower as engine with author's permission. Still not sure If it uses patched/modified version or It's just a GUI.</p>\n<p>Procyon decompiler developed by @mike-strobel seem to be good, but Fernflower still got a HUGE advantage and was able to decompile approximately 95% of my application (~3000 classes) while procyon was able to handle only 60% (checked in January of 2014).</p>\n</div>",
            "votes": "3",
            "user": "Vladimir Protasov",
            "time": "Mar 3, 2014 at 20:10",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Mike Strobel",
                    "text": "<span class=\"comment-copy\">Is your application \"native\" Java, or was it converted from Android format?  If the former, I would be very interested in getting my hands on your binaries to see where Procyon breaks down compared to Fernflower.</span>",
                    "time": null
                },
                {
                    "user": "Vladimir Protasov",
                    "text": "<span class=\"comment-copy\">@MikeStrobel It's \"native\" Java application. It's internal use only, so I can't share It anyways.</span>",
                    "time": null
                },
                {
                    "user": "Mike Strobel",
                    "text": "<span class=\"comment-copy\">any chance you could drop me an email describing what kinds of problems you ran into?  I am always keen to hear how Procyon could be improved.  My contact info is on the project's BitBucket site.</span>",
                    "time": null
                },
                {
                    "user": "Vladimir Protasov",
                    "text": "<span class=\"comment-copy\">@MikeStrobel thanks for the interest. I'll try to provide you with extended information and example classes, but no promises.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm using <a href=\"https://github.com/JetBrains/intellij-community/tree/master/plugins/java-decompiler/engine\" rel=\"nofollow noreferrer\">https://github.com/JetBrains/intellij-community/tree/master/plugins/java-decompiler/engine</a>\nIt's the decompiler from IntelliJ, it decompile codes where JD-GUI fail.</p>\n<p>It's a unofficial mirror to download:\n<a href=\"http://files.minecraftforge.net/maven/net/minecraftforge/fernflower/\" rel=\"nofollow noreferrer\">http://files.minecraftforge.net/maven/net/minecraftforge/fernflower/</a></p>\n</div>",
            "votes": "3",
            "user": "David Kennedy",
            "time": "Jun 29, 2018 at 15:24",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I would like to reccomend you <a href=\"http://www.neshkov.com/ac_decompiler.html\" rel=\"nofollow\">AndroChef Java Decompiler</a>\nAndroChef Java Decompiler successfully decompiles obfuscated Java 6 and Java 7 .class and .jar files. </p>\n</div>",
            "votes": "1",
            "user": "Atanas",
            "time": "Oct 27, 2013 at 11:15",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user3173",
                    "text": "<span class=\"comment-copy\">PAY ATTENTION WITH ANDROCHEF! AndroChef is only a wrapper for the abandoned fernflower decompiler, don't waste your money with it!</span>",
                    "time": null
                }
            ]
        }
    ]
}