{
    "title": "What does arg_0 = dword ptr 4 mean?",
    "link": "https://reverseengineering.stackexchange.com/questions/13737/what-does-arg-0-dword-ptr-4-mean",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I try to use IDA dissembler and I don't really understand the following text paragraphs appearing at the head of functions:</p>\n<pre><code>arg_0 = dword ptr 4\n</code></pre>\n<p>Can anyone explain their meaning?</p>\n</div>",
    "votes": "6",
    "answers": 1,
    "views": "8k",
    "tags": [
        "ida",
        "x86"
    ],
    "user": "QChí Nguyễn",
    "time": "Oct 16, 2016 at 17:40",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>That's not a command, and not really part of the assembly language.\nIDA uses those markers to ease the reading of assembly instructions relating to the stack.</p>\n<p>Once IDA detects an offset would point into the function's stack as either an internal variable or an argument, it'll assign a name to the specific stack offsets each parameter and/or argument points to from the base of the stack.</p>\n<p>It then calculates all offsets to the same position regardless of stack growth/shrinking and will use the stack offset names where-ever they're possible.</p>\n<p>The syntax is the following:</p>\n<pre><code>&lt;argument/variable name&gt; = &lt;size&gt; ptr &lt;offset from stack base&gt;\n</code></pre>\n<p>So in your example, IDA identified the first argument to the function and named it <code>arg_0</code> (you can change the name by pressing <kbd>n</kbd> when your cursor is on it). The argument is a dword and the function's base stack offset is 4.</p>\n<p>Because the offset is positive IDA identified the stack address as an argument. Negative offsets will be recognized as variables and will have the <code>var_</code> prefix instead.</p>\n</div>",
            "votes": "4",
            "user": "NirIzr",
            "time": "Oct 16, 2016 at 17:30",
            "is_accepted": true,
            "comments": []
        }
    ]
}