{
    "title": "How do I identify and use JTAG?",
    "link": "https://reverseengineering.stackexchange.com/questions/1374/how-do-i-identify-and-use-jtag",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm a software guy through and through.  But periodically when I'm taking apart hardware I know to look for JTAG ports and RS232 ports.  So far I've always been lucky and have been able to solder on pins to the RS232 port and get a serial connection.</p>\n<p>For the times in the future that I am unlucky, can someone explain to me what JTAG is (i.e. is there only one type of JTAG and I can expect to hook it up to a single type of port, like a DB-9 for serial?) and how I would go about using it to dump firmware off an embedded system or is it all manufacturer specific?</p>\n</div>",
    "votes": "33",
    "answers": 4,
    "views": "34k",
    "tags": [
        "hardware",
        "jtag"
    ],
    "user": "mrduclaw",
    "time": "Jun 19, 2013 at 14:05",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are a few JTAG connectors available, so it's hard to tell which one, and how the pins are positioned.</p>\n<p>I suggest you take a magnifying glass and read the microcontroller model.  With the model you will be able to find the datasheet on the Internet.\nTake a look at the PIN out of the microcontroller, and see how many JTAG outputs it has. Some newer chips have trace outputs, some don't. This can really narrow down your options.</p>\n<p>You might want to take a look <a href=\"https://web.archive.org/web/20200128215316/http://support.code-red-tech.com/CodeRedWiki/HardwareDebugConnections\" rel=\"nofollow noreferrer\">here</a>, for a a quick look on various JTAG connectors.</p>\n<p>Another thing worth mentioning, various microcontroller, have a specific bit, that when it set, the JTAG connectors are disabled. This is done on release, to make sure that no one tries to steal the firmware or to debug the system.\nThe only way to enable the JTAG again is to hard reset the microcontroller. This will cause complete reset of the internal flash, so all the firmware will be lost...</p>\n</div>",
            "votes": "24",
            "user": "Bill B",
            "time": "Mar 31, 2022 at 8:57",
            "is_accepted": true,
            "comments": [
                {
                    "user": "ixje",
                    "text": "<span class=\"comment-copy\">I would just like to add that in my experience (high-end devices) more often than not hard resetting doesn't work for enabling the JTAG. These interfaces are often permanently locked by blowing a fuse. In the other cases they're password protected by 64-bit keys with significant delays (milliseconds up to a second) between possible unlock attempts. Just to make sure you don't even want to think about brute-forcing them with a farm of devices. And to fool you a bit they also sometimes like to give you 1 unlock attempt and then silently ignore the reset until a cold reset.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>JTAG was initially created to test/verify hardware devices. The process is called boundary scanning and JTAG was named after the working group: <b>J</b>oint <b>T</b>est <b>A</b>ction <b>G</b>roup, some time in the 1980s.</p>\n<p>The idea was to define an interface that could be used to test hardware (micro controllers and connected peripherals after manufacturing). I.e. after development of the hardware and subsequent production of it.</p>\n<p>The devices used to do the boundary scan according to JTAG are called <strong>JTAG probes</strong>. They used to be connected to the parallel port of your machine, but these days are more often connected via USB and based on one of the FTDI chips.</p>\n<p>On a PCB the chip(s) and peripherals form a \"daisy chain\" connected to the TAP (test access port). So you can test the various components through one port. The instruction <code>BYPASS</code> is used to tell a device earlier on the chain to ignore your commands and pass them on. <code>IDCODE</code> is used to identify the device and a few basic characteristics.</p>\n<p>A neat overview of some technical details can be found here: <a href=\"http://www.xjtag.com/support-jtag/jtag-technical-guide.php\" rel=\"noreferrer\">JTAG - A technical overview</a>, but the <a href=\"http://en.wikipedia.org/wiki/Joint_Test_Action_Group\" rel=\"noreferrer\">Wikipedia article and its reference list</a> also provide valuable information. Keep in mind that this was established before the WWW came to be and that a lot of information regarding it has been banned onto dead trees.</p>\n<p>The term <strong>boundary scan</strong> is still used to describe the process and makes up part of the acronym BSDL (<a href=\"http://en.wikipedia.org/wiki/Boundary_scan_description_language\" rel=\"noreferrer\">boundary scan description language</a>), which you would normally get in touch with if you were to boundary scan a device/chip and the vendor expected you to do that. Otherwise they tend to be pretty secretive about it. The reason for the secrecy being that they essentially give away a part of their hardware design, which most of these hardware vendors consider a trade secet. I've had the luck to get access to the BSDL file, under NDA, even though it wasn't for the exact silicon revision I was debugging. But I was assured that the BSDL file would work just fine with the silicon revision of the chip I had. But unless you can afford to destroy your hardware, you <strong>have to make sure that your BSDL data matches the hardware you connect to</strong>.</p>\n<p>These days JTAG isn't just used for <em>testing</em> only, though. Of course hardware-debugging is a subset of testing, so this is not what I mean. What I mean is that JTAG probes also allow you to flash firmware on otherwise defunct hardware. And that is <strong><em>essential</em> in debricking bricked hardware</strong>.</p>\n<h1>Possible problems</h1>\n<p>There are several problems in using JTAG which you have to overcome <em>aside</em> from identifying the connectors. And I'll ignore the bit <a href=\"https://reverseengineering.stackexchange.com/a/1382/245\">Mellowcandle mentioned in his answer</a>.</p>\n<p>You have to be confident that you got things right, because otherwise you can fry your hardware instead of, for example, debricking it.</p>\n<h2>Identify the JTAG pins</h2>\n<p>Often you'll find TMS, TCK, TDI and so on inscribed on your PCB, so you know you're dealing with a device that supports JTAG. Magnifying glasses may be of help ;)</p>\n<p>But this isn't really an arcane art - it gets more difficult when the pins aren't labeled and you need to rely on third-party documentation.</p>\n<p>Of course it is also possible that your board has a <strong>JTAG header</strong> instead of mere pins/contacts.</p>\n<h2>Identify the micro controller</h2>\n<p>Yes, indeed you need to <em>identify</em> the kind of chip you have before you and find out what voltage it expects, because otherwise <em>you can fry your chip or your JTAG probe or both</em>.</p>\n<p>If you happen to be lucky, you have a JTAG header on your device which helps you find out what it is and implicitly what voltage it expects and so on. There are quasi-standards for ARM and MIPS to my knowledge. Refer to Mellowcandle's answer for the former and to <a href=\"http://www.jtagtest.com/pinouts/ejtag\" rel=\"noreferrer\">this</a> and <a href=\"http://www.linux-mips.org/wiki/JTAG\" rel=\"noreferrer\">this</a> for the latter.</p>\n<p>Use any and all available documentation you can find to verify any assumptions you make. DSL routers often have MIPS CPUs in them, but ARM are also common and possibly others, too. Projects such as <a href=\"http://wiki.openwrt.org/toh/\" rel=\"noreferrer\">OpenWRT have a wealth of information available about hardware</a>, even hardware not supported directly by them.</p>\n<h2>The JTAG probes</h2>\n<p>Usually the hardware vendors will claim that they support the McCraigor Wiggler or some other hideously expensive JTAG probe. What this means is that you are on your own if you don't use an \"unsupported\" (by the vendor) JTAG probe! It doesn't mean it won't work, but it means you have to be damn sure about what you are doing (voltage, JTAG commands you send and such).</p>\n<h1>Tools</h1>\n<h2>FLOSS to use JTAG</h2>\n<ul>\n<li><a href=\"http://urjtag.org/\" rel=\"noreferrer\">UrJTAG</a></li>\n<li><a href=\"http://openocd.sourceforge.net/\" rel=\"noreferrer\">OpenOCD</a> (OCD stands for on-chip debugger)</li>\n</ul>\n<p>GDB (<a class=\"post-tag\" href=\"/questions/tagged/gdb\" rel=\"tag\" title=\"show questions tagged 'gdb'\">gdb</a>) can be used in conjunction with these in some scenarios (e.g. <a href=\"http://openocd.sourceforge.net/doc/html/GDB-and-OpenOCD.html\" rel=\"noreferrer\">OpenOCD</a>).</p>\n<h2>\"Cheap\" JTAG probes</h2>\n<p><strong>Note:</strong> sometimes you will hear the terms debugger or emulator for the JTAG probes themselves.</p>\n<ul>\n<li>AVR JTAGICE, Atmel - if you are using AVR controllers these are the probes of choice</li>\n<li>JTAGkey2 and friends, Amontec</li>\n<li>PicoTAP, Gopel - the PicoTAP was also given away for free some time ago in a learning kit (with CD and such)</li>\n<li>several cheap JTAG solutions exist from Olimex (in particular useful if you go with OpenOCD)</li>\n<li><a href=\"http://dangerousprototypes.com/docs/Bus_Blaster\" rel=\"noreferrer\">BusBlaster</a> by Dangerous Prototypes</li>\n<li>Last but not least: if you are into soldering: <a href=\"http://en.wikipedia.org/wiki/Open_JTAG\" rel=\"noreferrer\">OpenJTAG</a></li>\n</ul>\n</div>",
            "votes": "21",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>For figuring out JTAG pinout, there are many hits on google for \"JTAG Finder\". I also have my own implementation:</p>\n<p><a href=\"http://mbed.org/users/igorsk/code/JTAG_Search/\" rel=\"noreferrer\">http://mbed.org/users/igorsk/code/JTAG_Search/</a></p>\n<p>It's for mbed but I tried to make it easily portable (original version was for a Stellaris board).</p>\n<p>Here's a quote from the comment which describes the basic approach:</p>\n<pre><code> The overall idea:\n 1) choose any 2 pins as TMS and TCK\n 2) using them, reset TAP and then shift DR, while observing the state of all other pins\n 3) for every pin that received anything like a TAP ID (i.e. bit 0 is 1):\n 4)   using the pin as TDI, feed in a known pattern into the TAP\n 5)   keep shifting and monitor the rest of the pins\n 6)   if any of the remaining pins received the pattern, it is TDO\n</code></pre>\n</div>",
            "votes": "8",
            "user": "Igor Skochinsky",
            "time": "Jun 19, 2013 at 16:35",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"https://www.youtube.com/watch?v=z6--A79RlaU\" rel=\"noreferrer\">I created a video how I identified a possible JTAG connection with a multimeter.</a> Here is a picture showing which pins are connected and it matches with a standard JTAG pinout for <em>VCC</em> and <em>GND</em>. This is an indication that it could be JTAG, though it doesn't have to be.</p>\n<p><img alt=\"example JTAG connector\" src=\"https://i.sstatic.net/19iJi.png\"/></p>\n</div>",
            "votes": "7",
            "user": "samuirai",
            "time": "Jun 19, 2013 at 17:01",
            "is_accepted": false,
            "comments": []
        }
    ]
}