{
    "title": "IDA pro can not resolved section after unpacking procedure",
    "link": "https://reverseengineering.stackexchange.com/questions/13764/ida-pro-can-not-resolved-section-after-unpacking-procedure",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I had a sample which was packed by a packer and I unpacked it using OllyDbg but after unpacking still IDA can not resolve the section and show most of instructions as <code>DD</code>.</p>\n<p>Is this sample still packed maybe for second round? and how can I resolve sections in IDA pro?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "155",
    "tags": [
        "ida",
        "ollydbg",
        "malware",
        "unpacking"
    ],
    "user": "user2091416",
    "time": "Oct 20, 2016 at 0:39",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You either incorrectly dumped the unpacked PE, or incompletely unpacked as you suggested.</p>\n<p>Using ollydbg plugins like <a href=\"https://low-priority.appspot.com/ollydumpex/\" rel=\"nofollow\">OllyDumpEx</a> you can fine-tune the resulting dump. It is crucial to find the original entry point and make sure all relevant code is properly unpacked before performing the dump. </p>\n<p>You can easily tell if you successfully dumped a region by looking at it. If you can see reasonable and logical assembly in olly after you unpacked, you can be pretty sure that region is unpacked. You should make sure the entire PE is unpacked before dumping.</p>\n<p>If you're convinced you successfully unpacked the PE, you should make sure OllyDumpEx (or similar) plugin's configuration is set correctly. You can get invalid PEs when dumping with incorrect values. Most dumping utilities have tutorials that go over all of the plugin's configuration parameters to make sure you're using them correctly.</p>\n<p>Attempting to tackle tutorials and crackmes, specifically ones with available solutions is a good way to learn how to use the more advanced features of most dumping utilities.</p>\n</div>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Oct 20, 2016 at 0:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}