{
    "title": "Dylib can run without code sign in iOS?",
    "link": "https://reverseengineering.stackexchange.com/questions/13776/dylib-can-run-without-code-sign-in-ios",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I learn from somewhere <code>dylib</code> should be signed in iOS, otherwise <code>dyld</code> will refuse to execute it.</p>\n<p>But when I test the <a href=\"https://github.com/ddeville/Dynamic-iOS\" rel=\"nofollow\">example</a> of <a href=\"http://ddeville.me/2014/04/dynamic-linking\" rel=\"nofollow\">this post</a>. The <code>dylib</code> is not signed by default in this project, but it just running well when try to open it. I have verified the <code>dylib</code>'s binary doesn't contain <code>lc_code_signature</code>.</p>\n<p>Anyone can explain this? </p>\n<hr/>\n<p>I test on a jailbreak device with 3 cases for a <code>dylib</code> without <code>lc_code_signature</code>. </p>\n<ol>\n<li>Dynamic linked with the binary, so the <code>dylib</code> is list in <code>LOAD COMMAND</code>.</li>\n<li>Copy to the main bundle, and <code>dlopen</code> it.</li>\n<li>Copy to the <code>Document</code> dir and open it.</li>\n</ol>\n<p>They all succeed.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "5k",
    "tags": [
        "ios",
        "dynamic-linking"
    ],
    "user": "Karl",
    "time": "Oct 24, 2016 at 8:35",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">well, jailbreaks usually disable signature checking completely so no wonder it works.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><strong>EDIT</strong>: The below applies only to non-jailbroken devices. Jailbreaks usually disable signature checking completely to allow unsigned homebrew software to run.</p>\n<hr/>\n<p>Apparently only libraries which are listed as dependencies of the executable in the header (<code>LC_LOAD_DYLIB</code> and similar commands) are checked, and those loaded with <code>dlopen</code> are not.</p>\n<p>This is mentioned indirectly in the <a href=\"https://developer.apple.com/library/content/documentation/Security/Conceptual/CodeSigningGuide/Procedures/Procedures.html\" rel=\"nofollow noreferrer\">Code Signing Guide</a>:</p>\n<blockquote>\n<p>As with other Gatekeeper functions, this check is performed the first\n  time the app is run. It does not apply to libraries that the app loads\n  itself using the <code>dlopen</code> function, although those libraries are still\n  potentially subject to library validation, as described in Using\n  Library Validation.</p>\n</blockquote>\n<p>Following the link, we see this passage:</p>\n<blockquote>\n<p>Starting in iOS 8 and macOS 10.10, the system offers library\n  validation as a policy for the dynamic libraries that a process links\n  against. </p>\n<p>The policy is simple: A program may link against any library\n  with the same team identifier in its code signature as the main\n  executable, or with any Apple system library. Requests to link against\n  other libraries are denied. </p>\n<p>In iOS, an Apple system library is a\n  library that Apple mastered into the OS image. In macOS, an Apple\n  system library is a library shipped in /System/Library. The team\n  identifier is the 10-character alphanumeric string, such as\n  YH9SZ5LKR4, associated with your developer account, and recorded in\n  your Apple-issued signing certificate. \n  In iOS, library validation is\n  <strong>always enabled</strong> for all apps. There is nothing you need to do to opt\n  in.</p>\n</blockquote>\n<p>So it would seem that <code>dlopen</code> <em>should not</em> be able to load unsigned libraries in iOS 8 and higher, though I have not checked this.</p>\n</div>",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Nov 23, 2016 at 19:08",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Karl",
                    "text": "<span class=\"comment-copy\">Thanks for you detail explain. I use iOS9 to test, and still can load unsigned binary.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@Karl: and you're not using a jailbroken device? In that case it seems either the doc is wrong, or there is a bug.</span>",
                    "time": null
                }
            ]
        }
    ]
}