{
    "title": "Good foundation for reverse engineering malware",
    "link": "https://reverseengineering.stackexchange.com/questions/13829/good-foundation-for-reverse-engineering-malware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have been intrigued by reverse engineering recently and just finished Paul Carter's <em>PC Assembly Language</em> book (<a href=\"http://pacman128.github.io/static/pcasm-book.pdf\" rel=\"nofollow\">http://pacman128.github.io/static/pcasm-book.pdf</a>) which was a great primer for x86. My first question is: What is a good intermediate level book to get a better grasp of x86 assembly? Secondly: Should I get a better grasp of the C programming language before I dive deeper into x86? At the moment I only have basic knowledge of C as well.</p>\n<p>Sorry if this is an opinion type question but I highly respect the input of people on this forum regarding this topic.</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "1k",
    "tags": [
        "disassembly",
        "assembly",
        "x86",
        "malware",
        "c"
    ],
    "user": "Nitro",
    "time": "Oct 4, 2018 at 4:24",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Knowing how things in C work under the hood will help you if you're familiar with C and use it as your primary programming language, otherwise it's perfectly fine to have x86 asm as your first programing language.</p>\n<p>If you want a better understanding of the relationship between C and x86 assembly, I recommend reading the 7th chapter of <a href=\"http://rads.stackoverflow.com/amzn/click/1931769222\" rel=\"nofollow noreferrer\">Hacker disassembling uncovered</a> (there's a free chm version online).</p>\n<p>As a reverse engineer you'll need to understand and be fluent with machine code. Knowing C might help because it's relatively low level and forces you to understand machine level concepts such as the stack, pointers, etc. Good grasp of assembly is far more important.</p>\n<p>The best way is probably to go to <a href=\"http://crackmes.de/\" rel=\"nofollow noreferrer\">crackmes.de</a> and other similar sites and starting solving challenges. some challenges there are very novice and some are extremely difficult to solve. Focus on the type of RE that interests you (malware, keygen/cracking, crypto, trainers/mods, complex programs) and once you gained enough experience get something real to work on, even just to take it up as a challenge.</p>\n<p><strong>EDIT</strong>: <a href=\"http://crackmes.de/\" rel=\"nofollow noreferrer\">crackmes.de</a> was taken down some time ago, another decent resource is <a href=\"https://tuts4you.com/download.php\" rel=\"nofollow noreferrer\">tuts4you.com's download section</a>.</p>\n</div>",
            "votes": "6",
            "user": "NirIzr",
            "time": "May 4, 2017 at 15:13",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Nitro",
                    "text": "<span class=\"comment-copy\">Thanks! The 1st programming class I ever took was intro to C++ 5 years ago. I still remember a fair bit but picked up python shortly after and have been using that ever since. It just seems like everywhere I look people rant and rave about C when it comes to this field. Wasn't sure If a lack of C knowledge would leave me with a gaping whole in my understanding of this subject.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">See new 3rd paragraph</span>",
                    "time": null
                },
                {
                    "user": "Nitro",
                    "text": "<span class=\"comment-copy\">Thanks again, by the way Kaspersky is a great writer. Very pleased with that book so far. 1st edition seems much better than the 2nd.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Yes, Kris Kaspersky was a good writer. unfortunately he recently died in an accident, may he rest in peace.</span>",
                    "time": null
                },
                {
                    "user": "julian",
                    "text": "<span class=\"comment-copy\">crackmes.de has been reincarnated as <a href=\"https://crackmes.one\" rel=\"nofollow noreferrer\">crackmes.one</a>. See <a href=\"https://reverseengineering.stackexchange.com/questions/15774/crack-me-material\">Crack Me Material</a> for more.</span>",
                    "time": null
                }
            ]
        }
    ]
}