{
    "title": "Is there a tool for proxying a dll that doesn't require IDA Pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/13858/is-there-a-tool-for-proxying-a-dll-that-doesnt-require-ida-pro",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I found a github project that compiled cleanly on the first try (might be the first ever for me, yay!). No instructions, so I stumble around for a bit until I find an awful Youtube video... everything's going good, until I hit the two minute mark, and then it has a section titled \"Open in IDA Pro 64\".</p>\n<p>I took a look at their website... $589 and up. It's sort of over-the-budget given the nature of this personal project.</p>\n<p>Is there a dll proxy tool/system that would just write out the calls/args to a log file or something of that nature?</p>\n</div>",
    "votes": "4",
    "answers": 2,
    "views": "718",
    "tags": [
        "ida",
        "windows",
        "tools",
        "dll"
    ],
    "user": "John O",
    "time": "Nov 4, 2016 at 4:38",
    "comments": [
        {
            "user": "Willem Hengeveld",
            "text": "<span class=\"comment-copy\">Maybe you should first tell us what project it is you are talking about?</span>",
            "time": null
        },
        {
            "user": "John O",
            "text": "<span class=\"comment-copy\">@WillemHengeveld I have a personal project that involves proxying a single windows dll. Given the legal nature of the DMCA, practically any interesting question I could ask here is violating some law or another, and I'm hesitant to give spurious details that don't much change any of the answers you might give. If that's wrong of me, what sort of details might you like me to provide?</span>",
            "time": null
        },
        {
            "user": "Willem Hengeveld",
            "text": "<span class=\"comment-copy\">I mean what is that github project you are talking about.</span>",
            "time": null
        },
        {
            "user": "John O",
            "text": "<span class=\"comment-copy\"><a href=\"https://github.com/zeroKilo/ProxyDllMaker\" rel=\"nofollow noreferrer\">github.com/zeroKilo/ProxyDllMaker</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Looks like you're looking for an API monitoring tool. There are plenty of those, including my personal favorite being <a href=\"http://www.rohitab.com/apimonitor\" rel=\"nofollow noreferrer\">Rohitab's API Monitor</a>.</p>\n<p>An API monitoring tool will record all API calls performed by a process, thier parameters and return values. Features depend on the specific tool but Rohitab's is really complete (and free). Googling for API monitoring tools will provide other good results.  </p>\n<p>Additionally, IDA has both a limited demo version and an old freeware version. One of those is ought to be enough for what you seem to be looking for.</p>\n</div>",
            "votes": "2",
            "user": "NirIzr",
            "time": "Nov 4, 2016 at 4:33",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Dominik Antal",
                    "text": "<span class=\"comment-copy\">Alternatively, you could try <a href=\"http://jacquelin.potier.free.fr/winapioverride32/\" rel=\"nofollow noreferrer\">WinAPIOverride</a>.</span>",
                    "time": null
                },
                {
                    "user": "John O",
                    "text": "<span class=\"comment-copy\">This is a Safedisc protected product (though, interestingly, not a video game). Supposedly it has anti-IDA features. I've tried API Monitor, and while it recognizes that the program has started and asks if I want to monitor it, it never shows the dll as having been used/invoked. I'm not sure if I'm not using it correctly, or if it's got anti-debugging magic.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">APIMonitor has multiple monitoring techniques. I often find that when one falls other succeed but if the program is protected you should remove the protections before doing anything else imo</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This project here generates Visual Studio code for building plain proxy dlls:</p>\n<p><a href=\"https://github.com/mavenlin/Dll_Wrapper_Gen\" rel=\"nofollow noreferrer\">https://github.com/mavenlin/Dll_Wrapper_Gen</a></p>\n<p>It's based off an older project called \"wrapit\", which also generates VS code, but takes a little more work:</p>\n<p><a href=\"http://www.codeproject.com/Articles/16541/Create-your-Proxy-DLLs-automatically\" rel=\"nofollow noreferrer\">http://www.codeproject.com/Articles/16541/Create-your-Proxy-DLLs-automatically</a></p>\n<p>I've had some luck with both, they generate valid code that I can build DLLs with. As these are native, functioning DLLs, they should avoid any trouble with anti-debugger code that detects a debugging process hooking in (though, there are conceivably counter-measures that could defeat this attempt too).</p>\n</div>",
            "votes": "1",
            "user": "John O",
            "time": "Nov 9, 2016 at 16:06",
            "is_accepted": false,
            "comments": []
        }
    ]
}