{
    "title": "How to view system files on Windows Phone",
    "link": "https://reverseengineering.stackexchange.com/questions/13926/how-to-view-system-files-on-windows-phone",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is there a way one can actually view system files and even apps on file manager of a windows phone the way we do with Android phones. I would love to do this so much on my Nokia Lumia 435 running on Windows 8.1. Reason I want to view where Opera mini hides its downloads. Imagine when I download files on Opera Mini and later try to move them to \"Downloads\" folder they become get there when their size is 0kb </p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "windowsphone"
    ],
    "user": "Jack Siro",
    "time": "Nov 14, 2016 at 14:57",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First of all I think you may have to force an upgrade of the Windows to Windows 10 using an app called Upgrade Advisor. The Upgrade is like 1.4 GB so you will need to do that on WiFi.</p>\n<p>After upgrading you see new apps on your phone like \"File Explorer\" We will use it but later. </p>\n<p>First of all <strong>using a Windows PC we will create a shortcut</strong> from the computer and copy it to the phone to use it later.</p>\n<p>1 - In your Windows PC, create a shortcut to the C: drive anywhere:\n<a href=\"https://i.sstatic.net/6AnjH.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/6AnjH.png\"/></a></p>\n<p>2 - Copy that shortcut to the phone's storage root:</p>\n<p>3 - In the phone, open \"File Explorer\" app, and from the hamburger menu, choose \"This Device\". You should see the shortcut there:</p>\n<p><a href=\"https://i.sstatic.net/czvgy.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/czvgy.png\"/></a></p>\n<p>4 - Click on the shortcut, and you're done.You will then be taken to the root of C: drive:</p>\n<p>Now if want to browse to Opera Mini folder try this tip got to applications folders are located at C:\\Data\\PROGRAMS</p>\n</div>",
            "votes": "1",
            "user": "Jack Siro",
            "time": "Nov 21, 2016 at 9:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jack Siro",
                    "text": "<span class=\"comment-copy\">I am thankful for your answer its much closer to what I wanted to do initially. Am almost there</span>",
                    "time": null
                },
                {
                    "user": "Martin",
                    "text": "<span class=\"comment-copy\">I lol'd -- does this just replace a missing UI element, or is it an actual sandbox escape?</span>",
                    "time": null
                }
            ]
        }
    ]
}