{
    "title": "What are all those instructions before the initally selected instruction in OllyDbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/14012/what-are-all-those-instructions-before-the-initally-selected-instruction-in-olly",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>When I open a program in a debugger like OllyDbg or x64dbg, there are a lot of instructions before the initially selected instruction. Why does the debugger choose this instruction specifically to have it under the cursor? What is with the instructions on the list that appear before it? Were some of them executed?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ollydbg"
    ],
    "user": "Helmy",
    "time": "Nov 21, 2016 at 12:37",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Probably you are talking about the \"system breakpoint\". This is the location that the OS uses to break so the debugger can do its work. In x64dbg you can get more information by loading symbols for ntdll.dll. You will notice that the function is called <a href=\"http://blog.nandaka.io/ldrpdodebuggerbreak\" rel=\"nofollow noreferrer\">LdrpDoDebuggerBreak</a>. If you're not interested in the Windows loader you can simply disable it.</p>\n<p><img alt=\"disable system breakpoint\" src=\"https://i.sstatic.net/zHRZY.png\"/></p>\n<p>The actual exception for the system breakpoint is <code>STATUS_BREAKPOINT</code>. The <code>LdrpDoDebuggerBreak</code> uses the <code>INT3</code> instruction to throw this exception to the debugger. Basically the OS is signalling the debugger that it finished the process initialization phase and also giving the debugger a chance to modify the thread context or process memory.</p>\n<p>You can see it in the code:</p>\n<p><img alt=\"int3\" src=\"https://i.sstatic.net/ZYvLS.png\"/></p>\n</div>",
            "votes": "2",
            "user": "mrexodia",
            "time": "Nov 21, 2016 at 19:51",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Helmy",
                    "text": "<span class=\"comment-copy\">Is there some reasoning behind the location of this breakpoint? Like why in that address specifically?</span>",
                    "time": null
                },
                {
                    "user": "mrexodia",
                    "text": "<span class=\"comment-copy\">I updated the answer to hopefully address your question.</span>",
                    "time": null
                }
            ]
        }
    ]
}