{
    "title": "Serial output garbage",
    "link": "https://reverseengineering.stackexchange.com/questions/14045/serial-output-garbage",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I know you have seen this asked before but hear me out first. I have a prototype device that I am playing around with. On the main board there is a USB port, next to the port there is a FTDI FT232R chip. Next to the USB port there is a 20 pin JTAG port. I have only tried the USB port but when I try to screen the chip I just get garbage output. Now before you say baud rate, I have already tried every possible baud rate and still get garbage. Now depending on the baud rate I get different kind of garbage. 9600 I just get repeating question marks, as I move up the garbage become faster and more random. Now I have tried different stop bits and etc. but I haven't tried every possible combination.</p>\n<p>My question is what is my best route to figure this thing out? Just brute force every possible combination? Which would take forever. Or is there something else I'm missing.</p>\n<p>Thanks.</p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "3k",
    "tags": [
        "serial-communication"
    ],
    "user": "Jonathan",
    "time": "Nov 25, 2016 at 17:39",
    "comments": [
        {
            "user": "Spektre",
            "text": "<span class=\"comment-copy\">use oscilloscope for the baud rate and also for the configuration (number of start/data/parity/stop bits) PS Baud rate can be anything not just 9600,115200 .... sometimes common frequency is used to align with another device. For example PC uses 115200 Hz  as clock bud MCU;s usually 8/12/24/48 MHz and the internal division mess the frequency a bit so for example I few times used around ~1022 Baud  rate just to make sure it works inbetween all devices ...</span>",
            "time": null
        },
        {
            "user": "dyasta",
            "text": "<span class=\"comment-copy\">See edit of my answer, could be unicode? The question marks would indicate that over garbage.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Whenever I had garbage it was due to incorrect baud rate or other settings, but you've tried those. Otherwise, check the connection carefully and make sure it is soldered well. Also ensure your TTL chip is functioning, if applicable.</p>\n<p><strong>The repeating question marks don't sound like garbage though - they may be Unicode that your terminal can't display or something doesn't support, maybe 7-bit chars, I dunno.</strong></p>\n</div>",
            "votes": "1",
            "user": "dyasta",
            "time": "Jan 27, 2017 at 9:30",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Not much to go on with, but if you don't have a scope or a logic analyzer, trying every possible baud rate with 8N1 (the most common configuration) is probably the easiest way. </p>\n</div>",
            "votes": "0",
            "user": "Igor Skochinsky",
            "time": "Nov 25, 2016 at 19:17",
            "is_accepted": false,
            "comments": []
        }
    ]
}