{
    "title": "Flashing firmware on an embedded device",
    "link": "https://reverseengineering.stackexchange.com/questions/14142/flashing-firmware-on-an-embedded-device",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Anyone want to help out a noob? (excuse my incorrect terminology/ knowledge)\nI am venturing into unknown territory. The only experience I have is rooting/flashing firmware on my phone and installing OpenWrt/DD-WRT</p>\n<p>I have a Japanese digital media player from NTT called HB-1000 光BOX＋ I want to install OSMC (<a href=\"https://osmc.tv/\" rel=\"nofollow noreferrer\">https://osmc.tv/</a>) or something...anything that's not what is on there now.</p>\n<p>The media player is running Android 4.2.2, I think. \nI can access the GUI and open some preinstalled apps but in the settings some options aren't available (like developer options). \nI connected the device to my router and did a port scan. I couldn't find the SSH/FTP/Telnet ports open.</p>\n<p>NTT's website indicates that the firmware can be upgraded when the player is connected to the internet. \nMaybe I can use Wireshark to help me figure out what's going on during a firmware update.\nNTT's website states that downloaded files can't be saved to SD card or USB.</p>\n<p>lk is used during the boot process\n<a href=\"https://github.com/littlekernel/lk\" rel=\"nofollow noreferrer\">https://github.com/littlekernel/lk</a></p>\n<h3>Specs:</h3>\n<ul>\n<li>Telechips TCC8930 Dual ARM Cortex A9 @ 1.2GHz ARMv7-A</li>\n<li>4GB NAND flash</li>\n<li>1GB DDR3-800Mhz RAM</li>\n<li>LAN 1000Base-T</li>\n<li>HDMI</li>\n<li>USB 2.0 (x2)</li>\n<li>SD card slot</li>\n<li>Wi-Fi 802.11n</li>\n<li>Bluetooth 4.0</li>\n<li>A reset and WPS button</li>\n<li>Green blinky LED lights (very important)</li>\n</ul>\n<p>The circuit board is manufactured by OKI.</p>\n<p>I found some software from the chip manufacturer\n(I'll add link)</p>\n<p>I also found a website talking about a leaked Android SDK \n(I'll add link)</p>\n<p>I've managed to connect a (UART/TTY to USB) device to some debug or serial connector ports. There are 14 \"holes\" and I managed to connect to the correct ones to see something when I use Minicom on my Ubuntu 14.04 computer.\nI don't see any sort of command line. If I hit a key on my keyboard, the media player reboots.</p>\n<p>I can provide some pics of the circuit board and my terminal screen upon request.</p>\n<p>Can anyone help or guide me to a better place for my question or somewhere I can learn about what's going on inside when I turn the power on?</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/6sg4T.png\"/>\n<img alt=\"enter image description here\" src=\"https://i.imgur.com/IDAE4jw.jpg\"/>\n</p>\n</div>",
    "votes": "4",
    "answers": 2,
    "views": "2k",
    "tags": [
        "linux",
        "firmware",
        "android",
        "hardware"
    ],
    "user": "AELJAPAN",
    "time": "Jan 18, 2018 at 19:40",
    "comments": [
        {
            "user": "AELJAPAN",
            "text": "<span class=\"comment-copy\">I found some software from the chip manufacturer <a href=\"https://www.telechips.com/technical_support/kor/opensource/opensource_list.asp\" rel=\"nofollow noreferrer\">telechips.com/technical_support/kor/opensource/…</a>  I also found a website talking about a leaked Android SDK <a href=\"http://www.cnx-software.com/2014/02/12/telechips-tcc892xtcc893x-android-4-2-2-sdk-leaked/\" rel=\"nofollow noreferrer\">cnx-software.com/2014/02/12/…</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I don't know about this particular device, so I'll answer with generalities.</p>\n<p>Since the device is running Android, it's unlikely you'll be able to use the software update mechanism to upload your own version on it (the update image is very likely signed by the manufacturer, though the Android OTA system should be documented enough for you to be able to wipe up your own server that will serve it your Android update image).</p>\n<p>Going from there, there are several ways to achieve what you want, but first, you will have to find a way to flash the device with a new image.</p>\n<p>You said you found a Serial line. What does the line display on boot? Is it using Uboot or another bootloader? Is there a way to interrupt the boot, and if so there may be a way to flash a new image.</p>\n<p>The connector you found may be a JTAG connector.</p>\n<p>Also, recto/verso picture of the board always help!</p>\n<p>As for the image itself, the SDK that was leaked may be a good starting point. Try to download it and compile the version for the correspond processor in your machine. See if it works or where it fails, and go from there to debug.</p>\n<p>Try to check if this processor is supported by the Linux mainline kernel. It looks like the manufacturer allows you to download the kernel sources used. This also would be a starting point to create your own image.</p>\n<p>I'm not sure this helps, but I hope it does a bit!</p>\n</div>",
            "votes": "1",
            "user": "gromain",
            "time": "Feb 15, 2017 at 16:46",
            "is_accepted": false,
            "comments": [
                {
                    "user": "AELJAPAN",
                    "text": "<span class=\"comment-copy\">Sorry for the late reply... I'll add some board pics.</span>",
                    "time": null
                },
                {
                    "user": "AELJAPAN",
                    "text": "<span class=\"comment-copy\"><a href=\"http://i.imgur.com/IDAE4jw.jpg\" rel=\"nofollow noreferrer\">i.imgur.com/IDAE4jw.jpg</a></span>",
                    "time": null
                },
                {
                    "user": "AELJAPAN",
                    "text": "<span class=\"comment-copy\"><a href=\"http://i.imgur.com/EutDRHf.jpg\" rel=\"nofollow noreferrer\">i.imgur.com/EutDRHf.jpg</a></span>",
                    "time": null
                },
                {
                    "user": "julian",
                    "text": "<span class=\"comment-copy\">@AELJAPAN these pictures should be posted in the question, not as comments</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There's a guy which is reversing Mele X1000 Android TV box, which is Telechips TCC8935, he might have some information <a href=\"https://www.cnx-software.com/tag/telechips\" rel=\"nofollow noreferrer\">https://www.cnx-software.com/tag/telechips</a></p>\n</div>",
            "votes": "0",
            "user": "Anton Kukoba",
            "time": "Jan 18, 2018 at 9:08",
            "is_accepted": false,
            "comments": []
        }
    ]
}