{
    "title": "Control a black box \"Traffic Light\" type device using USB",
    "link": "https://reverseengineering.stackexchange.com/questions/14159/control-a-black-box-traffic-light-type-device-using-usb",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a black box device with three LED's that can be turned on and off, and an also black box application that has six buttons that turn each individual LED on and off. I don't know the source code for the application, not what input does the \"traffic light\" expect.</p>\n<p>I really want to find out that inputs are sent to the device so that I can control it on my own, preferably without disassembling the device in question :)</p>\n<p>I tried to install Wireshark with USBPcap, and managed to capture what happens when buttons are pressed, but the logs are confusing and overwhelming. Can someone please recommend a direction of attack? </p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "232",
    "tags": [
        "usb"
    ],
    "user": "user1838817",
    "time": "Dec 13, 2016 at 15:43",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">Learn about the USB protocol to separate control bytes from the payload; possibly write a wireshark dissector to dump/analyze the payload. Not an easy or fast route to go. Probably more rewarding: use a disassembler like IDA on the application, and check what happens between the button presses and sending stuff to USB. However, if you want to write a program to control the device yourself, you'll probably have to do some of the status stuff as well, so you really need to learn more about how USB works.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The way I see it, you have three options :</p>\n<ol>\n<li>Debug &amp; Disassemble the application in order to figure out which\nfunction does what, then locate the exchange protocol and packets\nformat. Hopefully, you'll be able to find something that looks like a payload/command. This will take a lot of time and efforts, especially if the\napplication has been through compiler optimizations or obfuscation.</li>\n<li>Sniff out the USB traffic - which you already did - and\nreverse the payload format after identifying what data fields belong\nto the USB transfer protocol and which don't. <a href=\"http://www.beyondlogic.org/usbnutshell/usb3.shtml\" rel=\"nofollow noreferrer\">This</a> link\nprovides everything you need to know about USB protocols.</li>\n<li>Invest in a <a href=\"https://en.wikipedia.org/wiki/Logic_analyzer\" rel=\"nofollow noreferrer\">logic analyzer</a>. It's a miracle machine that can help reverse almost any protocol. If you look at the price range it's quite high for very efficient and professional machines (<a href=\"http://cp.literature.agilent.com/litweb/pdf/5990-7513EN.pdf\" rel=\"nofollow noreferrer\">example</a>), but you can build your own using an <a href=\"http://playground.arduino.cc/Main/LogicAnalyzer\" rel=\"nofollow noreferrer\">Arduino</a> or even get a software based one. You also have <a href=\"http://openvizsla.org/\" rel=\"nofollow noreferrer\">OpenVizsla</a> which is an open source FPGA based USB logic analyzer/sniffer. Or, you can buy a <a href=\"http://www.totalphase.com/products/beagle-usb12/\" rel=\"nofollow noreferrer\">Beagle USB</a>, quite pricey but worth it.</li>\n</ol>\n<p>If you go for solution 2, you'll have to separate the signal in time. By that I mean :</p>\n<ul>\n<li>At t0 : Reset the device</li>\n<li>At t1 : Set the light to RED and sniff</li>\n<li>At t2 : Reset the device</li>\n<li>At t3 : Set the light to GREEN and sniff\nSo on a so forth ...</li>\n</ul>\n<p>This way you can have time-stamped data which can help you remove the redundant data and only keep the core values (the payload).</p>\n<p>Hope this helps.</p>\n</div>",
            "votes": "1",
            "user": "yaspr",
            "time": "Dec 16, 2016 at 0:08",
            "is_accepted": false,
            "comments": []
        }
    ]
}