{
    "title": "Methods for Reverse engineering proprietary protocol",
    "link": "https://reverseengineering.stackexchange.com/questions/14236/methods-for-reverse-engineering-proprietary-protocol",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a class of devices that I want to connect to.  They use a protocol co-developed by a couple companies back in the day and was never published.  Electrically there is only one wire which wraps back around in the end cap.  I broke open the end cap and there was a test point in it's PCB so I soldered something in and hooked it up to an analyzer.  There's no clock line so I'm not immediately sure of the baud.  It also does the weird thing where the line is high for ~61.5ms and low for the other 61.5.  A message is placed on the rising and falling edge of this square wave and one in the center of each period.  The shortest measured width seems to be .5833us.  The async serial analyzer marks the better half of traffic with framing errors, not sure if that's more the strange inversion of line level from time to time or not being able to tell the baud.</p>\n<p>Capture of a few tenths of a second of traffic:\n<a href=\"https://i.sstatic.net/Jdhn2.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/Jdhn2.png\"/></a></p>\n<p>Any hints on where to start would be greatly appreciated.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "233",
    "tags": [
        "protocol"
    ],
    "user": "foreverska",
    "time": "Dec 23, 2016 at 20:59",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This could be a <a href=\"https://en.wikipedia.org/wiki/Self-clocking_signal\" rel=\"nofollow noreferrer\">self-clocking protocol</a> like <a href=\"https://en.wikipedia.org/wiki/Manchester_code\" rel=\"nofollow noreferrer\">Manchester encoding</a>. Also check the <a href=\"https://www.google.com/patents/\" rel=\"nofollow noreferrer\">patent database</a> for any patents from the companies involved; quite possibly there may be hints there.</p>\n</div>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Dec 24, 2016 at 10:16",
            "is_accepted": false,
            "comments": [
                {
                    "user": "foreverska",
                    "text": "<span class=\"comment-copy\">I had a similar inclination on self-clocking but I've never seen a protocol like this.  I almost feel like the weird clock thing the data line is filtered and multiplied.  Looking at the patent database was interesting and seems to hint at a clock line somewhere.  Electrically I'm not sure how that's possible, four pins are +5/0V pairs (AFAICT from a multimeter) and the middle two are electrically tied together and I tapped one to get my readings.  Maybe I'm looking at a patent for the wrong tech or I'm misreading... back to google.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">Maybe also try posting a bigger sample on electrical engineering SE</span>",
                    "time": null
                }
            ]
        }
    ]
}