{
    "title": "It's possible call a function outside a original thread?",
    "link": "https://reverseengineering.stackexchange.com/questions/14286/its-possible-call-a-function-outside-a-original-thread",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Example:</p>\n<p>I have a function in a process on the memory address: <code>0xABCDEF</code>, but that function cannot be called outside of original thread, it's possible to call it or hook it somehow?</p>\n<p>To what i'm going it's C++ on DLL injection...</p>\n<p>I thought it was possible using <code>CreateRemoteThread</code>, but i don't know if it is necessary to pass the id of the thread.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "854",
    "tags": [
        "c++",
        "function-hooking",
        "dll-injection"
    ],
    "user": "MindLerp",
    "time": "Dec 30, 2016 at 3:09",
    "comments": [
        {
            "user": "Martin",
            "text": "<span class=\"comment-copy\">You can use <code>CreateRemoteThread</code> but you'd need to make sure the function is a <code>THREAD_START_ROUTINE</code>. If not, make a stub for it. As for the thread: no, you don't (shouldn't) need anything like that.</span>",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "<span class=\"comment-copy\">This question is not really clear. Why do you no longer think using <code>CreateRemoteThread</code> is possible?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>CreateRemoteThread() is used to create a new thread inside the remote process.  The function will return the ID of the newly created thread.  This can be used to load your DLL into the remote process, by passing the address of LoadLibrary() as the thread start address (note that you would need to VirtualAllocEx() and WriteProcessMemory() to place the filename in the remote process first).</p>\n<p>Once your DLL is loaded, you would need to hook the function of interest (via VirtualProtect(MEM_WRITABLE)/memcpy()/VirtualProtect(original protection)), since you can't inject directly into a thread.  You can only modify the code that the thread is running, and then receive control indirectly.</p>\n<p>Note that for safety, you would need to SuspendThread() the thread of interest before you make changes to its code, unless the function that you wish to alter is hot-patchable.  In the case of a hot-patchable function, you would write the long jump at address function-5, and then write the short jump at the function start.  The write of the short jump is an atomic operation so there is no risk of misaligned execution.</p>\n</div>",
            "votes": "0",
            "user": "peter ferrie",
            "time": "Jan 13, 2017 at 22:47",
            "is_accepted": true,
            "comments": [
                {
                    "user": "MindLerp",
                    "text": "<span class=\"comment-copy\">this pass the thread local storage without problems? thanks.</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">yes, Thread Local Storage will still behave correctly.</span>",
                    "time": null
                }
            ]
        }
    ]
}