{
    "title": "How to know which module am I currently in? (EIP/RIP pointer)",
    "link": "https://reverseengineering.stackexchange.com/questions/14317/how-to-know-which-module-am-i-currently-in-eip-rip-pointer",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm currently learning <code>IDA Pro</code>, that is set up with the <code>WinDbg</code> debugger. So, say, I triggered a breakpoint and began stepping in and out of functions. I prefer to work in the \"Graph view\" mode:</p>\n<p><a href=\"https://i.sstatic.net/qfgZ5.png\" rel=\"nofollow noreferrer\"><img alt=\"IDA debugger view in graph mode\" src=\"https://i.sstatic.net/qfgZ5.png\"/></a></p>\n<p>What is the easiest way to see the module name that I'm currently debugging? Or where the <code>EIP</code> or <code>RIP</code> registers points to. In the screenshot above, address of <code>0x759B86B0</code>.</p>\n</div>",
    "votes": "6",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "windows",
        "debugging",
        "windbg"
    ],
    "user": "c00000fd",
    "time": "Jan 4, 2017 at 11:52",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<ol>\n<li>The top right window, the registers window, shows where each register points to and includes the module name of there is one. EIP is not shown in the picture but if you'll scroll down or resize it you'll see it.</li>\n<li>The stack shows an address in the same offset as the current EIP points to somewhere in <code>user32</code>, so that's probably it. <code>ebx</code> also points to the same module.</li>\n<li>The IDB segment is named correctly, so you can always open the segments view and see which segment contains the current EIP. Additionally, viewing the address (by switching to the Text View or configuring the graph view to show addresses from Options-&gt;Graph view) will have the module name before the address.</li>\n</ol>\n</div>",
            "votes": "3",
            "user": "NirIzr",
            "time": "Jan 4, 2017 at 9:25",
            "is_accepted": true,
            "comments": [
                {
                    "user": "c00000fd",
                    "text": "<span class=\"comment-copy\">Also just discovered that if I switch sway from the \"Graph view\" back to \"Text view\" (available as a context menu command after a right-click on the \"Debug view\" window), the assembly code shows module name on the left. Example: <code>USER32:instruction</code></span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Good point. Edited this in. Also, be aware you can configure IDA to list addresses in graph view as well instead of switching to text view.</span>",
                    "time": null
                }
            ]
        }
    ]
}