{
    "title": "How ret know where eip is saved?",
    "link": "https://reverseengineering.stackexchange.com/questions/14411/how-ret-know-where-eip-is-saved",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm learning assembly and I have one question.\nExample:</p>\n<pre><code>int main()\n{\n    foo(a);\n}\n\nint foo (x)\n{\n    return 0;\n}\n</code></pre>\n<p>when the <code>foo</code> function returns to <code>main</code> the <code>ret</code> instruction is executed. How does the <code>ret</code> instruction knows where the pushed <code>EIP</code> register is saved?</p>\n<p>I know that before the <code>foo</code> function is called the <code>EIP</code> is pushed to the stack, but when <code>ret</code> in <code>foo</code> is executed, what the <code>ret</code> really does? </p>\n<p>Thanks for your help</p>\n</div>",
    "votes": "-1",
    "answers": 1,
    "views": "3k",
    "tags": [
        "assembly",
        "x86"
    ],
    "user": "ciccio",
    "time": "Jan 15, 2017 at 18:49",
    "comments": [
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">That is all over the Intel manuals. Short answer (those manuals are quite long): there is only <i>one</i> place where such a value is stored, the <b>stack</b>.</span>",
            "time": null
        },
        {
            "user": "phuclv",
            "text": "<span class=\"comment-copy\"><a href=\"https://www.felixcloutier.com/x86/ret\" rel=\"nofollow noreferrer\">felixcloutier.com/x86/ret</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The <code>ret</code> instruction actually performs quite a simple task.</p>\n<p>It is composed of two operations in the CPU:</p>\n<ol>\n<li>It pops the topmost value off the stack.</li>\n<li>It sets the <code>eip</code> register to that popped value.</li>\n</ol>\n<p>Therefore, the <code>ret</code> instruction never really \"knows\" or \"finds out\" where the previous <code>eip</code> value is stored. <code>ret</code> just assumes the topmost stack variable <em>is</em> the previous <code>eip</code>.</p>\n<p>It is the responsibility for the developer (or, more commonly now - the compiler) to make sure that assumption is met whenever a <code>ret</code> instruction is executed by the CPU.</p>\n<p>Making sure that assumption is valid is one of what some might say is the worst constraint enforced on the stack, and the reason why every function must make sure it leaves the stack in the same state it entered it.</p>\n<p>It also makes some assembly tricks (such as hooking) a bit more complex, but I won't go into that here.</p>\n</div>",
            "votes": "4",
            "user": "Community",
            "time": "Feb 23, 2020 at 9:02",
            "is_accepted": false,
            "comments": []
        }
    ]
}