{
    "title": "How do I acquire SoftICE?",
    "link": "https://reverseengineering.stackexchange.com/questions/1445/how-do-i-acquire-softice",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have seen mentions of SoftICE on various questions throughout this site. However, the <a href=\"http://en.wikipedia.org/wiki/SoftICE\">Wikipedia article</a> on SoftICE implies that the tool is abandoned.  Searching google, I see many links claiming to be downloads for SoftICE, but they seem to have questionable origins and intent.  </p>\n<p>Is there an official website where I can purchase and download SoftICE, or an official MD5 of a known SoftICE installer?</p>\n</div>",
    "votes": "32",
    "answers": 5,
    "views": "58k",
    "tags": [
        "tools",
        "debuggers",
        "softice"
    ],
    "user": "amccormack",
    "time": "Apr 2, 2013 at 14:06",
    "comments": [
        {
            "user": "Dai",
            "text": "<span class=\"comment-copy\">Archive.org has SoftICE 3.2: <a href=\"https://archive.org/details/NuMega_SoftIce_Windows_3.2\" rel=\"nofollow noreferrer\">archive.org/details/NuMega_SoftIce_Windows_3.2</a> - use serial number \"1900-713155-77\" during setup. Other versions, and full documentation, is also available: <a href=\"https://archive.org/search.php?query=softice\" rel=\"nofollow noreferrer\">archive.org/search.php?query=softice</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>SoftICE is pretty much dead. If you're looking for the same look and feel you can always check out <a href=\"http://www.sysersoft.com/\">Syser</a> or <a href=\"http://bugchecker.com/\">BugChecker</a>. Haven't used them myself as I think most kernel level debugging now a days is done through remote debugging either via a VM or another machine on the network. The same type of person who would use SoftIce would probably use <a href=\"http://msdn.microsoft.com/en-us/windows/hardware/gg463009.aspx\">WinDbg</a> today.</p>\n<p>Syser:</p>\n<blockquote>\n<p>Syser Kernel Debugger</p>\n<p>is designed for Windows NT Family based on X86 platform. It is a kernel debugger with full-&gt;graphical interfaces and supports assembly debugging and source code debugging.</p>\n<p>Softice is left. Syser will continue.</p>\n</blockquote>\n<p>BugChecker:</p>\n<blockquote>\n<p>At this time, I'm searching for contributors in order to make BugChecker a valid, useful, free and open alternative to SoftICE and other commercial debuggers.</p>\n</blockquote>\n</div>",
            "votes": "34",
            "user": "Peter Andersson",
            "time": "Apr 1, 2013 at 20:08",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Ange",
                    "text": "<span class=\"comment-copy\">When i tried Syser long ago, it was extremely buggy.</span>",
                    "time": null
                },
                {
                    "user": "Peter Andersson",
                    "text": "<span class=\"comment-copy\">Seeing how tiny the development teams on these products are it wouldn't surprise me if the quality or feature set is fairly low. We also live to an entirely different standard today when it comes to tools.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Syser seems to be equally dead. I'm not surprised. Look at how much WinDbg has improved in the past decade.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>After buying NuMega technologies in 1997, Compuware seemed to feel that SoftICE was a liability, both technically and legally (as the #1 hacker tool of the time), and that may have played into why they discontinued support.  SoftICE required constant updates in order to continue working against the various updates of Windows that were coming out, and there were only a couple of people who knew how to make those updates.  In 2007, they closed down the NuMega office in Nashua, NH, and moved all the intellectual property to Compuware's headquarters (then in Detroit, MI).  The product line that included all that stuff was sold off to MicroFocus in 2009, along with the remaining developers, none of which knew a thing about building SoftICE, let alone updating it to work with updated versions of Windows.  We toyed with resurrecting the product around 2011, but could not get management to buy off on it, so it didn't happen.</p>\n<p>The source code remains in its own stasis box (a source control database), and will likely never go anywhere from there.</p>\n<p><strong>Disclaimer:</strong> I work for MicroFocus, and currently maintain the formerly NuMega product \"DevPartner Studio\", the BoundsChecker portion in particular.</p>\n</div>",
            "votes": "31",
            "user": "Rick Papo",
            "time": "Sep 6, 2017 at 17:31",
            "is_accepted": false,
            "comments": [
                {
                    "user": "fpmurphy",
                    "text": "<span class=\"comment-copy\">Thanks for the history.  Always wondered what happened SoftICE.</span>",
                    "time": null
                },
                {
                    "user": "Rolf Rolles",
                    "text": "<span class=\"comment-copy\">Someone with a real-life connection to SoftICE??? I'm dying to know, if you have the answer, why BPR was removed in the 4.x line. It technically would have still worked; in fact, some third-party extensions added the feature back.</span>",
                    "time": null
                },
                {
                    "user": "Rick Papo",
                    "text": "<span class=\"comment-copy\">Unfortunately I cannot answer that question.  Because I don't know the answer.  We are the custodians of the source code, but we aren't experts in it.  The last people who knew the code were laid off in early 2007.  The closest things to any part of SoftICE that we still maintain in working condition are parts of BoundsChecker.</span>",
                    "time": null
                },
                {
                    "user": "Rick Papo",
                    "text": "<span class=\"comment-copy\">And FWIW, the last two of us were laid off from MicroFocus in March, 2021.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>SoftICE is no longer maintained or widely used. The standard for kernel-mode debugging is currently Windbg. Windbg can also be used for user-mode debugging. </p>\n<p>I would recommended you check out the following link for more information about windbg and debugging in general:\n<a href=\"http://www.codeproject.com/Articles/6084/Windows-Debuggers-Part-1-A-WinDbg-Tutorial\">http://www.codeproject.com/Articles/6084/Windows-Debuggers-Part-1-A-WinDbg-Tutorial</a></p>\n<p>Also, if you could give more information around what it is you are trying to accomplish (malware analysis, binary analysis, file format revesing etc..) we could probably point you in a more appropriate direction. It is likely that kernel mode debugger is not what you are looking for. </p>\n</div>",
            "votes": "13",
            "user": "atorrrr",
            "time": "Apr 2, 2013 at 13:24",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Chances are that you are looking into old documents and training material if you are looking into SoftICE. There is no legal way of acquiring the software since it was discontinued at 2006.</p>\n<p>The last version of SoftICE was included in Compuware's DriverStudio.</p>\n</div>",
            "votes": "10",
            "user": "Nicolas",
            "time": "Apr 1, 2013 at 18:12",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>As far as I know, it's not for sale anymore - at all - and used to work until XP only.</p>\n<p>(if I'm wrong, I feel like I'd buy it instantly, knowing how useful it was)</p>\n</div>",
            "votes": "8",
            "user": "Ange",
            "time": "Apr 1, 2013 at 18:04",
            "is_accepted": false,
            "comments": []
        }
    ]
}