{
    "title": "Going around finding a signature used in a .APK file",
    "link": "https://reverseengineering.stackexchange.com/questions/14492/going-around-finding-a-signature-used-in-a-apk-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So I've decompiled an APK and I believe that I have now is the source code (most with a bunch of random variables and method names, but from what I've read this is completely normal) </p>\n<p>the app in question uses a signature in the registration request that changes everytime, this signature is not received from any request preceding it so I assume the only way to find out how this is being generated is through the APK. Do you guys have any direction on where exactly I should be looking?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "312",
    "tags": [
        "java"
    ],
    "user": "Reece",
    "time": "Jan 24, 2017 at 22:16",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The signature is likely a hash based on some string value and the current date (potentially milliseconds since the epoch).  This question is impossible to answer without the source code, but try looking in the code for any references to constant string values and references to <code>Time()</code> or <code>Calendar()</code>.</p>\n</div>",
            "votes": "3",
            "user": "JAL",
            "time": "Jan 24, 2017 at 23:32",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Reece",
                    "text": "<span class=\"comment-copy\">I've made a bit of progress. It seems that the source code is using the BuildConfig.VERSION_NAME value as the signature when sending off the request, funny thing is, in the manifest this value is set as null, or (\"\"), so I think it may be using this value and some sort of time like you said? What do you think?</span>",
                    "time": null
                }
            ]
        }
    ]
}