{
    "title": "Legal risks of retro engineering a 19 years old game",
    "link": "https://reverseengineering.stackexchange.com/questions/14597/legal-risks-of-retro-engineering-a-19-years-old-game",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am quite new to retro-reverse-engineering, and I am concerned about my current hobby.</p>\n<p>Months ago I started to reverse a 19 year old commercial game, no longer on sale (for ages), and not supported (the company has been taken over a decade ago).</p>\n<p>The purpose of my work is not to share the reversed code (as I don't produce code but analyse the existing one) but rather to create a small tool to patch the game.</p>\n<p>This patcher would not remove the original CD protection, it would only enable modification of features and behavior of the game. On top of that, I am considering sharing the code of this patcher on a public repository on GitHub.</p>\n<p>But as I am approaching the end of my work, I am becoming concerned about the legal implications, because it is clearly illegal to modify an .exe when it is proprietary material. On the other hand I saw a lot of equivalent stuff for old games, and as far I know, their creator were not sued.</p>\n<p>My question is: in your opinion, is it risky to complete my patcher, and on top of that, to share its code?</p>\n</div>",
    "votes": "3",
    "answers": 2,
    "views": "2k",
    "tags": [
        "disassembly",
        "assembly",
        "decompilation"
    ],
    "user": "enrico69",
    "time": "Feb 8, 2017 at 10:56",
    "comments": [
        {
            "user": "Tox1k",
            "text": "<span class=\"comment-copy\">What is your locale? Copyright laws depend upon where the game was produced also but you're unlikely to be extradicted unless you make a habit of it. See abandonware : <a href=\"https://en.wikipedia.org/wiki/Abandonware\" rel=\"nofollow noreferrer\">en.wikipedia.org/wiki/Abandonware</a></span>",
            "time": null
        },
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">The only way to get a good answer for the legal question is to get it from the lawyer.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><em>Disclaimer: IANAL; Best answer would be from a local lawyer with expertise in computer copyrights and laws at the location the owning company is at. If you'll be sued, it'll probably be in a court of their choosing as this is often part of the EULA.</em></p>\n<p>However, one distinction I see here is that you don't modify the executable provided as part of the game, you only create a tool that does that. The actual person changing the game is the user of your tool. Abnother consideration though, is that most EULAs forbid reverse engineering, and you might be violating that.</p>\n<p>Anyway, this is how I see you approaching this concern:</p>\n<h2>Approaching the rights owner</h2>\n<p>A way to get an answer for this is by approaching the company (or whoever currently owns rights for the game) and request permission / announce you're about to do that.</p>\n<p>Consequences may vary:</p>\n<ul>\n<li><p>Some right owners publicly waive some copyright protections of abandoned games, for the enjoyment and modification by the community. If that's the case, you'll be referred to the waiver.</p></li>\n<li><p>If you're given permission, all is well and you're good to go.</p></li>\n<li><p>If you're being ignored for a decent amount of time (say, a month) and later sued, you can argue the company had prior knowledge and choose not to forbid these actions in a timely manner.</p></li>\n<li><p>If you receive an unofficial reply declining granting you the permissions (or the more formal <a href=\"https://en.wikipedia.org/wiki/Cease_and_desist\" rel=\"nofollow noreferrer\">Cease and Desist</a> letter), at least you know where you're at.</p></li>\n</ul>\n<h2>Hoping for the best</h2>\n<p>If you choose not to approach the rights owner, you can infer potential reactions from past experiences (mostly of other's). <a href=\"https://en.wikipedia.org/wiki/Abandonware\" rel=\"nofollow noreferrer\">Abandonware</a> is indeed something quite common, and you can find games that are as far as fully emulated in web browsers. Investigating what other potential violations the same rights owner had in the past, and how it reacted. Finding other violations of the same game will also be good indicators.</p>\n</div>",
            "votes": "0",
            "user": "NirIzr",
            "time": "Feb 8, 2017 at 11:00",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Game hacks are quite common and often distributed on the web. I-am-not-a-lawyer-but you should be fine as the game is no longer distributed and you are not getting around with copy protection.</p>\n</div>",
            "votes": "0",
            "user": "ekse",
            "time": "Feb 7, 2017 at 22:34",
            "is_accepted": false,
            "comments": []
        }
    ]
}