{
    "title": "How are Apple App Store Apps encrypted?",
    "link": "https://reverseengineering.stackexchange.com/questions/14704/how-are-apple-app-store-apps-encrypted",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I know how to decrypt an iOS app use tools.</p>\n<p>How is this encryption performed?  Why can iOS apps only be decrypted on a device?  Is there a device-specific key used for encryption?</p>\n</div>",
    "votes": "13",
    "answers": 1,
    "views": "7k",
    "tags": [
        "decryption",
        "ios"
    ],
    "user": "Karl",
    "time": "Mar 1, 2017 at 3:21",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>When you download an app from the App Store, Apple injects a special 4196 byte long header into the signed binary encrypted with the public key associated with your iTunes account.  This public/private key pair is generated when you create your iTunes Account, and transferred to your iOS device when you log in with your iTunes account or Apple ID.  This is part of Apple's FairPlay DRM.  At install time, your iOS device tries to decrypt the header with your key, which will succeed if the app was downloaded from the App Store with matching credentials.</p>\n<p><strong>How do tools like AppSync bypass the check?</strong></p>\n<p>Many older versions of AppSync are based on the original tool PPSync, a patch made by the notorious Chinese iOS piracy website 25pp which modifies installd's launch daemon plist file to interpose its signature checking routines.  This is unsafe and creates an unstable runtime.  Newer tools such as AppSync Unified utilize the dynamic hooking function <code>MSHookFunction()</code> in Cydia Substrate to bypass installd's signature checks. This means AppSync Unified does not modify any system files and is much more stable and safe as a result.</p>\n<p><strong>Why can you only remove the DRM from an iOS app on an actual device?</strong></p>\n<p>Tools such as Crackulous are just a frontend on top of Clutch, a DRM-removal tool.  An additional signature check is performed at runtime to ensure the application is provisioned to run on your iOS device.  Clutch hooks into the device runtime to dump the application from memory and into an unsigned binary.</p>\n<p>Sources:</p>\n<p><a href=\"https://www.theiphonewiki.com/wiki/Copy_Protection_Overview\" rel=\"noreferrer\">Copy Protection Overview - The iPhone Wiki</a></p>\n<p><a href=\"https://github.com/angelXwind/AppSync/blob/master/README.md\" rel=\"noreferrer\">AppSync Unified on GitHub</a></p>\n<p><a href=\"https://github.com/KJCracks/Clutch\" rel=\"noreferrer\">Clutch on GitHub</a></p>\n</div>",
            "votes": "18",
            "user": "JAL",
            "time": "Feb 21, 2017 at 17:44",
            "is_accepted": false,
            "comments": []
        }
    ]
}