{
    "title": "How does BinDiff work?",
    "link": "https://reverseengineering.stackexchange.com/questions/1475/how-does-bindiff-work",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I would like to know what are the basic principles (and maybe a few things about the optimizations and heuristics) of the <a href=\"http://www.zynamics.com/bindiff.html\">BinDiff software</a>. Does anyone have a nice and pedagogic explanation of it?</p>\n</div>",
    "votes": "11",
    "answers": 2,
    "views": "6k",
    "tags": [
        "tools",
        "tool-bindiff"
    ],
    "user": "perror",
    "time": "Oct 11, 2016 at 13:18",
    "comments": [
        {
            "user": "perror",
            "text": "<span class=\"comment-copy\">@Nirlzr: I don't see how it does improve anything to change the tags 'bindiff' into 'tool-bindiff'... But, I may just have a twisted mind, so tell me more about it...</span>",
            "time": null
        },
        {
            "user": "kennytm",
            "text": "<span class=\"comment-copy\">Perhaps you should voice in <a href=\"http://meta.reverseengineering.stackexchange.com/questions/322/bindiff-verses-bin-diffing-tags\" title=\"bindiff verses bin diffing tags\">meta.reverseengineering.stackexchange.com/questions/322/…</a></span>",
            "time": null
        },
        {
            "user": "perror",
            "text": "<span class=\"comment-copy\">@kennytm: Ah, I missed this... Good catch, thanks.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In general, BinDiff in its current version as of this writing (4.x) works by matching attributes on the function level. \nBasically, matching is divided into two phases: first initial matches are generated which are then refined in the drill down phase.</p>\n<h2>Initial Matches</h2>\n<p>First of all BinDiff associates a signature based on the following attributes to each function:</p>\n<ul>\n<li>the number of basic blocks</li>\n<li>the number of edges between those blocks</li>\n<li>the number of calls to subfunctions</li>\n</ul>\n<p>This step gives us a set of signatures for each binary which in turn are used to generate the set of initial matches. Following a one-to-one relation, BinDiff selects these initial matches based on the above characteristics.</p>\n<p>The next step tries to find matchings on the call graph of each binary: for a verified match, the set of called functions from the matched function is examined in order to find event more matches. This process is repeated as long as new matches are found.</p>\n<h2>Drill Down</h2>\n<p>In practice, not all functions will be matched by the one-to-one relation induced by the initial matching strategy, so after the initial matchings have been determined we still have a list of unmatched functions.\nThe idea of the drill down phase is to have multiple different function matchings strategies which are applied until a match is found. The order of applying these strategies is important: BinDiff tries those strategies for which it assumes the highest confidence, first. Only if no match could be found, it goes on with the next strategy. This is repeated until BinDiff runs out of strategies, or until all functions are matched. Examples include MD index, match based on function names (i.e. imports), callgraph edges MD index, etc.</p>\n<p><a href=\"https://www.sto.nato.int/publications/STO%20Meeting%20Proceedings/RTO-MP-IST-091/MP-IST-091-26.pdf\" rel=\"nofollow noreferrer\">MD-Index paper</a></p>\n<p><a href=\"http://static.googleusercontent.com/external_content/untrusted_dlcp/www.zynamics.com/en//downloads/bindiffsstic05-1.pdf\" rel=\"nofollow noreferrer\">Graph-based Comparison of Executable Objects</a></p>\n<p><a href=\"http://static.googleusercontent.com/external_content/untrusted_dlcp/www.zynamics.com/en//downloads/dimva_paper2.pdf\" rel=\"nofollow noreferrer\">Structural Comparison of Executable Objects</a></p>\n<p>(Disclaimer: working @ team zynamics / google, hopefully I didn't mess up anything, otherwise soeren is going to grill me ;-))</p>\n</div>",
            "votes": "15",
            "user": "NirIzr",
            "time": "Mar 14, 2017 at 23:53",
            "is_accepted": true,
            "comments": [
                {
                    "user": "wishi",
                    "text": "<span class=\"comment-copy\">So you're still working on it? Or is that just the every-Friday project?</span>",
                    "time": null
                },
                {
                    "user": "newgre",
                    "text": "<span class=\"comment-copy\">I'm not working on it and never did, but BinDiff hasn't been cancelled if that's what you meant!?</span>",
                    "time": null
                },
                {
                    "user": "sw.",
                    "text": "<span class=\"comment-copy\">Zynamics, the company behind BinDiff, was acquired by Google. You can message some employees that sit on the reverse engineering reddit.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I can tell just a couple of words about control-flow graph building, though my answer is definitely not the full one.</p>\n<p>BinDiff uses a static type of detecting execution flows, I suppose because executing code isn't always possible (e.g. for ring 0 drivers) or reasonable (malware). Actually, the given file is disassembled, then it should be split into <strong>basic blocks</strong> (these are pieces of code that have straight way of execution, though this definition is right in that very case). It's clear (considering the x86 architecture, for example) that instructions like <code>jxx</code> change the control flow of a program. So basic blocks are usually terminated by them. This very process of splitting code into blocks isn't a complicated task, the more challenging part is determining jump destination.</p>\n<p>For example something like that:</p>\n<pre><code>...\njz eax\n</code></pre>\n<p>So we can't (easily) understand with automated static analysis where this call is pointed to. Trivial cases can be \"emulated\", but in general that work is very hard and frustrating. The other option is to trace program to look which paths does code execute (that can be done manually).\nWhen these blocks are found the only one thing left is to build human-readable graph.</p>\n<p>Anyway there is a pile of ways execution flow can be changed (exceptions, hot patching by another thread, system-dependent events etc).</p>\n</div>",
            "votes": "6",
            "user": "0xC0000022L",
            "time": "Apr 9, 2013 at 14:26",
            "is_accepted": false,
            "comments": [
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">The <a href=\"http://www.zynamics.com/downloads/bindiffsstic05-1.pdf\" rel=\"nofollow noreferrer\">original article</a> on the algorithm of graph homomorphism is a good start. More recently, some <a href=\"https://github.com/MartialB/BinSlayer\" rel=\"nofollow noreferrer\">tools</a> have been proposed (see this <a href=\"http://dl.acm.org/citation.cfm?id=2430557\" rel=\"nofollow noreferrer\">paper</a> and this <a href=\"http://royalsociety.org/uploadedFiles/Royal_Society_Content/grants/labs-to-riches/2012/Andy%20king.pdf\" rel=\"nofollow noreferrer\">poster</a>). But, this <a href=\"http://www.reddit.com/r/ReverseEngineering/comments/16bc9t/binslayer_fast_comparison_of_binary_executables/\" rel=\"nofollow noreferrer\">Reddit thread</a>  suggests that some improvements have been made on BinDiff.</span>",
                    "time": null
                }
            ]
        }
    ]
}