{
    "title": "PE file format: How can I find the heap memory space in a running WinNT program?",
    "link": "https://reverseengineering.stackexchange.com/questions/14852/pe-file-format-how-can-i-find-the-heap-memory-space-in-a-running-winnt-program",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've been researching the Portable Executable format and one great work I've been reading is \"ARTeam PE file format Tutorial\" which is a collection of research from Michael J'OLeary, Randy Kath, Matt Pietrek, and many more.</p>\n<p>However, one thing that I've noticed is absent is how and where the heap gets allocated for a program. Is it in one of the 9 standard sections such as <code>.bss</code> or <code>.data</code> or is it attached to the end of all sections at run-time by the loader?</p>\n<p>I assume, since it's the heap which is dynamic memory, that it is not specified anywhere in the actual PE, but if I want to scan the heap for data, how would I get the memory address space?</p>\n<p>Specifically, I would like answers to the following questions:</p>\n<ol>\n<li>how and where the heap gets allocated for a program?</li>\n<li>If I want to scan the heap for data, how would I get the memory address space?</li>\n</ol>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "windows",
        "memory",
        "pe",
        "heap"
    ],
    "user": "the_endian",
    "time": "Mar 8, 2017 at 12:59",
    "comments": [
        {
            "user": "peter ferrie",
            "text": "<span class=\"comment-copy\">the heap size is defined by fields in the PE header, but the placement in memory is assigned randomly by the OS.  You can query the heap start by calling the GetProcessHeap() function, or by reading the PEB directly.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><strong>Short answer:</strong> The heap, stack and other <em>PE loader</em> related tasks are not part of the PE standard or definition.</p>\n<p><strong>General Information</strong></p>\n<p>the PE file does not describe the entire memory space of an executable. It only contains the data required to execute a program, and the OS keeps the right to add additional regions without the user's awareness. Things such as the heap, the stack and other internal memory regions required for a process to function and operate are not the responsibility of a PE file (or any executable file for that matter).</p>\n<p>A PE doesn't define a heap, it requests a heap to be allocated for it from the OS (<a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/aa374721(v=vs.85).aspx\" rel=\"nofollow noreferrer\"><code>AllocateHeap</code></a> is a Windows API that does that). There's no need to actually eat up space for a heap \"placeholder\" in the PE file. The same goes for the stack, the PEB, and other memory objects a process has.</p>\n<p>Additionally, a user(i.e. programmer) does not usually need to even call <code>AllocateHeap</code> for it's process to have a heap. OSes usually allocate a default heap for the process when loading it (either by the loader itself or by startup code the OS runs before control is given to the PE's Entry Point). Other times the compiler prefixes the code with code that allocates a heap.</p>\n<p>Similarly, the stack is allocated as part of the process creation, and is not part of the PE or defined by it. This is mandatory, for a process cannot exist without a stack (although the PE can set the <em>size</em> of the allocated stack).</p>\n<p>If you're interested in learning about the NT Loader (and the PE file format), I suggest you take a look at the following articles and resources:</p>\n<ul>\n<li><a href=\"https://www.microsoftpressstore.com/articles/article.aspx?p=2233328\" rel=\"nofollow noreferrer\">Processes, Threads, and Jobs in the Windows Operating System By Mark E. Russinovich and David A. Solomon</a></li>\n<li><a href=\"https://www.microsoft.com/msj/0999/hood/hood0999.aspx\" rel=\"nofollow noreferrer\">Under the Hood by Matt Pietrek</a></li>\n<li><a href=\"https://msdn.microsoft.com/en-us/magazine/bb985992.aspx\" rel=\"nofollow noreferrer\">Peering Inside the PE: A Tour of the Win32 Portable Executable File Format</a></li>\n<li>The \"An In-Depth Look into the Win32 Portable Executable File Format\" series: <a href=\"https://msdn.microsoft.com/en-us/magazine/bb985992.aspx\" rel=\"nofollow noreferrer\">Part 1</a>, <a href=\"https://msdn.microsoft.com/en-us/magazine/bb985994.aspx\" rel=\"nofollow noreferrer\">Part 2</a></li>\n</ul>\n<p>You might have already read some of the, but I included most of them for future reference.</p>\n<p>A lot of information about the heap and other types of memory are part of the (relatively big) topic of Memory Management in windows and you may want to also dive into that, here are are few articles about the heap and memory management:</p>\n<ul>\n<li><a href=\"http://Heap:%20Pleasures%20and%20Pains\" rel=\"nofollow noreferrer\">https://msdn.microsoft.com/en-us/library/ms810466.aspx</a></li>\n<li><a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/aa366711(v=vs.85).aspx\" rel=\"nofollow noreferrer\">Heap memory functions, msdn</a></li>\n<li><a href=\"https://msdn.microsoft.com/en-us/library/ms810603.aspx\" rel=\"nofollow noreferrer\">Managing Heap Memory</a></li>\n</ul>\n<p><strong>Technical questions</strong></p>\n<blockquote>\n<ol>\n<li>how and where the heap gets allocated for a program?</li>\n</ol>\n</blockquote>\n<p>Heaps are memory pages <em>reserved</em> and <em>committed</em> upon creation (of the heap). The OS assigns designated pages and those are on the actual RAM and/or <a href=\"https://en.wikipedia.org/wiki/Paging\" rel=\"nofollow noreferrer\">Page File</a>.</p>\n<p>As I mentioned before, a process can have multiple heaps (but always has at least one, default, heap). Additional heaps are allocated and freed by the process at run-time, and a process can have a different amount of heaps depending to run-time logic.</p>\n<p>See above for a short description of how the default heap (or, more precisely the first heap, as a process may change it's default heap to a heap later allocated) is created.</p>\n<blockquote>\n<ol start=\"2\">\n<li>If I want to scan the heap for data, how would I get the memory address space?</li>\n</ol>\n</blockquote>\n<p>This slightly depends on the purpose and specific reasons and type of data you want to scan for. If you want to scan for data anywhere in the process's memory, you should use <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/aa366902(v=vs.85).aspx\" rel=\"nofollow noreferrer\"><code>VirtualQuery</code></a> or <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/aa366907(v=vs.85).aspx\" rel=\"nofollow noreferrer\"><code>VirtualQueryEx</code></a> for all <em>committed</em> memory pages. This won't only let you scan all available heaps, but will also let you scan the stack, the PE sections, and other memory used by the program (for example, pages allocated directly with <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/aa366887(v=vs.85).aspx\" rel=\"nofollow noreferrer\"><code>VirtualAlloc</code></a>).</p>\n<p>If you want to get the address range of a specific (or several heaps), you'll need to use some <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/aa366711(v=vs.85).aspx\" rel=\"nofollow noreferrer\">Heap memory functions, msdn</a> such as <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/aa366569(v=vs.85).aspx\" rel=\"nofollow noreferrer\"><code>GetProcessHeap</code></a> <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/aa366571(v=vs.85).aspx\" rel=\"nofollow noreferrer\"><code>GetProcessHeaps</code></a></p>\n</div>",
            "votes": "4",
            "user": "NirIzr",
            "time": "Mar 8, 2017 at 11:53",
            "is_accepted": true,
            "comments": [
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">what?  SizeOfStackReserve, SizeOfStackCommit, SizeOfHeapReserve, SizeOfHeapCommit are fields in the PE header and they are most definitely used for exactly that purpose.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">I'm not sure what you think I wrote contradicts your statement. I even mentioned stack size is set by the PE (\"although the PE can set the size of the allocated stack\")</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">Your short answer says that neither stack nor heap are part of the standard.  That is highly misleading, and your longer description does not help much to clarify.  The sizes are defined explicitly by the PE file. Only the location in memory is up to the OS.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">OP's original question was \"where in the PE file are the stack and heap\", so  I think I did a decent job clarifying the stack and heap are not <i>in</i> the PE, and that the OS allocates those (based on a PE provided sizes, yes, as both you and I mentioned).</span>",
                    "time": null
                }
            ]
        }
    ]
}