{
    "title": "edit CMD exe to not wait for confimation",
    "link": "https://reverseengineering.stackexchange.com/questions/14963/edit-cmd-exe-to-not-wait-for-confimation",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a small exe program that runs in a system32/cmd window, and when it is finished  running its small script it prompts the user to press enter to close.\n I want to simply have the application close once the process is finished wihtout having to enter a keystroke.  How can I edit .exe file to do this?</p>\n<p>Is there some line in HEX i can edit? What am I looking for?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "175",
    "tags": [
        "binary-editing"
    ],
    "user": "Kalamalka Kid",
    "time": "Mar 21, 2017 at 7:07",
    "comments": [
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">Is this \"press enter\" the only input from the keyboard that this program requires ?</span>",
            "time": null
        },
        {
            "user": "Kalamalka Kid",
            "text": "<span class=\"comment-copy\">yes it is (actually it says press any key, but enter is the only one that works to close it)</span>",
            "time": null
        },
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">Then you need to find a call to function getch(), getchar() or gets(). When you opening this executable in disassembler, do you see calls to these functions ?</span>",
            "time": null
        },
        {
            "user": "Kalamalka Kid",
            "text": "<span class=\"comment-copy\">like I sad below, im not an advanced coder. I just downloaded x32dbg and saw no references to any of those call to functions. I am a quick learner, but its a deep program.</span>",
            "time": null
        },
        {
            "user": "Kalamalka Kid",
            "text": "<span class=\"comment-copy\">can i send you the file?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<ol>\n<li>Get a decent Disassembler running (radare, IDA Pr0, BinaryNinja, x64dbg..)</li>\n<li>Find the string you are looking for in memory e.g. 'press enter ...'</li>\n<li>Look up the cross references to find the place in memory it's used for an API call</li>\n<li>Skip that part (look at later or earlier branches to patch, or just patch the bytes to jmp to the end / maybe a return will do the trick)</li>\n</ol>\n<p><strong>edit</strong></p>\n<p>The memory location you are looking for will do something like print the string utilizing printf and then wait for user input. In the end, it will return.</p>\n<p>Basically you can try to alter branch conditions through binary patching or you could try to do a hard binary patch. In the later case, you can just try to patch a return-statement instead of the input-waiting-function or insert a jump.</p>\n<p><a href=\"https://i.sstatic.net/U9Cgr.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/U9Cgr.png\"/></a></p>\n<p>NOP-ing out the highlighted call did the trick.</p>\n<p><strong>edit</strong></p>\n<p>Special regards to w s for in-chat guidance!</p>\n</div>",
            "votes": "3",
            "user": "Nordwald",
            "time": "Mar 21, 2017 at 7:10",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Kalamalka Kid",
                    "text": "<span class=\"comment-copy\">Step 3 and 4 things get a bit hard to understand. Im not an advanced coder.</span>",
                    "time": null
                },
                {
                    "user": "Kalamalka Kid",
                    "text": "<span class=\"comment-copy\">I have Binary Ninja now, and cant seem to figure out how to find 'Press Enter'</span>",
                    "time": null
                },
                {
                    "user": "Kalamalka Kid",
                    "text": "<span class=\"comment-copy\">hey i could really use your help again !</span>",
                    "time": null
                },
                {
                    "user": "Nordwald",
                    "text": "<span class=\"comment-copy\">you are always welcome to post another question - but please use a new question for it so people with similar problems may find it</span>",
                    "time": null
                }
            ]
        }
    ]
}