{
    "title": "How does new operator internally work in C++?",
    "link": "https://reverseengineering.stackexchange.com/questions/15044/how-does-new-operator-internally-work-in-c",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The articles explaining the internals of <code>malloc</code> and <code>free</code> in glibc are abundant in number. However, I'd like to know how dynamic memory management works in C++, specifically the nitty gritty of <code>new</code> and <code>delete</code> operators. My interest is in the internal data structure maintained as well as the allocation and de-allocation algorithms. What are a few good resources for the same?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "3k",
    "tags": [
        "c++",
        "memory"
    ],
    "user": "sherlock",
    "time": "Mar 29, 2017 at 8:29",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is somewhat compiler-specific but in most cases <code>new</code> and <code>delete</code> are basically thin wrappers around <code>malloc</code> and <code>free</code> (regarding the allocation of memory itself). Some additional C++ specifics regarding <em>new expressions</em> and the sequence of construction/destructions of classes and their members are described in the C++ standard (a nice summary is available at <a href=\"http://en.cppreference.com/w/cpp/language/new\" rel=\"noreferrer\">cppreference</a>). I have described some of the details pertaining to the MSVC++ implementation <a href=\"http://www.openrce.org/articles/full_view/23\" rel=\"noreferrer\">here</a></p>\n<p>A few additional wrinkles:</p>\n<ul>\n<li><p>a class can redefine a custom operator <code>new</code>/<code>delete</code> which will be called instead of the global one when constructing instances of that class. This can lead to tricky situations with polymorphic classes so the compiler may need to introduce a hidden <em>virtual destructor</em> function (see again my OpenRCE article).</p></li>\n<li><p>when allocating an array of classes, many compilers also embed a number of elements in the memory allocated for the array so that it can be destructed correctly. This is one of the reasons why mixing <code>delete</code> and <code>delete[]</code> can be  dangerous.</p></li>\n</ul>\n</div>",
            "votes": "8",
            "user": "Igor Skochinsky",
            "time": "Mar 29, 2017 at 8:33",
            "is_accepted": false,
            "comments": []
        }
    ]
}