{
    "title": "how to overcome setunhandledexceptionfilter in ollyDebugger?",
    "link": "https://reverseengineering.stackexchange.com/questions/15100/how-to-overcome-setunhandledexceptionfilter-in-ollydebugger",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am debugging a malware sample which is using <code>setunhandledexceptionfilter()</code> for anti-debugging. I don't know how to handle this.\nCan you guys please explain the <code>setunhandledexceptionfilter()</code> anti-debugging trick and how to overcome it in olly debugger?</p>\n<p>Thanks in advance.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ollydbg",
        "binary-analysis",
        "malware",
        "anti-debugging",
        "exception"
    ],
    "user": "xoreax",
    "time": "Apr 5, 2017 at 10:30",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>TL;DR: You should place a breakpoint at the address passed as the single parameter to <code>setunhandledexceptionfilter</code> and ignore the exception / pass the exception to the program.</p>\n<h2>A more detailed explanation</h2>\n<p><a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms680634(v=vs.85).aspx\" rel=\"noreferrer\">Here</a> you can see the documentation for <code>setunhandledexceptionfilter</code>, reading it if you didn't already might make things clearer for you.</p>\n<p>To make sure that user supplied function is called (see background for why) you should pass the exception to the program using olly. However, when you'll do that, the rest of the malware's code will execute from within the unhandled exception function and you'll lose control of the debugged program. To make sure you're still controlling the execution flow, you should place a breakpoint at the function passed as an argument to <code>setunhandledexceptionfilter</code>.</p>\n<h2>Some context and background</h2>\n<p><code>setunhandledexceptionfilter</code> is used to set a user provided function as the function called when exception was not handled by any exception handler, just before the process is terminated. That function should be in charge of object cleanups and clean termination in the case of an unhandled exception.</p>\n<p>There are several ways to use <code>setunhandledexceptionfilter</code> as an anti-debugging trick, but most will involve implementing a crucial part of the program inside the new unhandled exception handler, and then resume the rest of the code execution from within the exception handler.</p>\n</div>",
            "votes": "5",
            "user": "NirIzr",
            "time": "Apr 5, 2017 at 10:30",
            "is_accepted": false,
            "comments": [
                {
                    "user": "xoreax",
                    "text": "<span class=\"comment-copy\">still, i didn't get clear idea to handle the exception by manually using olly debugger. If you don't mind, pls give me the step by step explanation for handling the setunhandledexceptionfilter(). It will be very useful for me. I have entered the vtlink of my file here For ref:-    \"hxxps://www.virustotal.com/en/file/88e9568e6afc8cc82ac0ab7eea8b8fb4afa7edd20242043791488a070240a2ea/analysis/\"     Thanks..</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Perhaps edit the question with the specific issue you have or what you're unable to do?</span>",
                    "time": null
                }
            ]
        }
    ]
}