{
    "title": "Rebuilding a symbol table for a firmware binary",
    "link": "https://reverseengineering.stackexchange.com/questions/15128/rebuilding-a-symbol-table-for-a-firmware-binary",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to reverse engineer the <a href=\"http://www.linksys.com/EU/en/support/WAG120N\" rel=\"nofollow noreferrer\">Linksys WAG120N</a> router firmware. I've been able to unpack it and extract the bootloader, kernel and filesystem.</p>\n<p>The kernel is MIPS big endian. I loaded the kernel into IDA pro with start address of <code>0x80002000</code>. The entry point is <code>0x801B2040</code>.</p>\n<p>The problem I have now is that all the functions are named as <code>sub_</code>. I need a symbol table to help me reverse this binary. Binwalk doesn't find any symbol tables and I'm not sure how to rebuild a symbol table, as I am new to  this sort of stuff.</p>\n<p>I read a post <a href=\"https://reverseengineering.stackexchange.com/questions/4549/rebuild-symbol-table\">Rebuild symbol table</a>, but that was about static and shared libraries, which my kernel is not.</p>\n<p>Running <code>file</code> on my kernel gives</p>\n<pre><code>kernel: data\n</code></pre>\n<p>I don't know if the binary has a symbol table, but if it does, I don't know how to extract it. Or is there another way of reversing the binary?</p>\n<p>Any help is appreciated.</p>\n<p>EDIT: I have found what appears to be a symbol table. It has the libc string functions and lots of other functions. But there aren't many cross references to these function names in the disassembly. How do I use this? </p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ida",
        "disassembly",
        "symbols",
        "kernel"
    ],
    "user": "Aaron Garton",
    "time": "Apr 10, 2017 at 10:05",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">does <code>strings</code> produce anything that looks like function names?</span>",
            "time": null
        },
        {
            "user": "Aaron Garton",
            "text": "<span class=\"comment-copy\">@Igor Skochinsky Running the command <code>strings kernel | grep \"()\"</code> seems to give a few functions arguments. Here is the output: <a href=\"https://pastebin.com/XeMxQU19\" rel=\"nofollow noreferrer\">pastebin.com/XeMxQU19</a></span>",
            "time": null
        },
        {
            "user": "Aaron Garton",
            "text": "<span class=\"comment-copy\"><i>names</i> not  <i>arguments</i></span>",
            "time": null
        },
        {
            "user": "Aaron Garton",
            "text": "<span class=\"comment-copy\">I have found what appears to be a symbol table. It has many of the libc functions and lots of other functions. How do I use this?</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">add details to the post</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It sounds like you aren't sure what you want to do exactly. Is there any part of the firmware you want to reverse engineer in particular? I suggest you first start by reading some blog posts on <a href=\"http://www.devttys0.com\" rel=\"nofollow noreferrer\">devttys0.com</a>, as he seems like an excellent source for information about reverse-engineering router firmwares.</p>\n<p>If a binary contains symbols, IDA Pro should automatically load them for you. Very often router firmwares have had their symbols stripped. However, the Linux kernel is licensed under the GPL, meaning that the manufacturer is obligated to provide the source code for the kernel. And Linksys <a href=\"http://www.linksys.com/us/support-article?articleNum=114663\" rel=\"nofollow noreferrer\">does provide the source code</a> for your router's kernel; you can start by looking at that.</p>\n<p>Often, however, interesting stuff is in kernel modules and/or binaries in the rootfs, not the kernel itself. I downloaded the <a href=\"http://www.linksys.com/us/support-article?articleNum=156227\" rel=\"nofollow noreferrer\">firmware for your router</a> and extracted it with <code>binwalk -Mrev</code>, and binwalk was indeed able to extract the rootfs. Look through it to see if you can find anything interesting.</p>\n<p>As an example, let's look at the main web CGI binary, <code>usr/sbin/setup.cgi</code>. Running <code>file</code> against this file gives the following:</p>\n<pre><code>usr/sbin/setup.cgi: ELF 32-bit MSB executable, MIPS, MIPS-I version 1 (SYSV), dynamically linked, interpreter /lib/ld-uClibc.so.0, stripped\n</code></pre>\n<p>The binary has been stripped, but looking at the symbol table  with <code>readelf -s usr/sbin/setup.cgi</code>, we can still see quite a few interesting function names. Next, we can look at the strings in the binary with <code>strings</code>. (I personally prefer using <code>strings -n8</code> because often strings less than 8 characters are false positives, and when they aren't, they are usually unimportant anyways.) Often the strings of a binary can reveal quite a bit about what the binary does and how the binary works, and this is made easier by the fact that router manufacturers love using <code>system(3)</code> to run Linux shell commands.</p>\n<p>Once you know that you have found an interesting binary, you can then load it into IDA Pro to disassemble it and start reverse-engineering it.</p>\n</div>",
            "votes": "3",
            "user": "Hitechcomputergeek",
            "time": "Jun 6, 2017 at 14:03",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Aaron Garton",
                    "text": "<span class=\"comment-copy\">Thanks for the thorough answer :) Is <code>binwalk -Mrev</code> the same as <code>binwalk -eM</code>? And what is <code>system(3)</code>, is it the same as <code>system(cmd)</code>?</span>",
                    "time": null
                },
                {
                    "user": "Hitechcomputergeek",
                    "text": "<span class=\"comment-copy\">@user2556381 They are basically the same thing, <code>-r</code> deletes leftover files like .squashfs filesystems once they've been extracted and <code>-v</code> is just verbose mode. The <code>(3)</code> in <code>system(3)</code> refers to the manpage section number; numbers are specified to differentiate between different manpages with the same names, such as the <code>unlink</code> shell command vs the syscall. To view the manpage for <code>system(3)</code>, you would type <code>man 3 system</code> at the shell. (See <code>man man</code> for a list of these section numbers; this is the same as <code>man 1 man</code>.) The <code>system()</code> syscall is indeed called as <code>system(\"command\")</code> from C.</span>",
                    "time": null
                }
            ]
        }
    ]
}