{
    "title": "How can the problem posed for disassembly by the mixture of executable code and literal pools in ARM firmware be overcome?",
    "link": "https://reverseengineering.stackexchange.com/questions/15329/how-can-the-problem-posed-for-disassembly-by-the-mixture-of-executable-code-and",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<h2>Context and Background Information</h2>\n<h3>Part 1: ARM firmware compared to firmware for other architectures</h3>\n<p>I looked at the ARM firmware in these two questions:</p>\n<ul>\n<li><a href=\"https://reverseengineering.stackexchange.com/questions/15311/running-a-binary-identified-as-an-arm-excutable-by-binwalk-disasm\">Running a binary identified as an ARM excutable by binwalk --disasm</a></li>\n<li><a href=\"https://reverseengineering.stackexchange.com/questions/15006/approach-to-extract-useful-information-from-binary-file\">Approach to extract useful information from binary file</a></li>\n</ul>\n<p>and was baffled by the mixture of code with data, since I have looked at firmware for other architectures such as Ubicom, MIPSEL and MIPS and did not observe the same kind of intermingling of code and data as in the ARM firmware.</p>\n<p>Here are some visualizations of various binaries for context:</p>\n<p><strong>MIPSEL eCos firmware from <a href=\"https://reverseengineering.stackexchange.com/questions/11503/analysing-ecos-image\">Analysing eCos image</a></strong></p>\n<p><a href=\"https://i.sstatic.net/Dlff0.png\" rel=\"nofollow noreferrer\"><img alt=\"eCos firmware entropy plot (cropped)\" src=\"https://i.sstatic.net/Dlff0.png\"/></a>\n<a href=\"https://i.sstatic.net/n6Xzd.png\" rel=\"nofollow noreferrer\"><img alt=\"entropy visualization\" src=\"https://i.sstatic.net/n6Xzd.png\"/></a>\n<a href=\"https://i.sstatic.net/gMiSM.png\" rel=\"nofollow noreferrer\"><img alt=\"detail visualization\" src=\"https://i.sstatic.net/gMiSM.png\"/></a>\n<code>&lt;------------------------ code -------------------------&gt;&lt;---- images, ASCII----&gt;</code></p>\n<p><strong>Unknown instruction set, uC/OS firmware from <a href=\"https://reverseengineering.stackexchange.com/questions/15088/lzma-file-format-not-recognized-details-enclosed\">lzma: File format not recognized [Details enclosed]</a></strong></p>\n<p><a href=\"https://i.sstatic.net/m0WT7.png\" rel=\"nofollow noreferrer\"><img alt=\"CleverDOg camera firmware entropy plot (cropped)\" src=\"https://i.sstatic.net/m0WT7.png\"/></a>\n<a href=\"https://i.sstatic.net/Yjb2j.png\" rel=\"nofollow noreferrer\"><img alt=\"entropy visualization\" src=\"https://i.sstatic.net/Yjb2j.png\"/></a>\n<a href=\"https://i.sstatic.net/KgENq.png\" rel=\"nofollow noreferrer\"><img alt=\"detail visualization\" src=\"https://i.sstatic.net/KgENq.png\"/></a>\n<code>&lt;-------------------------- code??? ------------------------&gt;&lt;-- ASCII --&gt;</code></p>\n<p><strong>Ubicom32 SlingBox firmware from <a href=\"https://reverseengineering.stackexchange.com/questions/12292/need-help-extracting-yaffs-from-firmware-bin-file\">Need help extracting YAFFS from firmware .bin file</a></strong></p>\n<p><a href=\"https://i.sstatic.net/D7rQb.png\" rel=\"nofollow noreferrer\"><img alt=\"SlingBox firmware entropy plot (cropped)\" src=\"https://i.sstatic.net/D7rQb.png\"/></a>\n<a href=\"https://i.sstatic.net/336Pa.png\" rel=\"nofollow noreferrer\"><img alt=\"entropy visualization\" src=\"https://i.sstatic.net/336Pa.png\"/></a>\n<a href=\"https://i.sstatic.net/GMWhe.png\" rel=\"nofollow noreferrer\"><img alt=\"detail visualization\" src=\"https://i.sstatic.net/GMWhe.png\"/></a>\n<code>&lt;--------------------------- code -----------------------&gt;     &lt;- data -&gt;&lt; code &gt;</code></p>\n<p>A pattern appears to emerge, no? The executable code in the firmware images presented here is not so difficult to differentiate from data because it largely resides in 1 or 2 large, contiguous blocks.</p>\n<p>However, things are not so straightforward with the ARM firmware:</p>\n<p><strong>32-bit ARM firmware from <a href=\"https://reverseengineering.stackexchange.com/questions/15311/running-a-binary-identified-as-an-arm-excutable-by-binwalk-disasm\">Running a binary identified as an ARM excutable by binwalk --disasm</a></strong></p>\n<p><a href=\"https://i.sstatic.net/CiwZz.png\" rel=\"nofollow noreferrer\"><img alt=\"firmware entropy plot (cropped)\" src=\"https://i.sstatic.net/CiwZz.png\"/></a>\n<a href=\"https://i.sstatic.net/nJTOO.png\" rel=\"nofollow noreferrer\"><img alt=\"entropy visualization\" src=\"https://i.sstatic.net/nJTOO.png\"/></a>\n<a href=\"https://i.sstatic.net/n8fj4.png\" rel=\"nofollow noreferrer\"><img alt=\"detail visualization\" src=\"https://i.sstatic.net/n8fj4.png\"/></a></p>\n<p>Where is the code? Where is the data? There is no easily discernible separation like in the other firmware binaries.</p>\n<p><strong>Thumb-2 (16-bit + 32-bit) ARM firmware from <a href=\"https://reverseengineering.stackexchange.com/questions/15006/approach-to-extract-useful-information-from-binary-file\"></a></strong></p>\n<p><a href=\"https://i.sstatic.net/Dz1Bi.png\" rel=\"nofollow noreferrer\"><img alt=\"e-cig entropy plot (cropped)\" src=\"https://i.sstatic.net/Dz1Bi.png\"/></a>\n<a href=\"https://i.sstatic.net/REAp4.png\" rel=\"nofollow noreferrer\"><img alt=\"entropy visualization\" src=\"https://i.sstatic.net/REAp4.png\"/></a>\n<a href=\"https://i.sstatic.net/eO646.png\" rel=\"nofollow noreferrer\"><img alt=\"detail visualization\" src=\"https://i.sstatic.net/eO646.png\"/></a></p>\n<p>The situation is similar here.</p>\n<p>When the visualizations are juxtaposed, the differences become very obvious:</p>\n<p><a href=\"https://i.sstatic.net/WnQDD.png\" rel=\"nofollow noreferrer\"><img alt=\"MIPSEL, eCos\" src=\"https://i.sstatic.net/WnQDD.png\"/></a>\n<a href=\"https://i.sstatic.net/xmVsy.png\" rel=\"nofollow noreferrer\"><img alt=\"unknown\" src=\"https://i.sstatic.net/xmVsy.png\"/></a>\n<a href=\"https://i.sstatic.net/4IkNZ.png\" rel=\"nofollow noreferrer\"><img alt=\"Ubicom32, SlingBox\" src=\"https://i.sstatic.net/4IkNZ.png\"/></a>\n<a href=\"https://i.sstatic.net/dWmBO.png\" rel=\"nofollow noreferrer\"><img alt=\"ARM 32-bit, Panasonic picture frame\" src=\"https://i.sstatic.net/dWmBO.png\"/></a>\n<a href=\"https://i.sstatic.net/jLknH.png\" rel=\"nofollow noreferrer\"><img alt=\"ARM Thumb-2, SMOK CUBE thing\" src=\"https://i.sstatic.net/jLknH.png\"/></a></p>\n<p>The non-ARM firmware binaries in this sample have fairly clear code and data separation, which is helpful if we want to disassemble the code. However, identification of code and data looks to be quite  problematic in the case of the ARM firmware binaries.</p>\n<h3>Part 2: ARM Literal Pools</h3>\n<p>So why do the ARM firmware binaries look so different from the others? Why is there no clearly discernible separation of code and data? The answer seems to involve ARM literal pools.</p>\n<p>I'm including information about ARM literal pools here because it seems relevant and because it took forever for me to find out about them on my own, so hopefully this saves others some time.</p>\n<p>According to <a href=\"https://reverseengineering.stackexchange.com/questions/15311/running-a-binary-identified-as-an-arm-excutable-by-binwalk-disasm/15317#15317\">Ian Cook</a> (emphasis mine),</p>\n<blockquote>\n<p>...mixing of code and data is actually very common with ARM code.</p>\n<p>ARM instructions are fixed sizes (4 bytes on ARM, 2 bytes for THUMB) and have insufficient space to encode an 32 bit immediate value. Instead, ARM compilers usually do two things -</p>\n<ul>\n<li><p><strong>they place 32 bit immediate constants straight after the instructions for the function</strong> in which the constants are needed, and</p>\n</li>\n<li><p>they use PC-relative load instructions in the function to put these constants into registers.</p>\n</li>\n</ul>\n</blockquote>\n<p>This is similar to the information I found in the article <a href=\"http://benno.id.au/blog/2009/01/02/literal-pools\" rel=\"nofollow noreferrer\"><strong>The trouble with literal pools</strong></a>:</p>\n<blockquote>\n<p>So, what is a literal pool? I’m glad you asked. The literal pool is an area of memory (in the text segment), which is used to store constants. These constants could be plain numerical constants, but their main use is to store the address of variables in the system. These addresses are needed because the ARM instruction does not have any instructions for directly loading (or storing) an address in memory. Instead ldr and str can only store at a ±12-bit offset from a register. Now there are lots of ways you could generate code with this restriction, for example, you could ensure your data section is less than 8KiB in size, and reserve a register to be used as a base for all data lookups. But such approach only works if you have a limited data section size. The standard approach that is taken is that when a variable is used its address is written out into a literal pool. The compiler then generates two instructions, first to read the address from this literal pool, and the second is the instruction to access the variable.</p>\n<p>So, how exactly does this literal pool work? Well, so that a special register is not needed to point at the literal pool, the compiler uses the program counter (PC) register as the base register. The generated codes looks something like: <code>ldr r3, [pc, #28]</code>. That codes loads a value at a 28-byte offset from the current value of PC into the register r3. r3 then contains the address of the variable we want to access, and can be used like: <code>ldr r1, [r3, #0]</code>, which loads the value of the variable (rather than the address) into r1. Now, as the PC is used as the base for the literal pool access, it should be clear that the literal pool is stored close enough to the code that needs to use it.</p>\n<p><strong>To ensure that the literal pool is close enough to the code using it, the compiler stores a literal pool at the end of each function</strong>. This approach works pretty well (unless you have a 4KiB+ function, which would be silly anyway), but can be a bit of a waste.</p>\n</blockquote>\n<p>However, in the <a href=\"http://infocenter.arm.com/help/index.jsp?topic=/com.arm.doc.dui0473f/Bgbccbdi.html\" rel=\"nofollow noreferrer\">ARM documentation for literal pools</a>, it is stated that</p>\n<blockquote>\n<p>The assembler uses literal pools to hold certain constant values that are to be loaded into registers. <strong>The assembler places a literal pool at the end of each section</strong>. The end of a section is defined either by the END directive at the end of the assembly or by the AREA directive at the start of the following section. The END directive at the end of an included file does not signal the end of a section.</p>\n</blockquote>\n<p>I don't know jack about ARM, so this is confusing. I might make this a separate question. Anyway, the point is that literal pools appear to be the reason why code and data are mixed together in the ARM firmware visualized earlier. There is also something called <a href=\"http://infocenter.arm.com/help/index.jsp?topic=/com.arm.doc.dui0474f/Cegbbcjj.html\" rel=\"nofollow noreferrer\">scatterloading</a>, but I don't know if this has anything to do with the problem described here.</p>\n<h2>Question</h2>\n<p><strong>How can the problem posed for disassembly by the admixture of executable code and literal pools in ARM firmware be overcome?</strong></p>\n<p>According to <a href=\"https://reverseengineering.stackexchange.com/questions/15311/running-a-binary-identified-as-an-arm-excutable-by-binwalk-disasm/15317#15317\">Ian Cook (from the same answer as before)</a> (emphasis mine),</p>\n<blockquote>\n<p>It's usual to see the immediate constants stored after the function in order of the addresses of the functions that access them. So, in this case, the function ends with the instruction at 0x00000F5C and the immediate constants would appear to span the address range 0x00000F60 to 0x00000FFF and I would usually expect the following function to begin at address 0x00001000.</p>\n<p><strong>Knowing this it would be possible for a disassembler to identify this pattern and automatically skip the associated data.</strong></p>\n</blockquote>\n<p>Yes, how? I tried disassembling both the ARM 32-bit Panasonic picture frame firmware and the ARM Thumb-2 SMOK-X Cube contraption firmware with <code>radare2</code> but it seemed like data was being disassembled along with code.</p>\n<p>Since the location of literal pools after functions seems to be a common feature of ARM binaries, are existing disassemblers able to differentiate between code in functions and the data in their adjoining literal pools even when there aren't any symbols in the binary? This isn't the case with Capstone as far as I know.</p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "737",
    "tags": [
        "disassembly",
        "binary-analysis",
        "firmware",
        "arm",
        "disassemblers"
    ],
    "user": "julian",
    "time": "May 21, 2021 at 3:42",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">BTW one additional problem is switch tables used by instructions like TBB and TBH; these are also embedded in the code.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is indeed a problem for linear sweep disassemblers; recursive descent ones are mostly unaffected since they won't try to disassemble data if there are no code flows into it. However, there may be some heuristics/cheap tricks that might help even linear sweep disassemblers. Some that come to mind:</p>\n<ul>\n<li><p>while disassembling instructions, look for LDRs with PC-relative operands (as well as ADR instructions) and remember the target addresses; stop disassembly when reaching those addresses. </p></li>\n<li><p>in ARM mode, stop disassembly when decoded instructions have nonsensical conditions, especially when there is no preceding flag-setting instruction. </p></li>\n<li><p>gather some stats (e.g. n-gram frequencies) from binaries which do have symbols and use them to tell code from data. </p>\n<p>In the end, I don't think there is a good generic solution for this problem, so it may be even easier to just tune the approach for each specific target. </p></li>\n</ul>\n</div>",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "May 13, 2017 at 11:37",
            "is_accepted": true,
            "comments": [
                {
                    "user": "julian",
                    "text": "<span class=\"comment-copy\">Thank you. I found some good info on this site related to the statements in the first paragraph. For the second bullet point regarding nonsensical conditions, would a disassembler be able to make that kind of determination or does it typically require human interpretation of conditions?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">I imagine it should be possible to come up with some simple rules to detect most false positives.</span>",
                    "time": null
                }
            ]
        }
    ]
}