{
    "title": "Is it possible to restart over a program by calling an entry point function?",
    "link": "https://reverseengineering.stackexchange.com/questions/15339/is-it-possible-to-restart-over-a-program-by-calling-an-entry-point-function",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I was wondering if it was possible to restart a program <em>(ignoring previously mapped files)</em> with different argument by either calling <code>main()</code> or a glibc entry point function.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "153",
    "tags": [
        "linux",
        "exploit",
        "x86-64",
        "amd64"
    ],
    "user": "user2284570",
    "time": "May 13, 2017 at 17:41",
    "comments": [
        {
            "user": "user2284570",
            "text": "<span class=\"comment-copy\">I think the problem is about initializing what is already initialized <i>(like the stack or the heap)</i> isn’t it?</span>",
            "time": null
        },
        {
            "user": "PhoeniX",
            "text": "<span class=\"comment-copy\">It depends on what stage are you restarting. There would be issues with the program's internal constants, command parameters, all the threads that have been already spawn, all the allocated memory and etc... but technically you can do it, yes.</span>",
            "time": null
        },
        {
            "user": "user2284570",
            "text": "<span class=\"comment-copy\">@ph0sec my program doesn't spawn threads, however, it manage it's heap without glibc so that calling malloc can corrupt the heap. That's why I was thinking at restarting at an earlier entry point than point in order to allocate a new heap area.</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">are you planning to do fuzzing this way by any chance?</span>",
            "time": null
        },
        {
            "user": "user2284570",
            "text": "<span class=\"comment-copy\">@IgorSkochinsky fuzz what?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Well, while it's definitely <em>possible</em> to jump to the entrypoint of the program to try restarting it, there may be various consequences preventing correct execution, e.g.:</p>\n<ul>\n<li>library initialization has been run already, and running it a second time is not something most libraries expect</li>\n<li>various resources may have been allocated and variables initialized, so doing it again may not work.</li>\n</ul>\n<p>So what you can do is to cause the program to simulate termination <em>without actually exiting</em> and then jump to the entry point. Microsoft CRT provides <a href=\"https://msdn.microsoft.com/en-us/library/zb3b443a\" rel=\"nofollow noreferrer\">functions <code>_c_exit</code> and <code>_cexit</code></a> for such cpurpose, but it seems glibc <a href=\"https://github.com/lattera/glibc/blob/master/stdlib/exit.c\" rel=\"nofollow noreferrer\">does not have anything similar</a>. So you may have to simulate calling of the <code>atexit</code> handlers manually to perform cleanup.</p>\n</div>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "May 16, 2017 at 9:58",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user2284570",
                    "text": "<span class=\"comment-copy\">except in my case  I can only call one function.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">well, you can always just try and see if it works. If not, you'll need to figure out how to chain execution of multiple functions.</span>",
                    "time": null
                }
            ]
        }
    ]
}