{
    "title": "What are ways to find Windows constant macro definitions?",
    "link": "https://reverseengineering.stackexchange.com/questions/15345/what-are-ways-to-find-windows-constant-macro-definitions",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This happens a lot where when I am reversing a program in a disassembler or debugger, I run into something like this:</p>\n<pre><code>push    eax             ; lParam\npush    1               ; wParam\npush    80h             ; Msg\npush    ecx             ; hWnd\ncall    esi ; SendMessageA\n</code></pre>\n<p>In order to effectively reverse this, I need to know what 80h is. The problem is that when compiled (preprocessed), all of the Windows constant macros obviously get turned into numbers so I no longer have the semantic meanings. I also cannot go and search for \"SendMessage 0x80\" because there's no real context there either.</p>\n<p>The question is, what are some tips in figuring out a Microsoft Windows constant macro name when given only a function and a value like this? I was able to go to <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms644950(v=vs.85).aspx\" rel=\"nofollow noreferrer\">SendMessage</a> on MSDN and then from there, look at the Msg parameter which lead me to the <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms644927(v=vs.85).aspx#system_defined\" rel=\"nofollow noreferrer\">System-Defined Messages</a> page. However, like many other MSDN pages, this one only defines the macros by description, rather than provides a table of which value each one corresponds to. This has actually been a regular issue that I've ran into in reversing Windows applications. Another solution I've discovered is to try and locate the .h file for the corresponding macros online and then search for the value there. But this situation is less than ideal because I have no idea if the information is accurate up-to-date, but many times I also do not even know which header file would contain the definition.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "448",
    "tags": [
        "windows",
        "api"
    ],
    "user": "the_endian",
    "time": "May 14, 2017 at 18:59",
    "comments": [
        {
            "user": "PhoeniX",
            "text": "<span class=\"comment-copy\">There is no another way then analyze and extract those values from the H files. It's either your do it or wait for someone else. For most MS API there is a H file in the SDK, so that's the place to start.</span>",
            "time": null
        },
        {
            "user": "Simon Mourier",
            "text": "<span class=\"comment-copy\">This site <a href=\"http://www.magnumdb.com/\" rel=\"nofollow noreferrer\">magnumdb.com</a> compiles values from all Windows header files (280000+ values/constants...). But 0x80 is very common. In this case, since you know it's a windows message, you can use a specific query: <a href=\"http://www.magnumdb.com/search?q=title%3AWM%2A+AND+value%3A128\" rel=\"nofollow noreferrer\">magnumdb.com/search?q=title%3AWM%2A+AND+value%3A128</a> it will successfully return WM_SETICON as the best match</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>These constants are usually defined in the header file corresponds to the API function in use.\n<br/> <br/>\nYou can discover the name of the header file by going into MSDN's SendMessageA page, and looking at the <strong>Header</strong> row of the <strong>Requirements</strong> table at the bottom.\n<br/><br/>\nIn this case, the relevant header is <em>Winuser.h</em>, which you could find in the SDK corresponds to the development platform of the binary you're reversing. <br/>\n<br/>\nAfter looking at <em>Winuser.h</em> and searching for the constant, you'll find the next definition:</p>\n<pre><code>#define WM_SETICON                      0x0080\n</code></pre>\n<p>This process is a bit tedious, but that's the most accurate way to interpret WINAPI constants.</p>\n<p><br/>\nAnother thing you might do, if you use IDA for reversing, is to mark the constant and press <code>M</code>(for \"Use standard symbolic constant\").\n<br/><br/>\nThere, you could see all the possible constants that IDA resolved that match the value you marked, and filter that list by the context of the value. <br/>In this case, since you know it corresponds to a <strong>W</strong>indows <strong>M</strong>essage, the constant name starting with WM should be the one you're looking for. (this name prefix information could also be located in the link you provided)</p>\n</div>",
            "votes": "3",
            "user": "hcf",
            "time": "May 20, 2017 at 12:18",
            "is_accepted": false,
            "comments": []
        }
    ]
}