{
    "title": "How are addresses calculated from the values in x86 segment registers?",
    "link": "https://reverseengineering.stackexchange.com/questions/15542/what-does-fs-register-value-mean-in-x86-application",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>How are the 16-bit values in segment registers used to represent large memory addresses?</p>\n<pre><code>ES 0023 32bit 0(FFFFFFFF)\nCS 001B 32bit 0(FFFFFFFF)\nSS 0023 32bit 0(FFFFFFFF)\nDS 0023 32bit 0(FFFFFFFF)\nFS 003B 32bit 7FFDF000 (FFF)\nGS 0000 NULL\n</code></pre>\n<p>For instance, how does the <code>003B</code> in <code>FS</code> translate to <code>7FFDF000</code>? Why are the <code>0023</code> in <code>ES</code> and the <code>001B</code> in <code>CS</code> both apparently translating to <code>0</code>?</p>\n<p>I'm digging through the Intel manuals, but hoping someone here can help me out a tiny bit quicker than I can read those...</p>\n</div>",
    "votes": "5",
    "answers": 2,
    "views": "2k",
    "tags": [
        "windows",
        "ollydbg",
        "x86",
        "register",
        "segmentation"
    ],
    "user": "greenpiece",
    "time": "Aug 29, 2018 at 4:55",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In protected mode the segment selectors are indexes into the descriptor table (local or global one, depending on the TI bit of the selector). The descriptor entry describes the base address, limit (size) and some other attributes of the segment (data or code, 16- or 32-bit). For more info see the following links:</p>\n<ul>\n<li><a href=\"http://wiki.osdev.org/Global_Descriptor_Table\" rel=\"nofollow noreferrer\">Global Descriptor Table</a>;</li>\n<li><a href=\"http://duartes.org/gustavo/blog/post/memory-translation-and-segmentation/\" rel=\"nofollow noreferrer\">Memory Translation and Segmentation</a>.</li>\n</ul>\n<p>Windows usually sets up the selectors so that they map 1:1 directly to virtual addresses, that's why they all have base of 0. <code>fs</code> is the exception because it's used for quick addressing of the Thread Information Block (TIB) which is separate for each thread of each process.</p>\n<p>However, on 32-bit kernels you can in fact set up a custom selector mapping using the undocumented function <code>NtSetLdtEntries</code>. See here for more info:</p>\n<ul>\n<li><a href=\"http://j00ru.vexillium.org/?p=866\" rel=\"nofollow noreferrer\">Protected Mode Segmentation as a powerful anti-debugging measure</a>, by j00ru.</li>\n</ul>\n</div>",
            "votes": "5",
            "user": "perror",
            "time": "Aug 29, 2018 at 8:51",
            "is_accepted": false,
            "comments": [
                {
                    "user": "marshal craft",
                    "text": "<span class=\"comment-copy\">This, you use the segment descriptor which contains the base address + the offset equals the linear address I believe which is equal to the physical address if paging is not used? For real mode the segment selector is shifted two bits to get the segment base address.</span>",
                    "time": null
                },
                {
                    "user": "marshal craft",
                    "text": "<span class=\"comment-copy\">@ Igor Skochinsky can you have a look at quetion I asked on this site a few days ago?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You're looking at 32 bit registers (probably in a 32bit process). Since 32bit processors segment registers are rarely used as offset addresses for the simple reason 32 bit is enough to represent a pretty big address range. </p>\n<p>Instead, some segment registers (<code>CS</code>, <code>SS</code>, <code>DS</code>) are now used for permissions, memory protection and paging, while others are used as general purpose registers, or OS specific structures (such as <code>FS</code> in 32bit windows and <code>GS</code> in linux and 64bit windows).</p>\n<p>To find out more, I suggest you read about memory protection, protected mode, and modern OS memory management and paging.</p>\n</div>",
            "votes": "4",
            "user": "NirIzr",
            "time": "Jan 13, 2017 at 17:26",
            "is_accepted": false,
            "comments": []
        }
    ]
}