{
    "title": "Reverse Engineering ZyXel C1100Z modem firmware",
    "link": "https://reverseengineering.stackexchange.com/questions/15565/reverse-engineering-zyxel-c1100z-modem-firmware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>first time post so please bear with me.</p>\n<p>For days I have been trying to bypass a password my ISP has added to their remote CLI with no luck. </p>\n<p>I have a Zyxel C1100Z DSL modem that I've purchased from my ISP and I have been trying to breakdown their newest firmware in order to bypass a new shell password feature they've implemented. The past firmware did not have this feature and simply allowed you to login via ssh/telnet and then type 'sh' to drop into a simple Busybox shell. </p>\n<p>Now with the latest firmware, SSH seems to be severely broken/buggy, as does most of the CLI commands when you login over telnet (Cat,echo,netstat,etc.. do not function)</p>\n<p>Since this is a new feature, I have guessed that the password is either </p>\n<ol>\n<li>Hard-coded into a CLI binary</li>\n<li>Pulled from a configuration I have overlooked</li>\n<li>Pushed remotely from the ISP </li>\n</ol>\n<p>So far I have extracted the root-fs using binwalk and I've scoured many hours through each configuration, running strings to no end, I even tried to emulate MIPS using QEMU.</p>\n<p>Running file on one of the binaries gives me:\n<code>ELF 32-bit MSB executable, MIPS, MIPS32 version 1 (SYSV), dynamically linked, interpreter /lib/ld-uClibc.so.0, corrupted section header size</code></p>\n<p>I installed the old firmware hoping to get an idea of how the system worked and thought some of this info might prove useful:</p>\n<pre><code>system type             : 963168MBV_17A\nprocessor               : 0\ncpu model               : Broadcom4350 V8.0\nBogoMIPS                : 398.33\nwait instruction        : yes\nmicrosecond timers      : yes\ntlb_entries             : 32\nextra interrupt vector  : no\nhardware watchpoint     : no\nASEs implemented        :\nshadow register sets    : 1\ncore                    : 0\nVCED exceptions         : not available\nVCEI exceptions         : not available\nunaligned exceptions            : 60561\n</code></pre>\n<p>I've begun decompiling binaries using <a href=\"https://retdec.com/decompilation/\" rel=\"noreferrer\">https://retdec.com/decompilation/</a> but that has't gotten me very far.</p>\n<p>I have hosted the extracted firmware root in a git repo at <a href=\"https://github.com/bwbryant1/CTL_C110Z\" rel=\"noreferrer\">https://github.com/bwbryant1/CTL_C110Z</a></p>\n<p>I'm not asking for someone to do all of the work for me, mostly just some guidance as this is my first-attempt at reverse-engineering. Yes I have looked at past tutorials but none of the fit my firmware specifically and I have hit a brick wall.</p>\n<p>How does one add a password to a shell? I know you can with inittab but it doesn't seem like that is what they are doing. I have no idea where the shell password prompt gets called from but I do know the text for it is stored inside /lib/private/libcms_cli.so. But I am not sure what this is. </p>\n<p>Thank you</p>\n<p>Edit for clarification: I have ssh and telnet access but they do not give you access to the root-fs. It drops you into a kind of chrooted environment with limited capabilities. However, by typing \"sh\" you are prompted with \"Please type in shell password:\" and it doesn't ask for a username, only a pass</p>\n</div>",
    "votes": "10",
    "answers": 1,
    "views": "5k",
    "tags": [
        "disassembly",
        "firmware",
        "linux",
        "embedded",
        "mips"
    ],
    "user": "Brandon Bryant",
    "time": "Jun 17, 2017 at 6:20",
    "comments": [
        {
            "user": "Digger",
            "text": "<span class=\"comment-copy\">Brandon, if you figure out a shell password, please post same. I'm currently not able to call up a shell in a Zyxel C<b>2</b>100Z modem, which is distributed exclusively (as far as I can tell) by CenturyLink</span>",
            "time": null
        },
        {
            "user": "Brandon Bryant",
            "text": "<span class=\"comment-copy\">try supervisor:zyad1234</span>",
            "time": null
        },
        {
            "user": "Digger",
            "text": "<span class=\"comment-copy\">After logging into the modem's console (via SSH) using my personal username/password combo, I attempted to get a shell up.  I tried the following passwords: <code>supervisor:zyad1234</code> and <code>zyad1234</code>.  Neither one worked.  I then backed out of the console and tried logging in using the username <code>supervisor</code> and the password <code>zyad1234</code> with no joy.  I then tried logging in using a username of <code>admin</code> and the password <code>1234</code>.  I then got the message <code>Connection closed by 192.168.0.1</code>.  Now, I can't get back in, even with my personal username/password...</span>",
            "time": null
        },
        {
            "user": "Brandon Bryant",
            "text": "<span class=\"comment-copy\">I think from what I've learned there is a 15 minute timeout after 3-4 failed logins</span>",
            "time": null
        },
        {
            "user": "Digger",
            "text": "<span class=\"comment-copy\">Yeah, Brandon, I tried logging in after a 2 two hour wait and got back in.  Still can't figure out the shell password, though...</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The password seems to be generated dynamically from /etc/profile</p>\n<blockquote>\n<p>...<br/>\n   # generate login files<br/>\n   echo \"supervisor:3Gnc.CJE1790M:0:0:Administrator:/:/bin/sh\" &gt; /var/passwd<br/>\n   echo \"root::0:root,supervisor,support,user\" &gt; /var/group<br/>\n   ...<br/></p>\n</blockquote>\n<p>You would need to try to crack the DES hash with a program like John the Ripper or replace it with another known password or nothing.</p>\n</div>",
            "votes": "5",
            "user": "cimarron",
            "time": "Jun 16, 2017 at 22:12",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Brandon Bryant",
                    "text": "<span class=\"comment-copy\">Thank you for looking into this, cimarron. I did crack that password, it gave me <code>supervisor:zyad1234</code> unfortunately its not accepting this user/pass combo on ssh or telnet. I still haven't reset to factory and tried the credentials. There could some configuration being overwritten or this might be deprecated</span>",
                    "time": null
                },
                {
                    "user": "cimarron",
                    "text": "<span class=\"comment-copy\">It appears there is another generated one in /etc/miniboot.sh:  <code>echo 'admin:tP2w1wFvu8GXo:0:0:Administrator:/:/bin/sh' &gt; /var/passwd</code> which is just a username of admin and password 1234. Have you already tried that one?</span>",
                    "time": null
                },
                {
                    "user": "Brandon Bryant",
                    "text": "<span class=\"comment-copy\">Yeah. I've cracked everything that's in plaintext and unfortunately none of them work. Thank you!</span>",
                    "time": null
                },
                {
                    "user": "cimarron",
                    "text": "<span class=\"comment-copy\">I see your issue now. Sorry, I thought your problem was in the login but your edit cleared it up. It does indeed look like libcms_cli.so is responsible for the  additional password prompt. I did a little reversing and found it seems to just do a plaintext password comparison of what you enter with a password it gets from somewhere; I didn't spend too much time trying to figure it out but it comes from some cmsobject. Anyway, you should be able to patch address 0x617c to a nop instruction (00 00 00 00) previously a bnez v0, 0x6194 (14 40 00 05) which should bypass the string unequal comparison</span>",
                    "time": null
                },
                {
                    "user": "Brandon Bryant",
                    "text": "<span class=\"comment-copy\">Awesome thank you! I believed I was on the right track, I just had no idea how to begin decoding the MIPS assembly. Now to just get that file uploaded to a read only filesystem. I requested the source code from zyxel under GPL requests and once I get that I should (hopefully) be able make my own firmware update. In the mean time, the firmware mod kit, FMK, doesn't have support for extracting and then rebuilding jffs2 images so I'm going to have to try on my own with the mkfs.jffs2 command. Again thank you, that helps me out tremendously</span>",
                    "time": null
                }
            ]
        }
    ]
}