{
    "title": "I have a question about SEH Overwrite",
    "link": "https://reverseengineering.stackexchange.com/questions/15581/i-have-a-question-about-seh-overwrite",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying SEH Overwrite for vulnerable test programs.</p>\n<p>However, overwriting the RET and SEH chains through 41414141 (input value) does not cause the EIP to run as 41414141.</p>\n<p>The picture is that the security cookie function is normally executed even though I overwrote the SEH Chain with 41414141.</p>\n<p>Could you advise me on this?</p>\n<p>I have attached the assembly code here.</p>\n<p>link : <a href=\"https://pastebin.com/ic9bzw20\" rel=\"nofollow noreferrer\">https://pastebin.com/ic9bzw20</a></p>\n<p>The picture overrides the SEH Chain with 41414141, but is where the Security cookie function is executed.</p>\n<p><a href=\"https://i.sstatic.net/zuFfY.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/zuFfY.png\"/></a></p>\n<p>Thanks.</p>\n</div>",
    "votes": "0",
    "answers": 2,
    "views": "853",
    "tags": [
        "exploit",
        "seh"
    ],
    "user": "khm11903",
    "time": "Aug 20, 2017 at 7:02",
    "comments": [
        {
            "user": "Kerim Can Kalıpcıoğlu",
            "text": "<span class=\"comment-copy\">If there is no legal concern, please share program with us.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The SEH overwrite attack requires that the function has registered an SEH handler.  The SEH handler address exists below the stack cookie and return address.  If you've overwritten the return address then you've written too many data.</p>\n<p>The chain's integrity will be checked, and there must be executable memory at the handler address (i.e. 0x41414141) for the handler to execute.  In modern Windows, the address is checked before the transfer will occur, so you won't see any exception at that address if it's not valid.  It just won't be reached.</p>\n</div>",
            "votes": "1",
            "user": "peter ferrie",
            "time": "Jun 19, 2017 at 18:08",
            "is_accepted": false,
            "comments": [
                {
                    "user": "khm11903",
                    "text": "<span class=\"comment-copy\">Thank you for your reply. I am currently testing on Windows XP. What should I identify to solve the problem?</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">after overwriting the SEH, you need the function to raise an exception instead of returning normally.  If you can't achieve that, then the overwrite won't have any effect.</span>",
                    "time": null
                },
                {
                    "user": "khm11903",
                    "text": "<span class=\"comment-copy\">I saw the answer late! Thank you for your help.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are two things you must check:</p>\n<ol>\n<li>You overwritten exception handler but, is there any exception occurs?</li>\n<li>Are there any protection mechanism active for exception handlers?</li>\n</ol>\n<p>For first one, most easy exception which you can trigger and not caught until your handler is obviously <strong>access violation</strong>. You can try to trigger an exception with overwrite a value which referenced before stack cookie checked. Try to overwrite as long as possible for increasing your chance.</p>\n<p>There may be another methods like overwriting some variables and structures but not overwriting stack cookie depending your example. Most of the times compiler arranges overflowing buffers close to stack cookie.</p>\n<p>For second one, there may be SafeSEH on and off modules loaded in program memory. But, it is not matter for this stage. Despite SafeSEH, SEHOP (Structured Exception Handling Overwrite Protection) may be blocking program to access exception handler. <strong>If you done all tests on Windows XP</strong> most probably your problem is not SEHOP. I couldn't find proper resources if Microsoft published any update including SEHOP for Windows XP, last time I checked there is no SEHOP support for Windows XP.</p>\n<p><a href=\"https://i.sstatic.net/caCjj.jpg\" rel=\"nofollow noreferrer\"><img alt=\"Picture from SYSDREAM article\" src=\"https://i.sstatic.net/caCjj.jpg\"/></a></p>\n<p>SEHOP specifications need two things to be assured according to <a href=\"https://www.scribd.com/document/50749469/sehop-en\" rel=\"nofollow noreferrer\">this</a> article:</p>\n<ul>\n<li>Each SEH structure points to the next structure.</li>\n<li>Last one contains a specific handler pointing to ntdll!_except_handler4</li>\n</ul>\n</div>",
            "votes": "1",
            "user": "Kerim Can Kalıpcıoğlu",
            "time": "Aug 19, 2017 at 12:17",
            "is_accepted": false,
            "comments": []
        }
    ]
}