{
    "title": "Extracting embedded dlls from .NET executable",
    "link": "https://reverseengineering.stackexchange.com/questions/15591/extracting-embedded-dlls-from-net-executable",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a .NET executable that apparently has some embedded DLLs. It's just one standalone executable. I opened this executable with JetBrains dotPeek and ILSPY, both decomiplier are showing DLL names under \"Reference\" but can't locate where those dlls are. ILSpy example:</p>\n<p><a href=\"https://i.sstatic.net/civOU.png\" rel=\"nofollow noreferrer\"><img alt=\"ilspy example\" src=\"https://i.sstatic.net/civOU.png\"/></a></p>\n<p>As you can see, I can't expand those DLLs to see what inside. I suspect that ILmerge similar utility is used to combine dlls inside a standalone exe. I wonder if it's possible to extract those dlls.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "3k",
    "tags": [
        "malware",
        ".net",
        "c#",
        "binary-format"
    ],
    "user": "Anthony J.",
    "time": "Jun 19, 2017 at 13:29",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>They are not inside the application, there should be somewhere on your machine and will be loaded at runtime. You can use <a href=\"https://technet.microsoft.com/en-us/sysinternals/bb896645.aspx\" rel=\"nofollow noreferrer\">Process Monitor</a> to check from where they are loaded.</p>\n<p>ILSpy should be able to go into those DLLs so if it can't it might be an indication that it can't find them.</p>\n</div>",
            "votes": "2",
            "user": "Paweł Łukasik",
            "time": "Jun 19, 2017 at 13:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Anthony J.",
                    "text": "<span class=\"comment-copy\">thanks for reply. Yea, ILSpy can't find those dlls, neither dotPeek does. I used Process Monitor and launched the application, when searching through Process Monitor logs for dll name, it shows few hits of \"PATH NOT FOUND\" and \"Name NOT FOUND\", that's all. It seems like it's trying to locate this dll in same working directory and it can't find it. The application is self contained and it works fine, everything inside one exe and you can run on fresh machine with just .NET framework and it works fine too.</span>",
                    "time": null
                },
                {
                    "user": "Paweł Łukasik",
                    "text": "<span class=\"comment-copy\">if that's the case then the dlls might be somewhere else. Check Resources - maybe there's something there. .NET gives you the ability to see the whole source code so the code for extracting those should also be there</span>",
                    "time": null
                },
                {
                    "user": "Anthony J.",
                    "text": "<span class=\"comment-copy\">I checked resources and I couldn't find it. is possible that it's extracting those dlls to memory and loading those dlls from there? if you are interested you can find the one legit utility that is using this technique here: <a href=\"https://we.tl/BsR70rNuvb\" rel=\"nofollow noreferrer\">we.tl/BsR70rNuvb</a></span>",
                    "time": null
                },
                {
                    "user": "Paweł Łukasik",
                    "text": "<span class=\"comment-copy\">might be possible - but it's sounds a lot of trouble to do so. Anyway - the code is there. Why not opening it in dnSpy, debug and see what's going on?</span>",
                    "time": null
                },
                {
                    "user": "Anthony J.",
                    "text": "<span class=\"comment-copy\">yep you already mentioned resources but at that time I couldn't open extracted resources so I though they are not there. Anyway, I did what libZ developer said here: <a href=\"https://github.com/MiloszKrajewski/LibZ/issues/17\" rel=\"nofollow noreferrer\">github.com/MiloszKrajewski/LibZ/issues/17</a>. it looks like extracted file are compressed or encrypted, I'm just trying to figure this out now. thanks.</span>",
                    "time": null
                }
            ]
        }
    ]
}