{
    "title": "Visual View in radare2 while debugging",
    "link": "https://reverseengineering.stackexchange.com/questions/15609/visual-view-in-radare2-while-debugging",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am using radare2 in debugging mode (r2 -d ./program).\nI set up a breakpoint at a certain address (<code>db 0x12341234</code>)\nAnd next I have entered Visual View using: <code>V!</code></p>\n<p>Following some tutorials, I saw them using '<code>s</code>' to switch to the next instruction, but that isn't working for me.\nAlso this is not working:</p>\n<blockquote>\n<p>Maybe a simpler method to use debugger in radare is to switch it to visual mode. That way you will not have to remember many commands nor to keep program state in your mind. To enter visual mode use <code>V</code>:</p>\n<pre><code>[0xB7F0C8C0]&gt; V\n</code></pre>\n<p>The initial view after entering visual mode is a hexdump view of current target program counter (e.g., EIP for x86). Pressing <code>p</code> will allow you to cycle through the rest of visual mode views. You can press <code>p</code> and <code>P</code> to rotate through the most commonly used print modes. Use <kbd>F7</kbd> or s to step into and <kbd>F8</kbd> or <code>S</code> to step over current instruction. With the <code>c</code> key you can toggle the cursor mode to mark a byte range selection (for example, to later overwrite them with <code>nop</code>). You can set breakpoints with <kbd>F2</kbd> key.</p>\n</blockquote>\n<p>Any key I would press does nothing. Am I missing something or?</p>\n<p><a href=\"https://i.sstatic.net/7XXna.png\" rel=\"noreferrer\"><img alt=\"\" src=\"https://i.sstatic.net/7XXna.png\"/></a></p>\n<p>I am talking about this view.</p>\n</div>",
    "votes": "7",
    "answers": 1,
    "views": "11k",
    "tags": [
        "disassembly",
        "radare2"
    ],
    "user": "Florin",
    "time": "Jun 17, 2020 at 9:54",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">what version of radare?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First of all, make sure you run the latest version of radare2 from git repository:</p>\n<pre><code>$ git clone https://github.com/radare/radare2.git\n$ cd radare2\n$ ./sys/install.sh\n</code></pre>\n<p>If you don’t want to install the git version or you want the binaries for another machine (Windows, OS X, iOS, etc) check out the <a href=\"http://radare.org/r/down.html\" rel=\"noreferrer\">download page</a> at the radare2 website.</p>\n<p>radare2 has several different Visual Views, before I'll explain them - please analyze the program using <code>aa</code> and seek to a function using <code>s &lt;function_name&gt;</code>. You can list the functions recognized by radare2 using <code>afl</code>.</p>\n<ul>\n<li><code>V</code> - The basic Visual Mode. You can toggle between the views using\n<code>p</code> and <code>P</code>.</li>\n<li><code>VV</code> - Visual Graph Mode, Displays an ASCII graph\nview. Again you can toggle between the views using <code>p</code> and <code>P</code>.  </li>\n<li><code>V!</code> - Visual Panels Mode, which is the mode you attached to your\nquestion.</li>\n</ul>\n<p>In each of the modes mentioned above you can press <code>?</code> in order to list the commands available. The commands varies between the different modes.</p>\n<p>Pressing <code>s</code> and <code>S</code> inside a Visual view while debugging will step-in and step-over respectively. radare will automatically sync the view with <code>eip</code> on every step.<br/>\nIn Visual Panels Mode (<code>V!</code>) you can use <code>TAB</code> to navigate between the panels and h/j/k/l to move inside the view/panel.<br/>\nYou can run r2 commands from inside Visual Mode using <code>:</code> (ie. <code>s 0x00402c1e</code>).  </p>\n<p>If it still doesn't work and you believe it's a problem with radare please <a href=\"https://github.com/radare/radare2/issues\" rel=\"noreferrer\">open an issue</a> and the great contributors of radare2 will be happy to help you.</p>\n</div>",
            "votes": "11",
            "user": "Megabeets",
            "time": "Jun 20, 2017 at 11:06",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Florin",
                    "text": "<span class=\"comment-copy\">Thank You, it was a nice answer. Apparently I had an older version :3</span>",
                    "time": null
                }
            ]
        }
    ]
}