{
    "title": "Reverse engineering flexlm license management",
    "link": "https://reverseengineering.stackexchange.com/questions/1567/reverse-engineering-flexlm-license-management",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a 3D driver from the early 90's for Solaris 2.5-2.6 Sparc that uses flexlm to handle license management. How would I go about either circumventing or removing it for computer archeology/hobby development purposes. Also note that the original company probably doesn't even know this software exists anymore (unless you think there might be a market for OpenGL 1.1 CAD running on 50Mhz hardware ;) ).</p>\n<p>I understand there are SDKs avaiable for flexlm that somehow allow you to circumvent things but I don't think I follow how it works well. Also I have noticed that there are hostname modification tools that allow you to spoof your hostname... preferably I wouldn't want to do something like that but rather circumvent it entirely as I undestand it isn't all that strong of a protection anyway. It would be nice if this work work for other period software as well... </p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "10k",
    "tags": [
        "sparc",
        "solaris",
        "driver",
        "digital-archeology"
    ],
    "user": "cb88",
    "time": "Apr 4, 2013 at 11:04",
    "comments": [
        {
            "user": "asheeshr",
            "text": "<span class=\"comment-copy\">Is <code>digital archaeology</code> the correct term ? Even Wikipedia doesnt know it -&gt; <a href=\"http://en.wikipedia.org/wiki/Digital_Archaeology\" rel=\"nofollow noreferrer\">en.wikipedia.org/wiki/Digital_Archaeology</a> refers to an annual exhibition</span>",
            "time": null
        },
        {
            "user": "cb88",
            "text": "<span class=\"comment-copy\">The process of retrieving information from damaged, fragmentary, and archaic data <a href=\"http://www.cs.cornell.edu/wya/diglib/ms1999/glossary.html\" rel=\"nofollow noreferrer\">cs.cornell.edu/wya/diglib/ms1999/glossary.html</a></span>",
            "time": null
        },
        {
            "user": "cb88",
            "text": "<span class=\"comment-copy\">I think my usage is extending it a bit.. but it still seems perfectly vaild to me. I am reverse engineering a driver to restore a system to how it would have function in use the licensing could be considered a form of self inflicted damage.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@AshRj: why not? I've referred to myself as a \"software archaeologist\" at times.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@cb88: it sounds a bit too localized. No one here will be able to give more than generic advice what we have done in the past or would do, given the scenario. It may or may not help with your problem at hand. It might make sense to post some relevant disassembly?!</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>CrackZ still has one of the best references on FLEXlm.\n<a href=\"http://www.woodmann.com/crackz/\" rel=\"nofollow\">http://www.woodmann.com/crackz/</a></p>\n<p>That stuff went thru a couple of iterations. The documents there are mostly Windows stuff but they are helpful to understand the whole system.</p>\n<p>Good luck on that project, should be fun to crack for Sparc :-)</p>\n</div>",
            "votes": "4",
            "user": "fG-",
            "time": "Apr 5, 2013 at 10:57",
            "is_accepted": false,
            "comments": []
        }
    ]
}