{
    "title": "Dump Sequence Data from Casio electronic keyboard",
    "link": "https://reverseengineering.stackexchange.com/questions/15714/dump-sequence-data-from-casio-electronic-keyboard",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I’m not quite sure whether this is the right website to post this on but...</p>\n<p>I want to try and dump sequence data from a Casio Keyboard default soundbank</p>\n<p>I believe it’s stored on a ROM chip of some description, but I’m not sure which one.</p>\n<p>I have no idea how this would be done, but I’m interested to learn how.</p>\n<p>Thanks</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "169",
    "tags": [
        "hardware",
        "dumping"
    ],
    "user": "Joshua Stokes",
    "time": "Jun 29, 2017 at 9:55",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<h3>First Step: Research</h3>\n<p>First off just do some research on your product. See if anyone has done any research or reverse engineering on your particular keyboard model. If no one has done any work on it before you will have to venture off on your own.</p>\n<h3>Second Step: Disassembly</h3>\n<p>You will probably need to open up the keyboard if the developers didn't include some kind  of external debugging port. When you open the case of the keyboard, take pictures of exactly how you took it apart so you can reassemble it.</p>\n<h3>Third Step: Debugging Port</h3>\n<p>Once it's apart you will want to look for some kind of debugging pins or headers. Most of the time this comes in the form of JTAG headers. There is plenty of information on the internet of how to interface with these.</p>\n<h3>Fourth Step: Being Creative</h3>\n<p>If you don't believe there is a debugging interface that could become tricky. We know the information is on the circuit board we just need to discover where it is. Look for either some form of flash memory component or a chip with several pins coming out of it. Sometimes manufacturers purposely prevent people from reverse engineering their product. This comes in the form of <a href=\"https://electronics.stackexchange.com/questions/9137/what-kind-of-components-are-black-blobs-on-a-pcb\">Glob top</a> and other nefarious methods.</p>\n<p>If you want you can post some more information about your keyboard (dissassembly pictures, model number, serial numbers, etc..) and the site can help you out more. Don't get discouraged if all of this feels overwhelming.</p>\n</div>",
            "votes": "2",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": []
        }
    ]
}