{
    "title": "Calling Swift 4 methods from C",
    "link": "https://reverseengineering.stackexchange.com/questions/15725/calling-swift-4-methods-from-c",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have earlier been able to call Swift methods using a function pointer from C, and providing the appropriate arguments because the calling convention was the same.</p>\n<p>Unfortunately this no longer works. This is because Swift has added a \"call context\" argument that is passed in a separate register (r13) from the normal arguments. For regular method calls, this context is a pointer to self. See here for more info: <a href=\"https://github.com/apple/swift/blob/master/docs/ABIStabilityManifesto.md#calling-convention\" rel=\"nofollow noreferrer\">https://github.com/apple/swift/blob/master/docs/ABIStabilityManifesto.md#calling-convention</a></p>\n<p>So in order to call these methods, I need to be able to reliably set r13 to the appropriate value from C.</p>\n<p>How can I do this in clang/llvm?</p>\n<p>I do not find a way to declare a register variable to a specific register (gcc syntax for that does not work). So I have code like this:</p>\n<pre><code>void (*my_fp)(void *) = find_pointer();\nvoid *instance = find_instance();\nvoid *arg1 = whatever();\nasm {\n    mov r13, [instance]\n}\nmy_fp(arg1);\n</code></pre>\n<p>It might or might not work - sometimes the compiler clobbers r13 immediately by using it for the function pointer. Also I guess it's not particularly safe to just write to that register without the compiler's consent.</p>\n<p>Is there a reliable way to do this?</p>\n<p>(By the way, I am not able to include the Swift runtime in my code, so I must be able to call from C.)</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "c",
        "osx",
        "llvm"
    ],
    "user": "sdsykes",
    "time": "Jun 30, 2017 at 10:04",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>a good, \"semiofficial\" approach can be found here:</p>\n<p><a href=\"https://forums.swift.org/t/best-way-to-call-a-swift-function-from-c/9829/3\" rel=\"nofollow noreferrer\">https://forums.swift.org/t/best-way-to-call-a-swift-function-from-c/9829/3</a></p>\n<p>(Quinn is by far the best apple programmer ever existed) :)</p>\n</div>",
            "votes": "0",
            "user": "ingconti",
            "time": "Dec 1, 2018 at 6:09",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Hi and welcome RE.SE. Answers like yours are not seen favorably on StackExchange for one reason: link rot. It's very common that a link like yours goes stale and then your answer becomes useless (no matter how many upvotes it may have gathered at that point). Please include relevant portions of the approach linked either by explaining them in your own words or quoting relevant parts (without quoting excessively and actually infringing on the copyright of the linked resource). Nothing wrong with links, but your answer should be able to stand alone without the link.</span>",
                    "time": null
                }
            ]
        }
    ]
}