{
    "title": "BinDiff says Diff Binary does not exist",
    "link": "https://reverseengineering.stackexchange.com/questions/15861/bindiff-says-diff-binary-does-not-exist",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm using BinDiff to perform diff operation between two 32-bit Binaries (one of them is a DLL and the other one an EXE).</p>\n<p>When I perform the Diff Operation, I get the error message:</p>\n<blockquote>\n<p>Adding new Diff to workspace failed. Diff binary does not exist.</p>\n</blockquote>\n<p>I am using IDA Pro version 6.9.160222 and BinDiff version 4.2.0</p>\n<p>I opened each of the binaries with IDA Pro and saved the IDB file.\nBinDiff was launched using bindiff.cmd (which in turn launches the bindiff.jar)</p>\n<p>From the GUI, I created a New Work Space and then from the menu, Diffs -&gt; New Diff</p>\n<p>For the Primary and Secondary source, I selected the IDB files corresponding to each of the binaries. Now, when I press Diff, it gives the error message: \"Adding new Diff to workspace failed. Diff binary does not exist.\"</p>\n<p>Why is it not able to locate the Diff Binary?</p>\n<p>Both differ.exe and differ64.exe are present in the same directory as bindiff.jar</p>\n<p>Another option I tried was in IDA Pro, instead of saving the IDA, I used the BinExport plugin to save the BinExport Files. Even when BinDiff uses the BinExport files saved from IDA Pro, I get the same error message.</p>\n<p>My OS Version is: Win 7 64-bit.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ida",
        "bin-diffing",
        "tool-bindiff"
    ],
    "user": "Neon Flash",
    "time": "Jun 19, 2018 at 12:08",
    "comments": [
        {
            "user": "joxeankoret",
            "text": "<span class=\"comment-copy\">As an alternative, you might consider using Diaphora instead of BinDiff if it doesn't work at all for a reason.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@joxeankoret: you should really plug Diaphora more often. Great tool. Thanks for creating and maintaining it.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I think there is a problem with BinExport. </p>\n<p>When I used BinNavi, there was similar problem. BinExport was not compatible with my IDA version. </p>\n<p>The IDB file structure differs for each version of IDA.\nAccess the following URL and Check which version of IDA is supported by BinExport. </p>\n<p><a href=\"https://github.com/google/binexport\" rel=\"nofollow noreferrer\">https://github.com/google/binexport</a></p>\n</div>",
            "votes": "1",
            "user": "Seong-Kyun",
            "time": "Jul 24, 2017 at 2:45",
            "is_accepted": false,
            "comments": []
        }
    ]
}