{
    "title": "How to decrypt encrypted script files for a game?",
    "link": "https://reverseengineering.stackexchange.com/questions/15892/how-to-decrypt-encrypted-script-files-for-a-game",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I want to mod Tony hawks underground 2. </p>\n<p>I noticed that the files in a folder <code>scripts</code> (down the game's directory tree), are all encrypted. </p>\n<p>Where do I start if I want to decrypt them?</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "13k",
    "tags": [
        "decryption"
    ],
    "user": "J. Czekaj",
    "time": "Aug 22, 2017 at 20:46",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are two noteworthy communities dedicated to reversing file formats with video games: <a href=\"http://forum.xentax.com/\" rel=\"noreferrer\">XeNTaX</a> and <a href=\"http://zenhax.com/index.php\" rel=\"noreferrer\">ZenHAX</a></p>\n<p>Both of them have their own respective applications used for creating scripts that unpack files (and sometimes, repack). Those programs are MultiEx (from XeNTaX) and QuickBMS (from ZenHAX). There are tutorial sections on each site where you can learn about reverse engineering file formats and creating scripts; however, this is by no means an easy or simple thing.</p>\n<p>There are also mod sections on each respective forum, which may interest you. But before trying to go down that route from scratch, you could try doing a Google search for <em>QuickBMS Tony Hawk Underground 2</em> or <em>MultiEx Tony Hawk Underground 2</em>. I'm not sure if it's relevant to the version you're looking to mod, but <a href=\"http://zenhax.com/viewtopic.php?t=3553\" rel=\"noreferrer\">here's a result</a> for a QuickBMS script.</p>\n<p>In lieu of that, you can try searching for general unpackers or mod tools already made specifically for a game. Ultimately, the idea is this: what do you want to spend the majority of your time on? If it's modding, then exhaust your resources looking for the right tooling/scripts/etc. Sometimes that could mean finding which engine a game was built on, then looking for tooling related to that, which could well work for your game. Anything you can do to help yourself spend as little time as possible doing anything but modding.</p>\n<p>On the other hand, if you want the fun/challenge/etc. of reversing, then those two forums are a great place for you to start immersing yourself; however, depending on how much knowledge you have to build from, expect to spend weeks, months, and even years honing in on reversing something like this from scratch.</p>\n<p>Good luck!</p>\n</div>",
            "votes": "7",
            "user": "dsasmblr",
            "time": "Jul 22, 2017 at 16:58",
            "is_accepted": false,
            "comments": []
        }
    ]
}