{
    "title": "RE Tplink TD-W8960N V7",
    "link": "https://reverseengineering.stackexchange.com/questions/15985/re-tplink-td-w8960n-v7",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to reverse engineer a TDw8960 v7 TP-Link router. Currently the router has a bug, whereby setting the MTU via the GUI has no affect. It seems regardless of the value placed here despite showing a default value of 1480, all interfaces are stuck at 1500 which has caused some navigation issues. Whilst I have brought this to the attention of TP-Link I would rather try to patch this quickly and wait to see if and when they release a fixed version of the firmwares.</p>\n<p>Below you can see the gui setting and the ifconfig from Telnet\n<a href=\"https://i.sstatic.net/TFel4.png\" rel=\"noreferrer\"><img alt=\"MTU Gui\" src=\"https://i.sstatic.net/TFel4.png\"/></a></p>\n<p><a href=\"https://i.sstatic.net/dFjvu.png\" rel=\"noreferrer\"><img alt=\"MTU Ifconfig\" src=\"https://i.sstatic.net/dFjvu.png\"/></a></p>\n<p>The config files also confirms it should be 1400 on the ppp0 interface:\n<a href=\"https://i.sstatic.net/LUu3T.png\" rel=\"noreferrer\"><img alt=\"Config MTU\" src=\"https://i.sstatic.net/LUu3T.png\"/></a></p>\n<p>Finally I have set my NIC to 1420 and my navigation issues are resolved. When returning back to 1500 the issue returns.\n<a href=\"https://i.sstatic.net/WWuZ5.png\" rel=\"noreferrer\"><img alt=\"NIC MTU\" src=\"https://i.sstatic.net/WWuZ5.png\"/></a></p>\n<p>I have tried to reverse engineer the following firmware files with no luck:</p>\n<p><a href=\"http://static.tp-link.com/res/down/soft/TD-W8960N(EU)_V7_160614.zip\" rel=\"noreferrer\">TD-W8960N(EU)_V7_160614.zip</a></p>\n<p><a href=\"http://static.tp-link.com/res/down/soft/TD-W8960N(EU)_V7_160118.zip\" rel=\"noreferrer\">TD-W8960N(EU)_V7_160118.zip</a></p>\n<p><a href=\"http://static.tp-link.com/TD-W8960N(EU)_V8_170106.zip\" rel=\"noreferrer\">TD-W8960N(EU)_V8_170106.zip</a></p>\n<p>I have seen the following guide which shows the process very clearly, however, this guide is for v5 and it seems in v5 they used a squash filesystem and have since changed for newer versions.</p>\n<p><a href=\"https://www.inforge.net/xi/threads/estrarre-file-system-firmware-tp-link-td-w8960n.449500/\" rel=\"noreferrer\">Inforge.net</a></p>\n<p>When I do a binwalk for the three files I am trying I see the same output (or close enough):\n<a href=\"https://i.sstatic.net/MONaj.png\" rel=\"noreferrer\"><img alt=\"Binwalk\" src=\"https://i.sstatic.net/MONaj.png\"/></a></p>\n<p>I have literally just started trying to do and learn this stuff so forgive any stupidity from here.</p>\n<p>I have tried a few tools:</p>\n<ul>\n<li>Firmware Modification kit - extract-firmware.sh</li>\n<li>Firmware Modification kit - extract-ng.sh</li>\n<li>Firmware Modification kit - old-extract.sh</li>\n<li>Firmware Modification kit - tpl-tool</li>\n</ul>\n<p>I have tried multiple sources of the firmware modification kit. I have also tried router tools zynos.py, but as I understand the ZynOS is not used on this device.</p>\n<p><a href=\"https://github.com/dev-zzo/router-tools\" rel=\"noreferrer\">Router Tools</a></p>\n<p>All either fail or result in a message stating it is unsupported.</p>\n<p>I am presuming that from the binwalk output the file system is <code>ecosFS</code> from the line:</p>\n<pre><code>768           0x300           eCos RTOS string reference: \"eCosFS\"\n</code></pre>\n<p>I have done some research and I see ecosfs is a file system and possibly related to Yffs which I believe Firmware Modification Kit was capable of, but this is the first I have heard of this file system. Can anyone advise what can be done to unpack and repack a firmware like this, are there any tools specific to ecosfs that are necessary?</p>\n<p>I have literally turned google purple trying to wrap my head around this and could do with a push in the right direction.</p>\n<p><strong>Update 03-08-2017</strong>\nI can now see (maybe more understand), that the original extraction using binwalk gave me a 7zip file of the LZMA data 6223D.7z. I have extracted this file and I have a data file. If I run binwalk on this I see more  mention of eCos, VxWorks and little/big endian. This would lead me to suspect I am getting further.</p>\n<p><a href=\"https://i.sstatic.net/Fmf1k.png\" rel=\"noreferrer\"><img alt=\"Ecos Binwalk\" src=\"https://i.sstatic.net/Fmf1k.png\"/></a></p>\n</div>",
    "votes": "10",
    "answers": 0,
    "views": "3k",
    "tags": [
        "firmware",
        "embedded",
        "patch-reversing"
    ],
    "user": "The Humble Rat",
    "time": "Aug 3, 2017 at 8:53",
    "comments": [
        {
            "user": "ldam",
            "text": "<span class=\"comment-copy\">I have the same router and I notice I have the same issue for the MTU. I see that there was a firmware release 2 months ago (TD-W8960N(EU)_V7_170920), which doesn't list this MTU issue as resolved but I will try it anyway.</span>",
            "time": null
        },
        {
            "user": "The Humble Rat",
            "text": "<span class=\"comment-copy\">@Logan if my memory serves me correctly either this firmware or one supplied to me direct by Tp-Link support did eventually fix the issue. However, they had set the MTU to 1492 and this could not be changed, therefore whilst it fixed my problem the bug still exists. Unfotrunately every unit I have worked with seems to have problems.</span>",
            "time": null
        },
        {
            "user": "ldam",
            "text": "<span class=\"comment-copy\">It wouldn't let me flash the updated firmware last night, it kept saying \"illegal image\" so I haven't got anywhere with it. Ironically, 1492 is the correct MTU for my network.</span>",
            "time": null
        },
        {
            "user": "The Humble Rat",
            "text": "<span class=\"comment-copy\">@Logan just had a quick look through old emails and the firmware was provided by TP-Link support team and they had hardcoded the value to 1480 which should resolve your issue. I have put the file here: <a href=\"https://ufile.io/2e5hx\" rel=\"nofollow noreferrer\">ufile.io/2e5hx</a> as with any firmware file load this at your own risk.</span>",
            "time": null
        },
        {
            "user": "Denis Laskov",
            "text": "<span class=\"comment-copy\">Well, i had a first dirty look on TD-W8960N(EU)_V7_160614.zip  After a few binwalk rounds it end up with few .tar files, which contain kernel image [I assume] and bunch of html files that related to WEB GUI.  GUI that on first screenshot you posted related to pppoe.html file. This HTML page aggregate all nesessary parameters for  /ifcgateway.cgi or /ntwksum2.cgi and parameter you looking for is 'pppMtu'.  Worth to look at those more closely [grab them with telnet&amp;&amp;tftp] to understand how to handle the MTU problem. But this will require RE them at least :)</span>",
            "time": null
        }
    ],
    "answers_data": []
}