{
    "title": "Change sending IP of only certain executable",
    "link": "https://reverseengineering.stackexchange.com/questions/16027/change-sending-ip-of-only-certain-executable",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>An executable that access the Internet uses my IP to do so. Is it be possible, with the help of a software or something like that, to change what IP an executable uses to access the Internet? Without the need to change/mask all my system's IP at once. The solution should be able to change a single executable IP, maybe a pack of executables would also work for me.  </p>\n<p>I have an executable that sends information to a host, and I need to open 2 or more instances of that executable and need they to reach the host with different IPs.</p>\n<pre><code>My IP -&gt; qqq.qqq.qqq\nExecutable 1 -&gt; xxx.xxx.xxx\nExecutable 2 -&gt; yyy.yyy.yyy\n</code></pre>\n<p>Where Executable 1 and 2 can use proxy, IP that change all the time, doesn't matter -- they just need to reach the host with different IPs.</p>\n<p><strong>Possible easy solution I read once:</strong><br/>\nCreate a virtual machine and use a proxy software  on it, programs from my main computer would use my IP, programs from virtual machine would use proxy software IP</p>\n<p>But if i could avoid this solution, would be nicer.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "540",
    "tags": [
        "tools",
        "executable",
        "packet",
        "address"
    ],
    "user": "Bruno Cerk",
    "time": "Aug 7, 2017 at 8:25",
    "comments": [
        {
            "user": "perror",
            "text": "<span class=\"comment-copy\">What system are you using ? MS-Windows, Linux, MacOS X, other ?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><em>Following OP's other questions, assuming Windows OS</em> </p>\n<p>This can be achieved with many 3rd-party solutions for Windows, choose the one which fits best to your needs:  </p>\n<p><strong>Proxifier</strong></p>\n<blockquote>\n<p>Proxifier allows network applications that do not support working\n  through proxy servers to operate through a SOCKS or HTTPS proxy and\n  chains.</p>\n<p><a href=\"https://www.proxifier.com/\" rel=\"noreferrer\">https://www.proxifier.com/</a></p>\n</blockquote>\n<p><strong>ProcxyCap</strong> </p>\n<blockquote>\n<p>ProxyCap enables you to redirect your computer's network connections\n  through proxy servers. You can tell ProxyCap which applications will\n  connect to the Internet through a proxy and under what circumstances. </p>\n<p><a href=\"http://www.proxycap.com/\" rel=\"noreferrer\">http://www.proxycap.com/</a></p>\n</blockquote>\n<p><strong>ForceBindIP</strong> </p>\n<blockquote>\n<p>ForceBindIP is a freeware Windows application that will inject itself\n  into another application and alter how certain Windows socket calls\n  are made, allowing you to force the other application to use a\n  specific network interface / IP address. This is useful if you are in\n  an environment with multiple interfaces and your application has no\n  option to bind to a specific interface.</p>\n<p><a href=\"https://r1ch.net/projects/forcebindip\" rel=\"noreferrer\">https://r1ch.net/projects/forcebindip</a></p>\n</blockquote>\n<hr/>\n<p>I used <a href=\"https://www.proxifier.com/\" rel=\"noreferrer\">Proxifier</a> in the past for gaming and torrenting purposes and it might be what you're searching for.  </p>\n</div>",
            "votes": "5",
            "user": "Megabeets",
            "time": "Aug 7, 2017 at 7:41",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Bruno Cerk",
                    "text": "<span class=\"comment-copy\">I need to open like, 10 executables, and put each one to work in a different IP</span>",
                    "time": null
                },
                {
                    "user": "Bruno Cerk",
                    "text": "<span class=\"comment-copy\">I'll be looking further to check witch one of these would be the best for my problem</span>",
                    "time": null
                }
            ]
        }
    ]
}