{
    "title": "de4dot and Dotfuscator: IL looks different, not DotPeek decompiled code",
    "link": "https://reverseengineering.stackexchange.com/questions/16131/de4dot-and-dotfuscator-il-looks-different-not-dotpeek-decompiled-code",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>From the obfuscated to the deobfuscated assemblies, IL code looks different using ILDASM; however, DotPeek decompiled C# code looks exactly the same for both. Any clue why?</p>\n<p>The obfuscation software is Dotfuscator. de4dot runs just fine, apparently.</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "2k",
    "tags": [
        "obfuscation",
        "deobfuscation",
        ".net"
    ],
    "user": "Masamune Shirow",
    "time": "Aug 18, 2017 at 13:46",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">did you run DotPeek on the obfuscated code?</span>",
            "time": null
        },
        {
            "user": "Masamune Shirow",
            "text": "<span class=\"comment-copy\">I ran it on both the obfuscated and deobfuscated dlls, code looks exactly the same (i.e., it still has Dotfuscator's modifications). I must be missing something obvious...</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">if you provide more info (e.g.  bytecode vs. decompiled code listings) and tell us what exactly you did, we may be able to answer better.</span>",
            "time": null
        },
        {
            "user": "Masamune Shirow",
            "text": "<span class=\"comment-copy\">I don't want to lose your time. I thought it would be straightforward, once de4dot ran smoothly, to decompile the dll using DotPeek. I debug into de4dot, looks ok. Though apparently it's not, I guess I need to learn more.</span>",
            "time": null
        },
        {
            "user": "CTZStef",
            "text": "<span class=\"comment-copy\">I am interested too in the subject; truth be told, there's barely any resources to be found about how to get from de4dot to DotPeek (or any other decompiler). If de4dot succeeded, what then? The internets say, just open DotPeek and voilà...!</span>",
            "time": null
        }
    ],
    "answers_data": []
}