{
    "title": "Reverse engineering the PluginKit MacOS framework",
    "link": "https://reverseengineering.stackexchange.com/questions/16185/reverse-engineering-the-pluginkit-macos-framework",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've been tasked with an assignment requiring a thorough reverse engineering effort on the PluginKit framework in modern Mac operating system, and I'm looking for information to start off, instead of starting from scratch.</p>\n<p>More specifically, I need to get a decent understanding of the internal storage and configuration layout and format of PluginKit, as well as how it's being manipulated, updated and read.</p>\n<p>The only resource I've managed to come up with is <a href=\"https://medium.com/@avaidyam/nsextension-pluginkit-a-brief-intro-2803be91a777\" rel=\"noreferrer\">this</a> medium short article from over a year ago, by a person called Aditya Vaidyam.</p>\n<p>I found no relevant information (according to table of contents) in Mac OSX Internals by Amit Singh or in MacOS and *OS Internals by Jonathan Levin, and didn't find anything else to look at.</p>\n<p>My question therefore is two-fold:</p>\n<ol>\n<li>Are there any other resources available that describe in-detail the OSX frameworks and the PluginKit framework specifically?</li>\n<li>What other resources, pointers, tips and previous research would you suggest I read before going into the task?  </li>\n</ol>\n</div>",
    "votes": "8",
    "answers": 1,
    "views": "1k",
    "tags": [
        "osx",
        "macos"
    ],
    "user": "NirIzr",
    "time": "Aug 30, 2017 at 11:43",
    "comments": [
        {
            "user": "Aditya Vaidyam",
            "text": "<span class=\"comment-copy\">That post was indeed written by me. It covers from a high level into the internals of how <code>NSExtension</code> bootstraps and operates, less so on how to deal with <code>PlugInKit</code>. There are actually zero other resources AFAIK but grab yourself a disassembler (provided you know some assembly) and go to town on the binary (which is actually located at <code>/System/Library/PrivateFrameworks/PlugInKit.framework/Contents/MacOS/PlugInKit</code>)</span>",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "<span class=\"comment-copy\">Yes, of course I could reverse engineer the file, but before doing so myself I searched for existing material I could rely on.</span>",
            "time": null
        },
        {
            "user": "Aditya Vaidyam",
            "text": "<span class=\"comment-copy\">@Nirlzr Ah, understood!</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>My offers won't be specific for your task, so I will try to answer your second question. I hope these helps to you or anyone having a similar task. Since your task is on a quite specific subject, I will offer you searching for something similar, and solve the puzzle by combining these details.</p>\n<p>I don't know if you have previous MacOS/iOS reversing experience. So <a href=\"https://davidwalsh.name/reverse-engineer-os-ios-software\" rel=\"nofollow noreferrer\">here</a> is a good tutorial to start for understanding platform details (Binary format etc.)</p>\n<p>And you can start with basic understanding of Objective-C runtime details. This information will be quite helpful when you face some (dis)assembly </p>\n<p>For exp; </p>\n<ul>\n<li><a href=\"https://developer.apple.com/library/content/documentation/Cocoa/Conceptual/ObjCRuntimeGuide/Articles/ocrtHowMessagingWorks.html\" rel=\"nofollow noreferrer\">Method calls via send message</a> </li>\n<li><a href=\"https://developer.apple.com/library/content/documentation/Swift/Conceptual/Swift_Programming_Language/AutomaticReferenceCounting.html\" rel=\"nofollow noreferrer\">Automatic Reference\nCounting</a> (retain/release method calls)</li>\n</ul>\n<p>This post (<a href=\"https://www.bartcone.com/new-blog/2014/11/26/hopper-lldb-for-ios-developers-a-gentle-introduction\" rel=\"nofollow noreferrer\">Introduction to LLDB and Hopper</a>) can be quite helpful since it provides an example of decompilation of an Apple's UIKit framework. By using that approach I decompiled PluginKit, but didn't focus on internals.</p>\n<p>You can also check interface of PluginKit via <a href=\"https://github.com/nst/RuntimeBrowser/\" rel=\"nofollow noreferrer\">Runtime Browser</a> and search methods to focus on, or check pre-generated intefaces which are available on github page</p>\n<p>Good luck</p>\n</div>",
            "votes": "3",
            "user": "qwerty",
            "time": "Sep 6, 2017 at 13:10",
            "is_accepted": false,
            "comments": [
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Thanks. Upvoted. When you say \"I decompiled PluginKit\", could you elaborate on that? Is there something I can read about your experience?</span>",
                    "time": null
                },
                {
                    "user": "qwerty",
                    "text": "<span class=\"comment-copy\">Actually not that much, I just followed the guide and disassembled the iOS binary for PluginKit. (MacOS binary is placed at <code>/usr/bin/pluginkit</code> ) If you have an issue until that part of course I can help. Rest is depends on what you are looking for. I think u need a real use case for PluginKit to understand, what it does and how it works. Then you can focus on specific parts for details and we can exchange knowledge.</span>",
                    "time": null
                }
            ]
        }
    ]
}