{
    "title": "How to do Global DLL injection",
    "link": "https://reverseengineering.stackexchange.com/questions/16319/how-to-do-global-dll-injection",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>How can one go about injection of a DLL into every process? Can <code>SetwindowsHookEx()</code> do the trick? Does <code>AppInit_DLLs</code> work as it used to?</p>\n</div>",
    "votes": "4",
    "answers": 2,
    "views": "4k",
    "tags": [
        "windows",
        "dll"
    ],
    "user": "Todd",
    "time": "Jun 5, 2018 at 13:47",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>TLDR: No, no and no.</p>\n<p>You have several questions hiding there in your post:</p>\n<ol>\n<li>Is is possible to inject a DLL into each and every process?</li>\n<li>If it is possible, can the following methods do that:\n<ol>\n<li><code>SetWindowsHookEx</code>?</li>\n<li><code>AppInit_Dlls</code>?</li>\n</ol>\n</li>\n</ol>\n<p>The answer to the first question is \"no\".<br/>\nThe answer to both parts of the second question is \"no, even if the answer to the first question had been yes\".</p>\n<h2><code>SetWindowsHookEx</code> and <code>AppInit_Dlls</code></h2>\n<p>Let's start from the second question. Both methods only apply to processes that load <code>user32.dll</code>. So that's already not \"every process\" which is what you asked.</p>\n<p>On top of that is everything I mentioned in the comments to NirIzr's answer:</p>\n<ul>\n<li><a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/dn280412(v=vs.85).aspx\" rel=\"nofollow noreferrer\">Starting with Windows 8 <code>AppInit_Dlls</code> are disabled</a> by default on machines with Secure Boot enabled (i.e. all real-world machines).</li>\n<li>A process can opt-out from both methods by setting the <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/hh769088(v=vs.85).aspx\" rel=\"nofollow noreferrer\"><code>ProcessExtensionPointDisablePolicy</code></a> mitigation policy.</li>\n</ul>\n<p>Process that have <code>ProcessExtensionPointDisablePolicy</code> set include most Chrome processes (renderer, gpu, ppapi) and a few system processes (like <code>RuntimeBroker.exe</code>), for example.</p>\n<p>I don't think that this is merely a caveat. The question is can you inject into all processes, and the answer is no.</p>\n<h2>DLL injection and loading in general</h2>\n<p>But there are other ways to do DLL injection. What about them?<br/>\nThis brings us back to the first question.</p>\n<p>Since Windows Vista, some processes are \"protected processes\" for DRM reasons. See:</p>\n<ul>\n<li><a href=\"https://www.microsoftpressstore.com/articles/article.aspx?p=2233328&amp;seqNum=2\" rel=\"nofollow noreferrer\">Protected Processes</a> (from Windows Internals 5th edition)</li>\n<li><a href=\"https://technet.microsoft.com/en-us/library/46ed60f1-e02c-48db-9eba-eddbd106d54f\" rel=\"nofollow noreferrer\">Inside the Windows Vista Kernel: Part 3</a> (scroll to \"Protected Processes\")</li>\n</ul>\n<p>To load into these process you must be signed with a special certificate, which you probably don't have.</p>\n<p>Since then Microsoft has expanded the protected process infrastructure more and more to include more processes and to allow third-party processes to be protected. See <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/dn313124(v=vs.85).aspx\" rel=\"nofollow noreferrer\">Protecting Anti-Malware Services</a>.</p>\n<p>There are different levels of protection, but to load into some of these processes you also have to be signed with a special certificate that you also don't have, and to load into the rest of them you need a certificate that you can't have (since Microsoft doesn't supply it to any third party).</p>\n<p>Processes protected in that way are <code>smss.exe</code>, <code>csrss.exe</code>, <code>services.exe</code>, some instances of <code>svchost.exe</code> as well the processes for any AV that respects itself. You can't inject into those either, <em>regardless of method</em> (<code>SetWindowsHookEx</code>, <code>AppInit_Dlls</code>, or something more robust that doesn't depend on <code>user32.dll</code>).</p>\n<p>Additionally, another mitigation policy, <code>ProcessSignaturePolicy</code>, available starting with Windows 10 can prevent loading of DLLs not signed by Microsoft, WHQL or the Windows Store. And unlike being a protected process which requires a certificate from Microsoft, any process can opt-in to <code>ProcessSignaturePolicy</code>.</p>\n<p>Process that have this mitigation enabled include <code>WinStore.App.exe</code> (the Windows Store app itself, obviously), <code>MicrosoftEdgeCP.exe</code> (Store only), <code>csrss.exe</code> (Microsoft only), <code>wininit.exe</code> (Microsoft only) and <code>services.exe</code> (Microsoft only).</p>\n<p>In summary: You can't <em>load</em> arbitrary DLLs into many processes, including by calling <code>LoadLibrary</code> from the program's own legitimate code. You can't inject DLLs into these processes, regardless of the method you use.</p>\n<p>If you find a way to do this it would be a major subversion of the Windows 10 security mechanisms and such novelty is more likely to be presented in a professional conference rather than on the SE network.</p>\n<hr/>\n<p>More links on Windows 8.1 Protected Processes, from Alex Ionescu's blog:</p>\n<ul>\n<li><a href=\"https://www.alex-ionescu.com/?p=97\" rel=\"nofollow noreferrer\">The Evolution of Protected Processes Part 1: Pass-the-Hash Mitigations in Windows 8.1</a></li>\n<li><a href=\"https://www.alex-ionescu.com/?p=116\" rel=\"nofollow noreferrer\">The Evolution of Protected Processes Part 2: Exploit/Jailbreak Mitigations, Unkillable Processes and Protected Services</a></li>\n<li><a href=\"https://www.alex-ionescu.com/?p=146\" rel=\"nofollow noreferrer\">Protected Processes Part 3 : Windows PKI Internals (Signing Levels, Scenarios, Root Keys, EKUs &amp; Runtime Signers)</a></li>\n</ul>\n</div>",
            "votes": "7",
            "user": "Paul",
            "time": "Apr 8, 2022 at 17:56",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>DLL injections is a big subject, but to answer your two specific questions:</p>\n<ol>\n<li>Yes, <code>SetwindowsHookEx</code> can inject to all <em>currently</em> running processes. This is done by providing the value of zero (<code>0</code>)  to the <code>dwThreadId</code> parameter.</li>\n<li>Yes, generally <code>AppInit_DLLs</code> works on recent windows versions, however microsoft are working their way towards disabling and heavily limiting its usage. For example, since Windows 7, a registry value called <code>RequireSignedAppInit_DLLs</code> controls whether only code-signed DLLs are allowed to load. While the value is set to <code>0</code> (turned off) for Windows 7, it is on by default on windows 10. Furthermore, in Windows 8 (and above) <code>AppInit_DLLs</code> is automatically disabled (enable with  the <code>LoadAppInit_DLLs</code> registry value) on machines with secure boot.</li>\n</ol>\n<p><strong>EDIT:</strong></p>\n<p>Both of these techniques are being phased out (or completely blocked) by multiple counter-measure features in Windows versions. They're not recommended (actually they are often discouraged by Microsoft itself) for legitimate software (or malware). Users are piling up caveats and restrictions in the comments, but for the sake of clarity and simplicity (and because there're numerous caveats here) I chose to only include a few. </p>\n</div>",
            "votes": "4",
            "user": "0xC0000022L",
            "time": "Jun 5, 2018 at 13:50",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">BTW, <code>AppInit_DLLs</code> only works if the process loads <code>user32.dll</code>.</span>",
                    "time": null
                },
                {
                    "user": "conio",
                    "text": "<span class=\"comment-copy\">The <code>PROCESS_CREATION_MITIGATION_POLICY_EXTENSION_POINT_DISABLE_ALWAYS_ON</code> mitigation policy disables both <code>AppInit_Dlls</code> and global hooks.</span>",
                    "time": null
                },
                {
                    "user": "conio",
                    "text": "<span class=\"comment-copy\">Also, starting with Windows 8, <code>AppInit_Dlls</code> are disabled by default, regardless of signing, when secure boot is enabled. See <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/dn280412(v=vs.85).aspx\" rel=\"nofollow noreferrer\">AppInit DLLs and Secure Boot</a>. You probably don't see this on VMs (unless you use Hyper-V), but real machines have Secure Boot enabled by default.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Thanks, Added a paragraph to note there are many caveats, that those techniques are discouraged and refer to the comments for additional forewarnings.</span>",
                    "time": null
                }
            ]
        }
    ]
}