{
    "title": "Why BIOS is not asking for HDD password on reboot but only after power off?",
    "link": "https://reverseengineering.stackexchange.com/questions/16317/why-bios-is-not-asking-for-hdd-password-on-reboot-but-only-after-power-off",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I was reading about BIOS and I saw this:</p>\n<blockquote>\n<p>Next, BIOS will begin checking memory at 0000:0472h. This address contains a flag which will tell the BIOS if the system is booting from a cold boot or warm boot.</p>\n</blockquote>\n<p>As you can see, it tells that the BIOS has 2 types to check the booting process. It says when the BIOS finds a warm boot (value 1234h) it will skip the POST routines remaining, however if the BIOS finds a cold boot, the remaining POST routines will be run.</p>\n<p>Now, supposing that I have a password in the startup (user password set in the BIOS) of the system and a hard disk.</p>\n<p>When I power up the computer, this means that the BIOS will read for a cold boot and will run the remaining POST routines, and of course will ask for the user's and hard disk's password. But when I reboot the system from the operating system (in this case, a Linux distribution), why doesn't the BIOS requests for the hard disk's password? Does this means that the BIOS is reading now a warm boot?</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "212",
    "tags": [
        "bios"
    ],
    "user": "J Johnson",
    "time": "Sep 26, 2017 at 11:52",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Your quote is about the old legacy BIOS (16-bit). Nowadays most BIOSes implement <a href=\"http://www.uefi.org/\" rel=\"nofollow noreferrer\">UEFI</a>-compliant firmware, which works in a pretty different way. The <a href=\"https://www.trustedcomputinggroup.org/wp-content/uploads/TCG_Storage_ReferenceDocument_Opal_Integration_Guidelines_v1.00_r1.14_publicreview.pdf\" rel=\"nofollow noreferrer\">Opal specification</a> published by TCG, describes how the UEFI firmware interacts with self-encrypting harddrives.\nHowever, it seems your scenario is not really BIOS-related. According to <a href=\"https://wiki.archlinux.org/index.php/Self-Encrypting_Drives\" rel=\"nofollow noreferrer\">ArchLinux wiki on the topic </a>:</p>\n<blockquote>\n<p>Typical self-encrypting drives, once unlocked, will <strong>remain unlocked\n  as long as power is provided</strong>. This vulnerability can be exploited by\n  means of altering the environment external to the drive, without\n  cutting power, in effect keeping the drive in an unlocked state. For\n  example, it has been shown (by researchers at Universiy of\n  Erlangen-Nuremberg) that it is possible to reboot the computer into an\n  attacker-controlled operating system without cutting power to the\n  drive. The researchers have also demonstrated moving the drive to\n  another computer without cutting power</p>\n</blockquote>\n<p>So it's probably the drive itself, and not the BIOS/firmware, which is caching the password on warm reboot.</p>\n<p>Other references:</p>\n<ul>\n<li><p><a href=\"http://www.uefi.org/sites/default/files/resources/UEFI_Plugfest_JBOBZIN_2012Q1_V2.pdf\" rel=\"nofollow noreferrer\">UEFI Plugfest: Strategies for Firmware Support of Self-Encrypting Drives</a></p></li>\n<li><p>EDK2's <a href=\"https://github.com/tianocore/edk2/tree/master/SecurityPkg\" rel=\"nofollow noreferrer\">SecurityPkg</a> implements various Opal-related functionality, e.g. <a href=\"https://github.com/tianocore/edk2/tree/master/SecurityPkg/Tcg/Opal\" rel=\"nofollow noreferrer\">1</a>, <a href=\"https://github.com/tianocore/edk2/tree/master/SecurityPkg/Library/OpalPasswordSupportLib\" rel=\"nofollow noreferrer\">2</a></p></li>\n</ul>\n</div>",
            "votes": "4",
            "user": "Igor Skochinsky",
            "time": "Sep 11, 2017 at 8:18",
            "is_accepted": true,
            "comments": []
        }
    ]
}