{
    "title": "Where ES/GS/FS are pointing to?",
    "link": "https://reverseengineering.stackexchange.com/questions/16336/where-es-gs-fs-are-pointing-to",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>As far as I know those segments are <code>extra</code> or <code>general</code>. But at which part of program memory they are actually pointing? If I undestand it correctly <code>DS</code> is poining at entry point of Dump, <code>SS</code> stands for Stack, what is happening with those leftovers from Intel conception.\n<a href=\"https://i.sstatic.net/4n9sd.png\" rel=\"noreferrer\"><img alt=\"Registers\" src=\"https://i.sstatic.net/4n9sd.png\"/></a></p>\n<p>Those are my registers using <code>Ollydbg</code>, how can I predict what will be moved into EAX?</p>\n<pre><code>MOV EAX, DWORD PTR FS:[0]\n</code></pre>\n</div>",
    "votes": "9",
    "answers": 1,
    "views": "6k",
    "tags": [
        "windows",
        "assembly",
        "ollydbg",
        "x86"
    ],
    "user": "erexo",
    "time": "Sep 13, 2017 at 20:39",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>On x86 32bit windows the <code>FS</code> segment register points to a structure called the <a href=\"https://en.wikipedia.org/wiki/Win32_Thread_Information_Block\" rel=\"noreferrer\">Thread Information Block</a> or the TIB for short. This structure is created by the kernel on thread creation and is used to support OS related functionalities, services and APIs.</p>\n<p>Examples of data TIB usage are:</p>\n<ol>\n<li>Thread Local Storage.</li>\n<li>the Heap.</li>\n<li>the Stack.</li>\n<li>SEH exception chain.</li>\n<li>Access to the Process Environment Block (which serves a similar, process level goal).</li>\n</ol>\n<p>And many other...</p>\n<p>To predict the actual value of a dereference into the <code>FS</code> register, you'll need to consult a mapping of that (only partially documented) structure for the specific OS version you're working with. For example, the <a href=\"https://en.wikipedia.org/wiki/Win32_Thread_Information_Block\" rel=\"noreferrer\">TIB</a> wikipedia page I mentioned earlier describes a 32bit windows TIB layout.</p>\n<p>On linux the <code>GS</code> register is used for a similar purpose regardless of register size, and 64bit intel windows uses both the <code>FS</code> and <code>GS</code> registers.</p>\n<p>The information stored in the TIB should not be used directly by programs, how ever specific members of the structure often are used for unintended purposes such as detecting debuggers in more prevalent ways.</p>\n<p>As you can see, other segment registers are rarely used.</p>\n<h1>A bit of history</h1>\n<p>Although the segment registers are used for OS-related functionality, that was not the intended goal segment registers were made for. In the past, when CPU register sized varied between 8 and <a href=\"https://en.wikipedia.org/wiki/16-bit\" rel=\"noreferrer\">16 bit</a>, addressing was highly limited and only 64KB of address space was available. Since original CPUs were only running in Real Mode (and not <a href=\"https://en.wikipedia.org/wiki/Protected_mode\" rel=\"noreferrer\">Protected Mode</a>), that address space had to be shared with all running services, processes, connected peripherals, etc...</p>\n<p>To bypass that limitation, the <a href=\"https://en.wikipedia.org/wiki/X86_memory_segmentation\" rel=\"noreferrer\">Memory Segmentation</a> was brought into use in two forms. One was Protected Mode VS Real Mode, and the other was the segment registers - which were used as an offset for the actual registers being used for addressing. This allowed a greatly increased addressing range and was considered a valid solution. In the days of 32bit protected mode processors, where 4GB of Virtual Addressable Space is available to each process, and certainly with 64 bit CPUs, the segment registers are rarely used for their original goal (except for highly low level components such as Real Mode boot loaders, which might still need the extra addressing).</p>\n<p>P.S.</p>\n<p><code>DS</code> stands for <em>Data</em> Selector.</p>\n</div>",
            "votes": "11",
            "user": "NirIzr",
            "time": "Feb 27, 2023 at 14:24",
            "is_accepted": true,
            "comments": [
                {
                    "user": "erexo",
                    "text": "<span class=\"comment-copy\">Thanks for explaining it, now the concept of segments it's much clearer to me.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">There's an additional side to segment selectors, which I didn't want to dwell into because your question was essentially about the <code>FS</code> register. Nowadays segment registers are still used for permissions and memory management. This is pretty important to the understanding of memory managemnt on the Intel architecture family but not really related to your question, you can read about it here: <a href=\"https://en.wikipedia.org/wiki/Global_Descriptor_Table\" rel=\"nofollow noreferrer\">en.wikipedia.org/wiki/Global_Descriptor_Table</a></span>",
                    "time": null
                },
                {
                    "user": "Et7f3XIV",
                    "text": "<span class=\"comment-copy\">typo rage -&gt; range. I can't edit because it is less than 6 chars</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">@Et7f3XIV Thanks!</span>",
                    "time": null
                }
            ]
        }
    ]
}