{
    "title": "RE USB-Serial device driver [Canon ES-E1 for EOS-1V]",
    "link": "https://reverseengineering.stackexchange.com/questions/16348/re-usb-serial-device-driver-canon-es-e1-for-eos-1v",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've got an old film camera that uses a cable to connect to a PC. The camera records information like shutter speed, lens used, flash fired, focal length, etc. I'd like to download this information and keep it with my photos. The software that comes with this cable works only on Windows XP. I'm trying to get something that will work with a python script on linux ideally. </p>\n<p>My first thought was to capture some usb/serial traffic and see what is sent and received. After several tries, I got some data captured. However, I can't really understand what is going on. It's rather cryptic to me. </p>\n<p>List of Details:</p>\n<ul>\n<li>In Windows XP the device shows up as using com3/4, hence I think it is a serial device over USB. I couldn't get portmon to capture anything at all.</li>\n<li>I tried various USB sniffers inside windows xp virtual machine--none worked. </li>\n<li>I tried capturing USB traffic in VMWare logs, this worked but it's cryptic and doesn't look terribly helpful.</li>\n</ul>\n<p>I was hoping to get a set of commands that are available on this device to send and receive various pieces of data. Are there any good suggestions/tips/tricks that you can offer to get me started down a successful path? I know this will be trial and error, but what else can I try? Maybe the data I have is sufficient and I need to interpret somehow? </p>\n<p>Any suggestions are appreciated!</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "356",
    "tags": [
        "serial-communication",
        "driver",
        "usb"
    ],
    "user": "FirmwareRootkits",
    "time": "Sep 15, 2017 at 18:38",
    "comments": [
        {
            "user": "John",
            "text": "<span class=\"comment-copy\">I also got the same wire, but I don't know where to download the software. If you have one, could you please share it with me? Thanks</span>",
            "time": null
        },
        {
            "user": "FirmwareRootkits",
            "text": "<span class=\"comment-copy\">John, you need the CD from Canon that comes with the ES-E1 cable. You might be able to download that from Canon or purchase the software.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Reversing a USB protocol can be a daunting task but some tools can provide a lot of help. Wireshark understands the USB protocol and can help you make sense of some capture. I have only used on it Linux but the wiki provides <a href=\"https://wiki.wireshark.org/CaptureSetup/USB\" rel=\"nofollow noreferrer\">instructions</a> for Windows too. I suggest you always run Windows XP in the VM and capture on the host, it usually makes thing easier. You will need to familiar yourself with the USB protocol, <a href=\"http://www.beyondlogic.org/usbnutshell/usb1.shtml\" rel=\"nofollow noreferrer\">USB in Nutshell</a> is a good place to start.</p>\n<p>Alternatively, you can try to directly capture the traffic at the COM port, see <a href=\"https://ask.wireshark.org/questions/23243/how-do-you-capture-serial-com-communications\" rel=\"nofollow noreferrer\">this post</a>. It should be much simpler assuming you can make it work because it will give you much more higher-level information.</p>\n</div>",
            "votes": "1",
            "user": "Amaury Pouly",
            "time": "Sep 21, 2017 at 13:44",
            "is_accepted": false,
            "comments": []
        }
    ]
}