{
    "title": "Change URL a program sends data to",
    "link": "https://reverseengineering.stackexchange.com/questions/16354/change-url-a-program-sends-data-to",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm pretty new to reverse engineering, and I have several times seen that programs make requests to certain websites with specific host names. </p>\n<p>I tried to use a debugger and checked for the URL it posts to as binary string (referenced strings) and in the memory map but surprisingly I found nothing. The URL must be there some where after all the program knows how to send data to a specific host.</p>\n<p>How do I find and change this URL?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "506",
    "tags": [
        "disassembly",
        "decompilation",
        "exe"
    ],
    "user": "user3621843",
    "time": "Sep 19, 2017 at 7:45",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The best way to find this URL is looking into EXE with disassembler like IDA(you can use free version for this).</p>\n<p>It will disassemble EXE and then you can search for this string. If URL really isn't in the file, then you must locate function that is sending informations to the website. The best way is look for functions that are using Windows' network API. Then place some breakpoints to look what function is this one you are looking for. And now trace down the URL variable. Look where it came from, is it loaded from file, or registry, or anything else.</p>\n<p>Now when you know where is the URL in-file you can change it with hex editor(if it is hardcoded, or change the file/registry).</p>\n<p>Note that you need a basics of assembler to do it.</p>\n<p>Or the fast(and not too good) way is to change hosts file :)</p>\n</div>",
            "votes": "1",
            "user": "Neproify",
            "time": "Sep 16, 2017 at 21:58",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user45165",
                    "text": "<span class=\"comment-copy\">thank you for your reply, I found this post very hopefull but I am also looking for a soltuion I found URl and I tried to change it with hex edtiro but after that files does not work.</span>",
                    "time": null
                }
            ]
        }
    ]
}