{
    "title": "How to detect overlay data in RTF files?",
    "link": "https://reverseengineering.stackexchange.com/questions/16405/how-to-detect-overlay-data-in-rtf-files",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>How to detect overlay data in RTF files? When officemalscanner says it detected overlay data, what does that mean ? Is overlay data specific to malicious files ?</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "326",
    "tags": [
        "malware",
        "tools",
        "file-format",
        "static-analysis"
    ],
    "user": "PK19",
    "time": "Sep 25, 2017 at 9:50",
    "comments": [
        {
            "user": "Kerim Can Kalıpcıoğlu",
            "text": "<span class=\"comment-copy\">I don't know answer for this but, I was developed a RTF parser for specific data set. You can also use context-specific expressions for your data.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It's difficult to say for sure since the tool is closed-source, but <em>I suspect</em> it means that the file contains extra data after the end of the document. For example, RTF usually begins with <code>{\\rtf1</code>, contains many embedded commands  (some using nested <code>{}</code> for parameters) and ends with a matching <code>}</code>. If there is extra data after the final <code>}</code>, it's not part of the document but could be part of the payload used by the exploit inside the main body. It is of course not a 100% indicator of a malicious file but just one of the possible hints that it should be checked more thoroughly.</p>\n<p>To confirm, you can try running it on this sample RTF file from Wikipedia:</p>\n<pre><code>{\\rtf1\\ansi{\\fonttbl\\f0\\fswiss Helvetica;}\\f0\\pard\nThis is some {\\b bold} text.\\par\n}\n</code></pre>\n<p>Add some extra data at the end and see if it triggers the warning.</p>\n</div>",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "Sep 25, 2017 at 12:50",
            "is_accepted": false,
            "comments": [
                {
                    "user": "manduca",
                    "text": "<span class=\"comment-copy\">Good answer, “overlay” is a term from MSDOS days and used to mean exactly this. Malscan author is probably old :-)</span>",
                    "time": null
                }
            ]
        }
    ]
}