{
    "title": "How to decrypt files given access to the decryption formula (bash) and passwords (Mach-O binary)",
    "link": "https://reverseengineering.stackexchange.com/questions/16447/how-to-decrypt-files-given-access-to-the-decryption-formula-bash-and-passwords",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a decryption formula, the file it links to containing file passwords, and the encrypted files themselves, but I still don't understand how to reverse the process.</p>\n<p><strong>Question: Do I need any more information to be able to decrypt the files (if so, what?) + if I am able to decrypt the files, what is the best way to do so?</strong></p>\n<p>The steps in the formula are (from the comments in the code):</p>\n<ol>\n<li><p>Assess whether the file is a sound file</p>\n<pre><code>if [ ${FILE##*.} != mp3 ] &amp;&amp; [ ${FILE##*.} != wav ] &amp;&amp; [ ${FILE##*.} != mov ] ; then\n</code></pre></li>\n<li><p>XOR non-sound files with passwords based on a separate file (.out)</p>\n<pre><code>echo \"encrypt ${FILE}\"\nmv \"$FILE\" \"${FILE}_\"\n../tools/pass.out \"${FILE}_\" \"$FILE\"\nrm \"${FILE}_\"\n</code></pre></li>\n<li><p>Change the file name to a hash value or just change the file extension</p>\n<pre><code>MP3_FILENAME=`basename ${FILE}`\nDIR_NAME=${FILE%/*.*}/\n\nif [ ${DIR_NAME} != ./tmp/cc/ ] &amp;&amp; [ ${DIR_NAME} != ./tmp/dd/ ] ; then       \n    SHA1=`get_random_mp3_filename ${MP3_FILENAME}`\n    mv \"${FILE}\" \"${DIR_NAME}${SHA1#SHA1(${FILE})= }.png\"\n    echo \"${MP3_FILENAME}: ${SHA1}\"\nelse\n    mv \"${FILE}\" \"${FILE%.*}.png\"\n</code></pre></li>\n</ol>\n<p>The pass.out file (CF FA ED FE) disassembles without issue. I have no idea how it works or how to use it in reverse. I have attached the file below.</p>\n<p><a href=\"https://drive.google.com/open?id=0B2FK8VIu6fm2S0NZbkVnMTEwbms\" rel=\"nofollow noreferrer\">pass.out</a></p>\n<p>Apologies in advance if I've made any wrong assumptions or used wrong terminology. Any help, explanations, or pointers to learning resources would be much appreciated!</p>\n<p>EDIT: Sorry for the confusion! The files are from the .apk of an Android app. My aim is to decrypt them to common file formats e.g. .png and .mp3. From inspecting the .apk, I believe files are processed in the following ways:\n1) Sound files (.wav, .mp3, .mov) in specific folders have their extension changed to .png. I can play them by changing the extension back to the original.\n2) All other files are XOR encrypted by running them through the pass.out file. I want to know how to reverse this process.</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "343",
    "tags": [
        "decryption"
    ],
    "user": "green",
    "time": "Sep 29, 2017 at 20:43",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">this is a pretty confusing question. Maybe you should explain from the beginning what happened, how/where did you get all those files and what you want to achieve</span>",
            "time": null
        }
    ],
    "answers_data": []
}