{
    "title": "Where should I put my breakpoint? (USB dongle protected software, probably marx)",
    "link": "https://reverseengineering.stackexchange.com/questions/16528/where-should-i-put-my-breakpoint-usb-dongle-protected-software-probably-marx",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to bypass the license validation process of a very old program called COSIMIR. It uses a USB dongle (which we have) however I don't have access to it, because it belongs to my university. </p>\n<p>And there is a student version of COSIMIR, the problem is that it isn't compatible with anything we do in the other one, so I copied every file of the Industrial version into my lap and got the installation fixed with olly (because many things where missing). I had to do this because the person who installed this software (and therefore the one with the installer) doesn't work there anymore.</p>\n<p>After fixing it up, and being able to execute it from start to end I finally got into the activation failure screen, the problem is, I don't know where to start. I mean, which <code>.dll</code> is used to initialize the dongle? My plan was to avoid its init, and see if I can jump my way though without creating an exception, is my first crack with a dongle, so I don't know if it's the right way to go. Also this is the screen I get popped into:</p>\n<p><a href=\"https://i.sstatic.net/58Qwu.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/58Qwu.png\"/></a></p>\n<p>However, after seeing it, I started wondering if it would be easier to try to bypass one of the other 2 methods, by the way I'm like 80% sure it just uses the dongle for the license.\nAlso, I'm almost sure it uses a Marx Dongle, since the one we have attached in the back of the computer we have licensed looks exactly like this one:</p>\n<p><a href=\"https://i.sstatic.net/MXhcf.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/MXhcf.jpg\"/></a></p>\n<p>However the one the installation guide of COSIMIR indicates, looks completely different.\nAlso, even though I cannot detach that dongle (because it is secured to the PC mainly because somehow the PC will stop working is we disconnect it, I still can do some fast debugging commands in there lie a run trace or stuff like that.</p>\n<p>To keep things short, my main question is: Which library should I put my breakpoint on if I want to avoid the USB access? my main suspects are:</p>\n<ul>\n<li>COMCTL</li>\n<li>COMBASE</li>\n<li>UCRTBASE</li>\n</ul>\n<p>and my secondary suspects are</p>\n<ul>\n<li>CRYPTBASE</li>\n<li>BCRYPT</li>\n</ul>\n<p>Also, I'm going to try to reach the Company by mail as Nordwald suggests, but even if I get a positive response, I would enjoy the help, for learning purposes.</p>\n</div>",
    "votes": "1",
    "answers": 3,
    "views": "5k",
    "tags": [
        "debugging",
        "usb",
        "dongle"
    ],
    "user": "Lohug",
    "time": "Nov 22, 2018 at 8:53",
    "comments": [
        {
            "user": "ggiorgana",
            "text": "<span class=\"comment-copy\">I also want to create a virtual dongle from my original USB with the COSIMIR license. May you please share the process that Festo shared you to create a pseudo-dongle? Thanks!</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Reverse Engineering has always been about finding the right place to start. There are two common options here:</p>\n<p><strong>Prevent activation checks</strong></p>\n<p>For activation purposes, its most likely the best way to search for references to a string related to activation. In this particular case, I would use a decent decompiler like BinaryNinja, IDA or radare2 to find references to</p>\n<blockquote>\n<p>Please attack an appropriate license connector or license server</p>\n</blockquote>\n<p>This will most likely lead you to the place this window is initialized. Go back from there looking at the conditions checked before invoking the window creation.</p>\n<p><strong>Make activation succeed, when it fails</strong></p>\n<p>This one is a little bit more tricky, because most likely you will have to patch at serveral places. Try to run any kind of activation, wait until you get an error message (e.g. 'no activation dongle attacked'), find references to this string and start going backwards from there. Most likely you will find a check if the USB dongle is attached. Patch it and continue from there. Could be pretty tedious.</p>\n<p>also:</p>\n<blockquote>\n<p>Don't crack software. Any information stated above is purely\neducational.</p>\n</blockquote>\n<p>You can always try to contact the company:</p>\n<blockquote>\n<p>Adresse: Am Hausbruch 7, 58239 Schwerte</p>\n<p>Telefon: 02304 44447</p>\n</blockquote>\n<p>Kind regards</p>\n</div>",
            "votes": "2",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Lohug",
                    "text": "<span class=\"comment-copy\">ill try to reach them, however it seems like they no longer support that software since is no longer on their website (not even the student version), however the software seeks for a valid license on the startup, and after finding nothing it pops me into that string, the problem is I still dont know where to stop it, after reaching that screen I only have the choice of the internet installation, so im sure it asks for the dongle before poping up that window, specially since before that window there is another one whic is pretty much the same but with the message \"searching for a valir license\"</span>",
                    "time": null
                },
                {
                    "user": "Lohug",
                    "text": "<span class=\"comment-copy\">but also, I found in the referenced strings many \"license verification\" processes, but eventhough I breakpointed themall, the program ran from start to end without stopping, so my belief is that it checks for a valid connection before entering those cycles.</span>",
                    "time": null
                },
                {
                    "user": "Lohug",
                    "text": "<span class=\"comment-copy\">Sorry for the long delay man, I finally done it, it looked like it actually did interfaced with the dongle but just for initiallitation processes in the end i was able to do it, we we able to finally ge an answer from festo and they told us a \"way\" to make a pseudo-copy of the dongle, they didnt sent one though because they said that it was discontinued software, however  since the whole problem was to keep the original safe, with this copy i was finally able to makea kind of executable that had like \"virtual dongle\" inside the exe compilation, so far in looks like it works</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>USB keys used for software protection are often not that easy to bypass, and the techniques described in the other answer will likely not work. Depending on the implementation, USB key may be used for one of the following purposes:</p>\n<ul>\n<li>Performing cryptographic calculations, such as RSA/AES. License key is sent to the stick and the response is validated by software. In this case, you can just patch out all the checks but then again, it's unlikely the stick is used just for that;</li>\n<li>Storing some crucial data in encrypted form. Data is decrypted by using license key and sent to the host;</li>\n<li>Storing some critical code paths, same as previous except the program literally cannot be executed without decrypting and downloading these code fragments;</li>\n<li>Executing parts of the code <em>on the stick itself</em>. The program offloads some of its operations to the stick.</li>\n</ul>\n<p>So, it all boils down to the implementation. In some cases, the missing code/data can be reimplemented in the host software, and that requires additional RE effort.</p>\n</div>",
            "votes": "0",
            "user": "Vladislav Ivanov",
            "time": "Oct 11, 2017 at 8:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Lohug",
                    "text": "<span class=\"comment-copy\">I know!, and i used to think just like that, but then, why is it that i can activate the software by other ways that dont require a Dongle at all?</span>",
                    "time": null
                },
                {
                    "user": "Vladislav Ivanov",
                    "text": "<span class=\"comment-copy\">Good point. You just need to make sure internet activation doesn't pull some crucial code fragments from the server.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>According to their <a href=\"https://www.marx.com/documents/information_material/crypto-box/english/SmarxOS_Compendium_en_2018-03-27.pdf\" rel=\"nofollow noreferrer\">developer documentation</a>, it could be one of the following dll files:</p>\n<pre><code>mpiwin32.dll\nCBIOSVB6.DLL\nWebLM.dll\nCBIOS4NET.dll\nCBIOS4NET64.dll\n</code></pre>\n<p>It's always a good idea to go to the dongle's manufacturer website and see if they have document for developers describing their API.</p>\n</div>",
            "votes": "0",
            "user": "Sam",
            "time": "Jun 7, 2019 at 8:17",
            "is_accepted": false,
            "comments": []
        }
    ]
}