{
    "title": "Overriding the second argument with conditional breakpoints",
    "link": "https://reverseengineering.stackexchange.com/questions/16598/overriding-the-second-argument-with-conditional-breakpoints",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>With conditional breakpoints I'm able to alter the return value of a function. For example, when setting a breakpoint on the return instruction, the following IDC expression ensures that the function always returns false:</p>\n<pre><code>EAX=0\n</code></pre>\n<p>Now I would like to override the second argument that the function receives with a value of zero. The breakpoint is set on the first instruction of the function (<code>push 1Ch</code>). Unfortunately, I cannot get the following IDC expression to work as intended:</p>\n<pre><code>(ESP+8)=0\n</code></pre>\n<p>When the function is called, the value located at <code>ESP+8</code> refers to the size of the buffer that is about to receive a bunch of values. By purposely setting the buffer size to zero, the function won't return any values.</p>\n<p>How can I configure a conditional breakpoint with IDA that sets the value at <code>ESP+8</code> to zero? And is it possible to do this by simply editing the breakpoint instead of running a script?</p>\n<hr/>\n<blockquote>\n<p>You have to use IDC functions to write to memory addresses. I\n  recommend write_dbg_memory() function.</p>\n</blockquote>\n<p>I still can't get the script to run successfully. When using the <code>write_dbg_memory</code> function, I get the following error message:</p>\n<pre><code>Runtime error at _idc+0x00000022: Attempt to call undefined function 'write_dbg_memory'\n</code></pre>\n<p>It also seems that the <code>write_dbg_memory</code> function that is listed <a href=\"https://www.hex-rays.com/products/ida/support/idapython_docs/ida_idd-module.html#dbg_write_memory\" rel=\"nofollow noreferrer\">here</a> and <a href=\"https://www.hex-rays.com/products/ida/support/idadoc/1614.shtml\" rel=\"nofollow noreferrer\">here</a>, uses different arguments (long ea, string data).</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "778",
    "tags": [
        "ida",
        "debugging",
        "breakpoint"
    ],
    "user": "303",
    "time": "Oct 23, 2017 at 18:58",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can use IDC functions to write to memory addresses.\nI recommend <code>write_dbg_memory()</code> function.</p>\n<pre><code>write_dbg_memory(ESP+8, 0, size)\n</code></pre>\n<p><a href=\"https://www.hex-rays.com/products/ida/support/idapython_docs/\" rel=\"nofollow noreferrer\">https://www.hex-rays.com/products/ida/support/idapython_docs/</a></p>\n<p>Actually the line/s you put in condition of a breakpoint is also considered as a script which is executed when encountering the <code>BP</code>. So it has to follow the rules of writing a script. <code>EAX = 0</code> is a simple line you've used before.</p>\n<p>If IDC is not working you can use idaapi.dbg_write_memory api. I've tried the following line as a condition and it works fortunately! Choose <strong>\"Python\"</strong> for the <strong>\"Scriptinng Language\"</strong> menue bar.  </p>\n<pre><code>daapi.dbg_write_memory(GetRegValue(\"ESP\")+8,\"HELLO\")\n</code></pre>\n</div>",
            "votes": "2",
            "user": "EWD-0-",
            "time": "Oct 23, 2017 at 20:11",
            "is_accepted": false,
            "comments": [
                {
                    "user": "303",
                    "text": "<span class=\"comment-copy\">Thank you for your answer. Unfortunately, I still can't get the script to run properly. Please check my question again, I've updated it accordingly.</span>",
                    "time": null
                },
                {
                    "user": "EWD-0-",
                    "text": "<span class=\"comment-copy\">WLC! I've added a new line to the answer check it out... Hope it works</span>",
                    "time": null
                },
                {
                    "user": "303",
                    "text": "<span class=\"comment-copy\">When I try to run that code via <code>File &gt; IDC command...</code>, I receive the following error message: <code>Variable 'daapi' is undefined</code>. Maybe those features aren't supported by IDA version 5.0.0.879?</span>",
                    "time": null
                },
                {
                    "user": "EWD-0-",
                    "text": "<span class=\"comment-copy\">Have you chosen Python as scripting language? If you go with IDC, which is the default value, it won't work.</span>",
                    "time": null
                },
                {
                    "user": "EWD-0-",
                    "text": "<span class=\"comment-copy\">Right click on the address and choose \"Edit Breakpoint\". Then on the condition bar click on \"...\" bar. On the new page at the right bottom side choose Python as scripting language</span>",
                    "time": null
                }
            ]
        }
    ]
}