{
    "title": "What are the overall features used in static analysis of malware? Is file property among the features used in static analysis of malware?",
    "link": "https://reverseengineering.stackexchange.com/questions/16608/what-are-the-overall-features-used-in-static-analysis-of-malware-is-file-proper",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I was looking at the paper: \"Improved Detection for Advanced Polymorphic Malware\" by James Fraley who claimed to have used static, dynamic and file properties for increased malware detection. But is file property not a static feature?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "156",
    "tags": [
        "malware",
        "static-analysis"
    ],
    "user": "Faisal Ali Gama",
    "time": "Oct 23, 2017 at 23:01",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">is the term defined in the paper? also, you have two questions in the title, try to be more specific.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The author does not appear to explicitly explain what \"file properties\" are, but some of the papers cited in relation to \"file properties\" discuss the role of malware families in machine-learning based approaches to malware detection. </p>\n<p>It is possible that the author does not provide a clear description of what is meant by \"file properties\" because the term is being used as a <a href=\"https://en.wikipedia.org/wiki/Buzzword\" rel=\"nofollow noreferrer\">buzzword</a> (\"Static analysis, dynamic analysis <em>and</em> file properties? How exciting and novel!\") such that it has no real technical meaning and is employed to draw attention to some aspect of the research deemed new or original. This seems to happen frequently in research investigating applications of machine learning to information security challenges.</p>\n<p><a href=\"https://i.sstatic.net/acLQ1.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/acLQ1.jpg\"/></a></p>\n<p>Here are some of the papers cited in relation to the author's use of the term \"file properties\":</p>\n<ul>\n<li><a href=\"http://ieeexplore.ieee.org/abstract/document/969588/\" rel=\"nofollow noreferrer\">Subramanya, S. R., &amp; Lakshminarasimhan, N. (2001). Computer viruses. IEEE Potentials, 20(4), 18–21</a></li>\n<li><a href=\"http://ieeexplore.ieee.org/document/7440587/\" rel=\"nofollow noreferrer\">Hansen, S. S., Mark, T., Larsen, T., Stevanovic, M., &amp; Pedersen, J. M. (2016). An Approach for Detection and Family Classification of Malware Based on Behavioral Analysis. 2016 International Conference on Computing; Networking and Communications (ICNC), (February), 1–5.</a></li>\n<li><a href=\"https://dl.acm.org/citation.cfm?id=2381910\" rel=\"nofollow noreferrer\">Singh, A., Walenstein, A., &amp; Lakhotia, A. (2012). Tracking concept drift in malware families. Proceedings of the 5th ACM Workshop on Security and Artificial Intelligence - AISec ’12, 81–92.</a></li>\n</ul>\n<hr/>\n<p>Text of interest from page 79:</p>\n<blockquote>\n<ol start=\"2\">\n<li>Manipulate feature set – the standard feature dataset was augmented to evaluate whether detection rates are improved after the intervention of features. A number of studies examined dynamic analysis (Rieck, Trinius, Willems, &amp; Holz, 2011), static analysis (Kerchen et al., 1990) and file properties (<a href=\"http://ieeexplore.ieee.org/abstract/document/969588/\" rel=\"nofollow noreferrer\">Subramanya &amp; Lakshminarasimhan, 2001</a>). The study examined three multidimensional datasets. The three datasets were generated by combining known malware, known benign and unknown samples into single feature dataset. Once the baseline was generated, the feature weighting was manipulated to see if detection rates would improve (Siddiqui, 2008). </li>\n</ol>\n</blockquote>\n<p>Text of interest from page 99:</p>\n<blockquote>\n<p>Polymorphic malware may call libraries or use functions available through the operating system such as Microsoft’s dynamic link libraries (DLLs) (Egele, Scholte, Kirda, &amp; Kruegel, 2012). The intended use or abuse of such functions by malware can be linked to file properties of the malware itself (<a href=\"http://ieeexplore.ieee.org/document/7440587/\" rel=\"nofollow noreferrer\">Hansen et al., 2016</a>). Therefore, experiments conducted during this phase, added various features from file properties to those of dynamic-static occurrence tests performed previously. Previous research has shown that there exists a number of “metadata” properties that can be used for malware detection (Kamongi, Kotikela, Kavi, Gomathisankaran, &amp; Singhal, 2013) and (<a href=\"https://dl.acm.org/citation.cfm?id=2381910\" rel=\"nofollow noreferrer\">A. Singh et al., 2012</a>). This study found similar results. This study performed extended static to dynamic occurrence testing with all three advanced clustering algorithms (MB, IBk and DLMLP).</p>\n</blockquote>\n</div>",
            "votes": "4",
            "user": "julian",
            "time": "Oct 24, 2017 at 1:27",
            "is_accepted": false,
            "comments": []
        }
    ]
}