{
    "title": "Emulation Project - GameGuard Protected Client",
    "link": "https://reverseengineering.stackexchange.com/questions/16616/emulation-project-gameguard-protected-client",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm not new to MMO Server Emulation, but I am new to working with a protected Client, and have very basic RCE skills. I would appreciate some direction, and maybe this won't be possible, given the requirements.</p>\n<p>The target is Uncharted Waters Online, now published by Papaya Play, utilizing GameGuard (instead of X-Trap, as the previous publisher).</p>\n<p>Two Priorities:</p>\n<ol>\n<li>Prevent the Client from loading or attempting to refer to GameGuard.</li>\n<li>Understand the client-server communication through Packet Analysis. Obviously, impossible with Encrypted Packets.</li>\n</ol>\n<p>My Questions:</p>\n<ol>\n<li><p>How entrenched is GameGuard? Will simply bypassing the loading routines be enough?? Or must I allow it to load, but Bypass all the functions that it alters? Obviously, I would like the Client to not have to load GameGuard when accessing the Emulated Server.</p></li>\n<li><p>Encrypted Packets. A major task will be to see the unencrypted packet contents while connected to Live Servers. Does anyone have experience with this? My thoughts are to find and detour the encryption and decryption functions, to output the raw packet information somewhere else. Is this a viable approach? Is this practical, or is there an easier way for me to understand the network communication?</p></li>\n</ol>\n<p>Thanks all. All I'm looking for is an approach. I can research on my own how to achieve that, but at this point, I don't know enough about GameGuard and Reversing Packet Encryption to know where to start.</p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "1k",
    "tags": [
        "encryption"
    ],
    "user": "Lokked",
    "time": "Oct 24, 2017 at 19:32",
    "comments": [
        {
            "user": "Lokked",
            "text": "<span class=\"comment-copy\">Thanks to the 2 answers and some help from another, I was able to bypass GameGuard, discover the crypt routines (Blowfish) and now I have a stream of unencrypted packets to analyze. Thank you, all! I know this is old, but I just wanted to show my appreciation.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Game hacker here.</p>\n<p>To address your first question, forums like <a href=\"https://www.elitepvpers.com/\" rel=\"nofollow noreferrer\">ElitePVPers</a>, <a href=\"http://www.ownedcore.com/\" rel=\"nofollow noreferrer\">OwnedCore</a>, <a href=\"https://unknowncheats.me/\" rel=\"nofollow noreferrer\">UnknownCheats</a>, <a href=\"http://www.mpgh.net/\" rel=\"nofollow noreferrer\">MPGH</a>, etc. are going to be your absolute best friend. The people you'll find in those places are steeped in exactly this type of reversing, so starting with a Google search like <a href=\"https://www.google.com/search?q=unknowncheats%20gameguard\" rel=\"nofollow noreferrer\">UnknownCheats GameGuard</a> will yield results like <a href=\"https://www.unknowncheats.me/wiki/GameGuard\" rel=\"nofollow noreferrer\">this</a>. That alone should give you a well-rounded summary of the technology and some of its current exploits (meaning you may not have to do very much heavy lifting on your own).</p>\n<p>As for your second question, yes, that's a viable approach, but it can be extremely tough to find your way to decrypted data depending on how well-guarded they keep it (whether through odd Assembly instruction/sub-routine obfuscation, VMs, ridiculous looping, etc., etc.). Once again, those forums should really take you far. It sounds like you already have a good grasp on the language of reversing, so you positing questions around those places should be taken to by the more intelligent and experienced folks.</p>\n<p>Finally, I highly recommend the book <a href=\"https://www.nostarch.com/networkprotocols\" rel=\"nofollow noreferrer\">Attacking Network Protocols</a> if that's one of the key areas that interests you with reversing.</p>\n<p>Good luck!</p>\n</div>",
            "votes": "2",
            "user": "dsasmblr",
            "time": "Oct 25, 2017 at 20:43",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I don't think this question will get much traction here given it's a very specific, while still being quite broad. That being said some input for general game hacking: </p>\n<ol>\n<li><p>Your first step would be to figure out how the anti-cheat is being loaded: is it being streamed from a secure server, is it a DLL which is loaded at runtime, etc. Once you've found out how the anti-cheat is loaded, you can implement a workaround, i.e load order hijacking, or patching the stream routine. </p></li>\n<li><p>Your assumption is correct, hooking the networking functions is easiest way of altering/decoding packets. Look for a specific function calls (i.e createsocket, send, recv etc) and work backwards from there.</p></li>\n</ol>\n</div>",
            "votes": "1",
            "user": null,
            "time": "Oct 25, 2017 at 13:45",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Lokked",
                    "text": "<span class=\"comment-copy\">Can you point me to what win32 APIs could possibly be used to either load (LoadLibrary?) or Stream (just Send/Recv?)?</span>",
                    "time": null
                },
                {
                    "user": "user15338",
                    "text": "<span class=\"comment-copy\">This is where the actual reversing comes in as the game could use any number of library functions to achieve these tasks. Although it is common for games to use third party networking libraries rather than roll their own (compress/encryption is complicated). Check the games import table, and function calls for clues. Two common networking libraries are Raknet, and Oodle Network, although it could be any number of other libraries - as a general rule of thumb, if you don't know what a DLL or function does, google it.</span>",
                    "time": null
                }
            ]
        }
    ]
}