{
    "title": "How to decrypt .jpg files of comics app in a C Program?",
    "link": "https://reverseengineering.stackexchange.com/questions/16690/how-to-decrypt-jpg-files-of-comics-app-in-a-c-program",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to decrypt jpg images of comics I purchased in my comic reader app on android but neither I can view them (after copying from SD card to Windows desktop) nor can I convert them to pdf to read on my desktop.</p>\n<p>I see a lot of data before start of jpg header FF D8, and am confused.</p>\n<p>01 00 00 00 2D 82 00 00 28 00 00 00 80 47 88 47 80 48 08 48 00 48 08 48 00 48 88 47 00 48 88 47 00 48 88 47 00 48 08 48 EF 4F 00 00 00 00 00 00 41 00 00 00 00 00 00 00 41 00 00 00 00 00 00 00 C8 E3 E4 E4 03 3A AB F3 0F DE 05 14 33 C9 82 B8 32 72 8F 20 67 10 7D 08 45 09 99 C6 61 1B 30 C4 D4 15 6F F1 8C 65 05 C1 FF D8 FF E0</p>\n<p>Here are examples of those encrypted images: <a href=\"https://www.mediafire.com/view/4tnc45xppeazy1c/09.jpg\" rel=\"nofollow noreferrer\">https://www.mediafire.com/view/4tnc45xppeazy1c/09.jpg</a> <a href=\"https://www.mediafire.com/file/u0z57slaar4k9ln/10.jpg\" rel=\"nofollow noreferrer\">https://www.mediafire.com/file/u0z57slaar4k9ln/10.jpg</a></p>\n<p>Is there a way of decrypting these in a C Program ?</p>\n<p>I tried getting information in JPEGsnoop, it stops at Unknown marker [0xFF02] From the header information it is jpeg file, but parsing stops abruptly. It may be embedded jpeg's in custom format.</p>\n<pre><code>*** Marker: SOS (Start of Scan) (xFFDA) ***\n  OFFSET: 0x00000152\nScan header length = 12\n  Number of img components = 3\n    Component[1]: selector=0x01, table=0(DC),0(AC)\n    Component[2]: selector=0x02, table=1(DC),0(AC)\n    Component[3]: selector=0x03, table=1(DC),0(AC)\n  Spectral selection = 0 .. 0\n  Successive approximation = 0x01\n\n NOTE: Scan parsing doesn't support this SOF mode.\n\n*** Marker: ??? (Unknown) (xFF02) ***\nOFFSET: 0x00004806\n    WARNING: Unknown marker [0xFF02]\n  Stopping decode\n  Use [Img Search Fwd/Rev] to locate other valid embedded JPEGs\n</code></pre>\n<p>While opening in photoshop loads only a part of jpeg image or shows error \"Could not complete your request because of a problem parsing the JPEG data\". While in android app first a thumbnail image loads, then panels are loaded as detailed images, but all information is contained in one single jpeg file. \nOr if there is already a software that can fix extra data in these files.</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "1k",
    "tags": [
        "c",
        "encryption"
    ],
    "user": "Kinjal Kishor",
    "time": "Nov 2, 2017 at 3:53",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">did you try decompiling the app and see what it does with the files?</span>",
            "time": null
        },
        {
            "user": "Kinjal Kishor",
            "text": "<span class=\"comment-copy\">decompiling the app is beyond my skill level.</span>",
            "time": null
        },
        {
            "user": "Kinjal Kishor",
            "text": "<span class=\"comment-copy\">Basically the app loads a low resolution full image then it loads portions of image panel by panel. Probably image coordinates for panels is marked.</span>",
            "time": null
        },
        {
            "user": "dsasmblr",
            "text": "<span class=\"comment-copy\">Some JPEGs have embedded thumbnails that have the same SOF magic/EOF as the full-resolution image, so there may be some sort of mix-up with that. Unless you unpack the application, decompile it, and/or view its contents dynamically in memory (scanning for JPEG SOF/EOF and attempting to rebuild files manually via hex editor, Python, etc.), what you're looking to accomplish may simply not be possible using the samples you've provided...maybe. I haven't looked at the files, so I'm not sure. The app may also be rendering JPEG output (based on zoom) from a different lossless image format, etc.</span>",
            "time": null
        },
        {
            "user": "Kinjal Kishor",
            "text": "<span class=\"comment-copy\">For now I have solved the problem by running it in virtual android RemixOSPlayer and taking screenshots from Windows and batch cropping the images. I wanted to extract full resolution single images, but may be it is a embedded image file with a low resolution full image.</span>",
            "time": null
        }
    ],
    "answers_data": []
}