{
    "title": "How do Enigma, Themida and VMProtect compare to each other?",
    "link": "https://reverseengineering.stackexchange.com/questions/16753/how-do-enigma-themida-and-vmprotect-compare-to-each-other",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'll be releasing a piece of software soon and I'm looking for good protectors. The three that came to my attention were: Enigma, Themida and VMProtect. I searched a lot online but I couldn't find many comparisons. They are all in a similar price range so that is not a huge problem. I was wondering what the main differences are between them? Virtualization, string encryption, packing etc. I couldn't find much info about that.</p>\n<p>All replies are appreciated! Thanks</p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "16k",
    "tags": [
        "decompilation",
        "encryption",
        "protection"
    ],
    "user": "Fomic",
    "time": "Nov 12, 2017 at 16:01",
    "comments": [
        {
            "user": "Megabeets",
            "text": "<span class=\"comment-copy\">Voted to close since this question is primarily opinion-based.</span>",
            "time": null
        },
        {
            "user": "Fomic",
            "text": "<span class=\"comment-copy\">I'm looking for an objective comparacent of the features and also a bit of personal opinon</span>",
            "time": null
        },
        {
            "user": "julian",
            "text": "<span class=\"comment-copy\">related: <a href=\"https://reverseengineering.stackexchange.com/questions/118/what-kinds-of-steps-can-i-take-to-make-my-c-application-harder-to-reverse-engi/119#119\" title=\"what kinds of steps can i take to make my c application harder to reverse engi\">reverseengineering.stackexchange.com/questions/118/…</a></span>",
            "time": null
        },
        {
            "user": "Megabeets",
            "text": "<span class=\"comment-copy\">Check out <a href=\"https://forum.tuts4you.com/topic/39732-vmprotect-vs-themida\" rel=\"nofollow noreferrer\">this thread</a> from tuts4you</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><strong>Disclaimer</strong>: I do not work for any of the companies that make either of these pieces of software. All details shown are from my own personal research.</p>\n<p>This comparison will only include the protectors I personally have a licence for: VMProtect and Themida. I do not have a licence to Enigma, so I cannot tell about its protection features.</p>\n<p>I will also not be including the licencing features of either, I will only be talking about the protection methods they employ.</p>\n<p>To get us started, here is the \"unprotected\" version of a simple loop function that we will be protecting with both protectors to see what they output.</p>\n<p><a href=\"https://i.sstatic.net/icsmw.png\" rel=\"noreferrer\"><img alt=\"\" src=\"https://i.sstatic.net/icsmw.png\"/></a></p>\n<p><strong>VMProtect</strong></p>\n<p>VMProtect has 3 protection modes: <em>Mutation</em>, <em>Virtualization</em>, and \"<em>Ultra</em>\" (both methods combined)</p>\n<p><em>Mutation</em> does what it says it does: it <strong>mutates</strong> the assembly code to make automated analysis of it harder. The resulting mutated code varies drastically per compilation.</p>\n<p><a href=\"https://i.sstatic.net/jCdNZ.png\" rel=\"noreferrer\"><img alt=\"\" src=\"https://i.sstatic.net/jCdNZ.png\"/></a></p>\n<p>On the other hand, <em>Virtualization</em> translates the code into a special format that only a special virtual machine can run. It then inserts a \"stub\" function to call the VM where the actual code was supposed to be ran.</p>\n<p><a href=\"https://i.sstatic.net/B3hka.png\" rel=\"noreferrer\"><img alt=\"\" src=\"https://i.sstatic.net/B3hka.png\"/></a></p>\n<p>Note that this VM inserts a lot of overhead. The original ~100kb application was increased to around ~600kb after protection using this method. You can decrease the size though by turning on the packing feature inside of VMProtect.</p>\n<p>There is also functionality for checking if debuggers are being ran, string encryption, methods of grabbing a unique identifier for the computers hardware, etc.</p>\n<p><strong>Themida</strong></p>\n<p>Themida is a little different from VMP. While it also has the same protection features of VMP, it does it much differently and has a few more features that VMP does not have. Note though that these features that VMP does not have do not work on all application types.</p>\n<p>For Themida's <em>Mutation</em>, it does it quite differently to VMP. It adds lots of random operations to the assembly instead of specifically mutating each opcode.</p>\n<p><a href=\"https://i.sstatic.net/1gMkw.png\" rel=\"noreferrer\"><img alt=\"\" src=\"https://i.sstatic.net/1gMkw.png\"/></a></p>\n<p>Themida's <em>Virtualization</em> however has one cool feature that VMP does not: Multiple VM architectures. Themida has the ability to have different virtual machines (using a different architecture) inside of the same application. There is also different 'styles' of VM: some faster but less secure, some more secure but less fast, etc.</p>\n<p><a href=\"https://i.sstatic.net/DI7k0.png\" rel=\"noreferrer\"><img alt=\"\" src=\"https://i.sstatic.net/DI7k0.png\"/></a></p>\n<p>Of course, the problem with this is pretty obvious: the size. A protected application with all protection options disabled is around ~2mb from the original ~100kb. Luckily, Themida also has a packing feature to reduce the size, where it reduced it to around ~1mb. </p>\n<p>Themida also has a few other features: <em>\"ClearCode\"</em>, where it clears the assembly after it ran, <em>\"Encode\"</em>, decrypting the code at runtime and re-encrypting it after it was executed, string encryption, and functions to check code integrity.</p>\n<p><strong>Conclusion</strong></p>\n<p>Both protections are quite good when used properly. Which one you buy is up to you, not me, so I would recommend you to choose wisely for the application you wish to protect and to see which features you specifically want.</p>\n</div>",
            "votes": "11",
            "user": "3dsboy08",
            "time": "Nov 13, 2017 at 2:34",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Fomic",
                    "text": "<span class=\"comment-copy\">Thank you so much for this! I've been messing around with these 2 applications on my friends pc but I can't figure out one thing. How to encrypt string with the sdk? I can't seem to figure that out.</span>",
                    "time": null
                },
                {
                    "user": "3dsboy08",
                    "text": "<span class=\"comment-copy\">If I am correct, for VMProtect do VMProtectDecryptStringA/W, for Themida use the STR_ENCRYPT_START/STR_ENCRYPT_END macros.</span>",
                    "time": null
                },
                {
                    "user": "Fomic",
                    "text": "<span class=\"comment-copy\">do you use the macros like this STR_ENCRYPT_START string example = \"hello\" STR_ENCRYPT_END or string example = STR_ENCRYPT_START\"hello\"STR_ENCRYPT_END</span>",
                    "time": null
                },
                {
                    "user": "Fomic",
                    "text": "<span class=\"comment-copy\">also im looking into the vms. any suggestions which vms should i use for themida and vm protect?</span>",
                    "time": null
                },
                {
                    "user": "SSpoke",
                    "text": "<span class=\"comment-copy\">You put the macro on top of the code.. and on the bottom of the code of each function it's the same for all macros VMProtect and Themida</span>",
                    "time": null
                }
            ]
        }
    ]
}