{
    "title": "Struggling with an archive file format using \"encryption\"",
    "link": "https://reverseengineering.stackexchange.com/questions/16788/struggling-with-an-archive-file-format-using-encryption",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am currently working on a file format used to pack (storage only, no compression) different file types together for transport. There is some sort of very simple \"encryption\" used and so far I have not had any luck. I do know the exact (partial) plain text though. </p>\n<p>This is my first time reversing anything so it is very likely that I am missing something obvious!</p>\n<p>I have worked out the complete structure of the format:</p>\n<ul>\n<li>Header with some info</li>\n<li>all \"packed\" files concatenated, filled to mod4 and \"encrypted\"</li>\n<li>a file list with position, size and md5 for each file</li>\n</ul>\n<p>Additionally each md5 is followed by a 32bit seperator(same on each block and every file, value = 2) and than follows a 32bit \"key\" at least this is my guess as these 32bit are the same on each block in the file list but every archive file has its own \"key\". I do know the exact contents of some of the files (all black .pngs) and can find them in the \"cipher\" text, each of the multiple pngs is \"encrypted\" exactly the same so I was thinking that it can not be anything overly complicated. </p>\n<p>I can create multiple archives with the exact same content. If they are diffed the only thing that changes is the data block and the 32bit \"key\". The software used to create the archives does save a key value in one of its config files and changes it every time an archive is created but this key is 7 digit and the 32bit key (if read as LIT 32bit int) is a completely different 9 digit number. As the files are filled up so they are mod4=0 I tried to xor each 32bitblock with the \"key\" but this did not lead to the known plain text (e.g. png header data).</p>\n<p>There is no additional data sent(or received prior to creation of the archive) to the receiving machine(s) of these files so I assume that the key for decryption must be part of the original file.</p>\n<p>As the whole process of reversing the format was hugely difficult but progress also very rewarding I was just hoping for some pointers or obvious stuff I missed instead of an outright solution as this is the final piece of the puzzle :D</p>\n<ul>\n<li><a href=\"https://pastebin.com/n3riWux8\" rel=\"nofollow noreferrer\">Key with md5</a> from the file list</li>\n<li><a href=\"https://pastebin.com/54LhdzVs\" rel=\"nofollow noreferrer\">crypted png</a></li>\n<li><a href=\"https://pastebin.com/E7Jv4p9L\" rel=\"nofollow noreferrer\">plain text png</a></li>\n</ul>\n<p>Thank you </p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "364",
    "tags": [
        "file-format",
        "decryption",
        "decompress",
        "hash-functions"
    ],
    "user": "UntrustworthyKey",
    "time": "Dec 12, 2017 at 0:29",
    "comments": [
        {
            "user": "UntrustworthyKey",
            "text": "<span class=\"comment-copy\">Here is an <a href=\"https://pastebin.com/eF78UNBn\" rel=\"nofollow noreferrer\">encrypted</a> and <a href=\"https://pastebin.com/yJbeUCVq\" rel=\"nofollow noreferrer\">unencrypted</a> png hex dump. There seem to be multiple 4 -28 byte long patterns in encrypted dump but I am not sure how to further analyse those...</span>",
            "time": null
        },
        {
            "user": "David",
            "text": "<span class=\"comment-copy\">Any chance of getting the key that is associated with the hex dumps?  I have found some patterns but I need the key to verify.</span>",
            "time": null
        },
        {
            "user": "UntrustworthyKey",
            "text": "<span class=\"comment-copy\">@David thank you for trying! I have updated the question with the file list entry and reuped the data.</span>",
            "time": null
        },
        {
            "user": "booto",
            "text": "<span class=\"comment-copy\">Could you post the same png encrypted with a different key, along with that new key?</span>",
            "time": null
        },
        {
            "user": "UntrustworthyKey",
            "text": "<span class=\"comment-copy\">@booto Here you go <a href=\"https://pastebin.com/MRbqpRYG\" rel=\"nofollow noreferrer\">png</a> &amp; <a href=\"https://pastebin.com/TfSajU9g\" rel=\"nofollow noreferrer\">\"key\"</a></span>",
            "time": null
        }
    ],
    "answers_data": []
}