{
    "title": "Is it possible to use an xref on memory address in IDA Pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/16889/is-it-possible-to-use-an-xref-on-memory-address-in-ida-pro",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Say, if I have the following disassembly:</p>\n<p><a href=\"https://i.sstatic.net/ayQCl.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/ayQCl.png\"/></a></p>\n<p>How do I find out where else is that byte at <code>[eax+0xFCA]</code> is referenced? I can't seem to use the IDA's <code>xref</code> command on it, but doing <code>xref</code> on <code>fs:18h</code> gives me too many results.</p>\n<p>PS. I'm using IDA Pro as a disassembler, while stepping through <code>kernel32.dll</code> with <code>WinDbg</code> as a debugger in a user mode. In the screenshot above the <code>EIP</code> (breakpoint) is currently at the <code>744E78D6</code> opcode of interest.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "548",
    "tags": [
        "ida",
        "windows",
        "windbg"
    ],
    "user": "c00000fd",
    "time": "Dec 2, 2017 at 8:17",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>IDA's xref functionality only works for static references. The references it detects by statically analyzing the code. It cannot find any dynamic or runtime references to addresses using the xref functionality.</p>\n<p>Instead, you'd need to use the memory breakpoint feature IDA's debugging interface has (or any other debugger, for that matter) to breakpoint any time a memory address is accessed. Be advised memory breakpoints has several caveats such as incurring a noticeable performance penalty and being detectable by anti-debugging techniques. Hardware breakpoints may also be used for the same purpose but are harder to detect by anti-debugging techniques.</p>\n</div>",
            "votes": "3",
            "user": "NirIzr",
            "time": "Dec 2, 2017 at 8:34",
            "is_accepted": false,
            "comments": []
        }
    ]
}