{
    "title": "Bypassing av signature with Hex editing",
    "link": "https://reverseengineering.stackexchange.com/questions/16955/bypassing-av-signature-with-hex-editing",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I recently started studying on bypassing AV by finding an AV signature on <em>nc.exe</em> (NetCat) and changing it to see how it works. I have already found the place of signature with splitting method. Then, I should open <em>nc.exe</em> with a hex editor and change the Sig. </p>\n<p><strong>But</strong>, here is what it look like:</p>\n<p><a href=\"https://i.sstatic.net/hFTjg.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/hFTjg.png\"/></a></p>\n<p>And the file will get corrupted by editing it (adding or removing bytes).</p>\n<p><strong>My question is:</strong> What should I do for editing in this situations? What should I know for a successful binary editing?</p>\n<p>If I get this whole wrong tell me what should I be looking for.</p>\n<hr/>\n<p><strong>Note:</strong> the signature is in <code>.bss</code> and <code>.text</code> section of file</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "3k",
    "tags": [
        "pe",
        "hex",
        "binary-editing"
    ],
    "user": "0_o",
    "time": "Dec 12, 2017 at 6:54",
    "comments": [
        {
            "user": "xvk3",
            "text": "<span class=\"comment-copy\">This would be more on topic at Software Recommendations SE.</span>",
            "time": null
        },
        {
            "user": "0_o",
            "text": "<span class=\"comment-copy\">@Will i think software doesn't matter here, just the concept and the way you do it</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'd recommend using something such as OllyDbg or IDA PRO rather than just plain HexEditor since just using HexEditor you've got no idea what section of the PE you are editing. For example, you could be editing the <code>.text</code> PE section and editing an essential part of the program rather than <code>.idata</code> or .data section which just store variable data.</p>\n<p>So, few methods an AV could use for detection of malware are:</p>\n<ol>\n<li>Checksum of the whole file for an well-known piece of malware</li>\n<li>Checksum the <code>.text</code> (Can also be named <code>.code</code>) section of the PE as these pages are not flagged with WRITE permissions by default</li>\n<li>Checksum of the pattern that's malicious for example <code>OpenProcess</code> with <code>WriteProcessMemory</code> are often used for injecting DLLs or code into other processes. We could just create signature for that part of the code</li>\n</ol>\n<p><strong>Bypassing Method 1:</strong></p>\n<p>By randomly HexEditting you would manage to avoid AV detection method 1 (see above) but method 2 and 3 would detect the malware still. If you didn't overwrite anything essential for your program to execute.</p>\n<p><strong>Bypassing Method 2:</strong></p>\n<p>Rewrite a simple instruction or make a <code>JMP</code> to code-cave and put overwritten code there and JMP back to next instruction. So, you would be executing exact same code but different flow and .text section checksum would be different.</p>\n<p><strong>Bypassing Method 3:</strong></p>\n<p>To be able to bypass method 3 - You would need to add junk code between each call or add a JMP to a code cave and have the instruction set there. So, the code would still be the same but byte signature would be completely different.</p>\n<p>Your best to learn about assembly language and learn how to use IDA PRO or OllyDbg and learn about patching programs before you move onto something more complex like bypassing AV.</p>\n</div>",
            "votes": "3",
            "user": "Paul",
            "time": "Dec 11, 2017 at 14:05",
            "is_accepted": false,
            "comments": []
        }
    ]
}