{
    "title": "Changing a windows name by patching create window function call",
    "link": "https://reverseengineering.stackexchange.com/questions/16979/changing-a-windows-name-by-patching-create-window-function-call",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I use x64dbg and IDA Pro the process is 32bit. I'm not sure if I'm doing this right or not because I'm getting a crash which I'm not sure if it's caused by me doing something wrong or the startup process of the application failing for some reason because it can't find the window.</p>\n<p>Basically what I'm trying to do is change the window title of some application on startup. I'm trying to achieve this by setting a break point on the <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms632680(v=vs.85).aspx\" rel=\"nofollow noreferrer\">user32 function</a> <code>CreateWindowExA</code> and then attempting to change the <code>lpWindowName</code> parameter.</p>\n<p>Here is what execution looks like when the bp is hit:</p>\n<p><a href=\"https://i.sstatic.net/gKGKv.png\" rel=\"nofollow noreferrer\"><img alt=\"code\" src=\"https://i.sstatic.net/gKGKv.png\"/></a></p>\n<p>Where you see the string \"Title possibly\" originally contained what was the windows title, so I assume that's the location I need to change. When changing at that address is when I get the error though.</p>\n<p>Sorry for any ignorance, I'm new to this and practicing. Thanks.</p>\n<p>Edit: I worked on this a little more and made a dummy program to help me figure out what was happening. So the <code>CreateWindowExA</code> function in this application used the same pointer for both <code>lpClassName</code> and <code>lpWindowName</code> args. So patching the program to push just a string instead of that pointer successfully achieved what I was aiming for.</p>\n</div>",
    "votes": "5",
    "answers": 3,
    "views": "2k",
    "tags": [
        "ida",
        "debugging",
        "binary-analysis",
        "x86"
    ],
    "user": "notvita",
    "time": "Dec 19, 2017 at 22:17",
    "comments": [
        {
            "user": "EWD-0-",
            "text": "<span class=\"comment-copy\">Do you change the pointer or the bytes it points to? What is the size in bytes of the original window title?</span>",
            "time": null
        },
        {
            "user": "notvita",
            "text": "<span class=\"comment-copy\">I change the bytes it points to and keep it with a string of the same length if that counts for anything.   The original title I believe is a string of 10 characters including the <code>0/</code> (if I need to include it?) unless it's a wide char I guess. Not exactly sure how I would confirm that though sorry</span>",
            "time": null
        },
        {
            "user": "EWD-0-",
            "text": "<span class=\"comment-copy\">Take a look <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms632680(v=vs.85).aspx\" rel=\"nofollow noreferrer\">msdn.microsoft.com/en-us/library/windows/desktop/…</a> to see if you change the right parameter. There is no need to guess which parameter is the window name when it's documented.</span>",
            "time": null
        },
        {
            "user": "notvita",
            "text": "<span class=\"comment-copy\">Thanks. I was trying to but I'm a bit confused about things. Where the line is it breaks, but that to me doesn't look like a function. Are all those instructions leading up to the <code>call user32.76F8AA9C</code> down the bottom the functions prologue and then the actual call the function being called? That's kind of the conclusion I came to and all the <code>dword ptr ss</code> pushes above <code>call user32.76F8AA9C</code> being the functions parameters?</span>",
            "time": null
        },
        {
            "user": "EWD-0-",
            "text": "<span class=\"comment-copy\">Yes, as in stdcall we have the parameters in the stack you can just check/change them in the debugger stack view. What you see here is a functions which is somehow working as an interface to call the main functionality.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Tip: Install xAnalyzer for x64dbg, that might help you in your reversing efforts. </p>\n<p>Now, you are in the <code>user32.dll</code> function <code>CreateWindowExA</code>. I would not change that parameter there, but outside in user code (familiarize yourself with the <code>stdcall</code> convention, its what WinApi uses). The parameter you are shooting for is three pushes above the <code>call CreateWindowExA</code> in user code. Either change the pointer or the content under it and don't forget to null-terminate.</p>\n</div>",
            "votes": "3",
            "user": "barnaby-b",
            "time": "Dec 20, 2017 at 14:55",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Kernel function? For starters this is not a function in kernel32.dll and furthermore just because that DLL has \"kernel\" in its name doesn't make the function a kernel function.</span>",
                    "time": null
                },
                {
                    "user": "barnaby-b",
                    "text": "<span class=\"comment-copy\">@0xC0000022L You are completely right. It was late here and I just typed up a quick answer. Of course that CreateWindow does not go through the sysenter system, I just saw he's inside a dll and called it a kernel function for whatever reason. (edited the aswer)</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Hook it, then set the parameter <code>lpWindowName</code> to <code>\"your name here\"</code> (no promises this will work) OR breakpoint on <code>mov edx, dword ptr ss:[EBP+C]</code>, then grab EBP from the FPU (registers box), go in to a program like ReClass and set the <code>EBP+0xC</code> (window name) to whatever name you want (90% sure this will work). References: <a href=\"https://stackoverflow.com/questions/873658/how-can-i-hook-windows-functions-in-c-c\">https://stackoverflow.com/questions/873658/how-can-i-hook-windows-functions-in-c-c</a> <a href=\"https://www.youtube.com/watch?v=K_jj6yF5ac0\" rel=\"nofollow noreferrer\">https://www.youtube.com/watch?v=K_jj6yF5ac0</a></p>\n</div>",
            "votes": "2",
            "user": "Graham Best",
            "time": "Dec 15, 2017 at 15:14",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Thanks for the responses guys. I managed to achieve my goal which is detailed in the OP edit:</p>\n<p>The <code>CreateWindowExA</code> function in this application used the same pointer for both <code>lpClassName</code> and <code>lpWindowName</code> args. So patching the program to push just a string instead of that pointer for <code>lpWindowName</code> successfully achieved what I was aiming for. I believe changing the <code>lpClassName</code> was causing the crash I described in the OP.</p>\n</div>",
            "votes": "0",
            "user": "notvita",
            "time": "Dec 19, 2017 at 22:20",
            "is_accepted": true,
            "comments": []
        }
    ]
}