{
    "title": "How to extract the automatic comment for these data items in IDA?",
    "link": "https://reverseengineering.stackexchange.com/questions/17008/how-to-extract-the-automatic-comment-for-these-data-items-in-ida",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So I'm seeing this a lot in an IDA database:</p>\n<pre><code>; wchar_t off_BADF00D\noff_BADF00D     dd offset loc_6F0062\n                dd offset loc_740074\n                dd offset loc_6D006E+1\n                align 10h\n</code></pre>\n<p>So given the comment at the top IDA <em>knows</em> from the code reference that this ought to be a zero-terminated wide character string.</p>\n<p>I was thinking of writing a simple IDAPython script to find instances of this and force these items to be converted to the appropriate data type automatically.</p>\n<p>However, neither <code>;</code> nor <code>:</code> showed anything, so this is neither a repeatable nor a normal comment. So what is it and how can I use IDAPython to extract it? I also tried (prompted by a comment here) if it's an anterior or posterior comment line. It wasn't.</p>\n<p>Alternatively I'll also be happy if someone can point out how to \"guide\" IDA to do the right thing without scripting, but this sparked my curiosity, so only bonus points for that. I'd still like to find out how to get the comment shown.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "974",
    "tags": [
        "ida",
        "idapython"
    ],
    "user": "0xC0000022L",
    "time": "Dec 19, 2017 at 20:56",
    "comments": [
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">It could be a \"line above\" comment. The other types – once <code>:</code> and repeated <code>;</code> – appear at the end of the first line of code or data.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Thanks, good idea. However, they're not anterior or posterior lines either. Will edit my question accordingly.</span>",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">Could it be some form of declaration? A function declaration appears like this above its first line. But this is not a function, so ... some other type?</span>",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">Here is a thought: you can find out what IDA internally calls this if you select this part of the code and dump it as an IDC file (or at least, I think that's the one with all the commands listed).</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Can't tell about python, but in IDC you can partially get that 'comment' via <code>GetType(ea)</code>. I say partially because it gives <code>wchar_t[67]</code> as result for comment like <code>; wchar_t aHttpSchemas_27[67]</code>.</p>\n</div>",
            "votes": "1",
            "user": "0xC0000022L",
            "time": "Dec 22, 2017 at 19:33",
            "is_accepted": true,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Awesome, exactly what I'm looking for in that case. And yes, the type is more interesting to me than the variable name IDA gave it.</span>",
                    "time": null
                }
            ]
        }
    ]
}