{
    "title": "Running a patched binary within IDA Free",
    "link": "https://reverseengineering.stackexchange.com/questions/17159/running-a-patched-binary-within-ida-free",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am using IDA Free for malware analysis and I wanted to patch a binary I am looking at. I applied the patch by using the patch menu, which modifies the DATABASE representation of the executable. </p>\n<p>When I go to run the executable via <em>Debugger -&gt; Run</em>, it warns me that the database has been patched and there may be inconsistencies. However, when it finally runs it runs the original executable without patched code!</p>\n<p>Is there a way to tell IDA to run the patched code? Or, since it's only patched in the database, my only choice is to export a <em>DIF</em> file and patch it manually to confirm it works?</p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "7k",
    "tags": [
        "ida"
    ],
    "user": null,
    "time": "Jan 9, 2018 at 7:21",
    "comments": [
        {
            "user": "sudhackar",
            "text": "<span class=\"comment-copy\">Did you \"Apply patches to input file\"?</span>",
            "time": null
        },
        {
            "user": "user22856",
            "text": "<span class=\"comment-copy\">@sudhackar IDA Free is only IDA 5.0, I dont have that option.</span>",
            "time": null
        },
        {
            "user": "sudhackar",
            "text": "<span class=\"comment-copy\">Then you can manually patch the file using a hex editor. I don't know of other options in IDA free.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>IDA Free doesn't support the <em>\"Apply patches to input file...\"</em> feature. Hence, you'll have to do this the old way. I'll expand my answer and will go over things you already know so others (e.g coming from search engines) can benefit from a whole complete answer.</p>\n<h2>Edit the configuration file</h2>\n<p>The first thing you have to do is to modify an IDA GUI configuration file named <em>idagui.cfg</em>. You should be able to find the file at <em>\"IDA Free\\cfg\\idagui.cfg\"</em>. Locate the file and change <em>\"DISPLAY_PATCH_SUBMENU\"</em> form <em>\"NO\"</em> to <em>\"YES\"</em>.</p>\n<p>After that, start IDA Free and you'll see a fresh new sub-menu called <em>\"Patch program\"</em>. </p>\n<h2>Patching</h2>\n<p>You should be able to use this sub-menu to edit the program. It's pretty intuitive, just put your cursor wherever you want to make a change, and choose the appropriate option from the sub-menu.</p>\n<p><strong><em>Notice</em></strong> that every patch you do is only affected on the IDB, the IDA Database. Thus, the binary on disk won't be affected and when you'll try to debug/execute it you will not see your patches.</p>\n<h2>Exporting a .DIF file</h2>\n<p>When you finish with all your patches, it's time to apply them to the binary on disk. To do this, you'll first have to produce a <em>.DIF</em> file that will contain a list of the changes you've made.</p>\n<p>To produce this file go to <em>File -&gt; Produce File -&gt; Create DIF file...\"</em>.</p>\n<h2>Applying the changes to the binary</h2>\n<p>You can use <a href=\"https://stalkr.net/files/ida/idadif.py\" rel=\"nofollow noreferrer\">this</a> <em>Python</em> script by <em>stalker</em> to apply the changes. Use it like this:</p>\n<pre><code>$ idadif.py &lt;original_binary&gt; &lt;IDA_DIF_file.dif&gt; [revert]\n</code></pre>\n<p><strong>Alternatives:</strong><br/>\n<em>Note that I didn't test these alternatives and I'm pretty sure that some of them will not work with IDA Free</em></p>\n<ul>\n<li><a href=\"http://www.idabook.com/chapter14/ida_patcher.c\" rel=\"nofollow noreferrer\">ida_patcher.c</a></li>\n<li><a href=\"https://github.com/nihilus/IDA-IDC-Scripts/blob/master/PE-scripts/pe_write.idc\" rel=\"nofollow noreferrer\">pe_write.idc</a></li>\n<li><a href=\"https://github.com/iphelix/ida-patcher\" rel=\"nofollow noreferrer\">IDA Patcher plugin</a></li>\n<li><a href=\"https://github.com/grepwood/ida-dif-patch\" rel=\"nofollow noreferrer\">IDA DIF Patch</a></li>\n</ul>\n</div>",
            "votes": "3",
            "user": "Megabeets",
            "time": "Jan 9, 2018 at 7:55",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user22856",
                    "text": "<span class=\"comment-copy\">Yes I am well aware of this. Maybe I wasn't clear in my question. I want to run the patched binary to test it. Does IDA not run from the database? I don't want to export a dif without knowing it works.</span>",
                    "time": null
                },
                {
                    "user": "Megabeets",
                    "text": "<span class=\"comment-copy\">No it can't. Just backup the original file and then apply the patches to either of them using one of the methods above.</span>",
                    "time": null
                }
            ]
        }
    ]
}