{
    "title": "Running script on the command line with IDA Pro 7.0",
    "link": "https://reverseengineering.stackexchange.com/questions/17174/running-script-on-the-command-line-with-ida-pro-7-0",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to run a script with IDAPython on Windows:</p>\n<pre><code>PS: C:\\Users\\user\\Downloads&gt; ida.exe -S\"tmp.py\" -t\n&gt;&gt;\nPS: C:\\Users\\user\\Downloads&gt;\n</code></pre>\n<p>and I had to press Ctrl+C to get out of the <code>&gt;&gt;</code> prompt.</p>\n<p>Why is that?</p>\n<p>How should I run the script?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "4k",
    "tags": [
        "windows",
        "idapython",
        "command-line",
        "script"
    ],
    "user": "anonymous",
    "time": "Jan 11, 2018 at 10:09",
    "comments": [
        {
            "user": "Megabeets",
            "text": "<span class=\"comment-copy\">Seems to me like a powershell thing and not IDA. Try executing <code>.\\ida.exe</code> , or use the full path and an ampersand sign:  <code>&amp; \"C:\\Program Files\\IDA 7.0\\ida.exe\"</code></span>",
            "time": null
        },
        {
            "user": "Peter Teoh",
            "text": "<span class=\"comment-copy\">For more information on the \"-S, -A, and -B, and -c\" options in command line, get the answer from the creator of IDA himself: <a href=\"https://reverseengineering.stackexchange.com/questions/18441/ida-pro-is-there-a-command-line-way-to-generate-idb-files-without-generating-as\" title=\"ida pro is there a command line way to generate idb files without generating as\">reverseengineering.stackexchange.com/questions/18441/…</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is most likely caused by at least one of three issues:</p>\n<ol>\n<li><p>The first time IDA starts up on a machine, it'll prompt you for a license and you'll have to accept it. If the first time you run IDA is with the <code>-S</code> flag, IDA will hang on that screen and you'll need to manually accept it (either in that execution or a previous one). You could also work around it by manually creating the marker IDA uses, but i'll let you figure that out yourself.</p></li>\n<li><p>While running, IDA pops up multiple other dialogs you'll need to accept, answer and approve (the disassemble a new file, one loading symbols, etc...) those may be automatically dismissed by providing the <code>-A</code> flag (A stands for autonomous). This won't avoid the license agreement mentioned in the previous paragraph, and will even make it hidden and harder to accept.</p></li>\n<li><p>Your script may no be behaving with IDA. This basically means that IDA is designed as an interactive tool and not a command line tool, and one side-effect of that is that it will not automatically perform a peaceful exit once the executed script is done. You'll have to call <code>idc.Exit(exitcode)</code> when your script finished, or otherwise it'll just hang in there forever. You may also want to consider calling AutoWait()` at the beginning of your script.</p></li>\n</ol>\n<p>P.S.</p>\n<p>You may want to consider the <code>-A</code> and/or <code>-c</code> (and there's a small chance you'll want to look at <code>-a</code> as well) flags instead of the <code>-t</code> one (which I don't think will do what you desire).</p>\n</div>",
            "votes": "2",
            "user": "NirIzr",
            "time": "Jan 16, 2018 at 22:22",
            "is_accepted": false,
            "comments": []
        }
    ]
}