{
    "title": "Whether samples downloaded from virus share can execute automatically in my computer",
    "link": "https://reverseengineering.stackexchange.com/questions/17426/whether-samples-downloaded-from-virus-share-can-execute-automatically-in-my-comp",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am doing some android malware analysis work and downloaded many android samples in virus share, but I found some of them are windows malware e.g. labeled 'win32' or something.</p>\n<p><strong>Are these windows malware samples able to execute automatically in my computer even if I didn't add a proper extension name for them e.g '.exe'?</strong></p>\n<p>I am afraid it may damage my computer or leak some private data...</p>\n<p>The samples that I downloaded is from this zip file.\n<a href=\"https://i.sstatic.net/6lakI.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/6lakI.png\"/></a></p>\n<p><strong>To simplify the question that I want to ask is:\nWhether a sample that has no extension name can excute automatically？</strong></p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "707",
    "tags": [
        "malware",
        "android"
    ],
    "user": "Sayuki",
    "time": "Feb 11, 2018 at 8:13",
    "comments": [
        {
            "user": "julian",
            "text": "<span class=\"comment-copy\">Possible duplicate of <a href=\"https://reverseengineering.stackexchange.com/questions/23/how-can-i-analyze-a-potentially-harmful-binary-safely\">How can I analyze a potentially harmful binary safely?</a></span>",
            "time": null
        },
        {
            "user": "Vitaly Osipov",
            "text": "<span class=\"comment-copy\">In the past this was impossible, but then Windows, among other OSes, might hide the extension, so you think it's not there while it is :) So if you're sure the extension is not hidden then nope. Then again, I haven't touched Windows for years, this guy says the opposite <a href=\"https://superuser.com/a/690608\">superuser.com/a/690608</a></span>",
            "time": null
        },
        {
            "user": "Sayuki",
            "text": "<span class=\"comment-copy\">Thx, Vitaly. The samples need to add the extension name and I didn't run the cmd script. xD @VitalyOsipov</span>",
            "time": null
        },
        {
            "user": "S Nikale",
            "text": "<span class=\"comment-copy\">To be on safer side, download them in an sandbox environment (VM)</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The simplest and most common type of malware depends on you executing it, but malware can target vulnerabilities in any program that processes the data.<br/>\nThere are a few cases where simply downloading a file without opening it could lead to execution of attacker controlled code from within the file. It usually involves exploiting a known vulnerability within a program which will handle the file in some way. Here are some examples:  </p>\n<ul>\n<li><p>Windows will try to extract information from the file to display the icon and preview when looking at the folder inside explorer (such as PDF or image thumbnail). One example was the <a href=\"https://en.wikipedia.org/wiki/Windows_Metafile_vulnerability\" rel=\"nofollow noreferrer\">Windows Metafile Vulnerability</a> which could be exploited only by previewing the file in explorer.</p></li>\n<li><p>Another attack vectors is the builtin Windows Search. To extract the information necessary for a full text search Windows will scan the files in the background and use the file parser to extract the content. A bug in the file parser can thus lead to code execution.  </p></li>\n<li>The file targets a vulnerability in your antivirus which triggers when the file is scanned  </li>\n<li>The file targets a vulnerability in your file system such as NTFS where the filename or another property could trigger the bug  </li>\n<li>A library file (ex. dll) could get executed when saved to the same directory where an application vulnerable to <a href=\"https://www.owasp.org/index.php/Binary_planting\" rel=\"nofollow noreferrer\">binary planting</a> is executed from</li>\n</ul>\n</div>",
            "votes": "1",
            "user": "user22363",
            "time": "Feb 11, 2018 at 5:02",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Sayuki",
                    "text": "<span class=\"comment-copy\">Thanks, maybe it's better to buy a new hard driver.. but the samples have been deleted the extension name, so I am wondering if they can still excute..</span>",
                    "time": null
                }
            ]
        }
    ]
}