{
    "title": "JTAG protection bypass",
    "link": "https://reverseengineering.stackexchange.com/questions/17753/jtag-protection-bypass",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>When protecting a device from being accessed via JTAG there are a number of ways to do it. </p>\n<p>The two that come immediately to mind are:</p>\n<ol>\n<li>a '<em>fuse</em>' that is blown; </li>\n<li>a JTAG '<em>password</em>'.</li>\n</ol>\n<p>What are some methods or equipment that are used to bypass these protections?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "hardware",
        "jtag"
    ],
    "user": "pzirkind",
    "time": "Mar 21, 2018 at 14:17",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The question is kinda vague but here's some approaches that might work:</p>\n<ol>\n<li><p>Glitching (e.g. voltage dropping, clock slowdown, too short reset pulse). This could cause either a change in the sensed value of the fuse, or change in the code flow in case the check is implemented in software. For an example of this technique see <em>Breaking Code Read Protection on the NXP LPC-family Microcontrollers</em> by Chris Gerlinsky (recon BRX 2017).</p></li>\n<li><p>Timing/side-channel attacks in case the checks are not specifically hardened against it. A very nice presentation using this technique was shown at Recon BRX 2018(<em>Hacking Toshiba Laptops</em> by Michał Kowalczyk and Serge Bazanski)</p></li>\n<li><p>Hardware attack (decapping the chip and changing the fuse value by direct micoprobing on the chip subtsrate, or just hooking into the core JTAG signals). This is rather complicated and needs a big investment of time and money but some code readout protections have been broken this way.</p></li>\n</ol>\n</div>",
            "votes": "5",
            "user": "Igor Skochinsky",
            "time": "Mar 21, 2018 at 13:30",
            "is_accepted": true,
            "comments": []
        }
    ]
}