{
    "title": "How would I begin REing this proprietary model format?",
    "link": "https://reverseengineering.stackexchange.com/questions/17918/how-would-i-begin-reing-this-proprietary-model-format",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Disclaimer: This is both my first post, and my first time approaching reverse engineering.</p>\n<p>Overview: Need for Speed 5 is a classic (1990 era) racing game that was extremely unique in that it featured only Porsche, and the developers even worked with Porsch AG to make it as simulated as possible for the time period.\nHere we are 18 years later, and the track format has not been completely REd.\nI have taken the time to dig over the past 3 years to no avail. I can't find info on the car model format, which might lend a hand in reverse engineering the track model format.</p>\n<p>What I HAVE managed to do was get the track models \"decompressed\", which yields some clear details, but beyond this I wouldn't have any clue how to proceed. The reason I have quotes is that being the format was never fully figured out, it very well could be useless in this manor.</p>\n<p>I am hoping someone who has the skill and knowledge would be willing to aid me in getting this format figured out, so at minimal the models could be extracted, and ideally editable. The minimal goal is due to the fact I make video games, so it would be easier for me to make a modernized application sporting these resources, rather than a simple track editor, though there is a community that still plays this game and would be extremely excited if the format was figured out to where we could import other tracks into the game for a fresh take.</p>\n<p>For now, I will share 7 files to serve as examples.\nIn the track folder:\nthe .crp files are the native tracks in their original form.\nthe .drp are the supposedly decompressed versions, and clearly have noteworthy information, such as UV, and texture references.\nI have also included a car model that has both the crp and drp versions as a possible guide, as that format has long been figured out, but lost to time.\nI can easily extract textures from the game, and teach track has additional data that I can provide upon request.\nThe last file is the de/compression tool.</p>\n<p>This game is now considered Abandonware, and can easily be obtained for those curious. Unfortunately with each windows update, it gets harder and harder to run this game, the graphics are extremely dated, ripping tools like ninjaripper cannot rip anything other than 2D planes, so that route isn't possible, and I neither have a free camera mode for top down pics to serve as a template for modeling, nor experience to model it freehand (better yet, at all).</p>\n<p>ANY help would be appreciated, as there are people in the community who can code the necessary tools to manipulate it once it is figured out. Having this knowledge might even arm me to make an exporter for the older Need for Speed 4 track files, which would be the main game we would want to import tracks from.</p>\n<p>Files: <a href=\"https://www.dropbox.com/s/x46qm58do6phdda/nfs5.zip?dl=0\" rel=\"nofollow noreferrer\">https://www.dropbox.com/s/x46qm58do6phdda/nfs5.zip?dl=0</a></p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "156",
    "tags": [
        "disassembly"
    ],
    "user": "Fallenleader",
    "time": "Jan 27, 2019 at 11:31",
    "comments": [
        {
            "user": "Edward",
            "text": "<span class=\"comment-copy\">I loved that game (still have it here somewhere)!  You might start with this: <a href=\"http://1amstudios.com/projects/opennfs1/\" rel=\"nofollow noreferrer\">1amstudios.com/projects/opennfs1</a></span>",
            "time": null
        }
    ],
    "answers_data": []
}