{
    "title": "Dynamic Analysis on ELF using IDA",
    "link": "https://reverseengineering.stackexchange.com/questions/17942/dynamic-analysis-on-elf-using-ida",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>On Linux, while generally reversing ELF files and dynamic analyzing (like step into, step over, break-point, inspecting registers value, memory etc) I use <code>gdb</code> or <code>radare2</code> which provides dynamic analysis facility. </p>\n<p>I want to know that does IDA Pro also support Dynamic Analysis on Linux Platform (the same way gdb / r2 does) ? I have tried Dynamic Analysis on exe files using IDA. But I never got to know how could I use dynamic analysis on Linux using IDA where I could play with ELF on the fly.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "debugging",
        "linux",
        "dynamic-analysis",
        "vulnerability-analysis"
    ],
    "user": "user8877134",
    "time": "Apr 10, 2018 at 8:25",
    "comments": [
        {
            "user": "Megabeets",
            "text": "<span class=\"comment-copy\">Possible duplicate of <a href=\"https://reverseengineering.stackexchange.com/questions/11516/how-to-setup-ida-pro-linux-server\">how to setup IDA pro linux server</a></span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">are you having problems using IDA's debugger? Please specify the exact issue you're having or what specific feature you're missing.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I don't know what you mean by Dynamic Analysis. For example there's Lighthouse plugin for IDA which is crossplatform, and allows you to load code coverage data into IDA to see which paths of code were actually executed.\nAlso there's Ponce plugin, which works for windows, linux and mac, and allows to trace data flow in runtime. I.e. it will mark all the instructions and functions which are accessing some buffer.</p>\n<p>If you just want to debug Linux binary in IDA, there's \\IDA70\\dbgsrv\\linux_server executable, which you can run to debug of you ELF file remotely.</p>\n</div>",
            "votes": "1",
            "user": "Anton Kukoba",
            "time": "Aug 9, 2018 at 11:48",
            "is_accepted": false,
            "comments": []
        }
    ]
}