{
    "title": "Changing parameters in an OS X executable",
    "link": "https://reverseengineering.stackexchange.com/questions/17994/changing-parameters-in-an-os-x-executable",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>very new here so please bear with me. I'm an artist trying to realise an idea for a camera that takes photos every X interval during a month. Everything works, except that the app with which I transfer the photos to a MacBook seems quite unstable after a day or so flooding the Console with <code>RemoteCameraControl[94450] &lt;Warning&gt;: ========== resetTimeoutTimer ==========&lt;</code> and often randomly disconnecting with </p>\n<pre><code>2018/4/6 00:02:15 PTP_FALSE -&gt; pollingThread[464]: Failed to get all device PropValue!!!\n2018/4/6 00:02:20 PTP_FALSE -&gt; timeoutThread[713]: Time Out!!\n</code></pre>\n<p>(from a log created by the program)</p>\n<p>I've not been able to solve this using a combination of Python &amp; LaunchAgents or even resorting to AppleScript, so now I was hoping to have a crack at changing the program itself. The program in question is Sony's freely available RemoteCameraControl (<a href=\"http://support.d-imaging.sony.co.jp/imsoft/Mac/rcc/us.html\" rel=\"nofollow noreferrer\">http://support.d-imaging.sony.co.jp/imsoft/Mac/rcc/us.html</a>):</p>\n<pre><code>Mach header\n      magic cputype cpusubtype  caps    filetype ncmds sizeofcmds      flags\n   MH_MAGIC    I386        ALL  0x00     EXECUTE    26       3740   NOUNDEFS DYLDLINK TWOLEVEL WEAK_DEFINES BINDS_TO_WEAK PIE\n</code></pre>\n<p>I've opened it using MachOView and see it's an x86. Now I've been trying to understand the contents, but with my background in coding (Python, R, JS, PHP etc) I was confused by the lack of a linear logic: I understand there are lots of (symbolic) links being specified, either to external or internal components/programs, but nowhere can I seem to find something along the lines of \"If no activity for X minutes then shut down the program\" or find the parameter that dictates the <code>PTP_FALSE -&gt; timeoutThread[713]: Time Out!!</code> errors.</p>\n<p>I know this is hardly a specific question, but I was wondering whether anyone could point me into the right direction: are some of the contents not shown by MachOView? Do I need another app to see the linear logic of the app? Is there any good documentation on beginner's steps of how to understand an executable of this sort? I've found this website <a href=\"http://thestarman.pcministry.com/asm/index.html\" rel=\"nofollow noreferrer\">http://thestarman.pcministry.com/asm/index.html</a> but am not sure where really to start either...</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "263",
    "tags": [
        "x86",
        "osx"
    ],
    "user": "user1092247",
    "time": "Dec 17, 2019 at 23:07",
    "comments": [
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">You opened the executable and so you are seeing the executable code contents. It sounds like you were expecting <i>source code</i> there. Are you aware of the difference? (A \"no\" answer would indicate you'd need far more information than can be provided in an answer – it's practically an IT course on its own.)</span>",
            "time": null
        },
        {
            "user": "user22967",
            "text": "<span class=\"comment-copy\">Have you tried to simply kill and restart the RemoteCameraControl process automatically, e.g. once per day? This should be possible using AppleScript, see <a href=\"http://macstuff.beachdogs.org/blog/?p=31\" rel=\"nofollow noreferrer\">macstuff.beachdogs.org/blog/?p=31</a></span>",
            "time": null
        },
        {
            "user": "user1092247",
            "text": "<span class=\"comment-copy\">@usr2564301: Yes I'm aware of the difference, and the fact that the source code is inherently lost during compilation into the executable file. But I did think I would be able to find (and change) the specified parameter for such variables as \"Timeout\" and \"resetTimeoutTimer\" in the executable?</span>",
            "time": null
        },
        {
            "user": "user1092247",
            "text": "<span class=\"comment-copy\">@MichaelEngel: Good idea. I did already create a .plist with <code>KeepAlive</code> and added it to LaunchAgents, but the program does a lot of back talk when it crashes and restart, prompting dialogs both on quit and start (already set <code>defaults write com.apple.CrashReporter DialogType none</code> but it happily adds dialogs of its own about folder location to save files, etc.). The tricky thing with your solution is that I need to be sure it isn't in the middle of taking photographs (and the trigger for the photograph is something completely outside of the program)...</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Sony has published <a href=\"https://developer.sony.com/develop/cameras/\" rel=\"nofollow noreferrer\">a remote camera API</a> that seems to to support image capture etc. Unfortunately, this seems to be available for Android and iOS only.</p>\n<p>However, there's a number of projects on github (<a href=\"https://github.com/Bloodevil/sony_camera_api\" rel=\"nofollow noreferrer\">pysony</a>,<a href=\"https://github.com/storborg/sonypy\" rel=\"nofollow noreferrer\">sonypy</a>) as well as quite a number of Sony remote tools for other languages (simply search \"sony remote\" on github) that implement a Python API that should work on OS X. There is a <a href=\"https://developer.sony.com/develop/cameras/api-information/supported-devices\" rel=\"nofollow noreferrer\">list of supported cameras on the Sony developer web site</a>. My old NEX-3 is not supported (probably due to the lack of Wifi, I assume remote control does not work over a USB connection), so I couldn't test the Python code.</p>\n</div>",
            "votes": "1",
            "user": null,
            "time": "Apr 20, 2018 at 20:52",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user1092247",
                    "text": "<span class=\"comment-copy\">I'm afraid I'm using an older DSLR model, also unsupported...</span>",
                    "time": null
                }
            ]
        }
    ]
}