{
    "title": "IDA Pro's Debugger option disssapears",
    "link": "https://reverseengineering.stackexchange.com/questions/18079/ida-pros-debugger-option-disssapears",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So, I have this problem: I'm trying to do a homework which, at one point, asks us to use IDA to debug a simple program step by step. The deal is, when I load the executable in IDA, the Debugger option in the menu suddenly dissapears.</p>\n<p>What exactly is happening, or what am I doing wrong?</p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ida"
    ],
    "user": "The Ferydra",
    "time": "Apr 24, 2018 at 14:17",
    "comments": [
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">Please tell a bit more about your executable and environment. OS ? Processor ? In which OS are you running IDA ?</span>",
            "time": null
        },
        {
            "user": "The Ferydra",
            "text": "<span class=\"comment-copy\">WIndows XP in a Virtual Machine. Processor, AMD Phenom II X6 1055T I think...</span>",
            "time": null
        },
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">And what about executable you’re trying to debug ?</span>",
            "time": null
        },
        {
            "user": "The Ferydra",
            "text": "<span class=\"comment-copy\">An .exe with simple code:  #include &lt;stdio.h&gt; int main() { //Este programa realiza la suma simple de dos números enteros printf(\"Sumando dos enteros\\n\"); int suma = 2 + 3; printf(\"%i\",suma); return 0; }</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You are not specifying what IDA version you are using and if at all you are trying to run the code that could be debugged by IDA on the machine that you are running it, but there might be another case.</p>\n<p>Chris Eagle in this The IDA Pro Book writes...</p>\n<blockquote>\n<p>IDA attempts to warn you of this possibility anytime you select Debugger → Start Process (or Debugger →\n  Attach to process with an open database) by displaying a debugger warning\n  message stating the following:<br/><br/>\n  You are going to launch the debugger. Debugging a program\n  means that its code will be executed on your system.\n  Be careful with malicious programs, viruses and trojans!<br/><br/>\n  REMARK: if you select ‘No’, the debugger will be automatically\n  disabled.\n  Are you sure you want to continue?<br/><br/>\n<strong>Selecting No in response to this warning causes the Debugger menu\n  to be removed from the IDA menu bar. The Debugger menu will not be\n  restored until you close the active database.</strong></p>\n</blockquote>\n<p>So maybe at one point you've answered <code>no</code> and IDA remembers this in the database? Try new analysis from scratch to see if the menu gets restored.</p>\n</div>",
            "votes": "2",
            "user": "Paweł Łukasik",
            "time": "Apr 24, 2018 at 16:40",
            "is_accepted": false,
            "comments": [
                {
                    "user": "The Ferydra",
                    "text": "<span class=\"comment-copy\">Is the 4.9 version. And I don't open the project doing neither of those options (Doesn't even shows the Star Process one). The project doesn't want to open win the VM, it says that there is an instruction that isn't allowed. I made the executable in Lubuntu, where it worked fine.</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">you made it in lububtu with gcc so it is elf ? and you are trying to debug it in windows ??  which is PE  no that wont work</span>",
                    "time": null
                },
                {
                    "user": "The Ferydra",
                    "text": "<span class=\"comment-copy\">Then how I am suposed to do it? Because in theory, gcc was supossed to work (As it is what the project said)</span>",
                    "time": null
                },
                {
                    "user": "Paweł Łukasik",
                    "text": "<span class=\"comment-copy\">@TheFerydra compile under windows, to create PE, or, I think, use remote debugging that IDA should support (but not sure if 4.9 does that)</span>",
                    "time": null
                }
            ]
        }
    ]
}