{
    "title": "OSX User level application Preferences (plist) are not loaded after binary modification",
    "link": "https://reverseengineering.stackexchange.com/questions/18124/osx-user-level-application-preferences-plist-are-not-loaded-after-binary-modif",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am working on a project that requires to modify an existing OSX application's <code>dylib</code> binary (few bytes to correct an obsolete URL). I do not have access to the application source code nor the code signing certificates. After patching the application everything works perfectly except it does not load its application <code>plist</code> file from <code>~/Library/Preferences</code>. </p>\n<p>Even without patching/modifying the application if I do:</p>\n<pre><code>codesign -s \"Local Codesign\" -f ./lib&lt;name&gt;.dylib\n</code></pre>\n<p>and execute the application it does not read its properties from</p>\n<pre><code>~/Library/Preferences/&lt;application id&gt;.plist\n</code></pre>\n<p>including previously opened files or connected servers. If I copy back the original (developer signed) <code>dylib</code> then everything works fine: properties are read back again.</p>\n<p>One strange thing: even with my local signed binary which is unable to read the <code>plist</code> file if I change something the changes are written back. So if this is an OSX security related stuff seems it's only affects reads.</p>\n<p>Now my questions and assumptions:</p>\n<ul>\n<li>Am I right when I am assuming that this is some kind of OSX security mechanism that ensures application <code>plist</code> data cannot be accessed from a non-same-developer signed binary? If yes, why can it write and protects reads only?</li>\n<li>Does any of you find similar issue when modified an OSX binary?</li>\n<li>How can I debug this behaviour?  </li>\n<li>And yes: any solutions?</li>\n</ul>\n<p>Any comments and feedbacks are welcome.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "125",
    "tags": [
        "osx",
        "patching",
        "binary-editing",
        "macos"
    ],
    "user": "Tamas Foldi",
    "time": "Apr 29, 2018 at 9:53",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">how did you determine that the application does not load the plist from that location and that it did before?</span>",
            "time": null
        },
        {
            "user": "Tamas Foldi",
            "text": "<span class=\"comment-copy\">If I change the signature of any of the libraries then the UI does not show \"Recent files\" and \"Recent connections\". If I change back the libraries to the original signed ones everything works well. Also, in case I change the libraries I see security exceptions in OSX Console: <code>code requirement check failed (-67063), client is not Apple-signed</code>.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I could find some hints by googling the error message, e.g.:</p>\n<p><a href=\"https://stackoverflow.com/a/40705362/422797\">https://stackoverflow.com/a/40705362/422797</a></p>\n<p>Looks like it's not related to the plist but possibly to some security APIs (e.g. keychain access or <code>SecCodeCheckValidity</code>) used by the program.\nApparently the OS caches signing info based on the file's vnode, and if you replace it in-place that invalidates the signature. The linked answer suggests some workarounds.</p>\n</div>",
            "votes": "0",
            "user": "Igor Skochinsky",
            "time": "May 2, 2018 at 8:40",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Tamas Foldi",
                    "text": "<span class=\"comment-copy\">This was one of the issue. After I changed the process flow to 1) move the file 2) sign it in /Application folder with a proper apple signed signature it was able to read the plist. Thanks!</span>",
                    "time": null
                }
            ]
        }
    ]
}