{
    "title": "bypassing anti-VM inside protected samples",
    "link": "https://reverseengineering.stackexchange.com/questions/18195/bypassing-anti-vm-inside-protected-samples",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"https://reverseengineering.stackexchange.com/questions/1686/how-to-detect-a-virtualized-environment\">This</a>  is a good starting point.</p>\n<p>As you know:\nSandboxes and virtual environments (hypervisors) are full of artifacts that betray their analysis environment. Malware can protect itself against these by running some checks to detect such environments before performing any malicious actions.</p>\n<p>I'm looking for ways for a malware analyst to bypass these protections to overcome this anti-VM (anti-hypervisor) stuff?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "906",
    "tags": [
        "binary-analysis",
        "malware",
        "pe",
        "unpacking",
        "dynamic-analysis"
    ],
    "user": "zerocool",
    "time": "Jul 12, 2018 at 7:45",
    "comments": [
        {
            "user": "Anton Kukoba",
            "text": "<span class=\"comment-copy\">there's no generic bypass solution AFAIK, so you'll have to learn how this exact malware detects the VM, and implement your own bypass.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">This is a bit of a broad question, but it may attract some high quality answers nevertheless. There are a myriad of anti-hypervisor and anti-anti-hypervisor techniques. Example: a search for <code>CXPInspector</code> will give you a number of papers (from 5 years ago) that were made into a commercial product. The idea there was to provide introspection into hypervisor guests using shadow page tables (CPU feature!) and knowledge about the system running as guest. No artifacts need to be <i>inside</i> a sandbox created this way. The papers provide a good starting point for own projects.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There is no exact way to bypass them but when I have to deal with them, I first try to figure out all those places where anti techniques have been present in assembly code by generally looking at imports and api calls. Then the best way to bypass them is to patch them with some other instructions, so when you run the program there code doesn't get executed. </p>\n</div>",
            "votes": "2",
            "user": "shubham0d",
            "time": "May 12, 2018 at 7:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}