{
    "title": "Why do many imported functions jump to addresses that do not contain instructions?",
    "link": "https://reverseengineering.stackexchange.com/questions/18207/why-do-many-imported-functions-jump-to-addresses-that-do-not-contain-instruction",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am learning to analyze binaries using radare2 and have been confused about what occurs within imported functions. In the binary below, titled Lab2B, I statically disassembled the binary and then disassembled one of the imported library functions, sym.imp.printf. As you can see below it merely lists one instruction: <code>jmp dword [reloc.printf]</code>. When I seek to the location <code>[reloc.printf]</code> and I print the disassembled functions contained at it, the command line prints \"Cannot find function at 0x0804a00c\". I have noticed the same behavior with all of the other imported functions. They often have a single instruction that points to an address that doesn't contain any instructions. </p>\n<p>Why are there no instructions contained at the address that the instruction tells the compiler to jump to?</p>\n<p><a href=\"https://i.sstatic.net/LDuoZ.png\" rel=\"noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/LDuoZ.png\"/></a></p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "792",
    "tags": [
        "assembly",
        "x86",
        "radare2",
        "functions"
    ],
    "user": "Darien Springer",
    "time": "May 8, 2018 at 6:46",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I assume you are statically inspecting the program, hence, the addresses of the imported symbols wasn't calculated yet by the linker. To understand that better you need to get familiar with two terms, PLT and GOT. Anyway, even if you are debugging the file, these are not functiona but a table with pointers. So <code>pdf</code> isn't what you should try. Give a shot to <code>pd</code>.</p>\n<h2>Dynamic Linking</h2>\n<p>The Procedure Linkage Table is a memory structure that contains a code stub for external functions that their addresses are unknown at the time of linking.  </p>\n<p>Whenever we see a <code>CALL</code> instruction to a function in the <code>.text</code> segment it doesn’t call the function directly. Instead, it calls the stub code at the <code>PLT</code>, say <code>func_name@plt</code>. The stub then jumps to the address listed for this function in the Global Offset Table (<code>GOT</code>). If it is the first <code>CALL</code> to this function, the <code>GOT</code> entry will point back to the <code>PLT</code> which in turn would call a dynamic linker that will resolve the real address of the desired function. The next time that <code>func_name@plt</code> is called, the stub directly obtains the function address from the <code>GOT</code>. </p>\n<p>To read more about the linking process, I highly recommend <a href=\"https://www.airs.com/blog/archives/38\" rel=\"nofollow noreferrer\">this series of articles</a> about linkers by <em>Ian Lance Taylor</em>.</p>\n<hr/>\n<p>Radare2 is detecting the addresses of the PLT and GOT. Where you see <code>sym.imp.printf</code> it is actually the reserved address for <code>printf()</code> int the PLT. When you see <code>reloc.printf</code> is the address reserved for it in the GOT.</p>\n<p>By using <code>iS</code> you can list the sections of <code>PLT</code> and <code>GOT</code>.</p>\n</div>",
            "votes": "5",
            "user": "Megabeets",
            "time": "May 10, 2018 at 3:23",
            "is_accepted": true,
            "comments": []
        }
    ]
}