{
    "title": "ntoskrnl checksum mismatch",
    "link": "https://reverseengineering.stackexchange.com/questions/18384/ntoskrnl-checksum-mismatch",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><strong>I had hex-edited windows kernel</strong> file <code>c:\\windows\\system32\\ntoskrnl.exe</code> to fix some assembly bytes in the way i need it.</p>\n<p><strong>System wont boot</strong> because of <strong><code>STATUS_IMAGE_CHECKSUM_MISMATCH</code></strong> error (0xC0000221; restore screen on boot)</p>\n<p>But i need to boot edited version anyway. <strong>How to disable</strong> that kind of <strong>integrity check?</strong></p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "612",
    "tags": [
        "windows",
        "kernel",
        "windows-10"
    ],
    "user": "xakepp35",
    "time": "May 28, 2018 at 2:26",
    "comments": [
        {
            "user": "Reaxt",
            "text": "<span class=\"comment-copy\">I have been trying to do a similar thing, did you ever get it working? (Im aware that this is not technically a question, but it's the only thing i could find anywhere on the internet about this topic, and I can't comment without a certain amount of reputation)@xakeapp35</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@Reaxt hi and welcome to RE.SE! Maybe you should ask your own question?! I for one have indeed gotten this to work with a legacy BIOS and merely setting the PE checksum. However, that said, things will be different with Secure Boot (UEFI) and potentially with ELAM (which I mentioned in my answer).</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You don't disable that kind of integrity check, you simply <strong>set the checksum</strong>. The one that's relevant in this particular case is the respective field in the <code>IMAGE_OPTIONAL_HEADER</code>, that is <code>IMAGE_OPTIONAL_HEADER::CheckSum</code>.</p>\n<p>That said, you will likely run into additional issues once you resolved this one. I am not sure if the kernel itself is subject to <a href=\"https://github.com/Microsoft/Windows-driver-samples/tree/master/security/elam\" rel=\"nofollow noreferrer\">Early Launch scans</a>, but I reckon there's a reason why these binaries are also code-signed. So at the very least you may want to disable the integrity checks altogether from an elevated prompt: <code>bcdedit.exe /set nointegritychecks on</code> (make sure to reboot afterwards). Another point to consider is UEFI with enabled Secure Boot. In this case the Windows boot manager will somehow check the images it's asked to load. But since details are missing, it's not clear if this might be the cause of the issue.</p>\n<p>Various functions can be used to compute a checksum for a PE file. The probably easiest method is using the Image Help Library function <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms680355.aspx\" rel=\"nofollow noreferrer\"><code>MapFileAndCheckSum()</code></a> or alternatively (<a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms679281.aspx\" rel=\"nofollow noreferrer\"><code>CheckSumMappedFile()</code></a>). If I remember correctly there are a few more, including one <code>Ldr*</code> function from <code>ntdll.dll</code> which can be used to that end.</p>\n</div>",
            "votes": "4",
            "user": "0xC0000022L",
            "time": "May 20, 2020 at 7:07",
            "is_accepted": true,
            "comments": [
                {
                    "user": "xakepp35",
                    "text": "<span class=\"comment-copy\">Thanks for your reply, seems this is exactly what i was searching for! My question was incorrect, in some way, it was really not the good way to go. There is only one thing left uncovered here - if you afford - please add few words on simple, easy-to-use Checksum calculation method, that you would recommend to use in such situation.</span>",
                    "time": null
                },
                {
                    "user": "xakepp35",
                    "text": "<span class=\"comment-copy\">Thank you very much, that worked. I used <a href=\"http://www.coderforlife.com/projects/utilities/#PEChecksum\" rel=\"nofollow noreferrer\">PEChecksum</a> very simple tool. It just scans and updates, if nesesary. Now i am stuck at 0xc0000428 (seems digital signature check related) and pressing F8-7(disable drivers signature checking) and F8-8(disable antimalware) not worked</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@xakepp35: did you use <code>bcdedit</code> the way I described? What exact build of Windows 10 is this? 32-bit or 64-bit?</span>",
                    "time": null
                },
                {
                    "user": "xakepp35",
                    "text": "<span class=\"comment-copy\">win10pro x64. properties tab shows 10.0.14393.0 File version</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@xakepp35 Fascinating. So a different status. Since you already turned it on, did you prepare your system for test signing and test-signed the changed binary after setting the checksum? Also, have you tried instead to strip the signature from the binary and leave it unsigned (but also leave <code>testsigning off</code>)?</span>",
                    "time": null
                }
            ]
        }
    ]
}