{
    "title": "Would it be possible to reverse engineer a game's rom file to get source code?",
    "link": "https://reverseengineering.stackexchange.com/questions/18409/would-it-be-possible-to-reverse-engineer-a-games-rom-file-to-get-source-code",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>More specifically, could you get low level code from a rom, and piece it together and translate it to a higher level language?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "4k",
    "tags": [
        "disassembly",
        "decompilation",
        "rom"
    ],
    "user": "J. Czekaj",
    "time": "Jun 2, 2018 at 9:59",
    "comments": [
        {
            "user": "Rup",
            "text": "<span class=\"comment-copy\">Decompilers exist, yes, for many different CPUs. But they're not perfect, and you'd need to understand how the code interfaces with the platform the ROM is built into if not standard, and chances are it'll take a fair amount of effort and expertise to get you something useable, depending on what level of fidelity you want and what you're trying to do with it.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The <strong>source</strong> code is discarded completely by the compiler/assembler and is not present anywhere in the rom (except by accident).</p>\n<p>However, you <em>can</em> convert the low-level machine code to a high level language. This process is called <em>decompilation</em>, and while it can be tedious and difficult, it is possible to come up with high-level code which has the same functionality as the binary code. Note that this won’t get you <em>source</em> code, merely <em>equivalent code</em>. For example, information like function or variable names is not necessary for the CPU so is discarded completely unless you elect to produce debug information, which rarely happens in released games. </p>\n<p>On difficulties of machine code decompilation, see <a href=\"https://reverseengineering.stackexchange.com/questions/311/why-are-machine-code-decompilers-less-capable-than-for-example-those-for-the-clr\">Why are machine code decompilers less capable than for example those for the CLR and JVM?</a></p>\n</div>",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Jun 2, 2018 at 9:59",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Paweł Łukasik",
                    "text": "<span class=\"comment-copy\">a good example could be a recent Diablo 1 reverse engineering - <a href=\"https://github.com/diasurgical/devilution\" rel=\"nofollow noreferrer\">github.com/diasurgical/devilution</a></span>",
                    "time": null
                },
                {
                    "user": "jmcarter9t",
                    "text": "<span class=\"comment-copy\">Good tool for this type of work: <a href=\"https://ghidra-sre.org/\" rel=\"nofollow noreferrer\">ghidra-sre.org</a></span>",
                    "time": null
                }
            ]
        }
    ]
}