{
    "title": "Counting number of nodes and edges in IDA Pro graph",
    "link": "https://reverseengineering.stackexchange.com/questions/18417/counting-number-of-nodes-and-edges-in-ida-pro-graph",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is it possible to obtain a node and edge count for the IDA Pro graph overview? I'm able to obtain this if I generate a wingraph32 flowchart, but it seems that wingraph32 doesn't work for very large functions. Is there also a way for wingraph32 to support very large graphs?</p>\n<p>Thanks.</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "955",
    "tags": [
        "ida",
        "control-flow-graph"
    ],
    "user": "user1118764",
    "time": "Jun 1, 2018 at 8:21",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you want to get a node and edge count for a function's graph in IDA, you can calculate it with the given IDAPython code:</p>\n<pre><code>func = idaapi.get_func(here())\ng = idaapi.FlowChart(func)\n\nnodes = 0\nedges = 0\nfor x in g:\n  nodes += 1\n  for succ in x.succs():\n    edges += 1\n\n  for pred in x.preds():\n    edges += 1\n\nprint \"Number of nodes\", nodes\nprint \"Number of edges\", edges\n</code></pre>\n<p>As for the wingraph32 tool, I recommend you to use the \"Proximity Viewer\" instead. Just press the key \"-\" when the cursor is inside a function.</p>\n</div>",
            "votes": "4",
            "user": "joxeankoret",
            "time": "Jun 1, 2018 at 11:02",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user1118764",
                    "text": "<span class=\"comment-copy\">Hi, thanks for the code. It produces the correct number of nodes, but the edge count seems to be incorrect when compared to the that produced by wingraph32. Why do you recommend Proximity Viewer though? It doesn't seem to give me the CFG.</span>",
                    "time": null
                },
                {
                    "user": "user1118764",
                    "text": "<span class=\"comment-copy\">I went back to reran your code on smaller graphs so I can actually count the number of segments and compare it to what Flowchart was giving me. It seems your output is correct, while Flowchart is giving me a way higher edge count (even 1 edge is reported as 2 edge). Flowchart does count \"edge segments\" though, is this different from number of edges?</span>",
                    "time": null
                },
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">IIRC, the FlowChart will take into account function chunks. Perhaps @igorsk knows better.</span>",
                    "time": null
                }
            ]
        }
    ]
}