{
    "title": "Windows 10 v.1803 boot failure after trying to install network kernel debugging with WinDbg Preview",
    "link": "https://reverseengineering.stackexchange.com/questions/18499/windows-10-v-1803-boot-failure-after-trying-to-install-network-kernel-debugging",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to set up kernel debugging on a physical hardware/desktop to test the new WinDbg Preview. Here's the steps:</p>\n<ol>\n<li><p>I'm using a desktop with <a href=\"https://ark.intel.com/products/37164/Intel-Desktop-Board-DG41TY\" rel=\"nofollow noreferrer\">Intel DG41TY</a> board.</p></li>\n<li><p>Installed Windows 10 Pro build 1803. (Off USB, created using <a href=\"https://www.microsoft.com/en-us/software-download/windows10\" rel=\"nofollow noreferrer\">media creation tool</a>.)</p></li>\n<li><p>The board has a <a href=\"https://docs.microsoft.com/en-us/windows-hardware/drivers/debugger/supported-ethernet-nics-for-network-kernel-debugging-in-windows-10\" rel=\"nofollow noreferrer\">supported network card</a>:</p>\n<pre><code>PCI\\VEN_10EC&amp;DEV_8168&amp;SUBSYS_D6128086&amp;REV_03\n</code></pre></li>\n<li><p>Prepped up that debuggee for kernel debugging via Ethernet cable by running the following from an elevated <code>cmd</code> (where <code>192.168.1.29</code> is the debugger machine IP address):</p>\n<pre><code>bcdedit /debug on\n\nbcdedit /dbgsettings net hostip:192.168.1.29 port:50000 key:1.2.3.4\n\nbcdedit /set \"{dbgsettings}\" busparams 3.0.0\n</code></pre>\n<p><a href=\"https://i.sstatic.net/xJgjR.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/xJgjR.png\"/></a></p>\n<p>I set it all up to the default boot configuration because that PC was not supposed to have a monitor, mouse or keyboard, so that it could boot up into a debugging mode by default. (For further control I was assuming to remote-desktop into it.)</p></li>\n<li><p>Connected it via an Ethernet cable to my Windows 10 Pro laptop.</p></li>\n<li><p>On the debugger laptop, I was using new, Windows Store version of <a href=\"https://www.microsoft.com/en-us/p/windbg-preview/9pgjgd53tn86\" rel=\"nofollow noreferrer\">WinDbg Preview</a>:</p>\n<pre><code>Debugger client version: 1.0.1805.17002\nDebugger engine version: 10.0.17674.1000\n</code></pre></li>\n<li><p>In WinDbg I set up network kernel debugging as such:</p>\n<p>I'm not sure what that new \"Target\" field meant, I assumed it to be the target machine (or debuggee) so I gave it that desktop's IP address:</p>\n<p><a href=\"https://i.sstatic.net/A4ZSs.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/A4ZSs.png\"/></a></p></li>\n<li><p>Then rebooted the debuggee desktop ... and nothing happened. Windows 10 hung up during the boot process. I assumed that I didn't set something right on the debuggee side, closed WinDbg and tried to reboot the debuggee machine. But it hung up during the boot again.</p></li>\n<li><p>At this point I disconnected the Ethernet cable and had to reboot it using the power button on that desktop. It failed one more time, and then Windows blue menu came up saying that it failed to automatically recover and needs to reset. (I can't remember the exact wording.)</p></li>\n<li><p>So about 2 hours later, it recovered and that desktop (debuggee) can now boot, but it wiped out everything that I installed on it. (I can recover all of my installed software since it was a brand new installation.)</p></li>\n</ol>\n<p>So I'm wondering if I was doing something wrong, and if anyone else dealt with the same issue?</p>\n<p>PS. I'm just trying to avoid wasting 2+ hrs for such a reset in the future.</p>\n<hr/>\n<p><strong>EDIT:</strong> I was able to replace an HDD in this test PC with an SSD, then reinstall Windows 10 from scratch, and repeat the steps I described above. When I enabled kernel network debugging, that PC started booting visibly slower (about 2 minutes vs. original 15-20 sec.)</p>\n<p>After that as soon as I connected an Ethernet cable from that test PC to my Windows 10 laptop with WinDbg Preview waiting for connection, the booting process never completed. WinDbg Preview never connected to that remote PC either.</p>\n<p>After a while I disconnected the Ethernet cable and forced the reboot by holding down the power button. This time the boot process froze up after about 2-3 minutes of seeing the spinning dots. Here's the exact screen:</p>\n<p><a href=\"https://i.sstatic.net/t1guv.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/t1guv.jpg\"/></a></p>\n<p>Then when I force-rebooted it again, it showed:</p>\n<p><a href=\"https://i.sstatic.net/aiJxT.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/aiJxT.jpg\"/></a></p>\n<p>then:</p>\n<p><a href=\"https://i.sstatic.net/nYadd.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/nYadd.jpg\"/></a></p>\n<p>and eventually:</p>\n<p><a href=\"https://i.sstatic.net/OuaZB.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/OuaZB.jpg\"/></a></p>\n<p>(Luckily this time I created a restore point before doing the tests above. Restore points were off by default in Windows 10. So after clicking \"Advanced options\" I was able to restore from a restore point.)</p>\n<p>The <code>C:\\Windows\\System32\\LogFiles\\Srt\\SrtTrail.txt</code> file mentioned in the screenshot above contains the following:</p>\n<pre><code>Startup Repair diagnosis and repair log\n---------------------------\nNumber of repair attempts: 1\n\nSession details\n---------------------------\nSystem Disk = \\Device\\Harddisk0\nWindows directory = C:\\Windows\nAutoChk Run = 0\nNumber of root causes = 1\n\nTest Performed: \n---------------------------\nName: Check for updates\nResult: Completed successfully. Error code =  0x0\nTime taken = 0 ms\n\nTest Performed: \n---------------------------\nName: System disk test\nResult: Completed successfully. Error code =  0x0\nTime taken = 0 ms\n\nTest Performed: \n---------------------------\nName: Disk failure diagnosis\nResult: Completed successfully. Error code =  0x0\nTime taken = 16 ms\n\nTest Performed: \n---------------------------\nName: Disk metadata test\nResult: Completed successfully. Error code =  0x0\nTime taken = 296 ms\n\nTest Performed: \n---------------------------\nName: Disk metadata test\nResult: Completed successfully. Error code =  0x0\nTime taken = 16 ms\n\nTest Performed: \n---------------------------\nName: Target OS test\nResult: Completed successfully. Error code =  0x0\nTime taken = 0 ms\n\nTest Performed: \n---------------------------\nName: Volume content check\nResult: Completed successfully. Error code =  0x0\nTime taken = 63 ms\n\nTest Performed: \n---------------------------\nName: Boot manager diagnosis\nResult: Completed successfully. Error code =  0x0\nTime taken = 0 ms\n\nTest Performed: \n---------------------------\nName: System boot log diagnosis\nResult: Completed successfully. Error code =  0x0\nTime taken = 15 ms\n\nRoot cause found: \n---------------------------\nBoot critical file c:\\efi\\microsoft\\boot\\resources\\custom\\bootres.dll is corrupt.\n\nRepair action: File repair\nResult: Failed. Error code =  0x57\nTime taken = 2328 ms\n\n---------------------------\n---------------------------\n</code></pre>\n<p><em>Additionally, if anyone at Microsoft wants me to email you the entire <code>C:\\Windows\\System32\\LogFiles\\Srt</code> folder, I can do so <a href=\"https://reverseengineering.stackexchange.com/users/14864/c00000fd?tab=profile\">upon request</a>.</em></p>\n</div>",
    "votes": "6",
    "answers": 1,
    "views": "1k",
    "tags": [
        "windows",
        "debugging",
        "windbg",
        "kernel-mode"
    ],
    "user": "c00000fd",
    "time": "Jun 17, 2018 at 3:41",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">If you're trying to avoid those extra hours, make sure you have a backup handy. And I mean it, no kidding and not meant in any condescending way.</span>",
            "time": null
        },
        {
            "user": "c00000fd",
            "text": "<span class=\"comment-copy\">@0xC0000022L: Sure. Thanks. I already put in an SSD into that PC to make it boot quicker. Btw, what type of backup is the fastest on Win10?</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">I don't know about the new WinDbg from the store, but the old one had an option to sync the connection. Could you try to use that? Also, I typically turn off the graphical boot logo (<code>sos yes</code>) to see what gets loaded. I'd also recommend to enable <code>/bootdebug</code> - at least temporarily - until you figure out what's wrong (it's not strictly needed for ordinary kernel mode debugging, though).</span>",
            "time": null
        },
        {
            "user": "c00000fd",
            "text": "<span class=\"comment-copy\">@0xC0000022L yes, as you reminded me I was trying to set it up on a physical hardware. Tbh, it's been so long ago so I don't remember if I succeeded or not. What I remember though is that I switched away from using COM port for kernel debugging because it makes the process slow af. That connection is also very unstable. Thus, if I can (sometimes it's impossible if you have to debug real hardware device) but if you don't have to, I always set it up in a VM via the new WinDbg Next and its \"Net\" connection type. The experience is so much better than the old school COM port.</span>",
            "time": null
        },
        {
            "user": "c00000fd",
            "text": "<span class=\"comment-copy\">@0xC0000022L yes for sure. Or, if you have access to a JTAG debugger that's the best.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You need to use the correct ethernet cable. If you are connecting target directly to your debugger host you need to use a cross over cable, not a regular ethernet cable. Alternately if you don't have a crossover a cable using a switch/hub is required to connect the devices. I'd check TCP/IP communication is working between devices prior to enabling debugging if possible.</p>\n<p>Simply you should check:</p>\n<ol>\n<li>On debugger host run <strong>ipconfig</strong> and identify IP address of the ethernet adapter you will be using</li>\n<li>On target computer ensure <strong>ping -4 <em>hostip</em></strong> works. You may need to allow ICMP traffic through firewall for this to work.</li>\n</ol>\n<p>In addition on host debugger machine you will need to allow traffic through Windows firewall (or any other 3rd party firewalls installed)</p>\n<blockquote>\n<p>When you first attempt to establish a network debugging connection,\nyou might be prompted to allow the debugging application (WinDbg or\nKD) access through the firewall. Client versions of Windows display\nthe prompt, but Server versions of Windows do not display the prompt.\nYou should respond to the prompt by checking the boxes for all three\nnetwork types: domain, private, and public. If you do not get the\nprompt, or if you did not check the boxes when the prompt was\navailable, you must use Control Panel to allow access through the\nfirewall. Open Control Panel &gt; System and Security and select Allow an\napp through Windows Firewall. In the list of applications, locate\nWindows GUI Symbolic Debugger and Windows Kernel Debugger. Use the\ncheck boxes to allow those two applications through the firewall.\nRestart your debugging application (WinDbg or KD).</p>\n</blockquote>\n</div>",
            "votes": "2",
            "user": "chentiangemalc",
            "time": "Aug 24, 2021 at 1:40",
            "is_accepted": false,
            "comments": []
        }
    ]
}