{
    "title": "Finding a malware object inside PE file",
    "link": "https://reverseengineering.stackexchange.com/questions/18501/finding-a-malware-object-inside-pe-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Today my AV found an antique piece of malware called Win9X.CIH.dam.\nInstead of just removing it I would like to make a little research for fun.</p>\n<p><a href=\"https://i.sstatic.net/ze1dO.png\" rel=\"noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/ze1dO.png\"/></a></p>\n<p>What does \"data0513\" exactly mean? I can't understand what the <strong>0513</strong> is. I suppose it's some kind of offset but can't figure out from where.</p>\n<p>I'd like to dump the malware out of the host executable and disassemble it.</p>\n</div>",
    "votes": "5",
    "answers": 3,
    "views": "229",
    "tags": [
        "malware",
        "pe",
        "dump"
    ],
    "user": "Ian Smuga",
    "time": "Jun 10, 2018 at 23:28",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is likely something specific to the AV. A few possibilities come to mind:</p>\n<ol>\n<li>an archive member in case the exe has an embedded archive</li>\n<li>overlay area (data beyond the area covered by sections)</li>\n<li>PE resources</li>\n<li><p>...something else...</p>\n<p>0513 seems to be too small to be an offset so I suspect it's a sequence number. To know more you'll probably need to RE the AV engine to figure out what naming scheme it uses and how the numbers are assigned.</p></li>\n</ol>\n</div>",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Jun 11, 2018 at 14:18",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">To expand on the \"something else\" an offset or sequence number (or the last hex digits of a hash or checksum) related to the <i>rule</i> matching the malware ...</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You don't have a reliable way of knowing what that naming schema means more than reverse engineering your AV software itself.</p>\n<p>Some AVs have the option to dump the malware. Maybe yours does, but it is not likely the case because the regular user would never use that feature and it may be risky. </p>\n<p>You can use a tool like: <a href=\"http://www.virustotal.com\" rel=\"nofollow noreferrer\">Virustotal</a></p>\n<p>To preprocess your file and get some more insight on what the file is.\nVirusTotal it is not a tool just for scanning for malware as one may think. It has a very decent amount of automatic static binary analysis which you may find useful. That tool may throw you the offsets of the regions on which the malware lives, letting you extract it, for example.</p>\n<p>Then continue your research with your own tools.</p>\n</div>",
            "votes": "2",
            "user": "0xfede7c8",
            "time": "Jun 15, 2018 at 20:15",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Could you explain how VirusTotal would be of help here?</span>",
                    "time": null
                },
                {
                    "user": "adric",
                    "text": "<span class=\"comment-copy\">With a hash of the original file you could look up o VirusTotal (etc) what 60+ other scanning engines think of your sample which might give you useful information. You could follow the references to threat descriptions or reports and learn more about your KIS found.</span>",
                    "time": null
                },
                {
                    "user": "0xfede7c8",
                    "text": "<span class=\"comment-copy\">Good explanation adric. I'm editing.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Where/how can VirusTotal \"may throw you the offsets of the regions on which the malware lives\"?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The value could well be an absolute offset within the file, though it seems unlikely.  CIH inserted itself into spaces between the end of the file header and the start of the section, and between the end of one section and the start of the next, etc.  It changed the PE entrypoint field to point to itself so that it ran immediately.  If you use a disassembler such as IDA, you will be able to see the code, and from there you can extract it with a hex editor or similar.</p>\n</div>",
            "votes": "1",
            "user": "peter ferrie",
            "time": "Jun 30, 2018 at 22:33",
            "is_accepted": false,
            "comments": []
        }
    ]
}