{
    "title": "Why does an executable give an error when opened in $tool?",
    "link": "https://reverseengineering.stackexchange.com/questions/1852/why-does-an-executable-give-an-error-when-opened-in-tool",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have an executable that runs in the operating system, but when when I open it in <code>$tool</code> I get an error. What is going on?</p>\n</div>",
    "votes": "5",
    "answers": 2,
    "views": "492",
    "tags": [
        "tools",
        "malware",
        "file-format",
        "pe"
    ],
    "user": "Vehm Stark",
    "time": "Jun 4, 2013 at 2:09",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">An example of an error (e.g. a screenshot) would make this more realistic.</span>",
            "time": null
        },
        {
            "user": "dyasta",
            "text": "<span class=\"comment-copy\">Dunno why you were voted down. It's a worthy topic. Perhaps the question wasn't clear.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@90h: the question is relatively clear, but Igor's point of criticism hasn't been addressed at all, but it would make sense to address it.</span>",
            "time": null
        },
        {
            "user": "dyasta",
            "text": "<span class=\"comment-copy\">@VehmStark Let the community decide. I think it's fine as is. It is a general question with a general answer, and doesn't require specifics to have utility.</span>",
            "time": null
        },
        {
            "user": "dyasta",
            "text": "<span class=\"comment-copy\">A related question at RE.SE, including a couple <b><i>specific examples</i></b>, is here: <a href=\"http://reverseengineering.stackexchange.com/questions/1399/how-to-prevent-use-of-resource-editors/1538#1538\">How to Prevent Use of Resource Editors</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is caused by a differences in the operating system's loader and the file format parsing code in the tool you are using. Malicious program authors often exploit differences between an executable file format's specification and how the file format is actually used by the loader in practice. If there are differences between the file format specification and the operating system loader, there exist executables which will run but are not legal according to the specification! For example, <a href=\"https://code.google.com/p/pefile/source/browse/trunk/pefile.py#1789\">up until Windows Vista a PE executable can be missing several header fields and the Window's loader will still load it</a>. It's likely your tool was written by looking at the file format specification and not at the implementation of the loader and thus cannot necessarily handle all executables which are successfully loaded by the operating system.</p>\n<p>In reality an executable file format is specified in three categories of places:</p>\n<ol>\n<li>the formal file format specification</li>\n<li>the implementation of the operating system's loader</li>\n<li>the implementation of third party tools</li>\n</ol>\n<p>These three things often differ in very subtle ways and malicious program authors take advantage of this fact. Just remember that the ultimate arbiter for whether something is a valid executable or not is the loader. If the executable runs but your tools are failing, your tools do not take into account the real-world behavior of the operating system loader.</p>\n<p><a href=\"https://code.google.com/p/corkami/wiki/PE\">The best work documenting this phenomena that I am aware of is by Ange Albertini for the PE executable file format</a>.</p>\n</div>",
            "votes": "9",
            "user": "Vehm Stark",
            "time": "Apr 20, 2013 at 21:21",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ange",
                    "text": "<span class=\"comment-copy\">After Windows Vista, it's not possible anymore to cut the OptionalHeader at Subsystem: the comment in pefile is only valid until Windows XP.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Try using <a href=\"http://www.rohitab.com/apimonitor\" rel=\"nofollow\">Rohitab's API Monitor</a> to use the loader to open the program and watch the failed calls. Might point you in the right direction.</p>\n</div>",
            "votes": "1",
            "user": "Mick",
            "time": "Apr 21, 2013 at 23:33",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">actually this wouldn't help, because the third-party programs <i>handling</i> PE files will not use the default library functions provided by the operating system, e.g. as part of <code>ntdll.dll</code>.</span>",
                    "time": null
                }
            ]
        }
    ]
}