{
    "title": "sidt, sldt, sgdt, str anti-vm techniques does not work anymore on VMWare 12?",
    "link": "https://reverseengineering.stackexchange.com/questions/18555/sidt-sldt-sgdt-str-anti-vm-techniques-does-not-work-anymore-on-vmware-12",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>They are all privileged(??) x86 instructions.</p>\n<ul>\n<li><code>sidt</code> : Stores the Interrupt Descriptor Table Register (IDTR) content. (Red pill)</li>\n<li><code>sldt</code> : Stores the segment selector from the Local Descriptor Table Register </li>\n<li><code>sgdt</code> : Stores the Global Descriptor Table Register (GDTR) content.</li>\n<li><code>str</code> : Stores the segment selector from the Task Register (TR).</li>\n</ul>\n<p>Their values are supposed to be different on VM compared to host.\nI've already run my tests and these techniques do not seem to work on a VMware Workstation 12.</p>\n<p>All I'm asking is if someone else has encountered the same behavior.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "901",
    "tags": [
        "x86"
    ],
    "user": "n1h1l",
    "time": "Jun 24, 2018 at 19:57",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">can you explain a bit more about the topic?</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Uhm, why not actually <i>try</i> it out? @PawełŁukasik the inquirer is referring to <a href=\"https://web.archive.org/web/20070911024318/http://invisiblethings.org/papers/redpill.html\" rel=\"nofollow noreferrer\">Redpill</a> as devised by Rutkowska in or around 2007 to <b>detect</b> (not counter!) the presence of a VMM. Oh and aside from that it's not exactly about reverse engineering.</span>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">@0xC0000022L thx. I've just wanted to author to update the post so it will be better quality but since it's not RE then it doesn't matter.</span>",
            "time": null
        },
        {
            "user": "n1h1l",
            "text": "<span class=\"comment-copy\">@0xC0000022L Ok, hypothetically, you try to reverse a malware, and does not seem to run inside a vm, what do you do to neutrilise the anti-vm functionality??? black magic?? This have something to do with RE, right?except if you are a hardore elitist reverse engineer...</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@n1h1l fair point. Still not exactly about RCE, but should be on topic. With four reopen votes, I'll cast the fifth so you can get an answer. Sorry, was offline for a few days, but there was actually just one vote missing now from high-rep users to reopen your question (without a moderator)!</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>These are not privileged instructions.  What has changed is the manner in which the VM is running.  Now with hypervisors, those values could well be the same inside and outside of the VM.  They were never particularly reliable methods to detect VMs anyway.</p>\n</div>",
            "votes": "1",
            "user": "peter ferrie",
            "time": "Aug 27, 2018 at 21:11",
            "is_accepted": false,
            "comments": []
        }
    ]
}