{
    "title": "How do you look for a a particular value at address in IDA",
    "link": "https://reverseengineering.stackexchange.com/questions/18551/how-do-you-look-for-a-a-particular-value-at-address-in-ida",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So, I was trying to load some binary and in the main function, I saw instructions such as</p>\n<pre><code>mov     edi, [esi+1Ch]\n...\nlea eax, [esi+18h]\n</code></pre>\n<p>So, what are these values at [esi+1Ch] and [esi+18h]. How do you look those with IDA Pro. </p>\n</div>",
    "votes": "4",
    "answers": 2,
    "views": "2k",
    "tags": [
        "ida",
        "disassembly",
        "assembly",
        "x86"
    ],
    "user": "Marcus",
    "time": "Jun 18, 2018 at 21:18",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>One of available options is to simply run <code>Dword(cpu.esi+0x1c)</code> or <code>Dword(cpu.esi+0x18)</code> correspondingly in idapython console.</p>\n<p>latest API is: <a href=\"https://hex-rays.com/products/ida/support/idapython_docs/ida_bytes.html#ida_bytes.get_dword\" rel=\"nofollow noreferrer\">ida_bytes.get_dword</a></p>\n</div>",
            "votes": "2",
            "user": "crifan",
            "time": "Feb 6, 2024 at 8:22",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><em>Seeing that OP is new to RE.SE and by the looks of the question itself I'll assume OP is relatively new to reverse engineering. Apologies if that isn't the case.</em></p>\n<p>Values shown as <code>[esi+1Ch]</code> or <code>[esi+18h]</code> are referencing values <em>currently</em> stored in the listed registers at the time the instruction is executed.</p>\n<p>Without letting the executable run and debugging it's execution, stopping at the instructions you're interested investigating it could be extremely difficult to calculate what value will be there. Obviously, previous instructions relating to said registers can make it easier or harder. For example, a specific immidiate value can be assigned to the register just before, making tracing the value back awfully easy.</p>\n<p>When that isn't the case, often time placing a breakpoint at that instruction and reading the values in the debugger will be the easy path.</p>\n<p>Although IDA's debugger is probably not the best one around, you can definitely get it to breakpoint and read the values. Doing that using IDAPython could be, as another answer notes, by accessing the <code>cpu</code> object for the register value itself and adding the offset. Then, if the resulting address is actually derefereced, calling <code>Dword</code> will let you read the value <em>currently in memory</em>. This is the case in the first (but <strong>not</strong> the second) dereference shown in the two lines of assembly OP asks about (this is because of how the <code>lea</code> instruction is).</p>\n</div>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Jun 19, 2018 at 12:43",
            "is_accepted": false,
            "comments": []
        }
    ]
}