{
    "title": "Printing Unicode strings in Gdb in OSX",
    "link": "https://reverseengineering.stackexchange.com/questions/1860/printing-unicode-strings-in-gdb-in-osx",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Are there any useful snippets or Gdb functions that you guys normally use to print out Unicode strings? I'm trying to debug Mach-O binaries and <code>x/s</code> seems to be printing out junk. I believe the default encoding for Objective C strings is UTF-16.</p>\n</div>",
    "votes": "6",
    "answers": 1,
    "views": "4k",
    "tags": [
        "osx",
        "gdb",
        "encodings",
        "mach-o",
        "strings"
    ],
    "user": null,
    "time": "Apr 21, 2013 at 10:31",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Borderline off topic. Debuggers are dual use, but this question is definitely borderline since you debug, i.e. you <i>forward</i> engineer code - and state that. Still +1 because it's interesting.</span>",
            "time": null
        },
        {
            "user": "Gilles 'SO- stop being evil'",
            "text": "<span class=\"comment-copy\">@0xC0000022L I don't see any sign that blahfish isn't reverse engineering an unknown binary.</span>",
            "time": null
        },
        {
            "user": "user1743",
            "text": "<span class=\"comment-copy\">@0xC0000022L Thanks for your comment. Im curious, I don't understand why a question on debuggers is closed off as off-topic and not related to reverse engineering. Its dynamic analysis, the way i see it. Am I missing something?</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@blahfish: <b>a.)</b> this was a comment and I didn't flag this way, in fact I voted it up, a mod closed it, ask him/her and <b>b.)</b> yes, I maintain that this is borderline off topic, because this could be asked on StackOverflow without problem and answered by bus loads of programmers, whereas the same could not be said of <i>actual</i> RCE problems. But then, you are welcome to join the discussion on meta.RE.SE to contribute your opinion and help shape the community further ;)</span>",
            "time": null
        },
        {
            "user": "user1743",
            "text": "<span class=\"comment-copy\">@0xC0000022L Gotcha, you do have valid points there, thanks!</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you think the encoding is wrong then you can try these 2 things:</p>\n<ul>\n<li>Try using <code>x/hs</code> <a href=\"http://sourceware.org/gdb/onlinedocs/gdb/Memory.html\">as described here</a></li>\n</ul>\n<blockquote>\n<p>Each time you specify a unit size with x, that size becomes the default unit the next time you use x\n  ...\n  Use x /hs to display 16-bit char strings</p>\n</blockquote>\n<ul>\n<li>set the character set in gdb <a href=\"http://sourceware.org/gdb/onlinedocs/gdb/Character-Sets.html\">as described here</a></li>\n</ul>\n<blockquote>\n<p>gdb has no way to automatically recognize which character set the inferior program uses; you must tell it, using the set target-charset command, described below.</p>\n</blockquote>\n</div>",
            "votes": "4",
            "user": "ixje",
            "time": "Apr 19, 2013 at 6:09",
            "is_accepted": true,
            "comments": []
        }
    ]
}