{
    "title": "How to create executable COM file from hexdump code of msdos 8086",
    "link": "https://reverseengineering.stackexchange.com/questions/18642/how-to-create-executable-com-file-from-hexdump-code-of-msdos-8086",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've got an hexdump of COM MSDOS 8086 file, and I'm trying to transform it to COM executable.</p>\n<p>After looking around, I found a site<a href=\"https://onlinedisassembler.com/\" rel=\"nofollow noreferrer\">1</a> that gives reasonable disassembly of the hexdump. Although, when I try to use that assembly generated code in a TASM, it doesn't build, and throw errors.</p>\n<p>In contrast, I tried also to use IDA, and it does not seem to get the same assembly result as <a href=\"https://onlinedisassembler.com/\" rel=\"nofollow noreferrer\">1</a>.</p>\n<p>My questions are:</p>\n<ol>\n<li>Is there any other way that I'm missing in transforming hexdump into an executable COM file?</li>\n<li><a href=\"https://onlinedisassembler.com/\" rel=\"nofollow noreferrer\">The site</a> gives me expressions like: <code>mov    $0x400,%di</code> , but TASM only recognize <code>mov di,400</code>. Is that a better way to translate the hexdumps into instructions that TASM will recognize?</li>\n</ol>\n<p>BTW - The context is that I'm trying to solve an RE riddle, which I cannot post online (and I'm a pretty newbie in RE and assembly).</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "233",
    "tags": [
        "dos-com"
    ],
    "user": "user1387682",
    "time": "Jun 30, 2018 at 20:23",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">From the looks of it the Online Disassembler generates the disassembly in the AT&amp;T syntax (<code>mov    $0x400,%di</code>), which is odd, given that when I visit the site it gives back Intel syntax. Anyway, the difference is that AT&amp;T syntax is somewhat more verbose and the source operand comes left of the comma as opposed to right of the comma with Intel's syntax.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>DOS COM files do not have any structure or headers; they are loaded into memory by DOS as-is and are executed from the first byte, so you just need to convert hex bytes to binary to get a COM file.</p>\n<p>The difference you see is likely caused by the processor mode setting; <code>mov di, 400h</code> in 16-bit mode and and <code>mov edi, 0x400</code> in 32-bit mode have exactly the same opcode.</p>\n<p>IDA knows that COM files are 16-bit code and disassembles them accordingly, but ODA seems to default to 32-bit mode. To force 16-bit disassembly, select i8086 in the Mode combo box.</p>\n</div>",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Jun 30, 2018 at 0:12",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user1387682",
                    "text": "<span class=\"comment-copy\">Thanks! in ODA I already chose i8086. my \"complains\" were about the $, % signs and the fact that the operands were exchanged.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@user1387682 switch syntax to intel</span>",
                    "time": null
                },
                {
                    "user": "user1387682",
                    "text": "<span class=\"comment-copy\">Thanks, again! Can you guide me how? It does not give me an option (see the screenshot here: <a href=\"https://ibb.co/dJ08Wd\" rel=\"nofollow noreferrer\">ibb.co/dJ08Wd</a>), and the tutorial is not working in this site.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@user1387682 I see it when I click on the Platform button. maybe try another browser.</span>",
                    "time": null
                },
                {
                    "user": "user1387682",
                    "text": "<span class=\"comment-copy\">I see it only when I choose I386:intel platform. Is it good to the case that I asked (instead of i8086)?</span>",
                    "time": null
                }
            ]
        }
    ]
}