{
    "title": "How to get closing message from IDA Pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/18683/how-to-get-closing-message-from-ida-pro",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is there any way to get  SDK API  message when Ida Pro is closing?\nI write plug-in that connect with other  application and I need to close connections when IDA is closing.</p>\n</div>",
    "votes": "2",
    "answers": 2,
    "views": "254",
    "tags": [
        "ida",
        "idapro-sdk"
    ],
    "user": "tanitrielle",
    "time": "Jul 4, 2018 at 11:18",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">If this were OS-specific you could use some mechanism like window hooks on Windows, but I can see how an IDA API may be the better choice here.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Your plugin class can implement the <code>term(self)</code> method, which will be called when IDA unloads the plugin. Unloading a plugin might happen at different occasions depending on the value returned by your <code>init(self)</code> method when the plugin was loaded.</p>\n<p>You should note the plugin may be loaded and unloaded several times during the execution of a single IDA instance, though. For example a plugin may be loaded once when IDA first starts without a loaded binary, and then be unloaded and reloaded when a binary is loaded (either an IDB or a binary loaded and analyzed for the first time).</p>\n</div>",
            "votes": "2",
            "user": "NirIzr",
            "time": "Jul 5, 2018 at 10:21",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The second way to solve the problem with getting close message is create <code>term(self)</code> method in the UIHook class but not in plugin class.\nThe benefit of this way that is it usable with ida pro scripts not just plugins.\nExample:\n<a href=\"https://github.com/EiNSTeiN-/idapython/blob/master/examples/ex_uihook.py\" rel=\"nofollow noreferrer\">https://github.com/EiNSTeiN-/idapython/blob/master/examples/ex_uihook.py</a></p>\n</div>",
            "votes": "1",
            "user": "tanitrielle",
            "time": "Jul 11, 2018 at 10:01",
            "is_accepted": true,
            "comments": []
        }
    ]
}