{
    "title": "Ripping/pasting code into an executable using Olly",
    "link": "https://reverseengineering.stackexchange.com/questions/1869/ripping-pasting-code-into-an-executable-using-olly",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm working with some x86 assembly code and I need to rip from one executable and paste that code into another.</p>\n<p>Originally, I had an executable that was meant to accept two command line parameters and run a handwritten function on them. However, I ran into annoyances with using <code>GetCommandLine</code> et al. to return the parameters in my ASM. Namely, it returned Unicode and I needed the parameters in ANSI. Rather than dealing with setting up the library calls and converting that way, I compiled a small program that uses command line arguments with the intent of reusing code.</p>\n<p>So now I have two executables:</p>\n<ul>\n<li>one with the command line parameters parsed and in their proper places</li>\n<li>two with the actual assembled function code inside of it.</li>\n</ul>\n<p>The first executable has the space for the function <code>NOP</code>'d out, but I need a good way to paste the logic in. I've looked at Asm2clipboard, Code Ripper and data ripper, but they only have the functionality to rip the assembly out, but not paste it back in.</p>\n<p>I'm aware I'll have to fix addresses and things like that, but I can't find a way in Olly or other tools to move the code between the executables. I can go into HexEdit or something like that I supposed, but I was hoping there's an easier way.</p>\n</div>",
    "votes": "8",
    "answers": 3,
    "views": "2k",
    "tags": [
        "disassembly",
        "pe",
        "ollydbg",
        "patching"
    ],
    "user": "Fewmitz",
    "time": "Jun 17, 2021 at 15:31",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">uhm, <code>GetCommandLineA</code> or <code>GetCommandLineW</code>? Why not simply use the correct one for your context?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>For OllyDbg, it is </p>\n<ol>\n<li><p>Select code from the CPU window </p></li>\n<li><p>Right-click and choose <code>Binary</code></p></li>\n<li><p>Choose <code>Binary Copy</code></p></li>\n<li><p>In the target CPU window, do the same but select <code>Binary Paste</code></p></li>\n</ol>\n</div>",
            "votes": "6",
            "user": "Ange",
            "time": "Apr 20, 2013 at 9:50",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<h1>disasm</h1>\n<p>use IDA (why olly only? IDA free might do the trick), or OllyDbg with BeaEngine plug-in (it has some specific ASM syntax options)</p>\n<h1>improve in the disassembler</h1>\n<p>rename as many labels as possible, using delta address - it's painful to do that later</p>\n<h1>export to ASM</h1>\n<p>rework the ASM syntax to get it re-assemblable</p>\n<h1>patch</h1>\n<p>either:</p>\n<ul>\n<li><p>make your ASM code EIP-independant and patch it as hex</p>\n</li>\n<li><p>re-inject it with Iczelion's <a href=\"http://www.woodmann.com/collaborative/tools/index.php/Code_Snippet_Creator_(Iczelion)\" rel=\"noreferrer\">Code Snippet Creator</a> (it injects your ASM code compiled as from your OBJ)</p>\n</li>\n</ul>\n</div>",
            "votes": "6",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"http://rammichael.com/multimate-assembler\" rel=\"nofollow noreferrer\"><strong>Multiline Ultimate Assembler</strong></a> is a multiline (and ultimate) assembler (and disassembler) plugin for OllyDbg. It’s a perfect tool for modifying and extending a compiled executable functionality, writing code caves, etc.</p>\n</div>",
            "votes": "5",
            "user": "MarianD",
            "time": "Jun 17, 2021 at 15:32",
            "is_accepted": false,
            "comments": []
        }
    ]
}