{
    "title": "What kind of information can i get from reverse engineering an integrated circuit package",
    "link": "https://reverseengineering.stackexchange.com/questions/187/what-kind-of-information-can-i-get-from-reverse-engineering-an-integrated-circui",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've seen numerous examples of people essentially <a href=\"http://www.youtube.com/watch?v=mT1FStxAVz4\">dissolving away the resin</a> from integrated circuits in boiling high strength acid in order to expose the raw silicon chip underneath. My general understanding is that this has, from time to time, allowed for attackers to determine 'secret' information like crypto keys and the like. \nIn addition, undocumented functionality can be determined and unlocked by doing this in some cases. </p>\n<p>How can one go about 'reading data' from raw silicon? What kind of other benefits can you obtain from hardware level reverse engineering?</p>\n</div>",
    "votes": "12",
    "answers": 1,
    "views": "426",
    "tags": [
        "hardware",
        "integrated-circuit"
    ],
    "user": "NULLZ",
    "time": "Mar 23, 2013 at 14:13",
    "comments": [
        {
            "user": "user187",
            "text": "<span class=\"comment-copy\">What kind of chip are you investigating? CMOS? Digital? Do you have a part number?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are various techniques used and I'll list some.</p>\n<ol>\n<li><p><strong>Probing while operating</strong> - if you have a probe station you can operate the device and probe intermediate signals within the die.  This requires that the encapsulations (usually Si#N4 -or sometimes Polyimide) needs to also have been removed.  Once this is removed the chip has a limited life, but you can't probe through that.</p>\n<p>Also, the feature size of the chip on top metal must also be large enough to be able to probe.  In most modern processes this is very problematic as even on the coarsest resolution layers it is still far too small for probing.</p>\n<p>In this case, we use a FIB (Focused Ion Beam) machine to cut and also to add test points on the chip.  In this case, you'd leave the passivation on and the pad is deposited on top of the passivation.  The FIB then cuts through the passivation and connects to the traces below.  These machines are typically charged out at $100's per hour.</p>\n</li>\n<li><p><strong>Delayering -</strong>  The chip is etched layer by layer and photographs and/or electron micrographs are taken at each stage.  Understanding the construction of the devices will allow you to regenerate the device structure down to the Si.  Here dimensions are important.  Understanding the implants into the Si itself requires the use of SIMS (Secondary Ion Mass Spectrograph) machine and tiny holes are milled into the substrate the ions are vacuumed into a Mass spectrometer machine and the species and doping profiles are shown as the machine drills down.</p>\n<p>There are lots of other machines that are used that can help determine species and doping levels.</p>\n</li>\n<li><p>The two techniques above cannot help if there are flash or EEPROM devices, because the state of the device is set by the presence or absence of charge, which you can't read.  In this case, there are other tools that are used.  You would delayer to just above the gate levels and try to read the stored charge on the floating gate using various techniques like AFM (with the ability to read electron affinity- special attachment).  There are even techniques that can be used such as SEM with surface contrast enhancement that allows you to monitor a running chip almost like a strobe light.  But this requires that the device can have significant metal layers removed and STILL be operational.  Which is not usual.</p>\n</li>\n</ol>\n<p>To fully RE a chip you will require multiple chips and you progressively learn as you slowly step through the various layers.</p>\n<p>There are many different techniques used, most are developed to help designers debug problems rather than to RE, this is only a short overview at best.</p>\n</div>",
            "votes": "15",
            "user": "Rohit Gupta",
            "time": "Jan 5, 2023 at 10:37",
            "is_accepted": true,
            "comments": []
        }
    ]
}