{
    "title": "Analyzing encrypted Android apps (.asec)?",
    "link": "https://reverseengineering.stackexchange.com/questions/1876/analyzing-encrypted-android-apps-asec",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've been trying to reverse engineer a paid android app that writes out some binary data so that I can export that data into other programs (it's a run/walk timer app, if anyone's curious, and I'm trying to get its GPS traces out). However, it looks like the apk is encrypted and stored in <code>/data/app-asec/[app_id].asec</code>.</p>\n<p>There's a nice <a href=\"http://nelenkov.blogspot.com/2012/07/using-app-encryption-in-jelly-bean.html\">blog post</a> that says the encryption used is TwoFish, with a key stored in <code>/data/misc/systemkeys/AppsOnSD.sks</code>, but I haven't been able to decrypt the file using the naïve strategy of just using that key directly with TwoFish on the <code>.asec</code>.</p>\n<p>How can I decrypt this to get an apk I can actually analyze?</p>\n<p>Note: I realize that this information is considered somewhat delicate in places like xda-developers, since it could be used to enable piracy. I have no such intentions, I just want to examine the serialization code.</p>\n</div>",
    "votes": "23",
    "answers": 1,
    "views": "12k",
    "tags": [
        "android",
        "encryption"
    ],
    "user": "Brendan Dolan-Gavitt",
    "time": "Apr 21, 2013 at 3:48",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>After a little bit more work and some more careful re-reading, I figured out my mistake: the files in <code>/data/app-asec/</code> are the encrypted <em>containers</em>. They're actually dm-crypt volumes, which then get mounted at <code>/mnt/asec/[app_id]</code>. The <code>pkg.apk</code> in that directory is the unencrypted apk that can be analyzed using any of the fine tools in <a href=\"https://reverseengineering.stackexchange.com/a/46/257\">this answer</a>.</p>\n</div>",
            "votes": "18",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": []
        }
    ]
}