{
    "title": "IDA fixups, why and how",
    "link": "https://reverseengineering.stackexchange.com/questions/18825/ida-fixups-why-and-how",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm using IDA 7 <strong>Freeware</strong>, not Pro. I've been using IDC to re-invent the wheel somewhat, but I'm learning a ton of stuff as I go along.</p>\n<p>I have a 16-bit MSDOS exe which I'm reversing. I stripped out the header and reloc table in my first attempt, so that all seg refs resolved correctly.</p>\n<p>Now I've found set_fixup() and friends, and also seen doRelocs() from the (old) SDK via Google. I'm a bit puzzled by it all.</p>\n<ol>\n<li><p>set_fixup() as per IDA help has 5 params. However set_fixup() expects 6 params in my version of IDA Freeware.</p></li>\n<li><p>am I supposed to use set_fixup() on an entry in the exe header reloc table, or on the ea of an instruction in the program? (eg mov ax, 0x2d0e - where 0x2d0e needs to be adjusted to be 0x2d0e + 0x160 - code starts at 0x1600+10).</p></li>\n<li><p>I can deduce from experiment set_fixup() looks like: set_fixup(targetEa, fixupTypeFlag, ???, ???, ???, displacement). Seems that p3 might be an ea, and p3 should be &gt;p4 (otherwise nothing happens). p5 appears to have no effect!</p></li>\n<li><p>doRelocs() - in the (ver?) dos_ovr loader - changes instruction bytes referenced by the exe header reloc table, physically changing the bytes in the code. It then also calls set_fixups(). I must be understanding fixups wrongly, or IDA fixups function differently to DOS exe relocations. Surely if you change the bytes to be relative to the start of the file ('mz'), then you no longer need to apply fixups?? They are fixed up by changing them! After all that's what DOS does when it loads the code before discarding the header.</p></li>\n</ol>\n<p>Please help me understand IDA fixups!</p>\n<p>I'm trying to use this IDC code:</p>\n<p>//seg001:10 to_ea == 0x1610</p>\n<p>//0x01610: mov ax, 0x02d0e (next: mov ds,ax)</p>\n<p>//0x2d0e + 0x160 = 0x2e6e</p>\n<p>set_fixup(0x1611, FIXUP_SEG16, 0x2e6e0, 0x2e6e, 0, 0) //best guess at args</p>\n<p>Thanks in advance!</p>\n<p>e: Partial answer from Ilfak Guilfanov (via email)</p>\n<p>~~~~\nJul 18 (1 day ago)\nto me </p>\n<p>Thanks, we will fix this. Meanwhile pass 0 for fixupf:</p>\n<p>void set_fixup(long ea, long type, long fixupf, long targetsel, long targetoff, long displ);</p>\n<p>~~~~</p>\n<p>Perhaps I'll be able to figure the rest out, but still grateful for any further help!</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "447",
    "tags": [
        "ida",
        "dos-exe"
    ],
    "user": "k9wazere",
    "time": "Jul 19, 2018 at 17:30",
    "comments": [
        {
            "user": "NirIzr",
            "text": "<span class=\"comment-copy\">IDC is kind of dead and rarely used. If you're limited to free tools you may want to consider using radare2 or other alternatives.</span>",
            "time": null
        },
        {
            "user": "k9wazere",
            "text": "<span class=\"comment-copy\">@Biswapriyo Thanks, but set_fixup() is an IDC function, not a decompiled program function. Your link is about IDC not detecting fastcall function parameters?</span>",
            "time": null
        },
        {
            "user": "Anton Kukoba",
            "text": "<span class=\"comment-copy\">Wait for Igor Skochinsky to reply, I know that he knows :)</span>",
            "time": null
        }
    ],
    "answers_data": []
}