{
    "title": "Understanding Program Arguments on the Stack in Assembly",
    "link": "https://reverseengineering.stackexchange.com/questions/18855/understanding-program-arguments-on-the-stack-in-assembly",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>To self-teach myself reverse engineering, I am writing small C programs and reversing them in order to understands how the compiler sees my code. However, I am having quite tough time understanding the stack concept w.r.t command line arguments.</p>\n<p>So for a basic c code like this:</p>\n<pre><code>int main(int argc, char** argv){\n\n    if(argc &lt; 2){\n        printf(\"1 argument needed!\");   \n    } else {\n        printf(\"\\n -- %s Entered\", argv[1]);\n        printf(\"\\n%s -- is the first argument\\n\", argv[0]);\n    }\n    return 0;\n}\n</code></pre>\n<p>The conversion is as follows:</p>\n<p><a href=\"https://i.sstatic.net/bnshZ.png\" rel=\"nofollow noreferrer\"><img alt=\"IDA Pro Free DSM Code\" src=\"https://i.sstatic.net/bnshZ.png\"/></a></p>\n<p>The commented parts are where I am having a tough time:</p>\n<pre><code>var_10= qword ptr -10h\nvar_4= dword ptr -4\npush    rbp ; understandable due to convention\nmov     rbp, rsp ; same as above\nsub     rsp, 10h ; why the space allocation? \nmov     [rbp+var_4], edi ; ?\nmov     [rbp+var_10], rsi ; ?\n</code></pre>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "6k",
    "tags": [
        "assembly",
        "c",
        "stack",
        "amd64",
        "arguments"
    ],
    "user": "Thomas",
    "time": "Jul 21, 2018 at 5:54",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First of all, you have to understand that there is a specification for all these things. These specifications differ from one assembly language to another and from one operating system to the other.</p>\n<p>These global specification are called Application Binary Interface (ABI) and define, among other things, what we call the '<em>calling conventions</em>' of functions. IDAPro seems to have found that your program is following the <code>cdecl</code> convention but I doubt it is correct, I think that the calling convention used here is <code>fastcall</code> within the <code>amd64</code> SystemV ABI (see <a href=\"https://en.wikipedia.org/wiki/X86_calling_conventions\" rel=\"noreferrer\">the wikipedia page about calling conventions</a>). My guess is that you are using Linux...</p>\n<p>So, the manipulation of <code>rpb</code> and <code>rsp</code> are just here to save the previous state of the stack-frame in order to restore it when you leave the function (you stack the content of <code>rbp</code> on the stack with the hope that you will be able to restore it when you leave the function at the end). But, you already understood this.</p>\n<p>The space allocation (<code>sub rsp, 10h</code>) come from the fact that you have to store one <code>int</code> (<code>argc</code>) of 4 bytes and one pointer to a <code>char*</code> (<code>argv</code>) of 8 bytes. I know, when added it is only 12 bytes and not 16 bytes (<code>10h</code>). But, the access in memory for the CPU have been optimized when they are <em>aligned</em> (meaning that they start at an address which is a power of 2, or, if you consider hexadecimal representation, the address must end with a <code>0</code>). So, the compiler decided to round-up the memory needed to <strong>align</strong> the data and be more efficient fetching it.</p>\n<p>Then, you have the memory space available on the stack, now lets go fetch the data. So, for that you have to know what does the caller function before starting the function we are currently looking at.</p>\n<p>In fact, the previous function, before calling the function we are in, has stored the arguments of our function in some registers. Here, it is important to agree that all the function (caller and callee) will use the same set of registers to pass the arguments from the caller to the callee.</p>\n<p>So, usually, the first integer argument is stored in <code>rdi</code> and the second in <code>rsi</code> (the full list of registers is listed <a href=\"https://en.wikipedia.org/wiki/X86_calling_conventions#System_V_AMD64_ABI\" rel=\"noreferrer\">here</a>. Here, as the first argument is <code>argc</code> an <code>int</code>, a 32-bit register is enough (4 bytes), so we use <code>edi</code> in place of <code>rdi</code>. And, as the second argument is a pointer (<code>argv</code>), we need the full 64-bit register <code>rsi</code> (8 bytes).</p>\n<p>What do we do with this? Well, we store preciously <code>argc</code> and <code>argv</code> within our stack-frame in the memory we just allocated before.</p>\n<p>Note that the address stored in <code>rbp</code> will not change all along the life of the current stack-frame (as we need it at the end to perform a <code>leave</code> and restore the address of the <code>rbp</code> of the previous stack-frame). So, most of the compilers will use <code>rbp</code> as point of reference to call the variables which are local to the current stack-frame. Thus, <code>rbp+var_4</code> refer to <code>argc</code> and <code>rbp+var_10</code> refer to <code>argv</code> from now.</p>\n<p>Well, that is about all you really need to know about the <code>fastcall</code> convention in Linux. Now, the program should be more understandble to you.</p>\n<p>Hope this helped!</p>\n</div>",
            "votes": "6",
            "user": "perror",
            "time": "Jul 21, 2018 at 6:42",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Thomas",
                    "text": "<span class=\"comment-copy\">awesome explanation!</span>",
                    "time": null
                },
                {
                    "user": "Biswapriyo",
                    "text": "<span class=\"comment-copy\">Is <code>fastcall</code> used in *nix world?</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">I use the terminology <code>fastcall</code> in a wider way that it should be. I meant: <i>a calling convention that uses registers better than the stack to pass arguments</i>. I said <code>fastcall</code> because it was one of the first to use regsiters and one of the most widely used. But, the registers used to pass arguments are changing between the Microsoft ABI and the SysemV ABI, so I guess that Unix is <b>not</b> using <code>fastcall</code>, even if the basic principles of <code>fastcall</code> (passing through registers) are used.</span>",
                    "time": null
                }
            ]
        }
    ]
}