{
    "title": "Why doesn't IDA break on the WriteFile function?",
    "link": "https://reverseengineering.stackexchange.com/questions/18947/why-doesnt-ida-break-on-the-writefile-function",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I searched all places in IDA that call the imported <code>WriteFile</code> function and put a breakpoint on them.</p>\n<p>But while debugging I saw with ProcMon that my exe wrote to the file but even though it did not stop on the breakpoint. I also saw that file was written to.</p>\n<p>Why is that?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "590",
    "tags": [
        "ida",
        "breakpoint",
        "exe"
    ],
    "user": "Keystone",
    "time": "Jul 31, 2018 at 18:16",
    "comments": [
        {
            "user": "user22970",
            "text": "<span class=\"comment-copy\">it might be accessing a lower level write api such as <code>NtWriteFile</code>, maybe try breaking on it instead? also, by hitting ctrl+x you can see where a function is being used. (cross reference)</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@Amirag: ... or higher-level such as those from the C runtime (<code>fwrite</code>, <code>fprintf</code> and other <a href=\"https://docs.microsoft.com/en-us/cpp/c-runtime-library/stream-i-o\" rel=\"nofollow noreferrer\">members of that family</a>). Because if the application isn't statically linked these imports would be imports of the C runtime DLLs rather than of the application itself.</span>",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "<span class=\"comment-copy\">For your use case, you could use an <a href=\"http://www.rohitab.com/apimonitor\" rel=\"nofollow noreferrer\">API monitor</a> to see precisely which functions are being called, as well as trigger a breakpoint  for a debugger to attach and handle.</span>",
            "time": null
        },
        {
            "user": "Keystone",
            "text": "<span class=\"comment-copy\">@NirIzr I never understand how to work with ApiMonitor ,all the time I tried to monitor process, thos process are close/ stack because of ApiMonitor</span>",
            "time": null
        },
        {
            "user": "Keystone",
            "text": "<span class=\"comment-copy\">@0xC0000022L import tab show only the function that compiled as static ? How can I see dynamic compiled functions like <code>fwrite</code></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>A few possibilities come to mind:</p>\n<ol>\n<li><p>The application did not use <code>WriteFile</code> but some other API to write.</p></li>\n<li><p>one of the other APIs or one of the DLLs used by the program called <code>WriteFile</code> indirectly. You can try to catch the this situation by putting a breakpoint on the final API in kernel32 (<code>kernel32_WriteFile</code>).</p></li>\n<li><p>As mentined by Amirag, the program could be calling the native API <code>NtWriteFile</code> in <code>ntdll.dll</code> directly, or even invoke the syscall instruction manually (though this is very rare and tricky to pull off).</p></li>\n<li><p>the write was performed on the process' behalf by the kernel or a kernel-mode driver. This situation can't be caught by a user-mode debugger.</p></li>\n</ol>\n<p>To determine the real cause, double-click the event in Process Monitor and check the Stack tab. If you configure the symbols properly, you should see the actual path through the process and the kernel and determine what exact location in the process triggered the write and inspect the code there.</p>\n</div>",
            "votes": "1",
            "user": "0xC0000022L",
            "time": "Aug 1, 2018 at 15:39",
            "is_accepted": false,
            "comments": []
        }
    ]
}