{
    "title": "Generate c like pseudo code from objdump output",
    "link": "https://reverseengineering.stackexchange.com/questions/18970/generate-c-like-pseudo-code-from-objdump-output",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Ida has a feature which generates pseudo code from assembly.</p>\n<p>Is there a tool under Linux that make the same job, from objdump output for example ?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "2k",
    "tags": [
        "decompilation",
        "objdump"
    ],
    "user": "Bob5421",
    "time": "Aug 3, 2018 at 16:35",
    "comments": [
        {
            "user": "Twifty",
            "text": "<span class=\"comment-copy\">There is a utility called <code>snowman</code>, but I'd recommend against it. The biggest hurdle, I guess, for any ASM to C converter are the calling conventions.</span>",
            "time": null
        },
        {
            "user": "Thorbjørn Ravn Andersen",
            "text": "<span class=\"comment-copy\">I believe the general consensus is that raw machine code has too much information discarded to allow correctly deriving e.g. C code in all cases.   If you know the compiler generating the machine code you are looking at intimately, you may possibly use pattern recognition to figure out which part of the compiler generated each instruction and get more information that way.  In some cases that may be enough.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>No.</p>\n<p>IDA generates C-like pseudo code from <em>object code</em>. That is, the input to the decompiler is object code - not assembly language, which is represented in ASCII - and the output is a high-level language approximation.</p>\n<p>Note that assembly language is a human-readable mnemonic representation of object code operation codes (opcodes) and operands.</p>\n<p>Since decompilation is a major technical challenge, no Linux utilities have been developed to accomplish decompilation.</p>\n</div>",
            "votes": "2",
            "user": "julian",
            "time": "Aug 3, 2018 at 23:58",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Bob5421",
                    "text": "<span class=\"comment-copy\">In fact what i need is to replace esp offsets by a local variable name</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@Bob5421 then you should make a question about your <i>real</i> problem</span>",
                    "time": null
                }
            ]
        }
    ]
}