{
    "title": "How should I got about working out the format for this psp game?",
    "link": "https://reverseengineering.stackexchange.com/questions/19035/how-should-i-got-about-working-out-the-format-for-this-psp-game",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have been attempting to reverse engineer a format for a visual novel psp game ('Mirai Nikki RE: WRITE - 13 Ninme No Nikki Shoyuusha') and I have come to the understanding that the format works as a type of archive by looking at the boot.elf file of the game. From this decoded boot.elf file I learnt that music is stored in the format at3 (which is atrac3) and sound effects as fsb (fmod sound bank). There are multiple 'MIG' files which I believe are actually GIM files which is a format used by the PSP for images (these are likely the character portraits, backgrounds and ui). The string YKLZ is also repeated throughout the file and seems to act as a sort of file or directory end. The header T2FP also occurs.  </p>\n<p>After learning this I have hit a wall as I am unsure of how to progress in getting the files as I do not know how it is encrypted or where the files start and end. If anyone can tell me how I could go about reversing the decryption function in an emulator or can provide any help about the file it would be greatly appreciated.</p>\n<p><a href=\"https://www.dropbox.com/s/sa38i7asc699glv/ULJM05565.BIN?dl=0\" rel=\"nofollow noreferrer\" title=\"Decrypted boot.elf\">Decrypted boot.elf</a></p>\n<p><a href=\"https://www.dropbox.com/s/i2dxvjfo45dalfx/res.ptd?dl=0\" rel=\"nofollow noreferrer\" title=\"The game archive file\">The game archive file</a></p>\n<p>Edit: The hex code 87 4C 74 68 also occurs multiple times throughout the file.</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "365",
    "tags": [
        "file-format",
        "encryption",
        "decompile",
        "emulation"
    ],
    "user": "StevenHughes",
    "time": "Aug 11, 2018 at 16:41",
    "comments": [
        {
            "user": "dsasmblr",
            "text": "<span class=\"comment-copy\">Depending on the replies you receive here, I recommend inquiring on the <a href=\"http://forum.xentax.com\" rel=\"nofollow noreferrer\">XeNTaX</a> and/or <a href=\"http://zenhax.com\" rel=\"nofollow noreferrer\">ZenHAX</a> forums. Those two forums are dedicated to reversing file formats, especially in regards to video games.</span>",
            "time": null
        },
        {
            "user": "StevenHughes",
            "text": "<span class=\"comment-copy\">@dsasmblr Thanks for the suggestion, a post was made about the format before to zenhax but it didn't seem to get any good replies so if I don't get anything I'll try posting on both forums assuming it's not against the rules to create a thread that already existed.</span>",
            "time": null
        },
        {
            "user": "dsasmblr",
            "text": "<span class=\"comment-copy\">If that doesn't pan out for you, then you might want to delve into the PSP/Vita hacking scene and inquire. A good place to find people to inquire with might be the Henkaku Discord server: <a href=\"https://discord.gg/2bfq4XA\" rel=\"nofollow noreferrer\">discord.gg/2bfq4XA</a> There are primarily Vita hackers there, but they're a knowledgeable lot and should be able to point you in a good direction.</span>",
            "time": null
        },
        {
            "user": "StevenHughes",
            "text": "<span class=\"comment-copy\">@dsasmblr Thanks so much, I asked on XeNTaX but haven't got any answers yet so I'll wait an hour then try the discord.</span>",
            "time": null
        }
    ],
    "answers_data": []
}