{
    "title": "Why do we need to know the address of shellcode?",
    "link": "https://reverseengineering.stackexchange.com/questions/19162/why-do-we-need-to-know-the-address-of-shellcode",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have read many articles regarding the buffer overflow exploit. Everywhere its written as follow.</p>\n<blockquote>\n<p>\"It's difficult to know the starting address of the shellcode\"</p>\n</blockquote>\n<p>Why do we need to know the address of the shellcode? Why does stack not execute the shellcode as it is?</p>\n<p>say we inject our shellcode this way</p>\n<p><strong>our shellcode -- some padding -- our choice of saved return\naddress</strong></p>\n<p>should the shellcode not be executed by default by the stack? Why do we add NOP sleds and complicate things.</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "928",
    "tags": [
        "disassembly",
        "assembly",
        "gdb",
        "buffer-overflow",
        "shellcode"
    ],
    "user": "Sathyam Lokare",
    "time": "Aug 27, 2018 at 5:58",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">Can you link one of those articles? Maybe there's something specific there. I think with the current information you provide it's difficult to correctly answer your questions.</span>",
            "time": null
        },
        {
            "user": "nornor",
            "text": "<span class=\"comment-copy\">Following @perror answer, you can use address containing <code>0x90</code> as return address</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Exploiting a software by injecting a shellcode in its memory always requires the following steps:</p>\n<ol>\n<li><p>Have a way to inject your shellcode in memory (usually, it can take place in any buffer of the program).</p>\n</li>\n<li><p>Redirect the execution flow (i.e. be able to write on the <code>rip</code>) to point to the shellcode and execute it (usually, it is done through a buffer-overflow).</p>\n</li>\n</ol>\n<p>If you are not sure about the address of your shellcode, the second part of the exploitation (the redirection of the <code>rip</code>) cannot be achieved reliably.</p>\n</div>",
            "votes": "2",
            "user": "perror",
            "time": "Sep 17, 2024 at 9:10",
            "is_accepted": true,
            "comments": []
        }
    ]
}