{
    "title": "angr multiple reads same variable",
    "link": "https://reverseengineering.stackexchange.com/questions/19185/angr-multiple-reads-same-variable",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm writing a script to solve a binary that asks for multiple strings like the following c code,</p>\n<p>My problem I can't dump the 'second_pass, I just get \"first_pass\".\nprobably due of the use of the same variable to read input from. any help please</p>\n<pre><code>#include &lt;stdio.h&gt;\n\nint main()\n{\n    int i, lose = 1;\n    char first[20]=\"first_pass\", input[20];\n    scanf(\"%s\", input);\n    for(i=0; i &lt; strlen(first); i++)\n    {\n        if(first[i] != input[i])\n            lose = 0;\n    }\n\n    if(lose)\n        printf(\"gg\");\n    else\n        printf(\"fail\");\n\n\n    char second[20]=\"second_pass\";\n    scanf(\"%s\", input);\n    for(i=0; i &lt; strlen(second); i++)\n    {\n        //printf(\"%c = %c\\n\", second[i], input[i]);\n        if(second[i] != input[i])\n            lose = 0;\n    }\n\n    printf(\"\\n\");\n    if(lose)\n        printf(\"gg\");\n    else\n        printf(\"fail\");\n}\n</code></pre>\n<p>my angr script </p>\n<pre><code>import angr\nimport logging\n\n\n\nstart_at = 0x400550\n\nfail = (0x400681,0x400751)\nsuccess = (0x400680, 0x400740)\n\n\n\n\np = angr.Project(\"./a.out\", load_options={'auto_load_libs': False})\n\n\nstate = p.factory.blank_state(addr=addr_main)\n\npath = p.factory.path(state)\npathgroup = p.factory.path_group(path)\nprint \"Searching...\"\nfound_state = pathgroup.explore(find=success, avoid=fail)\n\nif found_state.found:\n    f = found_state.found[0].state\n\n    print \"Flag: %s\" % (f.posix.dumps(0)[0:20],)\n</code></pre>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "427",
    "tags": [
        "angr"
    ],
    "user": "soolidsnake",
    "time": "Aug 29, 2018 at 15:58",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><em>Since OP didn't specify the addresses referred to by the hardcoded offsets, I'm gonna assume his intention. I'm assuming the values in <code>find</code> match the two <code>printf(\"gg\")</code> statements and the two values in <code>avoid</code> match the two <code>printf(\"fail\");</code> statements.</em></p>\n<p>First of all, I believe your program has two unintentional considerable bugs in it, preventing the intended solutions from <em>being needed</em>:</p>\n<ol>\n<li>The first and more considerable of the two is the use of <code>lose</code> in your code. It is <em>sufficient</em> to only correctly provide <em>one</em> of the passwords to permanently set <code>lose</code> to <code>false</code>. Doing so using the first password means <code>lose</code> will be <code>false</code> for <em>both</em>, effectively reaching the two success criteria you specified. Simply put, because <code>lose</code> is not being reset to the default of <code>true</code> after the first password validation, is is enough to provide the first password to get two <code>gg</code>s.</li>\n<li>This one does not really interfere with solving the challenge but is also probably a bug. We'll go over why it's an issue for angr in a few paragraphs but for now I'll just point out your string comparison is lacking any validation for the correct length, or that the input string is terminated when the hardcoded password is.</li>\n</ol>\n<p>I find your example code quite interesting because those are two <em>relatively common</em> security vulnerabilities.</p>\n<p>Ignoring the first logical bug above, I believe the issue is your configured success criteria; According to <a href=\"https://docs.angr.io/docs/pathgroups.html\" rel=\"nofollow noreferrer\">angr documentation</a> (emphasis is mine):</p>\n<blockquote>\n<p>When launching <code>.explore()</code> with a <code>find</code> argument, execution will run until a state is found that matches the find condition, which can be the address of an instruction to stop at, a list of addresses to stop at, or a function which takes a state and returns whether it meets some criteria.</p>\n<p>When any of the states in the active stash match the <code>find</code> condition, they are placed in the found stash, <strong>and execution terminates</strong>. You can then explore the found state, or decide to discard it and continue with the other ones. You can also specify an <code>avoid</code> condition in the same format as <code>find</code>. When a state matches the <code>avoid</code> condition, it is put in the avoided stash, and execution continues. Finally, the <code>num_find</code> argument controls the number of states that should be found before returning, with a default of <code>1</code>. Of course, if you run out of states in the active stash before finding this many solutions, execution will stop anyway.</p>\n</blockquote>\n<p>Providing a sequence of addresses in <code>explorer</code>'s <code>find</code>, like you did, means either one is an acceptable success condition. Because you did not provide any <code>num_find</code> the default of <code>1</code> is assumed and <code>execute</code> returns with the <em>first success found</em>.</p>\n<p>Obviously, this is the success criteria for the first password. That is forced upon angr because the <code>avoid</code> parameter you provided. If the <code>avoid</code>  condition is reached the current exploration path is terminated, preventing any additional exploration down that path. In your case, providing an <code>avoid</code> of the failure of the first password means any paths failing the first password will be immediately discarded. Therefore, intentionally or not - thanks to your <code>avoid</code>, no path is possible that does reach a success in the first password test.</p>\n<p>There are several ways to properly solve this challenge and I'll go over them.</p>\n<h3>Increasing <code>num_find</code> to more than one result</h3>\n<p>One might think a proper solution could be to increase <code>num_find</code> to more than one, allowing more than one <code>found</code> states to be reached before <code>explorer</code> returns. That, however, is a mistake. Because your example code does not makes sure passwords are actually identical strings because there's no length validation and the null terminator is not compared, it appears any string <em>starting</em> with <code>\"first_pass\"</code> should be considered a valid solution. Interestingly enough, this accidently allows <em>more than one solution</em> (and in reality, quite a lot), so increasing <code>num_find</code> to any computationally feasible value will yield additional solutions to the first password, never reaching the second one.</p>\n<p>btw, to fix the erroneous password verification condition, you can either verify lengths match, use a string comparison function (such as <code>strcmp</code> and derivatives), or change the conditional from <code>&lt;</code> to <code>&lt;=</code> so it will include the null terminator.</p>\n<h3>separating the two tests</h3>\n<p>Since the two scenarios are completely independent of one another, you could run to executions. One for each password, setting a single <code>find</code> and <code>avoid</code> value for each, as well as setting the entry point for the second one. Splitting the two executions will effectively create a more simple set of constraints which should be executing faster. Of course, you can even run them in parallel to gain an additional performance advantage.</p>\n<h3>correctly specifying the success criteria</h3>\n<p>Although your values of <code>find</code> and <code>avoid</code> may initially seem correct, we've discussed several reasons why in reality they fail to accurately describe your intention. A more accurate specification of those parameters will be setting <code>avoid</code> to both <code>printf(\"fail\");</code> statements, as you did. However you'll need to remove the first <code>printf(\"gg\")</code> and only keep the second, as it won't be reached without passing both passwords (assuming the logical bug mentioned above is fixed).</p>\n</div>",
            "votes": "1",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}