{
    "title": "Find schema and info of MS SQL Server to which I have access to",
    "link": "https://reverseengineering.stackexchange.com/questions/19255/find-schema-and-info-of-ms-sql-server-to-which-i-have-access-to",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have access to an MS SQL Server DB and I'm able to run queries on the databases. <br/>\nBut the since the database is too big, with multiple tables and each table having many columns (whose names aren't descriptive), I don't know which data is where.</p>\n<p>I assumed I could use <code>nc</code> or <code>Wireshark</code> to listen to the port and learn from the backend about data in the DB (I have access to the frontend and the DB). But SQL server data traffic is encrypted. So I downloaded Microsoft Tools like <code>Microsoft SQL server manager</code> and <code>Microsoft Message Analyzer</code> and starting out. </p>\n<p><strong>Question</strong><br/>\nAre there ways to figure out \"which data is where\" in a DB?<br/>\nWhat must be my approach to understand the database?<br/></p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "41",
    "tags": [
        "tools",
        "mssql"
    ],
    "user": "clamentjohn",
    "time": "Sep 4, 2018 at 16:47",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If I am not mistaken (it's some time since I worked with MS SQL), SQL Server Manager has a feature to reconstruct the database schema, delivering an ER-Diagram, including references between the tables (foreign keys), Stored Procedures etc. This assumes you can connect to the db. Once you have the db schema, this will give you an insight into its structure, and how the tables cooperate. </p>\n</div>",
            "votes": "1",
            "user": "josh",
            "time": "Sep 4, 2018 at 20:11",
            "is_accepted": true,
            "comments": []
        }
    ]
}