{
    "title": "How do you store your data about a binary while performing analysis?",
    "link": "https://reverseengineering.stackexchange.com/questions/1937/how-do-you-store-your-data-about-a-binary-while-performing-analysis",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Since now, when I am analyzing a binary, I'm using a \"pen and paper\" method to locate the different location of the function, the different type of obfuscations, and all my discoveries. It is quite inefficient and do not scale at all when I try to analyze big binaries.</p>\n<p>I know that IDAPro is having a data-base to store comments and a memory zone, but, in case we do not want to use IDAPro, what techniques or (free) tools are you using to collect your notes and to display it properly ?</p>\n</div>",
    "votes": "13",
    "answers": 5,
    "views": "1k",
    "tags": [
        "tools",
        "binary-analysis"
    ],
    "user": "perror",
    "time": "Apr 27, 2013 at 14:17",
    "comments": [
        {
            "user": "perror",
            "text": "<span class=\"comment-copy\">Nothing really satisfactory since now... I tried all solutions proposed here but it didn't convinced me at all (nothing that nail once for all the pen &amp; paper method).</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"http://radare.org\" rel=\"noreferrer\">radare2</a> does support projects. They are not as sophisticated as IDAs .idb format, but they do the trick if saving patches and comments is all that you want.\n(Just make sure to build it from <a href=\"http://github.com/radare/radare2\" rel=\"noreferrer\">git</a>)</p>\n<p>Taken from the Radare2 Github README:</p>\n<blockquote>\n<h1>Webserver</h1>\n<p>radare2 comes with an embedded webserver that serves a pure html/js interface\nthat sends ajax queries to the core and aims to implement an usable UI for\nphones, tablets and desktops.</p>\n<pre><code>$ r2 -c=H /bin/ls\n</code></pre>\n</blockquote>\n<p><img alt=\"Radare2 Webserver vizualized on a mobile phone\" src=\"https://i.sstatic.net/yutKT.jpg\"/></p>\n</div>",
            "votes": "9",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">can you elaborate a little how it supports it for people unfamiliar with it?</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">@0xC0000022L: I was about to ask the exact same question!</span>",
                    "time": null
                },
                {
                    "user": "jvoisin",
                    "text": "<span class=\"comment-copy\">Every informations added by the user, like comments, flags, marks, patches, … can be saved as a <i>radare2 project</i>.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You know, there was talks before about coming up with some kind of standard to share RE notes on woodman forums, that would be nice. But I usually just try and stay as neat as possible using notepad, and for collaborative work, I use Google Docs as well. \nLately I have taken up using Evernote for collaborative work too, only because using Google docs requires me to use the web interface for their document format.</p>\n</div>",
            "votes": "5",
            "user": "gandolf",
            "time": "Apr 28, 2013 at 17:02",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Till",
                    "text": "<span class=\"comment-copy\">Using Evernote as well - I like the idea of having everything available on virtually all platforms I am using (OSX, Win, iOS). But then again, this really is super close to pen- and paper. I know GoogleDocs should do that as well but somehow I keep preferring native tools.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>When I work on a really complex project where I need to make a lot of structured notes, I often use <a href=\"http://tiddlywiki.com/\" rel=\"nofollow\">tiddly wiki</a>. The nice thing about it is that you can easily backup the wiki since it simply writes to its own html file.</p>\n<p>And of course <a href=\"https://drive.google.com\" rel=\"nofollow\">Google Docs</a>, which is especially useful if you're working collaboratively.</p>\n</div>",
            "votes": "4",
            "user": "newgre",
            "time": "Apr 27, 2013 at 9:58",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ange",
                    "text": "<span class=\"comment-copy\">I used both too.</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">It is quite close to what I call the \"pen and paper\" method... I am surprised that there is no killer-app to do such a thing !!!</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@perror: makes sense though, pen(cil) &amp; paper are way more flexible than what you'll see with a computer that has no stylus or something similar attached.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you can't/don't want to use IDAPro, perhaps you can/may want to use another automation tool. <a href=\"https://github.com/pfalcon/ScratchABit\" rel=\"nofollow\">ScratchABit</a> is an open-source, interactive, direct-manipulation(*) disassembler which stores all the information in simple text files, not a proprietary binary database. From these text files, the information can be easily extracted with simple scripts, or they can be stored in version control system to allow collaborative work, etc.</p>\n<p>Full disclosure: I'm the author of ScratchABit and it is work-in-progress project.</p>\n<p>(*) Direct manipulation means that you press a command key and immediately get a reaction, you don't need to type long commands with manually specified addresses and press Enter.</p>\n</div>",
            "votes": "1",
            "user": "pfalcon",
            "time": "Apr 18, 2015 at 18:24",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Currently I'm using TreeDBNotes, they have a free and pro version available.  I haven't compared it to any of the methods mentioned in other answers, but find it quite useful for keeping track of my project notes/data.</p>\n<p><a href=\"http://www.mytreedb.com\" rel=\"nofollow\">http://www.mytreedb.com</a></p>\n</div>",
            "votes": "0",
            "user": "Kalibr",
            "time": "Dec 17, 2015 at 19:00",
            "is_accepted": false,
            "comments": []
        }
    ]
}