{
    "title": "Are the names of COFF Data Directories fixed?",
    "link": "https://reverseengineering.stackexchange.com/questions/19396/are-the-names-of-coff-data-directories-fixed",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a PE file (notepad), the <code>NumberOfRvaAndSize</code> value in the COFF header is <code>0x10</code>, and there are 16 <code>DataDirectory</code> entries as expected.</p>\n<p>The <a href=\"https://docs.microsoft.com/en-us/windows/desktop/Debug/pe-format#optional-header-data-directories-image-only\" rel=\"nofollow noreferrer\">documentation</a> says that this value can change (though I've never seen it), which would mean there were greater than of fewer than 16 entries.</p>\n<p>Immediatly after there's a list of 16 data directories complete with names.</p>\n<ol>\n<li>Are these names just always the same, in that exact order?</li>\n<li>If there are fewer, will it always be whatever directories are at the end that will be missing?</li>\n<li>If there are greater than 16, what are they called?</li>\n</ol>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "90",
    "tags": [
        "windows",
        "pe",
        "file-format",
        "executable"
    ],
    "user": "BanksySan",
    "time": "Sep 19, 2018 at 11:50",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In short:</p>\n<ol>\n<li>Yes </li>\n<li>Correct</li>\n<li>You have to have a specification to know.</li>\n</ol>\n<p>The data directories are a fixed sparse array, and the meaning of each slot is defined by the specification, so (for example) the Export table is always the first entry, it can't move. If you don't have an Export table (but you do have other directories), then the <code>Size</code> and <code>VirtualAddress</code> fields will be zero.</p>\n<blockquote>\n<p>Note that the number of directories is not fixed. Before looking for a specific directory, check the NumberOfRvaAndSizes field in the optional header.</p>\n</blockquote>\n<p>So if the <code>NumberOfRvaAndSizes</code> member is 2, then you can look at the Export table and the Import table, but nothing else.</p>\n<p>Parsers are built against the specification, so if they encounter a PE file with a <code>NumberOfRvaAndSizes</code> value greater than what they know about, then they don't know what the data is or how to interpret it (and no way to find out by inspecting the PE file). Same goes for any Directory that is reserved or otherwise undocumented.</p>\n</div>",
            "votes": "3",
            "user": "josh poley",
            "time": "Sep 19, 2018 at 16:00",
            "is_accepted": true,
            "comments": []
        }
    ]
}