{
    "title": "replacing static value with variable",
    "link": "https://reverseengineering.stackexchange.com/questions/19474/replacing-static-value-with-variable",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to replace a static value:</p>\n<pre><code>MOV DWORD PTR SS:[EBP-30],4c\n</code></pre>\n<p>With a value from a specific address:</p>\n<pre><code>MOV DWORD PTR SS:[EBP-30],400400 // MOV DWORD PTR SS:[EBP-30],OFFSET 400400\n</code></pre>\n<p>But <code>SS:[EBP-30]</code> is not being set to the value from <code>0x400400</code>.</p>\n<p>I'm new to this but I was thinking this would work:</p>\n<pre><code>MOV DWORD PTR SS:[EBP-30],DWORD PTR DS:[400400]\n</code></pre>\n<p>But I guess it doesn't because <strong>ollydbg</strong> gives an error.</p>\n<p>The value from <code>0x400400</code> is <code>int 100</code> or <code>64 00 00 00</code>. Why doesn't it work? And what are my options? </p>\n<p>I was also thinking of doing something like:</p>\n<pre><code>MOV ECX,DWORD PTR DS:[400400]\nMOV DWORD PTR SS:[EBP-30],ECX\n</code></pre>\n<p>But I don't know how to add a new line of instruction in <strong>ollydbg</strong> I was also afraid it would change all the addresses.</p>\n</div>",
    "votes": "4",
    "answers": 2,
    "views": "613",
    "tags": [
        "disassembly",
        "ollydbg",
        "pointer"
    ],
    "user": "majidarif",
    "time": "Sep 27, 2018 at 18:04",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Let's split this up a bit. I'll skip over some stuff that you might already understand, but we may need to expand this if some stuff is not clear.</p>\n<hr/>\n<blockquote>\n<p>MOV DWORD PTR SS:[EBP-30],400400</p>\n<p>MOV DWORD PTR SS:[EBP-30],DWORD PTR DS:[400400]</p>\n</blockquote>\n<p>The syntax is a bit wonky but we can understand that you want to encode a <code>MOV</code> with two memory operands.\nLet's take a look at some documentation</p>\n<p>Ref: <a href=\"https://www.felixcloutier.com/x86/MOV.html\" rel=\"noreferrer\">https://www.felixcloutier.com/x86/MOV.html</a></p>\n<p>There is no possible encoding for <code>MOV</code> that accepts <code>m32,m32</code>. With <code>m32</code> understood to be a 32 bit pointer.</p>\n<p>It's not obvious this is the case, but unfortunately it is.</p>\n<p>Ref: <a href=\"https://stackoverflow.com/a/33799523/10279341\">https://stackoverflow.com/a/33799523/10279341</a></p>\n<p>This is a good answer if you care about <em>why</em>, but it is supplemental reading only, not critical to this situation.</p>\n<hr/>\n<p>So, if we want to copy memory to memory with x86:</p>\n<p>Ref: <a href=\"https://stackoverflow.com/a/1299094/10279341\">https://stackoverflow.com/a/1299094/10279341</a></p>\n<p>A commonly accepted solution is to use a register as a temporary value store.</p>\n<p>Take note that we need to save the state of the register we are using else we might accidentally alter the program state.</p>\n<blockquote>\n<p>MOV ECX,DWORD PTR DS:[400400]</p>\n<p>MOV DWORD PTR SS:[EBP-30],ECX</p>\n</blockquote>\n<p>So this is on the right track. But we need to save <code>ECX</code> beforehand in case something else is using it.</p>\n<pre><code>0x00000000: 51                  push ecx\n0x00000001: 8b 0d 00 04 40 00   mov ecx, dword ptr [0x400400]\n0x00000007: 89 4d e2            mov dword ptr [ebp - 0x1e], ecx\n0x0000000a: 59                  pop ecx\n</code></pre>\n<p>This should do that you want. We save <code>ECX</code> by pushing it onto the stack. Load the value at address <code>0x400400</code> into <code>ECX</code>. Then write the value of <code>ECX</code> into the memory at <code>[EBP-0x1E]</code>, then restore <code>ECX</code> to it's previous value.</p>\n<hr/>\n<p>So how do we patch this into the binary image?</p>\n<p>The above assembly is 11 bytes in length and our goal is to alter the instruction</p>\n<p><code>0:  c7 45 e2 4c 00 00 00    mov    DWORD PTR [ebp-0x1e],0x4c</code></p>\n<p>Which we can see is 7 bytes long.</p>\n<p>We can get these extra 4 bytes by use of a \"code cave\". We will redirect execution into an unused bit of memory, execute our code, then jump back.</p>\n<p>Ref: <a href=\"https://www.codeproject.com/Articles/20240/The-Beginners-Guide-to-Codecaves\" rel=\"noreferrer\">https://www.codeproject.com/Articles/20240/The-Beginners-Guide-to-Codecaves</a></p>\n<p>In short, we're looking \"empty space\" that is allocated/mapped within the exe image, preferably in the .text section, but are not used by the program <em>under any circumstances</em>. This will occur in nearly every executable image due to SectionAlignment in Windows PE being 4096 by default.</p>\n<p>The easiest way to implement this is to find unused bytes in the same region of memory that we are trying to modify.</p>\n<p>A rudimentary way of finding/applying a code cave with ollydbg is shown here:</p>\n<p><a href=\"https://medium.com/@vysec.private/backdoor-101-f318110e1fcb\" rel=\"noreferrer\">https://medium.com/@vysec.private/backdoor-101-f318110e1fcb</a></p>\n<hr/>\n<p>After finding suitable memory for our cave, patch in the shellcode:</p>\n<pre><code>0x00000000: 51                  push ecx\n0x00000001: 8b 0d 00 04 40 00   mov ecx, dword ptr [0x400400]\n0x00000007: 89 4d e2            mov dword ptr [ebp - 0x1e], ecx\n0x0000000a: 59                  pop ecx\n</code></pre>\n<p>using ollydbg's assembler.</p>\n<p>Then change the original instruction of <code>mov DWORD PTR [ebp-0x1e],0x4c</code> to <code>JMP x</code> where <code>x</code> is your shellcode address, in the same module/image.</p>\n<p>Overwrite the rest of the instruction bytes with 0x90 (NOP) if you want. So that we end up with:</p>\n<p><code>c7 45 e2 4c 00 00 00</code> - Original instruction</p>\n<p><code>e9 xx xx xx xx 90 90</code> - JMP rel32 plus 2 NOPs</p>\n<p>Ref for x86 JMP: <a href=\"https://c9x.me/x86/html/file_module_x86_id_147.html\" rel=\"noreferrer\">https://c9x.me/x86/html/file_module_x86_id_147.html</a></p>\n<p>after <code>pop ecx</code> back in our code cave assemble: <code>JMP y</code></p>\n<p>where <code>y</code> is the address of the instruction directly after <code>mov DWORD PTR [ebp-0x1e],0x4c</code>. You should end up skipping over the NOP instructions when jumping out of the code cave, which is why I said they were optional.</p>\n<hr/>\n<p>Summary,</p>\n<ol>\n<li><p>Assemble our shellcode, making note of correct x86 ASM and preserving program state.</p>\n</li>\n<li><p>If not enough space to patch the instruction in-line, idenfity a code cave.</p>\n</li>\n<li><p>Apply the code-cave and assemble the two <code>JMP</code> instructions to redirect execution (1) to the code-cave, (2) back to the <em>next</em> instruction from the original code.</p>\n</li>\n</ol>\n</div>",
            "votes": "6",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "majidarif",
                    "text": "<span class=\"comment-copy\">does it matter that the value I'm trying to read is only 1-100? like the value is maxed at 100. so technically I can get away with reading it as a single byte.</span>",
                    "time": null
                },
                {
                    "user": "Abigail",
                    "text": "<span class=\"comment-copy\">it won't matter unless the bytes around the value are changed. eg 0x400401, 0x400402, contain other values not part of the value. <code>dword ptr [0x400400]</code> will read 4 bytes (little-endian) starting at <code>0x400400</code>. if you change it to <code>byte ptr</code>, it will only read the one byte.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Memory-to-memory <code>MOV</code> does not exist. You could try the following:</p>\n<pre><code>    MOV eax, DWORD PTR DS : [400400]\n    MOV DWORD PTR SS : [EBP - 30], eax\n</code></pre>\n<p>Please check also if the absolute numbers are interpreted as hex values in your assembler.</p>\n</div>",
            "votes": "1",
            "user": "josh",
            "time": "Sep 27, 2018 at 14:26",
            "is_accepted": false,
            "comments": [
                {
                    "user": "majidarif",
                    "text": "<span class=\"comment-copy\">I was actually thinking of this but how do I do it in ollydbg? I'm not sure how to add a new line of instructions and it might change all the addresses?</span>",
                    "time": null
                },
                {
                    "user": "josh",
                    "text": "<span class=\"comment-copy\">If your intent is to patch an existing code, and the patch needs more bytes than the replaced code, you must be sure that either the code in the additional space is not needed any more, or you could insert (i.e. patch) a jmp to a free memory location, re-insert the \"destroyed\" code and jmp back to the original code where it can continue like before the patch. With respect to Olly, I don't know the answer, because I usually work in Ida.</span>",
                    "time": null
                },
                {
                    "user": "majidarif",
                    "text": "<span class=\"comment-copy\">Thank you. Unfortunately although I think I get what you meant. I'm really new to this to know how to do it. When you say JMP to an free memory location. Do I replace the current instructions with JMP then use that to do those instructions are return back? But, how do I do that exactly? And how do I find a free memory?</span>",
                    "time": null
                },
                {
                    "user": "josh",
                    "text": "<span class=\"comment-copy\">I think you got it right. How you do it technically depends. Try to become proficient with your tools. One possibility would be to create the machine code (usually not by hand, but from an assembler), then patch it in the exe file and test it in your debugger. Often the tricky part is to find a free mem location, large enough, and to not introduce new errors, by e.g. relying on absolute mem addresses (try to understand what \"ASLR\" means) etc. No standard recipes exist.</span>",
                    "time": null
                }
            ]
        }
    ]
}