{
    "title": ".NET assembly IDA PRO, using LDSTR IL op code, how to patch a string?",
    "link": "https://reverseengineering.stackexchange.com/questions/19489/net-assembly-ida-pro-using-ldstr-il-op-code-how-to-patch-a-string",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to patch a string. So right now I'm trying to replace instruction <code>LDSTR</code> with <code>LDSTR</code> \"mystring\"; however, I have been unsuccessful. After assembling the <code>LDSTR</code> op code, I don't quite understand what comes after: a pointer address to the string or raw string bytes?</p>\n<pre><code>ldstr \"Test\";\nstloc.0\nldloc.0\nret\n</code></pre>\n<p>This is what I'm trying to achieve. Thanks! </p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "2k",
    "tags": [
        "ida",
        "disassembly",
        "assembly",
        "hexrays",
        ".net"
    ],
    "user": "Alex Maher",
    "time": "Oct 2, 2018 at 1:06",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The opcode contains a number that is called <code>mdToken</code>. User-defined strings are located in Storage Stream that is called <code>#US</code>. You can find those while inspecting the file sections.</p>\n<p><a href=\"https://i.sstatic.net/wdNQx.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/wdNQx.png\"/></a></p>\n<p>There's a great series of article on .NET assembly by Simon Coop - <a href=\"https://www.red-gate.com/simple-talk/blogs/anatomy-of-a-net-assembly-clr-metadata-1/\" rel=\"nofollow noreferrer\">Anatomy of a .NET Assembly</a> that should explain more of the internals of .NET assemblies.</p>\n</div>",
            "votes": "1",
            "user": "Paweł Łukasik",
            "time": "Sep 30, 2018 at 21:17",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'd like to add a couple of comments on top of Pawel's great an concise answer.</p>\n<p>First of all, IDA doesn't easily enable editing executables, so you should find another, more appropriate tool, for that task. In the case of replacing constant strings any decent hex editor will do the trick.</p>\n<p>Secondly, please let me go over the different instructions, one by one:</p>\n<blockquote>\n<p>ldstr \"Test\"</p>\n</blockquote>\n<p>The <code>ldstr</code> instruction loads the string object in the first argument to the top of the stack.</p>\n<blockquote>\n<p>stloc.0</p>\n</blockquote>\n<p>The <code>stloc</code> instruction pops a single item from the stack and stores it in a register, according to it's index. In this case, register index 0.</p>\n<blockquote>\n<p>ldloc.0</p>\n</blockquote>\n<p>Similarly, <code>ldloc</code> stores a value from a register according to supplied index at the top of the stack. In this case, again, register indexed 0 is used.</p>\n<blockquote>\n<p>ret</p>\n</blockquote>\n<p>This instruction returns to the current function's caller.</p>\n<p>As a stack based instruction-set (opposed to a register-based instruction set, for which examples are x86, arm, powerpc, etc...) the stack is frequently used of passing data around in instances where a register-based instruction set will enable register use. This is not to say you <em>cannot</em> use registers or stack for most functionalities in one or the other, but just that the instruction set makes it more native and natural to use either the stack of the registers.</p>\n<p>The last paragraph is important for us to understand the nature of the provided function, which simply <em>returns</em> the provided string. As a stack-based instruction set, CIL's calling convention dictates that variables are returned on the stack (and not a designated register). Interestingly, this therefore implies the <code>stloc.0</code> and <code>ldloc.0</code> can simply be optimized out.</p>\n</div>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Sep 30, 2018 at 23:39",
            "is_accepted": false,
            "comments": []
        }
    ]
}