{
    "title": "how to find private Key and passphrase stored inside a program?",
    "link": "https://reverseengineering.stackexchange.com/questions/19523/how-to-find-private-key-and-passphrase-stored-inside-a-program",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are some files (drivers) that are encrypted, and these files are working in a program that is installed in my computer. The program using these files needs to decrypt them. I am sure that the private key and passphrase are stored inside the program in my computer. Meanwhile, there is no file for the private key! Everything is stored inside the program. I know that the program for decrypting those files is using OpenSSL libraries (Libeay32.dll).</p>\n<p>Q: How can I capture the passphrase and private key that are stored in the program?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "886",
    "tags": [
        "windows",
        "encryption",
        "decryption"
    ],
    "user": "jig4r",
    "time": "Oct 3, 2018 at 20:43",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First of all, it is quite unlikely that the key has a passphrase. Passphrases are used to defend against stolen key assets, but since the key asset is embedded inside the program together with any passphrase, this is redundant. Therefore I will not assume there's a passphrase.</p>\n<p>Now, to your main question. <code>libeay32.dll</code> exports many encryption related functions, and those are presumably used by said program. Without any more specifics, I'd suggest you search for the functions imported into the program from <code>libeay32.dll</code>.</p>\n<p>Depending on the algorithm used (my first bet would be AES) to decrypt the files, several different functions will be called. The one you're interested in, that loads / initializes a key, a common such API is <a href=\"https://www.openssl.org/docs/manmaster/man3/EVP_CIPHER_CTX_new.html\" rel=\"nofollow noreferrer\"><code>EVP_CIPHER_CTX_new</code></a> which allocates a new <em>symmetric</em> encryption/decryption context, which will then be used in a function such as <a href=\"https://www.openssl.org/docs/man1.1.0/crypto/EVP_DecryptInit_ex.html\" rel=\"nofollow noreferrer\"><code>EVP_DecryptInit</code> or <code>EVP_DecryptInit_ex</code></a> which will actually accept the <code>key</code> and <code>iv</code> parameters.</p>\n<p>Without reviewing the APIs imported, it is quite hard to list the possible key-initialization functions you may be looking for. For example, <a href=\"https://www.openssl.org/docs/manmaster/man3/EVP_PKEY_decrypt_init.html\" rel=\"nofollow noreferrer\"><code>EVP_PKEY_decrypt_init</code></a> will be an equivalent function used for public key decryption (which could also be used in your case, if for some  reason author decided to use asymmetric cryptography).</p>\n<p>Once you identify the key initialization function, this should be a matter of tracking the values put into the <code>key</code> and <code>iv</code> parameters. A hardcoded string will be easy to find while a more complex key-generation flow (maybe using a hash function?) could be used. In the case of file decryption, it is unlikely that the key is not <em>deterministic</em> so it should be easy enough.</p>\n<p>If you wish to manually decrypt the files, there are other important parameters except the <code>key</code> and <code>iv</code>. The encryption algorithm, mode of operation, block size, etc...</p>\n</div>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Oct 3, 2018 at 21:03",
            "is_accepted": false,
            "comments": [
                {
                    "user": "jig4r",
                    "text": "<span class=\"comment-copy\">Thanks, the problem is that it is not clear which function is used for decryption ? there are more than 4000 function inside of the Libeay32.dll for using encryption and decryption !</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">How many of those are <i>imported</i> by your binary?</span>",
                    "time": null
                },
                {
                    "user": "jig4r",
                    "text": "<span class=\"comment-copy\">dear nirizr, It seems none of functions are used for decryption! when the program wants to run the libeay32.dll is needed but after that I removed the Dll and program still is working well.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">What do you mean by \"removed the dll\"? What functions <i>are</i> being used? You'll need to go over them and use common sense.</span>",
                    "time": null
                },
                {
                    "user": "jig4r",
                    "text": "<span class=\"comment-copy\">I mean how I can find a Function which is reading Private key and Passphrase ? after running my Program, I delete libeay32.dll to find out if my program is using libeay32.dll or not ? I figure out It works without libeay32.dll ! Any way my problem is to find out which function, read the private key and passphrase ? tnx for replying</span>",
                    "time": null
                }
            ]
        }
    ]
}