{
    "title": "How to step to specific function call?",
    "link": "https://reverseengineering.stackexchange.com/questions/19549/how-to-step-to-specific-function-call",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm reverse engineering an application and I identified a specific function call that has an output that I need to capture. For the actual capture, I'll do a memory dump, so that I can handle. However, I used rohitab's API Monitor to see the function call, but I'm having a hard time identifying it in a debugger. I'd like to use x64dbg since that's what I'm trying to learn, but IDA/Olly/Win all work. Any help is much appreciated!</p>\n<p>I included an image that shows the function call and the call stack. The one highlighted in blue is the one I'm trying to step to. Once I can step to it and have the debugger pause the process, I can issue a memory dump.</p>\n<p><a href=\"https://i.sstatic.net/UN1JD.png\" rel=\"nofollow noreferrer\"><img alt=\"API Monitor\" src=\"https://i.sstatic.net/UN1JD.png\"/></a> </p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "10k",
    "tags": [
        "function-hooking",
        "x64dbg"
    ],
    "user": "Axel Munoz",
    "time": "Oct 5, 2018 at 12:19",
    "comments": [
        {
            "user": "user202729",
            "text": "<span class=\"comment-copy\">You want to find the function in the debugger? See <a href=\"https://reverseengineering.stackexchange.com/questions/17874/\">reverseengineering.stackexchange.com/questions/17874</a></span>",
            "time": null
        },
        {
            "user": "Axel Munoz",
            "text": "<span class=\"comment-copy\">@user202729, thanks for that reference! It looks like it mainly worked. The blue marked out portion in the higlighted field in my image is the name of the executable, call it foo.exe. When I find the same function in x64dbg it's referenced to an <code>advapi32.dll</code>. (As well as other functions from foo.exe all come from <code>advapi32.dll</code>), why is this?</span>",
            "time": null
        },
        {
            "user": "mrexodia",
            "text": "<span class=\"comment-copy\">For x64dbg you can press Ctrl+G and type “CryptDecrypt” which should bring you to the function. Then you can set a breakpoint there with F4. I think in this tool you are using it shows which module calls the function, not in which module the function is...</span>",
            "time": null
        }
    ],
    "answers_data": []
}