{
    "title": "IdaPython Get Call Destination for Register Operand",
    "link": "https://reverseengineering.stackexchange.com/questions/19607/idapython-get-call-destination-for-register-operand",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to determine the destination address for call instructions. I can get this for calls that use an immediate but not for a call to an immediate-assigned register. How can I get the address of the function being called in a situation like this when Ida has inserted a pink comment with funcName?</p>\n<pre><code>mov eax, funcName\n...\ncall eax ; funcName\n</code></pre>\n</div>",
    "votes": "2",
    "answers": 2,
    "views": "2k",
    "tags": [
        "ida",
        "idapython"
    ],
    "user": null,
    "time": "Oct 12, 2018 at 19:31",
    "comments": [
        {
            "user": "NirIzr",
            "text": "<span class=\"comment-copy\">How do you get the name where the call is immediate?</span>",
            "time": null
        },
        {
            "user": "user25971",
            "text": "<span class=\"comment-copy\">I get the address of the <code>extrn</code> line when the call is immediate by getting the instruction's <code>Operands[1].value</code></span>",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "<span class=\"comment-copy\">Could you perhaps include a full example as part of your question?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>IDA has a specific mechanism for storing and reading references (either code, data or both) to and from a specific instruction. That mechanism works whenever IDA successfully resolves a reference, which may not always be the case (think of <code>call eax</code> where <code>eax</code> is not easily resolved staticly). You should use that interface for all types of calls.</p>\n<p>The function that best suits your use case is probably <a href=\"https://github.com/idapython/src/blob/master/python/idautils.py#L68\" rel=\"nofollow noreferrer\"><code>idautils.CodeRefsFrom</code></a> which accepts two parameters <code>ea</code> and <code>flow</code> and returns a generator for all code references from given <code>ea</code>. <code>flow</code> is a boolean used to control whether you wish the next instruction included.</p>\n<p>There are a bunch of other related functions, such as <code>CodeRefsTo</code>, <code>DataRefsFrom</code>, <code>XrefsTo</code>, etc... </p>\n</div>",
            "votes": "2",
            "user": "NirIzr",
            "time": "Oct 12, 2018 at 19:02",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Either you use a debugger like OllyDbg and set a breakpoint at the location where the call is. Or you're looking at the previous code at the location where  <code>funcName</code> is written. If it is written dynamically, you go best with using a debugger. </p>\n</div>",
            "votes": "0",
            "user": "pudi",
            "time": "Oct 12, 2018 at 15:28",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user25971",
                    "text": "<span class=\"comment-copy\">Since Ida has already analyzed where the registers are set with immediate function addresses, is there a way to get the value without looking at the previous instructions or using a debugger?</span>",
                    "time": null
                },
                {
                    "user": "pudi",
                    "text": "<span class=\"comment-copy\">How should this work? If the function address is loaded dynamically, for example with loading a library and then the address of an exported function via getProcAddress. IDA Pro can not predict where the function will be located. Or am I missing something?</span>",
                    "time": null
                },
                {
                    "user": "user25971",
                    "text": "<span class=\"comment-copy\">I have call instructions that call an address which Ida has labeled with the function name. The actual call address which I am trying to get just contains <code>extrn funcName</code></span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Since IDA has that data available I believe OP just wanted to get it from IDA directly, without extracting the value from the register. The question was specifically for the <code>mov eax, &lt;immediate&gt; / call eax</code> couple lines.</span>",
                    "time": null
                }
            ]
        }
    ]
}