{
    "title": "getting %localappdata% in asm",
    "link": "https://reverseengineering.stackexchange.com/questions/19637/getting-localappdata-in-asm",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have an old windows x86 application that no longer works properly since windows 8. This app creates files within its own folders for things like app settings. Unfortunately, Microsoft no longer allows this and I am forced to execute my app with admin permission so it can create those files within its folder in <code>Program Files (x86)</code>. </p>\n<p>Now I was wondering if I can patch it by changing the directory of instead creating the files in the current directory it will instead create it at <code>%localappdata%\\MyApp\\</code>.</p>\n<p>I know the address of the code that creates the files and I know it uses the <code>freopen</code> function with <code>r+</code> or <code>wb</code> modes.</p>\n<p>I have tried editing the path directly with a hex editor from <code>Data\\Display\\OptionData.opf</code> to <code>%localappdata%\\MyApp\\od.opf</code> but that didn't work.</p>\n<p>What are my options? I am new to assembly and reverse engineering but I really want to fix this without injecting a DLL and detouring the function. (my issue with detours is it sometimes gets false positive as virus by some AV)</p>\n<p>I'm now thinking of doing a codecave. But like I said I need to change the directory to the localappdata directory. How do I do this? (and supporting as far back as winxp upto latest win10)</p>\n<p>I understand in code (c++) this will work:</p>\n<pre><code>char* appdata = getenv(\"APPDATA\"); // wont work with winxp\n</code></pre>\n<p>or even:</p>\n<pre><code>LPTSTR GetSpecialFolder(int CSIDL) {\n    TCHAR szPath[MAX_PATH];\n\n    if (SUCCEEDED(SHGetFolderPath(NULL, CSIDL | CSIDL_FLAG_CREATE, NULL, 0, szPath)))\n    {\n        PathAppend(szPath, TEXT(\"\\\\MyApp\\\\\"));\n        CreateDirectory(szPath, NULL);\n\n        return szPath;\n    }\n    else {\n        return TEXT(\"\");\n    }\n}\n</code></pre>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "78",
    "tags": [
        "disassembly",
        "windows",
        "assembly",
        "x86",
        "patching"
    ],
    "user": "majidarif",
    "time": "Oct 16, 2018 at 12:20",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">RE.SE is not for software development questions, actually. Have you considered using the <code>USERPROFILE</code> variable instead of <code>APPDATA</code>? That one would exist also on XP and earlier and all you seem to aim for is a writable location, right?</span>",
            "time": null
        },
        {
            "user": "majidarif",
            "text": "<span class=\"comment-copy\">Yes, a writable location. I do think this question fits right here. I'm reverse engineering an app I have no source code for. I'm trying to create a codecave to replace the filepath. My question really is how do I do <code>char* appdata = getenv(\"APPDATA\");</code> in assembly.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">that's my point. While you're doing this as part of a reverse engineering project, perhaps, the task of writing a certain piece of C code in assembly better fits on StackOverflow. But I'll leave it to the community to decide, especially since for a codecave special limitations apply.</span>",
            "time": null
        },
        {
            "user": "Biswapriyo",
            "text": "<span class=\"comment-copy\">Don't patch the executable. Instead make a symbolic link from that folder to a <code>LocalAppData\\foo\\bar</code> where user has r/w permission.</span>",
            "time": null
        }
    ],
    "answers_data": []
}