{
    "title": "new process id generated during gdb debug",
    "link": "https://reverseengineering.stackexchange.com/questions/19644/new-process-id-generated-during-gdb-debug",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I debug a ELF32 executable in Ubntu 14, I set gdb breakpoint in main, after i click run, the program generate a new process 13050 and exited, I can't use info register to display value and continue debugging.</p>\n<p>how to deal with such situation, thanks</p>\n<hr/>\n<p>Thanks for the reply, let me give more details, program abc is  ELF32 file, it is currently running as process 10220, when i use gdb abc, break main, run, it kills itself ( process 10220) and generate a new process 13050, and this new pid is with another file name xyz.  when i display info register or disassembly, whenever i set set follow-fork-mode  to parent or child, it says program not exist in gdb. any advice? </p>\n<p>in short, abc becomes xyz and abc is deleted by program, any solution?</p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "760",
    "tags": [
        "gdb"
    ],
    "user": "Jolin Wong",
    "time": "Oct 18, 2018 at 1:22",
    "comments": [
        {
            "user": "user22970",
            "text": "<span class=\"comment-copy\">Can you supply the executable? i'd like to try it locally and see the errors that pop</span>",
            "time": null
        },
        {
            "user": "Jolin Wong",
            "text": "<span class=\"comment-copy\">how to supply attachment? in this forum, we can only enter plain text, no photo and attachment</span>",
            "time": null
        },
        {
            "user": "user22970",
            "text": "<span class=\"comment-copy\">just upload it to a file sharing site and put the link in the question. something like <a href=\"https://www.filedropper.com/\" rel=\"nofollow noreferrer\">filedropper.com</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The common way to create a new process in linux (and the only one i know of) is using <code>fork</code> and <code>exec</code>.<br/>\nWhen you fork the process, you create a copy of the current process with a new pid, which is passed to the parent (fork caller) - that's how you know how the parent and who the child process are.</p>\n<p>To debug child process you can <a href=\"https://sourceware.org/gdb/onlinedocs/gdb/Forks.html\" rel=\"nofollow noreferrer\">follow the fork</a>.<br/>\nNote that you can choose to keep either the parent or the child suspended while under the control of gdb but you can only debug one of them with the same instance of gdb.</p>\n<p>The usage of it will be (as seen on the <a href=\"https://sourceware.org/gdb/onlinedocs/gdb/Forks.html\" rel=\"nofollow noreferrer\">link</a>):</p>\n<pre><code>set follow-fork-mode [parent/child]\n</code></pre>\n<p>parent = default; you will keep debugging the parent<br/>\nchild = you will start debugging the child</p>\n<pre><code>set detach-on-fork [on/off]\n</code></pre>\n<p>on = detach the process you don't debug<br/>\noff = keep the non-debugee process suspended under the control of the same instance of gdb</p>\n</div>",
            "votes": "4",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There should be a small window between the new process start and the first break point  hit. So the trick is to collect the new pid with a shell script, feed that <em>pid</em> to a <code>gdb</code> command file and then rapidly repeat the command file during the window.</p>\n<p>For example, you can use <em>pidof</em> to get the <em>pid</em> of your program:</p>\n<pre><code>echo \"attach $(pidof &lt;program&gt;)\" &gt; attach_pid\n</code></pre>\n<p>Note that the <em>pidof</em> would pick up a defunct'ed process if there is one.</p>\n<p>Under the Unix shell, create an executable file containing the above Unix command. Name it <code>attach.sh</code>.</p>\n<p>Next, defined a <code>gdb</code> user defined command:</p>\n<pre><code>define a\nshell . ./attach.sh\nsource attach_pid\nend\n</code></pre>\n<p>Define a long command name will just slow you down.</p>\n<p>When everything is ready, trigger the program, and quickly during the window for re-attach, just hit <kbd>a</kbd> and press <kbd>Enter</kbd> down until <code>gdb</code> attaches to the process.  Note that a return will repeat the previous command and hold on the Enter key will soon generate a rapidly repeated key stroke.  Also note that when the new <em>pid</em> is not created yet, the <em>attach_pid</em> just contains <code>\"attach \"</code> and gives error messages.</p>\n</div>",
            "votes": "1",
            "user": "perror",
            "time": "Mar 13, 2020 at 12:51",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Remin Lin",
                    "text": "<span class=\"comment-copy\">Correction. The pid collection script should be \"echo \"attach $(pidof  program_name)\" &gt; attach_pid</span>",
                    "time": null
                }
            ]
        }
    ]
}