{
    "title": "How can I debug or monitor a Windows Phone 8 application?",
    "link": "https://reverseengineering.stackexchange.com/questions/1977/how-can-i-debug-or-monitor-a-windows-phone-8-application",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm interested in debugging and monitoring a Windows Phone 8 application for which I do not have the source code. Android and iOS can both be rooted/jailbroken, which allows me to use tools like GDB (and others) to debug and monitor a running application, but I'm not aware of anything similar for Windows Phone 8.</p>\n<p>Additionaly I want to monitor filesystem activity while running the application (I use <a href=\"http://www.newosxbook.com/src.jl?tree=listings&amp;file=3-filemon.c\">Filemon for iOS</a> for this task on iOS). Or is it easier to simply run the application in the Windows Phone 8 simulator and attempt to monitor the app that way?</p>\n<p>How do you debug a Windows Phone 8 application without source code?</p>\n</div>",
    "votes": "14",
    "answers": 1,
    "views": "3k",
    "tags": [
        "windowsphone"
    ],
    "user": "Mick",
    "time": "May 1, 2013 at 16:57",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<h2>With source</h2>\n<p>You could use something like <a href=\"http://research.sensepost.com/tools/mobile/xapspy\">XAPSpy</a> and <a href=\"https://github.com/andreycha/tangerine\">Tangerine</a> on Github which is updated to work with WP8. It may work without source not sure.</p>\n<p>XAPSpy Source: <a href=\"https://github.com/sensepost/XAPSpy\">Github</a>. </p>\n<h2>Without source</h2>\n<p>Something more advanced is need something more like <a href=\"http://www.securityninja.co.uk/application-security/windows-phone-app-analyser-v1-0-released-today-2/\">Windows Phone App Analyser</a> </p>\n<p>Download/Source: <a href=\"http://sourceforge.net/projects/wpaa/\">SourceForge</a></p>\n<p>I would imagine you could use them both together by decompliling the .xap you are working with with WPPA and then using XAPSpy on that source. I've never tried that though.</p>\n<p>Sadly if you are dealing with a newer app you won't be able \nto decompile it as <a href=\"http://forum.xda-developers.com/showthread.php?t=2140706\">they are encrypted</a>. You might be able to somehow get the keys out of the operating system but that would be difficult as well.</p>\n<p>Here is a set of slides on the topic: <a href=\"http://www.slideshare.net/AndreyChasovskikh/inspection-of-windows-phone-applications\">Inspection of Windows Phone Applciations</a> that goes into some detail about tangerine.</p>\n</div>",
            "votes": "7",
            "user": "cb88",
            "time": "May 9, 2013 at 20:06",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Mick",
                    "text": "<span class=\"comment-copy\">These tools are only for Windows Phone 7 (according to their respective websites). I am interested in Windows Phone 8 application analysis/monitoring.</span>",
                    "time": null
                },
                {
                    "user": "cb88",
                    "text": "<span class=\"comment-copy\">I expect they are the same except for the fact that WP8 .xap are encrypted in which case you are out of luck. While the kernel and such are very different the userspace is probably alot the same between WP7 and WP8.</span>",
                    "time": null
                },
                {
                    "user": "cb88",
                    "text": "<span class=\"comment-copy\">Found one that works with WP8 for sure clearly it is a problem that is actively being worked on. Supposedly Tangerine can remove the signage.. so perhaps that is how they can get hooks into the app?</span>",
                    "time": null
                }
            ]
        }
    ]
}