{
    "title": "Is there a way to get an instruction count with Radare2?",
    "link": "https://reverseengineering.stackexchange.com/questions/19836/is-there-a-way-to-get-an-instruction-count-with-radare2",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Let's say I want to find out how many instructions an arbitrary function <code>foo</code> decodes to, is there an easy way to do this?</p>\n<p>I'm trying to check against a version I am compiling with a stored binary on the system. It takes more work than I'd like to spend to test to see if the binary has changed as I muck with the compile options. I'm trying to optimize for fewer instructions.</p>\n</div>",
    "votes": "0",
    "answers": 2,
    "views": "880",
    "tags": [
        "radare2"
    ],
    "user": "Evan Carroll",
    "time": "Nov 7, 2018 at 8:02",
    "comments": [
        {
            "user": "user2347953",
            "text": "<span class=\"comment-copy\">Out of curiosity, why are you optimizing for smallest instruction count? In many ISAs (e.g. x86) that doesn't automatically translate to smallest binary or fastest execution—the things people usually optimize for.</span>",
            "time": null
        },
        {
            "user": "Evan Carroll",
            "text": "<span class=\"comment-copy\">@user2347953 fair question, because I'm trying to demonstrate vulnerabilities so speed and size isn't an issue. I'm rebuilding Protostar from source and optimizing for clarity. That means turning off things like alignment checks, canaries, and safety-wrappers <code>__chk_*</code> functions etc.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can always add <code>~?</code> to any radare command to count lines of the resulting output. But, like in Bash the pipe to <code>wc -l</code> also works, <code>|wc -l</code>. So in your case</p>\n<pre><code>[0x08049060]&gt; pif~?\n18\n[0x08049060]&gt; pif|wc -l\n18\n</code></pre>\n</div>",
            "votes": "2",
            "user": "Evan Carroll",
            "time": "Nov 9, 2018 at 20:52",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Well, it is not the exactly what you are asking, but could be useful for those, how are looking how to get <code>instructions number for the function</code> from <code>radare2</code>. When you are using <code>r2pipe</code> (a python API for radare2), you may execute radare2 commands \"aaa\" and \"aflj\" to get details for every function (including number of instructions). I suppose, these commands are available in radare2 cli, without API calls.</p>\n</div>",
            "votes": "0",
            "user": "Dmytro Biriukov",
            "time": "Jul 25, 2022 at 7:59",
            "is_accepted": false,
            "comments": []
        }
    ]
}