{
    "title": "Reverse crypto algorythm, based on AES",
    "link": "https://reverseengineering.stackexchange.com/questions/19942/reverse-crypto-algorythm-based-on-aes",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><strong>Hello!</strong></p>\n<p>I'm working on reversing one library (shared object) written for ARM architecture. It's obfuscated or packed with something pretty strong what makes debugging much harder and almost impossible on \"long distance\".</p>\n<p>There is function which provides encryption with some strange algorithm (at least for me).</p>\n<p>What I've researched for now:</p>\n<ul>\n<li>Size of input and output is same;</li>\n<li>Algorithm works with <strong>4 memory regions</strong>, which affects on result (tested):\n\n<ol>\n<li>Size - 256 bytes. This is SBOX, but with custom values <strong>(values are different from AES SBox)</strong>;</li>\n<li>Size - 256 bytes. This is inverted SBOX;</li>\n<li>Size - 16 bytes. Probably, initialization vector, but I'm not sure;</li>\n<li>Size - 128 bytes. Unknown region.</li>\n</ol></li>\n<li>Decryption function also works with same memory regions.</li>\n</ul>\n<p>For now I know only first operations in data in algorithm:</p>\n<ol>\n<li>Reverse bits in each byte (<code>0x30 (00110000b) =&gt; 0xC (00001100b)</code>);</li>\n<li>Reverse bytes (<code>01 02 03 04 05 06 07 08 =&gt; 08 07 06 05 04 03 02 01</code>)</li>\n</ol>\n<p>Some additional information:</p>\n<ul>\n<li><p>If input length &lt; 15 it's just reverse bits and bytes.</p>\n<p>Example <em>(bytes in hex)</em>:</p>\n<p>01 01 01 01 01 01 01 01 =&gt; 80 80 80 80 80 80 80 80 80</p></li>\n<li><p>If input length is 15 it reverse bits in all bytes except 4th. Then reverse bytes.</p>\n<p>Example <em>(bytes in hex)</em>: </p>\n<p>01 01 01 <strong>02</strong> 01 01 01 01 01 01 01 01 01 01 01 =&gt; </p>\n<p>80 80 80 80 80 80 80 80 80 80 80 80 <strong>02</strong> 80 80 80</p></li>\n<li><p>If input length is 16 it reverse bits and bytes, encrypts data with this \"unknown\" algorithm;</p></li>\n<li><p>If input length is 17-32 it'll reverse bits and bytes in first 16 bytes, encrypts first 16 bytes with this algorithm and just reverse bits and bytes in rest data.</p>\n<p>Example: <em>(bytes in hex, bold bytes contains result of encryption)</em>:</p>\n<p><strong>01 01 01 01 01 01 01 01 01 01 01 01 01 01 01 01</strong> <em>02 03 04 05</em> =&gt; </p>\n<p><strong>50 D4 51 BD 59 42 30 A1 B3 5F 77 BD B3 BF A1 9A</strong> <em>A0 20 C0 40</em> </p></li>\n</ul>\n<p>I have opportunity to launch encryption on any data and change all variables. Also I have opportunity to launch built-in decrypt function.</p>\n<p>Maybe someone know what it can be or can recommend me some additional steps to clarify name of this algorithm.</p>\n<p><em>P.S. Sorry for my bad English, hope I've described everything clear.</em></p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "655",
    "tags": [
        "decryption",
        "encryption",
        "cryptography"
    ],
    "user": "Olvin Roght",
    "time": "Nov 22, 2018 at 2:45",
    "comments": [
        {
            "user": "NirIzr",
            "text": "<span class=\"comment-copy\">I could not really understand the following sentence (and examples didn't help either): \"For now I know only first operations in data in algorithm\". Moverover, have you considered actually reverse engineering the algorithm? Creating code or pseudo code for the algorithm, etc. Additionally, have you tried collecting <i>magic values</i> from the library and seaching for them online?</span>",
            "time": null
        },
        {
            "user": "Olvin Roght",
            "text": "<span class=\"comment-copy\">Hello, @NirIzr . As I've mentioned, code is obfuscated by smth, and it's really hard to debug it. In sentence \"For now I know only first operations in data in algorithm\" I've meant that I've started \"tracing\" through code and for now I found next data transformations. I need to implement this algorithm (write external code which will do same encryption). About \"googling\" constants - it's the first what I've done (no results).</span>",
            "time": null
        }
    ],
    "answers_data": []
}