{
    "title": "Is there any ready-to-go malware analysis/reverse engineering OS? (That is capable of installing on hard disk, preferably)",
    "link": "https://reverseengineering.stackexchange.com/questions/19970/is-there-any-ready-to-go-malware-analysis-reverse-engineering-os-that-is-capab",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I just wanted to know if there's any ready-to-go OS for malware analysis/reverse engineering? I prefer OS that is capable of installing on real hardware, not a VM.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "684",
    "tags": [
        "operating-systems"
    ],
    "user": "Jozef Nagy",
    "time": "Nov 27, 2018 at 8:12",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE. This question isn't really a good fit for Q&amp;A (as it elicits opinion-based responses), but I'll defer to the community on this one. However, it's a bit unclear also what you're after. Do you mean an OS that could, say, run a sandbox in which the malware gets analyzed? Do you mean simply a desktop system (Kali comes to mind) which comes with a lot of RCE and forensics tools? Could you please clarify?!</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<ul>\n<li><p>FireEye's <a href=\"https://www.fireeye.com/blog/threat-research/2017/07/flare-vm-the-windows-malware.html\" rel=\"nofollow noreferrer\">FLARE VM</a></p>\n<blockquote>\n<p>FLARE VM is a freely available and open sourced Windows-based security\n  distribution designed for reverse engineers, malware analysts,\n  incident responders, forensicators, and penetration testers. Inspired\n  by open-source Linux-based security distributions like Kali Linux,\n  REMnux and others, FLARE VM delivers a fully configured platform with\n  a comprehensive collection of Windows security tools such as\n  debuggers, disassemblers, decompilers, static and dynamic analysis\n  utilities, network analysis and manipulation, web assessment,\n  exploitation, vulnerability assessment applications, and many others.</p>\n<p>The distribution also includes the FLARE team’s public malware\n  analysis tools such as FLOSS and FakeNet-NG.</p>\n</blockquote></li>\n<li><p>Kali Linux</p>\n<ul>\n<li><a href=\"https://tools.kali.org/tools-listing\" rel=\"nofollow noreferrer\">Forensics tools included by default</a>:\nBinwalk, bulk-extractor, Capstone, chntpw, Cuckoo dc3dd, ddrescue, DFF, diStorm3, Dumpzilla, extundelete, Foremost, Galleta, Guymager, iPhone Backup Analyzer, p0f, pdf-parser, pdfid, pdgmail, peepdf, RegRipper, Volatility,\nXplico</li>\n<li><a href=\"https://docs.kali.org/general-use/kali-linux-forensics-mode\" rel=\"nofollow noreferrer\">\"Forensics mode\"</a></li>\n</ul></li>\n<li><p><a href=\"https://tsurugi-linux.org/tsurugi_linux.php\" rel=\"nofollow noreferrer\">Tsurugi Linux</a></p>\n<ul>\n<li><blockquote>\n<p>Tsurugi is an heavily customized Linux distribution designed to\n  support your DFIR investigations, malware analysis and open source\n  intelligence activities.</p>\n<p>In this distribution are included the latest versions of the most\n  famous tools you need to conduct an in-depth forensic or incident\n  response investigation and several useful features like device write\n  blocking at kernel level, an OSINT profile switcher and much more!</p>\n</blockquote></li>\n</ul></li>\n</ul>\n</div>",
            "votes": "1",
            "user": "julian",
            "time": "Nov 27, 2018 at 0:09",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jozef Nagy",
                    "text": "<span class=\"comment-copy\">No way! I never imagined things like Flare VM or Tsurugi Linux can exist! Thank you so much! You're a lifesaver!</span>",
                    "time": null
                },
                {
                    "user": "julian",
                    "text": "<span class=\"comment-copy\">@JerryEasley you are welcome</span>",
                    "time": null
                }
            ]
        }
    ]
}