{
    "title": "What are the tools to analyze Python (obfuscated) bytecode?",
    "link": "https://reverseengineering.stackexchange.com/questions/1999/what-are-the-tools-to-analyze-python-obfuscated-bytecode",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Recently on <a href=\"http://www.reddit.com/r/ReverseEngineering\" rel=\"noreferrer\">Reddit ReverseEngineering</a> I stumbled on a <a href=\"http://www.reddit.com/r/ReverseEngineering/comments/1da222/selfmodifying_python_bytecode/\" rel=\"noreferrer\">self-modifying code in Python</a>. Looking at the <a href=\"https://github.com/0vercl0k/stuffz/tree/master/Python%27s%20internals\" rel=\"noreferrer\">Github</a> repository was quite instructive and I found picture of the Python bytecode program exposed in CFG form:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/TKeQM.png\"/></p>\n<p>I am wondering if there are tools to perform static analysis on Python bytecode program with some nice features (such as generating the CFG or allowing to manipulate the code, ...) ?</p>\n</div>",
    "votes": "24",
    "answers": 5,
    "views": "13k",
    "tags": [
        "tools",
        "python"
    ],
    "user": "perror",
    "time": "Dec 7, 2013 at 12:48",
    "comments": [
        {
            "user": "Antimony",
            "text": "<span class=\"comment-copy\">If not, it shouldn't be too hard to write one. The hard part is creating a friendly and intuitive GUI.</span>",
            "time": null
        },
        {
            "user": "heinrich5991",
            "text": "<span class=\"comment-copy\">Could one write a tool that makes the files readable for IDA?</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@heinrich5991: yep, better yet it could probably be implemented in Python itself :)</span>",
            "time": null
        },
        {
            "user": "mikeazo",
            "text": "<span class=\"comment-copy\">@0xC0000022L, yes but could it be made self-modifying?</span>",
            "time": null
        },
        {
            "user": "mikeazo",
            "text": "<span class=\"comment-copy\">@0xC0000022L, yeah, I was making a joke.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are several tools dedicated to Python's bytecode reversing:</p>\n<ul>\n<li><p><a href=\"https://github.com/gstarnberger/uncompyle\" rel=\"nofollow noreferrer\">Uncompyle</a> and <a href=\"https://github.com/fry/uncompyle2\" rel=\"nofollow noreferrer\">Uncompyle2</a></p>\n<blockquote>\n<p>'uncompyle' converts Python byte-code back into equivalent Python\n  source. It accepts byte-code from Python version 2.7 only. The generated source is very readable: docstrings, lists, tuples and hashes get pretty-printed. </p>\n<p>'uncompyle' may also verify the equivalence of the generated source by\n  by compiling it and comparing both byte-codes.\n  'uncompyle' is based on John Aycock's generic small languages compiler\n  '<a href=\"http://www.csr.uvic.ca/~aycock/python/\" rel=\"nofollow noreferrer\">spark</a>' and his prior work on\n  'decompyle'.</p>\n</blockquote></li>\n<li><p><a href=\"https://github.com/MyNameIsMeerkat/pyREtic\" rel=\"nofollow noreferrer\">pyREtic</a>, that is more a powerful framework than a simple program</p>\n<blockquote>\n<p>pyREtic is an extensible framework to assist in performing various reverse engineering tasks for Python language projects. It assists a reverse engineer in gaining sourcecode (.py's) back from bytecode (.pyc's), in particular it assists when the code that is being reversed has put some effort into trying to stop decompilation using standard toolsets.</p>\n</blockquote></li>\n<li><p><a href=\"https://github.com/zrax/pycdc\" rel=\"nofollow noreferrer\">pycdc</a>, which works better than uncompyle, and is simpler to use than pyRetic</p>\n<blockquote>\n<p>Decompyle++ aims to translate compiled Python byte-code back into valid and human-readable Python source code. While other projects have achieved this with varied success, Decompyle++ is unique in that it seeks to support byte-code from any version of Python.</p>\n<p>Decompyle++ includes both a byte-code disassembler (pycdas) and a decompiler (pycdc).</p>\n</blockquote></li>\n<li><p>The <a href=\"https://bitbucket.org/larry/maynard\" rel=\"nofollow noreferrer\">Manyard</a> framework, which is dedicated to Python3</p></li>\n</ul>\n</div>",
            "votes": "9",
            "user": "perror",
            "time": "Aug 16, 2017 at 8:37",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"https://bitbucket.org/larry/maynard\">Maynard</a> is a (dis)assembler for Python byte code written by a member of Python core and the release manager for Python 3.4. Reading material <a href=\"https://lwn.net/Articles/544787/\">here</a> and <a href=\"https://www.youtube.com/watch?v=CKu6d_v4Pqo\">here</a>. I'm not aware of a public tool (besides the one you linked) that can do CFG visualization like that, but you certainly could build one on top of Maynard.</p>\n</div>",
            "votes": "10",
            "user": "94c3",
            "time": "May 9, 2013 at 12:22",
            "is_accepted": false,
            "comments": [
                {
                    "user": "NlightNFotis",
                    "text": "<span class=\"comment-copy\">AFAIK, <a href=\"http://pypy.org\" rel=\"nofollow noreferrer\">pypy</a> has a control flow graph viewer and a jitviewer.</span>",
                    "time": null
                },
                {
                    "user": "94c3",
                    "text": "<span class=\"comment-copy\">Looks like <a href=\"http://doc.pypy.org/en/latest/translation.html#the-flow-model\" rel=\"nofollow noreferrer\">this</a>? If so, that's only for RPython, which is a <a href=\"http://doc.pypy.org/en/latest/coding-guide.html#flow-restrictions\" rel=\"nofollow noreferrer\">strict subset</a> of Python. I think the distinction is important, as the whole point of RPython is that it is more amenable to static analysis than Python. That said, still could be useful.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"http://www.immunitysec.com/resources-freesoftware.shtml\" rel=\"nofollow\">pyREtic</a> from <a href=\"http://www.immunitysec.com/\" rel=\"nofollow\">Immunity Sec</a> can also provide some help in looking into original source code and perform modifications as well. </p>\n<p>You may be interested in review the capabilities of the tool in this document:\n<strong>\"<a href=\"https://www.defcon.org/images/defcon-18/dc-18-presentations/RSmith/DEFCON-18-RSmith-pyREtic.pdf\" rel=\"nofollow\">pyREtic, In memory reverse engineering for obfuscated Python bytecode</a>\"</strong> by Rich Smith [PDF]</p>\n</div>",
            "votes": "6",
            "user": "mcgyver5",
            "time": "Dec 7, 2013 at 22:07",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>A challenge in writing a tool to extract the control flow of python bytecode is that there are so many Python bytecodes versions to choose from, about 25 or so by now (if you include pypy variants).</p>\n<p>The bytecode in the example graph with its <code>JUMP_IF_FALSE</code> followed by some <code>POP_TOP</code>s and <code>PRINT_NEWLINE</code> instruction, reflect Python before 2.7. </p>\n<p>However the example in one of the comments from the Flare_bytecode_graph with its <code>POP_TOP_IF_FALSE</code> is 2.7. Python 3 drops the <code>PRINT_ITEM</code> instruction.</p>\n<p>Anyone writing such a tool will have to come to grips with that; or be happy with living in a single version of Python, for which 2.7 is probably the most popular choice. Or you could ensure that the version of Python you are running matches the bytecode you want to analyze and use the current <em>dis</em> and <em>opcode</em> modules that Python provides. But even here those modules change over time, not in the least being the particular bytecode instructions.</p>\n<p>I wrote a python package called <a href=\"https://pypi.python.org/pypi/xdis\" rel=\"nofollow noreferrer\">xdis</a> for those who want to work across all versions of Python bytecode, and don't want to be tied with using the same version of Python that the bytecode requires.</p>\n<p>The next thing that you'll probably want to do in this endeavor is to classify instructions into categories like those which can branch and those that can't and if the branch is conditional or not. </p>\n<p>Python has some lists that cover some of this, (\"hasjrel\", \"hasjabs\") but alas it doesn't have the categories that are most useful. And for possibly historical reasons the categories are lists rather than sets. But again xdis to the rescue here; it fills this information in with sets \"CONDITION_OPS\", \"JUMP_UNCONDITIONAL\" and \"JUMP_OPS\". </p>\n<p>Using this I've written <a href=\"https://github.com/rocky/python-control-flow\" rel=\"nofollow noreferrer\">https://github.com/rocky/python-control-flow</a> which uses xdis and has some rudimentary code that will create a control flow graph and dominator tree for most Python bytecodes. There is some code to create dot files and I use graphviz to display that. I notice that Python, can create a lot of dead code.</p>\n<p>The intended use of that package is to reconstruct high-level Python control structures. There is some rudimentary control structure detection, although this needs a lot more work. Python control structures are pretty rich when you include the try/while/for \"else\" clauses, and the \"finally\" clauses. Even as is, the annotated control flow of the basic blocks very helpful in manually reconstructing structured control flow.</p>\n<p>When this is finished, I can replace a <em>lot</em> of the hacky code for doing that in <a href=\"https://pypi.python.org/pypi/uncompyle6\" rel=\"nofollow noreferrer\">uncompyle6</a>. </p>\n<p>And this leads me to the list of decompilers mentioned in the accepted answer...</p>\n<p>As stated, those particular versions of uncompyle and uncompyle2 handle only Python 2.7. As suggested, there are older versions that handle multiple Python versions 1.5 to 2.3 or 2.4 or so. That is if you have a Python 2.3 or 2.4 interpreter to run this on.</p>\n<p><strong>But none of these projects are actively maintained</strong>. In uncompyle, there are <a href=\"https://github.com/gstarnberger/uncompyle/issues\" rel=\"nofollow noreferrer\">currently 25 or so issues with the code</a>, many that I have fixed in uncompyle6. And this is for a version of Python that no longer changes! (To be fair though there are some bugs in uncompyle6 that don't exist in uncompyle2. And to address those, I'd really need to put in place that better control flow analysis) </p>\n<p>A number of the bugs in uncompyle could easily be fixed by just doing the same thing that uncompyle6 does, and I think some of that I've noted in the issues. At this point uncompyle2 is much better than uncompyle, and if you are only interested in Python 2.7, that is the most accurate.</p>\n<p>As for pycdc, while it is pretty good for its relatively small size (compared to uncompyle6), it too isn't maintained to the level that it would need to keep up with Python changes. So it is weak around Python 3.4 or so and gets progressively weaker for later versions. Uncompyle6 is like that too, but currently less so. <a href=\"https://github.com/zrax/pycdc/issues\" rel=\"nofollow noreferrer\">pycdc has over 60 issues logged against it</a> and I doubt those will be addressed anytime soon. Some of them aren't <em>that</em> difficult to fix. My own (possibly slanted) comparison of those two decompilers is <a href=\"https://github.com/rocky/python-uncompyle6/wiki/pycdc-compared-with-uncompyle6\" rel=\"nofollow noreferrer\">https://github.com/rocky/python-uncompyle6/wiki/pycdc-compared-with-uncompyle6</a></p>\n</div>",
            "votes": "5",
            "user": "rocky",
            "time": "Nov 12, 2018 at 14:37",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The <a href=\"https://github.com/fireeye/flare-bytecode_graph\" rel=\"nofollow noreferrer\">Flare-bytecode graph</a> project can help with graphical bytecode CFG representation. Taken from the project <code>README</code>:</p>\n<blockquote>\n<p>...<br/>\n  It is also possible to create control flow diagrams using GraphViz. The disassembly within the graph can include the output from a simple peephole decompiler.</p>\n<pre><code>import bytecode_graph\ndef Sample():\n    i = 2 + 2\n    if i == 4:\n        print \"2 + 2 = %d\" % i\n    else:\n        print \"oops\"\n\nbcg = bytecode_graph.BytecodeGraph(Sample.__code__)\ngraph = bytecode_graph.Render(bcg, Sample.__code__).dot()\ngraph.write_png('example_graph.png')\n</code></pre>\n<p><a href=\"https://i.sstatic.net/TuxNr.png\" rel=\"nofollow noreferrer\"><img alt=\"program CFG\" src=\"https://i.sstatic.net/TuxNr.png\"/></a></p>\n</blockquote>\n</div>",
            "votes": "3",
            "user": "perror",
            "time": "Aug 16, 2017 at 9:29",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">please try to put some description of the link into your answer.</span>",
                    "time": null
                }
            ]
        }
    ]
}