{
    "title": "Unable to set breakpoints in keygen",
    "link": "https://reverseengineering.stackexchange.com/questions/2005/unable-to-set-breakpoints-in-keygen",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I like security as a hobby and I not so often I read and play with a few simple KeyGen games and I enjoy it.</p>\n<p>Reversing and KeyGen is very interesting but I'm a beginner and my questions are probably very dumb but I will be very thankful if you could help me.</p>\n<p>Until the moment I have reversed simple keygen applications using techniques such as:</p>\n<ul>\n<li>Look for string text reference to find the interesting code area.</li>\n<li>Keygen fishing.</li>\n<li>And bypass <code>IsDebuggerPresent</code> check.</li>\n</ul>\n<p>Yeah, I know, really basic stuff. Here is a video similar to what I do in general:</p>\n<ul>\n<li><a href=\"http://www.youtube.com/watch?v=tJY_Tv7o5bE\" rel=\"noreferrer\">http://www.youtube.com/watch?v=tJY_Tv7o5bE</a></li>\n</ul>\n<p>Just for learning sometimes I try to reverse a few small and medium application that I buy for Windows and looks like simple products without many protections.</p>\n<p>This is a software that I acquired 2 months ago and the whole installation is around 50MB. One of the motivations to try apply my basic knowledge here is because I like to see if what I learned in keygens really work in real-life, my experience that medium softwares are much harder since keygens are very small and easy to find the routines that you want. :)</p>\n<p>** Just to make it very clear, I have a license for this program and my intention is only learn and increase my knowledge. Since I have no commercial intention in break it or create any damage I will not disclosure the application - I hope you understand. **</p>\n<p>OK, let's go. The application consist of one main executable (~33MB), 6 DLLs (very small ones and some of them are <code>libeay32.dll</code>, etc) and around 90 <code>.xsd</code> files (XML format). My first step was try to identify the programming language used and if a packer was present, please, see screen shots below:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/uMFSE.png\"/></p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/m8vzU.png\"/></p>\n<p>It really appears to be developed in Delphi, with CFF I confirmed it. Also, there is no section that points for an packer looking at CFF information and EXE Information and RDG also say it's clean. However, RDG found <code>IsDebuggerPresent</code> and pointed for an protection software as you may see. However, I'm not sure if it's a false-positive.</p>\n<p>On my application the serial is entered in a field like that:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/lCY4C.png\"/></p>\n<p>And once I enter a wrong serial number (30 chars long) I get a message like that:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/GzCPG.png\"/></p>\n<p>I guess it's not a <code>MessageBox</code>, or at least it's very custom one. For this kind of messages should I keep breakpoints at <code>MessageBoxA</code>, etc? Or there is a different API?</p>\n<p>Below is a screenshot once I attach to the application running:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/mZg4N.png\"/></p>\n<p>When I press \"run\" at OllyDbg it's what I get:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/wRkdI.jpg\"/></p>\n<p>Here is a list of SEH chain:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/FXsun.png\"/></p>\n<p>Here are the \"Windows\" available, including the one that I would like to disassemble, examine and put a breakpoint:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/qYFSP.jpg\"/></p>\n<p>However it fails to debug, see below, please:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/SmDcm.jpg\"/></p>\n<p>Is it some kind of protection? How to disable this part of code, put breakpoints, etc?</p>\n<p>Looking at \"Text String References\" I'm able to see just partial messages and not the one displayed on my custom \"<code>MessageBox</code>\".</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/0Zbyw.png\"/></p>\n<p>Also, There are many parts that looks like an message that will be completed on the fly, for example \"A chave informata esta\" which means \"They key entered is\" or \"Chave incorrecta n\" which means \"Wrong key at\".</p>\n<p>[img]<a href=\"http://img5.imageshack.us/img5/3382/11ionlyseetextstringsre.png[/img]\" rel=\"noreferrer\">http://img5.imageshack.us/img5/3382/11ionlyseetextstringsre.png[/img]</a></p>\n<p>Additionally, I noted that are parts of the application when some texts are not stored as a \"TextString\", instead I see \"char by char\" in sequence at OllyDbg creating a few strings (also not very useful to me).</p>\n<p>If I define a breakpoint in any of these TextStrings it's what happen - an exception:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/38E8G.jpg\"/></p>\n<p>Is it a protection? Any idea how to bypass it?</p>\n<p>From here the only thing that I'm able to do it pass control to the application and all is over. :(</p>\n<p>Also, if I refuse to pass control to the application and I continue with F7/F8 I get something like that:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/NzcnH.jpg\"/></p>\n<p>It ends with an instruction not recognized by OllyDbg. Any idea?</p>\n<p>I also tried to set breakpoints in Names from <code>user32.dll</code> such as <code>GetDlgItemTextA</code> and <code>GetDlgItemTextW</code> since I believe they are the APIs used to read my entered serial number. The strange thing is that they are exported and not imported as demonstrated below. Is it normal?</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/r0OqQ.png\"/></p>\n<p>Once I created the breakpoint and stated stepping into I got this exception again and I was forced to pass control to application and game over again. :(</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/ayOZj.jpg\"/></p>\n<p>I was thinking it could be some basic Anti-debugging protections, so I enabled \"aadp4olly\" and \"Olly Advanced\" with many options but it was unable to solve the issues, so, I'm not so sure anymore about what is issue is.</p>\n<p>All help and answers are very appreciated, but please, keep in mind that I'm a beginner.</p>\n<p>** <strong><em>UPDATED</em></strong> **</p>\n<p>Hi All,</p>\n<p>Thanks for your answer, but it doesn't solve the whole issue. Please, see details below.</p>\n<p>First I updated my PEid database from this link:</p>\n<p><a href=\"https://code.google.com/p/reverse-engineering-scripts/downloads/detail?name=UserDB.TXT\" rel=\"noreferrer\">https://code.google.com/p/reverse-engineering-scripts/downloads/detail?name=UserDB.TXT</a></p>\n<p>The following screenshot demonstrates PE details:</p>\n<p><a href=\"http://img444.imageshack.us/img444/8295/16pedetails.png\" rel=\"noreferrer\">http://img444.imageshack.us/img444/8295/16pedetails.png</a></p>\n<p>Here are details about PE sections:</p>\n<p>Looks a bit strange for a not packed binary, right? But I can't figure out the correct packer.</p>\n<p><a href=\"http://img5.imageshack.us/img5/5764/17pesections.png\" rel=\"noreferrer\">http://img5.imageshack.us/img5/5764/17pesections.png</a></p>\n<p>Entropy and and Fast Check say \"not packed\", but EP check points as packed:</p>\n<p><a href=\"http://img571.imageshack.us/img571/6251/18epappearstobepacked.png\" rel=\"noreferrer\">http://img571.imageshack.us/img571/6251/18epappearstobepacked.png</a></p>\n<p>Here is the original EP found:</p>\n<p><a href=\"http://img12.imageshack.us/img12/990/19originalep.png\" rel=\"noreferrer\">http://img12.imageshack.us/img12/990/19originalep.png</a></p>\n<p>RDG Packer Detector pointed that Obsidium protection was present, however I guess it's a false positive. See the unpacker failing to recognize the format:</p>\n<p>The unpacker is available here: <a href=\"http://down.52pojie.cn/Tools/Unpackers/\" rel=\"noreferrer\">http://down.52pojie.cn/Tools/Unpackers/</a></p>\n<p><a href=\"http://img29.imageshack.us/img29/7/20obsidiumunpackingfail.png\" rel=\"noreferrer\">http://img29.imageshack.us/img29/7/20obsidiumunpackingfail.png</a></p>\n<p>Also, the great Ferrit Anti-Anti-Debuggin script for OllyDB was not enough to allow me to debug it. Please, see below:</p>\n<p><a href=\"http://img836.imageshack.us/img836/4352/21ferritantiantidebugis.png\" rel=\"noreferrer\">http://img836.imageshack.us/img836/4352/21ferritantiantidebugis.png</a></p>\n<p><a href=\"http://img42.imageshack.us/img42/8721/22ferritantiantidebugis.png\" rel=\"noreferrer\">http://img42.imageshack.us/img42/8721/22ferritantiantidebugis.png</a></p>\n<p>From here I'm forced to pass control to application and I lost control of if as demonstrated on my first post. I tried to freeze all threads and just keep the main thread running but it continues to fail.</p>\n<p>Resource Hacker is unable to read Delphi resources:</p>\n<p><a href=\"http://img812.imageshack.us/img812/9861/23resourcehackerfailsto.png\" rel=\"noreferrer\">http://img812.imageshack.us/img812/9861/23resourcehackerfailsto.png</a></p>\n<p>Even Resource Hacker FX fails because it says a new version Delphi was used to compile.</p>\n<p><a href=\"http://img560.imageshack.us/img560/7538/24resourcehackerfxfails.png\" rel=\"noreferrer\">http://img560.imageshack.us/img560/7538/24resourcehackerfxfails.png</a></p>\n<p>Delphi Decompiler also failed. First I tried attach to my target:</p>\n<p><a href=\"http://img11.imageshack.us/img11/89/25dedeattachingtotarget.png\" rel=\"noreferrer\">http://img11.imageshack.us/img11/89/25dedeattachingtotarget.png</a></p>\n<p>Once the analysis finished it found the Classes Info:</p>\n<p><a href=\"http://img600.imageshack.us/img600/5935/26dedeloadedtarget.png\" rel=\"noreferrer\">http://img600.imageshack.us/img600/5935/26dedeloadedtarget.png</a></p>\n<p>But the important thing are the \"Forms\" and \"Procedures\" and nothing was found:</p>\n<p><a href=\"http://img600.imageshack.us/img600/986/27dedeisunabletofindany.png\" rel=\"noreferrer\">http://img600.imageshack.us/img600/986/27dedeisunabletofindany.png</a></p>\n<p>IDR (Interactive Delphi Reconstructor) also appears to be useless since the target application was compiled with Delphi 2011 or 2012 and no definition file is available for this version.</p>\n<p>Ideas? Suggestions?</p>\n<p>Thanks again for your help and effort.</p>\n<p>** <strong><em>UPDATE</em></strong> **</p>\n</div>",
    "votes": "10",
    "answers": 3,
    "views": "4k",
    "tags": [
        "ollydbg",
        "crackme"
    ],
    "user": "Araujo",
    "time": "May 9, 2013 at 23:52",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Delphi implements its own \"message box\" as <code>MessageDlg</code>, this is likely what you're seeing.</span>",
            "time": null
        },
        {
            "user": "amccormack",
            "text": "<span class=\"comment-copy\">This a good first question. Hopefully someone will have a more specific answer but until then have you looked at the Lena tutorials on tuts4you? They start basic but get to defeating code protection quickly.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@amccormack: I was tempted to vote to close, but then decided to edit it. It was in a truly sorry state as you can still see <a href=\"http://reverseengineering.stackexchange.com/posts/2005/revisions\">in the revision history</a>.</span>",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "<span class=\"comment-copy\">Could you reduce the number of images ? Just link to the non-essential ones. Its taking a lot of time to load.</span>",
            "time": null
        },
        {
            "user": "Hanan",
            "text": "<span class=\"comment-copy\">It is really hard to tell what is your specific goal with this question, you should sum your questions at the end of the post and delete some pictures.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Have a look at R4ndom's Tutorial #17 on working with Delphi binaries and cracking them: <a href=\"http://thelegendofrandom.com/blog/archives/1472\" rel=\"nofollow noreferrer\">http://thelegendofrandom.com/blog/archives/1472</a></p>\n<p>He describes how you can use <a href=\"http://www.angusj.com/resourcehacker/\" rel=\"nofollow noreferrer\">Resource Hacker</a> (I prefer <a href=\"http://www.wilsonc.demon.co.uk/d10resourceeditor.htm\" rel=\"nofollow noreferrer\">XN Resource Editor</a>) to find the event handler for the form that calls the dialog you are looking for.</p>\n<p>With knowledge of the form you are interested in, <a href=\"http://www.softpedia.com/get/Programming/Debuggers-Decompilers-Dissasemblers/DeDe.shtml\" rel=\"nofollow noreferrer\">download DeDe</a> and load the application into it. After DeDe completes its analysis, click on the \"Forms\" tab and you will see all event handlers associated with that form (OnClick  is likely what you are looking for here). With the name of the event handler, click on \"Procedures\" and find the event and you will see its address.</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/dwI5d.png\"/></p>\n<p>From there, load your application in OllyDbg and set a breakpoint on the address of the event handler that you are interested in. This should put you near where the registration dialog is prompting you. The R4ndom tutorial can describe any necessary next steps from there.</p>\n</div>",
            "votes": "5",
            "user": "Mick",
            "time": "May 4, 2013 at 13:48",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Araujo",
                    "text": "<span class=\"comment-copy\">Hi Mick Grove, thanks for your answer. It's a bit more complicated. Please, check my <b>UPDATE</b> on the original post. Again, thanks for all your help and effort. Best regards.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm not sure it's true in your case, but a common anti-keygenning/debugging trick is to compress the parts of code you're going to want to breakpoint and over-write them at runtime.  This way if an int3 is patched in at initial load, a reload will re-initialize the text section and remove your breakpoint.  </p>\n<p>It has more intense applications, but this would be a simple one.</p>\n</div>",
            "votes": "1",
            "user": "RobotHumans",
            "time": "May 6, 2013 at 0:03",
            "is_accepted": false,
            "comments": [
                {
                    "user": "amccormack",
                    "text": "<span class=\"comment-copy\">The work around for this, of course, is to use a hardware breakpoint.</span>",
                    "time": null
                },
                {
                    "user": "RobotHumans",
                    "text": "<span class=\"comment-copy\">not if aslr or some other randomizing tech is in place</span>",
                    "time": null
                },
                {
                    "user": "amccormack",
                    "text": "<span class=\"comment-copy\">Good point. I didn't think of that.</span>",
                    "time": null
                },
                {
                    "user": "Araujo",
                    "text": "<span class=\"comment-copy\">Hi guys, thanks for answer. So what is the solution for this case? Based on my updated original post do you think it may applies to my target? Thanks.</span>",
                    "time": null
                },
                {
                    "user": "RobotHumans",
                    "text": "<span class=\"comment-copy\">You could probably update with a linky to the keygenme to get a better response.  If I overlooked it then say so...</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can use <a href=\"http://kpnc.org/idr32/en/index.htm\" rel=\"nofollow\">IDR</a> (Interactive Delphi Reconstractor) in order to asssists you in the delphi code RE process.</p>\n<p>It is a great tool.</p>\n</div>",
            "votes": "1",
            "user": "Hanan",
            "time": "May 8, 2013 at 20:10",
            "is_accepted": false,
            "comments": [
                {
                    "user": "asheeshr",
                    "text": "<span class=\"comment-copy\">Please justify why is it a great tool. The answers are written not just for the OP but for all the other people who may come across this in the future. Thus a justification, will make it useful for everybody else as well.</span>",
                    "time": null
                },
                {
                    "user": "Araujo",
                    "text": "<span class=\"comment-copy\">Hi Hanan N., I tried, but it's useless in my case since it's compiled with Delphi 2011 or 2012. Please, check my updated post. Thanks so much. Best regards.</span>",
                    "time": null
                },
                {
                    "user": "user1974",
                    "text": "<span class=\"comment-copy\">IDR supports Delphi 2011 and 2012 since 29.12.2012</span>",
                    "time": null
                },
                {
                    "user": "asheeshr",
                    "text": "<span class=\"comment-copy\">@crypto As IDR has already been mentioned in this answer, it would be better to simply comment it edit that information into this instead of writing another redundant answer. As you do not yet have the reputation yet to do either, I would suggest looking around and seeing if there is anything you can answer, or maybe asking a few questions. You can both edit and comment after you get 50 rep.</span>",
                    "time": null
                }
            ]
        }
    ]
}