{
    "title": "How to reverse engineer an ATM?",
    "link": "https://reverseengineering.stackexchange.com/questions/2023/how-to-reverse-engineer-an-atm",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This question is using ATMs as an example, but it could apply to any number of 'secure' devices such as poker machines, E-voting machines, payphones etc. </p>\n<p>Given that ATMs are relatively hardened (in comparison to say, most consumer electronics for example), what would be the process of reverse engineering a device in a black-box AND limited access scenario?</p>\n<p>Given that traditionally, an end user of a device such as an ATM will only ever have access to the keypad/screen/card input/cash outlet (at a stretch, access to perhaps the computer housed in the top of the plastic casing(think private ATMs at small stores etc)), it seems like most attack vectors are quite limited. Under these types of circumstances, what could be done to reverse, understand and potentially exploit hardened, limited access systems?</p>\n<p>Is the 'ace up the sleeve' kind of situation here physical access to the ATM components? Or is there a way to RE a device from within the environment a user is presented?</p>\n</div>",
    "votes": "10",
    "answers": 3,
    "views": "2k",
    "tags": [
        "hardware",
        "security",
        "physical-attacks"
    ],
    "user": "NULLZ",
    "time": "May 8, 2013 at 18:45",
    "comments": [
        {
            "user": "Gilles 'SO- stop being evil'",
            "text": "<span class=\"comment-copy\">What information are you trying to obtain? Hardware components? Software code? Transaction logs? Keys? Countermeasures?</span>",
            "time": null
        },
        {
            "user": "Ange",
            "text": "<span class=\"comment-copy\">hardened? aren't they just stupid PCs ?</span>",
            "time": null
        },
        {
            "user": "NULLZ",
            "text": "<span class=\"comment-copy\">@Ange it depends on the implementation, i've personally seen lightweight WinXP environments deployed, but i've also seen linux distros and other 'unknown' environments. How could you even go about determining -what- the environment is? Only think i could think of is watching the POST screen load if you re-set the power somehow</span>",
            "time": null
        },
        {
            "user": "NULLZ",
            "text": "<span class=\"comment-copy\">@Gilles Well, to get the device to do something that its not supposed to let you do would be the end goal, in ATM's its a case of getting cash or stealing card information, in the case of voting machines its casting more than one vote etc. Doesn't have to be specific to ATM's per-se.</span>",
            "time": null
        },
        {
            "user": "Gilles 'SO- stop being evil'",
            "text": "<span class=\"comment-copy\">@D3C4FF “to get the device to do something that its not supposed to let you do” isn't RE, it's an attack. RE may be an attack path. This interpretation makes your question even broader! You're asking us to write the book on ATM security. Please edit your question down to something manageable, as right now it's calling for a collection of ATM security tips.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Some information might be found in Barnaby Jack's BlackHat presentation: </p>\n<ul>\n<li><a href=\"http://www.youtube.com/watch?v=Ss_RWctTARU\" rel=\"nofollow\">Jackpotting Automated Teller Machines (Youtube)</a></li>\n</ul>\n<blockquote>\n<p>The most prevalent attacks on Automated Teller Machines typically involve the use of card skimmers, or the physical theft of the machines themselves. Rarely do we see any targeted attacks on the underlying software. </p>\n</blockquote>\n<p>Can't find the presentation or the whitepaper atm (no pun intended), but I'm sure you'll get some information/directins from the talk.</p>\n<p>Apart from this kind of reversing where you can do whatever you want with the machine, if you just have limited access to it (can't open it or whatever), I guess your best bet would be to play around with what's available. Some of those machines have USB ports for peripherals with which you could play. Something like <a href=\"http://www.pjrc.com/teensy/\" rel=\"nofollow\">Teensy</a> might come in handy for automating stuff. </p>\n<p>Also, most of those machines can be connected to some sort of a network, so scanning, sniffing and similar tricks could yield more results. </p>\n<p>Be careful with what (or who's machines ) you play with, don't be <a href=\"http://web.archive.org/web/20130423212041/http://labofapenetrationtester.blogspot.in/2013/04/what-bored-hacker-did-on-plane.html\" rel=\"nofollow\">this guy</a>. </p>\n</div>",
            "votes": "11",
            "user": "0xea",
            "time": "May 10, 2013 at 12:27",
            "is_accepted": true,
            "comments": [
                {
                    "user": "NULLZ",
                    "text": "<span class=\"comment-copy\">Yeah i've come across these presentations before, but the problem is he had physical access to this machine for an extended duration in which he was able to RE any component he wanted as he had access to everything...</span>",
                    "time": null
                },
                {
                    "user": "0xea",
                    "text": "<span class=\"comment-copy\">Well, if you don't have an extended physical access to an ATM (you don't own it that is) I'd strongly advise against messing with it.</span>",
                    "time": null
                },
                {
                    "user": "NULLZ",
                    "text": "<span class=\"comment-copy\">Its not something I intend on doing illegally if thats what your implying. Incidentally, I will have legitimate access to several ATMs and i'm curious to see what other potential avenues of attack people can come up with</span>",
                    "time": null
                },
                {
                    "user": "0xea",
                    "text": "<span class=\"comment-copy\">Sorry, didn't mean to imply anything. I'll edit my answer with some other ideas.</span>",
                    "time": null
                },
                {
                    "user": "0xea",
                    "text": "<span class=\"comment-copy\">Added a sort of disclamer at the end, for others that might stumble upon this topic.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can't do much without physical access, if not to the specific machine you're attacking then to the same or similar model. That's what Barnaby Jack did - he ordered 3 ATM machines and investigated them at home. I suppose there may be service menus reachable from the normal screen by some key combinations but I wouldn't count on it.</p>\n<p>Once you know the specific system you can look for the ways in. E.g. supposedly some POS terminals (possibly ATMs too) <a href=\"http://www.finextra.com/community/fullblog.aspx?blogid=6781\">can be attacked with a \"Trojaned\" card</a>, though I'm kinda skeptical about such claims. A probably more plausible attack is to find the dial-up line the ATM is connected to, and log in into it using a default/factory password, or via a vulnerability in the login process or the network protocol.</p>\n</div>",
            "votes": "5",
            "user": "Igor Skochinsky",
            "time": "May 8, 2013 at 15:37",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>All ATMs that I am aware of and have worked on in a past life have a way to get into 'admin' mode either from the front or a rear keypad.  Methods vary.  Sniffing a network probably won't help as the communication is encrypted.\nThat said, buy one:\n<a href=\"http://www.atmexperts.com/used_atm_machines.html\">http://www.atmexperts.com/used_atm_machines.html</a>\n<a href=\"http://www.bellatm.net/Default.asp\">http://www.bellatm.net/Default.asp</a>\nThen you'll have all the time and access you could want - and, unless you misuse anything learned, will avoid prison.</p>\n</div>",
            "votes": "5",
            "user": "Marc",
            "time": "May 10, 2013 at 6:07",
            "is_accepted": false,
            "comments": []
        }
    ]
}