{
    "title": "Why are there so much more functions in ida than my source code?",
    "link": "https://reverseengineering.stackexchange.com/questions/20262/why-are-there-so-much-more-functions-in-ida-than-my-source-code",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to learn how to use IDA Pro 6.8 to analyze binaries. However, there are much more functions in ida function list than my code. For example, there is a function in source code that calls four callee functions, two global functions and two public function of a class. But, in ida, it has more than ten callees, if I print the <code>line.points.size()</code>. It is recognized as a function in ida. line is my class, points is a vector variable of line. The function in ida is named <code>std::vector&lt;std::vector&lt;Point *,std::allocator&lt;Point *&gt;&gt;,std::allocator&lt;std::vector&lt;Point *,std::allocator&lt;Point *&gt;&gt;&gt;&gt;::size(void)</code>. So it caused that the number of callee is not equal to the number in source. Why are there so much more functions that are not defined as function in my source? How can I recognize which function in ida is the function I define and which one is added by ida?</p>\n</div>",
    "votes": "2",
    "answers": 2,
    "views": "1k",
    "tags": [
        "ida",
        "disassembly",
        "c++",
        "c"
    ],
    "user": "greagen",
    "time": "Jan 2, 2019 at 12:20",
    "comments": [
        {
            "user": "user3629249",
            "text": "<span class=\"comment-copy\">this question is not about 'C' so the 'c' tag should be removed</span>",
            "time": null
        },
        {
            "user": "greagen",
            "text": "<span class=\"comment-copy\">C programs are also my analysis targets. I don not know whether it is about c/c++ compilation rules. So, I add c tag.</span>",
            "time": null
        },
        {
            "user": "user3629249",
            "text": "<span class=\"comment-copy\">The posted code is using C++ templates, so the code, you posted, is not about 'c'</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You just discovered why templates are accused of code bloat.</p>\n<p>That function is not added by IDA but instead by the compiler when it expanded the templated class <code>std::vector&lt;std::vector&lt;Point*&gt;&gt;</code> and generated all its member functions. Every std::vector with a different template parameter is considered a separate type. So  <code>std::vector&lt;int&gt;::size()</code> and <code>std::vector&lt;float&gt;::size()</code> are separate functions however a sufficiently smart compiler/linker with high enough optimization settings will see that the code of the two is the exact same and be able to combine them.</p>\n</div>",
            "votes": "2",
            "user": "ratchet freak",
            "time": "Jan 2, 2019 at 14:49",
            "is_accepted": true,
            "comments": [
                {
                    "user": "greagen",
                    "text": "<span class=\"comment-copy\">Thanks，you helped me solve the first problem, as for the second one, can I distinguish the functions that I defined in my code without function name? I mean that if the binary is stripped, its symbols are not availble, When given the dissasemble functions in ida, is there any difference between functions I defined and that expanded by compiler? For example, some tags?property？ so that I can find my own functions.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>A compiler has to translate the language that you know (C++) to the language that the computer knows.  A linker then links together your code with referenced libraries and creates an executable.  In order to turn it back into a form that you can read, IDA reads the computer's language and translates it into a disassembly.  Both compilation and disassembly are complicated processes.  <a href=\"https://reverseengineering.stackexchange.com/questions/2580/why-is-disassembly-not-an-exact-science\">Disassembly itself is a hard problem</a>, including function identification and boundary detection.  In addition to inaccuracies in the disassembly process, the executable building process does several things.</p>\n<p>First, your source code is translated into machine code, and all modern compilers have various heuristics and rules they use to optimize the code.  Take a look at the <a href=\"https://gcc.gnu.org/onlinedocs/gcc/Optimize-Options.html\" rel=\"nofollow noreferrer\">docs for gcc</a> and the <a href=\"https://docs.microsoft.com/en-us/cpp/build/reference/ox-full-optimization?view=vs-2017\" rel=\"nofollow noreferrer\">docs for Visual Studio</a>.  Sometimes this means decreasing the number of functions (for example, inlining), and sometimes it means increasing (for example, thunks).</p>\n<p>Second, either implicitly or explicitly, your source code is referencing lots of other source code, with includes, and includes within those included files, and includes within those included files... some of which cause the linker to dynamically link (add references to) libraries, and some of which cause the linker to statically link (copy and append to your code) those libraries.</p>\n</div>",
            "votes": "0",
            "user": "knowmalware",
            "time": "Jan 3, 2019 at 0:56",
            "is_accepted": false,
            "comments": []
        }
    ]
}