{
    "title": "How to identify which iOS kernelcache is installed?",
    "link": "https://reverseengineering.stackexchange.com/questions/20307/how-to-identify-which-ios-kernelcache-is-installed",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've an iPhone7 running iOS11.3 (15E216). The ipsw for this build version contains two separate kernelcache files named kernelcache.release.iphone9 and kernelcache.release.iphone10. Neither file is an exact match for the kernel installed at /System/Library/Caches/com.apple.kernelcaches/kernelcache. What process does Apple perform on the ipsw kernelcache to produce the installed kernelcache? How do I identify which kernelcache is the one installed on my phone?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "861",
    "tags": [
        "firmware",
        "decryption",
        "ios",
        "kernel"
    ],
    "user": "stiabhan",
    "time": "Jan 8, 2019 at 11:10",
    "comments": [
        {
            "user": "stiabhan",
            "text": "<span class=\"comment-copy\">A partial answer was to use joker because it can list the prelinked KEXTs. In the above example I can see that the kernelcache.release.iphone9 has 211 KEXTs  and so does the version installed on the iPhone. The base addresses for each of the KEXTs are the same so that is suggestive that the files are equivalent - but the installed kernelcache and the IPSW kernelcache files are of different sizes and I was hoping to find a more certain solution than this guesswork.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The /System/Library/Caches/com.apple.kernelcaches/kernelcache and the IPSW's kernelcache.release.iphone9 files have the same payload content but the former uses the IMG4 file format (containing a wrapper + payload) whereas the latter uses the IM4P file format (containing just the payload).</p>\n</div>",
            "votes": "1",
            "user": "stiabhan",
            "time": "Jan 8, 2019 at 21:25",
            "is_accepted": false,
            "comments": []
        }
    ]
}