{
    "title": "Reverse Engineering Grocery Software API",
    "link": "https://reverseengineering.stackexchange.com/questions/20313/reverse-engineering-grocery-software-api",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<h2>Introduction</h2>\n<p>So I have a peer to peer app that allows customers to request jobs at their own price and have the job fulfilled by a freelancer in the community. The common jobs requested as of recent are home improvement gigs and lawn care things. We plan on releasing a new feature that allows customers to request groceries through the app to be delivered to them as well. </p>\n<h2>Summary of The Problem</h2>\n<p>The grocery company we are using has open source documentation for parts of their api, however some of the documentation is missing components we need to successfully integrate the feature into our app. So for the missing components I have reverse engineered some components of the software that aren't included within the public documentation and plan on integrating it into our app. I haven't fully finished the reverse engineering, as I am a quarter of the way done but: </p>\n<ul>\n<li>What legal implications does this hold?</li>\n<li>If it is unlawful, what is the severity of the repercussions? </li>\n<li>How long can I utilize this reverse engineering software before being\ncaught?</li>\n<li>Will I the implementer of the software be held accountable, or would\nthe company be accountable on my behalf?</li>\n</ul>\n<p>Thanks in advance. </p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "143",
    "tags": [
        "api",
        "law",
        "development"
    ],
    "user": "Solomon Antoine",
    "time": "Jan 9, 2019 at 10:40",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE! Your question is very much going to elicit opinions. Also you should have separated the questions. Consider checking <a href=\"https://reverseengineering.stackexchange.com/questions/tagged/law\">law</a> for the first one (and possibly the second) of your questions. Keep in mind that any answer will be specific to the jurisdictions in which you act. Third one is pure guess work and not a good fit for Q&amp;A. That said, for interoperability purposes RCE <i>is</i> often allowed.</span>",
            "time": null
        },
        {
            "user": "user22970",
            "text": "<span class=\"comment-copy\">note that if they didn't release a part as public, they might change it any time (if at all) without notifying you</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I (a random bloke on the internet) would do these:</p>\n<ul>\n<li>read the EULA and terms&amp;conditions. Do they explicitly prohibit/allow all/some parts of the API?</li>\n<li>is the API you're using internal or merely undocumented?</li>\n<li>depending on the country/jurisdiction you might not be able to use the results of RE. It can be questionable how much of an RE it is to guess the API endpoint.</li>\n<li>contact the grocery API authors, maybe they're planning a public API for the features you need or maybe they can point you in the right direction without the need to call their private API.</li>\n<li>talk to a lawyer. I don't want to make assumptions when I can end up with a fine or in jail.</li>\n</ul>\n<p>As @Amirag mentioned the private API might be very unstable and if <em>they</em> break the compatibility <em>your</em> users will suffer blaming <em>your</em> app. And most likely leave a negative review and uninstall it.</p>\n</div>",
            "votes": "1",
            "user": "zxxc",
            "time": "Jan 9, 2019 at 14:15",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Solomon Antoine",
                    "text": "<span class=\"comment-copy\">Thank you. I will follow your instructions as my next steps.</span>",
                    "time": null
                }
            ]
        }
    ]
}