{
    "title": "Radare2 Disassembler How Do You Organize Visual Panels (V!)?",
    "link": "https://reverseengineering.stackexchange.com/questions/20384/radare2-disassembler-how-do-you-organize-visual-panels-v",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I would like to use Radare2 to learn about how C is assembled into assembly but I am having trouble with the layout. I think the V! mode would be very handy as you can watch the registers update as the instruction pointer moves through the program, but I don't understand the layout.</p>\n<p>This is an example of they layout I would like: \n<a href=\"https://i.sstatic.net/gooa3.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/gooa3.png\"/></a></p>\n<p>It seems when I add a window (like Stack or Registers in this photo) it appears offscreen and I have to try closing different and splitting windows until the layout kind of falls into place. Is there an easy way to change exactly what is in each window?</p>\n<p>I know 'X' closes a window, 'z' switches the current window to the front, and '-' / '|' split a window.</p>\n<p>I have tried looking at the help but can't seem to figure out any other commands related to this issue.</p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "1k",
    "tags": [
        "x86",
        "radare2",
        "static-analysis"
    ],
    "user": "Aaron",
    "time": "Apr 30, 2019 at 7:24",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE. If you literally just want to see how the compiler translates stuff to assembly you may be better off using a compiler (GCC's and Clang's <code>-S</code> switch may be helpful here). Additionally you can use the <a href=\"https://gcc.godbolt.org/\" rel=\"nofollow noreferrer\">Compiler Explorer</a> or install your own instance of it (it's open source).</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Use <kbd>TAB</kbd> to move between the windows, use <kbd>e</kbd> to change name and command of a specific panel you are on. Use <kbd>w</kbd> to enter the window mode. \"Window mode\" allows you to control how the panels look like. In window-mode you can use <kbd>HJKL</kbd> to resize the window's height and width.</p>\n<p>This should answer your question \"Is there an easy way to change exactly what is in each window?\". Because you can simply select a panel and use <kbd>e</kbd> to change its content :)</p>\n<p>Don't forget to use <kbd>?</kbd> in the different visual screens to get more help</p>\n</div>",
            "votes": "6",
            "user": "Megabeets",
            "time": "Jan 16, 2019 at 10:31",
            "is_accepted": false,
            "comments": []
        }
    ]
}