{
    "title": "Compressed PS2 .RAW File",
    "link": "https://reverseengineering.stackexchange.com/questions/20610/compressed-ps2-raw-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've been trying to translate Fullmetal Alchemist 3, i extracted the CFC.DIG file (Main data file) using a QuickBMS script. but now I'm stuck with these .Raw files from RACJIN games, [same case as Bleach Soul Carnival]. It generate two folders \"0\": Characters in game voice \"1\": Texture, Models, Animations.. the files seems to be compressed with a unknown algorhythm..</p>\n<p>here's  hex dump of the first few bytes in the file: <a href=\"https://imgur.com/a/3DM6imQdo\" rel=\"nofollow noreferrer\">https://imgur.com/a/3DM6imQdo</a> it not reveal any obvious header structure.</p>\n<p>i wonder if is possible to do it.. anyone could help me with that? </p>\n<p>.RAW Folder \"1\" sample: <a href=\"https://www.dropbox.com/s/w41oxpwq8ph7m56/1%20Folder%20Sample.7z?dl=0\" rel=\"nofollow noreferrer\">https://www.dropbox.com/s/w41oxpwq8ph7m56/1%20Folder%20Sample.7z?dl=0</a></p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "585",
    "tags": [
        "file-format",
        "decompress"
    ],
    "user": "Naruto Classic's",
    "time": "Feb 12, 2019 at 23:05",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is not a real answer so I think this belongs in the comments section, but I don't have enough reputation, so.</p>\n<p>I opened the sample files with the HxD hex editor and ran a byte-value count analysis. All the files show a similar pattern:</p>\n<p><a href=\"https://i.sstatic.net/RoJHm.png\" rel=\"nofollow noreferrer\"><img alt=\"00000223_6635792_10.raw byte-value count analysis\" src=\"https://i.sstatic.net/RoJHm.png\"/></a></p>\n<p>From this I can tell the files are not encrypted or compressed (or, at most, use a very basic compression - maybe RLE or such). Compressed files tend to have very random values so you would expect a more or less plain graph.</p>\n<p>Those spikes you see, the higher ones (except zero, in red) correspond to bytes with power-of-two values. Then, halfway between one spike and another you have slightly lower spikes. And so on and so on. This makes me guess. Maybe the files are precalculated tables? Binary trees? Some kind of lookup data? I don't know. Anyway, I hope this helps you a little.</p>\n</div>",
            "votes": "1",
            "user": "Vii",
            "time": "Feb 13, 2019 at 0:36",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Naruto Classic's",
                    "text": "<span class=\"comment-copy\">Thanks for the Reply! i really noob about reverse engineering,,, i read some guys saying somethin' about chunk data, 3byte RGB... it is possible to decompress it? Racjin use the same file type in all the games.. i saw a russian team named NoRG patch  FMA3, but no success on tryin' to contact them <a href=\"http://rutracker.org/forum/viewtopic.php?t=395924\" rel=\"nofollow noreferrer\">rutracker.org/forum/viewtopic.php?t=395924</a></span>",
                    "time": null
                }
            ]
        }
    ]
}