{
    "title": "What is the most efficient way to detect and to break xor encryption?",
    "link": "https://reverseengineering.stackexchange.com/questions/2062/what-is-the-most-efficient-way-to-detect-and-to-break-xor-encryption",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I know that modern cryptographic algorithms are as close as they can to fully random data (<a href=\"http://en.wikipedia.org/wiki/Ciphertext_indistinguishability\">ciphertext indistinguishability</a>) and that trying to detect it is quite useless. But, what can we do on weak-crypto such as <strong>xor encryption</strong> ? Especially if we can get statistical studies of what is encrypted ? </p>\n<p>What are the methods and which one is the most efficient (and under what hypothesis) ? And, finally, how to break efficiently this kind of encryption (only based on a statistical knowledge of what is encrypted) ?</p>\n</div>",
    "votes": "24",
    "answers": 3,
    "views": "58k",
    "tags": [
        "cryptography",
        "cryptanalysis"
    ],
    "user": "perror",
    "time": "Oct 12, 2013 at 19:21",
    "comments": [
        {
            "user": "xort",
            "text": "<span class=\"comment-copy\">You mean xor encoding - as far as I know, there is no such thing as XOR encryption :)</span>",
            "time": null
        },
        {
            "user": "perror",
            "text": "<span class=\"comment-copy\">In fact, I think that 'xor encoding', 'xor encryption' and 'xor cipher' are all equally used to refer to this technique. Don't you think ?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>XOR encryption with a short pad (i.e., shorter than the plaintext) is basically the Vigenère cipher. So <a href=\"http://en.wikipedia.org/wiki/Vigen%C3%A8re_cipher#Cryptanalysis\">standard techniques to break Vigenère</a> should break xor encryption.</p>\n<p>The basic idea is that if the encryption key is <strong>d</strong> symbols long, every <strong>d</strong>-th symbol is encrypted with the same pad. Thus, take every <strong>d</strong>-th ciphertext symbol and treat it like simple substitution cipher, break that and you have the 1st symbol of the key. Repeat for the <strong>d+1</strong>-th ciphertext symbols, <strong>d+2</strong>-th ciphertext symbols, etc. Eventually you will have all <strong>d</strong> symbols of the key.</p>\n<p>To break the <a href=\"http://en.wikipedia.org/wiki/Substitution_cipher\">simple substitution</a> ciphers, you might try brute force (if the symbol set is small) and compare possible plaintexts with the statistical data you know. For certain plaintexts (english language for example) you can often break most of it even quicker (e.g., with english language text the most frequent symbol in ciphertext probably maps back to an <em>e</em>, etc). </p>\n<p>Now, you may be thinking, what if you don't know <strong>d</strong>. Often with Vigenère, the length of the key is brute forced. Try d=1, d=2, d=3,... For each d, see how well the output plaintext matches the statistical data. Return the key for which the plaintext most closely matched the statistical data.</p>\n</div>",
            "votes": "16",
            "user": "mikeazo",
            "time": "May 20, 2013 at 19:04",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Vedaad Shakib",
                    "text": "<span class=\"comment-copy\">Is there any way if your ciphertext is relatively short?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In case of multibyte XOR frequency analysis is the way to go.</p>\n<p>As is commonly known, most frequent character in regular English text is E (etaoinshrdlu being the top 12) but in some cases space (0x20 in ascii) can be more frequent, especially in shorter messages.</p>\n<p>For executable code on the other hand, tho I can't find a reference, most frequent characters would be 0x00 or 0xFF both being common for integers. Do note that for executable code and binary files you can have some shortcuts. For example if you know that on some location in the ciphertext a 0x00 byte (or a sequence) MUST occur, it will leak the part of the key.</p>\n<p>In case of single byte XOR, the keyspace is limited to 256 characters obviously.</p>\n<p>There is a simple python tool by hellman called <a href=\"https://github.com/hellman/xortool\" rel=\"noreferrer\">xortool</a> which is particularly handy for CTF challenges :)</p>\n<blockquote>\n<p>A tool to do some xor analysis:</p>\n<ul>\n<li>guess the key length (based on count of equal chars)</li>\n<li>guess the key (base on knowledge of most frequent char)</li>\n</ul>\n</blockquote>\n</div>",
            "votes": "13",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">Extremely nice tool ! Thanks for the link.</span>",
                    "time": null
                },
                {
                    "user": "Dominik Antal",
                    "text": "<span class=\"comment-copy\">Or in case of Windows binary executable the first two bytes will be 0x4D5A (the MZ magic header).</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Just to add to the list. SANS posted a blog about a week ago on different tools for XOR encryption. The list is very good and it provides several tools, all which are good in my opinion. </p>\n<p>Here is the link : <a href=\"http://computer-forensics.sans.org/blog/2013/05/14/tools-for-examining-xor-obfuscation-for-malware-analysis\">SANS Blog on XOR tools</a></p>\n</div>",
            "votes": "7",
            "user": "k0ng0",
            "time": "May 21, 2013 at 3:25",
            "is_accepted": false,
            "comments": []
        }
    ]
}