{
    "title": "Windows 10 will not run hex edited application",
    "link": "https://reverseengineering.stackexchange.com/questions/20703/windows-10-will-not-run-hex-edited-application",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm in a reverse engineering class. Our current assignment is to edit a notepad.exe application. Just to start out, I opened my notepad.exe in FlexHex, went to the end of the.rsrc section, changed a byte in one of the stock text strings from \"70\" to \"31\" and then saved the new file as an .exe. The size of the section and the overall file remains the same. Below is the line I changed.</p>\n<p><a href=\"https://i.sstatic.net/XDfp3.png\" rel=\"nofollow noreferrer\"><img alt=\".rsrc line I changed\" src=\"https://i.sstatic.net/XDfp3.png\"/></a></p>\n<p>When I try to run the file, I get an error that Windows cannot run the file, specifically \"This app cannot run on your PC\". I didn't think that I changed anything essential. I'm wondering if Windows is preventing me from running a modified version of a Window's program. Is there a way to specify that Windows should run this program?</p>\n<p>Any help is appreciated, thank you.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "958",
    "tags": [
        "operating-systems",
        "binary-editing"
    ],
    "user": "lll",
    "time": "Jun 17, 2020 at 9:54",
    "comments": [
        {
            "user": "wisk",
            "text": "<span class=\"comment-copy\">This is weird. If you have this error message, it means you, somehow, corrupted the executable. If you try to execute notepad.exe from another designed folder (e.g. desktop), the application won't run and you won't get any error message. This is because the .mui is not present is the current folder. I suggest you share the modified executable for further investigations.</span>",
            "time": null
        },
        {
            "user": "peter ferrie",
            "text": "<span class=\"comment-copy\">I suggest that you perform a \"fc\" to compare the before and after versions to see what changed.  Perhaps FlexHex made additional changes, like saving in ASCII instead of binary format.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I think “notepad.exe” has been digitally signed by Microsoft. You cannot change it because the signature will ( very very probably) be invalid. The OS doesn’t trust it anymore. </p>\n</div>",
            "votes": "2",
            "user": "Henno Brandsma",
            "time": "Feb 25, 2019 at 5:14",
            "is_accepted": true,
            "comments": [
                {
                    "user": "mrexodia",
                    "text": "<span class=\"comment-copy\">Some evidence to back this claim up would be good.</span>",
                    "time": null
                }
            ]
        }
    ]
}