{
    "title": "Difference between DllMain and DllEntryPoint",
    "link": "https://reverseengineering.stackexchange.com/questions/2079/difference-between-dllmain-and-dllentrypoint",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a piece a malware to analyze. It is a DLL according to the <code>IMAGE_FILE_HEADER-&gt;Characteristics</code>. I was trying to do some dynamic analysis on it. I have done the following:</p>\n<ul>\n<li>Run it with <code>rundll32.exe</code>, by calling its exports. Nothing.</li>\n<li>Changed the binary's characteristics to an exe. Nothing.</li>\n</ul>\n<p>So I moved on to static analysis, Loaded on IDA and OllyDbg.\nWhich brings me to my question. :)</p>\n<p><strong>What is the main difference between <code>DllMain</code> and <code>DllEntryPoint</code>?</strong></p>\n<p><strong>When/How does one get call vs the other?</strong></p>\n<p><strong>[EDIT]</strong></p>\n<p>So after reading MSDN and a couple of books on MS programming. I understand <code>DllEntryPoint</code>.\n<code>DllEntryPoint</code> is your <code>DllMain</code> when writing your code. Right?!\nSo then why have <code>DllMain</code>. In other words, when opening the binary in IDA you have <code>DllEntryPoint</code> and <code>DllMain</code>.</p>\n<p>I know it is probably something easy but I am visual person, so obviously not seeing something here.</p>\n</div>",
    "votes": "16",
    "answers": 3,
    "views": "23k",
    "tags": [
        "windows",
        "malware",
        "dll"
    ],
    "user": "k0ng0",
    "time": "Jun 22, 2020 at 11:29",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Both, <code>DllMain</code> and <code>DllEntryPoint</code> are merely symbolic names of the same <em>concept</em>. They even share the same prototype. But they aren't the same:</p>\n<blockquote>\n<p>The function must be defined with the <code>__stdcall</code> calling convention.\n  The parameters and return value must be defined as documented in the\n  Win32 API for <code>WinMain</code> (for an .exe file) or <code>DllEntryPoint</code> (for a DLL).\n  It is recommended that you let the linker set the entry point so that\n  the C run-time library is initialized correctly, and C++ constructors\n  for static objects are executed.</p>\n<p>(MSDN Library from Visual Studio 2005)</p>\n</blockquote>\n<p>The entry point in a DLL is the same as in an EXE <em>technically</em>, but with different semantics and prototype (EXE vs. DLL). Both are to be found at <code>IMAGE_OPTIONAL_HEADER::AddressOfEntryPoint</code>. However, in a DLL this entry point is optional (although usually supplied by the runtime library). <strong>The entry point isn't explicitly exported through the export directory</strong> (although IDA for example shows them under \"Exports\"). Most of the time there is no public name attached to this entry point, which is why the documentation refers to it as <code>DllEntryPoint</code>. If you find this name in the export directory of the PE file it's probably not the actual entry point from the PE optional header (this would have to be confirmed by looking at the exact sample, though). The last point, btw, holds for <code>DllMain</code> as well.</p>\n<p><a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/ms682583%28v=vs.85%29.aspx\" rel=\"noreferrer\"><code>DllMain</code></a> is the name the <strong>runtime library</strong> (ATL, MFC ...) implementation expects you to supply. It's a name the linker will see <em>referenced</em> from the default implementation of <code>DllEntryPoint</code> which is named <code>_DllMainCRTStartup</code> in the runtime implementations. See the CRT source files <code>crtdll.c</code> and <code>dllcrt0.c</code> if you have Visual Studio.</p>\n<p>This means that <code>DllEntryPoint</code> <strong>calls</strong> <code>DllMain</code> - assuming default behavior. The runtime-implemented entry point function (<code>_DllMainCRTStartup</code>) does other initialization.</p>\n<p>You can override this name by using the <a href=\"http://msdn.microsoft.com/en-us/library/f9t8842e%28v=vs.80%29.aspx\" rel=\"noreferrer\"><code>/entry</code> command line switch</a> to the linker. Again, it's just a name and you can choose whatever you fancy. The limitations (not being able to load another DLL using <code>LoadLibrary</code> from within the entry point and so on) are independent of the name you give the function.</p>\n<hr/>\n<p>Side-note: in an EXE the TLS callbacks run before the entry point code, which can be dangerous in malware research. <s>I don't think this is relevant to DLLs, though, but if someone has more knowledge in that area I'm interested to see pointers to material.</s></p>\n<p><a href=\"https://reverseengineering.stackexchange.com/users/1323/peter-ferrie\">Peter Ferrie</a>, a distinguished reverser and malware analyst, pointed out in a comment to this answer:</p>\n<blockquote>\n<p>TLS callbacks always run in statically-linked DLLs, and since Vista,\n  they also run in dynamically-linked DLLs! For more information, see my\n  <a href=\"http://pferrie.host22.com/papers/com2008.htm\" rel=\"noreferrer\">TLS presentations</a>, and of\n  course my <a href=\"http://pferrie.host22.com/papers/unp2011.htm\" rel=\"noreferrer\">\"Ultimate\" Anti-Debugging Reference</a></p>\n</blockquote>\n<p>Thanks Peter.</p>\n</div>",
            "votes": "14",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": [
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">TLS callbacks always run in statically-linked DLLs, and since Vista, they also run in dynamically-linked DLLs!  For more information, see my TLS presentations (<a href=\"http://pferrie.host22.com/papers/com2008.htm\" rel=\"nofollow noreferrer\">pferrie.host22.com/papers/com2008.htm</a>), and of course my \"Ultimate\" Anti-Debugging Reference (<a href=\"http://pferrie.host22.com/papers/unp2011.htm\" rel=\"nofollow noreferrer\">pferrie.host22.com/papers/unp2011.htm</a>).</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><strong><code>DllEntryPoint</code></strong> - is the address from which the execution will start (but does not have to if we are speaking about malware) after the loader had finished the loading process of the PE image. This address is specified inside the PE optional header. Please look <a href=\"http://www.csn.ul.ie/~caolan/publink/winresdump/winresdump/doc/pefile.html\" rel=\"noreferrer\">here</a>. The other name for <code>DllEntryPoint</code> is <code>AddressOfEntryPoint</code>.</p>\n<p><strong><code>DllMain</code></strong> - is the default function name that is given during DLL development and it is how the compiler knows that it should take the address of this function and put it inside PE <code>AddressOfEntryPoint</code> field. The developer can change this name to whatever he wants but he should instruct the compiler then, what function to use in that case. In addition, if the library is just a bunch of functions (let's say not an application ), then the compiler will provide default implementation of the <code>DllMain</code> function. Please look further <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/ms682583%28v=vs.85%29.aspx\" rel=\"noreferrer\">here</a> in remarks.</p>\n</div>",
            "votes": "13",
            "user": "0xC0000022L",
            "time": "May 23, 2013 at 12:42",
            "is_accepted": false,
            "comments": [
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">To what <b>MMavipc</b> has written, I'd add that DllMain is needed to prepare the environment or react differently to various events (Thread creation, loading dll into process, process termination) before the actual dll logic can be called. The call to the actual Dll logic sometimes can be seen in IDA as <i>StartAddress</i>.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>When loading time is involved the entry point is DllMain.<br/>\n(Ex. COM in-process server DLL).<br/>\nWhen running time is involved the entry point is DllEntryPoint.<br/>\n(Ex. LoadLibrary get called).     </p>\n</div>",
            "votes": "-1",
            "user": "GoUkraineGo",
            "time": "Jul 5, 2018 at 8:19",
            "is_accepted": false,
            "comments": []
        }
    ]
}