{
    "title": "Is there any decompiler, which can produce a compilable result?",
    "link": "https://reverseengineering.stackexchange.com/questions/20841/is-there-any-decompiler-which-can-produce-a-compilable-result",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I would like to decompile a 32-bit Linux executable to C, modify some parts of it, and then compile it back. I do not care if the C code is not pretty and really hard to maintain. The only thing I care is to be able to compile it back to a 32-bit executable.</p>\n<p>The program was written in C++ around 2006, but the source code was lost since then. It is not a small program, and it uses some dynamically linked libraries as well.</p>\n<p>I tried <a href=\"http://boomerang.sourceforge.net/\" rel=\"nofollow noreferrer\">Boomerang</a> and <a href=\"https://github.com/avast/retdec\" rel=\"nofollow noreferrer\">Avast RetDec</a>. None of them is able to provide a compilable result, but the one RetDec provides, is sometimes surprisingly readable. Unfortunately, I can not use this output to rewrite the project, because the code is really long. That is why I am looking for a way to produce compilable C code in the first place.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "481",
    "tags": [
        "decompilation",
        "c",
        "decompile",
        "compilers",
        "decompiler"
    ],
    "user": "Iter Ator",
    "time": "Nov 12, 2021 at 19:33",
    "comments": [
        {
            "user": "Rup",
            "text": "<span class=\"comment-copy\">How complex are the changes you need to make? It might be more practical to identify the parts you need to change and patch the existing binary rather than try and recompile everything.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Unfortunately no, there is no such decompiler publicly available. All decompilers have to guess the missing information and just one wrong answer is enough to spoil the result. Second, re-compilability is often not the goal.</p>\n</div>",
            "votes": "5",
            "user": "Ilfak Guilfanov",
            "time": "Mar 13, 2019 at 21:51",
            "is_accepted": false,
            "comments": []
        }
    ]
}