{
    "title": "How to retrace Database Changes from a Software",
    "link": "https://reverseengineering.stackexchange.com/questions/20916/how-to-retrace-database-changes-from-a-software",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>i need to retrace database changes by an specific application.\nThe database is really big(~8GB) and contains over 300 tables, and some of the tables have &gt; 100 columns. Another Problem is, that the database design isnt beautiful, as example most tables arent converted into the third normal form and columnnames are not meaningful.\nI only have a bit reverse experience with patching, debugging, and decompiling win32 PE Files. </p>\n<p>Luckily i have a lot experience in manual malware analytics and understand x86_64(Linux) ASM and masm. Hopefully this knowledge will help me in this task.</p>\n<p>so, my real question is, what are common approaches to understanding database changes and understanding what the different data mean?</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "30",
    "tags": [
        "pe",
        "tracing",
        "windows-10"
    ],
    "user": "frTsf3f",
    "time": "Mar 19, 2019 at 9:23",
    "comments": [
        {
            "user": "dingo_kinznerhook",
            "text": "<span class=\"comment-copy\">Can you give us some more information? What type of database is this? What type of changes are you trying to understand? You mean, like retrieving the history of previously-executed SQL commands that might be stored by the database? Or do you mean retrieving the previous transactions based on the database contents alone?</span>",
            "time": null
        },
        {
            "user": "frTsf3f",
            "text": "<span class=\"comment-copy\">it is a mySQL Database. The main goal is to insert valid data in the database. so if i do some action i wanna know what changes in the database are written.</span>",
            "time": null
        }
    ],
    "answers_data": []
}