{
    "title": "Android how can i hook native exported functions from a shared library *.so?",
    "link": "https://reverseengineering.stackexchange.com/questions/20943/android-how-can-i-hook-native-exported-functions-from-a-shared-library-so",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It needs to work even on older versions of android (3.x and above) specifically the old Sony \"PS Certified\" devices, the device im working with (Sony Tablet S) i have seen reports online that installing the xposed framework will brick the device however you CAN get root </p>\n<p>So is there any other way to hook native functions on android? </p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "1k",
    "tags": [
        "android"
    ],
    "user": "SilicaAndPina",
    "time": "Mar 23, 2019 at 3:38",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I would suggest using Frida framework for that purpose - <a href=\"https://www.frida.re\" rel=\"nofollow noreferrer\">link</a>. In short, it will enable you to hook native/Dalvik routines on rooted/non-rooted devices and write hook logic in JS. The framework also has python bindings which can provide means for automation. Following is a short explanation about the usage flow for analysis of APK file:</p>\n<ul>\n<li>Rooted device:\n\n<ul>\n<li>there is a great quick start guide on the Frida's site - <a href=\"https://www.frida.re/docs/android/\" rel=\"nofollow noreferrer\">link</a></li>\n<li><a href=\"https://www.notsosecure.com/instrumenting-native-android-functions-using-frida/\" rel=\"nofollow noreferrer\">here</a> is an example of hooking native function for a running APK file, but you can also use the framework to analyze arbitrary native executable which you can attach to or spawn a new process.</li>\n</ul></li>\n<li>Not-rooted device:\n\n<ul>\n<li>in that case you will need to re-package APK and include server library to it. <a href=\"https://koz.io/using-frida-on-android-without-root/\" rel=\"nofollow noreferrer\">Here</a> is a good example how to do it.</li>\n</ul></li>\n</ul>\n<p>The framework is in active development and cross-platform/arch supported. If more granular control is needed, you can even develop lower-level apps (e.g. in C) against it's API library.</p>\n</div>",
            "votes": "2",
            "user": "PhoeniX",
            "time": "Mar 23, 2019 at 19:09",
            "is_accepted": true,
            "comments": []
        }
    ]
}