{
    "title": "Defence against cracking [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/20964/defence-against-cracking",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<div>\n<aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n<div class=\"d-flex fd-column fw-nowrap\">\n<div class=\"d-flex fw-nowrap\">\n<div class=\"flex--item wmn0 fl1 lh-lg\">\n<div class=\"flex--item fl1 lh-lg\">\n<div>\n<b>Closed</b>. This question needs to be more <a href=\"/help/closed-questions\">focused</a>. It is not currently accepting answers.\n                                \n                            </div>\n</div>\n</div>\n</div>\n</div>\n<hr class=\"my12 outline-none baw0 bb bc-blue-400\"/>\n<div class=\"fw-nowrap fc-black-500\">\n<div class=\"d-flex fd-column lh-md\">\n<div class=\"mb0 d-flex\">\n<div class=\"flex--item mr8\">\n<svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\"><path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\"></path></svg>\n</div>\n<p><b>Want to improve this question?</b> Update the question so it focuses on one problem only by <a href=\"/posts/20964/edit\">editing this post</a>.</p>\n</div>\n<div class=\"mb0 mt6 d-flex\">\n<p class=\"ml24 pl2\">Closed <span class=\"relativetime\" title=\"2019-04-12 19:26:54Z\">6 years ago</span>.</p>\n</div>\n<div class=\"ml24 pl2\">\n</div>\n</div>\n</div>\n<div class=\"mt24 d-flex gsx gs8\">\n<a class=\"s-btn s-btn__outlined flex--item js-post-notice-edit-post\" href=\"/posts/20964/edit\">\n                        Improve this question\n                    </a>\n</div>\n</aside>\n</div>\n<p>Say I wrote an application and published demo version of it with a possibility to buy a full version. I was wondering if it is possible to stop people from cracking it, so that the only ones who use it are those who actually paid for it.\nIs it possible to achieve? If not, what are the best known techniques used to obstruct cracking?</p>\n</div>",
    "votes": "-3",
    "answers": 1,
    "views": "173",
    "tags": [
        "exploit",
        "patching"
    ],
    "user": "bart1e",
    "time": "6 years ago",
    "comments": [
        {
            "user": "n4sm",
            "text": "<span class=\"comment-copy\">You can use some obfuscation methods By example, a packer and an obfuscator</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Your question is very lacking as it is very very broad. To give a <em>precise answer</em> one would have to know details such as what programming language and toolchain you are using to write your software and what platforms you are targeting.</p>\n<p>What you are asking is virtually impossible to achieve unless you find some means make vital parts of your program inaccessible to the user/customer; such as on a hardware token, for example. This kind of token should be hard to duplicate and would be the thing only your paying customers have. The token could also make use of modern asymmetric cryptography, but that would likely be impractical as I can only conceive of a scenario where your software needs to know the public key to the secret ones stored on each of these tokens. <a href=\"https://reverseengineering.stackexchange.com/a/247/245\">Additional reading ...</a></p>\n<p>That said, you can already tell that I am suggesting a hardware dongle here. But there is an alternative that can work as well depending on what your software does and what the requirements of the users are.</p>\n<p>If the software can \"outsource\" some aspects of its functionality to a server under your sole control, then your program need not contain the full functionality. In such a case the server would verify some token/lease (a kind of code or subscription key, if you will) that can contain strongly encrypted data as long as only the server has the secret key to decrypt that data and verify the validity of the token/lease. Once verified, the server would perform the vital function of your program and merely send back the result. Problem here is that you have to design an API that cannot be abused by others to coerce the server into sending results to parties that are not paying customers of yours.</p>\n<p>Any offline method will require a hardware solution as outlined before. And only within the outlined constraints will this be an effective protection. And even then there is a slim chance someone figures out how to clone the hardware and the software on it.</p>\n<p>However, I think you might want to consider a few things before pursuing your desire for protection against :</p>\n<ul>\n<li>Is your software worth the hassle?</li>\n<li>How widely used is your software?</li>\n<li>How intrusive is the protection scheme you sign up for?\n\n<ul>\n<li>For example I am not willing to have some piece of software phone home at will. Similarly I'd have reservations about being given a hardware token, because if I lose it or it gets stolen or destroyed I may be facing several days of idling because that's how long it takes you to ship me a replacement. So <em>if</em> your software is so indispensable you will want to keep in mind the needs of the (paying) customers especially.</li>\n</ul></li>\n<li>Are you thinking more about \"software pirates\" than about your customers?\n\n<ul>\n<li>The effort you spend in a possibly futile attempt to protect your software from \"piracy\" is time you don't spend improving it for paying customers.</li>\n</ul></li>\n</ul>\n<p>Long story short: either you trust your customers in which case you can forget about truly secure means to protect your software. All of the means you have at your disposal in such a case are deterrents but will not ultimately stop a determined cracker (<a href=\"https://en.wikipedia.org/wiki/Security_through_obscurity\" rel=\"nofollow noreferrer\">security by obscurity</a>). If you don't trust your users/customers you <em>must</em> ensure that vital parts of your program are not accessible to them (e.g. stored on a hardware dongle or on some remote server).</p>\n<p>Consider IDA, the disassembler, one of the tools indispensable to a lot of us here on this site. To the best of my knowledge they use watermarking and the installer is protected by a password. The watermark will ensure that it's possible to trace back whose copy got compromised. But even in such a case not every leak can be attributed to the customer who paid for it. Some years back a disgruntled (ex-)employee of ESET leaked the IDA copy along with the decompiler plugin, for example. Hardly anything ESET could have done about that. The only deterrent for these cases is legal action that will hopefully deter future would-be delinquents from attempting something similar.</p>\n</div>",
            "votes": "3",
            "user": "0xC0000022L",
            "time": "Mar 27, 2019 at 14:03",
            "is_accepted": true,
            "comments": []
        }
    ]
}