{
    "title": "Windows GUI app without GetMessage imported?",
    "link": "https://reverseengineering.stackexchange.com/questions/21126/windows-gui-app-without-getmessage-imported",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am currently trying to reverse an app and I have one very stupid question I cannot figure out by myself.</p>\n<p>The app was packed using FSG 2.0 and I successfully manually unpacked it and rebuilt the IAT (at least I believe I did).\nThe app is a Windows 32 bits PE and it has a small GUI (it's a crackme that has one simple input and once you click ok, it just replies goodboy or badboy).</p>\n<p>From what I can see, it imports the SendMessage function and actually uses it but I can't find any GetMessage (nor PeekMessage) function imported.\nConsidering it is a GUI, is that even possible ?</p>\n<p>Any hints appreciated ! </p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "104",
    "tags": [
        "windows",
        "unpacking"
    ],
    "user": "reike",
    "time": "Apr 12, 2019 at 10:53",
    "comments": [
        {
            "user": "0xec",
            "text": "<span class=\"comment-copy\">If the binary resolves those functions dynamically at run-time using <code>GetProcAddress</code> (or other methods) you won't have a corresponding entry in the IAT.</span>",
            "time": null
        },
        {
            "user": "reike",
            "text": "<span class=\"comment-copy\">Thank you Sir for your answer. :) I didn't think about that. In that specific case, the binary doesn't even call GetProcAddress. However, for what it's worth, there is also a really good answer (the ticked one) that is related to my question here : <a href=\"https://reverseengineering.stackexchange.com/questions/3288/how-can-i-set-a-breakpoint-for-a-button-click\" title=\"how can i set a breakpoint for a button click\">reverseengineering.stackexchange.com/questions/3288/…</a>.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Much of the functionality for GDI32 and User32 has some implementation in the NT Native API. So there's a chance some function from there gets called and does the equivalent of GetMessage. Also, no need to call <code>GetProcAddress()</code> ... either use the NT Native API as well or better yet, walk the export table and find your desired function by hash. <a href=\"http://www.hick.org/code/skape/papers/win32-shellcode.pdf\" rel=\"nofollow noreferrer\">The technique</a> is <b>ancient</b> in terms of \"internet time\".</span>",
            "time": null
        },
        {
            "user": "reike",
            "text": "<span class=\"comment-copy\">Thanks for all your insight, much appreciated !</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In case of it could be useful to someone else, I finally managed to understand how the Windows messages are handled in the program I'm trying to reverse (rather simple in fact). It's calling DialogBoxParamA (<a href=\"https://docs.microsoft.com/en-us/windows/desktop/api/winuser/nf-winuser-dialogboxparama\" rel=\"nofollow noreferrer\">https://docs.microsoft.com/en-us/windows/desktop/api/winuser/nf-winuser-dialogboxparama</a>) : the before last parameter is a pointer to the procedure in charge of handling the messages.</p>\n</div>",
            "votes": "0",
            "user": "reike",
            "time": "Apr 15, 2019 at 10:56",
            "is_accepted": true,
            "comments": []
        }
    ]
}