{
    "title": "Program closing even with IsDebuggerPresent Patched!",
    "link": "https://reverseengineering.stackexchange.com/questions/21237/program-closing-even-with-isdebuggerpresent-patched",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>i'm in some serious problems when trying to debug a program with ollydbg, i patched IsDebuggerPresent but still after starting debugging with it patched it will Terminate anyways.</p>\n<p>Steps i Followed are shown in this guide:</p>\n<p><a href=\"https://stackoverflow.com/questions/10330147/how-do-i-bypass-isdebuggerpresent-with-ollydbg\">https://stackoverflow.com/questions/10330147/how-do-i-bypass-isdebuggerpresent-with-ollydbg</a></p>\n</div>",
    "votes": "-1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "debugging",
        "ollydbg",
        "anti-debugging"
    ],
    "user": "xSePzEr",
    "time": "Apr 29, 2019 at 2:18",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">Maybe the program uses more than this one technique to detect debugging. Share the binary so that we can have a look</span>",
            "time": null
        },
        {
            "user": "xSePzEr",
            "text": "<span class=\"comment-copy\">@PawełŁukasik to share it should i upload the .exe or what should i do? Thanks for replying. Tought no one was going to help me</span>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">Yes, sharing the .exe might help you get some answers. Without that it just speculation what might be happening.</span>",
            "time": null
        },
        {
            "user": "xSePzEr",
            "text": "<span class=\"comment-copy\">I've uploaded the file, if you are going to check it out please let me know everything about what can the problems be and if it's not a hassle the way to fix all that. I will give u some things that i think it has: -First, debug protection obviously, also, -it detects what program are we using or something like that and closes the program, i tried dnspy and Olly and it kills those processes. -It wont work if trying to deobfuscate with de4dot - [link]<a href=\"https://www.mediafire.com/file/1e0ua9jt3ajpju9/UnpackMe.exe/file\" rel=\"nofollow noreferrer\">mediafire.com/file/1e0ua9jt3ajpju9/UnpackMe.exe/file</a> - Please lmk if u find out the way to patch it. Thanks for everything!</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you are using OllyDbg, I suggest installing an anti-anti-analysis plug such as <a href=\"https://github.com/x64dbg/ScyllaHide\" rel=\"nofollow noreferrer\">ScyllaHide</a>.  For ScyllaHide, grab the latest from the releases and follow the instructions in the ScyllaHide.pdf document.  Then you can try the various techniques simply through a set of checkboxes.</p>\n<p>Generally, if you suspect that a particular anti-analysis technique is being used but your mitigation technique is not working, then you should check for that anti-analysis technique manually.  To do this with IsDebuggerPresent, or any other API call, go to the function (in Ollydbg, ctrl-g and enter \"IsDebuggerPresent\" without the quotes) and set a breakpoint (F2 for software BP, or right-click -&gt; breakpoint -&gt; hardware) on the first instruction or any instruction before the first branch (e.g. jmp, conditional jump, call).  Sometimes the program will check for a change to certain APIs or skip over the first few instructions.</p>\n</div>",
            "votes": "1",
            "user": "knowmalware",
            "time": "Apr 30, 2019 at 0:56",
            "is_accepted": false,
            "comments": [
                {
                    "user": "xSePzEr",
                    "text": "<span class=\"comment-copy\">Hello, Thanks for replying!  I've already installed ScyllaHide and i tried it on x64dbg and i did too in Olly, the program anyways will end up closing, i've tried different profiles from scylla, i've patched IsDebuggerPresent too but that's not enough, the program will still close. Looks like there are lots of protections on the file. If you want i can give you the .exe so u check it out.</span>",
                    "time": null
                }
            ]
        }
    ]
}