{
    "title": "Detecting cracked Themida packed malware",
    "link": "https://reverseengineering.stackexchange.com/questions/21265/detecting-cracked-themida-packed-malware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm working in a large SOC and my manager has tasked me with finding some way to provide coverage for Themida packed malware samples.</p>\n<p>As alluring as it is to suggest just blacklisting all Themida packed software and calling it a day, I would like to do my due diligence before I take that approach.</p>\n<p>I noticed that Themida claims to digitally watermark their executables to protect against piracy, and copies of the software are available for torrent on many pirate sites. I was wondering whether the software left the watermark on the packed executables, and whether the pirated software leaves a watermark on the packed binaries that could be signed against. </p>\n<p>I know that this is a thing based off of the answer to this post: <a href=\"https://reverseengineering.stackexchange.com/questions/1478/how-common-are-virtualized-packers-in-the-wild/1479#1479\">How common are virtualized packers in the wild?</a>, but the person who answered provided sources for all of his other claims besides this one.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "3k",
    "tags": [
        "malware",
        "security",
        "yara"
    ],
    "user": "solumnant",
    "time": "May 2, 2019 at 17:32",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>From <a href=\"http://www.oreans-support.com/kmp/index.php?/article/AA-00553/7/General/Whats-the-purpose-of-the-Taggant-Information-feature-in-the-Protection-Options-panel.html\" rel=\"nofollow noreferrer\">Oreans KB</a>:</p>\n<blockquote>\n<p>The Taggant System is a cryptographic signature added to a software to\n  fight against antivirus false positives in protected applications. The\n  Taggant information in your Themida/WinLicense license contains an\n  internal ID and your private key to insert and sign the protected\n  binary with your Taggant information, so antivirus companies can\n  detect that the application is protected by a trusted customer and not\n  report it as false positive. Notice that if a license is leaked and\n  used to protect malware/virus, antivirus companies will blacklist that\n  Taggant signature and anything protected with that license will be\n  marked as virus/malware.</p>\n<p>More information about the IEEE Software Taggant System:</p>\n<ul>\n<li><a href=\"http://standards.ieee.org/develop/indconn/icsg/taggant.pdf\" rel=\"nofollow noreferrer\">http://standards.ieee.org/develop/indconn/icsg/taggant.pdf</a></li>\n<li><a href=\"http://en.wikipedia.org/wiki/Software_taggant\" rel=\"nofollow noreferrer\">http://en.wikipedia.org/wiki/Software_taggant</a></li>\n</ul>\n<p>Please, notice that we are expecting that antivirus companies will\n  enable the Taggant System into their products as soon as possible, but\n  it might take some time till the Taggant System is fully ready in all\n  antiviruses companies. </p>\n<p>When you enable the “Taggant Information” option you will require\n  internet connection in protection time to compute your Taggant\n  information and be able to insert it inside the protected binary (it\n  connects to “<a href=\"http://taggant-tsa.ieee.org/\" rel=\"nofollow noreferrer\">http://taggant-tsa.ieee.org/</a>”). If no internet connection\n  is available in protection time, your application will be protected\n  normally, but it won’t contain any Taggant information.</p>\n</blockquote>\n<p>So supposedly the legit binaries should have a valid tag signed with a non-blacklisted certificate. See the links for more details. There is <a href=\"https://github.com/IEEEICSG/IEEE_Taggant_System\" rel=\"nofollow noreferrer\">some code on Github</a> too. </p>\n<hr/>\n<p><strong>EDIT</strong> apparently the taggant servers <a href=\"http://vmpsoft.com/20180505/ieee-amss-taggant-system-will-shut-down-on-31-july-2018/\" rel=\"nofollow noreferrer\">were shut down in 2018</a> so probably this can't be used for real-time checks anymore but maybe you can still detect bad files if tags are added by the leaked versions...</p>\n</div>",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "May 2, 2019 at 19:12",
            "is_accepted": true,
            "comments": [
                {
                    "user": "solumnant",
                    "text": "<span class=\"comment-copy\">Taggants are dead to to lack of industry uptake, the IEEE page describing taggants has had the details section scrubbed: <a href=\"http://vmpsoft.com/20180505/ieee-amss-taggant-system-will-shut-down-on-31-july-2018/\" rel=\"nofollow noreferrer\">vmpsoft.com/20180505/…</a> <a href=\"https://standards.ieee.org/industry-connections/icsg/amss.html\" rel=\"nofollow noreferrer\">standards.ieee.org/industry-connections/icsg/amss.html</a></span>",
                    "time": null
                },
                {
                    "user": "solumnant",
                    "text": "<span class=\"comment-copy\">I think the best way to go would be to just block Themida packed PE files, taggents are only present if they are enabled by the packer at packing time and the packer is connected to the internet. I don't believe that the environment around taggents was ever mature enough to be supported by any library.</span>",
                    "time": null
                }
            ]
        }
    ]
}