{
    "title": "Understand DLL function signature from ordinal",
    "link": "https://reverseengineering.stackexchange.com/questions/21281/understand-dll-function-signature-from-ordinal",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying with ghidra to reverse a 32-bit proprietary application that uses <code>mfc42.dll</code> and I'm obtaining mixed results with respect to imported functions.</p>\n<p>To my surprise the <code>DLL</code>s don't use names to export functions like the <code>ELF</code> format, but use the so called <strong>ordinals</strong> and you need another file (the corresponding <code>.lib</code>) to link them with the actual name.</p>\n<p>In the binary there is a particular function that seems to call ordinal 4129 and ordinal 5710 corresponding to <code>CString::Left(int)</code> and <code>CString::Right(int)</code> respectively (ghidra internally uses an XML to track the correspondence function &lt;-&gt; ordinal).</p>\n<p>But if I check the actual assembly of this function seems that these functions take a further argument (this can be deduced from the stack depth value that you can enable along the disassembly with ghidra). Obviously I'm taking into account the fact that the class instance is passed via the <code>ecx</code> register but that it's not relevant for the discussion, <strong>I'm interested in the arguments passed using the stack</strong>.</p>\n<p>Trying to reverse the dll itself, indeed ghidra finds out the signature as having two arguments but bad enough it cannot tell what is the actual name of these functions.</p>\n<p>Since <code>mfc42.dll</code> (I think) is a pretty standard library can anyone explain to me what is going on?</p>\n<p>To add information, the application seems compiled using Visual Studio VC6, this can be deduced from the signature of the <code>FuncInfo</code> structure that is <code>0x19930520</code>.</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "2k",
    "tags": [
        "dll",
        "ghidra",
        "mfc",
        "pe32"
    ],
    "user": "gipi",
    "time": "May 5, 2019 at 20:24",
    "comments": [
        {
            "user": "Johann Aydinbas",
            "text": "<span class=\"comment-copy\">Had a quick look in IDA which fetched debug symbols for mfc42.dll and reading the code, it seems like <code>CString::Left</code> actually takes 2 arguments of type <code>CString</code>, one as the source, one as the destination.</span>",
            "time": null
        },
        {
            "user": "gipi",
            "text": "<span class=\"comment-copy\">thanks @JohannAydinbas, could you share the path in your windows installation so that I can check myself? and possibly share what IDA shows you?</span>",
            "time": null
        }
    ],
    "answers_data": []
}