{
    "title": "Is it possible to proxify custom windows application without installing any additional software (programatically)",
    "link": "https://reverseengineering.stackexchange.com/questions/21333/is-it-possible-to-proxify-custom-windows-application-without-installing-any-addi",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is it possible somehow to set reverse proxy for a windows application (e.g. by creating a wrapper launcher for this application) that will proxify all HTTP/S requests of this application? </p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "243",
    "tags": [
        "proxy"
    ],
    "user": "WhiteAngel",
    "time": "May 19, 2019 at 8:12",
    "comments": [
        {
            "user": "julian",
            "text": "<span class=\"comment-copy\">Please explain what this has to do with reverse engineering.</span>",
            "time": null
        },
        {
            "user": "WhiteAngel",
            "text": "<span class=\"comment-copy\">You might need to reverse the program and add e.g. JMP instruction to go to the proxy instead of original flow. This was my idea.</span>",
            "time": null
        },
        {
            "user": "julian",
            "text": "<span class=\"comment-copy\">so did you reverse a program to see if this is the case? What have you tried? What research have you done that relates to this? Please share your findings.</span>",
            "time": null
        },
        {
            "user": "WhiteAngel",
            "text": "<span class=\"comment-copy\">@julian my question is not connected to any specific program. I'm just asking about the possible methods of proxying http requests of the program without installing 3rd party tools. And I found no answer in Internet that's why I'm here.</span>",
            "time": null
        },
        {
            "user": "julian",
            "text": "<span class=\"comment-copy\">Again, it's not clear what this has to do with reverse engineering. Theoretically, you can modify a program to do whatever you want via techniques such as using code caves, DLL injection, patching, instrumentation, parasite code, etc. So yes, it does seem to be possible. But the question has no details or specific information</span>",
            "time": null
        }
    ],
    "answers_data": []
}