{
    "title": "How to generate exe from compiled Python files?",
    "link": "https://reverseengineering.stackexchange.com/questions/21431/how-to-generate-exe-from-compiled-python-files",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have extracted compiled files from exe (executable in windows) using \n<strong>PyInstaller Extractor</strong> script. <br/> <br/>\nIn Resultant folder, i have got was pyc files bundled in pyz folder. \nThen I decompiled files (using <strong>uncompyle6</strong>) from pyc to py. \nThen updated code in py files and recompiled back to pyc files.</p>\n<p><em>My question is how can i convert these pyz bundled folder back to 'exe' so that it can be executed in windows?</em></p>\n<p>I tried pyinstaller, but could not find any .spec file or entry py file to begin this process. \nwhat are the steps to achieve this required result.</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "3k",
    "tags": [
        "pe",
        "python",
        "crackme",
        "windows-10"
    ],
    "user": "RS Gamer",
    "time": "Jun 6, 2019 at 11:08",
    "comments": [
        {
            "user": "sudhackar",
            "text": "<span class=\"comment-copy\">once you have py file you can use <a href=\"http://www.py2exe.org/\" rel=\"nofollow noreferrer\">py2exe</a> to wrap it in an exe.</span>",
            "time": null
        },
        {
            "user": "RS Gamer",
            "text": "<span class=\"comment-copy\">i understand pyinstaller or py2exe can be used to convert project to exe. but problem is pyz folder has more than 100 pyc files, which file could be used as entry file that is unknown.</span>",
            "time": null
        },
        {
            "user": "RS Gamer",
            "text": "<span class=\"comment-copy\">e.g. python setup.py py2exe , but how to determine what's setup.py file, which is linked to all other remaing files. or pyinstaller abc.py --onefile or using spec file  pyi-build foobarzap.spec  but i have got compiled files in pyc format, so what the way around to compile those to one exe file.  i am trying to accomplish something like this <a href=\"https://hshrzd.wordpress.com/2018/01/26/solving-a-pyinstaller-compiled-crackme/\" rel=\"nofollow noreferrer\">hshrzd.wordpress.com/2018/01/26/…</a></span>",
            "time": null
        },
        {
            "user": "RS Gamer",
            "text": "<span class=\"comment-copy\">I have found the file which is the entry file, it is of file type. So I have copied first 8 bytes header from other  (pyc) file to this entry file and tried to decompile it. But it is saying invalid marshal code. Now my concern is how many bytes and from which point shall I copy header from other file. So that I have correct header information. Python version is 2.7</span>",
            "time": null
        },
        {
            "user": "mucheng ding",
            "text": "<span class=\"comment-copy\">have you tried auto_py_to_exe?</span>",
            "time": null
        }
    ],
    "answers_data": []
}