{
    "title": "Is it possible to hijack a C++ DLL after it has been loaded into the memory space? How?",
    "link": "https://reverseengineering.stackexchange.com/questions/21512/is-it-possible-to-hijack-a-c-dll-after-it-has-been-loaded-into-the-memory-spac",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a .Net application, in which a C++ DLL <a href=\"https://stackoverflow.com/a/768429/3834\">is embedded as a resource</a> into the application.</p>\n<p>When the .Net application is running, I will extract the C++ DLL to a temporary folder, and after that, my .Net code will immediately load the C++ DLL into the memory and use it by calling a function on the C++ via interop.</p>\n<p>My concern is that with scheme like this, is it possible for an attacker to somehow (still) hijack the C++ DLL and replace it with his own compromised version? Or is it possible to hijack a C++ DLL after it has been loaded into the memory space?</p>\n<p>If yes, how?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "381",
    "tags": [
        "c++",
        "c#",
        "dll-injection"
    ],
    "user": "Graviton",
    "time": "Jun 19, 2019 at 6:01",
    "comments": [
        {
            "user": "Johann Aydinbas",
            "text": "<span class=\"comment-copy\">What is the attack scenario you want to defend against? If an attacker may inject code into your application at runtime, he can do pretty much whatever he wants, including forcing your application to read the DLL from another location instead of the temporary directory. Or he can modify the DLL in-memory after it's loaded, too.</span>",
            "time": null
        },
        {
            "user": "Graviton",
            "text": "<span class=\"comment-copy\">I want to ensure that my C++ dll is always the genuine copy, and not replaced by hacker</span>",
            "time": null
        },
        {
            "user": "Graviton",
            "text": "<span class=\"comment-copy\"><i>If an attacker may inject code into your application at runtime</i>-- how is it possible, given that my .Net application has anti-debugging feature</span>",
            "time": null
        },
        {
            "user": "bart1e",
            "text": "<span class=\"comment-copy\">Anti debugging features <b>will not</b> prevent a determined reverse engineer from debugging your application. An interesting article about breaking even sophisticated techniques: <a href=\"http://www.oklabs.net/skype-reverse-engineering-the-long-journey/\" rel=\"nofollow noreferrer\">oklabs.net/skype-reverse-engineering-the-long-journey</a>.</span>",
            "time": null
        },
        {
            "user": "Johann Aydinbas",
            "text": "<span class=\"comment-copy\">If your software is going to run in an uncontrolled environment (i.e. client PC somewhere) your solution is good enough I'd say. There is simply no way of guaranteeing anything more, that's the nature of computers. You are trying to achieve what multiple industries (AV, DRM, anti-cheat) have been unsuccessful at. An attacker would possibly have access to system-level code (via kernel drivers) while your application is user mode. You cannot win that battle.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It is possible for an attacker to replace the file on the disk by beating the race condition. When you write the file to disk, there is a delay until when the function you called which loads the DLL actually reads it from disk. An attacker can reverse your application and find out where you place the DLL, then in a no-sleep thread (maybe even multi-threaded) application can constantly spam to see if there is a new DLL placed, if there is, quickly replace it. </p>\n<p>Another way to prevent you from reading it instead of just writing over it as fast as possible would be to get an operation lock on the file preventing you from reading it until the oplock handle is closed.</p>\n<p>Second, if an attacker is at the same privilege level as your process, he can easily tamper with your process. You do not need to attach as a debugger or \"debug\" to inject code into your process. All an attacker needs to do is OpenProcess your process, WriteProcessMemory his shellcode, and then CreateRemoteThread the shellcode.</p>\n<p>This is only one way of injecting code, there are SEVERAL more and you can't ever be 100% protected. Returning to your question whether or not an attacker can hijack your DLL, they most certainly can. They can overwrite portions of your DLL to hook or do another operation.</p>\n</div>",
            "votes": "1",
            "user": "Rob Gates",
            "time": "Jun 19, 2019 at 23:44",
            "is_accepted": false,
            "comments": []
        }
    ]
}