{
    "title": "Intercept zip decryption key or files from an application",
    "link": "https://reverseengineering.stackexchange.com/questions/21535/intercept-zip-decryption-key-or-files-from-an-application",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If an application is reading from a password protected zip file, is there a way to intercept the key being sent to decrypt the zip file. Or, is there a way to dump the files being read themselves?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "790",
    "tags": [
        "debugging",
        "decryption",
        "hooking"
    ],
    "user": "thisisnice05",
    "time": "Jun 24, 2019 at 7:27",
    "comments": [
        {
            "user": "Remko",
            "text": "<span class=\"comment-copy\">In what language has the binary been written? If it's a .NET binary (and not obfuscated) it can be debugged and/or reversed fairly easily. Perhaps also try to determine if a popular zip library is being used.</span>",
            "time": null
        },
        {
            "user": "thisisnice05",
            "text": "<span class=\"comment-copy\">I don't believe it is using .Net. The Zip is version 2.0 using AES 128 bit encryption 'I think Winzip'   Inside an xml file which has a list of the encrypted files it has a 'partial encryption key' which I have no idea what it does with</span>",
            "time": null
        },
        {
            "user": "Remko",
            "text": "<span class=\"comment-copy\">Can you share the file(s)?</span>",
            "time": null
        },
        {
            "user": "Johann Aydinbas",
            "text": "<span class=\"comment-copy\">Are you sure this is all legal? You provided an <code>.iso</code> for what appears to be commercial software.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@JohannAydinbas please read <a href=\"https://reverseengineering.meta.stackexchange.com/q/378/245\">this</a> ;)</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm writing this answer under the assumption the OP is within his legal rights to share the binaries.</p>\n<p>First of, I read up on password protected zip files. Apparently that is not part of the ZIP specification itself but an invention of WinZip. They have documented their format modifications and all details on this page:</p>\n<p><a href=\"https://www.winzip.com/win/en/aes_info.html\" rel=\"nofollow noreferrer\">https://www.winzip.com/win/en/aes_info.html</a></p>\n<p>Important to notice here is how key derivation works. It feeds the given password through PKBDF2 with an iteration count of 1000 to derive the real key used in AES.</p>\n<p>Using PEiD I checked for crypto signatures and found 4 references to AES (via their sbox). I then checked the surrounding code where these AES functions are used and stumbled upon a function call that got 1000 as an argument.</p>\n<p>So then I just ran the binary with an attached debugger, breaking on that call. Then I inspected passed arguments and the first argument appeared to be the key.</p>\n<p>I successfully decompressed the female zip file with the key to confirm.</p>\n<h1>How to derive that key?</h1>\n<p>Note that the algorithm used by the program seems to be a bit more complex. If you check the zip files, not all files in there are encrypted.</p>\n<p>Two XML files are unencrypted and contain an XML property named <code>encryption key</code>, which looks similar to the real one above, but different bytes.</p>\n<p>The application probably uses this property to deduce the above key which is eventually fed to AES to decrypt the encrypted files in the same archive. I do not know how this internal derivation works. You would have to find the code, probably by following the XML parser if you want to write a generic tool to decompress these encrypted files.</p>\n</div>",
            "votes": "4",
            "user": "peter ferrie",
            "time": "Jul 12, 2019 at 17:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "thisisnice05",
                    "text": "<span class=\"comment-copy\">May I ask what debugging software you use?</span>",
                    "time": null
                },
                {
                    "user": "Johann Aydinbas",
                    "text": "<span class=\"comment-copy\">I used x64dbg (or rather x32dbg for this target) and the actual code reading I've done in IDA</span>",
                    "time": null
                }
            ]
        }
    ]
}