{
    "title": "To find a keyboard shortcut inside an application",
    "link": "https://reverseengineering.stackexchange.com/questions/21531/to-find-a-keyboard-shortcut-inside-an-application",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The app has a \"secret dialog window\" and I'm sure it appears after pressing combination of some buttons. How I can find the combination in this app?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "309",
    "tags": [
        "ollydbg"
    ],
    "user": "Dmitriy Savelyev",
    "time": "Jun 22, 2019 at 17:29",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">So given you tagged this with <a href=\"https://reverseengineering.stackexchange.com/questions/tagged/ollydbg\">ollydbg</a> we can assume it's a Windows application. But maybe you could add some more information. In general there are only a handful of practical ways to implement the handling of hotkeys. But depending on whether this is dialog-based or not, details can differ. Possible ways (from the top of my head): <code>SetWindowsHookEx</code>, <code>GetAsyncKeyState</code>, <code>RegisterHotKey</code></span>",
            "time": null
        },
        {
            "user": "Dmitriy Savelyev",
            "text": "<span class=\"comment-copy\">Yes, sure, this is a Windows app. And, yes, this is a dialog-based window. I can see the window in resource editor (I use Restorator app) and my friend pretty sure this window activates by some combination on keyboard. Window's caption has name \"Instrument Diagnostic\" and I have found Unicode of this symbols inside exe, but where a trigger placed I don't know.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I assume that you don't have any more information about this <em>Secret dialog window</em> than what you have written (that is you don't know how it looks like and the strings it contains, etc.).</p>\n<p>In such a case, you can search for <a href=\"https://docs.microsoft.com/en-us/windows/desktop/api/winuser/nf-winuser-getkeyboardstate\" rel=\"nofollow noreferrer\">GetKeyboardState</a> function that may be used to obtain the keys pressed at a given time. After finding it, just look at the subsequent functions calls and you will probably find the function responsible for handling the information provided by <code>GetKeyboardState</code> function, thus checking whether the keys being pressed match one of the program keyboard shortcuts.</p>\n<p><strong>Note:</strong>\n<code>OllyDbg</code> uses this method, as shown on the picture below (yes, it's a picture of <code>OllyDbg</code> debugging itself ;) ):\n<a href=\"https://i.sstatic.net/WnqUa.png\" rel=\"nofollow noreferrer\"><img alt=\"OllyGetKeyboardState\" src=\"https://i.sstatic.net/WnqUa.png\"/></a></p>\n<p>As you may notice, it firstly converts it to <code>ASCII</code> code and then performs some checks.</p>\n</div>",
            "votes": "1",
            "user": "bart1e",
            "time": "Jun 22, 2019 at 20:00",
            "is_accepted": false,
            "comments": []
        }
    ]
}