{
    "title": "Reverse Engineering a Vehicle Identification Number (VIN) encoding",
    "link": "https://reverseengineering.stackexchange.com/questions/21642/reverse-engineering-a-vehicle-identification-number-vin-encoding",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Not sure if this is the right place so please point me to the right place if needed.</p>\n<hr/>\n<p>I have an input of a VIN (Vehicle Identification Number) number with 17 characters, each character is either an uppercase letter or number.</p>\n<p>The input is then encoded into 24 signed integers, the integers go from -128 to +127. </p>\n<p>There doesn't seem to be any direct linear relationship between the two.</p>\n<p>Does anyone know what this encoding might be? Or, how I should go about trying to reverse engineering it? </p>\n<hr/>\n<p>An example is:<br/>\nInput: 1D8HB58D04F177301\nOutput:-2|-72|-11|-2|18|100|-69|15|93|120|15|-97|-35|52|85|-114|53|-123|-1|-101|-38|125|-100|113</p>\n<p>I have access to a dataset mapping the inputs to outputs and also a tool that converts an encoding (24 integers) into a VIN</p>\n<hr/>\n<p>Inexperienced with this so any help is greatly appreciated! </p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "293",
    "tags": [
        "encryption",
        "encodings",
        "hash-functions"
    ],
    "user": "Andrew Xia",
    "time": "Jul 10, 2019 at 11:22",
    "comments": [
        {
            "user": "Andrew Xia",
            "text": "<span class=\"comment-copy\">Yes that's correct, also edited the post to clarify</span>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">net is full of vin decoders  your 1dxxxxxx vin is  2004 DODGE Durango says  <a href=\"https://www.decodethevin.com/\" rel=\"nofollow noreferrer\">decodethevin.com</a>   Wikipedia has lots of info on what is what <a href=\"https://en.wikipedia.org/wiki/Vehicle_identification_number\" rel=\"nofollow noreferrer\">en.wikipedia.org/wiki/Vehicle_identification_number</a></span>",
            "time": null
        },
        {
            "user": "Andrew Xia",
            "text": "<span class=\"comment-copy\">Just to clarify, the idea isn't to decode what a VIN represents. Instead, it's to understand how the VIN is being encoded into that 24 number representation in the dataset I am working with</span>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">well analyze the tool that you have in hand with whatever tool you are comfortable with say radare / ghidra / ida / windbg / ollydbg / gdb   as is this is too broad to attempt to answer  narrow down the scope</span>",
            "time": null
        },
        {
            "user": "Andrew Xia",
            "text": "<span class=\"comment-copy\">Unfortunately the tool is hosted therefore the actual logic is happening server-side. Really I was checking to see if there was some obvious manipulation of the bits that would yield the encoding</span>",
            "time": null
        }
    ],
    "answers_data": []
}