{
    "title": "Cyber security student wanting to start learning reverse engineering [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/21677/cyber-security-student-wanting-to-start-learning-reverse-engineering",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<div>\n<aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n<div class=\"d-flex fd-column fw-nowrap\">\n<div class=\"d-flex fw-nowrap\">\n<div class=\"flex--item wmn0 fl1 lh-lg\">\n<div class=\"flex--item fl1 lh-lg\">\n<div>\n<b>This question already has an answer here</b>:\n                                \n                            </div>\n</div>\n</div>\n</div>\n<div class=\"flex--item mb0 mt4\">\n<a dir=\"ltr\" href=\"/questions/2881/intro-to-reverse-engineering\">Intro to reverse engineering [closed]</a>\n<span class=\"question-originals-answer-count\">\n                                (1 answer)\n                            </span>\n</div>\n<div class=\"flex--item mb0 mt8\">Closed <span class=\"relativetime\" title=\"2019-07-22 18:46:03Z\">5 years ago</span>.</div>\n</div>\n</aside>\n</div>\n<p>I'm really interested in learning reverse engineering. Especially in regards to malware. Any help is much appreciated </p>\n<p>What should I learn before I start to learn reverse engineering? </p>\n<p>Is learning C/C++ a MUST?</p>\n<p>Should I learn Assembly language?</p>\n<p>If I know nothing about reverse engineering, is Ghidra a good tool to learn with or should I become familiar with IDA and OllyDbg first?</p>\n<p>Any good sources/tutorials in particular that you recommend?</p>\n</div>",
    "votes": "1",
    "answers": 3,
    "views": "3k",
    "tags": [
        "assembly",
        "ollydbg",
        "malware",
        "c++",
        "ghidra"
    ],
    "user": "Alex Valdez",
    "time": "5 years ago",
    "comments": [
        {
            "user": "Iter Ator",
            "text": "<span class=\"comment-copy\">Yes, you should be able to understand C code. Having a basic knowledge about the assembly language is also necessary.</span>",
            "time": null
        },
        {
            "user": "julian",
            "text": "<span class=\"comment-copy\">Malware targeting what kind of system? Embedded Linux running on a MIPS device? Malicious android apps in the Google play store? Windows malware? Reverse engineering is hard, so it helps to have a clear goal</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<blockquote>\n<p>What should I learn before I start to learn reverse engineering? </p>\n</blockquote>\n<p><strong>Assembly is a must</strong>. Without deep understanding of assembly you cannot reverse engineer anything seriously. Additionally, you'll have to become familiar with relevant tools, depending on the platform; not knowing every detail of them, just basic use - you will learn more complex things in practice when you need them. I strongly recommend you to read this forum: you can, for instance sort questions by votes and read best answers - this way you'll get a basic insight on the topic.</p>\n<blockquote>\n<p>Is learning programming with C/C++ a MUST?</p>\n</blockquote>\n<p>If you <strong>really</strong> don't want to - no, but it's <strong>highly recommended</strong>. There are several reasons for it:</p>\n<ol>\n<li>Most of malware is written in <code>C/C++</code>.</li>\n<li>Decompilers will usually produce output in <code>C</code> or pseudo-<code>C</code> form, so it will be easier to understand it.</li>\n<li>Writing small, test programs in <code>C/C++</code> and observing produced assembly is <strong>very</strong> helpful in learning reverse engineering - you will get familiar with basic constructions, like calling conventions, loops, if-else or switch blocks, tricks performed for code optimization and many, many more.</li>\n<li>You will be able to analyse several malware source codes available in the Internet (see 1.).</li>\n<li>If you know the tool, you know what to expect from programs written in it.</li>\n</ol>\n<blockquote>\n<p>If I know nothing about reverse engineering is Ghidra a good tool to learn with or should I become familiar with IDA and OllyDbg first?</p>\n</blockquote>\n<p>I would say, start with IDA. Why? Because it's probably the most widely used disassembler. Additionally, if you think of a job related to reverse engineering, you may often find familiarity with IDA as a requirement. Finally, from my personal experience (I started with IDA), it's very <strong>user friendly</strong>, so you can fully focus on reverse engineering without focusing too much on <strong>how</strong> to use a tool.</p>\n<p>OllyDbg is a tool for dynamic analysis and you should start with static one (without running a program), since you'll have to <strong>fully understand the assembly</strong> to benefit from debugger. But of course you should learn it at some moment.</p>\n<blockquote>\n<p>Any good sources/tutorials in particular that you recommend I have a look at?</p>\n</blockquote>\n<p>Two books: <a href=\"https://beginners.re/\" rel=\"nofollow noreferrer\">Reverse Engineering for Beginners</a> and <a href=\"https://repo.zenk-security.com/Virus-Infections-Detections-Preventions/Practical_Malware_Analysis.pdf\" rel=\"nofollow noreferrer\">Practical Malware Analysis</a> - you will get <strong>a lot of knowledge</strong> if you read them. To see malware reverse engineering in practice, you can do the <a href=\"https://www.cybrary.it/course/malware-analysis/\" rel=\"nofollow noreferrer\">course on cybrary.it</a>.</p>\n</div>",
            "votes": "3",
            "user": "bart1e",
            "time": "Jul 15, 2019 at 18:08",
            "is_accepted": true,
            "comments": [
                {
                    "user": "R4444",
                    "text": "<span class=\"comment-copy\">this is great, in addition I would like to recommend - <a href=\"http://programminggroundup.blogspot.com/\" rel=\"nofollow noreferrer\">programminggroundup.blogspot.com</a> book for assembly basics.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First of all, welcome to the fascinating and frustrating world of malware reversing.</p>\n<blockquote>\n<p>What should I learn before I start to learn reverse engineering?</p>\n</blockquote>\n<p>I believe that the best way is start to learn basic reverse engineering and improve as you go.</p>\n<blockquote>\n<p>Is learning programming with C/C++ a MUST?</p>\n</blockquote>\n<p>No, it's not a \"MUST.\" However, if you don't know how to program, you will become easily frustrated. Let's think about it for a second, what's malware reverse engineering? Its the process of taking samples (binaries) or other forms of malicious code and trying to understand how the code was written, what its purpose and how it achieves it. \nIf you don't know how to program you are going to find it very difficult to reverse back code. </p>\n<blockquote>\n<p>If I know nothing about reverse engineering is Ghidra a good tool to learn with or should I become familiar with IDA and OllyDbg first?</p>\n</blockquote>\n<p>I would not recommend this tool, to begin with. You should probably start with a more fundamental approach, such as I described <a href=\"https://reverseengineering.stackexchange.com/questions/20984/most-efficient-way-to-begin-analyzing-malware-binary/21009#21009\">here</a>.</p>\n<p>Also, you probably want to go over the following StackExchange threads and for tutorials and learning paths:</p>\n<ul>\n<li><p><a href=\"https://security.stackexchange.com/questions/36331/becoming-a-malware-analyst\">Becoming a malware analyst</a></p></li>\n<li><p><a href=\"https://security.stackexchange.com/questions/91309/how-to-get-started-as-a-malware-analyst\">How to get started as a malware analyst</a></p></li>\n</ul>\n</div>",
            "votes": "2",
            "user": "perror",
            "time": "Jul 16, 2019 at 7:27",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It's always good to have a big goal in mind, and with RE, the beginning stages of this pursuit may seem overwhelming. I see a lot of great answers here so just want to chip in with my take on what your immediate next steps should be.</p>\n<p>I agree, asm is a must. There's pros and cons for choosing a particular one but I suggest choosing one and really stick with it, and stay with a particular syntax so you can walk away from that stage in your learning feeling confident. Don't be afraid to learn C/C++ at the same time, they can be used to understand each other! A youtuber named \"What's Creel\" takes this approach in his assembly tutorials.</p>\n<p>I also want to encourage you to \"go where your resources take you.\" If you find a great tutorial using radare2, forget ghidra and ida for now just go with the teacher that's in front of you and that you like at that moment. To me this is true for systems as well. If you are watching John Hammond complete CTFs on youtube, download an Ubuntu iso for a virtual machine and follow along. Nothing beats hands on learning, and if you are exhausted learn to rest effectively as well! Eat well, exercise, get enough sleep etc.</p>\n<p>This brings me to my last point, know thyself! If you know what type of learner you are, seek those resources so you can learn more effectively. Personally I'm a mixture of visual, and social. That social piece really helps me whether it's listening to 2 people discuss something on a podcast or talking with someone myself over coffee, those conversations nail home the concepts I'm trying to comprehend. Some people can just read a manual and learn from that, or experiment with code till they understand what's going on. Whatever it is, just embrace and multiply it so you can avoid the (ultimate) feelings of despair technical fields like this have. These different approaches to learning might also differ depending on your mood or environment, so don't forget to be flexible!\nHere's a list of resources, some directly support the RE / malware goal you've stated, and some indirectly will help you be it supporting technology knowledge or technical creativity.</p>\n<h1>Podcasts</h1>\n<ul>\n<li><p>Security Now with Steve Gibson</p>\n</li>\n<li><p>Software Engineering Daily</p>\n</li>\n<li><p>Kubernetes Podcast</p>\n</li>\n<li><p>CppCast</p>\n</li>\n<li><p>Darknet Diaries (creativity!)</p>\n</li>\n</ul>\n<h1>YouTube tutorials</h1>\n<ul>\n<li><p>Me, <a href=\"https://youtu.be/_K_9yBHkXEE\" rel=\"nofollow noreferrer\">reading the intel manual</a> and asking questions, beats reading alone</p>\n</li>\n<li><p>Liveoverflow, very professional and engaging, start with his <a href=\"https://youtu.be/iyAyN3GFM7A\" rel=\"nofollow noreferrer\">Binary Exploitation series</a></p>\n</li>\n<li><p>Conferences, Conferences, Conferences. I learn so much from these talks maybe start with <a href=\"https://youtu.be/HddFGPTAmtU\" rel=\"nofollow noreferrer\">Cpp con 2018</a> but you'll want a really good handle on the basics first</p>\n</li>\n<li><p>Ippsec, what can I say this guy <a href=\"https://www.youtube.com/channel/UCa6eh7gCkpPo5XXUDfygQQA\" rel=\"nofollow noreferrer\">does it all!</a></p>\n</li>\n</ul>\n<p>youtube is just a treasure trove, I'm sure I'm forgetting a ton...</p>\n<h1>Misc / Passive learning</h1>\n<ul>\n<li><p>TinyCards app, I made three decks of x86 assembly instructions</p>\n</li>\n<li><p>SoloLearn and Enki app, just basic programming language intro, q&amp;a formart.</p>\n</li>\n<li><p>Reddit, the AskNetSec subreddit seems to have the highest quality discussions</p>\n</li>\n</ul>\n<h1>Active Learning</h1>\n<ul>\n<li><p>Do! Create! Students just learning programming, hardware, networking, etc. will often complain to me about not understanding and when I ask what they've done the only things I hear are passive. You can't learn this stuff without getting your hands dirty, even if that means writing down your thoughts or questions (they don't need to be answered right away...) but if you can write programs or test malware in a VM yourself that'd be even better.</p>\n</li>\n<li><p>Have a github account</p>\n</li>\n<li><p>Make a learning journal for reflection</p>\n</li>\n</ul>\n<p>The last thing I'd like to say, and I'm not trying to discourage you at all, but try to get a strong grasp of the fundamentals, doing so should accelerate your progress. I'm often reminded of this picture when I hear students talking about their tech dreams and 1 month into class I see they don't have the mental stamina to work on something for longer than 10 minutes, in this case though just replace \"bug hunting\" with \"reverse engineering,\" because they are both long term goals:\n<a href=\"https://i.sstatic.net/yiV0f.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/yiV0f.jpg\"/></a></p>\n<p>Remember, one step at a time!</p>\n</div>",
            "votes": "0",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}