{
    "title": "Finding out what calls win32u.dll functions",
    "link": "https://reverseengineering.stackexchange.com/questions/21751/finding-out-what-calls-win32u-dll-functions",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There's a button which, when clicked, writes some data to the clipboard. \nI'm trying to call the function this button executes using DLL Injection.\nI managed to find the function in win32u.dll which accesses the clipboard, and I was able to set a breakpoint there which gets triggered. Obviously, I don't want to call this function directly, but the function that calls it (from the origin program). How do I figure this address out?</p>\n<p>I can't use the buttons handle since the button doesn't show up in any UI spy tools and as it is a part of a context menu, it disappears as soon as the focus is lost.</p>\n<p>I'm using x64dbg as a debugger, but if you know a solution in OllyDbg, that will be fine since I know how to use both.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "windows",
        "ollydbg",
        "x64dbg"
    ],
    "user": "Kevin Mueller",
    "time": "Jul 23, 2019 at 20:56",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<h1>OllyDbg</h1>\n<p>You can do it at least in two different ways. The first involves <em>Call stack view</em> (<code>View</code>-&gt;<code>Call stack</code>) that you can use when the breakpoint you set in that function from <code>win32u.dll</code> is triggered. The first one coming from your application's module will be the desired one.</p>\n<p>Second approach is more static and takes advantage of <em>Intermodular calls</em>. Go to your application's module, right click -&gt; \"Search for\" -&gt; \"All intermodular calls\". You will get all external functions that your program calls and the places where they are called from. So, just search for that API function and you will get all places that it is called from in that module.</p>\n<p>You can see <a href=\"https://reverseengineering.stackexchange.com/questions/21360/call-stack-vs-intermodular-calls-in-ollydbg/21378#21378\">answer</a> for more details.</p>\n</div>",
            "votes": "1",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": []
        }
    ]
}