{
    "title": "How to extract firmware from a western digital hard drive with custom firmware",
    "link": "https://reverseengineering.stackexchange.com/questions/21791/how-to-extract-firmware-from-a-western-digital-hard-drive-with-custom-firmware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Hi all i got a western digital hard drive from a DVR which contains custom firmware so you will not be able to install any hard drive you want on the DVR device. (digital video recorder) something like what the xbox has by using a security sector i think.</p>\n<p>How can i extract this firmware and upload it on another drive ? or change the other drives hardwired serial to match the original custom drive ?</p>\n<p>thanks</p>\n<p>---A NOTE--\ni want to use my own drives not the ones the company sells for x3 times as much which are the same drives (same model and brand) but they got a custom firmware or some kind of protection. If i install another hard drive a generic one the DVR refuses to accept it/see it, only the company's custom firmware drives are recognized even if they are the same brand and model. I need to see whats on the firmware and copy it and flash another identical (or not) drive with it so DVR's firmware can see it as an \"authorized\" drive. Cloning the custom disk to another wont work either.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "1k",
    "tags": [
        "firmware"
    ],
    "user": "kostas m",
    "time": "Jul 31, 2019 at 15:03",
    "comments": [
        {
            "user": "Bruce Abbott",
            "text": "<span class=\"comment-copy\">Even if you managed to extract the firmware it would probably only work on another identical drive. So why bother?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I think it's highly unlikely that the drives have custom firmware. Most likely the check is done by the DVR, and the drives are completely ordinary but are prepared by the vendor.</p>\n<p>For example, there may be a hidden sector written with data which depends on the drive's serial number, so cloning it to another won't work. </p>\n<p>I'd suggest investigating the DVR's firmware and looking at how it detects \"bad\" drives.</p>\n</div>",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "Jul 31, 2019 at 18:15",
            "is_accepted": true,
            "comments": [
                {
                    "user": "kostas m",
                    "text": "<span class=\"comment-copy\">how to do this ? I don't have any firmware file</span>",
                    "time": null
                },
                {
                    "user": "kostas m",
                    "text": "<span class=\"comment-copy\">if it was a windows software i would run a debugger now how can i do this ? Maybe if i use the original vendor drive and take its serial lba etc using hddscan and use those to flash another hard drive using hddhackr and the new drive will have the old drives serial number etc what do you think ?</span>",
                    "time": null
                },
                {
                    "user": "kostas m",
                    "text": "<span class=\"comment-copy\"><a href=\"http://www.users.on.net/~fzabkar/HDD/HddHackr_analysis.html\" rel=\"nofollow noreferrer\">users.on.net/~fzabkar/HDD/HddHackr_analysis.html</a></span>",
                    "time": null
                },
                {
                    "user": "Jasen",
                    "text": "<span class=\"comment-copy\">you need to find the dvr code, perhaps it is on the drive what does the MBR say?</span>",
                    "time": null
                },
                {
                    "user": "kostas m",
                    "text": "<span class=\"comment-copy\">file system is custom (fat tripled i think its called ?) partition magic sees the drive as blank and windows asks to format it. i clone it sector by sector by using hdd raw copy tool. I think ill use hddhacker and change the serial lba size etc of the target drive to the original drive's then see if that works. <a href=\"http://forum.archosfans.com/viewtopic.php?t=69901\" rel=\"nofollow noreferrer\">forum.archosfans.com/viewtopic.php?t=69901</a></span>",
                    "time": null
                }
            ]
        }
    ]
}