{
    "title": "How to use the book \"Reverse Engineering for Beginners\" by Yurichev?",
    "link": "https://reverseengineering.stackexchange.com/questions/21802/how-to-use-the-book-reverse-engineering-for-beginners-by-yurichev",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I just finished skimming the book <em>Art of Assembly</em> by Randall Hyde.</p>\n<p>So now to get my feet wet in assembly/reverse engineering reading, I started the book <a href=\"https://beginners.re\" rel=\"nofollow noreferrer\"><em>Reverse Engineering for Beginners</em></a>. The thing is when I write C samples and produce assembly code as author stated the assembly i get in GCC differs from what the one author provides. (I use <code>gcc -S -O3</code> for the ones that are said to be optimized in book).</p>\n<p>What can I do to get results like book or if getting results like author's is not the point how can I get the most out of this lovely book?</p>\n</div>",
    "votes": "3",
    "answers": 2,
    "views": "427",
    "tags": [
        "assembly"
    ],
    "user": "Krsh",
    "time": "Jul 31, 2019 at 21:33",
    "comments": [
        {
            "user": "Kerim Can Kalıpcıoğlu",
            "text": "<span class=\"comment-copy\">It is probably because your GCC version is different than his. Can you use the same version of GCC and disassembler and try it again?</span>",
            "time": null
        },
        {
            "user": "Krsh",
            "text": "<span class=\"comment-copy\">Well..idk what version he used... Right now i found out my problem is mostly those .cfi pre-suffixes.Found out how to disable them.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE. It's seriously a little difficult to give advice when you don't show us. How about editing your question to include an example of what the author gives and what you get from compiling with GCC? Also nice would be to know which GCC version <i>you</i> are using (even if there may be no info available on what the author uses). If I were you I'd also check out <code>-fno-stack-protector</code> (or generally check out <code>gcc -dumpspecs</code> output to see what security-related default flags your GCC may be using). Last but not least try <code>-O2</code> ...</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">... <code>-O2</code> on a recent GCC version may be closer to what <code>-O3</code> used to be on older GCC versions. The simple reason being that several optimizations are given time to mature before they graduate up the optimization levels. In terms of library code (<code>glibc</code> aka the C runtime) you may also want to pass <code>-D_FORTIFY_SOURCE=n</code> to the <code>gcc</code> driver. Also <a href=\"https://gcc.gnu.org/onlinedocs/gcc/Optimize-Options.html\" rel=\"nofollow noreferrer\">check out the individual options</a> behind the optimization levels. This particular document may actually provide a nice way of diffing them across GCC versions, too ...</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<blockquote>\n<p>What can i do to get results like book?</p>\n</blockquote>\n<p>Just use the same version of the compiler and compile the code for the same architecture as the Author. Usually, there is explicitly stated which compiler version was used to get a particular assembly. For example:</p>\n<p><a href=\"https://i.sstatic.net/0R3JC.jpg\" rel=\"nofollow noreferrer\"><img alt=\"GCC_version\" src=\"https://i.sstatic.net/0R3JC.jpg\"/></a></p>\n<p>or</p>\n<p><a href=\"https://i.sstatic.net/hTm5O.jpg\" rel=\"nofollow noreferrer\"><img alt=\"GCC_version2\" src=\"https://i.sstatic.net/hTm5O.jpg\"/></a></p>\n<p>So, there are several different versions of compiler used and if you want to get the same results, you have to use the version described at each listing.</p>\n<blockquote>\n<p>or if getting results like author's is not the point</p>\n</blockquote>\n<p><em>It's definitely not the point</em>. The point is that <strong>you learn as much as possible</strong> when reading this book.</p>\n<p>I would even say it may be better to get different results than these in the book. There are several reasons for it:</p>\n<ol>\n<li>You will learn how the newer versions of the GCC compiler deal with the same C code, so for example what are new optimization methods.</li>\n<li>You will see different assembly performing the same task as the previous one - when you'll see big differences, you will probably want to think or search for more information about it and this way you'll remember it better.</li>\n<li>It encourages you to <em>understand</em> the resulting assembly so you can compare it with the one presented by the Author - it's far more creative and productive work than just copying what you have already presented.</li>\n</ol>\n<blockquote>\n<p>how can i get the most out of this lovely book?</p>\n</blockquote>\n<p>I would say, <strong>by practice</strong>. If you don't practice what you have just learned, you will forget it very quickly. You can even omit some programs written there and just experiment on your own (like the Author suggested) - just write some code and try to find its fragments in disassembly.</p>\n</div>",
            "votes": "4",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You just need a compiler like <code>gcc</code> and <code>debug</code> or static analysis to understanding the code doing</p>\n</div>",
            "votes": "1",
            "user": "Febriyanto Nugroho",
            "time": "Oct 3, 2019 at 5:05",
            "is_accepted": false,
            "comments": []
        }
    ]
}