{
    "title": "How to load symbols from Windows DBG file",
    "link": "https://reverseengineering.stackexchange.com/questions/21893/how-to-load-symbols-from-windows-dbg-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm having trouble getting GHIDRA to load symbols for a Microsoft EXE from an accompanying DBG file.  Perhaps I'm just overlooking some obvious documentation in which case a focussed link would be much appreciated.</p>\n<p>Things I've tried:</p>\n<ol>\n<li>Having both \"foo.exe\" and \"foo.dbg\" in the same directory and importing \"foo.exe\" and auto-analyzing it with defaults.</li>\n<li>After importing \"foo.exe\", using \"Add to Program\" in the CodeBrowser and added \"foo.dbg\" explicitly.  That suceeds with no errors, but I still can't find the symbols in the \"Symbol Tree\".</li>\n</ol>\n<p>Background:</p>\n<ul>\n<li><p>Using GHIDRA 9.0.4 installed on Fedora-30 (via ZIP file).</p></li>\n<li><p>The EXE is a Delphi-7 EXE built under WinXP (32 bit) with a MAP file and full TD32\ndebug in the EXE itself.  I created the DBG file using map2dbg.  This\nis very old, very crusty stuff.  I'm going to create a separate\nquestion on how to load symbols from a custom file (I've seen\nreferences but sadly cannot find those menu action in my IDE).</p></li>\n</ul>\n<p>In case this really is a dead end I added a <a href=\"https://reverseengineering.stackexchange.com/q/21895/29318\">related question</a>.</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "836",
    "tags": [
        "ghidra"
    ],
    "user": "Charlie Butterfield",
    "time": "Aug 14, 2019 at 20:46",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE. Wasn't that some awkward proprietary format unrelated to both PDB and the older CV (also with <code>.dbg</code> file extension)? In all tools I had to deal with similar cases I had to resort to the map file.</span>",
            "time": null
        }
    ],
    "answers_data": []
}