{
    "title": "IDA Pro - Load data in manually created segment",
    "link": "https://reverseengineering.stackexchange.com/questions/21919/ida-pro-load-data-in-manually-created-segment",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The program I'm currently reversing is missing a section that contains a bunch of interesting strings. I see the memory addresses of where these should be, instead of the reference to the string. </p>\n<p>The strings are in the binary file analyzed by IDA, but since there isn't any segment for them, IDA ignored them.</p>\n<p>I tried manually creating the segment, which works (it now references unknown variables instead of memory addreses), but I can't figure out how to load the proper data into that section. (The entire section is filed with <code>db ? ;</code>)</p>\n<p>I've tried using <code>File &gt; Load File &gt; Load additional binary file</code>(with file offset &amp; size), as well as reloading the current file. I've also dumped the part of the file I'm interested in another file and tried to load that one as an additional binary as well.</p>\n<p>The only results I can get from that is:</p>\n<ul>\n<li>IDA creates a new segment at the end of all other segments (Not following the <code>Loading Segment</code> address I filled in.</li>\n<li>If I uncheck <code>Create Segments</code>, IDA does nothing. (Even though I specified the address of my manually created segment in <code>Loading Segment</code></li>\n</ul>\n<p>The segment I manually created has the following settings:\n<a href=\"https://i.sstatic.net/FColf.png\" rel=\"nofollow noreferrer\"><img alt=\"segment settings\" src=\"https://i.sstatic.net/FColf.png\"/></a>\n.</p>\n<p>Here's the form I filled while loading the binary file that contains the data I want. \n<a href=\"https://i.sstatic.net/0IuUR.png\" rel=\"nofollow noreferrer\"><img alt=\"load binary file settings\" src=\"https://i.sstatic.net/0IuUR.png\"/></a>\n.</p>\n<p>I've never done this before, so it's likely I'm doing something wrong, but I can't figure it out.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "5k",
    "tags": [
        "ida"
    ],
    "user": "Hx0",
    "time": "Aug 17, 2019 at 18:38",
    "comments": [
        {
            "user": "bart1e",
            "text": "<span class=\"comment-copy\">Did you try <i>manual load</i> option when loading the file in IDA?</span>",
            "time": null
        },
        {
            "user": "Hx0",
            "text": "<span class=\"comment-copy\">No - it's a big file that IDA already analyzed (I've noticed the missing strings later on). I'd like to avoid having to re-analyze it if possible.</span>",
            "time": null
        },
        {
            "user": "bart1e",
            "text": "<span class=\"comment-copy\">If I'm not mistaken <code>db ?</code> in IDA means the data is not initialised (usually present in <code>.bss</code> section). Why did you give that segment execute permission if it only contains strings? I would also uncheck <i>Code segment</i> field when loading the additional binary file.</span>",
            "time": null
        },
        {
            "user": "Hx0",
            "text": "<span class=\"comment-copy\">I've removed the execute permission. I've tried unchecking Code segment, but IDA still doesn't do anything when loading the binary file.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Use the menu: File -&gt; Load file -&gt; Additional binary file, and then simply enter the segment address you want.<br/>\nThe reason you fail on this operation is because you are misunderstanding the \"segment\" in IDA.<br/>\nIn IDA the segment is defined by (selector, base) and offset. The final address is calculated by<br/>\n<code>(base &lt;&lt; 4) + offset</code>.<br/>\nIn fact, IDA is telling you to input \"in paragraph\", which is 0x10 each paragraph on IBM PC.<br/>\nBut as x86 is using \"flat memory model\" now, what you should use is something like this:\n<a href=\"https://i.sstatic.net/jzxDC.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/jzxDC.png\"/></a>\nYour original operation will create a segment which has an EA of 0x1431A20000 (note the last zero), and what you will see in the IDA view will be segXXX:XXXXX instead of the \"flat\" segments like .text</p>\n</div>",
            "votes": "2",
            "user": "Misty",
            "time": "Aug 21, 2019 at 17:31",
            "is_accepted": true,
            "comments": []
        }
    ]
}