{
    "title": "Difference between 32 bit and 64 bit disassemblers",
    "link": "https://reverseengineering.stackexchange.com/questions/22076/difference-between-32-bit-and-64-bit-disassemblers",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>As far as my level of understanding goes, the only difference between a 32 bit and 64 bit disassembler is that the produced assembler-code of a 32 bit disassembler is only using 32 bit assembly instructions, while a 64 bit disassembler also makes use of 64 bit instructions and registers.</p>\n<p>My questions is, what are the advantages of using a 64 bit disassembler over a 32 bit disassembler?</p>\n<p>Furthermore, if I want to disassemble a program compiled for a 64 bit machine, can I use a 32 bit disassembler like OllyDBG for that and what how would the output differ from a 64 bit disassembler like x64dbg?</p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "2k",
    "tags": [
        "disassembly",
        "debuggers",
        "disassemblers",
        "x64dbg"
    ],
    "user": "J.Doe",
    "time": "Dec 8, 2019 at 18:21",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are no set definitions for \"32-bit disassembler\" and \"64-bit disassembler\". The terms are in fact ambiguous.</p>\n<p>32-bit and 64-bit just refer to CPU architectures. Specifically to things such as register size and bus size. These can apply to many things.</p>\n<p>Specifically, in the case of a disassembler, they can apply to two things:</p>\n<ol>\n<li>The CPU architecture for which the disassembler binary is compiled</li>\n<li>The CPU architecture which the disassembler is capable of disassembling.</li>\n</ol>\n<p>Furthermore, there are multiple CPU families which come in both 32- and 64-bit flavours. The most relevant today are Intel &amp; AMD, and ARM.</p>\n<p>These are all independent. You could have a disassembler compiled to run on 32-bit Intel machines which is capable of disassembling binaries that are supposed to run on 64-bit ARM processors.</p>\n<p>Now in the same CPU, a 64-bit architecture may or may not be an extension of a previous 32-bit architecture. This is the case with Intel.</p>\n<p>So a 32-bit binary will typically be able to run on a 32-bit machine or a 64-bit machine, but a 64-bit binary will only be able to run on a 64-bit machine because it will use instructions, registers, addressing modes, etc than the 32-bit machine does not support.</p>\n<p>Likewise if you try to disassemble a 64-bit binary using a disassember that is designed only to disassemble 32-bit binaries of the same CPU family, it will only recognize the 32-bit instructions, registers, addressing modes, etc. All of the 64-bit-specific stuff will just confuse the disassembler.</p>\n<p>I'm not familiar with either OllyDBG or x64dbg so I don't know what they are capable of.</p>\n<p>You seem to be under the impression that a \"32 bit disassembler\" will somehow convert or translate 64 bit code into 32 bit code. That is not possible. That would be in the realm of cross-compiling and emulation.</p>\n</div>",
            "votes": "3",
            "user": "hippietrail",
            "time": "Sep 9, 2019 at 10:48",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>32 and 64 differ in another way than you think. You have pretty much the same binary code but on 64 you operate on 64-bit registers and 64-bit data. 32 and 64 are about data not code. Using OllyDBG on 64-bit code is ok, but:</p>\n<ul>\n<li>you have to take attention that you operating on 64-bit data.<br/> \nie. when Olly shows MOV DWORD[PTR], EAX  then really moves 8 bytes.</li>\n<li>one-byte instruction like INC EAX does not exist on 64-bit.<br/>\nwhen OllyDBG show one-byte i.e. INC EAX this is a 64-bit prefix.<br/>\nSo: XOR EAX,EAX <br/>\n  INC EAX<br/>\n  JZ will run differently on 32 and 64</li>\n<li>probably much more issues</li>\n</ul>\n</div>",
            "votes": "0",
            "user": "0xC0000022L",
            "time": "Dec 6, 2019 at 8:14",
            "is_accepted": false,
            "comments": []
        }
    ]
}