{
    "title": "How to figure out which button I'm pressing",
    "link": "https://reverseengineering.stackexchange.com/questions/22189/how-to-figure-out-which-button-im-pressing",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm working on an app, that I'm trying to get to work on a android device that has additional buttons.</p>\n<p>The device is called a BH95, from BATL. It has 4 side buttons(1 volume up, 1 power button, 2 unknown), 3 regular android buttons on the face(Home, Return, the running app list), and 6 additional face buttons below the screen. 4 of those 6, are D-pad buttons. The two other are F1 and F2.</p>\n<p>While running a test app to determine what the keys are actually called, (A simple OnKeyDown override that posts a toast and I can just use a breakpoint on), I've found that the 2 unknown side buttons and the F1 and F2 don't trigger the OnKeyDown code, so I can't figure out what the keyCode for them is, if they even have one, and aren't handled in some weird way.</p>\n<p>My question is, how would I figure out what the buttons are called, or how to handle them?</p>\n<p>Also, the lock/power button also doesn't trigger the keydown, neither do the home or list running app buttons, but the Return button and Volume up do.</p>\n<p>ps. It doesn't have a volume down, instead overflowing the volume control when you press volume at max volume, muting the device, with an additional press setting volume to lowest non-muted.</p>\n<p>App is a Xamarin App in VS2019</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "294",
    "tags": [
        "android",
        "c#"
    ],
    "user": "MartinArrJay",
    "time": "Sep 25, 2019 at 13:24",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Actually found out what the keys were using the logcat in the Android Device Monitor.\nF1,F2,F3 and F5, for those curious.</p>\n</div>",
            "votes": "1",
            "user": "MartinArrJay",
            "time": "Sep 26, 2019 at 7:22",
            "is_accepted": false,
            "comments": []
        }
    ]
}