{
    "title": "Is it possible to view and modify process memory without attaching the debugger in x64dbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/22201/is-it-possible-to-view-and-modify-process-memory-without-attaching-the-debugger",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This functionality is available in Cheat Engine where the debugger won't be attached until you set a breakpoint or explicitly ask for the debugger to be attached. I've looked everywhere and couldn't find anything similar for x64dbg. It's very useful when you want to view or modify memory of the process which employs anti-debug measures.</p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "1k",
    "tags": [
        "x64dbg"
    ],
    "user": "l3240120",
    "time": "Sep 27, 2019 at 20:47",
    "comments": [
        {
            "user": "MkInitCpIO",
            "text": "<span class=\"comment-copy\">C functions: <a href=\"https://docs.microsoft.com/en-us/windows/win32/api/memoryapi/nf-memoryapi-writeprocessmemory\" rel=\"nofollow noreferrer\">WriteProcessMemory</a> and ReadProccessMemory</span>",
            "time": null
        },
        {
            "user": "l3240120",
            "text": "<span class=\"comment-copy\">I'm aware that these are the functions that tools make use of in order to read and modify debugee's memory. But I'm asking if there is a plugin or functionality in x64dbg to do this without attaching the debugger. It seems to me that the only way to open a process in x64dbg is to attach the debugger.</span>",
            "time": null
        },
        {
            "user": "Anonymous Anonymous",
            "text": "<span class=\"comment-copy\">@l3240120 Yeah... The thing is, x64dbg IS a debugger - you can't expect it to do anything else than debugging. Although I do understand the need to view/modify memory. I personally just use CE for doing it.</span>",
            "time": null
        },
        {
            "user": "Pickle Rick",
            "text": "<span class=\"comment-copy\">I'm not entirely sure but I would wager a guess that the answer is no. You're talking about using a tool that is exclusively a debugger but without any debugging. Cheat Engine is fine if you simply want to view / edit memory. There are many memory manager tools, why so insistent on x64dbg when it doesn't seem to be the right tool for your job?</span>",
            "time": null
        },
        {
            "user": "Danrevella",
            "text": "<span class=\"comment-copy\">The TitanEngine.dll is no longer available for download. Is it possible a reupload? Thanks</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Yes, this is possible. You can replace TitanEngine.dll with <a href=\"https://github.com/mrexodia/StaticEngine\" rel=\"nofollow noreferrer\">https://github.com/mrexodia/StaticEngine</a> and “attach” to a running process.</p>\n<p>There is however no way to switch debugging modes and breakpoints etc will simply not work.</p>\n</div>",
            "votes": "2",
            "user": "mrexodia",
            "time": "Oct 15, 2019 at 15:05",
            "is_accepted": true,
            "comments": []
        }
    ]
}