{
    "title": "How do I decompile/modify a .dfu file?",
    "link": "https://reverseengineering.stackexchange.com/questions/22221/how-do-i-decompile-modify-a-dfu-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to get my old 3D printer to work with wifi again. A while ago the company was shut down and the printer relied on their website for print queues and stuff, so now the only way to use the printer is with USB. I have been trying to modify the firmware so I could get the wifi running again, running to my computer instead of their website.\nI was looking at the firmware with IDA and found the following:</p>\n<p><a href=\"https://i.sstatic.net/m1Ul2.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/m1Ul2.png\"/></a></p>\n<p>I'm not really sure what is means, but it looks like a directory. Is there A way that I can possibly extract that file and edit it?</p>\n<p>Sorry if this was a waste of time. I'm new to this, and all I want is the wifi working again on the darn printer.</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "1k",
    "tags": [
        "firmware"
    ],
    "user": "Cool Dude",
    "time": "Sep 30, 2019 at 21:24",
    "comments": [
        {
            "user": "Rup",
            "text": "<span class=\"comment-copy\">Chances are that was the path to the wifi code that got compiled into the binary. It may well be open source code though, so you could e.g. look for GitHub repos with that path such as <a href=\"https://github.com/krzychb/esp_to_cloud/blob/master/components/wifi/wifi.c\" rel=\"nofollow noreferrer\">this one</a> - any chance the wifi chip is <a href=\"https://github.com/espressif/esp-idf\" rel=\"nofollow noreferrer\">an ESP32</a> ? That might help you understand the code you have.</span>",
            "time": null
        },
        {
            "user": "Cool Dude",
            "text": "<span class=\"comment-copy\">Thanks for your reply. The company (newmatter) did not release the source, because it contained third party code. Maybe I can find some that is compatible with the printer.</span>",
            "time": null
        }
    ],
    "answers_data": []
}