{
    "title": "How to repack reverse-engineered router firmware?",
    "link": "https://reverseengineering.stackexchange.com/questions/22319/how-to-repack-reverse-engineered-router-firmware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I managed to unpack the filesystem contents of a TP-Link router <code>.bin</code> file using <code>binwalk</code>, <code>dd</code> and <code>unsquashfs</code>. The squash FS was at the end of the bin file, the part before having a relatively large lzma archive.</p>\n<p>Now I would like to make changes to the filesystem and repack the firmware file back. How can I achieve this? How do I know whether I need to attach a checksum or similar?</p>\n<p>This question is different from <a href=\"https://reverseengineering.stackexchange.com/questions/13262/how-can-i-put-a-binwalk-extracted-firmware-back-into-a-bin-binary-file\">How can I put a Binwalk extracted firmware back into a .bin binary file?</a> in that it's vendor specific, <code>firmware-mod-kit</code> is a not preferred option (unless it's the only one...) and it contains an extra question</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "1k",
    "tags": [
        "firmware"
    ],
    "user": "Sir Muffington",
    "time": "Oct 16, 2019 at 17:19",
    "comments": [
        {
            "user": "Chris Stratton",
            "text": "<span class=\"comment-copy\">\"a TP-Link router\" is not being very specific for a supposedly device-specific question.  In general terms, read up on how to pack a squashfs (don't forget that the permissions need to come out right).  As for a checksum, you could try without and see what happens.  Hopefully you've done a flash dump before starting.  Sometimes physically replacing the chip is worth the few minutes it takes.</span>",
            "time": null
        },
        {
            "user": "Sir Muffington",
            "text": "<span class=\"comment-copy\">@ChrisStratton flash dump is for in case I mess up or what? I don't have a second chip to it with in the first place apparently.</span>",
            "time": null
        }
    ],
    "answers_data": []
}