{
    "title": "Immunity Debuggger Inconsistent Results",
    "link": "https://reverseengineering.stackexchange.com/questions/22402/immunity-debuggger-inconsistent-results",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Question for people using Immunity Debugger.</p>\n<p>Just started using Immunity Debugger, using 1.85 on Win 7 Pro.</p>\n<p>Doing some labs on vulnserver.exe and I am getting inconsistent results from Immunity Debugger. I will attach vulnserver.exe, select run in IB and execute a script to crash vulnserver to analyze the output. Detach &amp; restart vulnserver.exe, then attach again and run the same script. I get two different results in the output.</p>\n<p>However, if I exit and restart Immunity Debugger between scripts, I get the correct output after running a script each time.</p>\n<p>Is this standard behavior for Immunity Debugger? You have to exit and restart between each debugging capture?</p>\n<p>I have re-installed IB twice and it continues to give these inconstant results.</p>\n<p>TIA</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "121",
    "tags": [
        "debuggers"
    ],
    "user": "CG2000",
    "time": "Oct 27, 2019 at 12:39",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">what's IB? the results are different how exactly?</span>",
            "time": null
        },
        {
            "user": "CG2000",
            "text": "<span class=\"comment-copy\">Sorry, IB = Immunity Debugger. If I keep Immunity Debugger open and attach &amp; detach I will get various EIP values. However, if I open and close the Immunity Debugger application, I will get the proper (expected) result. It is as if it is perhaps caching information between each attach &amp; detach? As long as I shut Immunity Debugger down and start it again, it works fine. It is just a little annoying to have to restart it over and over.</span>",
            "time": null
        }
    ],
    "answers_data": []
}