{
    "title": "IAT vs GOT address resolving: which of them resolve during runtime and which during load time by default?",
    "link": "https://reverseengineering.stackexchange.com/questions/22509/iat-vs-got-address-resolving-which-of-them-resolve-during-runtime-and-which-dur",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So based on my knowledge on windows apps, as far as i know the IAT gets filled  with correct addresses when the library gets loaded (correct me if I'm wrong)</p>\n<p>now in linux, they use GOT, and again based on my knowledge the GOT gets filled in run time by default, meaning first we jump into PLT, then the first time i use a function (for example puts) we first call the dynamic loader by jumping in the beginning of PLT and that fills the corresponding address in GOT, and next time i call puts then i directly jump into it after going into PLT</p>\n<p>so this means that by default, windows fills all the addresses in the IAT in load time but linux doesn't, correct?</p>\n<p>and if so, then isn't this a security risk for linux? because in windows IAT is inside the rdata section and is read only, but in linux is read and write! and for example if we have a format string exploit then we can write on GOT but this doesnt happen in windows, am i missing something here? </p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "817",
    "tags": [
        "windows",
        "linux",
        "memory",
        "pe",
        "elf"
    ],
    "user": "OneAndOnly",
    "time": "Nov 11, 2019 at 14:17",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You understanding is correct:</p>\n<ul>\n<li><p>PE's IAT is resolved by the system loader and can be made read-only afterwards.</p></li>\n<li><p>ELF's GOT entries initially point to PLT stubs and are overwritten with the final address on the first call.. meaning GOT needs to remain writable.</p></li>\n</ul>\n<p>Writable GOT is indeed a known source of vulnerabilities which is why mitigations like <a href=\"https://mudongliang.github.io/2016/07/11/relro-a-not-so-well-known-memory-corruption-mitigation-technique.html\" rel=\"nofollow noreferrer\">RELRO</a> have been introduced. </p>\n<p>Note that PEs can also use <a href=\"https://docs.microsoft.com/en-us/cpp/build/reference/delayload-delay-load-import\" rel=\"nofollow noreferrer\">delay-loaded imports</a> which work similar to GOT+PLT (resolution on first call) and may be subject to similar issue.</p>\n</div>",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "Nov 11, 2019 at 18:44",
            "is_accepted": true,
            "comments": [
                {
                    "user": "OneAndOnly",
                    "text": "<span class=\"comment-copy\">But why they didn't load the entire thing by default? considering windows does it and there is no big performance impact, why not just do it and improve security?</span>",
                    "time": null
                }
            ]
        }
    ]
}