{
    "title": "Is there a way to see 'imports' in a .NET binary?",
    "link": "https://reverseengineering.stackexchange.com/questions/22543/is-there-a-way-to-see-imports-in-a-net-binary",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Programs such as <a href=\"http://ntinfo.biz/index.html\" rel=\"nofollow noreferrer\">Detect It Easy</a> or IDA can show functions and libraries (<code>DLLs</code>) imported by a binary in the case of <code>C/C++</code> binaries. I have a collection of <code>.NET</code> malware that I'm analyzing and would like to see the imported functions and DLLs for these binaries. I've noticed that <code>_CorExeMain</code> is the only thing that I can see in the <code>imports</code> section with tools such as <code>IDA</code> for such binaries. I'm aware that I can decompile the <code>.NET</code> binary in a tool like <code>dnSpy</code> and manually read the function calls but I would like an automated and fast of doing this such as the <code>imports</code> section in <code>IDA</code>.</p>\n<p>Is there a way to see functions imported from dynamic libraries for <code>.NET</code> binaries?</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "351",
    "tags": [
        "ida",
        "binary-analysis",
        ".net",
        "automation"
    ],
    "user": "learnerX",
    "time": "Nov 15, 2019 at 5:21",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">use proper tools - <code>dnSpy</code> or other decompiler that's targeting .NET programs.</span>",
            "time": null
        },
        {
            "user": "learnerX",
            "text": "<span class=\"comment-copy\">I already mentioned <code>dnSpy</code> in my question. I still have to manually find the library calls by reading the code. Is there a section in <code>dnSpy</code> that I'm missing where all the function calls are shown in one place?</span>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">@learnerX so do I understand correctly that you want the list of all methods that a specific .NET program uses based on its references?</span>",
            "time": null
        },
        {
            "user": "learnerX",
            "text": "<span class=\"comment-copy\">@PawełŁukasik yes, I would like to see the list of all library function calls like in the <code>imports</code> view in <code>IDA</code></span>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">to get native function calls might be tricky if impossible (maybe some magic  done after methods are JITed) - to get the list of managed function calls might be possible to get.</span>",
            "time": null
        }
    ],
    "answers_data": []
}