{
    "title": "jmp to 4 byte address in shellcode",
    "link": "https://reverseengineering.stackexchange.com/questions/22568/jmp-to-4-byte-address-in-shellcode",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm playing around with the PE header and the Import Address Table. I wrote a dummy program that calls <code>MessageBoxA</code> with some retard parameters. After successfully replacing the <code>MessageBoxA</code> function address with an address inside a cave with <code>PAGE_EXECUTE_READWRITE</code> access, I tried running the program. The shellcode is just messing with the pushed arguments and afterwards it's jumping to the original <code>MessageBoxA</code> function address.</p>\n<p>If the address is <code>75FD0CD0</code> then the Little Endian representation would be <code>D00CFD75</code>, right?</p>\n<p>After running it and the program successfully calling the code inside the cave, it would crash. I opened Cheat Engine to compare the values. The instruction that was supposed to jump to the <code>MessageBoxA</code> function was showing a jump to a different function. After opening the edit option, the instruction was: <code>jmp 76552F20</code> instead of <code>jmp 75FD0CD0</code>. I edited that and put the correct address inside and the bytes that were written were <code>80EAA475</code> which was somehow pointing to the <code>MessageBoxA</code> function.</p>\n<p>How did Cheat Engine get <code>80EAA475</code> from <code>75FD0CD0</code>?</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "288",
    "tags": [
        "assembly",
        "pe32"
    ],
    "user": "LaurentiuS",
    "time": "Nov 18, 2019 at 4:17",
    "comments": [
        {
            "user": "sudhackar",
            "text": "<span class=\"comment-copy\">Can you also show what were the exact opcodes of the instruction that you and cheat engine wrote? <code>jmp</code> is usually relative to current <code>rip</code>. e.g <code>eb08</code> disassembles to <code>jmp 0xa</code> i.e. jump 10(8+2(size of instruction)) if the base address is 0.</span>",
            "time": null
        },
        {
            "user": "LaurentiuS",
            "text": "<span class=\"comment-copy\">@sudhackar You're right. The <code>EIP</code> is currently <code>0x008A224B</code> and the address <code>0x75CB0CD0</code> =&gt; <code>0x75CB0CD0-0x008A224B-0x5</code> and it gives <code>0x7540ea80</code>, which is exactly what CE formatted. Thanks</span>",
            "time": null
        },
        {
            "user": "Anton Kukoba",
            "text": "<span class=\"comment-copy\">Do you take into account ASLR? Do you generate your jump according to the USER32.DLL current address, or just hope that next time the process starts the offset will be the same?</span>",
            "time": null
        },
        {
            "user": "LaurentiuS",
            "text": "<span class=\"comment-copy\">@AntonKukoba Yes. I get the base from <code>PEB</code>, halt the process on entry with <code>jmp -2</code> so that the loader can fill the <code>LDR</code> structure (where I get the base of modules), parse the IAT and get the absolute function address.</span>",
            "time": null
        }
    ],
    "answers_data": []
}