{
    "title": "x64dbg: break when a register contains a value",
    "link": "https://reverseengineering.stackexchange.com/questions/22599/x64dbg-break-when-a-register-contains-a-value",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is there a way to break code execution when a register contains a particular value with x64dbg? I'm not talking about setting a conditional breakpoint at a specific location, but about watching the registers permanently and breaking as soon as the value is found. Ideally, I'd like to check the registers for string references, if possible.</p>\n<p>If such functionality doesn't exist, I'd be willing to try and implement it myself, if you could point me in the right direction, maybe.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "4k",
    "tags": [
        "x64dbg",
        "breakpoint",
        "register"
    ],
    "user": "Johannes Stricker",
    "time": "Nov 22, 2019 at 7:01",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Going by the similar <a href=\"https://reverseengineering.stackexchange.com/questions/22036/\">question for OllyDbg</a>, it seems you should be able to achieve it by using <a href=\"https://help.x64dbg.com/en/latest/introduction/ConditionalTracing.html\" rel=\"nofollow noreferrer\"><em>Conditional Tracing</em></a>.</p>\n<p>The doc also mentions:</p>\n<blockquote>\n<p>You can start a conditional tracing by “Trace over until\n  condition”/”Trace into until condition” commands in the Debug menu.</p>\n</blockquote>\n</div>",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "Nov 22, 2019 at 9:05",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Johannes Stricker",
                    "text": "<span class=\"comment-copy\">Thank you, I thought about that myself and tried to use it. However, when I start the trace, the debuggee becomes unresponsive until the trace is over. I need to interact with the ui while the trace is running, though. Any ideas?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">Tracing is very slow as it needs to stop at every instruction to check the condition. Try to limit it to the smallest piece of code  you can.</span>",
                    "time": null
                },
                {
                    "user": "Johannes Stricker",
                    "text": "<span class=\"comment-copy\">I'll try to see if I can get anywhere with that, thank you. I suppose there isn't any other way then? Could something like that \"easily\" be added to x64dbg or would it be similarly slow to tracing?</span>",
                    "time": null
                }
            ]
        }
    ]
}