{
    "title": "Extract files of a SquashFS Filesystem",
    "link": "https://reverseengineering.stackexchange.com/questions/22899/extract-files-of-a-squashfs-filesystem",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I already asked a similar question but after a deeper analysis of the filesystem I found out that I misunderstood the problem and that's why I decided to delete the old question and make a new one.</p>\n<p>I extracted a squashfs filesystem from a NAND Flash with binwalk. The problem was that I couldn't see the files that it contains, even sasquatch wasn't able to extract the files. <br/>That's why I assumed that I was dealing with a vendor hacked version of squashfs that sasquatch couldn't handle. </p>\n<p>However after a deeper analysis I found out that the extracted squashfs filesystem was looking very suspicious to me due to two things. <br/>\nFirst of all it starts with a generic squashfs header but right after the header there is a large sequence of 0xFF Bytes that is interrupted by a 0x01 Byte every 17. Byte.<br/>\nBesides of that the whole sequence is interrupted periodically by some kind of UBI signature.<br/> \nYou can see this in the picture.</p>\n<p>The second thing that looked suspicious to me was that after the large sequence mentioned above the UBI signature kept appearing periodically (until the end ) through the whole part that is supposed to be what the suqashfs contains. (the signature is sometimes different from each other but still very similar).</p>\n<p>I also know from the boot process analysis that the rootfs of the device is mounted on top of a UBI volume:<br/> </p>\n<blockquote>\n<p>root=/dev/ubiblock0_1 noinitrd ro ubi.mtd=6 mtdparts=spi0.0:256k(u-boot),64k(u-boot-env),128k(reserved),64k(art);spi0.1:5m(kernel0),5m(kernel1),118m(ubi) rootfstype=squashfs ubi.block=0,1 mem=64M</p>\n</blockquote>\n<p>Has the UBI signature that is appearing through the entire squashfs file something to do with the fact that it is mounted on top of a UBI volume and how do I deal with that? <br/>\nOr how can I mount it/is it possible to mount it like this?</p>\n<p><a href=\"https://i.sstatic.net/eeR8n.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/eeR8n.png\"/></a></p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "896",
    "tags": [
        "binary-analysis",
        "firmware",
        "linux",
        "binwalk"
    ],
    "user": "Ramazuri",
    "time": "Jan 3, 2020 at 11:45",
    "comments": [],
    "answers_data": []
}