{
    "title": "How does this wannacry sample work?",
    "link": "https://reverseengineering.stackexchange.com/questions/22995/how-does-this-wannacry-sample-work",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I downloaded wannacry sample here: <a href=\"https://github.com/fadyosman/WannaCrySample/releases\" rel=\"nofollow noreferrer\">https://github.com/fadyosman/WannaCrySample/releases</a>. Don't forget to enter password for archive.</p>\n<p>I figured out how most of the binary works, except the very last part in WinMain located at 401FE7. I have the problem with reversing where if-block starts at 004020FE, there's a lot of gibberish code following. Wannacry calls the function at 4020F5 which loads ADVAPI32.dll and KERNEL32.dll and gets function handles. Instruction at 402112 calls the function which prepares the decryption key to be used further. Before it wannacry unpacks an archive with several files. 40212D calls function which decrypts t.wnry and stores contents somewhere in process space. This is all I know for sure except unnecessary details. So I have a few questions:</p>\n<ol>\n<li>When program calls 4012FD function at 402104, what does this function do? The main body doesn't have meaningful code. There are several functions nested in it which call InitializeCriticalSection(). </li>\n<li>There are 2 functions located at 4021BD and 402924. The first one calls another functions with arguments referring to functions like VirtualAlloc, VirtualFree, LoadLibrary, etc. 402924 just contains some magic code. I realize this is where wannacry launcher transmits execution to another process, I just want to know the mechanism how it does in general.</li>\n<li>Btw wannacry loads several functions from KERNEL32.dll which it already had, why does it load them again?</li>\n</ol>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "80",
    "tags": [
        "windows",
        "x86",
        "malware"
    ],
    "user": "M. Kalter",
    "time": "Jan 14, 2020 at 9:17",
    "comments": [],
    "answers_data": []
}