{
    "title": "Using Frida for early and late instrumentation",
    "link": "https://reverseengineering.stackexchange.com/questions/23009/using-frida-for-early-and-late-instrumentation",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to hook functions with Frida where one .so file (x.so) is loaded early and another .so file (z.so) is loaded slightly later, after some processing is done by the application.</p>\n<p>This is what I want to do</p>\n<ol>\n<li>Start Frida early in order to hook the early functions</li>\n<li>Start Frida late in order to hook the late functions</li>\n</ol>\n<p>So if I used Frida script to start the application, I can hook the early functions but Frida will show an error that it cannot find the late functions (unable to find export).</p>\n<p>Currently, what I did was use one Frida script to start the application and then used another Frida script to attach to the already running process to hook the late function.</p>\n<p>Starts Frida early</p>\n<pre><code>frida -U -f com.myapplication.file -l frida_script.js --no-pause\n</code></pre>\n<p>Attach Frida to running process</p>\n<pre><code>frida -U -l frida_script2.js -p 4444\n</code></pre>\n<p>Are there better ways to perform early and late hooking in one script such that some hooks are started early and some hooks can start once the .so file is loaded?</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "4k",
    "tags": [
        "android",
        "frida"
    ],
    "user": "localacct",
    "time": "Jan 15, 2020 at 3:22",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">You can start the Android in mode \"waiting for debugger\". In this case the process exists but the app does not starts running until the debugger (-&gt; Frida) has been attached. See for example <a href=\"https://stackoverflow.com/q/51583504/150978\">this question</a>.</span>",
            "time": null
        },
        {
            "user": "localacct",
            "text": "<span class=\"comment-copy\">Thanks @Robert I will take a look at that</span>",
            "time": null
        }
    ],
    "answers_data": []
}