{
    "title": "Reproducing video format",
    "link": "https://reverseengineering.stackexchange.com/questions/23021/reproducing-video-format",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I received a promotional video screen with a USB interface. It comes with a couple example videos, one of which is here: <a href=\"https://drive.google.com/file/d/1B-wSURAgK-ePrfpKFM5nYbNhQ5mD-Ii2/view?usp=sharing\" rel=\"nofollow noreferrer\">https://drive.google.com/file/d/1B-wSURAgK-ePrfpKFM5nYbNhQ5mD-Ii2/view?usp=sharing</a> md5sum <code>506a6c478b0874262802e8ae7d718c59</code></p>\n<p>I'd love to figure out how to generate this file format, but I don't have much experience in reverse engineering. It seems to be a mostly normal AVI file, and can play in VLC just fine.</p>\n<h3>What I've got so far</h3>\n<p>I've been poking around with ffprobe, in a hex editor, and RiffPad, and found the following things:</p>\n<ul>\n<li>it is a RIFF AVI with 2 streams - video and audio</li>\n<li>the video frames are mjpeg - specifically mjpeg/AVI1, header <code>FF D8 FF E0 00 10 41 56 49 31</code></li>\n<li>the video frames are padded to the dword boundary instead of the word boundary <a href=\"https://docs.microsoft.com/en-us/windows/win32/directshow/avi-riff-file-reference\" rel=\"nofollow noreferrer\">which seems to be the standard</a>. Riffpad and other such tools complain about this</li>\n<li><code>ffmpeg -i original.avi -codec copy test.avi</code> doesn't produce a working file - ffmpeg appends junk lists to some of the header information. deleting the lists and aligning frames to the dword boundary make the file play despite some differences in the header data.</li>\n<li>I'm having a hard time finding a tool to generate similarly formatted frames. FFMPEG wants to generate JFIF data instead of AVI1, which doesn't work. <a href=\"https://lightbits.github.io/v4l2_huffman/\" rel=\"nofollow noreferrer\">Judging by this source</a>, the original frames contain their own huffman encodings, and the container file lists the chunks as <code>dc</code> chunks, so compressed images. <code>jpegtoavi</code> generates <code>db</code> segments, which I can't copy over.</li>\n</ul>\n<p>Any help with what to do next would be very appreciated.</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "208",
    "tags": [
        "file-format"
    ],
    "user": "rsheldiii",
    "time": "Jan 16, 2020 at 17:59",
    "comments": [
        {
            "user": "rsheldiii",
            "text": "<span class=\"comment-copy\">I've mostly resolved to figuring this out by myself. Given that VLC reads the frames and video itself with no issue I know I'm dealing with someone that should be reasonable - it looks like a bog-standard MJPEG, 4:2:0 subsampling, the 4 standard huffman tables embedded for some reason and 2 quantization tables.  I've found the BinData gem and I'm bitbanging this out</span>",
            "time": null
        }
    ],
    "answers_data": []
}