{
    "title": "How to re-analyse a function in IDA Pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/2309/how-to-re-analyse-a-function-in-ida-pro",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am working on an obfuscated binary. IDA did pretty good job distinguishing code from junk. However, I had started messing around with a function changing from <code>code</code> to <code>data</code> and  vice versa and completely messed the function up and destroyed the way it looked like. I don't want to start new database on the executable and re-do all my work. </p>\n<p>Is there a way to re-analyse a single function and return it to the way it looked like after initial analysis?</p>\n</div>",
    "votes": "18",
    "answers": 1,
    "views": "32k",
    "tags": [
        "disassembly",
        "ida"
    ],
    "user": "PSS",
    "time": "Jun 21, 2013 at 7:57",
    "comments": [
        {
            "user": "DCoder",
            "text": "<span class=\"comment-copy\">You can highlight the entire function, <code>U</code> to undefine it, <code>C</code> to mark it as code, <code>P</code> to mark it as a function.</span>",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "<span class=\"comment-copy\">Please dont add \"Thank you\" to the end of your questions. It does not add any information relevant to the post and is frowned upon across the entire Network. Any thanking that needs to done should be done via voting and marking answers correct (or via comments). Thanks! :)</span>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">Time-saving tip: You can just use <code>U</code> and <code>P</code>; no need to use <code>C</code> if you're going to use <code>P</code> anyway.</span>",
            "time": null
        },
        {
            "user": "PSS",
            "text": "<span class=\"comment-copy\">@JasonGeffner Doing P directly failed for me with \"Command MakeFunction failed\" error. However, U, C, Alt+P worked just fine.</span>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">Interesting. I've never had that problem with highlighting the code, undefining (<code>U</code>), then highlighting the undefined bytes and pressing (<code>P</code>). Glad you got it working with <code>C</code>, though!</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Well you have to first Undefine the code using U key and they select the code and right click you will have some options like C (code) and so on. IDA almost give you ability of doing anything wih obfuscated code to help you to understand code correctly.</p>\n<p><em>Addendum</em>\nAfter converting to C (code), do Alt+P to create/edit function. In addition, rebuild layout graph by go to Layout view, right clicking empty space and selecting \"Layout graph\".</p>\n</div>",
            "votes": "21",
            "user": "evandrix",
            "time": "Sep 23, 2017 at 15:23",
            "is_accepted": true,
            "comments": []
        }
    ]
}