{
    "title": "Disassembly - First steps",
    "link": "https://reverseengineering.stackexchange.com/questions/23161/disassembly-first-steps",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I decided that I need to understand this more thoroughly, so am working in parallel with two resources: one more modern and one original from @Aleph1.</p>\n<p>In the essay, there is a basic code snippet, called <code>example1.c</code>, thus:</p>\n<pre><code>void function(int a, int b, int c) { \n    char buffer1[5];\n    char buffer2[10];\n}\nvoid main() { \n    function(1,2,3);\n}\n</code></pre>\n<p>In the illustrated disassembly of that, once complied obvs, thus:</p>\n<pre><code>pushl %ebp\nmovl %esp,%ebp\nsubl $20,%esp\n</code></pre>\n<p>where <code>$20</code> is the size due to word size, as the 5 char buffer takes 8 bytes (2 words) and the 10 char buffer takes 12 bytes (3 words). So far so simple. This makes perfect sense to me.</p>\n<p>While playing along on Ubuntu 12.04 - 32bit version [chosen due to the other parallel disassembly blog post] - the same disassembly comes out as:</p>\n<pre><code>push   %ebp\nmov    %esp,%ebp\nsub    $0xc,%esp\n</code></pre>\n<p>where <code>$0xc</code> is 12 in decimal. What is the reason for this discrepancy, assuming that I've copied the code properly. It's not really holding up my progress, but I feel that I should be able to understand why my code is subtracting by 12 bytes, and the example by 20. My best guess is that it's down to the architecture of the OS that I'm using in some way, but would like someone with more experience to validate this or tell me why.</p>\n<p><strong>Update</strong></p>\n<p>I was comparing apples with oranges, which I've just realised. The code from Aleph1's essay where it talks about the <code>subl $20</code> came from the -S (assembly) output from gcc, and is discussing the <em>prolog</em> whereas the code I took the <code>sub 0xc</code> came from within <code>gdb</code> and running <code>disassemble main</code>.</p>\n<p>I have run gcc -S to produce example1.s - but that produces a different result again, although I suspect it's down to Johan's comment about gcc options, which happen to be <code>gcc -g -fno-stack-protector -z execstack -S -o example1.s example1.c</code>. Looking in the <em>prolog</em>, the result that I get here is <code>subl %16</code> (which in dec is 22).</p>\n<p>It has simply raised more questions! :D</p>\n<p><strong>Update 2</strong></p>\n<p>Dump of assembler code within <code>gdb</code> is:</p>\n<pre><code> 0x080483bc &lt;+0&gt;:   push   %ebp\n 0x080483bd &lt;+1&gt;:   mov    %esp,%ebp\n 0x080483bf &lt;+3&gt;:   sub    $0xc,%esp\n</code></pre>\n<p>Is that why we see <code>$0xc</code> (12 in decimal) because it's showing as <code>&lt;+3&gt;</code> (i.e. +3 words, 12 bytes)?</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "105",
    "tags": [
        "disassembly",
        "x86",
        "gdb"
    ],
    "user": "FiddleDeDee",
    "time": "Jun 17, 2020 at 9:54",
    "comments": [
        {
            "user": "Johann Aydinbas",
            "text": "<span class=\"comment-copy\">What are your compilation flags for the 2nd snippet? As <code>function</code> doesn't use either buffer, it's likely the compiler did some optimization on the code. I could see the compiler recognizing it's okay to overlap the buffers so it chose the smallest DWORD-aligned buffer to hold both (=12 bytes).</span>",
            "time": null
        },
        {
            "user": "FiddleDeDee",
            "text": "<span class=\"comment-copy\">Good shout:<code>-g -fno-stack-protector -z execstack -o</code></span>",
            "time": null
        },
        {
            "user": "FiddleDeDee",
            "text": "<span class=\"comment-copy\">I tried taking out the <code>-o</code> so that gcc output <code>a.out</code> and then gdb'd that - same sub amount of <code>$0xc</code></span>",
            "time": null
        },
        {
            "user": "Johann Aydinbas",
            "text": "<span class=\"comment-copy\">Try adding <code>-O0</code> (letter O followed by number zero) or <code>-Og</code> and see if it changes something. Another trick <i>might</i> be adding the <code>volatile</code> keyword in front of your buffers. That way the compiler cannot reason about use of them and try to optimize stuff but I'm not 100% it works here. Quick edit: Apparently gdb defaults to <code>-O0</code> when nothing is specified.</span>",
            "time": null
        }
    ],
    "answers_data": []
}