{
    "title": "Duo MFA Enrollment API Parameters",
    "link": "https://reverseengineering.stackexchange.com/questions/23176/duo-mfa-enrollment-api-parameters",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Not sure if this is the right forum. I want to enroll my device for Duo MFA without using the Duo app. Duo uses simple HOTP codes, so I used <a href=\"https://github.com/revalo/duo-bypass\" rel=\"nofollow noreferrer\">this</a> script to find the HOTP secret and enter it manually in my preferred authenticator app.</p>\n<p>The enrollment succeeds (I see my device in the list of enrolled devices), and the codes generated by the script don't give an \"invalid code\" error. Instead, they give a \"Duo Mobile None is not allowed\" error, asking me to upgrade to a newer version of the app.</p>\n<p>Obviously I need to pass some API params so Duo thinks I'm running a supported version. However, the Duo API documentation isn't clear on how version, platform, and OS version are reported during enrollment. (In fact, I don't even see documentation for that API - just authentication for an individual user and administration for all users in a company).</p>\n<p>The API I'm using is /push/v2/activation/{code}, where {code} is the activation code stored in the enrollment QR code. I've tried adding 'version' (3.33.0.3, 3.33.0, etc.), 'platform' (apple%20ios), and 'type' (tablet) parameters, with those values based on documentation for other APIs. Enrollment succeeds regardless, but I continue to see the \"Duo Mobile None is not allowed\" message. Looking at the <a href=\"https://github.com/duosecurity/duo_client_python\" rel=\"nofollow noreferrer\">Python client repo</a> on Github didn't help me understand how to enroll devices.</p>\n<p>If possible I'd like to report the platform as Apple iOS, but another solution might be imitating a hardware token or the generic_smartphone type mentioned in the other API docs.</p>\n<p>Can someone with more experience than me suggest a way to discover the correct API parameter names and values, or some other way to proceed? Thanks in advance.</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "125",
    "tags": [
        "api",
        "websites"
    ],
    "user": "Anonymous",
    "time": "Feb 2, 2020 at 23:28",
    "comments": [
        {
            "user": "tmr232",
            "text": "<span class=\"comment-copy\">It seems more relevant to contact Duo or their support for this kind of issue. In any case, it does not seem to fit this forum. Good luck!</span>",
            "time": null
        }
    ],
    "answers_data": []
}