{
    "title": "How can I debug a non-main .NET assembly using dnSpy?",
    "link": "https://reverseengineering.stackexchange.com/questions/23201/how-can-i-debug-a-non-main-net-assembly-using-dnspy",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am performing a security assessment on a .NET application. dnSpy is a great tool to do this. However, I've reached a module which is not in the \"main\" section of the program... It is <em>loaded</em> by the program (it's a DLL). I need to find out which code calls a class/method from the DLL and one way I thought of doing this is to debug the program. However, I would have to discover manually which functionality I need to perform in the program in order to get it to call this particular class.</p>\n<p>Is there a better way to do this? I also tried to search for the text call to the method in the source code but haven't found anything significant. Lastly, in OllyDbg, a user can manually load a DLL using its DLL loader. Is this possible to do in dnSpy or another .NET tool?</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "1k",
    "tags": [
        "debugging",
        "decompilation",
        ".net"
    ],
    "user": "the_endian",
    "time": "Feb 6, 2020 at 18:20",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">does this DLL contains managed code too?</span>",
            "time": null
        },
        {
            "user": "the_endian",
            "text": "<span class=\"comment-copy\">@PawełŁukasik yes</span>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">ok, <code>Analyze</code> is not enough in this case to see where it's being called from?</span>",
            "time": null
        },
        {
            "user": "the_endian",
            "text": "<span class=\"comment-copy\">@PawełŁukasik ah that helped - I was not aware of the Analyze command. Took me a bit to find it but I located it in a right-click context menu for the object. There are some values which show nothing under \"read by\" but I'm skeptical because I'm sure they're used.</span>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">it would be easier to help working with real files as now we are a bit speculating why/why not they are there. Can you attach the files and add a comment one of which class you are looking for usages?</span>",
            "time": null
        }
    ],
    "answers_data": []
}