{
    "title": "How to calculate Opcode Length from Ollydbg",
    "link": "https://reverseengineering.stackexchange.com/questions/23242/how-to-calculate-opcode-length-from-ollydbg",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Suppose I reverse a dll, and searching for a Function, say for instance Send(), I have reversed the ws2_32.dll now How Can i calculate the number of bytes from there to know that i need 5 bytes of instruction using say ollydbg or immunity debugger??</p>\n<p>I am very new to this and I do not want to use a disassembly library like Minhook and Microsoft Detours. Just something done manually.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "369",
    "tags": [
        "assembly"
    ],
    "user": "Tom",
    "time": "Feb 13, 2020 at 14:26",
    "comments": [
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">can you rephrase Your question ollydbg shows the opcodes for each instruction also it shows the address of current instruction and address of next instruction  either count the opcode bytes or subtract  current addr from next addr  to get current instructions length</span>",
            "time": null
        },
        {
            "user": "Jon",
            "text": "<span class=\"comment-copy\">Minhook and Detours aren't disassembly libraries</span>",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">There is nothing to <i>calculate</i>. There is no rhyme or reason to the length of x86/x64 opcodes. If you want the length of an opcode, you'll going to have to look up <i>that specific opcode</i>. Make sure to get any argument types correct; a simple jump <code>jz</code> can be from 2 to up to -- I <i>think</i> -- 5 bytes long.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In Ollydbg it shows the opcodes to the left of the instructions you are currently looking at, inside of the disassembly view.</p>\n<p>There isn't anything to calculate, its <em>already there</em>. You can just extract that then get the length through what opcode range you are looking at.</p>\n</div>",
            "votes": "1",
            "user": "Graham",
            "time": "Feb 14, 2020 at 16:48",
            "is_accepted": false,
            "comments": []
        }
    ]
}