{
    "title": "How do I get the location of the original audio/video file embedded on a webpage?",
    "link": "https://reverseengineering.stackexchange.com/questions/2331/how-do-i-get-the-location-of-the-original-audio-video-file-embedded-on-a-webpage",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Some sites like The Free Dictionary, and many other translation and pronunciation services, offers a <a href=\"http://www.thefreedictionary.com/hacker\">little icon next to the word</a> so you could hear its pronunciation.</p>\n<p>How can I figure out the source for an audio\\video embedded file on a webpage? \nWhere do I start?</p>\n</div>",
    "votes": "17",
    "answers": 4,
    "views": "359k",
    "tags": [
        "embedded"
    ],
    "user": "H0ward R0ark",
    "time": "Jun 26, 2013 at 1:51",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>When you create a website and you embed images, videos, audio, javascript or other external sources, you specify their location by an own URL too. </p>\n<p>For example you have this directory structure on your server, which resolves to the following accessible URLs (asuming your website is www.example.com):</p>\n<pre><code>|-- /index.html                -&gt;  www.example.com/index.html\n|-- /images/                   -&gt;  www.example.com/images/\n|    |-- /banner.png           -&gt;  www.example.com/images/banner.png\n|    +-- /icons/               -&gt;  www.example.com/icons/\n|         +-- favicon.png      -&gt;  www.example.com/icons/favicon.png\n+-- /audio/                    -&gt;  www.example.com/audio/\n    |-- intro.mp3              -&gt;  www.example.com/audio/intro.mp3\n    +-- voice.flac             -&gt;  www.example.com/audio/voice.flac\n</code></pre>\n<p>When you access <code>index.html</code> your browser will look for all the other embedded URLs and will get them from the server too. You can use tools like <em>Firebug for Firefox</em> or the <em>Chrome Developer Console</em> to capture the requests. One of those requests should be the URL to the media file.</p>\n<p>If you have an HTML <code>&lt;embed&gt;</code> tag (or a <code>&lt;img&gt;</code> tag), the URL to that media is specified by the <code>src</code> attribute, which can be also examined with tools like Firebug or the Chrome Developer Console. You can make a <code>rightclick-&gt;Inspect Element</code> anywhere on the page and examine the HTML.</p>\n<pre><code>&lt;embed src=\"/audio/intro.mp3\"&gt;   -&gt; www.example.com/audio/intro.mp3\n</code></pre>\n</div>",
            "votes": "12",
            "user": "samuirai",
            "time": "Jun 26, 2013 at 12:30",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">Yes, in Chrome or IE you can press <code>F12</code> to bring up the Developer Tools window (in Firefox as well if you have Firebug installed). In the Developer Tools window, go to the Network view, click on the speaker icon on the target page, and for the example you posted above you'll see the following URL appear in the list of requests in the Network view: <a href=\"http://img.tfd.com/hm/mp3/H0004900.mp3\" rel=\"nofollow noreferrer\">img.tfd.com/hm/mp3/H0004900.mp3</a></span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">An alternative is to go to the Elements view in the Developer Tools window, select the speaker icon on the page for inspection, and you'll see in the Elements view: <code>&lt;embed src=\"http://img.tfd.com/m/sound.swf\" flashvars=\"sound_src=http://img.tfd.com/hm/mp3/H0004900.mp3\"...</code></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Another way to find url with audio file is check get requests by Developer Tools in Chrome browser:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/BMsHJ.jpg\"/></p>\n</div>",
            "votes": "13",
            "user": "0x8BADF00D",
            "time": "Mar 27, 2018 at 15:49",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Karlo",
                    "text": "<span class=\"comment-copy\">Which browser are you using?</span>",
                    "time": null
                },
                {
                    "user": "0x8BADF00D",
                    "text": "<span class=\"comment-copy\">Chrome browser.</span>",
                    "time": null
                },
                {
                    "user": "Brendan Dolan-Gavitt",
                    "text": "<span class=\"comment-copy\">Of particular note there is the \"Copy as cURL\", which will give you the full curl command to exactly reproduce the HTTP request. This can be helpful if the site checks user agents / referers / cookies etc.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Nowadays webpages commonly uses players written with Javascript, so you need a little html and js knowledge to dig out and use some web development tools like others mentioned</p>\n<p>But there is an easier way of doing this. You can just use an app like <a href=\"http://wwww.internetdownloadmanager.com\" rel=\"nofollow noreferrer\">Internet Download Manager (IDM)</a> which offers to download any kind of multimedia file on playing on a browser. It supports all audio video playing websites like Youtube, Grooveshark etc. Its shareware but you can make this operation with trial version too.</p>\n<p>Install the application and restart your browser. It supports Firefox, Chrome, Opera, IE, Safari etc.</p>\n<p>When you play the file on the page you will see an icon on the left top of the window</p>\n<p><img alt=\"Download Audio\" src=\"https://i.sstatic.net/jIElb.jpg\"/></p>\n<p>After you click icon you will see the download file info window which has file url and other information. You can copy and use file name part of the url. Usually it has a pattern and you can guess or find paths of other files.</p>\n<p><img alt=\"Download File Info Dialog\" src=\"https://i.sstatic.net/Qodev.jpg\"/></p>\n</div>",
            "votes": "2",
            "user": "qwerty",
            "time": "Apr 22, 2015 at 19:40",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Colin",
                    "text": "<span class=\"comment-copy\">Thank you so much accfews. Your answer was perfect. That freeware is so simple to use. As soon as i play a track, the window automatically pops up asking if i want to download the audio track. Thanks heaps as I had no luck digging through js code in inspect.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Developer console.,</p>\n<p>Once you open your internet go to the settings and to find developer console. What ever is on the page will be provided in the source code. You just have to find it. Some sites block this info from viewers being able to see the things like location, dates, times. But depending on what site you're visiting you may be able to find this information. As long as the site isn't high security, like government or porn..... You should be able to find the original links and everything else to be honest. You will be surprised at the amount of information that can be pulled from this. If you ask me, This is the smartest and most simplistic way to do it. You don't have to build any code or use anyone's else's code. Your just simply phishing for the information you need on the websites source code.</p>\n</div>",
            "votes": "-1",
            "user": "Prettipretti",
            "time": "Sep 2, 2022 at 22:40",
            "is_accepted": false,
            "comments": []
        }
    ]
}