{
    "title": "Reversing WSASend finding functions that called it",
    "link": "https://reverseengineering.stackexchange.com/questions/23548/reversing-wsasend-finding-functions-that-called-it",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to make my first DLL calling game functions</p>\n<p>What I need is tracing functions that call <code>WSASend</code>, so it will be easy for me to get all functions address to call them from my DLL.</p>\n<p>What I want is to call game functions, so if I can trace when WSASend is called, then return to the function that called it, I will be able to get all functions I need.</p>\n<p>My final goal is getting all functions addressess like SendWalk, ChangeLookDir, Attack, Follow, MoveItem, DropItem, etc... all of them are calling WSASend</p>\n<p>This is how the game module is calling the <code>WSASend</code> function:\n<a href=\"https://i.sstatic.net/Qtc0G.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/Qtc0G.png\"/></a></p>\n<p>This is what I get from logging calls to WSASend:</p>\n<p><a href=\"https://i.sstatic.net/VD5VT.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/VD5VT.png\"/></a></p>\n<p>The problem is that the game is sending packets all time, so if I put a breakpoint in that call it will pause everytime and I won't be able to make anything in game.</p>\n<p>After reading the <a href=\"https://docs.microsoft.com/en-us/windows/win32/api/winsock2/nf-winsock2-wsasend\" rel=\"nofollow noreferrer\"><code>WSASend</code> documentation</a>, I understand that maybe what I need is the buffer, so I can filter the parameter <code>lpBuffers</code> maybe setting a conditional breakpoint and hopefully the buffer will be the same in that packets that are sent every 1 sec (I'm not sure about what I'm saying)</p>\n<p>I'm a beginner so if I can improve in any way this question let me know, maybe I'm missing any detail that would help you to help me :)</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "290",
    "tags": [
        "debugging",
        "x64dbg",
        "game-hacking",
        "packet"
    ],
    "user": "kuhi",
    "time": "Mar 28, 2020 at 13:07",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">It's not really clear what you want. Of course you are stating your <i>immediate</i> goal, but what we'd need to know is your ultimate goal. How else could we suggest improvements? Right now it seems you have set your mind on a particular course and you are telling us what you thing your next step is, but since we don't know the destination it's not clear how to help you. Have you looked at <a href=\"https://en.wikipedia.org/wiki/Windows_Filtering_Platform\" rel=\"nofollow noreferrer\">WFP</a> or the older LSPs?</span>",
            "time": null
        },
        {
            "user": "kuhi",
            "text": "<span class=\"comment-copy\">Edited the question, if there's anything else I can do please let me know. Thank you very much @0xC0000022L</span>",
            "time": null
        }
    ],
    "answers_data": []
}