{
    "title": "Question regarding sections in PE image",
    "link": "https://reverseengineering.stackexchange.com/questions/2359/question-regarding-sections-in-pe-image",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a file that among other sections has:</p>\n<ul>\n<li><code>code</code></li>\n<li><code>.text</code></li>\n<li><code>.bss</code></li>\n</ul>\n<p>And this file was not crafted manually, so I suspect. </p>\n<p>The question is what could be the meaning of <code>code</code> and <code>.text</code> sections? As far as I know, executable code is located in <code>.text</code> section, so why compiler would add the other one? </p>\n<p>If you need more information for answer I'll try to provide as much as I can.</p>\n</div>",
    "votes": "2",
    "answers": 5,
    "views": "1k",
    "tags": [
        "pe"
    ],
    "user": "PhoeniX",
    "time": "Jun 28, 2013 at 7:51",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In general <code>.code</code> and <code>.text</code> sections are synonymous. Both of those section contain executable code. Whereas, <code>.data</code> section contains non-executable data. </p>\n<p><code>.bss</code> segment is usually added due to optimization. The size of <code>.bss</code> is usually really small since it is designated to hold uninitialized data. In comparison, <code>.data</code> segment is designated to hold global/static variables and data structures.</p>\n<p>Second code segment was most likely added manually. </p>\n<p>Now, it is impossible to answer why the binary has two sections of code just by looking at the names. I think it is obviously unusual. I can state one thing for sure, you have two sections for a reason. However, you gonna have to fig in to figure out what the reason is.</p>\n<p>First thing I would do is try to confirm segment permissions and CLASS. True code segment will have <code>Read</code> and <code>Execute</code> permissions. You can use lots of different tools to verify it. For instance, if you were to use IDA, it is done with <code>Segments Subview</code>, which could be accessed with <kbd>Shift</kbd> + <kbd>F7</kbd>. You might get lucky and spot the fake right from the get go. </p>\n</div>",
            "votes": "6",
            "user": "PSS",
            "time": "Jul 2, 2013 at 17:55",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can create arbitrary sections, with any name you wish in a PE file.</p>\n<p><code>.text</code> and <code>code</code> sections ring a bell, perhaps this is a packed executable? I cannot remember which packer, however.</p>\n</div>",
            "votes": "2",
            "user": "Jonathon Reinhart",
            "time": "Jun 28, 2013 at 5:16",
            "is_accepted": false,
            "comments": [
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">No, it is a plain file.</span>",
                    "time": null
                },
                {
                    "user": "Jonathon Reinhart",
                    "text": "<span class=\"comment-copy\">@ph0sec How do you know? Packed executables still look and run like their native formats (PE), but there is code embedded inside to unpack the obfuscated hidden code.</span>",
                    "time": null
                },
                {
                    "user": "Cream Cracker",
                    "text": "<span class=\"comment-copy\">I saw it in packed executables too</span>",
                    "time": null
                },
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">Yes, you are both right. It's just in that particular case, I've already unpacked it and removed all layers of obfuscation. I did not get to the code that is placed in <code>.code</code> section. All my analysis was concentrated on the <code>.text</code> section.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Section names <code>.text</code> and <code>.bss</code> are default names used by Microsoft's VC++ compiler. While <code>CODE</code> is used by Borland's compiler, <code>code</code> is not.</p>\n<p>As such, it would seem as though this PE file was created with Microsoft VC++ and the <code>code</code> section was added manually by the PE file's author. However, section names can be modified to be any value up to 8 characters (and are ignored by the Windows loader), so take this with a grain of salt.</p>\n</div>",
            "votes": "2",
            "user": "Jason Geffner",
            "time": "Jun 28, 2013 at 12:58",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jonathon Reinhart",
                    "text": "<span class=\"comment-copy\">\"Firstly, the linker names the sections, not the compiler.\" This is simply not true. Where do you think the linker gets the names from?</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">Well, technically, the compiler <i>suggest</i> names for the sections. But, indeed, this is up to the linker to create the sections and name it. I do think that Jason is right.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">You're correct; I've edit my post above. Thanks for spotting the error ;)</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Using <code>#pragma data_seg(.xxxxx)</code> one can create a separate section and it is possible for the name to be <code>.code</code>, as section names are just names and are alterable.</p>\n</div>",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Jun 27, 2013 at 21:01",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Section names don't mean anything to the PE loader and you can set them manually or change them using hex editors. So the only real way of knowing the section's real properties is by checking <code>IMAGE_SECTION_HEADER</code>'s <code>Characteristics</code> field. Use a PE dumping utility like dumpbin and check to see if the section is marked as executable.</p>\n</div>",
            "votes": "1",
            "user": "shebaw",
            "time": "Jul 3, 2013 at 4:44",
            "is_accepted": false,
            "comments": [
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">both sections have the same markings - R and X.</span>",
                    "time": null
                }
            ]
        }
    ]
}