{
    "title": "How to set-up a lab for reversing a mass transit ticketing system?",
    "link": "https://reverseengineering.stackexchange.com/questions/2372/how-to-set-up-a-lab-for-reversing-a-mass-transit-ticketing-system",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I recently stumbled on a <a href=\"http://www.reddit.com/r/ReverseEngineering/comments/1ep2ur/reverse_engineering_a_mass_transit_ticketing/\" rel=\"nofollow\">talk</a> from Ruxcon 2012 explaining the reverse of a mass transit ticketing system. </p>\n<p>Basically, they focused on paper tickets reverse engineering with a skimmer and a lot of brain activity. This seems to be quite amusing and interesting. But, nowadays a big part of the ticketing system is also using NFC (Near Field Communication) or RFID (Radio Frequency IDentification) especially for people who are subscribing for a month or more.</p>\n<p>I found a few websites (like <a href=\"http://users.skynet.be/marc.sel/index-MTC.html\" rel=\"nofollow\">this one</a> or <a href=\"http://wiki.yobi.be/wiki/MOBIB\" rel=\"nofollow\">this one</a>), trying to gather knowledge about how all this ticketing system works. But, nothing really global and fully furnished (from the paper ticket system up to the NFC/RFID system).\nI would like to know how to set up such a lab.</p>\n<ul>\n<li>What hardware is required (skimmer, NFC/RFID/Smartcard reader, the needed computing power to gather, ...) ?</li>\n<li>What is, approximately, the cost, in time for setting such a lab (and getting the necessary material to work on) ?</li>\n<li>How to proceed once the lab has been set-up and the material gathered ?</li>\n<li>Is there some tricks that can lower the cost/time that you spend on it ?</li>\n</ul>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "405",
    "tags": [
        "hardware",
        "smartcards"
    ],
    "user": "perror",
    "time": "Jun 28, 2013 at 17:32",
    "comments": [
        {
            "user": "asheeshr",
            "text": "<span class=\"comment-copy\">Too many questions here as well. Legal issues by themselves can make up a single question. See my comment <a href=\"http://reverseengineering.stackexchange.com/questions/2371/is-there-a-global-database-about-mass-transit-ticketing-system-reverse-engineeri#comment2005_2371\" title=\"is there a global database about mass transit ticketing system reverse engineeri%23comment2005_2371\">reverseengineering.stackexchange.com/questions/2371/…</a></span>",
            "time": null
        },
        {
            "user": "perror",
            "text": "<span class=\"comment-copy\">I am okay to make the legal issue a separate question. But, more splitting will be just counter-productive, in my humble opinion.</span>",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "<span class=\"comment-copy\">Thats why I said, ask the other questions <i>based on the answers you get to your first</i>. This would allow for better quality and more specialized questions.</span>",
            "time": null
        },
        {
            "user": "perror",
            "text": "<span class=\"comment-copy\">Okay. Thanks for the help for improving the question(s) !</span>",
            "time": null
        },
        {
            "user": "NULLZ",
            "text": "<span class=\"comment-copy\">@perror i was at that talk it was great fun! One of the key things they had was access to hundreds of cards which they all read the data from, as well as documenting what was printed on the card so they could match the variables that changed! :)</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I haven't done a lot with NFC, but I recommend starting the same way I did.  Start at the hardware level and then work up.  </p>\n<p>Hardware:\n + BladeRF (I think it works with NFV)</p>\n<ul>\n<li>Misc Extra tags (get different ones from different vendors)</li>\n</ul>\n<p>Software:\n + nfcinteractor (android)</p>\n<p>Also check out: \nwww.securitytube.net/video/8029</p>\n<p>It's a really good talk on NFC related research.</p>\n</div>",
            "votes": "1",
            "user": "Silas Cutler",
            "time": "Oct 10, 2013 at 16:23",
            "is_accepted": true,
            "comments": []
        }
    ]
}