{
    "title": "How is Hopper on Windows or Linux?",
    "link": "https://reverseengineering.stackexchange.com/questions/2378/how-is-hopper-on-windows-or-linux",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"http://www.hopperapp.com/\" rel=\"noreferrer\">Hopper</a> seems to be focused on Mac, but how does its capabilities on Windows or Linux compares with the free version of IDA for reversing x86/x64 executables?  </p>\n<p><a href=\"http://www.hopperapp.com/\" rel=\"noreferrer\">Hopper</a> seems to have all the major features IDA has; a graph view, ability to rename objects, and a Python API, yet IDA is still the standard.</p>\n<p>Are these features in Hopper as effective as in IDA? Are there any known deficiencies in Hopper? </p>\n</div>",
    "votes": "6",
    "answers": 1,
    "views": "10k",
    "tags": [
        "tools"
    ],
    "user": "zer",
    "time": "Jul 2, 2013 at 12:13",
    "comments": [
        {
            "user": "adric",
            "text": "<span class=\"comment-copy\">I'm new to reversing but aside from the specifics mentioned in the FAQ at <a href=\"http://www.hopperapp.com/faq.html\" rel=\"nofollow noreferrer\">hopperapp.com/faq.html</a> and some fun with Ubuntu dependencies on Debian it seems fine on Linux, and Windows, and Wine.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am using IDA for about 10 years and I have been using Hopper for a few months (on Kubuntu and Windows).</p>\n<p>It depends what you want to do, what budget you have and whether it's hobby or professional.</p>\n<p>Clearly, IDA is more powerful in most aspects. It supports a wider ranger of processors, has more loaders and a plugin system as well as two powerful scripting languages (IDC/Python).</p>\n<p>Given the price tag, Hopper is <strong>well worth</strong> the purchase. Indeed, I can confirm that the decompiler is more simplistic than even the Hex-Rays decompiler in its beta some years back (I have never used it again since then). If someone wants to start with reverse engineering, I am clearly recommending IDA Freeware for those that work only with Windows PE files (and outside a commercial context) and Hopper if the hobbyist is willing to shell out a few bucks.</p>\n<p>There are a few things to consider: do you look for a decompiler or a disassembler and what's your budget? From daily use I'd say that the disassembler for x86 and x64 is pretty much equivalent for ELF (Linux) and PE (Windows) files from my point of view.</p>\n<p>All features in Hopper seem to function as well as you'd expect from a fairly new product (meaning the time of development that went into it overall) and the price tag. It is being improved all the time, so you'll be able to get feature updates.</p>\n<p>However, the biggest - by far - <strong>disadvantage</strong> for me is the \"learning curve\". A lot of the features in Hopper have different shortcuts or slightly different work flows, but one can clearly see how the author must be aware of IDA and recent developments in IDA (notably since about IDA version 5.0). Although I come from the other side, I think someone starting with Hopper will benefit from it when later going professional and switching to paid IDA.</p>\n<hr/>\n<p>Last but not least a note about decompilers. Being more acquainted with disassemblers I actually found results of Hex-Rays confusing and ambiguous in many cases in the past. The same holds for decompilation results of Hopper. If you are a seasoned reverser, disassembly sometimes tends to be \"clearer\" (albeit less convenient) the more experience you have.</p>\n</div>",
            "votes": "8",
            "user": "0xC0000022L",
            "time": "Jul 5, 2013 at 0:47",
            "is_accepted": true,
            "comments": []
        }
    ]
}