{
    "title": "How does GDB's process recording work?",
    "link": "https://reverseengineering.stackexchange.com/questions/243/how-does-gdbs-process-recording-work",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>A curious and useful feature of GDB is <a href=\"http://sourceware.org/gdb/current/onlinedocs/gdb/Process-Record-and-Replay.html#Process-Record-and-Replay\">process recording</a>, allowing an analyst to step forwards and backwards through execution, writing a continuous log of the changes to program state that allow for remarkably accurate playback of program code.</p>\n<p>Although we can all safely say the process recording log contains the executable's changes to the various data and control registers, the functionality is much more than keeping some serialized representation of the current continuation. For example, I've been able to reify the state of an executable that uses threads to modify shared memory.</p>\n<p>Certainly we can't expect time dependent code to work, but if threading code modifying shared state can, in general, be stepped through backwards and <em>still work reliably again</em>, what limitations does process recording have beyond the purely architectural challenges (i.e displaced stepping) specified in the documentation?</p>\n</div>",
    "votes": "9",
    "answers": 1,
    "views": "698",
    "tags": [
        "gdb",
        "debuggers"
    ],
    "user": "zetavolt",
    "time": "Mar 24, 2013 at 17:46",
    "comments": [
        {
            "user": "Peter Andersson",
            "text": "<span class=\"comment-copy\">Is this really reverse engineering? It seems to me that it relates more to forward engineering and reading code as the GDB source is open.</span>",
            "time": null
        },
        {
            "user": "zetavolt",
            "text": "<span class=\"comment-copy\">Point taken, I believe the topic is certainly of interest to reverse engineers so I was banking on it being considered appropriate.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">AFAIK it is based on a relatively new CPU feature in Intel x86 CPUs. It is the same feature that is used for \"recording\" in VMware.</span>",
            "time": null
        },
        {
            "user": "zetavolt",
            "text": "<span class=\"comment-copy\">I think we can all agree that the question (generally) is of immediate interest to reverse engineers. Additionally, the chance of receiving a thoughtful and intelligent response relating to this particular question is much greater here than on StackOverflow, which I think merits your consideration Peter.</span>",
            "time": null
        },
        {
            "user": "Gilles 'SO- stop being evil'",
            "text": "<span class=\"comment-copy\">While this question isn't directly about doing RE, it's of particular interest to people doing RE and it's about understanding a tool of RE in a way that helps understand RE techniques. So I think it is on-topic on this site.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The feature is described in a bit more detail on <a href=\"http://sourceware.org/gdb/wiki/ProcessRecord\" rel=\"noreferrer\">GDB wiki</a>:</p>\n<blockquote>\n<h2>How it works</h2>\n<p>Process record and replay works by logging the execution of each\nmachine instruction in the child process (the program being debugged),\ntogether with each corresponding change in machine state (the values\nof memory and registers). By successively \"undoing\" each change in\nmachine state, in reverse order, it is possible to revert the state of\nthe program to an arbitrary point earlier in the execution. Then, by\n\"redoing\" the changes in the original order, the program state can be\nmoved forward again.</p>\n</blockquote>\n<p><a href=\"http://www.ckernel.org/news/hellogcc/prec.pdf\" rel=\"noreferrer\">This presentation</a> describes even more of the internals.</p>\n<p>In addition to above, for some remote targets GDB can make use of their \"native\" <a href=\"http://sourceware.org/gdb/current/onlinedocs/gdb/Reverse-Execution.html\" rel=\"noreferrer\">reverse execution</a> by sending Remote Serial Protocol <a href=\"http://sourceware.org/gdb/current/onlinedocs/gdb/Packets.html\" rel=\"noreferrer\">packets</a> <code>bc</code> (backward continue) and <code>bs</code> (backward step). Such targets <a href=\"http://sourceware.org/gdb/news/reversible.html\" rel=\"noreferrer\">include</a>:</p>\n<ul>\n<li>moxie-elf simulator</li>\n<li>Simics</li>\n<li>VMware Workstation 7.0</li>\n<li>the SID simulator (xstormy16 architecture)</li>\n<li>chronicle-gdbserver using valgrind</li>\n<li>UndoDB</li>\n</ul>\n</div>",
            "votes": "7",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": []
        }
    ]
}