{
    "title": "Unable to set a breakpoint in IDA 6?",
    "link": "https://reverseengineering.stackexchange.com/questions/2441/unable-to-set-a-breakpoint-in-ida-6",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am unable to set a breakpoint in IDA 6. I have tried pressing <kbd> F2</kbd> , but it did not work. Also, the breakpoints buttons on the toolbar are all disabled. What's the problem? </p>\n</div>",
    "votes": "5",
    "answers": 2,
    "views": "4k",
    "tags": [
        "ida"
    ],
    "user": "user22323",
    "time": "Jul 10, 2013 at 0:05",
    "comments": [
        {
            "user": "JamalS",
            "text": "<span class=\"comment-copy\">Also, make sure you have a debugger selected. You need to choose one, e.g. WinDBG, before adding a breakpoint, at least in 6.x.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Not all views of IDA offer breakpoints. You should be able to set breakpoints on certain views, for example <code>IDA View</code>. Other views do not offer breakpoints and automatically disable them. Such views include, but not limited to <code>Hex View</code>, <code>Structures</code>, <code>Enums</code>, <code>Imports</code>, and <code>Exports</code>. </p>\n<p>This is how the process of setting breakpoints is described in <a href=\"http://nostarch.com/idapro.htm\" rel=\"nofollow\">IDA-Pro Book</a>:</p>\n<blockquote>\n<p>Breakpoints are set in IDA <strong>by navigating to the location</strong> at which you want execution to pause and using the F2 hotkey (or right-clicking and selecting Add Breakpoint). Addresses at which breakpoints have been set are highlighted with a red (by default) band across the entire disassembly line. A breakpoint may be removed by pressing F2 a second time to toggle the breakpoint off. A complete list of breakpoints currently set within a program may be viewed via Debugger-&gt;Breakpoints-&gt;Breakpoint List.</p>\n</blockquote>\n</div>",
            "votes": "5",
            "user": "PSS",
            "time": "Jul 10, 2013 at 1:48",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Also, as a super basic thing to check, verify that you are currently connected to a remote debugger. :)  I've made that mistake before.  Shut down the remote debugger and forgot about it!</p>\n</div>",
            "votes": "1",
            "user": "David Hoelzer",
            "time": "Jul 13, 2013 at 1:51",
            "is_accepted": false,
            "comments": []
        }
    ]
}