{
    "title": "Change androidmanifest.xml file within apk",
    "link": "https://reverseengineering.stackexchange.com/questions/24888/change-androidmanifest-xml-file-within-apk",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am able to unpack an android apk file with <strong>apktool</strong>, but when I am repacking the apk file using apktool, it just crashes with errors, and <a href=\"https://ibotpeaches.github.io/\" rel=\"nofollow noreferrer\">ibotpeaches</a> seems not patching those errors for years. Now comes my question: could you please help me to recompile that androidmanifest.xml to an apk using any other tool or techniques?</p>\n</div>",
    "votes": "-1",
    "answers": 1,
    "views": "5k",
    "tags": [
        "android",
        "patch-reversing",
        "apk",
        "binary-format",
        "binary-editing"
    ],
    "user": "hanan",
    "time": "May 9, 2020 at 0:08",
    "comments": [
        {
            "user": "JesusFreke",
            "text": "<span class=\"comment-copy\">The aapt tool that is bundled with the android sdk is the only way I'm aware of to compile textual resource xmls back into binary xmls.</span>",
            "time": null
        },
        {
            "user": "hanan",
            "text": "<span class=\"comment-copy\">can you share with me cmd commands or parameters to use with it or any references. thanks</span>",
            "time": null
        },
        {
            "user": "JesusFreke",
            "text": "<span class=\"comment-copy\">It's been a long time since I've looked at it. From what I recall, the arguments to use are rather non-trivial. Your best bet is to find the arguments that are used when building an android app normally via gradle or whatever. Or the arguments that apktool calls aapt with.</span>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">You don't name the app and you don't name the errors you encounter. How are we supposed to answer this question without knowing why APK repackaging fails for your app? When talking about errors provide links to each error you encounter (e.g. to the issue page). And if you can you should name the app you are trying to repack.</span>",
            "time": null
        },
        {
            "user": "hanan",
            "text": "<span class=\"comment-copy\">Look, I have provided the error link! I think you didn't read the details.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The androidmanifest.xml file can be modified and the apk can be repackaged (I've done it before on various apks), but don't forget to use zipalign and re-sign the apk. If you miss using zipalign and re-sign the apk, that may be a reason why you are getting crashes with errors.</p>\n</div>",
            "votes": "0",
            "user": "auspicious99",
            "time": "May 2, 2020 at 9:31",
            "is_accepted": false,
            "comments": [
                {
                    "user": "hanan",
                    "text": "<span class=\"comment-copy\">that is not what I am talking about! actually it is not that easy. the issue is happening at the repacking the app using apktool. error like this <a href=\"https://github.com/iBotPeaches/Apktool/issues/1719\" rel=\"nofollow noreferrer\">here</a> please understand the question before posting your comment as answer. thanks</span>",
                    "time": null
                },
                {
                    "user": "auspicious99",
                    "text": "<span class=\"comment-copy\">Oh, sorry, I misunderstood. I don't know the answer to that error. Would you prefer if I delete my answer? Or keep it here so people can see your comment and know what is the wrong understanding?</span>",
                    "time": null
                }
            ]
        }
    ]
}