{
    "title": "Help in reverse engineering cheap chinese drone wifi camera module",
    "link": "https://reverseengineering.stackexchange.com/questions/24881/help-in-reverse-engineering-cheap-chinese-drone-wifi-camera-module",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Hello I have an camera module of cheap wifi drone and want to reverse engineer it , but the on searching the ic number on it I couldn't find it.It has an UART and i tried connecting to usb to uart but  on opening the serial monitor nothing shows up, but on opening the app with which it works i.e WifiUfo I can see the footage of the camera .I did an nmap scan from my linux system for the open ports but there are no tcp ports open.But there are two udp ports open.Can somebody please point me in the right direction of reverse engineering it?\nP.S I am fairly new to reverse engineering</p>\n</div>",
    "votes": "1",
    "answers": 3,
    "views": "962",
    "tags": [
        "firmware",
        "ghidra"
    ],
    "user": "Atharva Patil",
    "time": "May 1, 2020 at 16:17",
    "comments": [
        {
            "user": "Billy",
            "text": "<span class=\"comment-copy\">Are there any firmware update images available? Try extracting data from those; look into binwalk.</span>",
            "time": null
        },
        {
            "user": "AleXian95",
            "text": "<span class=\"comment-copy\">I'm trying a similar thing with my WiFi drone. I want to know how the steering commands from the app work. it's the (SHRC H2) Locke app, and the drone's an IOMI Luyu. I hope somebody has a tip.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I did something similar with a WiFi microscope (webcam with a lens on it). I used Ettercap for a unified man-in-the-middle attack with ARP spoofing, so that my phone and the camera communicated through my computer, and Wireshark to log the data. From there it was fairly simple to see what packets the app is sending, and what the camera is sending in response. I was then able to send those magic packets from my computer to the camera and get the camera to start sending data to my computer (see <a href=\"https://unix.stackexchange.com/questions/612667/sending-multiple-packets-of-hex-data-with-udp\">this question</a> for how). Decoding the data will be the next problem.</p>\n<p>In my case, the camera is expecting a set of 11 \"initiation packets\" sent to a specific UDP port. When it receives them, it starts churning out UDP packets to a specific UDP port on the IP address it got the initiation packets from. I wouldn't be surprised if yours is similar.</p>\n<p>Alternatively, decompile the app as mentioned <a href=\"https://reverseengineering.stackexchange.com/questions/18938/reversing-video-protocol-for-chinese-drone-so-i-can-view-the-stream-outside-of-t\">here</a> and investigate the code.</p>\n</div>",
            "votes": "1",
            "user": "ttshaw1",
            "time": "Oct 3, 2020 at 21:10",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It seems you need to figure out how the app is communicating with the drone, either by reverse engineering it or intercepting the traffic. </p>\n</div>",
            "votes": "0",
            "user": "Igor Skochinsky",
            "time": "May 4, 2020 at 11:50",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I know this is a late answer but here you go...Check this post out <a href=\"https://stackoverflow.com/questions/73672859/trying-to-send-udp-packets-through-a-le-wei-5g-wifi-modules-onboard-rx-pin-using\">https://stackoverflow.com/questions/73672859/trying-to-send-udp-packets-through-a-le-wei-5g-wifi-modules-onboard-rx-pin-using</a>, I was trying to do the same thing and resolved the issue. Hope, it helps someone.</p>\n</div>",
            "votes": "0",
            "user": "Frankie2019",
            "time": "Sep 20, 2022 at 13:33",
            "is_accepted": false,
            "comments": []
        }
    ]
}