{
    "title": "Working with strong obfuscated Java",
    "link": "https://reverseengineering.stackexchange.com/questions/24949/working-with-strong-obfuscated-java",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've got a jar file, that is strong obfuscated.</p>\n<ul>\n<li>When I tried to put it into decompilers such as bytecode-viewer and luyten I seen many lines of traps and Chinese letters.</li>\n<li>I tried to deobfuscate it using <a href=\"https://github.com/java-deobfuscator/deobfuscator\" rel=\"nofollow noreferrer\">java-debofuscator</a> but unfortunately, the deobfuscator crashes. </li>\n</ul>\n<p><a href=\"https://www.mediafire.com/file/yrwfhapn1aqc8km/file_to_deobfuscate.jar/file\" rel=\"nofollow noreferrer\">download jar file</a></p>\n<p><a href=\"https://i.sstatic.net/fSZAF.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/fSZAF.png\"/></a>\nCan someone help me or give me advice on how I can deal with it?\nThanks in advance for any help.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "661",
    "tags": [
        "disassembly",
        "decompilation",
        "java",
        "deobfuscation"
    ],
    "user": "Vezmoq",
    "time": "May 8, 2020 at 12:12",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First off, have you tried <a href=\"https://github.com/Storyyeller/Krakatau\" rel=\"nofollow noreferrer\">the Krakatau decompiler</a>? Krakatau is designed specifically for working with obfuscated Java bytecode, although the decompiler doesn't support lambdas and isn't very user friendly.</p>\n<p>That being said, renamed identifiers is not something any tool will able to help you with. You'll just have to reverse engineer it and change them to more meaningful names yourself.</p>\n<p>If decompilation fails, you can also try the Krakatau disassembler. The advantage of disassembly is that it always works, no matter how heavily the bytecode has been obfuscated. It lets you see what's really in the bytecode without the risk of things getting messed up by decompilation. The downside is that it's generally a lot harder to read.</p>\n</div>",
            "votes": "1",
            "user": "Antimony",
            "time": "May 8, 2020 at 12:38",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Vezmoq",
                    "text": "<span class=\"comment-copy\">Yes, I tried to use Krakatau, but decompiling process removes all important classes (these with Chinese name).</span>",
                    "time": null
                },
                {
                    "user": "Antimony",
                    "text": "<span class=\"comment-copy\">No it doesn't. They'll just have different filenames than you might expect since Krakatau forces the output source to have ascii filenames in order to avoid shenanigans. Look closely at the files the decompiler outputs. They will be there, just with weird filenames.</span>",
                    "time": null
                },
                {
                    "user": "got trolled too much this week",
                    "text": "<span class=\"comment-copy\">@Vezmoq: recaf can rename classes/methods to ascii. That's usually a good first step, although sometimes doing that breaks code because some obfuscators use reflection from strings (not necessarily encrypted) and that's enough for recaf not be able to deal with the translation correctly.</span>",
                    "time": null
                }
            ]
        }
    ]
}