{
    "title": "App from playstore runs but the same apk crashes on sideload install",
    "link": "https://reverseengineering.stackexchange.com/questions/24961/app-from-playstore-runs-but-the-same-apk-crashes-on-sideload-install",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>On my nougat device, I have downloaded an app from the playstore, which is running great. I then extracted the apk from the installed app, and uninstalled it and again successfully, with the package installer. But the second time on app launch, it crashed. I have analysed both installation with apk analyzer. First one shows com.android.vending as installer and the application source as \"Google Play\". Sideload installation shows com.google.android.packageinstaller and source Unkown.</p>\n<p>My first thought is that developer doesn't want users to install the app from unknown sources to avoid MOD app or pirate release, etc., and is checking programmatically for this parameter. I have decompiled to Java but didn't find any clue where such a condition is begin checked and exception generated.</p>\n<p>There is a permission BIND_GET_INSTALL_REFERRER_SERVICE, maybe its causing a crash. I know how to decompile and do some smali editing and already changed verifyinstallation method to true in Smali but the app still crashes.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "274",
    "tags": [
        "android",
        "apk"
    ],
    "user": "kakakhan2016",
    "time": "May 16, 2023 at 23:38",
    "comments": [
        {
            "user": "JesusFreke",
            "text": "<span class=\"comment-copy\">If it crashes, then the first thing you should look at (and include in any related questions) is the exception/stack trace or any other related error messages from logcat.</span>",
            "time": null
        },
        {
            "user": "diff",
            "text": "<span class=\"comment-copy\">You need to post the crash/tombstome/relevant part of the logcat to show what the crash is on. Otherwise no one can help you.</span>",
            "time": null
        },
        {
            "user": "ddos",
            "text": "<span class=\"comment-copy\">Im having a similar issue im going to try and use luckypatcher to see if it's an issue with permissions or Google play itself alot of guesswork with MT and luckypatcher should let me figure out what's happening</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I don't think it is related to BIND_GET_INSTALL_REFERRER_SERVICE. That is related to <a href=\"https://issuetracker.google.com/issues/78380811#comment22\" rel=\"nofollow noreferrer\">Firebase Analytics</a>, i.e., referrer for analytics purposes.</p>\n<p>However, it may be related to Google Play app licensing? See <a href=\"https://developer.android.com/google/play/licensing/overview\" rel=\"nofollow noreferrer\">https://developer.android.com/google/play/licensing/overview</a> for more details.</p>\n</div>",
            "votes": "1",
            "user": "auspicious99",
            "time": "May 10, 2020 at 7:05",
            "is_accepted": false,
            "comments": [
                {
                    "user": "kakakhan2016",
                    "text": "<span class=\"comment-copy\">Thanks auspicious99. Its not related to licensing because its not paid app. Your link article saying   \"Google Play considers a user to be licensed if the user is a recorded purchaser of the application\". its free with inapp purchase and anyone can install and use it. Installing same apk after successfull installatiin fail to run as expected. I think app has some installation source checking routine and then generating exception. App is <a href=\"https://play.google.com/store/apps/details?id=com.inscode.autoclicker\" rel=\"nofollow noreferrer\">play.google.com/store/apps/details?id=com.inscode.autoclicker</a></span>",
                    "time": null
                }
            ]
        }
    ]
}