{
    "title": "methods that have zero usage in jadx?",
    "link": "https://reverseengineering.stackexchange.com/questions/24997/methods-that-have-zero-usage-in-jadx",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>so i've been reversing this ai assistant app to figure out what kind of forensic data it leaves on local file system. during static analysis with jadx-gui i found some interesting methods that take string pathnames as parameters and store encrypted json files on that path. but the thing is, these kind of methods has zero usage and appearances on code other than their declarations. none of them or their classes were linked to any receiver method so i have no idea what to make of this.</p>\n<p>So are there any kind of implications regarding methods that only declared once and not used??\nSorry for not sharing and code. i'm not sure i can do that :/</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "345",
    "tags": [
        "android",
        "static-analysis"
    ],
    "user": "bibichachooo",
    "time": "May 13, 2020 at 7:01",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If Jadx can not find any usage of a method this may be a false result:</p>\n<p>A lot of methods can't be decompiled by Jadx, this can happen especially on lengthy or complex methods. All method calls within such non-decompilable methods are invisible to the usage search.</p>\n<p>Additionally as far as I know Jadx has no functionality for resolving inheritance. This may also result in existing usages of a method that can not be found by Jadx.</p>\n<p>Last but not least an Java/Android developer can decide to call a method via reflection. Such method calls can't be recognized by Jadx at all.</p>\n<p>Therefore if Jadx can't find any usage of a method the method may be not unused.\nIf you want to make sure the method is really never called decompile the APK using apktool. </p>\n<ul>\n<li>Make a full-text search for the method signature. </li>\n<li>Check the class hierarchy if the method may be called on other classes.</li>\n<li>Make a full-text search on the method and class name by string and check if they are used for calling the method via Java reflection.</li>\n</ul>\n</div>",
            "votes": "4",
            "user": "Robert",
            "time": "May 13, 2020 at 7:53",
            "is_accepted": false,
            "comments": []
        }
    ]
}