{
    "title": "What is the difference between mapped and private memory segments in xdbg? and what is a reserved segment?",
    "link": "https://reverseengineering.stackexchange.com/questions/24992/what-is-the-difference-between-mapped-and-private-memory-segments-in-xdbg-and-w",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So in xdbg in the memory map, i can see that some segments are mapped and some are private, at first i thought maybe mapped means it has a corresponding file on disk and its the mapped version of that, but there are so many mapped segments which don't have a corresponding file, some of which are reserved</p>\n<p>so i have two questions:</p>\n<ol>\n<li><p>What is the difference between mapped and private segments?</p></li>\n<li><p>What are these (reserved) sections? what does reserved mean?</p>\n<p><a href=\"https://i.sstatic.net/W8ae9.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/W8ae9.jpg\"/></a></p></li>\n</ol>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "925",
    "tags": [
        "windows",
        "debugging",
        "memory"
    ],
    "user": "Mery Ted",
    "time": "May 12, 2020 at 16:41",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<ol>\n<li><p>Private flag is indicator that the particular range of memory isn't shared with any other process</p></li>\n<li><p>Reserved section means that the region of virtual memory is reserved, but not commited yet. This means that the virtual memory region isn't mapped to the physical memory but any other memory allocation calls won't occupy that space until it's released. You may also notice that the debugger doesn't show any protection on the reserved memory regions, this is because the memory needs to be commited in order to be used. To commit the memory you may call the <code>VirtualAlloc</code> again, this time with the MEM_COMMIT flag, now you can access the commited memory and then it will be allocated.</p></li>\n</ol>\n</div>",
            "votes": "1",
            "user": "morsisko",
            "time": "May 15, 2020 at 21:34",
            "is_accepted": true,
            "comments": []
        }
    ]
}