{
    "title": "What is replay debugging?",
    "link": "https://reverseengineering.stackexchange.com/questions/2500/what-is-replay-debugging",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've read some info <a href=\"http://www.replaydebugging.com/\" rel=\"noreferrer\">here</a> but looks like the site concerned itself only with vmware and moreover it has abandoned the idea. How can this concept be used with existing debugging environments like IDA and gdb.If it has already been implemented, I would like links about the same. </p>\n</div>",
    "votes": "5",
    "answers": 2,
    "views": "1k",
    "tags": [
        "debugging"
    ],
    "user": "viv",
    "time": "Jul 18, 2013 at 10:16",
    "comments": [
        {
            "user": "PSS",
            "text": "<span class=\"comment-copy\">The link you have provided clearly explains what replay debugging is. Please clarify your question?</span>",
            "time": null
        },
        {
            "user": "viv",
            "text": "<span class=\"comment-copy\">I want to know how it can be used as an aid in debugging. For example can it be integrated in existing debugging environment and to what benefit? If it was such popular idea then why the site dropped it ?can we ,for example make replay files and then share it with fellow analysts?</span>",
            "time": null
        },
        {
            "user": "viv",
            "text": "<span class=\"comment-copy\">The site provided a lot of info. The reason I asked it here was to create new knowledge. Moreover, the product is merely for vmware. What about integration with gdb and ida and how.Information from a single source cannot help me progress further.</span>",
            "time": null
        },
        {
            "user": "PSS",
            "text": "<span class=\"comment-copy\">Great questions! You should edit your original question to include all that. Otherwise, it sounds to broad. Plus, you answered the original question with your link.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">GDB includes <a href=\"http://sourceware.org/gdb/current/onlinedocs/gdb/Process-Record-and-Replay.html\" rel=\"nofollow noreferrer\">a form of this</a> since version 7 and allows also \"reverse debugging\". VMware on the other hand has abandoned it (despite complaints) with the move from version 7.x to 8.x. I'm not aware that IDA has such capabilities built-in. Perhaps with the GDB stub it could work?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Please excuse the shameless plug, but do check out UndoDB - <a href=\"http://undo-software.com/\" rel=\"nofollow\">http://undo-software.com/</a></p>\n<p>It's functionally pretty similar to gdb 7's reversible debugging, but with radically improved performance. Recording slow-down is typically in the 2x-5x range, with memory usage typically around 10MB per second of recording.</p>\n</div>",
            "votes": "2",
            "user": "user1839284",
            "time": "Jul 20, 2013 at 10:57",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><strong>Mozilla rr</strong></p>\n<p>In addition to the closed source Undo mentioned at <a href=\"https://reverseengineering.stackexchange.com/a/2503/12321\">https://reverseengineering.stackexchange.com/a/2503/12321</a> , we now also have an amazing open source working implementation: <a href=\"https://github.com/mozilla/rr\" rel=\"nofollow noreferrer\">https://github.com/mozilla/rr</a></p>\n<p>I have given a minimal runnable example of it at: <a href=\"https://stackoverflow.com/questions/1206872/how-to-go-to-the-previous-line-in-gdb/46996380#46996380\">https://stackoverflow.com/questions/1206872/how-to-go-to-the-previous-line-in-gdb/46996380#46996380</a></p>\n<p>As seen in that example, you first record, and then replay, and the replay makes every non-deterministic event (e.g. thread switch timings, random number generation) deterministic to match the previous run.</p>\n<p>One huge advantage of that is that it allows you to step back in time, which is extremely often what you want to do when debugging applications, to go from crash back to the real cause that happened in the past. </p>\n<p><strong>QEMU reverse debugging</strong></p>\n<p>Besides the userland reverse debugging which uses hardware and Linux kernel features, simulators can also implement a reverse debugging of course since they control everything.</p>\n<p>In particular, QEMU has had a reverse debugging mode which allows for this: It is not necessarily \"replay based\", but it achieves the same thing: you can step back in time. The cool thing about doing it in an emulator, is that you can also reverse <a href=\"https://stackoverflow.com/a/44226360/895245\">step debug the Linux kernel itself</a> if you are developing it on QEMU. </p>\n<p>See also: <a href=\"https://stackoverflow.com/questions/29153178/is-it-possible-to-do-reverse-debugging-with-qemu/46499855#46499855\">https://stackoverflow.com/questions/29153178/is-it-possible-to-do-reverse-debugging-with-qemu/46499855#46499855</a></p>\n</div>",
            "votes": "2",
            "user": "Ciro Santilli OurBigBook.com",
            "time": "Apr 10, 2020 at 8:03",
            "is_accepted": false,
            "comments": []
        }
    ]
}