{
    "title": "How do you extract all the text from this hex dump?",
    "link": "https://reverseengineering.stackexchange.com/questions/25022/how-do-you-extract-all-the-text-from-this-hex-dump",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am currently ripping the game from a .bin file, that contains all the system text. I have searched through the file and found text in Spanish, French, English, and in Japanese. The problem is that it is hidden from the jumbled text, and Extracting text one by one would be very tiring. Is there a way to extract these strings of text?</p>\n<p>BTW I'm currently running on Windows and my system can't edit Virtualization settings.</p>\n<p><a href=\"https://i.sstatic.net/uxXi6.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/uxXi6.png\"/></a></p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "1k",
    "tags": [
        "binary"
    ],
    "user": "COR3Z",
    "time": "May 15, 2020 at 15:09",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">Your picture is not a “hex dump” btw</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The best would be analyze the executable and reverse engineer how it reads from the .bin file, this way you will be sure you don't miss anything important and possibly extract other useful data.</p>\n<p>However if you can't/don't want to do that you may write simple script that looks for ASCII/Unicode characters and read them until ceratain length or delimeter is reached. </p>\n<p>There is already very nice tool for that task called <code>strings</code>, and is available for Windows thanks to SysIntenals. It can search for ASCII/Unicode strings in the binary image and print them to the stdout which you may of course redirect to file for further examination.</p>\n</div>",
            "votes": "2",
            "user": "morsisko",
            "time": "May 15, 2020 at 16:12",
            "is_accepted": false,
            "comments": []
        }
    ]
}