{
    "title": "Debug process that use /dev/watchdog",
    "link": "https://reverseengineering.stackexchange.com/questions/25050/debug-process-that-use-dev-watchdog",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I want to debug a process with gdb into Linux system, but the problem is that process pings <code>/dev/watchdog</code> so when I tried to debug it, it stop the process for longer than the watchdog interval so the system is rebooting.</p>\n<p>One solution is to patch the binary so it will not use <code>/dev/watchdog</code> and than reboot the system so the \"new\" binary will run.</p>\n<p>But sometime I can't do this solution because I don't want to reboot the system. And I don't control on system's startup script(that activate the watchdog)</p>\n<p>Is there another solution?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "233",
    "tags": [
        "linux",
        "gdb",
        "dynamic-analysis"
    ],
    "user": "yfr24493AzzrggAcom",
    "time": "Apr 15, 2021 at 5:54",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">The question is if you're in control of starting said process. Also you don't mention if this is Linux. If you are and if it is, what I'd be doing first of all would be to see which libc function is used to open <code>/dev/watchdog</code>. Suppose it's <a href=\"https://linux.die.net/man/3/open\" rel=\"nofollow noreferrer\"><code>open</code></a> for a second. In this case you could overwrite it and open your own \"whatever\" (return some magic number) and overwrite <code>read</code>/<code>write</code> as appropriate. The - by far - simplest solution would be to use <a href=\"https://linux.die.net/man/8/ld.so\" rel=\"nofollow noreferrer\"><code>LD_PRELOAD</code></a> and provide your own mock versions of those functions. Depends...</span>",
            "time": null
        },
        {
            "user": "Abdullah Mohamed",
            "text": "<span class=\"comment-copy\">@0xC0000022L You are referring to system calls hooking, is that correct?</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Nope, I don't know how you'd do that from userland or if that's even possible on Linux. <code>LD_PRELOAD</code> (ab)uses the fact that symbols defined by a shared object take precedence by load order. And therefore if you preload a particular custom shared object you can hook functions used by a binary or (other) shared object.</span>",
            "time": null
        },
        {
            "user": "yfr24493AzzrggAcom",
            "text": "<span class=\"comment-copy\">@0xC0000022L see my edit. That Linux,and I don't control on system startup script.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Still too little information then, sorry. You seem to be willing to only give information piecemeal, but for a comprehensive answer you have to give comprehensive information. For example on a modern system you could use bubblewrap or similar to effectively deny your application to be debugged the ability to reboot, so even though <code>/dev/watchdog</code> would be an issue it won't inside a namespace or without the capability to reboot the system. Either way, if you don't control the startup script (of what ... <code>/etc/rc</code>?) what <i>do you control</i>?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Assuming you are using Linux and a loadable watchdog module (like <code>ipmi_watchdog</code>), you could try to modify the value of the corresponding module's <code>action</code> parameter, like using <code>none</code> instead of <code>reset</code>.</p>\n<p>Then the watchdog will fire, but nothing will happen (except an event log message in the BMC, maybe).</p>\n</div>",
            "votes": "1",
            "user": "U. Windl",
            "time": "Apr 13, 2021 at 13:06",
            "is_accepted": false,
            "comments": []
        }
    ]
}