{
    "title": "ida identifies library function as regular function",
    "link": "https://reverseengineering.stackexchange.com/questions/25113/ida-identifies-library-function-as-regular-function",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to find <code>libc</code> symbols in some Windows 32-bit application. For some reason, Ida autoanalysis didn't recognized code that comes from <code>libc</code> as \"library function\", but as a \"regular function\". Let me make it more clear with some screenshots.</p>\n<p>My tutor got the following result (sorry for the low quality, I describe whats in it after the shot):\n<a href=\"https://i.sstatic.net/jobXw.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/jobXw.png\"/></a>\nThis is the same image and you (maybe) can see that the <code>malloc</code> function at <code>0xE0E5DE</code> is recognized as library function. The whole neighborhood is recognized as library function, since this section is for static-linked <code>libc</code> symbols.</p>\n<p>But when I'm loading the image its a \"regular function\", and of course it doesn't resolve as <code>malloc()</code>:\n<a href=\"https://i.sstatic.net/R1iiJ.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/R1iiJ.png\"/></a></p>\n<p>I tried to re-autoanalyze the code (<code>Options --&gt; General --&gt; Reanalyze Program</code>) but it didn't help. Hence I'm asking for help:</p>\n<ol>\n<li>Is there another automatic way to make IDA \"notice\" this code comes from static linking of a library?</li>\n<li>Maybe there is a manual way to do it? like: marking a code chunk as library function and compare it against <code>libc</code>?</li>\n</ol>\n<p><strong>P.S: the app was once packed with UPX, I decompress it. I don't believe it has anything to do with this problem, but maybe it has so I'm mentioning it</strong></p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "844",
    "tags": [
        "ida",
        "static-analysis",
        "symbols",
        "libraries"
    ],
    "user": "Z E Nir",
    "time": "May 25, 2020 at 16:07",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">If static functions are not recognized by Ida this usually means that there are no FLIRT signatures available for the library version/variant used in the binary. Ida comes with a lot of pre-calculated FLIRT signatures but of course it can not contain signatures for each and every combination of library version and used compiler. See also <a href=\"https://www.hex-rays.com/products/ida/tech/flirt/in_depth/\" rel=\"nofollow noreferrer\">hex-rays.com/products/ida/tech/flirt/in_depth</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There can be multiple reasons.</p>\n<ol>\n<li><p>the FLIRT signatures which have been loaded automatically do not have a pattern for this specific function. You can check which signatures have been applied and try loading additional ones via Signatures view (<kbd>Shift-F5</kbd>).</p></li>\n<li><p>the function pattern was conflicting with another function(s) and has been dropped from the final signature file. If you have the original library with the function, you can try creating your own signature.</p></li>\n<li><p>The function has been modified from the standard one so the matching failed</p></li>\n</ol>\n<p>You can try enabling FLIRT diagnostic output by stating IDA with <code>-z4</code> <a href=\"https://www.hex-rays.com/products/ida/support/idadoc/417.shtml\" rel=\"nofollow noreferrer\">command line switch</a> and observe if the address in question is mentioned in the log. Maybe that will give some clues about why it hasn't been matched. </p>\n</div>",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "May 25, 2020 at 13:45",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Z E Nir",
                    "text": "<span class=\"comment-copy\">Using <code>Shift-F5</code> I was able to load the signatures of <code>vc32rtf</code> and now this code is recognized as C runtime library. Thanks a lot!</span>",
                    "time": null
                }
            ]
        }
    ]
}