{
    "title": "Intercepting packets from Electron App to keyboard in Linux",
    "link": "https://reverseengineering.stackexchange.com/questions/25153/intercepting-packets-from-electron-app-to-keyboard-in-linux",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a USB keyboard which has an Electron app to set the macros on the keyboard. I unpacked the <code>app.asar</code> file, and the JS files seem to indicate that it is a ReactJS app, and is a minified production build, and obfuscated too much to reverse engineer.</p>\n<p>Another way to approach the problem seemed to be to use USB sniffer. I chose WireShark for the job. I wanted to capture all the data packets sent from the app to the keyboard, and hoped to reverse engineer that. The problem is, I can't find a way to capture the raw USB stream. I tried using WireShark to monitor <code>usbmon0</code>, but there is too much metadata, and separating the raw data from the protocol metadata seems to be a daunting task.</p>\n<p>I do not have a hardware USB sniffer or a JTAG debugger. Is there a simple way to capture all the raw data going from the app to the keyboard?</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "185",
    "tags": [
        "javascript",
        "usb",
        "sniffing"
    ],
    "user": "Sabyasachi Mukherjee",
    "time": "May 29, 2020 at 16:32",
    "comments": [
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\">Wireshark has built-in filter. Why don't you use him? Check which method it uses to send/read data and apply correct filter like <code>usb.transfer_type == 0x01</code></span>",
            "time": null
        },
        {
            "user": "Sabyasachi Mukherjee",
            "text": "<span class=\"comment-copy\">@morsisko unfortunately, all the transfer type is  0x01. However, this is an example of a packet:      <code>0000   c0 75 90 00 22 91 ff ff 53 01 84 06 03 00 2d 3c</code> <code>0010   4b 71 d1 5e 00 00 00 00 7c 67 0d 00 8d ff ff ff</code> <code>0020   40 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00</code> <code>0030   08 00 00 00 00 00 00 00 04 02 00 00 00 00 00 00</code>  Unfortunately, I can't make heads or tails of this packet.</span>",
            "time": null
        },
        {
            "user": "multithr3at3d",
            "text": "<span class=\"comment-copy\">Was there a driver installed?</span>",
            "time": null
        },
        {
            "user": "Sabyasachi Mukherjee",
            "text": "<span class=\"comment-copy\">@multithr3at3d no driver. Like I said, this is a keyboard on Linux. There was no driver installed.</span>",
            "time": null
        }
    ],
    "answers_data": []
}