{
    "title": "How do I use vi keybindings at the command line in Radare2?",
    "link": "https://reverseengineering.stackexchange.com/questions/25165/how-do-i-use-vi-keybindings-at-the-command-line-in-radare2",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The Radare2 command line (I believe it's called \"interactive mode\"?) allows bringing back history and editing it with the arrow keys. However, I prefer to use vi/vim keybindings for this. How do I configure this?</p>\n<p>I do have a <code>$HOME/.inputrc</code> file which contains <code>set editing-mode vi</code>, and this works for many programs (presumably all that use GNU Readline or a compatible library).</p>\n<p>Alternatively, is there an option available to build Radare2 with Readline?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "304",
    "tags": [
        "radare2"
    ],
    "user": "cjs",
    "time": "May 30, 2020 at 11:36",
    "comments": [
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">try e?? and grep both vi and tailsub like e??-vi  or e??-tailsub</span>",
            "time": null
        },
        {
            "user": "cjs",
            "text": "<span class=\"comment-copy\">@blabb I think you mean <code>e??~vi</code>, with a tilde instead of a hyphen, right?</span>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">yeah tilde not hyphen blame it on android keyboard</span>",
            "time": null
        },
        {
            "user": "Orwellophile",
            "text": "<span class=\"comment-copy\">What what what?  Where's the question: \"How do I use vim keybindings in IDA\".  Totally jealous rn.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can <code>e scr.prompt.vi = true</code> to enable a limited form of vi key bindings for command line editing. However, this is <em>very</em> limited; it's even missing basic movement commands such as <kbd>f</kbd> and <kbd>t</kbd>, and some commands such as <kbd>cw</kbd> do not appear to work properly. Searching with vi keybindings is unavailable; you must still use the Emacs <kbd>Ctrl-R</kbd> syntax to search backwards in your history. And a special warning: <kbd>Enter</kbd> in command mode will do nothing; you must enter insert mode and press <kbd>Enter</kbd> to enter the command you've just brought up or edited.</p>\n<p>(I found the setting by searching the configuration variables using <code>e scr. ~vi</code>; thanks to @blabb for mentioning this to me.)</p>\n<p>Radare2 uses its own command line editing code, in <code>libr/cons/dietline.c</code>.</p>\n</div>",
            "votes": "0",
            "user": "cjs",
            "time": "May 30, 2020 at 11:49",
            "is_accepted": true,
            "comments": []
        }
    ]
}