{
    "title": "Results of radare2 are not correct",
    "link": "https://reverseengineering.stackexchange.com/questions/25302/results-of-radare2-are-not-correct",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am using radare2 to analyze libpng_amd64.so.1.6.34, commands are as follows:</p>\n<pre><code>r2 = r2pipe.open(binary_file)\nr2.cmd('aaa')\nfuncs = r2.cmdj('aflj')\n</code></pre>\n<p>len(funcs) is 461, but the number of functions got by IDA is 526, besides the numbers of strings, imports, exports... are also different. \nI checked the result of radare2 and found some issuses, for example, the function <code>png_write_row</code> is followed by <code>png_write_rows</code>. Radare2 can not identity the second function <code>png_write_rows</code> and consider all code of those two functions to <code>png_write_row</code>. IDA works correctly.</p>\n<p>Why they are different? and Why radare2 can not identity functions correctly? how can I use it to get correct results?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "107",
    "tags": [
        "ida",
        "disassembly",
        "radare2"
    ],
    "user": "xiaoyao Don",
    "time": "Jun 15, 2020 at 11:09",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It might be due to different algorithms used for analysis or different options set for those. <code>r2</code> (as well as <code>IDA</code> and <code>Ghidra</code>) has multiple options that can influence how the code is analyzed and how the functions (and other elements) are being recognized.</p>\n<p>In this case, <code>png_write_rows</code>, as far as I can see, this function is not called anywhere in the lib and also doesn't have standard function prologue so it might be for the reason that <code>r2</code> doesn't recognize it and mark correctly as a function.</p>\n<p>How to fix? You can always modify the final analysis and define a function where the flag for <code>png_write_rows</code> is. You can do that in Visual mode by typing 'df' (define function).</p>\n<p>Anyway, I would open an <a href=\"https://github.com/radareorg/radare2/issues\" rel=\"nofollow noreferrer\">r2 issue</a> to get some more info if this is a case of correct <code>analysis flags</code> (check <code>e~anal</code>) or why for some other reason <code>r2</code> doesn't recognize correctly some elements in this lib.</p>\n</div>",
            "votes": "0",
            "user": "Paweł Łukasik",
            "time": "Jun 16, 2020 at 13:01",
            "is_accepted": true,
            "comments": []
        }
    ]
}