{
    "title": "Getting android app from device for reversing - what if there are multiple apks?",
    "link": "https://reverseengineering.stackexchange.com/questions/25461/getting-android-app-from-device-for-reversing-what-if-there-are-multiple-apks",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>For analyzing and reversing android apps, where the target app is installed on an android phone, usually there is a <code>base.apk</code> file on the device, and there are various ways to find this apk file on the device and <code>adb pull</code> it off the device.</p>\n<p>For example, on <a href=\"https://stackoverflow.com/questions/4032960/how-do-i-get-an-apk-file-from-an-android-device\">stackoverflow</a>, the answer by yojimbo with 1500+ upvotes, gives the following 3 steps:</p>\n<ol>\n<li>Determine the package name of the app, e.g. \"com.example.someapp\". Using <code>adb shell pm list packages</code>.</li>\n<li>Get the full path name of the APK file for the desired package. Using <code>adb shell pm path com.example.someapp</code></li>\n<li>Using the full path name from Step 2, pull the APK file from the Android device to the development box. Using <code>adb pull /data/app/com.example.someapp-2.apk path/to/desired/destination</code></li>\n</ol>\n<p>Sounds simple enough, and it has been so far on many apps. Then, today, I came across an app where step 2 returned not 1 but 3 apk files:</p>\n<pre><code>adb shell pm path the.app.package\npackage:/data/app/the.app.package-che0LFSLF9su1gFiz9cVbw==/base.apk\npackage:/data/app/the.app.package-che0LFSLF9su1gFiz9cVbw==/split_config.arm64_v8a.apk\npackage:/data/app/the.app.package-che0LFSLF9su1gFiz9cVbw==/split_config.xxxhdpi.apk\n</code></pre>\n<p>where I have replaced the actual package name with <code>the.app.package</code>. I'm guessing that there are parts of the code that are specific for arm64_v8a and/or xxxhdpi displays, and these are separated out into the split_config apk files? How would one begin in analyzing such apps where there's not just a base.apk but some of these additional apk files as well?</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "382",
    "tags": [
        "binary-analysis",
        "android"
    ],
    "user": "auspicious99",
    "time": "Jul 9, 2020 at 4:46",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">Split apk bundles are very common for large apps (see also <a href=\"https://developer.android.com/platform/technology/app-bundle\" rel=\"nofollow noreferrer\">Android App bundles</a>). In the end you need all APK files to to get the full app. Some apk files usually don't contain code like the hdpi apk file. See also APK download portals like ApkPure.com, they provide split apps as \"APKX\" (ZIP of APK files) files like for example Google Maps: <a href=\"https://apkpure.com/maps-navigate-explore/com.google.android.apps.maps\" rel=\"nofollow noreferrer\">apkpure.com/maps-navigate-explore/com.google.android.apps.maps</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You asked how you should begin; the first step is likely to determine what is in each APK and if it is relevant to your goals. Simply extract them all and poke around a bit.</p>\n<p>Like Robert's comment says, <a href=\"https://developer.android.com/platform/technology/app-bundle\" rel=\"nofollow noreferrer\">Android App Bundles</a> are a common format, and serve to modularize the app by shipping only the components needed for a particular device. So in this case, it appears the 3 APKs likely contain the base application, native libraries for ARMv8, and corresponding assets/resources for a HDPI device.</p>\n<p>I think if you looked at each APK, you may quickly realize which pieces are or are not relevant to you, depending what you are particularly interested in.</p>\n</div>",
            "votes": "1",
            "user": "multithr3at3d",
            "time": "Jul 10, 2020 at 14:10",
            "is_accepted": false,
            "comments": [
                {
                    "user": "auspicious99",
                    "text": "<span class=\"comment-copy\">Thanks for your answer. Is there a one-to-one correlation between having split apks and building/packaging the app as an android app bundle?</span>",
                    "time": null
                },
                {
                    "user": "multithr3at3d",
                    "text": "<span class=\"comment-copy\">If I get what you are asking, then I think the answer is that they are the same thing.</span>",
                    "time": null
                }
            ]
        }
    ]
}