{
    "title": "JTAG TCK on Intel X Scale (ArmV5) PXA270",
    "link": "https://reverseengineering.stackexchange.com/questions/25533/jtag-tck-on-intel-x-scale-armv5-pxa270",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is TCK on JTAG the same speed as CPU clock on a Intel X Scale (ArmV5) PXA270?</p>\n<p>I'm probing signals on pads around the CPU and got a waveform like:</p>\n<p><a href=\"https://i.sstatic.net/U3CL6.png\" rel=\"nofollow noreferrer\"><img alt=\"saleae logic analyzer on PXA270\" src=\"https://i.sstatic.net/U3CL6.png\"/></a></p>\n<p>But I don't know whether any of this data is JTAG, or just writing to memory or something else. Any idea what this data is?</p>\n<p>I think if I can find TCK, TDO/TDI should be somewhere near the same set of pads on the PCB?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "112",
    "tags": [
        "arm",
        "jtag"
    ],
    "user": "batflaps",
    "time": "Jul 22, 2020 at 22:10",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>No, TCK doesn’t have to match the CPU clock. In fact its usual speed is in kilohertz, not megahertz. However, you likely won’t see it in the oscilloscope or logic analyzer because it is driven by the JTAG probe and not the CPU. Discovering the JTAG pins requires active probing using something like JTAGulator, you are unlikely to find it via passive observation.</p>\n</div>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Aug 2, 2020 at 14:46",
            "is_accepted": false,
            "comments": [
                {
                    "user": "batflaps",
                    "text": "<span class=\"comment-copy\">I've been trying to determine where there may be data signals with the logic analyzer, then using jtagulator to try to read them, since I can't see under the BGA's on the board. I'm trying other chips now where I can reach pins where the datasheet shows JTAG outputs and maybe find the rest of the chain. Is there any better way?</span>",
                    "time": null
                }
            ]
        }
    ]
}