{
    "title": "x64dbg execute till next call OR return",
    "link": "https://reverseengineering.stackexchange.com/questions/25535/x64dbg-execute-till-next-call-or-return",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am using x64dbg and I want to know if there's any way to run the code till next Call statement?</p>\n<p>I know there is an \"Execute till return\" option,</p>\n<p>but I want to execute till next call statement or next CMP or any other statements.</p>\n<p>Thank you.</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "2k",
    "tags": [
        "debugging",
        "ollydbg",
        "debuggers",
        "x64dbg"
    ],
    "user": "w4po",
    "time": "Jul 23, 2020 at 4:48",
    "comments": [
        {
            "user": "w4po",
            "text": "<span class=\"comment-copy\">Okay, So I've found a way to Execute till Call,  Open \"Trace Over\" (CTRL+ALT+F8) and write this break condition:   dis.iscall(EIP)  What that does is checking if the current statement is a CALL, and if that's true it will break, other wise the code will keep executing.</span>",
            "time": null
        },
        {
            "user": "w4po",
            "text": "<span class=\"comment-copy\">But Is there a way to bind this to a hotkey or something, or make the trace over remember the condition instead of me setting this condition each click?</span>",
            "time": null
        },
        {
            "user": "mrexodia",
            "text": "<span class=\"comment-copy\">The condition is saved in the edit box, just press arrow up. There is also a way to bind a command to a hotkey. TraceOverConditional “dis.iscall(eip)” should work</span>",
            "time": null
        },
        {
            "user": "w4po",
            "text": "<span class=\"comment-copy\">@mrexodia Developer of x64dbg is here :O Thank you so much for the great debugger and awesome support &lt;3  Please write this in an answer instead of comment so I can mark it &lt;3 BTW I can't figure out how to bind TraceOverConditional into a hotkey, I can use it in the command editbox in the bottom like: \"TraceOverConditional dis.iscall(EIP) || dis.isret(EIP)\" which is a lot better. Thanks so much. &lt;3</span>",
            "time": null
        }
    ],
    "answers_data": []
}