{
    "title": "\"unknown publisher\" after adding new PE section",
    "link": "https://reverseengineering.stackexchange.com/questions/25673/unknown-publisher-after-adding-new-pe-section",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm starting to learn about reverse engineering and I'm currently encountering a problem with a game I'm trying to patch. I needed more space to insert instructions in my program so I followed the method described here: <a href=\"https://stackoverflow.com/questions/35685589/how-do-i-make-space-for-my-code-cave-in-a-windows-pe-32bit-executable\">https://stackoverflow.com/questions/35685589/how-do-i-make-space-for-my-code-cave-in-a-windows-pe-32bit-executable</a> and added a new section where I could put my new instructions. Then when I run the program, the instructions are properly executed, no crash happening.</p>\n<p>My issue is that when I'm launching the game, I get a popup asking if I want to \"allow this app from an unknown publisher to make changes to your device\", which is annoying. If I display the \"Details\" tab in the properties of the file, most of the information (such as File Description, File version...) are missing when they were there before the patch. Is it an expected consequence of adding a new section at the end of the executable? It looks like those information are inside the .rsrc section.\nAnd is there something I can do to fix it so I don't get the popup?</p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "136",
    "tags": [
        "pe",
        "section"
    ],
    "user": "An29",
    "time": "Aug 14, 2020 at 17:44",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>By adding an additional section you have broken the <a href=\"https://docs.microsoft.com/en-us/windows-hardware/drivers/install/authenticode\" rel=\"nofollow noreferrer\">Authenticode signature</a>.</p>\n<p>There is a great primer about how signatures work and are validated on <a href=\"https://blog.trailofbits.com/2020/05/27/verifying-windows-binaries-without-windows/\" rel=\"nofollow noreferrer\">this blog</a>, which says:</p>\n<blockquote>\n<p>Integrity: Each Authenticode signature includes a cryptographic hash of the signed binary. This hash is compared against the binary’s in-memory representation at load time, preventing malicious modifications.</p>\n</blockquote>\n<p>Technically it prevents <em>all</em> modifications, not just malicious ones. Crucially, the Authenticode signature covers all data except (<em>also see Note 1</em>):</p>\n<ul>\n<li>The PE checksum.</li>\n<li>The certificate data directory entry.</li>\n<li>The certificate table (and signatures).</li>\n</ul>\n<p><a href=\"https://blog.reversinglabs.com/blog/breaking-the-windows-authenticode-security-model\" rel=\"nofollow noreferrer\">This article</a> discusses various ways of potentially breaking the Authenticode model (but none are likely to help what you are trying to do).</p>\n<p>Authenticode is designed to stop what you are attempting: modifying the executable without providing a warning. Other runtime code injection techniques are not prevented (except perhaps in device drivers), so you could potentially modify the code in a different way.</p>\n<hr/>\n<p>Note 1 - The PE \"overlay\" was historically not covered, but see Microsoft's <a href=\"https://msrc-blog.microsoft.com/2013/12/10/ms13-098-update-to-enhance-the-security-of-authenticode/\" rel=\"nofollow noreferrer\">details about MS13-098</a> and <a href=\"https://docs.microsoft.com/en-us/security-updates/SecurityAdvisories/2014/2915720?redirectedfrom=MSDN\" rel=\"nofollow noreferrer\">security advisory 2915720</a>.</p>\n</div>",
            "votes": "2",
            "user": "David",
            "time": "Aug 15, 2020 at 8:25",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If changing the signature won't affect the game (i.e. no part of the game checks the publisher, which is rare) you can simply create your own certificate, install it and use it to resign the application after the changes. Alternatively, you can remove it.</p>\n<p>Authenticode signature is the cryptographic way to prove that the binaries haven't been tampered with after publishing. If you sign the application again, you become the publisher.</p>\n<p>You can start from <a href=\"https://docs.microsoft.com/en-us/windows-hardware/drivers/install/authenticode\" rel=\"nofollow noreferrer\">MSDN</a>.</p>\n</div>",
            "votes": "0",
            "user": "Yennefer",
            "time": "Aug 15, 2020 at 8:04",
            "is_accepted": false,
            "comments": []
        }
    ]
}