{
    "title": "Why does PE ImageBase address change in memory?",
    "link": "https://reverseengineering.stackexchange.com/questions/25686/why-does-pe-imagebase-address-change-in-memory",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm reversing a malicious 32-bit x86 Windows executable. Statically reviewing PE headers in Ghidra, I see that <code>ImageBase</code> is set to <code>0x400000</code> as expected. However, when the binary is loaded into memory, the initial RVA does not match the <code>ImageBase</code> defined in the file. For example, I have seen the in-memory base address set to <code>0x4B0000</code> and <code>0x900000</code>. This behavior occurs on a clean VM, and when debugging with Immunity and x32dbg as well as IDA Free.</p>\n<p>My understanding is that the Windows loader reads <code>ImageBase</code> and uses that offset to begin mapping sections into virtual address space. Because system code handles loading, and my system is clean upon first execution, my assumption is that the unusual <code>ImageBase</code> is a symptom of a loader nuance rather than tampering. I've never encountered this scenario and would appreciate any insights.</p>\n<p>MD5:  <code>1f63d04ee95ea041f2f6b1e818d94a7c</code></p>\n<p>SHA1: <code>823ad6abb05f2393c44cf4b7f1d00e32ac04d1d1</code></p>\n<hr/>\n<p><code>ImageBase</code> set to <code>0x400000</code> when viewing PE headers in Ghidra:</p>\n<p><a href=\"https://i.sstatic.net/iLnaq.png\" rel=\"noreferrer\"><img alt=\"ImageBase set to 0x400000\" src=\"https://i.sstatic.net/iLnaq.png\"/></a></p>\n<hr/>\n<p><code>ImageBase</code> in memory-mapped PE header (<code>0x4B0000</code>) does not match <code>ImageBase</code> set in static file:</p>\n<p><a href=\"https://i.sstatic.net/vnAsT.png\" rel=\"noreferrer\"><img alt=\"PE header dump\" src=\"https://i.sstatic.net/vnAsT.png\"/></a></p>\n<hr/>\n<p>PE sections mapped into memory with <code>ImageBase</code> at <code>0x4B0000</code></p>\n<p><a href=\"https://i.sstatic.net/YwnNp.png\" rel=\"noreferrer\"><img alt=\"PE sections mapped into memory\" src=\"https://i.sstatic.net/YwnNp.png\"/></a></p>\n</div>",
    "votes": "6",
    "answers": 1,
    "views": "2k",
    "tags": [
        "windows",
        "malware",
        "anti-debugging",
        "pe32",
        "virtual-memory"
    ],
    "user": "j5bb",
    "time": "Aug 17, 2020 at 2:49",
    "comments": [
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">if your system is aslr enabled (any is &gt; xp) then this is a security feature  and windows loader will randomize the address space layout  on each run</span>",
            "time": null
        },
        {
            "user": "j5bb",
            "text": "<span class=\"comment-copy\">Thanks for bringing ASLR to my attention @blabb. I'll keep that feature in mind going forward. After disabling ASLR on a fresh Windows 10 VM and restarting, I continued to see a non-<code>0x400000</code> <code>ImageBase</code> when loading the binary into various debuggers. I note this here only to rule out ASLR as the cause of the RVA randomization in this particular case.</span>",
            "time": null
        },
        {
            "user": "BoRRis",
            "text": "<span class=\"comment-copy\">ASLR is for the imported DLLs generally. This is the preferred base address. However, if this memory location is occupied by other image, the loader has the right to place it at other locations provided it gets enough continous space in memory.</span>",
            "time": null
        },
        {
            "user": "Utkonos",
            "text": "<span class=\"comment-copy\">@j5bb It depends on which version of Windows 10 you are using with regards to ASLR. The last version of 10 that can disable ASLR is build 1703. In all builds later than that one, the switches that say they disable ASLR have no effect.  Also, in each disassembler: Ghidra, IDA, Binary Ninja etc, there is a setting to rebase the database to match the base address in memory. This can alleviate some of the pain.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is just a preferred address. Windows can load the binary at almost any address and rebase it to this new location.</p>\n<blockquote>\n<p>ImageBase: The preferred address of the first byte of image when loaded into memory; must be a multiple of 64 K. The default for DLLs is 0x10000000. The default for Windows CE EXEs is 0x00010000. The default for Windows NT, Windows 2000, Windows XP, Windows 95, Windows 98, and Windows Me is 0x00400000.</p>\n</blockquote>\n<p>Source: <a href=\"https://docs.microsoft.com/en-us/windows/win32/debug/pe-format\" rel=\"noreferrer\">MSDN</a></p>\n</div>",
            "votes": "9",
            "user": "Paweł Łukasik",
            "time": "Aug 17, 2020 at 5:44",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">... provided relocation information exists 😁</span>",
                    "time": null
                }
            ]
        }
    ]
}