{
    "title": "What should I learn in order to reverse elf64 binary files",
    "link": "https://reverseengineering.stackexchange.com/questions/25707/what-should-i-learn-in-order-to-reverse-elf64-binary-files",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm a little confused. I am using a Linux based system (Ubuntu), 64-bit. and I want to start and reverse <code>64elf</code> binary files, but there is a lot of things I want to know before. just to be clear, If I have <code>64bit</code> computer, I need to learn <code>x64</code> assembly? What's the best assembler for my platform (I'm currently using <code>nasm</code>)?</p>\n<p>The reason I'm asking that is because I don't want to learn assembly in the wrong way, which will not help me.</p>\n<hr/>\n<p>By the way, is learning <a href=\"https://www.youtube.com/playlist?list=PLetF-YjXm-sCH6FrTz4AQhfH6INDQvQSn\" rel=\"nofollow noreferrer\"><code>this</code></a> tutorial is good for my platform?</p>\n</div>",
    "votes": "0",
    "answers": 2,
    "views": "462",
    "tags": [
        "assembly",
        "binary-analysis"
    ],
    "user": "Earn reputation and badges",
    "time": "Aug 19, 2020 at 19:51",
    "comments": [
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\">If you want to learn to program in x86-64 assembly, probably the reverse engineering forum isn't best place to ask. If by \"x64 assembly\" you mean the 64bit version of x86, no you don't have to learn \"x64\" assembly. You can run 32 bit version of x86 assembly on 64 bit processor just fine in most cases. Also there are emulators for other architectures like MIPS or ARM so you don't need to stick to x86.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>to be honest, there's no specific way to lean reverse engineering but there's some basics like(programming, computer architecture etc..), so you need to learn all fundamentals of computer science and engineering, and then you can play some <a href=\"https://ctftime.org/\" rel=\"nofollow noreferrer\">ctf's</a>/<a href=\"https://crackmes.one/\" rel=\"nofollow noreferrer\">crackme</a> challenges.</p>\n<p><strong>NOTES:</strong></p>\n<ul>\n<li>most of reverse engineering tutorials/workshops won't teach you reverse engineering, they will teach you only how to use tools like (Windbg, ghidra, etc..)</li>\n<li>if you want to learn how reverse engineer software try to build one.</li>\n</ul>\n<p><strong>Books:</strong></p>\n<ul>\n<li><a href=\"https://www.amazon.fr/Practical-Binary-Analysis-Instrumentation-Disassembly/dp/1593279124\" rel=\"nofollow noreferrer\">Practical Binary Analysis: Build Your Own Linux Tools for Binary Instrumentation, Analysis, and Disassembly</a></li>\n<li><a href=\"https://beginners.re/main.html\" rel=\"nofollow noreferrer\">Reverse Engineering for Beginners</a></li>\n<li><a href=\"https://rads.stackoverflow.com/amzn/click/com/0764574817\" rel=\"nofollow noreferrer\">Reversing: Secrets of Reverse Engineering</a></li>\n</ul>\n</div>",
            "votes": "1",
            "user": "Collin Belmo",
            "time": "Jan 17, 2021 at 13:02",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Why do you need writing in assembly? In order to reverse engineer the microcode approach is a lot easier. The Ghidra tool supports outputting pcode for all the instructions, then you just read that along with decompiler output. Pcode for calling conventions, return addresses and such low level stuff; decompiler for anything else like further analysis of functions etc. Also pcode shows you what each assembly instruction means so you can reuse semantic information anywhere else if documentation is not clear for you or whatever you use for learning. As for binaries you usually don't choose in what language they're written (x86/MIPS/PowerPC/ARM), you don't actually need it nor this matters anything as pcode or what your RE tool uses is versatile and depends only on this tool used.</p>\n</div>",
            "votes": "0",
            "user": "Danil",
            "time": "Aug 19, 2020 at 21:31",
            "is_accepted": false,
            "comments": []
        }
    ]
}