{
    "title": "Trying to edit the source code of AOC monitor",
    "link": "https://reverseengineering.stackexchange.com/questions/25718/trying-to-edit-the-source-code-of-aoc-monitor",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So long story short the AOC monitor comes with a G-Menu gui that lets you customize different monitor features. One specific one I am interested in is the \"Dial Point\" setting. Where it overlays a red circle cross hair over the middle of the screen. I am trying to figure out how to reverse engineer through the code to find the img or code variables for the Dial Point cross hair so I can remove this obtrusive red circle they put over it. Ive tried opening the .dll files in visual studio then I tried dotPeek to see if I could use that I feel like im getting closer to a solution but as of right now im kinda worried im going in circles and dont want to waste too much time on this. Ive never really reverse engineered the code of a monitor so I dont really know where to start. Im a CS student so I know how to code a fair bit at this point but if I cant find the source code of what im looking for then I cant edit it. Any help is appreciated.</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "771",
    "tags": [
        "hardware",
        "game-hacking"
    ],
    "user": "Mike4082",
    "time": "Aug 21, 2020 at 18:41",
    "comments": [
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\">What do you mean by source code of monitor? Are you trying to reverse enigneer the firmware of microcontroller inside your monitor? Also this doesn't have to be image. You can draw straight lines and circles without using any sort of images.</span>",
            "time": null
        },
        {
            "user": "Mike4082",
            "text": "<span class=\"comment-copy\">It is a desktop application called G-menu <a href=\"https://us.aoc.com/en/gaming/news/aoc-releases-g-menu-drivers-for-select-models\" rel=\"nofollow noreferrer\">link</a> here is a link if you want to take a look. Im almost positive when I purchased it I had to go to the website to download it since I dont see how a monitor would install a program to a pc on its own. Basically im trying to see if there is a way into their software to swap out the design they have for the cross hair as its kinda overkill but I strongly prefer red over white which most games use for cross hairs its just easier on my eyes.</span>",
            "time": null
        },
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\">Unfortunately I can't access the application feature without the AOC monitor. It also depends if the crosshair is drawn by your operating system or the monitor firmware itself.</span>",
            "time": null
        },
        {
            "user": "Mike4082",
            "text": "<span class=\"comment-copy\">Is there any direction you can give me to look on your behalf? I dont mind having to figure it mostly out myself im just not exactly sure where to start or a checklist to go down.</span>",
            "time": null
        },
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\">I would firstly check if the crosshair is drawn by monitor or the operating system, for example if you lock your screen in MS Windows is the crosshair still present?</span>",
            "time": null
        }
    ],
    "answers_data": []
}