{
    "title": "What's the way to find a function on a unity game and how I call it after I find?",
    "link": "https://reverseengineering.stackexchange.com/questions/25787/whats-the-way-to-find-a-function-on-a-unity-game-and-how-i-call-it-after-i-find",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm a newbye, so sorry for the basic questions, before anyone downvote the question.</p>\n<p>I'm Learning reverse engineering, I've already learned assembly for mips on the computer science underdegree and I know the basic about computer architeture.</p>\n<p>I'm trying to make a macro bot for doing simple tasks on a unity game called pokemon trading card game online. It seens it ways built on unity 2018.4.11.</p>\n<p>I know I have to find the functions that call what I want, but don't know how to do it and what to do after this. The tutorials are very confusing on this area.</p>\n<p>So being objective, can anyone help me what I have to search and what I have to do with what I found, like, if I'm trying to find the function that calls the button to start a play, how can I call it after I found it?</p>\n<p>Thank you very much?</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "149",
    "tags": [
        "function-hooking"
    ],
    "user": "Luiz",
    "time": "Aug 31, 2020 at 23:10",
    "comments": [
        {
            "user": "Luiz",
            "text": "<span class=\"comment-copy\">tried using olly-dbg, but the process dont show on the attach panel</span>",
            "time": null
        },
        {
            "user": "Luiz",
            "text": "<span class=\"comment-copy\">on cheat engine dissect mono, I only found the unity editor classes</span>",
            "time": null
        },
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\">If the game uses C# as some of unity games (without il2cpp) you can try to use dnSpy</span>",
            "time": null
        }
    ],
    "answers_data": []
}