{
    "title": "How to find the file address of AddressOfEntryPoint",
    "link": "https://reverseengineering.stackexchange.com/questions/25872/how-to-find-the-file-address-of-addressofentrypoint",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a binary file and in the optional header I have the address of the entry point <code>0x00011046</code> but when I put the file inside HEX editor this address doesn't exist, more than that <code>0x000097f0</code>.</p>\n<p>I suppose that this is kind of RVA but I don't know how can I find the real address.<br/>\n<a href=\"https://i.sstatic.net/dJoez.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/dJoez.png\"/></a></p>\n<p><strong>EDIT:</strong><br/>\nI have the section headers:<br/>\n<a href=\"https://i.sstatic.net/oGnuZ.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/oGnuZ.png\"/></a></p>\n<p>I am not sure but the <code>.textbss</code> is <code>0x10000</code>, I tried to do <code>0x11000 - 0x11046 = 0x1046</code> and search for this in the file but it doesn't look like the entry point.</p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "5k",
    "tags": [
        "binary-analysis",
        "pe",
        "entry-point"
    ],
    "user": "E235",
    "time": "Sep 13, 2020 at 9:19",
    "comments": [
        {
            "user": "josh",
            "text": "<span class=\"comment-copy\">Why has this question been downvoted? Even if the question has not been asked precisely, for me it was clear what the OP wanted to know. Upticked.</span>",
            "time": null
        },
        {
            "user": "Tom Charles Zhang",
            "text": "<span class=\"comment-copy\">Out of curiosity - what's the binary inspector program you are using? Looks handy.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In PE file, <code>AddressOfEntryPoint</code> is a relative address to the image base, so you will have <code>0x11046 - 0x10000 = 0x1046</code> value in Optional Header. For more information, see <a href=\"https://www.aldeid.com/wiki/PE-Portable-executable\" rel=\"nofollow noreferrer\">PE format</a> and search for \"AddressOfEntryPoint\".</p>\n<p>The reason you see <code>0x00011046</code> being displayed as the entry point (in CFF Explorer I suppose) is that when the file is loaded into memory, this will be the EP address in a process virtual memory - not the offset within PE file itself. The same will hold if you load the file into IDA or radare2, for example - EP will be displayed at <code>0x00011046</code>.</p>\n<p><strong>Note:</strong> another quick way to find the place where EP value is stored, other than searching for <code>0x1046</code> in hex editor is just reading the <em>Offset</em> column value displayed - in this case it equals <code>0x120</code>.</p>\n<p>In general, you would have to read the value at offset <code>0x3C</code> (<code>IMAGE_DOS_HEADER.e_lfanew</code>) and add <code>0x28</code> to it (<code>AddressOfEntryPoint</code> offset relative to PE header).</p>\n</div>",
            "votes": "1",
            "user": "bart1e",
            "time": "Sep 13, 2020 at 9:47",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>From your question it is not quite clear what you want to achieve: I assume you need the address in memory where you can find the \"Address of Entry Point\", as well as the file offset where the code at \"Address of Entry Point\" is stored.</p>\n<ol>\n<li>Let us look at your screenshots for the file offset of \"Address of Entry Point\"</li>\n</ol>\n<p>In your screenshot you find in the \"Meaning\" column that the \"AddressOfEntryPoint\" is contained somewhere in the <code>.text</code> section.</p>\n<p>In your screenshot of the section headers you find the start of the <code>.text</code> section at the \"Virtual Address\" <code>0x11000</code>. Likewise you find the start of the <code>.text</code> section in the file at the \"Raw Address\" of <code>0x400</code>. The difference is <code>0x11000 - 0x400 = 0x10C00</code>, meaning the hex value of the RVA is by <code>0x10C00</code> higher than the same position in the file.</p>\n<p>Now you have to subtract the value of <code>0x10C00</code> from the \"AddressOfEntryPoint\" to find the corresponding file offset. This should in your case result in\n<code>0x11046 - 0x10C00 = 0x446</code>. This should be the file offset where to find the code residing at \"AddressOfEntryPoint\". The value of \"AddressOfEntryPoint\" itself (<code>0x11046</code>) can be found at file offset (the \"Offset\" entry) <code>0x120</code>, as pointed out also by  @bart1e.</p>\n<ol start=\"2\">\n<li>RVA where to find e.g. in Ida the \"AddressOfEntryPoint</li>\n</ol>\n<p>Take the vaue of \"ImageBase\" and add to it the \"Address of entry point\" (as also pointed out by @bart1e), in your case:</p>\n<p><code>0x00400000 + 0x00011046 = 0x411046</code>.</p>\n<p>This address will e.g. Ida show you as \"start\" point after having loaded it. However if you are running the debugger, the situation changes as the \"ImageBase\" usually will be changed by the NT loader to some random number (called ASLR). You can find this randomized start address in several ways, e.g. by letting Ida run the binary and \"stop on process entry start\" (Debugger options..) and subtracting your \"Address of entry point\" from the start address shown by Ida.</p>\n<p><strong>Remark:</strong>\nFor investigation of a binary, it is often useful to avoid this ASLR. You can try to achieve this for instance in CFF Explorer by selecting in the \"Optional Header\" window the entry \"Dll Characteristics\" (a little down in the invisible part of your screenshot), click on \"Click here\", and then, in the opening dialog un-select the checkbox \"DLL can move\". The NT loader will now try to avoid ASLR and load the binary at the \"ImageStart\" address. However, in case of another module is to be loaded at tha same base address i.e. having an address collision, the NT loader will move it to somewhere else anyway.</p>\n</div>",
            "votes": "1",
            "user": "josh",
            "time": "Oct 13, 2020 at 13:41",
            "is_accepted": false,
            "comments": []
        }
    ]
}