{
    "title": "Strange memory allocation behaviour",
    "link": "https://reverseengineering.stackexchange.com/questions/25911/strange-memory-allocation-behaviour",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm currently working on a modding library for a particular game, and I have come across a part of the menu system that I can't figure out the purpose of.</p>\n<p>The expression in question is this:</p>\n<pre><code>unsigned num = ((n + 1) * 4) / 3 + 3;\n</code></pre>\n<p>The game then goes on to use the value to allocate space for menu item structures:</p>\n<pre><code>void *newItemStorage = allocate(num * 0x18);\n\n// 0x18 = sizeof(menu item structure)\n</code></pre>\n<p><code>n</code> is the number of menu item structures there are currently, and the code containing this maths is used to allocate space for more structures when there is not currently enough (the old array is copied into the new space with <code>memcpy</code>).</p>\n<p>From what I can tell, this system must be allocating more space than it needs so that fewer reallocations need to happen in the future. However, I don't see why this particular formula must be used to work out the space. The game stores <code>num</code> and only reallocates again when <code>num &lt; n + 1</code>.</p>\n<p>I actually graphed the formula when I was working out what it did, so <a href=\"https://www.desmos.com/calculator/k4pnfxo9wc\" rel=\"nofollow noreferrer\">here is that graph</a>. (I used <code>floor</code> to try to simulate integer division.) One of the parts I find most confusing is the fact that <code>num</code> is in groups of three:</p>\n<p>Starting at <code>n = 0</code> and increasing by 1 yields:\n<code>4, 5,  7, 8, 9,  11, 12, 13</code>.</p>\n<p>If this <em>is</em> some system for preallocating memory, why is it being done like this? If not, what is the system doing?</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "45",
    "tags": [
        "memory",
        "static-analysis"
    ],
    "user": "squ1dd13",
    "time": "Sep 16, 2020 at 16:36",
    "comments": [],
    "answers_data": []
}