{
    "title": "Recreating 2D aspects of Cantor.dust",
    "link": "https://reverseengineering.stackexchange.com/questions/2595/recreating-2d-aspects-of-cantor-dust",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to recreate some of the 2D capabilities that were demonstrated in cantor.dust, I was wondering if anyone knows how they translate a large file(executable) into a number of different images / a large image that shows different patterns based on the content at different locations of the file</p>\n<p><a href=\"http://www.reddit.com/r/ReverseEngineering/comments/1izity/cantordust_a_binary_visualization_tool/\" rel=\"nofollow noreferrer\">link to cantor.dust post</a></p>\n<p>currently I have created single 256x256 bitmaps based on hex dumps  from files which conform to the same patterns shown in the cantor.dust Derbycon presentation, but I am unsure how to make one large file into several bitmaps that show the pattern at different parts of the file, e.g. An executable that contains some ascii text would have portions that look like an executable and others that look like ascii text (via the patterns demonstrated in cantor.dust [2D])</p>\n<p><a href=\"https://i.sstatic.net/JnBCq.jpg\" rel=\"nofollow noreferrer\">ascii</a></p>\n<p>Any help would be appreciated</p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "1k",
    "tags": [
        "binary-analysis"
    ],
    "user": "user2601",
    "time": "Dec 3, 2013 at 8:34",
    "comments": [
        {
            "user": "ekse",
            "text": "<span class=\"comment-copy\">The best person to ask would probably be the author of cantor.dust as it seems you are asking for a new feature for the software. The author provided his email address in the reddit thread (<a class=\"__cf_email__\" data-cfemail=\"98fbf9f6ecf7eafcedebecd8faf9ececfdf4f4fdb6f7eaff\" href=\"/cdn-cgi/l/email-protection\">[email protected]</a>), did you try emailing him?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Three dimensional visualisation was recently added to <a href=\"http://binwalk.org/3d-data-visualizations/\" rel=\"nofollow noreferrer\">Binwalk</a>.</p>\n<blockquote>\n<p>My implementation is fairly rudamentary: every three bytes in a file is treated as an x, y, z coordinate for a data point in a 3D plane where each axis extends from 0 through 255. This means that if the file has data that contains a certain range of byte values (e.g., printable ASCII characters), those bytes will generate coordinates in the same general area of the 3D plot.</p>\n</blockquote>\n<p>This is how AVR32 code looks like:</p>\n<p><img alt=\"Visualisation of AVR32 code\" src=\"https://i.sstatic.net/q5HPW.gif\"/></p>\n<p>To get this, use the <em>--3D</em> option:</p>\n<pre><code>$ binwalk --3D yourfile.exe\n</code></pre>\n</div>",
            "votes": "5",
            "user": "jvoisin",
            "time": "Dec 3, 2013 at 1:26",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">For an input consisting of random ASCII triplets I would expect <i>three</i> flat planes, not two. It seems this shows lots of pairs 2 characters occur, but no more than that?</span>",
                    "time": null
                },
                {
                    "user": "devttys0",
                    "text": "<span class=\"comment-copy\">For an input of random bytes, you get a random distribution of points inside a 3 dimensional cube. If your input consists of a random distribution of some restricted set of characters (say, only printable ASCII characters), then you'd have a smaller cube of points inside the larger 3D cube (see the red cube in the GIF above - that's ASCII data). The flat vertical and horizontal red &amp; yellow planes you see are executable code.</span>",
                    "time": null
                }
            ]
        }
    ]
}