{
    "title": "IDA/HexRays: how do I retrieve the memory address associated with a given line of decompiled code?",
    "link": "https://reverseengineering.stackexchange.com/questions/26030/ida-hexrays-how-do-i-retrieve-the-memory-address-associated-with-a-given-line-o",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to programmatically link decompiled code generated by HexRays with the disassembly code of a given binary by mapping memory addresses between the two. The mapping exists, as I can see view it through IDA on a case by case basis (see the line of decompiled code in green, associated with the memory address in gold, which lets me reference the disassembly. Clicking through different decompiled source lines links to different memory addresses/sets of disassembly lines). But I can't find any way to get at these associations via scripting (IDC, IDAPython, etc) or via the command line. This strikes me as strange, as I can't imagine that this functionality hasn't been sought out or used before.</p>\n<p>My end goal is to be able to read in a set of decompiled code line numbers, then return all the lines of disassembly which map to those decompiled code lines.</p>\n<p>Thanks!</p>\n<p><a href=\"https://i.sstatic.net/wcfur.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/wcfur.png\"/></a></p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "decompilation",
        "disassemblers",
        "hexrays"
    ],
    "user": "TFD",
    "time": "Oct 2, 2020 at 15:55",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In <code>hexrays.hpp</code>, <code>citem_t</code> is the base class for both <code>cinsn_t</code> (\"instructions\", such as <code>for</code> loops, <code>if</code> statements, etc.) and <code>cexpr_t</code> (\"expressions\", such as addition, memory dereference, function calls, etc.) <code>citem_t</code> has a field <code>ea_t ea;</code>. That field stores the address of the corresponding line in the assembly language (unless it's <code>BADADDR</code>, in which case, the decompiler machinery lost track of the address).</p>\n<p>To accomplish your goal specifically, you're going to want to get your hands on the <code>cinsn_t</code> objects on certain lines in the decompilation listing. Here are three separate ideas for how to accomplish this:</p>\n<ol>\n<li>Grab the function body directly out of the <code>cfunc_t</code> and process it yourself;</li>\n<li>Use a <code>ctree_visitor_t</code> object to visit all <code>cinsn_t</code> objects within the decompilation listing;</li>\n<li>Call <code>kernwin.hpp::read_selection</code> to get a selection of lines within the decompilation listing (there will be some work to do in mapping these back to positions within the decompiled function body).</li>\n</ol>\n</div>",
            "votes": "3",
            "user": "Rolf Rolles",
            "time": "Oct 4, 2020 at 19:21",
            "is_accepted": false,
            "comments": [
                {
                    "user": "TFD",
                    "text": "<span class=\"comment-copy\">Thanks a ton for your detailed help! I'll give this a shot tomorrow morning.</span>",
                    "time": null
                }
            ]
        }
    ]
}