{
    "title": "Why some functions in IDA can't be searched",
    "link": "https://reverseengineering.stackexchange.com/questions/26167/why-some-functions-in-ida-cant-be-searched",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I don't know why but I noticed, on some program I am reversing, that in a section named <code>.bss</code>, there functions and I can't find them through the regular search, why is that.</p>\n<p>For example, I wanted to search for <code>_mainScene</code> but it found me only one functioned named <code>newMainScene</code>:<br/>\n<a href=\"https://i.sstatic.net/jOPa3.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/jOPa3.png\"/></a></p>\n<p><strong>EDIT:</strong><br/>\nA friend show me that I can search with <code>Shift+4</code> in IDA for the names in <code>.bss</code>.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "299",
    "tags": [
        "ida",
        "functions"
    ],
    "user": "E235",
    "time": "Oct 25, 2020 at 9:04",
    "comments": [
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">dd? Is normally a pointer and not a function</span>",
            "time": null
        },
        {
            "user": "E235",
            "text": "<span class=\"comment-copy\">What is <code>dd</code> ? I know it only from WinDBG as a command. Or you meant <code>ds</code>, data segment? Is there a way to search in this?</span>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">dd? = uninitialized dword it is there in your screen shot see the address 0x44ddac and around they are all  a placeholder or a pointer  i dont under stand what you want to search</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You are not looking at functions that you can't reach, but at unassigned variables.</p>\n<p>As you said, you are looking at the .bss section. From Wikipedia, the .bss section is</p>\n<blockquote>\n<p>the portion of an object file, executable, or assembly language code that contains statically-allocated variables that are declared but have not been assigned a value yet.</p>\n</blockquote>\n<p>IDA is showing you this with the <code>dd</code> opcode. As @blabb point out, this is an <code>uninitialized dword</code>, which mean a dword that was not assigned yet. Exactly what is supposed to be in the .bss section !</p>\n<p>Theses variables don't have any hardcoded default values, so they are placed in this section of the binary, waiting to be populated at runtime with dynamic values.</p>\n<p>What you can do is to write down the address of the variable that you want to find more about, open up a debugger, let it run a bit (or you can break on a specific function if you know where this variable is being populated), and check the content of this variable by looking at the previously written memory address.</p>\n<p>You'll know what type of data is supposed to be inside this variable !</p>\n<p>Don't forget to deactivate the ASLR while running the binary (otherwise the address that you saw in IDA would not match naything), or if needed, to rebase your program in IDA.</p>\n</div>",
            "votes": "2",
            "user": "Guillaume",
            "time": "Oct 24, 2020 at 17:37",
            "is_accepted": true,
            "comments": []
        }
    ]
}