{
    "title": "IDA stack depth differences when branching",
    "link": "https://reverseengineering.stackexchange.com/questions/26304/ida-stack-depth-differences-when-branching",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm decompiling some Direct3D code that makes a lot of indirect calls to __stdcall functions.</p>\n<p>For example:</p>\n<pre><code>call dword ptr [edx+0xC8h]\n</code></pre>\n<p>which is really:</p>\n<pre><code>pD3DDevice-&gt;SetRenderState();\n</code></pre>\n<p>IDA doesn't correctly guess the stack pointer change of these calls in every case, so I have to go through and Alt+K the correct SP value manually.</p>\n<p>But after doing this I start running into a problem where one side of a branch will have the wrong SP value</p>\n<p><a href=\"https://i.sstatic.net/x9AkJ.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/x9AkJ.png\"/></a></p>\n<p>I can Alt-K the first instruction with the erroneous SP value but this only takes effect on the next instruction.</p>\n<p><strong>Edit:</strong></p>\n<p><a href=\"https://i.sstatic.net/uj67J.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/uj67J.png\"/></a></p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "210",
    "tags": [
        "ida",
        "stack"
    ],
    "user": "quitegiddy",
    "time": "Apr 25, 2023 at 12:51",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">Can you show how it looks like in text mode (instead of graph)?</span>",
            "time": null
        },
        {
            "user": "quitegiddy",
            "text": "<span class=\"comment-copy\">@IgorSkochinsky Apologies for the extreme lateness of this reply (long story), but on the off-chance you're still willing to help, I've updated the OP with a text-mode screenshot which hopefully illustrates the problem.</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">the new screenshot doesn't include the code from the first one but some unrelated(?) function.</span>",
            "time": null
        },
        {
            "user": "quitegiddy",
            "text": "<span class=\"comment-copy\">@IgorSkochinsky Thanks for the response. I must have uploaded the wrong screenshot sorry about that. It's fixed it in the OP now. The right branch isn't out by quite as much as in the original screenshot for some reason. Taken from a fresh db with just the stack pointer corrected on the indirect calls and <code>pD3DDevice</code> named.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So, the problem is that you have two branches with different stack delta: E8 at 5018E4 (fall through from <code>jnz</code>) and F0 at 501c49 (destination of <code>jnz</code>). Normally they should be the same, however IDA failed to reconcile them, probably due to too many indirect calls in the function.</p>\n<p>One peculiarity of manual stack delta adjustments is that they apply <em>after</em> the instruction at which you're setting them. In our case, we need to make 501C49 have the delta of E8, however we can't do it on the instruction itself but need to go to the previous one <em>by address</em> and not the control flow, i.e. the <code>jmp</code> at 501C44. Since that address has SPD=E0, specifying delta of -8 should work.</p>\n<p>This is why such manipulations are best done in text view and not graph.</p>\n</div>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Jun 4, 2023 at 12:05",
            "is_accepted": true,
            "comments": [
                {
                    "user": "quitegiddy",
                    "text": "<span class=\"comment-copy\">Thanks Igor, that's exactly what I was looking for. I must have been under the misconception that Alt-K would change the next instruction in the control flow rather than the next instruction in memory, which really wouldn't make any sense. Thanks again!</span>",
                    "time": null
                }
            ]
        }
    ]
}