{
    "title": "Calling MessageBoxW x64 confused about pointer",
    "link": "https://reverseengineering.stackexchange.com/questions/26366/calling-messageboxw-x64-confused-about-pointer",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>OK, I am very new to x64dbg. I used to use OllyDbg a lot and I'm having some problems with this.\nI just made a customized version of MS-PAINT for practice by changing a few things like the default palette, etc.</p>\n<p>I want to add a MessageBoxW to the help button in the corner. I successfully located the method. In ollydbg, I could simply type push, push, push and then call MessageBoxW, but it doesn't work with this. Maybe it's not imported? But I searched for references and found a MessageBoxW, but it looks like this: call qword ptr ds:[0x00000000FF467880] and that ptr is automatically evaluated to MessageBoxW. However, when I copy that code myself it's not working. Why can't I simply type call MessageBoxW????</p>\n<p>I know this might seem amateurish, but I am doing this to try to learn how to use this debugger better. I hope you understand I don't have much experience. Thanks!</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "375",
    "tags": [
        "ollydbg",
        "x64dbg",
        "patching",
        "x86-64",
        "calling-conventions"
    ],
    "user": "Synaps3",
    "time": "Nov 24, 2020 at 22:40",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">\"However, when I copy that code myself it's not working\" and this not working has any manifestation? No crashes? Or anything? If you debug this, do you see this code being executed?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First make sure you are using correct calling convention, in 64-bit Windows most APIs expect parameters via registers not push.\nAn example of calling convention for 64-bit Windows:</p>\n<pre><code>lea r9d, uType         ; uType\nlea r8, Caption        ; Caption    \nlea rdx, Text          ; Text\nmov rcx, hWnd          ; hWnd\nCall cs:MessageBoxW \n</code></pre>\n<p>This is covered in more detailed in <a href=\"https://docs.microsoft.com/en-us/cpp/build/x64-calling-convention?view=msvc-160\" rel=\"nofollow noreferrer\">x64 Calling Convention</a></p>\n<p>If the call instruction uses relative addresses you will need to adjust when relocating the code.</p>\n<p>As an example (These addresses will vary in MS Paint)</p>\n<p>At <strong>00007FF72599A000</strong> import table starts</p>\n<p>At <strong>00007FF72599AFA0</strong> entry for MessageBox:</p>\n<pre><code>; int __stdcall MessageBoxW(HWND hWnd, LPCWSTR lpText, LPCWSTR lpCaption, UINT uType)\nextrn MessageBoxW:qword ;\n</code></pre>\n<p>At <strong>00007FF7258CA6A2</strong> message box is called:</p>\n<pre><code>Call cs:MessageBoxW ( bytes FF 15 F8 08 0D 00 )\n</code></pre>\n<p>AT <strong>00007FF7258CA6A2</strong> message box is called:</p>\n<pre><code>Call cs:MessageBoxW ( bytes FF 15 09 5F 0A 00 )\n</code></pre>\n<p>You can see from these bytes changes that the in this case the address is relative, so will need to be adjusted if relocating the code. Reading the processor documentation can explain the different call options, for example from <a href=\"https://www.amd.com/system/files/TechDocs/24594.pdf\" rel=\"nofollow noreferrer\">amd64 Architecture Programming Manual</a></p>\n<p><strong>NEAR CALLS</strong></p>\n<p>Pushes the offset of the next instruction onto the stack and branches to the target address, which\ncontains the first instruction of the called procedure. The target operand can specify a register, a\nmemory location, or a label. A procedure accessed by a near CALL is located in the same code\nsegment as the CALL instruction.\nIf the CALL target is specified by a register or memory location, then a 16-, 32-, or 64-bit rIP is read\nfrom the operand, depending on the operand size. A 16- or 32-bit rIP is zero-extended to 64 bits.\nIf the CALL target is specified by a displacement, the signed displacement is added to the rIP (of the\nfollowing instruction), and the result is truncated to 16, 32, or 64 bits, depending on the operand size.\nThe signed displacement is 16 or 32 bits, depending on the operand size.\nIn all cases, the rIP of the instruction after the CALL is pushed on the stack, and the size of the stack\npush (16, 32, or 64 bits) depends on the operand size of the CALL instruction.\nFor near calls in 64-bit mode, the operand size defaults to 64 bits. The E8 opcode results in\nRIP = RIP + 32-bit signed displacement and the FF /2 opcode results in RIP = 64-bit offset from\nregister or memory. No prefix is available to encode a 32-bit operand size in 64-bit mode.\nAt the end of the called procedure, RET is used to return control to the instruction following the\noriginal CALL. When RET is executed, the rIP is popped off the stack, which returns control to the\ninstruction after the CALL.</p>\n<p><strong>CALL rel16off</strong> ( <strong>E8 iw</strong> ) Near call with the target specified by a 16-bit relative\ndisplacement.</p>\n<p><strong>CALL rel32off</strong> ( <strong>E8 id</strong> ) Near call with the target specified by a 32-bit relative\ndisplacement.</p>\n<p><strong>CALL reg/mem16 ( FF /2</strong> ) Near call with the target specified by reg/mem16.</p>\n<p><strong>CALL reg/mem32 ( FF /2 )</strong> Near call with the target specified by reg/mem32. (There\nis no prefix for encoding this in 64-bit mode.)</p>\n<p><strong>CALL reg/mem64 (FF /2)</strong> Near call with the target specified by reg/mem64.</p>\n<p><strong>FAR CALLS</strong></p>\n<p>Pushes procedure linking information onto the stack and branches to the target address, which contains\nthe first instruction of the called procedure. The operand specifies a target selector and offset.\nThe instruction can specify the target directly, by including the far pointer in the immediate and\ndisplacement fields of the instruction, or indirectly, by referencing a far pointer in memory. In 64-bit\nmode, only indirect far calls are allowed; executing a direct far call (opcode 9A) generates an\nundefined opcode exception. For both direct and indirect far calls, if the CALL (Far) operand-size is\n16 bits, the instruction's operand is a 16-bit offset followed by a 16-bit selector. If the operand-size is\n32 or 64 bits, the operand is a 32-bit offset followed by a 16-bit selector.\nThe target selector used by the instruction can be a code selector in all modes. Additionally, the target\nselector can reference a call gate in protected mode, or a task gate or TSS selector in legacy protected\nmode.\n• Target is a code selector—The CS:rIP of the next instruction is pushed to the stack, using operandsize stack pushes. Then code is executed from the target CS:rIP. In this case, the target offset can\nonly be a 16- or 32-bit value, depending on operand-size, and is zero-extended to 64 bits. No CPL\nchange is allowed.</p>\n<p>• Target is a call gate—The call gate specifies the actual target code segment and offset. Call gates\nallow calls to the same or more privileged code. If the target segment is at the same CPL as the\ncurrent code segment, the CS:rIP of the next instruction is pushed to the stack.\nIf the CALL (Far) changes privilege level, then a stack-switch occurs, using an inner-level stack\npointer from the TSS. The CS:rIP of the next instruction is pushed to the new stack. If the mode is\nlegacy mode and the param-count field in the call gate is non-zero, then up to 31 operands are\ncopied from the caller's stack to the new stack. Finally, the caller's SS:rSP is pushed to the new\nstack.\nWhen calling through a call gate, the stack pushes are 16-, 32-, or 64-bits, depending on the size of\nthe call gate. The size of the target rIP is also 16, 32, or 64 bits, depending on the size of the call\ngate. If the target rIP is less than 64 bits, it is zero-extended to 64 bits. Long mode only allows 64-\nbit call gates that must point to 64-bit code segments.</p>\n<p>• Target is a task gate or a TSS—If the mode is legacy protected mode, then a task switch occurs.\nSee “Hardware Task-Management in Legacy Mode” in volume 2 for details about task switches.\nHardware task switches are not supported in long mode.</p>\n<p><strong>CALL FAR pntr16:16</strong> (<strong>9A cd</strong>) Far call direct, with the target specified by a far pointer\ncontained in the instruction. (Invalid in 64-bit mode.)</p>\n<p><strong>CALL FAR pntr16:32</strong> ( <strong>9A cp</strong> ) Far call direct, with the target specified by a far pointer\ncontained in the instruction. (Invalid in 64-bit mode.)\n<strong>CALL FAR mem16:16</strong> ( <strong>FF /3</strong> ) Far call indirect, with the target specified by a far pointer\nin memory.</p>\n<p><strong>CALL FAR mem16:32</strong> (<strong>FF /3</strong>) Far call indirect, with the target specified by a far pointer\nin memory</p>\n<p>Further info can be found in <a href=\"https://software.intel.com/content/www/us/en/develop/download/intel-64-and-ia-32-architectures-sdm-combined-volumes-1-2a-2b-2c-2d-3a-3b-3c-3d-and-4.html\" rel=\"nofollow noreferrer\">Intel® 64 and IA-32 Architectures Software Developer’s Manual Combined Volumes: 1, 2A, 2B, 2C, 2D, 3A, 3B, 3C, 3D, and 4</a></p>\n</div>",
            "votes": "1",
            "user": "chentiangemalc",
            "time": "Nov 26, 2020 at 0:03",
            "is_accepted": false,
            "comments": []
        }
    ]
}