{
    "title": "Protection of Financial Apps against repackaging",
    "link": "https://reverseengineering.stackexchange.com/questions/26393/protection-of-financial-apps-against-repackaging",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have tried repackaging few financial apps and when I tried running their repackaged version, I found out that either it is getting crashed at the launcher activity, or at the later point it is getting crashed.</p>\n<p>I have a doubt that how the developers of these financial apps make their app more secure against repackaging?</p>\n<p>Is <em><strong>signature checking</strong></em> the only way, developer will use as an anti-repackaging measure or is there any other way which developer can use?</p>\n<p>Are the developers using any existing framework which automatically makes their app more secure?</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "59",
    "tags": [
        "android"
    ],
    "user": "Nikhil_Coder",
    "time": "Nov 30, 2020 at 4:12",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">The body seems to be asking something different from the title, can you change one or the other?</span>",
            "time": null
        },
        {
            "user": "Nikhil_Coder",
            "text": "<span class=\"comment-copy\">hi @IgorSkochinsky, I have updated the title.</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">It’s still not clear. You have multiple questions in the body, try to trim it to the most important one</span>",
            "time": null
        },
        {
            "user": "pythonpython",
            "text": "<span class=\"comment-copy\">Have you successfully repackaged another app? If you haven't then the problem may be that you are repackaging it incorrectly.   No. There are other ways developers can use.   Yes. Developers are likely using frameworks they have developed internally to automatically make their apps resistant to repackaging.</span>",
            "time": null
        },
        {
            "user": "Nikhil_Coder",
            "text": "<span class=\"comment-copy\">@pythonpython Yes I am successful in doing the repackaging of few apps. May I know which type of framework you are talking about. Could you give some examples regarding the same?</span>",
            "time": null
        }
    ],
    "answers_data": []
}