{
    "title": "What do you think is the optimum environment for reverse engineering dynamically-linked aarch64 Golang binaries developed in Alpine Linux?",
    "link": "https://reverseengineering.stackexchange.com/questions/26470/what-do-you-think-is-the-optimum-environment-for-reverse-engineering-dynamically",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Direct quote from <a href=\"https://golang.org/doc/gdb\" rel=\"nofollow noreferrer\">Golang's website</a>: \"<em>GDB does not understand Go programs well. The stack management, threading, and runtime contain aspects that differ enough from the execution model GDB expects that they can confuse the debugger and cause incorrect results even when the program is compiled with gccgo. As a consequence, although GDB can be useful in some situations (e.g., debugging Cgo code, or debugging the runtime itself), it is not a reliable debugger for Go programs, particularly heavily concurrent ones. Moreover, it is not a priority for the Go project to address these issues, which are difficult.</em>\"</p>\n<p>I'm also aware of projects such as <a href=\"https://github.com/sibears/IDAGolangHelper\" rel=\"nofollow noreferrer\">IDAGolangHelper</a> or other scripts to aid already established reverse engineering tools such as <a href=\"https://ghidra-sre.org/\" rel=\"nofollow noreferrer\">Ghidra</a> in interpreting Golang binaries. Nevertheless, I would like to know assuming one prefers a self-containing debugging tool that is already successful in understanding the eccentric Go runtime, what will your choice(s) be? Also, I would appreciate any comments on <a href=\"https://rada.re/n/\" rel=\"nofollow noreferrer\">Radare2</a>'s ability in handling Go binaries.</p>\n<p><strong>EDIT 1 (Clarification of Question):</strong> Assuming working on a x86_64 host it seems to me that <code>QEMU</code>'s system mode is an essential part of the environment considering the fact that <code>ptrace</code> is not implemented in the <code>QEMU</code>'s user mode. The other factor is obviously the <code>libc</code> implementation. For a dynamically-linked binary with the <code>ld-musl-aarch64.so.1</code> interpreter this adds a Linux distribution with <code>musl</code> as the native <code>libc</code> implementation unless one wishes to build <code>musl</code> on a distribution already having <code>glibc</code> installed. So I guess my question would be what other functionalities (or tools) will you add to <code>QEMU</code> and Alpine?</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "156",
    "tags": [
        "ida",
        "radare2",
        "gdb",
        "ghidra",
        "aarch64"
    ],
    "user": "Newbie",
    "time": "Dec 7, 2020 at 19:16",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Intriguing question. I'm wondering if gVisor could be of help, because when dealing with a statically linked binary you end up talking to the kernel via the syscall interface. But potentially you end up in a catch 22 due to gVisor being written in Go itself.</span>",
            "time": null
        },
        {
            "user": "Newbie",
            "text": "<span class=\"comment-copy\">@0xC0000022L I just added some clarification</span>",
            "time": null
        }
    ],
    "answers_data": []
}