{
    "title": "Complications reverse engineering a Visual Basic application",
    "link": "https://reverseengineering.stackexchange.com/questions/2662/complications-reverse-engineering-a-visual-basic-application",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm reverse engineering a Visual Basic application and I've run into a big of a sticky situation, so I was hoping that someone might have an opinion on a way to approach it. It's basically a crackme but I haven't been able to nail down where the callback code is for the function I'm looking for. I've found the labels and captions but I was hoping for an intelligent way to start looking at the binary instead of crawling through it from top to bottom until I find the right comparison.</p>\n<p>I've taken a look at the output of VB Decompiler but the output isn't matching up to what I'm used to.</p>\n<p><img alt=\"here's the output from VB Decompiler\" src=\"https://i31.photobucket.com/albums/c367/Fewmitz/decomp_zpsc874945f.png\"/></p>\n<p>In other VB apps it seems like the locations given there is enough to get started and find the callbacks, but not with this one: <img alt=\"this is what I get when trying to find any of the actual code\" src=\"https://i31.photobucket.com/albums/c367/Fewmitz/nocodes_zpsc79f980d.png\"/>. </p>\n<p>I thought at first the code was just being rendered poorly in the debugger but after playing around with it I don't think that location is correct at all. So I'm looking for ideas on where to go from here.</p>\n<p>Thanks.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "1k",
    "tags": [
        "crackme",
        "visual-basic"
    ],
    "user": "Fewmitz",
    "time": "Mar 10, 2017 at 9:42",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is probably P-code compiled file, not native code. Try WKT Debugger:</p>\n<p><a href=\"http://www.woodmann.com/collaborative/tools/index.php/Whiskey_Kon_Tequilla_VB_P-Code_Debugger\" rel=\"nofollow\">http://www.woodmann.com/collaborative/tools/index.php/Whiskey_Kon_Tequilla_VB_P-Code_Debugger</a></p>\n</div>",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Aug 21, 2013 at 10:38",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Fewmitz",
                    "text": "<span class=\"comment-copy\">This gives me an error whenever I try to run it about missing DLLs. I couldn't find copies online and I saw something about the debugger only erroring out if the application isn't pcode compiled?</span>",
                    "time": null
                },
                {
                    "user": "Fewmitz",
                    "text": "<span class=\"comment-copy\">I take what I said before back. I must have had a corrupt download the first time around or something. I tried again and that gave me enough information to get what I was looking for.</span>",
                    "time": null
                }
            ]
        }
    ]
}