{
    "title": "Reverse Engineering an ERP interface written in Flash",
    "link": "https://reverseengineering.stackexchange.com/questions/26685/reverse-engineering-an-erp-interface-written-in-flash",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>My college has its ERP platform in a Flash interface, accessible only via Internet Explorer. I am looking into ways I can interface with it via things like <a href=\"https://ruffle.rs/\" rel=\"nofollow noreferrer\">ruffle</a>. So I can write my own frontend using modern frameworks. Thing is, accessing the ERP from anything other Internet Explorer results in the browser download a Flash file <code>campus-lynx.swf</code>. This means the platform is locked to Windows only. Flashfox on Android works as well.</p>\n<p>The ERP is available directly at erp.nitdelhi.ac.in or clicking \"internet\" at the top of nitdelhi.ac.in.</p>\n</div>",
    "votes": "3",
    "answers": 2,
    "views": "109",
    "tags": [
        "flash",
        "websites"
    ],
    "user": "Blaine",
    "time": "Jan 5, 2021 at 13:09",
    "comments": [
        {
            "user": "multithr3at3d",
            "text": "<span class=\"comment-copy\">What is your specific question?</span>",
            "time": null
        },
        {
            "user": "Blaine",
            "text": "<span class=\"comment-copy\">What should my approach be? Extracting the downloaded swf file lead me to nowhere.</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">What’s “erp”? Maybe add an explanation what exactly it does.</span>",
            "time": null
        },
        {
            "user": "Blaine",
            "text": "<span class=\"comment-copy\">Ah its a portal for resource management where teachers can update grades and attendance, and students can see the above along with register for sems</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<blockquote>\n<p>My college has its erp platform in a flash interface, accesible only via Internet Explorer.\nThing is, accessing the erp from amything other internet explorer results in the browser download a flash file \"campus-lynx.swf\". This means the platform is locked to windows only.</p>\n</blockquote>\n<p>You are obviously wrong. Application work in firefox without any problems. Even site itself state \"Best Peformed With Mozilla FireFox Version 2 and above\".</p>\n<p>Most recent Firefox versions start dropping Flash support, that may be the case. But you always can install portable version of Firefox 52 without this issue.</p>\n<p>Judging by controls look and feel the application was build with Adobe Flex Builder.</p>\n<p>There was several commercial Flash decompilers such as <a href=\"https://www.eltima.com/products/flashdecompiler/\" rel=\"nofollow noreferrer\">https://www.eltima.com/products/flashdecompiler/</a>\nYou can try to decompile SWF file to figure out protocols being used.</p>\n<p>Most probably there is something standard such as XML or <a href=\"https://en.wikipedia.org/wiki/Action_Message_Format\" rel=\"nofollow noreferrer\">Action Message Format</a>.</p>\n<p>UPD: Network activity tab in browser clearly indicate usage of AMF protocol. There is a plenty of AMF support libraries for various programming languages. Google it.</p>\n</div>",
            "votes": "3",
            "user": "user882813",
            "time": "Jan 3, 2021 at 15:57",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Intercept the traffic between the browser / plugins and the server. I would start with <a href=\"https://www.wireshark.org/\" rel=\"nofollow noreferrer\">Wireshark</a>.</p>\n<p>The traffic between the client and the server will be some form of network requests which you can write code to generate / consume.</p>\n</div>",
            "votes": "3",
            "user": "pythonpython",
            "time": "Jan 4, 2021 at 16:02",
            "is_accepted": false,
            "comments": []
        }
    ]
}