{
    "title": "Is it possible to sniff an ATA Drive password?",
    "link": "https://reverseengineering.stackexchange.com/questions/26733/is-it-possible-to-sniff-an-ata-drive-password",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><strong>Context:</strong> I have a proprietary Tandberg Data RDX QuickStor Internal USB3 drive bay for PC (item number <code>8666-RDX</code>) and some storage cartridges for it.\nEsentially, these are just regular TOSHIBA <code>MK3276GSX</code> 2.5\" SATA drives in some fancy housing and the corresponding SATA-to-USB-3.0 adapter bay.</p>\n<p><strong>The catch:</strong> The SATA Drives are protected with an ATA password and the bay unlocks them when inserted. I cannot use them if i connect them directly to my PC and all of my attempts at triggering an ATA Secure erase or obtaining an OEM master password failed.</p>\n<p><strong>My question:</strong> Is there a sane way to obtain the ATA password, e.g. by soldering a few wires onto the SATA connector in the drive bay and recording some data with an oscilloscope for later analysis?</p>\n<p>I once asked about this <a href=\"https://superuser.com/q/1506588/1117550\">on the superuser stack exchange</a> but the answers were limited to software based solutions. I wasn't able to succed with that approach.</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "863",
    "tags": [
        "firmware",
        "hardware",
        "protocol"
    ],
    "user": "Brian",
    "time": "Jan 12, 2021 at 12:38",
    "comments": [
        {
            "user": "pythonpython",
            "text": "<span class=\"comment-copy\">What is the brand of the SATA Drives?</span>",
            "time": null
        },
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\"><a href=\"https://shackspace.de/2011/04/27/open-sesame-harddrive-password-hacking-with-a-openbench-logic-sniffer/\" rel=\"nofollow noreferrer\">shackspace.de/2011/04/27/…</a> Might be interesting</span>",
            "time": null
        },
        {
            "user": "Brian",
            "text": "<span class=\"comment-copy\">@pythonpython i updated the question to include that info</span>",
            "time": null
        },
        {
            "user": "Brian",
            "text": "<span class=\"comment-copy\">@morsisko That is an awesome resource, thanks! No i've already got a real understanding of how this can look like. Now all that's left is to get access to such a device. Investing in buying a new one sadly would probably not pay off as i'd be cheaper off just buying new drives. Welp.</span>",
            "time": null
        },
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\">You can get logic analyser for like 5$. I got similar one which can sniff signals up to 24MHz on 8 channels. I don't think the ATA setup is any faster, so you should be fine.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"http://elettrofreak.blogspot.com/2011/02/estrarre-le-password-ata-da-un-hard.html\" rel=\"nofollow noreferrer\">This tutorial</a> (NB: in Italian) covers recovering ATA passwords from the drive itself. Not for the faint of heart, and drive controller firmware dependent. You might also post on <a href=\"https://forum.hddguru.com/\" rel=\"nofollow noreferrer\">forum.hddguru.com</a> as they seem like SMEs.</p>\n<p>Here's <a href=\"https://www.geckoandfly.com/4093/unlock-and-recover-hard-drive-password-hard-disk-password-removal-tool/\" rel=\"nofollow noreferrer\">another tutorial</a> covering different tools and techniques.</p>\n<p>There's plenty of additional information about Tandberg RDX <a href=\"https://ftp1.overlandtandberg.com/public/techsupportdocs/external/1022447_D.pdf\" rel=\"nofollow noreferrer\">here</a> starting on Page 14 which seems germane:</p>\n<pre><code>There are two types of cartridge data protection available:\n• Full Disk AES 256 XTS Encryption – All data stored on the cartridge is encrypted\nusing the XTS-AES 256 encryption standard (recommended).\n• Basic Password Protection – Access to the cartridge and \nits data is protected by a single password.\nIMPORTANT: When using the Basic Password Protection option, data \non the cartridge is NOT encrypted and is only protected by a password.\n</code></pre>\n<p>Based on your question I'm assuming these carts are secured with the 2nd type which is implemented as an ATA Password. I assume you've tried the steps on page 24 of the manual to remove this type of protection.</p>\n</div>",
            "votes": "2",
            "user": "pythonpython",
            "time": "Jan 14, 2021 at 2:06",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">Nice, but the question was about sniffing the password on the bus (sent by the enclosure), not extracting the password from the drive.</span>",
                    "time": null
                },
                {
                    "user": "pythonpython",
                    "text": "<span class=\"comment-copy\">From what I've read about ATA Passwords, they are stored on the drive themselves as part of the drive controller firmware. This is separate from the enclosure, otherwise you can just pull the drive mount and read it without the enclosure. In this case the OP wants to use the drives, but they cannot be written to due to the ATA Password on the drive itself.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">If the drives are usable by the enclosure it means it’s unlocking them, probably by sending the password on connect. This password could be sniffed without having to mess with the drive firmware.</span>",
                    "time": null
                },
                {
                    "user": "pythonpython",
                    "text": "<span class=\"comment-copy\">\"My question: Is there a sane way to obtain the ATA password\" For some of us sane is poking at the firmware, for others sane is taking a soldering iron to it. For me a red hot poker near microelectronics isn't my idea of sane :) I probably do stuff which others think is nuts.</span>",
                    "time": null
                }
            ]
        }
    ]
}