{
    "title": "Best way to protect source code of exe that being loaded by Assembly.Load method",
    "link": "https://reverseengineering.stackexchange.com/questions/26822/best-way-to-protect-source-code-of-exe-that-being-loaded-by-assembly-load-method",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am protecting an exe that being loaded by Assembly.Load... This makes everything difficult because most obfuscators causing it to not work properly or not load at all. I used confuserEx Ameteurz modded its working with max settings but I don't like protection too easy to unpack. Right now I am using .net reactor 6.5 its good but messagebox annoying and I can't trust completely I think someone can deobfuscate it. What do you suggest?</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "494",
    "tags": [
        "assembly",
        "encryption",
        "obfuscation",
        "c#",
        "protection"
    ],
    "user": "dreamerx",
    "time": "Jan 19, 2021 at 8:31",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">This does not seem to be a question about reverse engineering and besides “best” is subjective.</span>",
            "time": null
        },
        {
            "user": "Thorbjørn Ravn Andersen",
            "text": "<span class=\"comment-copy\">What are you worried about happening?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I used vmprotect in some of my client projects, as it virtualizes the code and if configured correctly you will have no problems with unpack, that using virtualized code reduces the chances of newbies trying to copy your algorithm, and that is subjective because after some time new techniques always appear, so it is important to keep your software updated and your protector updated.</p>\n</div>",
            "votes": "0",
            "user": "Happy",
            "time": "Jan 25, 2021 at 14:41",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Happy",
                    "text": "<span class=\"comment-copy\">There are other alternatives for code virtualization, like themida, I don't recommend it much because there is already a functional unpacking technique since the source is devirtualized in memory and its OEP is relatively simple to find.</span>",
                    "time": null
                },
                {
                    "user": "dreamerx",
                    "text": "<span class=\"comment-copy\">with vmprotect client didn't load my assembly so its not working unfortunately</span>",
                    "time": null
                }
            ]
        }
    ]
}