{
    "title": "Android app leaking data",
    "link": "https://reverseengineering.stackexchange.com/questions/26854/android-app-leaking-data",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>While going through the app analysis i found that when i use logcat it shows me encrypted data ..now the app is obfuscated ... When i use burp suite with my android emulator it was making a <strong>POST</strong> request to a method of an api in form of <strong>JSON Array</strong> (Encrypted)...is there any way that i can decrypt this text or find decryption key?</p>\n<p>Also i have found that after deobfuscating i found a method named as void decode() but it doesnt reveal any information..so is there is anyway to use this method explicitly?</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "78",
    "tags": [
        "android"
    ],
    "user": "Hacker88929",
    "time": "Jan 23, 2021 at 14:20",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">Pull the app apk from your device, decompile it, search for the call that created the logcat entry and check the data-flow backward to identify the method that encrypts the data. Then I would use <a href=\"https://frida.re\" rel=\"nofollow noreferrer\">frida</a> on an rooted phone to hook that method and extract the used encryption key (assuming the used encryption algorithm is something standardized like AES).</span>",
            "time": null
        },
        {
            "user": "Hacker88929",
            "text": "<span class=\"comment-copy\">I got that partially but can u elaborate more or just give me some tutorial video link or any material to see how to  perform it?</span>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">how many hours are you willing to invest? Depending on your current knowledge it can require a lot of time for learning the skills required to reverse engineer and app and use frida to extract the data you want.</span>",
            "time": null
        },
        {
            "user": "Hacker88929",
            "text": "<span class=\"comment-copy\">Like for me the time is not the consent i just want to get it done 😅</span>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">Then open the app in Jadx and find the position where the log entry is created. That requires Java and Android development skills. If you don't have those learn them first.</span>",
            "time": null
        }
    ],
    "answers_data": []
}