{
    "title": "Decompressing XML file with unknown compression method",
    "link": "https://reverseengineering.stackexchange.com/questions/26919/decompressing-xml-file-with-unknown-compression-method",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Would there be anyway at all to determine the compression method used for this XML file given only the compressed XML?</p>\n<p>I've looked into different XML compression methods such as EXI, but can't seem to be able to decode this.</p>\n<p>It's a vehicle XML file from the game stormworks, they recently updated the game so dedicated servers compress vehicle files to save storage space and for faster file transfer times between the server and clients. We had planned to create a sub-system of our server management program that parsed the blocks used in the vehicle to determine what blocks and how many were used.</p>\n<p>Here is the compressed XML in plain text: <a href=\"https://pastebin.com/zSg7DrF3\" rel=\"nofollow noreferrer\">https://pastebin.com/zSg7DrF3</a> and on dropbox: <a href=\"https://www.dropbox.com/s/yufpcxxx8utuo57/vehicle.bin?dl=0\" rel=\"nofollow noreferrer\">https://www.dropbox.com/s/yufpcxxx8utuo57/vehicle.bin?dl=0</a></p>\n<p>Thanks</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "654",
    "tags": [
        "decompress"
    ],
    "user": "Avallex",
    "time": "Jan 31, 2021 at 23:34",
    "comments": [
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\">Might be impossible to deduce without looking at the executable that is compressing/decompressing it.</span>",
            "time": null
        },
        {
            "user": "Avallex",
            "text": "<span class=\"comment-copy\">@morsisko It is for the game called stormworks on steam</span>",
            "time": null
        },
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\">Unfortunately there is very little chance someone will do all the work for you for free. Even worse you need to pay for this game, so in case someone wants to help you, they need not only invest their time but also their money. You see how it looks.</span>",
            "time": null
        }
    ],
    "answers_data": []
}