{
    "title": "Trouble backing up rom on locked proprietary mediatek device - mt8163 chipset",
    "link": "https://reverseengineering.stackexchange.com/questions/26920/trouble-backing-up-rom-on-locked-proprietary-mediatek-device-mt8163-chipset",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a proprietary tablet with mediatek chipset MT8163v, and getting the factory ROM and/or scatter file is out of the question. My goal is to flash with TWRP.</p>\n<p>The device has a custom android repo that doesn't allow me to install apps or anything of that nature, so I can't go that route.</p>\n<p>I'm trying to do a readback of the preloader partition with spflash tool, then use WwR to generate the scatter. The details of how this works can be found <a href=\"https://forum.hovatek.com/thread-21970.html\" rel=\"nofollow noreferrer\">here</a>. It's pretty simple.</p>\n<p>When I attempt the readback, I'm getting this error:</p>\n<pre><code>s_dl_get_dram_setting_fail(5054)\n</code></pre>\n<p>Everything I've read indicates that this is due to an incorrect scatter file. However, just to be safe, I used a secure boot bypass found <a href=\"https://github.com/MTK-bypass/bypass_utility\" rel=\"nofollow noreferrer\">here</a> just to make certain that secure boot isn't the problem. With the bypass however, I get the same error.</p>\n<p>From everything I've read, a readback is the <em>one thing</em> I should be able to do without the factory rom/scatter files. Which is why I'm perplexed as to why I'm getting this error when doing a simple readback.</p>\n<p>I've even payed the tech guys at Hovatek (who were very helpful) to help work on this. We tried the newest Infinity Box with dongle as well, to no avail.</p>\n<p>Here is the partition info in the scatter generated by WwR:</p>\n<pre><code>- partition_index: SYS0\npartition_name: PRELOADER\nfile_name: preloader.bin\nis_download: true\ntype: SV5_BL_BIN\nlinear_start_addr: 0x0\nphysical_start_addr: 0x0\npartition_size: 0x80000\nregion: EMMC_BOOT_1\nstorage: HW_STORAGE_EMMC\nboundary_check: true\nis_reserved: false\noperation_type: BOOTLOADERS\nreserve: 0x00\n</code></pre>\n<p>Seems to me the only variable properties are <code>physical_start_addr</code> and <code>partition_size</code>. However, it seems that when I look at scatter files for other mediatek chipsets, it's always either <code>0x80000</code> or <code>0x40000</code>. And from what I've read this shouldn't matter just doing a readback. But I've tried both to no avail.</p>\n<p>Does anyone know anything else I could try?? I'm even willing to try ROMs from other devices with the same chipset. At this point I don't care if I brick it.</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "359",
    "tags": [
        "firmware",
        "firmware-analysis",
        "flash",
        "rom"
    ],
    "user": "silencedogood",
    "time": "Feb 5, 2021 at 18:26",
    "comments": [],
    "answers_data": []
}