{
    "title": "How to get the functions that call or access a string in Binary Ninja?",
    "link": "https://reverseengineering.stackexchange.com/questions/26966/how-to-get-the-functions-that-call-or-access-a-string-in-binary-ninja",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am reversing engineering a program. Right now I was using Hopper.\nWith Hopper once I find a string I can right click and I have an option call \"References to ...\"\nthat will return a list of functions that call or access this data.</p>\n<p><a href=\"https://i.sstatic.net/6iKCN.jpg\" rel=\"nofollow noreferrer\"><img alt=\"Hopper\" src=\"https://i.sstatic.net/6iKCN.jpg\"/></a></p>\n<p>When I try to use Binary Ninja. I find the string then I noticed that \"Cross Reference\" is empty. This is the main reason I don't use Binary Ninja but I want to use it because there are other things I really like.</p>\n<p><a href=\"https://i.sstatic.net/kwKoF.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/kwKoF.jpg\"/></a></p>\n<p>Anybody knows if I have to check any specific option or do anything special to get the same result?</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "1k",
    "tags": [
        "binary",
        "hopper"
    ],
    "user": "Ricardo",
    "time": "Feb 6, 2021 at 0:02",
    "comments": [
        {
            "user": "multithr3at3d",
            "text": "<span class=\"comment-copy\">Binary Ninja definitely supports this behavior... try another string that you find in the strings output. I have noticed that string references aren't always recognized correctly though when it doesn't separate them out like that.</span>",
            "time": null
        },
        {
            "user": "Ricardo",
            "text": "<span class=\"comment-copy\">@multithr3at3d I had to contact The guys from Binary Ninja. They said BN does not recognize cfstrings out of the box so I had to install a plugin that recognize them I still wasn't able to see the cross references.</span>",
            "time": null
        }
    ],
    "answers_data": []
}