{
    "title": "FINDING & EXECUTING a function from an exe/dll (not compiled by me)?",
    "link": "https://reverseengineering.stackexchange.com/questions/27056/finding-executing-a-function-from-an-exe-dll-not-compiled-by-me",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>my Problem is, i have bought a Huion Kamvas 22 Plus pen display for drawing and painting.</p>\n<p>On my old Wacom tablet i had some hardware buttons and could map functions/setting of the driver to these hardware buttons.</p>\n<p>The new Huion Monitor doesnt have any Hardware Buttons! Thats ok , i just use keyboard shortcuts anyways ...</p>\n<p><strong>But theres one problem,</strong></p>\n<p>the huion driver window has a function called \"switch screen\". with that i can switch the mouse output from the Pen to another monitor (in a multi monitor setup). This cant be mapped to any keyboard shortcut though , just (eventual) hardware buttons which come with the huion displays. As i mentioned, my model(the Kamvas 22 plus) doesnt have any buttons though.</p>\n<p>Now i want to</p>\n<p>A)</p>\n<p>find the specific function/argument in a file called \"TabletDriverCore.exe\" or any of its loaded dlls</p>\n<p>and B)</p>\n<p>run this function(+ correct arguments) from the command line / autohotkey / whatever</p>\n<p>is that possible and how would i achieve that ?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "114",
    "tags": [
        "dll",
        "exe"
    ],
    "user": "Alexander Mehler",
    "time": "Feb 20, 2021 at 14:51",
    "comments": [
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\">This is definitely possible if you are sure the function is inside the TabletDriverCore.exe and the application is the same for all the devices. I would use the old tablet to find the hardware buttons handling function and from there look for the \"switch screen\" one.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Yes this is absolutely possible.</p>\n<ul>\n<li>First, you need to attach a debugger to the executable file and play around with the functionality you are interested in (i.e use it multiple times while keeping an eye on the debugger, stack, interesting memory regions, etc... Usually the shortest path for finding a function is by looking for string/values references and tracing back from there) until you are able to find the starting address of the function in the EXE file (or one of the loaded modules).</li>\n<li>After finding the function, you need to check the parameters as well as their correct data types, that's a bit of static analysis where you try to analyze the stack and the type of arithmetic instructions (for instance <code>imul</code> vs <code>mul</code>).</li>\n<li>Now you've got both the function address and the correct parameters, from there you can code a DLL that gets injected into that executable on runtime, then hooks the target function and map it to whatever keyboard key(s) you want.</li>\n</ul>\n<p>This trick is used extensively in game hacks and trainers, especially trainers that use the printing functions of a game to print some custom values at runtime.</p>\n</div>",
            "votes": "0",
            "user": "Abdullah Mohamed",
            "time": "Feb 21, 2021 at 14:13",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Alexander Mehler",
                    "text": "<span class=\"comment-copy\">Hello, thanx . Yes its most probably that exe.its easy to see in process explorer lighting up on switch screen (now mapped to one of the pen buttons)  and if i kill the exe the pen and the switch screen  dont work anymore.  But i think this is above my head, i think i could manage to write a dll (would be my first), if i knew the correct function and parameters. but debugging isanother thing of its own where one needs to be confident and trained i guess. ill try my best though, do you recommend any easy to use and understand debugger?</span>",
                    "time": null
                },
                {
                    "user": "Abdullah Mohamed",
                    "text": "<span class=\"comment-copy\">For me, I use x64dbg, but really whatever debugger you are comfortable with should work fine. You need to attach the debugger to the process, try to find any references (strings or anything else) for the functionality you are trying to trace, and start from there to trace back until you reach to the function header and be able to see the pushed parameters. It's indeed a bit tricky, there are no way that simplifies such task (at least to my knowledge).</span>",
                    "time": null
                }
            ]
        }
    ]
}