{
    "title": "How to decompile heavily obfuscated classes mixed with Arabic/Chinese/Korean characters?",
    "link": "https://reverseengineering.stackexchange.com/questions/27085/how-to-decompile-heavily-obfuscated-classes-mixed-with-arabic-chinese-korean-cha",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I recently downloaded a <code>jar</code> file and was curious to see if it was malicious, so I ran it through <code>FernFlower</code> and it wasn't able to deobfuscate it. When I unzipped the jar, I looked inside it and saw multiple folders, maybe 40~ ish consisting of a mixture of Chinese, Korean, and Arabic. This was raising a heavy red flag for me; so I tried multiple decompiliers consisting of things like JD-Gui, Bytecode viewer, and Krakatau. All seemed to decompile the normal folders fine, but not the mixed language ones.</p>\n<p>I think its safe to say that whoever made this jar, clearly didn't want me to check whats inside. I want to make sure it's not a malicious <code>jar</code> file (like I said earlier...)</p>\n<p>So how would I go around deobfuscating the jar file?</p>\n<p>Because the entire jar is <code>73MB (yikes)</code>, here is a <a href=\"http://www.mediafire.com/file/n7d38rcj6dmcuu3/encryptedFolder.zip/file\" rel=\"nofollow noreferrer\">zip</a> file of one of the language folders</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "java",
        "deobfuscation",
        "jar"
    ],
    "user": "reversesigmathx",
    "time": "Feb 24, 2021 at 7:06",
    "comments": [
        {
            "user": "Col-E",
            "text": "<span class=\"comment-copy\">Can you share this sample somewhere? Also you may want to look at tools like <code>java-deobfuscator</code>/<code>threadtear</code> to remove common obfuscation techniques. You can use any obfuscator like Proguard to rename things for you because applying weaker names is better than dealing with ugly names.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I gave it my shot at this question but the output is still very obfuscated code you will need to re-run it a few passes through some more deobfuscators the code has alot of goto's code and math, you can do it all by hand but it will take months!.</p>\n<p>It seems it contains classes to\n<code>com.mojang.brigadier.exceptions.CommandSyntaxException</code></p>\n<p>Which means this jar file is for Minecraft game.</p>\n<p>Since it's for minecraft I found this.\n<a href=\"https://github.com/PetoPetko/Minecraft-Deobfuscator3000\" rel=\"nofollow noreferrer\">https://github.com/PetoPetko/Minecraft-Deobfuscator3000</a></p>\n<p>I played around with Minecraft Deobfuscator 3000 it seems it renames all fields/methods/params based on 2 different minecraft versions 1.7.10 and 1.12</p>\n<p>You would need to get mappings for whichever version this encrypted java file used, both mappings versions failed for me.</p>\n<p><img alt=\"minecraft\" src=\"https://i.imgur.com/MxjKxn2.png\"/></p>\n<p>This may help you also it's a site with like 6 different online java decompilers.. you can try all 6.\n<a href=\"http://www.javadecompilers.com/\" rel=\"nofollow noreferrer\">http://www.javadecompilers.com/</a></p>\n<p>This tool also looks very promising on this project.\n<a href=\"https://javadeobfuscator.com/\" rel=\"nofollow noreferrer\">https://javadeobfuscator.com/</a>\n<br/>\n(Takes about 3 hours with all transformations and does help with this project..)<br/>\nUse Transformers:</p>\n<pre><code>allatori.FlowObfuscationTransformer\nspecial.FlowObfuscationTransformer\nnormalizer.SourceFileClassNormalizer\n</code></pre>\n<p>mess around with the <code>general.peephole</code> remove the Transformers that fail.. I removed 2 of em. <code>RedundantGotoRemover</code> and <code>PeepholeOptimizer</code> the PeepholeOptimizer does do alot of fixes but it crashes.. so maybe you can run it somehow at the very end.</p>\n<p>Try getting in contact with Janmm14 or samczsun he made the <a href=\"https://javadeobfuscator.com/\" rel=\"nofollow noreferrer\">https://javadeobfuscator.com/</a> and also works on Minecraft mods so he can help you 100% on this issue.</p>\n<p><a href=\"https://github.com/Janmm14\" rel=\"nofollow noreferrer\">https://github.com/Janmm14</a>\n<br/>\n<a href=\"https://github.com/samczsun\" rel=\"nofollow noreferrer\">https://github.com/samczsun</a></p>\n<p>The Fernflower or CFR works on some files, Krakatau doesn't seem to work.</p>\n<p><strong>CFR gives the best results..</strong></p>\n<p>Output Decompiled Files: <a href=\"http://www.mediafire.com/file/fh74g6uovc4ji2i/encrypted+output.zip/file\" rel=\"nofollow noreferrer\">http://www.mediafire.com/file/fh74g6uovc4ji2i/encrypted+output.zip/file</a></p>\n<p>I used Procyon on your <code>encryptedFolder.zip</code> it managed to decompile all the files without a problem although some stuff bytecode isn't fully implemented in Procyon so some functions just got comments (no code).</p>\n<p>Here is a example of 1 of your files how the code looks like.</p>\n<p><a href=\"https://i.sstatic.net/JQlP5.jpg\" rel=\"nofollow noreferrer\"><img alt=\"a\" src=\"https://i.sstatic.net/JQlP5.jpg\"/></a>\n<a href=\"https://i.sstatic.net/iVN4O.jpg\" rel=\"nofollow noreferrer\"><img alt=\"b\" src=\"https://i.sstatic.net/iVN4O.jpg\"/></a></p>\n<p>Procyon can generate java code for any java class which will compile without problems.. (wasn't the case for this example, won't compile). Since it is still obfuscated like crazy.</p>\n<p>People in the RuneScape hacking community mastered the skill of Java deobfuscating they can unprotect any java code, pretty sure you can find a product in the RuneScape Hacking Community which will do a perfect job.\nThe tools they use are Zelix KlassMaster, Kopi Java Compiler Suite, jode, and Procyon. That's pretty much all you need.</p>\n<p>You may find all you need from this github project\n<a href=\"https://github.com/Rune-Status/rscdump.com-runescape-classic-dump\" rel=\"nofollow noreferrer\">https://github.com/Rune-Status/rscdump.com-runescape-classic-dump</a></p>\n<p>it has a bunch of runescape java projects that were made in the community which has a bunch of deobfuscators.</p>\n<p>When runescape protection got more stronger each time, the community started building their own deobfuscators using java asm, which can outperform any java deobfuscator currently in the public.</p>\n<p>You can find some deobfuscators in the public from runescape community on github. I was a member of the runescape community for like 10 years and let me tell you those people are very talented when it comes to java and hacking. One of the users who worked in the Runescape hacking community went on and created a popular website called pastebin.com which shows how smart they are :)</p>\n<p><a href=\"https://github.com/search?q=runescape+deobfuscator\" rel=\"nofollow noreferrer\">https://github.com/search?q=runescape+deobfuscator</a></p>\n</div>",
            "votes": "1",
            "user": "SSpoke",
            "time": "Feb 27, 2021 at 6:20",
            "is_accepted": true,
            "comments": []
        }
    ]
}