{
    "title": "MPC562 and M58BW016 Flash operations",
    "link": "https://reverseengineering.stackexchange.com/questions/27119/mpc562-and-m58bw016-flash-operations",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to modify the Flash memory of a board with a Freescale MPC562 processor, using an external 2 MB Flash chip <a href=\"https://media-www.micron.com/-/media/client/global/documents/products/data-sheet/nor-flash/m58bw016.pdf?rev=bf38133cdcdd4ff0bb0380a31234f468\" rel=\"nofollow noreferrer\">M58BW016</a>. So far I've been able to successfully read and write the chip's internal registers. However, while I can read the external flash, I cannot perform any modifications on it - erasing or writing.</p>\n<p>I tried permanently pulling high the Write Protect pin on the chip, with no success. Please share your thoughts.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "266",
    "tags": [
        "powerpc"
    ],
    "user": "Slav",
    "time": "Feb 28, 2021 at 19:44",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In many cases the board circuitry gets powered by the flashing operation which prevents it from working (especially writing since it usually needs more power). The most reliable solution is to desolder the chip and read/write it separately. Failing that, disconnecting at least the Vcc pin should isolate the chip from the rest of the board and allow it to be programmed.</p>\n<p>More info and suggestions about the similar issue in PC motherboards:</p>\n<p><a href=\"https://www.flashrom.org/ISP\" rel=\"nofollow noreferrer\">https://www.flashrom.org/ISP</a></p>\n</div>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Mar 2, 2021 at 7:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Slav",
                    "text": "<span class=\"comment-copy\">The chip can't be removed from the board, unfortunately. The board itself is not powered by the programmer.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@Slav by connecting the programmer and putting current through Vcc you’re effectively powering anything connected to those pins. Sure, it won’t be the whole board, but it can be enough to interfere with the programming process.</span>",
                    "time": null
                }
            ]
        }
    ]
}