{
    "title": "Use enum for switch case values in ghidra",
    "link": "https://reverseengineering.stackexchange.com/questions/27160/use-enum-for-switch-case-values-in-ghidra",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is there a way in ghidra to change decompiled switch statement case values to their names?</p>\n<p>I'm looking at a WndProc function, with a prototype of <code>LRESULT CALLBACK WndProc(HWND hwnd, UINT msg, WPARAM wParam, LPARAM lParam)</code>. Inside the function are a number of switch statements based on the <code>msg</code> UINT, which ghidra calls <code>param_2</code>. The uint values are defined in <code>winuser.h</code>. I want to change all the spots <code>param_2</code> is compared in the decompilation so it uses the winuser.h names instead of the uint values, for example, change <code>if (param_2 != 0x100)</code> to <code>if (param_2 != WM_KEYDOWN)</code>, for all the <code>param_2</code> checks in a given function.</p>\n</div>",
    "votes": "3",
    "answers": 2,
    "views": "1k",
    "tags": [
        "ghidra"
    ],
    "user": "gr0k",
    "time": "Mar 6, 2021 at 13:44",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Found the answer here: <a href=\"https://isc.sans.edu/forums/diary/A+few+Ghidra+tips+for+IDA+users+part+2+strings+and+parameters/24848/\" rel=\"nofollow noreferrer\">IDA Tips - Strings + Parameters</a></p>\n<p>In the disassembly, right click the constant, click <code>Set Equate...</code> and select the appropriate type. You may have to load (or create and load) the appropriate gdt file first.</p>\n</div>",
            "votes": "2",
            "user": "gr0k",
            "time": "Mar 6, 2021 at 18:13",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Besides manually changing each case, with some measure of success depending on the logic for the switch, the best way is to create an <code>enum</code> type (it must be sized correctly) with all the values you'd like to see, and then cast <code>param_2</code> to that <code>enum</code> type.</p>\n<p>I don't do many Windows RE, so I'm not certain on how Ghidra has those values available currently, it might already exist in their windows libraries as an enum, though it might be a bunch of individual defines that you might to need to manually create into an <code>enum</code> to use like you're wanting.</p>\n</div>",
            "votes": "1",
            "user": "MarianD",
            "time": "Dec 7, 2021 at 17:34",
            "is_accepted": false,
            "comments": [
                {
                    "user": "gr0k",
                    "text": "<span class=\"comment-copy\">Added some more details. The type is correct, the value is UINT, and the values are all #defines coming from winuser.h. Im wondering if theres an easy way to tell ghidra those come from winuser, and apply the defines appropriately</span>",
                    "time": null
                }
            ]
        }
    ]
}