{
    "title": "In x64dbg, how to set software breakpoint on specific memory address?",
    "link": "https://reverseengineering.stackexchange.com/questions/27177/in-x64dbg-how-to-set-software-breakpoint-on-specific-memory-address",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is something I know how to do in Olly Debugger, and can't figure out how to do in x64dbg.</p>\n<p>In Olly Debugger, it's possible to set a hardware <strong>or</strong> software breakpoint, either on access or on write, to a <strong>memory address.</strong></p>\n<p>To be clear: I am referring here to <em>memory</em> breakpoints, which are set by right clicking an address in the dump window. I am <em>not</em> referring to execution breakpoints, like the INT3 breakpoints you can set in the CPU window when you hit F2.</p>\n<p>In Olly Debugger, the only practical differences between hardware and software breakpoints is that you're limited to four hardware breakpoints, and with hardware breakpoints, EIP points to the next instruction so you can't see the state of registers or memory before hitting the breakpoint.</p>\n<p>In x64dbg, it is also possible to set both hardware or software breakpoints on memory. However, in x64dbg the software memory breakpoints always apply to the <em>entire section</em> in which the memory address resides, which makes software memory breakpoints close to useless (I assume it is just using VirtualProtect to guard the whole section, then breaking on any and all access to the section.) In Olly it was possible to set an unlimited number of <em>software, not hardware,</em> memory breakpoints for an <em>individual byte</em> of memory in the dump window.</p>\n<p>Am I just dumb? Is x64dbg really missing this feature?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "6k",
    "tags": [
        "memory",
        "x64dbg",
        "dynamic-analysis",
        "breakpoint"
    ],
    "user": "tomysshadow",
    "time": "Mar 9, 2021 at 3:56",
    "comments": [
        {
            "user": "morsisko",
            "text": "<span class=\"comment-copy\">It's not possible, the \"software\" breakpoints on memory in olly are also just memory breakpoints in x64dbg, just a different name, they also work a bit different in x64dbg.</span>",
            "time": null
        },
        {
            "user": "tomysshadow",
            "text": "<span class=\"comment-copy\">I suspected that, but it's a shame. I find software breakpoints more intuitive and in Olly I only ever used hardware breakpoints as an alternative if anti-debugging code no longer made my software breakpoints useful. Everything else about x64dbg is an upgrade, but from unlimited breakpoints to four useful ones is an objective downgrade...</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Yes, it is explicitly <a href=\"https://github.com/x64dbg/x64dbg/issues/1453\" rel=\"nofollow noreferrer\">not supported</a> on the issues page, however, if you are very serious about using x64dbg, it does support writing plugins that create breakpoints and react to debugger events such as breakpoints being hit... so you could write your own plugin that does what you want.</p>\n</div>",
            "votes": "1",
            "user": "P. Private",
            "time": "Mar 9, 2021 at 6:14",
            "is_accepted": true,
            "comments": [
                {
                    "user": "tomysshadow",
                    "text": "<span class=\"comment-copy\">I'm not sure how it's implemented in Ollydbg, but I'm tempted to try and hack it in. It's the one feature I find myself missing the most.</span>",
                    "time": null
                }
            ]
        }
    ]
}