{
    "title": "Bypass USB key activation of a software",
    "link": "https://reverseengineering.stackexchange.com/questions/27201/bypass-usb-key-activation-of-a-software",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>(The software is Chinese and contains malware. I do not know if I could upload it here, so temporarily, please let me describe it)</p>\n<p>I am asked by a spa store to \"do something\" to make a software that looks like from 2003 for them to use, the name is \"Ehang skin analysis system\". The spa store gave me an usb key (a dongle usb), which they borrowed from another store, and they have to return it when they have a copy.</p>\n<p>I could not find any information about the software on google. Plus, the usb key does not appear anywhere on the computer, from emulators to rufus, not even on Linux, so that I do not figure out how to clone it, or find out if it is <code>sentinel</code> or <code>HASP</code>. So the only way is to reverse it. I am using x64dbg.</p>\n<p>The software uses VMProtect, I passed it by using Scyllahide.</p>\n<p>But I am stuck at this step, below is when I did not insert the USB key</p>\n<p>The start of the software\n<a href=\"https://i.sstatic.net/bwDvU.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/bwDvU.png\"/></a></p>\n<p>after clicking \"play\" 3 times\n<a href=\"https://i.sstatic.net/GQpAb.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/GQpAb.png\"/></a></p>\n<p>Play 4 times, please note that the pointer is at another line, <code>00478E56</code> to <code>00474E91</code>\n<a href=\"https://i.sstatic.net/tl8LY.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/tl8LY.png\"/></a></p>\n<p>Play 5 times\n<a href=\"https://i.sstatic.net/DB3Ib.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/DB3Ib.png\"/></a></p>\n<p>At the 6th play, a message appeared asks to insert USB key\n<a href=\"https://i.sstatic.net/6aBSb.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/6aBSb.png\"/></a></p>\n<p>I restarted it and insert the USB key, and at the 6th play this time, at the same line <code>0047A868</code> just like the very above, but this time the code turned into:\n<a href=\"https://i.sstatic.net/zQjWb.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/zQjWb.png\"/></a></p>\n<p>Click one more play and the software worked. Still at the same line <code>0047A868</code>\n<a href=\"https://i.sstatic.net/hqgIC.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/hqgIC.png\"/></a></p>\n<p>I have tried dozen times, but before and after inserting the USB key, everything just \"turned into\" other codes, not that they jump from code A to code B, <code>popfd</code> just turned into <code>ret</code> without any step. I have tried with <code>step into</code> and <code>step over</code> and <code>animate</code>. The pointer stand still at the same line but only the code is changed. So I do not know where to jump into the code that makes the software work.</p>\n<p>So, how to make it turn into the working code without the USB key?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "7k",
    "tags": [
        "x64dbg",
        "patching",
        "usb",
        "vmprotect",
        "dongle"
    ],
    "user": "BlackXIII",
    "time": "Jun 17, 2021 at 15:32",
    "comments": [
        {
            "user": "Abdullah Mohamed",
            "text": "<span class=\"comment-copy\">Are you able to share a dump of the USB dongle image? So basically, you plugin the USB into the computer, and from a Linux OS, you just type into a terminal <code>lsblk</code>, it should map the USB to a device file (not necessarily mount it), say it's <code>/dev/sdb</code>, you now issue the dump command <code>sudo dd if=/dev/sdb of=USBdump.bin</code> and share with us in here the <code>USBdump.bin</code> file. Also, if it's possible to share as well the software (same version you are analyzing please)?</span>",
            "time": null
        },
        {
            "user": "BlackXIII",
            "text": "<span class=\"comment-copy\">Sorry, the usb cannot be detected, even from linux. There are only <code>sda</code> (the OS partition) when I used <code>lsblk</code>, or <code>fdisk -l</code>. About the software, please download from this <a href=\"https://drive.google.com/file/d/1L2HOJHnO_AwKc529X5jnOlYDAWi8BuEk/view?usp=sharing\" rel=\"nofollow noreferrer\">link</a>. Please note that it contains virus/malware and is vmprotected, meaning before breaking the vmprotection, you cannot make it run directly on Virtual Machine or Sandbox. I am using Shadow Defender to run it.</span>",
            "time": null
        },
        {
            "user": "Abdullah Mohamed",
            "text": "<span class=\"comment-copy\">So when the USB is plugged in into the computer with the Linux OS, it's not even detected using <code>lsusb</code>?</span>",
            "time": null
        },
        {
            "user": "Abdullah Mohamed",
            "text": "<span class=\"comment-copy\">And the same USB is used and works fine when working on the Software right? That''s interesting, I'd start with analyzing the <code>Driver.exe</code> file to know how the USB interacts with the computer first then go to the Software.</span>",
            "time": null
        },
        {
            "user": "BlackXIII",
            "text": "<span class=\"comment-copy\">Yes, the usb cannot be detected anywhere and only be used to make the software work, as far as I know. About the driver, I think it is for the skin scanning camera, not driver for the usb.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>As expected, the USB was indeed detected but due that Linux has no idea how to deal with it without a proper driver, it only parses its hardware related parameters (Vendor and Product IDs) and stops there.</p>\n<p>Here are the USB device's entries in <code>usb-devices</code> and <code>lsusb</code> commands respectively:</p>\n<pre><code># usb-devices\n[...]\nT:  Bus=01 Lev=02 Prnt=05 Port=00 Cnt=01 Dev#=  8 Spd=1.5 MxCh= 0\nD:  Ver= 2.00 Cls=00(&gt;ifc ) Sub=00 Prot=00 MxPS= 8 #Cfgs=  1\nP:  Vendor=3689 ProdID=8762 Rev=02.00\nS:  Manufacturer=USBKey\nS:  Product=USBKey\nC:  #Ifs= 1 Cfg#= 1 Atr=80 MxPwr=50mA\nI:  If#= 0 Alt= 0 #EPs= 1 Cls=03(HID  ) Sub=01 Prot=00 Driver=usbhid\n[...]\n</code></pre>\n<pre><code># lsusb\n[...]\nBus 001 Device 008: ID 3689:8762\n[...]\n</code></pre>\n<p>I came to the conclusion that this is the USB device because these are the only differences between the two files <code>*with_usb*</code> and <code>*without_usb*</code> using the commands <code>lsusb</code> and <code>usb-devices</code>.</p>\n<p>So now, I would start sniffing the bytes sent from the USB to the OS as soon as the USB is plugged in, mostly won't be able to make any sense of them, but maybe writing a driver that emulates the device's communication behavior would be the quickest and easiest approach to bypass the mandatory protection policy of running the software with the USB device plugged in.</p>\n<p>For the sniffing part, you can use anything based on <code>libusb</code>, or of course a wrapper for it in any scripting language. Myself, I'm a fan of Python, so here is a little script using Python's PyUSB library:</p>\n<pre><code>#!/usr/bin/env python3\ntry:\n    import usb.core\n    import usb.util\nexcept ImportError:\n    print(\"Couldn't find 'pyusb' library!\")\n    exit(-1)\n\n# The 'Vendor' and 'Product' IDs from 'lsusb' or 'usb-devices' entries\nvendorID  = 0x3689\nproductID = 0x8762\n\n# Assuming the first interface\nusbIF = 0\n\n# Find the USB device\n# The USB must be plugged in before running the script\ndevice = usb.core.find(idVendor=vendorID, idProduct=productID)\n\n# Check if device exists\nif device == None:\n    print(\"Device doesn't exist!\")\n    exit(0)\n\n# Check if device is attached, detach it\nif device.is_kernel_driver_active(usbIF):\n    device.detach_kernel_driver(usbIF)\n\n# Now you will want to fuzz a bit the USB endpoints\n(inputCmds, outputCmds) = device[0][usbIF,0].endpoints()\n\n</code></pre>\n<p>If emulating the USB packets worked, that would be a much easier approach to work on the application without the USB device plugged in, without the need to reverse a VMProtect software.</p>\n</div>",
            "votes": "1",
            "user": "Abdullah Mohamed",
            "time": "Mar 11, 2021 at 8:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "BlackXIII",
                    "text": "<span class=\"comment-copy\">Thank you very much for your solution and enthusiastic help. I really appreciate that. But alas, it is just a little too late. A few hours ago the USB's owner needed it and had taken it back. I am so sorry, but we could not see the result of your script until I have the USB again. I will try to get it as soon as possible. Thank you again.</span>",
                    "time": null
                },
                {
                    "user": "Abdullah Mohamed",
                    "text": "<span class=\"comment-copy\">No problem. Feel free to ping me anytime in the future if you've got your hands back to the USB.</span>",
                    "time": null
                }
            ]
        }
    ]
}