{
    "title": "How to add a new CompilerSpec from a .cspec file to Ghidra?",
    "link": "https://reverseengineering.stackexchange.com/questions/27320/how-to-add-a-new-compilerspec-from-a-cspec-file-to-ghidra",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Ghidra uses <code>.cspec</code> files like <code>x86win.cspec</code> to define compiler related information, which are imported in the <code>.ldef</code> files like <code>x86.ldef</code> that define a processor language.</p>\n<p>How can I add a new <code>CompilerSpec</code> via a <code>.cspec</code> file to Ghidra without editing the existing <code>.ldef</code> file which is inherently part of the Ghidra core, but also without adding a new processor (with a new <code>.ldef</code> file)? This should also work with <code>analyzeHeadless</code>, so no just adding it in the GUI.</p>\n<p>This will probably end up requiring an extension which isn't an issue, I just don't know where to either put the file so it gets automatically loaded, or which API functions to call as part of the extension initialization to add the new <code>CompilerSpec</code>. The classes that implement the <code>CompilerSpec</code> interface have public constructors, that take the <code>.cspec</code> file as a parameter, but this doesn't look like it will be automatically added then after just creating an instance of it.</p>\n</div>",
    "votes": "5",
    "answers": 2,
    "views": "1k",
    "tags": [
        "ghidra"
    ],
    "user": "Florian Magin",
    "time": "Mar 26, 2021 at 17:13",
    "comments": [
        {
            "user": "R4444",
            "text": "<span class=\"comment-copy\">please also post this on ghidra's github page, u may get a quicker answer there.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It's not possible currently (Ghidra 9.2.2) to do what you're asking.  Each processor is identified by a 4-tuple of architecture, endianness, size, and variant.  You can only specify an ID once.  So unfortunately, you can't just add another .ldefs file somewhere and \"open up\" the language (internal name for a processor) to add new compiler spec entries and .cspec files.  This is a limitation of the way Processors are loaded by the SleighLanguageProvider.</p>\n<p><em>Aside:  I'm assuming what you want to do is, for instance, add a new compiler spec to x86:LE:32:default so that it shows up in the list along with clang, gcc and Visual Studio.</em></p>\n<p>The best you can do right now is add an Extension with a new processor that has the same architecture, endianness and size, but a different variant name.  This might have serious ramifications for future official Processor upgrades though; you'd probably have to watch the version numbers carefully and duplicate the .trans files if any.</p>\n<p>You might want to consider making your changes directly in the Processor directory, and sharing your additions with the official team.</p>\n</div>",
            "votes": "2",
            "user": "Mike J. Bell",
            "time": "Mar 28, 2021 at 16:47",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Florian Magin",
                    "text": "<span class=\"comment-copy\">In my case sharing the cspec file isn't as simple because it consists mainly of opinionated choices for callfixups that clean up ObjectiveC code. Specifically by defining callfixups for various runtime functions normally used for reference counting with <code>NOP</code>. Definitely not suitable for general use :/</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This feature will be part of Ghidra 10 according to the preliminary release notes: <a href=\"https://github.com/NationalSecurityAgency/ghidra/blob/master/Ghidra/Configurations/Public_Release/src/global/docs/WhatsNew.html#L124-L130\" rel=\"nofollow noreferrer\">https://github.com/NationalSecurityAgency/ghidra/blob/master/Ghidra/Configurations/Public_Release/src/global/docs/WhatsNew.html#L124-L130</a></p>\n<blockquote>\n<p>Extensions can be added from the <code>Specification Extensions</code> tab under the <code>Options</code> dialog for the Program.</p>\n</blockquote>\n<p>The beta is already available for download at <a href=\"https://ghidra-sre.org/\" rel=\"nofollow noreferrer\">https://ghidra-sre.org/</a></p>\n<h2>Adding new Compiler Spec</h2>\n<p>The full process is, starting from a Codebrowser window with some binary named <code>ls</code>:</p>\n<p><code>Edit - Options for 'ls'</code>\nthen this window should open, where you can click on <code>Specification Extensions</code> on the left:</p>\n<p><a href=\"https://i.sstatic.net/Jt3do.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/Jt3do.png\"/></a></p>\n<p>click <code>Import...</code> and select the file defining the extension. If you want to e.g. define a callfixup that tells the decompiler to treat some function as a <code>NOP</code> if called, you can write a file like this:</p>\n<pre><code>&lt;callfixup name=\"objc_retain\"&gt;\n    &lt;target name=\"_objc_retain\"/&gt;\n    &lt;target name=\"_objc_retainAutorelease\"/&gt;\n    &lt;pcode&gt;\n      &lt;body&gt;&lt;![CDATA[\n      x0 = x0;\n     ]]&gt;&lt;/body&gt;\n    &lt;/pcode&gt;\n  &lt;/callfixup&gt;\n</code></pre>\n<p>It seems like you can only define one extension per file, and can't import multiple files at once. Though at least in my case the actual replacement is often the same, just for different functions, so you can just add multiple targets.</p>\n</div>",
            "votes": "1",
            "user": "Florian Magin",
            "time": "Jun 2, 2021 at 15:16",
            "is_accepted": true,
            "comments": []
        }
    ]
}