{
    "title": "Cannot find audio file type",
    "link": "https://reverseengineering.stackexchange.com/questions/27356/cannot-find-audio-file-type",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to find the audio file type of <a href=\"https://we.tl/t-jwAMjq5A5g\" rel=\"nofollow noreferrer\">this file (extension wtj) around 8 minutes)</a>. I extracted it from a music box.</p>\n<p>I've tried many things:</p>\n<ul>\n<li><p>Open in Winamp and VLC =&gt; no luck</p>\n</li>\n<li><p>Open with Audacity (no luck). I tried to import as a raw audio (every format) =&gt; no luck</p>\n</li>\n<li><p>I tried the command line <code>file</code> on my mac (by the way is there any difference with the linux one?) =&gt; no luck</p>\n</li>\n<li><p>I tried <a href=\"https://superuser.com/questions/274734/how-can-i-determine-file-type-without-an-extension-on-windows\">TrId</a> =&gt; no luck</p>\n</li>\n<li><p>I tried Spek and GSpot =&gt; They cannot open the file</p>\n</li>\n<li><p>I opened it in a hex editor, this is what I have</p>\n<p>09 0D 42 F2 F6 F9 06 F6 F6 9F F6 F6 F6 FE F6 F6 FB D6 F6 F6 F7 F6 F6 F7 52 F6 F6 F6 D6 F6 F6 C2 76 F6 F6 F2 BA B7 BB B3 C5 D8 CF CF D8 C3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 BA B7 BB B3 C5 D8 CF CF D8 C3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3</p>\n<p>09 0D 42 F2 F6 F9 06 F6 F6 9F F6 F6 F6 FE F6 F6 (//the sequence starts again 41 times and then we have)</p>\n<p>09 0D 42 F2 F6 F9 06 F6 F6 9F F6 F6 F6 FE F6 F6 FB D6 F6 F6 F7 F6 F6 F7 52 F6 F6 F6 D6 F6 F6 C2 76 F6 F6 F2 BA B7 BB B3 C5 D8 CF CF D8 C3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 A3 E6 75 C2 56 0D F1 6C 84 D4 78 6C 95 40 84 2A EA 94 9B EC 15 B5 F4 3E E1 E7 82 B0 E9 34 E0 93 30 D3 F7 8E FC B6 66 D3 F3 8A F7 B6 D1 E2 D4 28 D0 9E 05 06 1E AB 77 66 AE E1 D5 20 AA 21 B4 2E D8 F8 D1 D4 74 A0 CE 06 E3 7A 64 6A 70 74 74 DF 89 E4 86 23 78 C3 26 6D 71 CD C7 9A D8 FD FC 83 ED A7 CD B1 5F FB F2 D7 5A AD 31 EC 96 D5 15 0B D6 CB F2 47 62 41 61 C1 D4 28 AA 2F 01 BC A4 67 E9 49 48 07 B9 1F E8 B0 F0 BE D1 CF CD EA 9A B5</p>\n</li>\n</ul>\n<p>The files size are between 11MB to 46 MB for something like 16 minutes and between 5MB to 18MB for the short version (8 minutes). So I guess that it is compressed. I don't think it is encrypted because in the hex version, the starting sequence is repeated 41 times (unless the encryption key length is a multiple of the starting sequence).</p>\n<p>Now I am stuck. Do you have any idea where I can dig?</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "159",
    "tags": [
        "file-format",
        "audio"
    ],
    "user": "Daniel",
    "time": "Mar 30, 2021 at 11:32",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">If you have the audio data of the music box most likely you have the music box software, too. I would check it for used libraries. Also info on the used hardware (used [audio] chips could be helpful. May be the format is used by an decoder chip.</span>",
            "time": null
        },
        {
            "user": "Daniel",
            "text": "<span class=\"comment-copy\">The data are on a SD card. The usb plug is used only to charge the box. I cannot access the software unless if I break the box.</span>",
            "time": null
        },
        {
            "user": "Maarten Bodewes",
            "text": "<span class=\"comment-copy\">And still no name of the box...</span>",
            "time": null
        }
    ],
    "answers_data": []
}