{
    "title": "What type of file has the file signature 'BOOT'?",
    "link": "https://reverseengineering.stackexchange.com/questions/27352/what-type-of-file-has-the-file-signature-boot",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a <code>.bin</code> file which I am trying to disassemble into something that I can edit. Given that binary files can contain just about any binary data, I found it difficult to assess what file data is actually in the <code>.bin</code> file.</p>\n<p>After opening my file in a hex editor, I found that the file started with the data <code>42 4F 4F 54</code>, which translates to <code>BOOT</code>. I feel like I've scoured the whole internet, but I can't find what type of file this is meant to be (I have a suspicion that the whole <code>.bin</code> file is just a renamed extension). I've even checked <a href=\"https://en.wikipedia.org/wiki/List_of_file_signatures\" rel=\"nofollow noreferrer\">this Wikipedia page</a> about file signatures to see if there was a match, but no luck.</p>\n<p>Seeing as I had no luck with manually inspecting the hex data, I turned to <a href=\"https://github.com/ReFirmLabs/binwalk\" rel=\"nofollow noreferrer\">binwalk</a>. I ran it against my file, but the only data it managed to find was the following. As you can see, it only found HPACK data which, on a quick Google search, reveals almost nothing relevant to the binary data (my Google search found some info about HPACK archive data which is relevant to the HTTP/2.0 protocol, however I am almost positive my <code>.bin</code> file is relevant in some way to firmware, as it is one of the files on my calculator's hard drive). The most relevant info I was able to find about HPACK was <a href=\"http://fileformats.archiveteam.org/wiki/HPACK_(compressed_archive)\" rel=\"nofollow noreferrer\">this wiki page</a> which specifies that the archive format was released in the 1990s, which makes more sense in relation to the age of my calculator, however still does not entirely solve my question of what the whole <code>.bin</code> file type is.</p>\n<pre><code>DECIMAL       HEXADECIMAL     DESCRIPTION\n--------------------------------------------------------------------------------\n2627058       0x2815F2        HPACK archive data\n</code></pre>\n<p>I will leave here the first 50 hex bytes of the file (parsed with <a href=\"https://hexed.it/\" rel=\"nofollow noreferrer\">HexEd.it</a>), in case it helps the identification process..</p>\n<pre><code>00000000 42 4F 4F 54:00 00 00 38|11 46 D0 08:56 33 00 01\n00000010 60 00 D0 04:FF FF FF FF|FF FF FF FF:AD 01 60 2C\n00000020 53 50 49 46:32 30 31 31|31 31 30 39:BD 03 7E 24\n00000030 48 02\n</code></pre>\n<p>I wish to gain more insight about what type of data this file contains, and if it is possible to identify what the file type is from the <code>BOOT</code> file signature. If it is possible to identify it, then what file type is the data?</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "153",
    "tags": [
        "binary-analysis",
        "file-format",
        "binary",
        "binary-format",
        "binary-diagnosis"
    ],
    "user": "Xiddoc",
    "time": "Oct 14, 2021 at 19:25",
    "comments": [],
    "answers_data": []
}