{
    "title": "Disassembly call function offset from RIP",
    "link": "https://reverseengineering.stackexchange.com/questions/27437/disassembly-call-function-offset-from-rip",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am writing a program where I map an <code>.exe</code> PE file in memory and I \"dissect\" it.\nI am disassembling the <code>.text</code> section of the target executable, using the <a href=\"https://github.com/gdabah/distorm\" rel=\"nofollow noreferrer\">distorm</a> disassembler.</p>\n<p><code>CALL</code> instructions in the disassembly have an offset relative to the <code>RIP</code> register, e.g.: <code>CALL QWORD [RIP+0xf8e]</code>.</p>\n<p>I am also reading the <code>Import Descriptor Table</code> and I can see all the function calls from various .dlls there.</p>\n<p>When using dumpbin.exe with <code>/section:.text /disasm</code> to disassemble the same target <code>.exe</code>, although it shows the same opcodes <code>ff 15 8e 0f 00 00</code>, it somehow translates this RIP offset to the proper (and correct) Win32 function being called (in my program <code>GetCurrentProcessId()</code>), <code>call qword ptr [__imp_GetCurrentProcessId]</code>.</p>\n<p>My question is how to \"map\"/resolve each <code>CALL</code> instruction that I see in my disassembly to a specific Win32 API call, like dumpbin does, since I don't run this program inside the debugger and therefore the IAT is not overwritten by the Windows loader to show the proper <code>jmp</code> instruction calling the Windows API. Is it a disassembler issue? Can I deduct this somehow using the various PE structures?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "858",
    "tags": [
        "disassembly",
        "windows",
        "pe",
        "x86-64"
    ],
    "user": "servo",
    "time": "Apr 11, 2021 at 14:49",
    "comments": [
        {
            "user": "servo",
            "text": "<span class=\"comment-copy\">As I understand so far, is that the RIP offset is actually an offset from the current instruction location \"somewhere\" (in memory? in file?), to another location \"somewhere\". Opening the target exe IDA disassembler and calculating the offset from the resolved memory location back to the call instruction, results in the RIP offset, <code>0xf8e</code> in my case.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I found a solution and gonna leave it here for future reference.</p>\n<p>First, you need to calculate the linear address (the one the binary will have in run-time) from the RIP offset of the jump. Let's say the RIP offset is <code>0x8fe</code>. You add this, and the offset of the instruction itself (offset from start of .text section) plus the instruction size and you get a number. You then have to add this number to the start of the .text section, but this time, you need to include the <code>SectionAlignment</code> in your calculation. If the RVA of the <code>.text</code> is <code>0x400</code> and the <code>SectionAlignment</code> is <code>0x1000</code>, then the start of the <code>.text</code> will be at Image Base + <code>0x1000</code>.</p>\n<p>Then you get the imported function names from the ILT <a href=\"https://docs.microsoft.com/en-us/windows/win32/debug/pe-format#import-directory-table\" rel=\"nofollow noreferrer\">Import Directory Table</a>. You do this by reading the <code>OriginalFirstThunk</code> pointer to <code>u1.Ordinal</code> and then to <code>Name</code>. For more details look <a href=\"https://docs.microsoft.com/en-us/windows/win32/debug/pe-format#import-directory-table\" rel=\"nofollow noreferrer\">here</a>.</p>\n<p>When doing this, you know the order that the imported functions are imported, per dll.</p>\n<p>Now, you need to get the <code>FirstThunk</code> RVA, which will point to a NULL location when the file isn't loaded. However, this RVA is the start of the IAT (in run-time). The size of each import is 8 bytes.</p>\n<p>For example, if you see that a <code>CALL QWORD PTR [RIP+0xf8e]</code>, you calculate this number and you get (say) <code>0x0000022D932D2008</code> which is 8 bytes from the start of the IAT, you know that this call calls the <em>second</em> imported function. Since you know the order, you know which function it is.</p>\n</div>",
            "votes": "1",
            "user": "servo",
            "time": "Apr 14, 2021 at 21:02",
            "is_accepted": true,
            "comments": []
        }
    ]
}