{
    "title": "Unable to attach into mysterious PID",
    "link": "https://reverseengineering.stackexchange.com/questions/27484/unable-to-attach-into-mysterious-pid",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a suspicious process. I found it by ProcessHacker's network tab.</p>\n<p>ProcessHacker display the process as Unknown.</p>\n<p>The process listening into a constant port number that's also not found by standard windows tools.</p>\n<p>The process id also not found by standard windows tools.</p>\n<p>Looking at Wireshark traffic, I see there is traffic going to two IPs in Russia.</p>\n<p>I attempted to attach Frida into this process but Frida reports an error like below,</p>\n<pre><code>[Error: Unexpected error allocating memory in target process (VirtualAlloc returned 0x00000005)]\n</code></pre>\n<p>I've used both 64 bit and 32 bit versions of Frida but still same error.</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "566",
    "tags": [
        "windows",
        "process",
        "frida",
        "processhacker"
    ],
    "user": "jeffbRTC",
    "time": "Apr 16, 2021 at 16:46",
    "comments": [
        {
            "user": "Happy",
            "text": "<span class=\"comment-copy\">Possibly the process is hooking functions from the Windows api, can you check if it has something low than the user level? currently taking into account Windows 10 it is not possible to hook to hide at the user level, however at the kernel level yes it is possible and yes the hacker process can detect because it has a kernel driver in its directory, only a kernel can detect a process hidden by a kernel, tell me if there is anything new or if my answer was useful, put there as a final answer.</span>",
            "time": null
        },
        {
            "user": "jeffbRTC",
            "text": "<span class=\"comment-copy\">@0x0A The computer I suspected had malware earlier and I reinstalled Windows from scratch after then. Is this sign of a bootkit? OS is Windows 10  Server Edition. From what I found in the Internet, the bootkit usage is in decline.</span>",
            "time": null
        },
        {
            "user": "jeffbRTC",
            "text": "<span class=\"comment-copy\">@0x0A I don't know what you mean by low. Can you elaborate?</span>",
            "time": null
        },
        {
            "user": "jeffbRTC",
            "text": "<span class=\"comment-copy\">@0x0A The process is invisible in task manager and only visible in Process Hacker's network tab and when I click \"Go to process\" in the Process Hacker, nothing happen.</span>",
            "time": null
        },
        {
            "user": "Happy",
            "text": "<span class=\"comment-copy\">About Bootkit / Rootkit depends on how you did the formatting of the operating system, rootkit is mod and bootkit are few that have enough knowledge to develop, referring to below I refer to the lowest part of the operating system in the theory of rings, where usermode is your manager and kernel would be a possible infected driver, about the task manager yes it is him I mean it is possible to use techniques to hide a process, a suggestion (if you want to remove that process) is to run an antivirus in boot mode operating system see kaspersky in boot.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It's not a malware. It's cygwin's ssh-agent and it uses non existent PID as parent. I was able figure this out using a new version of ProcessHacker.</p>\n</div>",
            "votes": "3",
            "user": "jeffbRTC",
            "time": "Apr 17, 2021 at 1:17",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">Parent probably was real but just exited at some point. Unlike Unix, that doesn’t lead to termination of child processes in Windows.</span>",
                    "time": null
                }
            ]
        }
    ]
}