{
    "title": "Loading a U-Boot ARM flash image into IDA Pro",
    "link": "https://reverseengineering.stackexchange.com/questions/27539/loading-a-u-boot-arm-flash-image-into-ida-pro",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a U-Boot image file which was extracted from flash memory of a board with an Hi3520D ARM CPU. I would like to load this file into IDA Pro and dig out the password that is required for accessing  the U-Boot shell so that I could flash a modified firmware back onto the board.</p>\n<p>The problem is that I don't know how to find out the values that IDA needs in the \"Disassembly memory organization\" window. I have used IDA before with normal x86 and ARM executables but binary files are new to me in this context so guidance would be greatly appreciated.\nHere is the file if it helps: <a href=\"https://www.dropbox.com/s/wyjiv6ad4zmj2ba/uboot.bin?dl=0\" rel=\"nofollow noreferrer\">dropbox link</a></p>\n<p>This is mostly a learning project so as much detail as possible would be good.</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "467",
    "tags": [
        "ida",
        "disassembly",
        "arm",
        "binary"
    ],
    "user": "nyaol9",
    "time": "Apr 23, 2021 at 20:39",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">does the vendor provide GPL source code as they're supposed to?</span>",
            "time": null
        },
        {
            "user": "nyaol9",
            "text": "<span class=\"comment-copy\">They do provide source code for u-boot but it doesn't include the password protection code at all and while I can compile the u-boot sources just fine, I cant flash it to the board because it needs some special device config files that they don't provide.</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">I mean you can probably look up the memory layout in the source code</span>",
            "time": null
        }
    ],
    "answers_data": []
}