{
    "title": "Nokia 105(TA-1114) Firmware analysis using Binwalk",
    "link": "https://reverseengineering.stackexchange.com/questions/27541/nokia-105ta-1114-firmware-analysis-using-binwalk",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First please forgive me if a make any mistake. i am not a primarily English speaker but I will try my best.\nFew days ago i started to tinkering with Nokia feature phone Nokia 105(TA-1114). I get a firmware Dump by using Miracle Box. It gave me .Bin file. with size some other files. AT this point my primary goal was extract famous Snake game From firmware and flash it to other phone(cheap Chinese type, I have few lying around) with same processor  i thought it would be easy(like i do do with android phone)\nit was not easy to find something useful about this phone. After looking at hardware I realized there is MediaTek MT6261DA processor inside this Phone, after googling and getting datasheet I have theses information:\nit is based on the 32-bit ARM7EJ-STM RISC processor, with build in gsm, gprs class 12 modem. with support for many peripherals like battery charging, keyboard scanning, camera and LCD interface literally everything you need to build a phone inside a single chip(quite amazing right?).\nNow back to firmware :\nI used binwalk to quickly analyze firmware it showed nothing result was empty. then i googled around this CPU which got me 2015 form mentioning about MediaTek proprietary compression method called Viva.\nnow firmware contain 4 files.</p>\n<ol>\n<li>ROM file called VIVA.</li>\n<li>jump table</li>\n<li>language pack</li>\n<li>and another ROM file.</li>\n</ol>\n<p>All these files have a header starting with</p>\n<blockquote>\n<p>00000000:  4D 4D 4D 01-38 00 00 00-46 49 4C 45-5F 49 4E 46 4F\nASCII: MMM 8   FILE_INFO</p>\n</blockquote>\n<p>one thing more came up with this MediaTek processor, a open source firmware that was used to reverse engineer cheap Chinese smart watches with same type of CPU's.\n<a href=\"https://github.com/xobs/fernly\" rel=\"nofollow noreferrer\">Fernvale research OS</a></p>\n<p>Now here is my Question</p>\n<ol>\n<li>do i have any chance in extracting resources from original firmware files?</li>\n<li>What is this \"Viva compression(or something else)\"?</li>\n<li>does anyone have some experience with reverse engineering MediaTek\nfirmware(not android)?</li>\n<li>what else i can do in order to get something use full.?</li>\n</ol>\n<p>please correct me if I am doing something wrong while writing this post. it is my first post here.\nand keep it in consider that computer science is not my primary field(i am Master at zoology). i am doing  this just for learning something and of course due to curiosity. i can provide files if anyone requests\nthanks</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "503",
    "tags": [
        "binary-analysis",
        "firmware",
        "binwalk"
    ],
    "user": "muhammad shahzaib",
    "time": "Apr 23, 2021 at 23:28",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">Got a link to a firmware for this or another phone with the same processor?</span>",
            "time": null
        },
        {
            "user": "muhammad shahzaib",
            "text": "<span class=\"comment-copy\">yes i can upload firmware. there is dump file straight from the device and original firmware as well.</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">Is there any ARM code in the dump? Try binwalk -A.</span>",
            "time": null
        },
        {
            "user": "muhammad shahzaib",
            "text": "<span class=\"comment-copy\">nothing shows up. i tried that too. but with another firmware from different manufacturer (same chipset) i can see there is ARM Instruction code. i ran a entropy analysis and i thing files are someway encrypted.</span>",
            "time": null
        }
    ],
    "answers_data": []
}