{
    "title": "How to view the content of a file before it is written?",
    "link": "https://reverseengineering.stackexchange.com/questions/2761/how-to-view-the-content-of-a-file-before-it-is-written",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've got a process that writes to a file (database). In process monitor I see <code>WriteFile</code>. After this I see the file is about to be either written or updated (offset:length).</p>\n<p>How can I reveal the content that is about to be written or updated in this file using Ollydbg?\nIs there a tutorial or something similar? And how to specify the function on Ollydbg? </p>\n<p>In process monitor, I see <code>WriteFile</code>, but in Ollydbg, what is the function?</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "689",
    "tags": [
        "windows",
        "debuggers"
    ],
    "user": "studentofmp",
    "time": "Sep 7, 2013 at 7:10",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can have a look at <a href=\"http://www.woodmann.com/collaborative/\" rel=\"nofollow noreferrer\">Woodmann</a> or <a href=\"http://tuts4you.com/\" rel=\"nofollow noreferrer\">tuts4you</a> if you need tutorials. And if you want to see what is writes you will have to have where the pointers are stored for the function in question.</p>\n<p>This has a lot to do with calling conventions, <a href=\"https://stackoverflow.com/questions/6511096/cdecl-or-stdcall-on-windows\">cdecl and stdcall</a> and knowing about them is important for this..</p>\n<p>I am going to try to explain using the writeFile function.</p>\n<h2>How does WriteFile Work</h2>\n<p>First we look at the WriteFile declaration (taken from <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/aa365747(v=vs.85).aspx\" rel=\"nofollow noreferrer\">MSDN</a>)</p>\n<pre><code>BOOL WINAPI WriteFile(\n  _In_         HANDLE hFile,\n  _In_         LPCVOID lpBuffer,\n  _In_         DWORD nNumberOfBytesToWrite,\n  _Out_opt_    LPDWORD lpNumberOfBytesWritten,\n  _Inout_opt_  LPOVERLAPPED lpOverlapped\n);\n</code></pre>\n<p>Now when we assume that Windows has stdcall (win32api has). We can figure out where we can find the variables. (for more about the stdcall see <a href=\"http://en.wikipedia.org/wiki/X86_calling_conventions#stdcall\" rel=\"nofollow noreferrer\">Wikipedia</a>).</p>\n<p>Due to our wikipedia article we a few things:</p>\n<ul>\n<li>The parameters are pushed onto the stack in right-to-left order</li>\n<li>Registers EAX, ECX, and EDX are designated for use within the function. </li>\n<li>Return values are stored in the EAX register.</li>\n<li>stdcall is the standard calling convention for the Microsoft Win32 API.</li>\n</ul>\n<h2>This is great</h2>\n<p>Now we have everything we need to figure out where we can find the location of the information you need.\nWhen a breakpoint is placed on the function call you'll know that all the variables are stored on the stsck. LPCVOID is a Pointer, all that is left is to follow it and read the data.</p>\n</div>",
            "votes": "4",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": true,
            "comments": [
                {
                    "user": "studentofmp",
                    "text": "<span class=\"comment-copy\">really thanks for your efforts just two thinks to know 1- what u means the returned values are stored in EAx do u mean that this values will be used by writefile ?  2-what is LPCVOID?</span>",
                    "time": null
                },
                {
                    "user": "Stolas",
                    "text": "<span class=\"comment-copy\">@studentofmp From one of the supplied links: If the function succeeds, the return value is nonzero (TRUE). So when the write is successful the eax register is non-zero.</span>",
                    "time": null
                },
                {
                    "user": "studentofmp",
                    "text": "<span class=\"comment-copy\">i have set a breakpoint on the exact address just before the writefile function whene i hold \"F8\" to setp into ... in the process monitor \"the writefile appears\" but EAX = 0 where can i see the EAX value? thanks</span>",
                    "time": null
                },
                {
                    "user": "studentofmp",
                    "text": "<span class=\"comment-copy\">thanks i have seen the full assci but now how can i edit this content before it will be written ? shoul be the last question</span>",
                    "time": null
                }
            ]
        }
    ]
}