{
    "title": "AndroGuard equivalent for iOS",
    "link": "https://reverseengineering.stackexchange.com/questions/2766/androguard-equivalent-for-ios",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am doing a research project where I want to look at apps that create or extends certain classes. For Android I am using the Androguard project which provide a large set of great tools for inspecting APK files and also comes with an API which I can use to extend it with my own code.</p>\n<p>I was wondering if there's anything similar available for iOS apps?</p>\n</div>",
    "votes": "6",
    "answers": 1,
    "views": "501",
    "tags": [
        "tools",
        "ios"
    ],
    "user": "Christoffer Reijer",
    "time": "Sep 8, 2013 at 13:10",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>As far as I know there are no tools for exploring and interacting with .IPA files like Androguard for.APK files, but since the .IPA is essentially a zip, you can unzip and analyze the key components individually.</p>\n<p>Key components of the file and associated tools include:</p>\n<p><strong>Mach-O</strong></p>\n<p>The Mach-O file contains the executable code. This executable is encrypted inside the .ipa file unless it has been dumped and rebuilt from a rooted device. Once dumped and rebuilt the functions, strings, etc. can be viewed with IDA Pro. Objective C can be hard to follow so plug-ins like <a href=\"https://github.com/zynamics/objc-helper-plugin-ida\" rel=\"nofollow\">https://github.com/zynamics/objc-helper-plugin-ida</a> can be helpful. Also, check out otool and class-dump <a href=\"http://www.codethecode.com/projects/class-dump/\" rel=\"nofollow\">http://www.codethecode.com/projects/class-dump/</a> .</p>\n<p><strong>Plists</strong></p>\n<p>For gathering interesting information I have found the plists (especially iTunesMetadata.plist and the Info.plist). Plists found in the .ipa will either be in a readable XML format or a binary format. To convert binary to readable XML use Apple's plutil(1) or plutil.pl.</p>\n</div>",
            "votes": "4",
            "user": "Cory Adams",
            "time": "Sep 21, 2013 at 3:33",
            "is_accepted": true,
            "comments": []
        }
    ]
}