{
    "title": "IDA analysing a PE file now for 7 days+",
    "link": "https://reverseengineering.stackexchange.com/questions/27804/ida-analysing-a-pe-file-now-for-7-days",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So i am pretty new to IDA (64bit) / reverse engineering and i got a few questions. Currently i have IDA pro 7.5 on Windows 10.</p>\n<p>First question: I am currently analysing a dumped (bypassed the anti debugger with a modified version of Scylla dumper) PE exe 64bit file wich is ca. 500MB (over 500K functions) for now straight 7 days and i dont think its getting to an end. (MetaPC and Intel 80x86, Manual load with imagebase 0)</p>\n<p>IDA always loops at the same place (20K Functions / Unexplored Data), im assuming thats because of a StackCookie with a GS Check. The error list is big. I even tried to open a copy from the same dump but first unpack it with the Manual reconstruct unpacker, wich crashed with an error message bad index file. After that it looped at the same position.</p>\n<p>Should i Undefine the part where IDA is looping, so atleast it can finish the Auto-Analysis? Or is there a way to force the analysis to finish? Im open for a completly diffrent solution.</p>\n<p>Second question:</p>\n<p>My Hardware is pretty good, 32GB Ram M.2 2TB Samsung EVO i7 10700k boosted to 5GHZ etc.. but my IDA is only using 9% of my CPU and 1.5GB Ram. Is it possible to allow IDA to use more power? Do u have to slice the dump into diffrent segments and load it into seprate IDA's windows? so i can extend the memory footprint. Already closed all windows except the Output window.</p>\n<p>If you need more Information im open to deliver. Thanks :)</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "852",
    "tags": [
        "ida"
    ],
    "user": "david9087",
    "time": "Jun 5, 2021 at 23:36",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The first one sounds like a bug. First, update to 7.6 to see if the issue has been fixed there. If it hasn't, use <code>Help-&gt;Report a bug or an issue</code> to send the database to Hex-Rays so they can diagnose the issue. You're not going to get any sort of bug fix for 7.5 after 7.6 has been released.</p>\n<p>As for the second one, no. Autoanalysis is currently still single-threaded AFAIK, meaning that the 9% CPU percentage being reported is just one of your cores being maxed out, and you can't make it use the others.</p>\n</div>",
            "votes": "2",
            "user": "Rolf Rolles",
            "time": "Jun 6, 2021 at 1:55",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Orwellophile",
                    "text": "<span class=\"comment-copy\">Not necessarily a bug, I use IDA against 50-60mb executables regularly, and it really is quite slow.  There's also a really bad (1-5 second) lag while jumping between locations in the assembly view.  Otherwise, agreed obviously.  I often glance longingly at <a href=\"https://www.cpubenchmark.net/singleThread.html\" rel=\"nofollow noreferrer\">cpubenchmark.net/singleThread.html</a> and wish for a Ryzen.</span>",
                    "time": null
                }
            ]
        }
    ]
}