{
    "title": "Reverse engineering Roland TR-8S kit file format .t8k",
    "link": "https://reverseengineering.stackexchange.com/questions/27837/reverse-engineering-roland-tr-8s-kit-file-format-t8k",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to figure out the file format that the Roland TR-8S drum machine uses for importing/exporting drum kits. My goal is to replace the sample (PCM) data within a kit. It's a proprietary binary format and files have the extension <code>.t8k</code>. Here's what I have figured out so far:</p>\n<p>The format consists of multiple sections that start with a four character magic code each (<code>NAME</code>, <code>TONE</code>, <code>WAVE</code>, <code>SMPL</code> etc.). I'm focusing on the <code>SMPL</code> section first. Here is an example:</p>\n<pre><code>00000868  53 4d 50 4c 00 00 02 00  cd cd e8 7e 3c db dc dd  |SMPL.......~&lt;...|\n00000878  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|\n*\n00020878  53 4d 50 4c 00 00 02 00  cd cd e8 7e 3c db dc dd  |SMPL.......~&lt;...|\n</code></pre>\n<p>After the 4 byte magic code there is a 32bit value (0x20000) that indicates the length of the PCM data which starts at 0x878. The PCM data is all zeros in this example. If the original sample data is shorter than 0x20000 it will get padded with zeros.</p>\n<p>The next four bytes (<code>cd cd e8 7e</code>) is a CRC32 of the whole PCM data (0x20000 zeros in the example).</p>\n<p>The four bytes after the CRC32 (<code>3c db dc dd</code>) are unknown. They change whenever the whole zero padded block of PCM data changes. Like the CRC32, they do not change if only the number of zero padding bytes changes, and they do not seem to be affected by factors outside of the <code>SMPL</code> block. If the values of these bytes are incorrect, importing the kit into the drum machine fails with a generic error message.</p>\n<p>I have tried <a href=\"https://reveng.sourceforge.io/\" rel=\"nofollow noreferrer\">CRC RevEng</a> but it did not find an algorithm. Also, it seems unlikely that the unknown bytes are an additional CRC.</p>\n<p>What might be the purpose of these four unknown bytes? Is there a method that can help me find out?</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "390",
    "tags": [
        "binary-analysis",
        "file-format",
        "crc",
        "binary-diagnosis",
        "unknown-data"
    ],
    "user": "Michael Ganß",
    "time": "Jun 14, 2021 at 18:22",
    "comments": [
        {
            "user": "Reino",
            "text": "<span class=\"comment-copy\">Did this reverse engineering operation yield any results? I'm looking for a way to manually change the user sample categories that are stored in this file</span>",
            "time": null
        },
        {
            "user": "Michael Ganß",
            "text": "<span class=\"comment-copy\">Yes, this resulted in a kit creator web application that you can access for free at <a href=\"https://baza.run/kits\" rel=\"nofollow noreferrer\">baza.run/kits</a>. Here's a review at CDM: <a href=\"https://cdm.link/2021/10/this-beta-web-tool-lets-you-drag-and-drop-samples-into-roland-tr-8s-6s-kits-free/\" rel=\"nofollow noreferrer\">cdm.link/2021/10/…</a></span>",
            "time": null
        },
        {
            "user": "qel",
            "text": "<span class=\"comment-copy\">The webapp isn't going to help, but when you import a kit it saves the samples, so you can manually create a new kit and put the samples wherever you want.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>After having unsuccessfully looking for complicated things I tried to think like a software developer and I found this:</p>\n<p>CRC32 of \"534d504c00000200cdcde87e\" = 0xdddcdb3c</p>\n</div>",
            "votes": "2",
            "user": "Gordon Freeman",
            "time": "Jun 15, 2021 at 15:40",
            "is_accepted": true,
            "comments": []
        }
    ]
}