{
    "title": "How can I replace bitmaps & pictures that are defined inside a Windows Form? (Win32 Delphi x86)",
    "link": "https://reverseengineering.stackexchange.com/questions/27892/how-can-i-replace-bitmaps-pictures-that-are-defined-inside-a-windows-form-wi",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I understand that this may seem like a really obvious question, but bear with me.</p>\n<p>I have this compiled game executable written in Borland Delphi 2010, it is based on the Win32 platform and is compiled in x86. It uses Windows Forms for the UI.</p>\n<p>I searched heavily and used Resource Hacker and IDR to go through the program. Both seemed to detect all Windows Forms really well (IDR a little bit better) and I am able to view the raw structures here:</p>\n<p><a href=\"https://i.sstatic.net/GRTcOl.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/GRTcOl.png\"/></a></p>\n<p><a href=\"https://i.sstatic.net/AzwPyl.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/AzwPyl.png\"/></a></p>\n<p>There are two types of definition in here: <code>Picture.Data</code> &amp; <code>Bitmap</code>. It seems that both are slightly different formats although they are still Bitmaps.</p>\n<p>Here is an example form with Bitmap (form_menu): <a href=\"https://pastebin.com/raw/r81sJRyq\" rel=\"nofollow noreferrer\">https://pastebin.com/raw/r81sJRyq</a></p>\n<p>Here is an example form with Picture.Data (form_submenu): <a href=\"https://gist.githubusercontent.com/sjain882/d33e261480d0f13c442ffb4b84d1d1ed/raw/0d188b2ed1673757e512236672c6b0c458ea74d1/form_submenu.txt\" rel=\"nofollow noreferrer\">https://gist.githubusercontent.com/sjain882/d33e261480d0f13c442ffb4b84d1d1ed/raw/0d188b2ed1673757e512236672c6b0c458ea74d1/form_submenu.txt</a></p>\n<p>Scroll down to the <code>Bitmap</code> or <code>Picture.Data</code> area. Here there is an ASCII representation of the image in hex. It turns out Delphi has its own custom image headers, and this differs between Bitmap and Picture.Data (the latter being <code>07 54 42 69 74 6D 61 70</code>).</p>\n<p>However, this is the header for the whole thing, which is a bunch of bitmaps clumped together it seems, in one {} bracketed area. The bitmaps themselves have the normal headers of <code>42 4D</code>.</p>\n<p>So... given all this information, I opened the assembly in IDA Pro and searched for these headers, many different types, different lengths. But all I found was this:</p>\n<p><a href=\"https://i.sstatic.net/op0xy.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/op0xy.png\"/></a></p>\n<p>Given whats right after this \"header\" i believe its just some string, highly doubt its an actual bitmap.</p>\n<p>So, this makes me think that the Windows Forms have their own encoding somewhere, instead of just storing raw bitmaps.</p>\n<p>Is there a good way of replacing these? I would be really grateful for any ideas. I came across <a href=\"https://reverseengineering.stackexchange.com/questions/22268/how-can-one-replace-bitmap-image-inside-exe\">How can one replace bitmap (image) inside exe?</a>, but nothing much came of it...</p>\n<p>It would also be brilliant if I could change the entire windows forms (like dimensions of boxes etc) and the image formats, to allow for transparancy / alpha!</p>\n<p>Thanks in advance!</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "205",
    "tags": [
        "delphi"
    ],
    "user": "sjain668",
    "time": "Jun 24, 2021 at 14:27",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">Delphi uses a complete own way to generate forms. The easiest way would be to get yourself a Delphi version and create a mini app that contains a Bitmap element on a Form . In the form designer load the desired image into the Bitmap element and save the project. AFAIR the resources of the form will be saved in the same format as used in the EXE, so you can decode it and extract the Bitmap blob of the image you want to use.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Delphi used not “Windows Forms” (a .Net framework) but a custom UI framework called VCL (Visual Component Library). The forms use a format called DFM and there exist editors that can extract and edit them, for example <a href=\"https://www.mitec.cz/dfm.html\" rel=\"nofollow noreferrer\">DFM Editor</a>.</p>\n<p>If you want to edit them manually, you can find out how the forms are serialized in the VCL sources (IIRC <code>streams.pas</code>). The bitmap data is probably stored as raw pixels, without any headers (metadata like width/height is provided by the form description) which is why you don’t find the signature.</p>\n</div>",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "Jun 27, 2021 at 21:10",
            "is_accepted": true,
            "comments": [
                {
                    "user": "sjain668",
                    "text": "<span class=\"comment-copy\">Thanks for the corrections &amp; extra info. Just tried out DFM Editor and its brilliant. For the serialisation of the forms, I was wondering where I could find the Visual Component Library sources? I had a good look on GitHub, google and other sites. I'm assuming this is something within the RAD Editor?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@sjain668 VCL source is shipped with the full versions of Delphi/C++ Builder. It's not \"open source\" but \"source available to customers\".</span>",
                    "time": null
                }
            ]
        }
    ]
}