{
    "title": "Unknown binary format (.scp) - No Header",
    "link": "https://reverseengineering.stackexchange.com/questions/27922/unknown-binary-format-scp-no-header",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I hope everyone is doing well. I've recently been trying to decode the structure of some files that contain a lot Unicode-8 IIRC characters, with a mix of binary. When I put it into IDA, I can't seem to find any header to identify if it's compressed, etc. I'm no professional at reverse engineering and was wondering if anyone could help me decode this file, or maybe help get me started. Thank you, and help is appreciated!</p>\n<p>Link to some example files, try anyone that you think would be a good start:\n<a href=\"https://mega.nz/folder/v00wGSgL#B7rUo4uj12E10a3jFiH8AQ\" rel=\"nofollow noreferrer\">.SCP Files</a></p>\n<p>Here is what it looks like in IDA if you are wondering:\n<a href=\"https://i.sstatic.net/777oI.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/777oI.png\"/></a></p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "134",
    "tags": [
        "ida",
        "binary-analysis",
        "hex",
        "game-hacking",
        "unknown-data"
    ],
    "user": "Kevin",
    "time": "Jun 30, 2021 at 3:46",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE. I thought it could be <a href=\"https://www.cbmstuff.com/downloads/scp/scp_image_specs.txt\" rel=\"nofollow noreferrer\">a SuperCard Pro dump</a>, 010 Editor has a template for these, with the description \"SuperCard Pro dump file format based on official format document.\" Never dabbled with the format, though, so just a guessed based on the extension. However, in that case we should see <code>SCP</code> as the first three bytes. Have you tried <code>file</code> (libmagic) on it?</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">IDA is intended for disassembly of executable code, not data files, although you could use it as such in a pinch. Try disassembling the game’s executable instead and look for code which parses these files.</span>",
            "time": null
        }
    ],
    "answers_data": []
}