{
    "title": "Need help understanding the flow of a python script on github repository",
    "link": "https://reverseengineering.stackexchange.com/questions/27986/need-help-understanding-the-flow-of-a-python-script-on-github-repository",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"https://www.opendronemap.org\" rel=\"nofollow noreferrer\">OpenDroneMap</a> is an open source command line toolkit to generate maps, point clouds, 3D models and DEMs from drone, balloon or kite images, here's their github link <a href=\"https://github.com/OpenDroneMap/ODM\" rel=\"nofollow noreferrer\">OpenDroneMap/ODM</a></p>\n<p>Was pointed out to a file <a href=\"https://github.com/OpenDroneMap/ODM/blob/master/stages/odm_app.py\" rel=\"nofollow noreferrer\">ODM/blob/master/stages/odm_app.py</a>, which seems to have the <code>Initializes the application and defines the ODM application pipeline stages</code>.</p>\n<p>How to I go about understanding the the entire process flow of the entire pipe line?</p>\n<p>I understand that UML (Unified Modelling Language) can be used as a first step.</p>\n<p>What would be the best approach?</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "37",
    "tags": [
        "python"
    ],
    "user": "Santhosh Dhaipule Chandrakanth",
    "time": "Jul 12, 2021 at 14:10",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">When it comes to python understanding what a code actually does can be pretty hard as Payton has not static types. Therefore the best understanding you can get when using step-by-step debugging on the relevant parts you are interested in. Make very tiny example and process it while you are watching it in the debugger. A nice GUI like PyCharm may be helpful for debugging and inspecting. Load your project into PyCharm and execute it in debug mode and use breakpoints where you don't understand something.</span>",
            "time": null
        }
    ],
    "answers_data": []
}