{
    "title": "Dalvik Byte code instrumentation framwork for dynamic data dependency analysis",
    "link": "https://reverseengineering.stackexchange.com/questions/2808/dalvik-byte-code-instrumentation-framwork-for-dynamic-data-dependency-analysis",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am looking forward to having your input regarding the availability of any tool that can do instrumentation in byte code level run-time, so that data dependency analysis can be carried out? Such tool exists for x86 binaries, such as <a href=\"http://software.intel.com/en-us/articles/pin-a-dynamic-binary-instrumentation-tool\">Pin</a>.</p>\n<p>Also i would like to know your precious input regarding tools to run static analysis by instrumenting dalvik byte code.</p>\n</div>",
    "votes": "6",
    "answers": 1,
    "views": "644",
    "tags": [
        "debuggers",
        "compilers",
        "android",
        "byte-code",
        "instrumentation"
    ],
    "user": "P basak",
    "time": "Sep 19, 2013 at 9:15",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"http://www.sable.mcgill.ca/soot/\" rel=\"nofollow\">Soot</a> can give you a Jimple IR of an <code>apk</code> and inject instrumentation into it. It's not dynamic though, although I don't see why it couldn't be used for data dependency analysis. Unless your target app does weird things with reflection or JNI you should still be able to perform the analysis you want.</p>\n<p>There's a tutorial on using <a href=\"http://www.bodden.de/2013/01/08/soot-android-instrumentation/\" rel=\"nofollow\">Soot with Dalvik executables</a> that covers getting started - you'll probably need to build Soot from the repository to get the <code>dex</code> functionality; there's a tutorial on getting it running <a href=\"http://www.abartel.net/dexpler/\" rel=\"nofollow\">here</a>.</p>\n</div>",
            "votes": "3",
            "user": "Mathew Hall",
            "time": "Sep 19, 2013 at 10:46",
            "is_accepted": false,
            "comments": [
                {
                    "user": "P basak",
                    "text": "<span class=\"comment-copy\">Hi actually I need to carry on dynamic slicing on byte codes, i previously implemented the algorithm on x86 binaries using Pin. Now was wondering whether the same can be used in dalvik byte code, actually what I need is the execution trace of the instructions carried out by the VM.</span>",
                    "time": null
                }
            ]
        }
    ]
}