{
    "title": "Disassemble, edit and re-assembly iOS ipa apps",
    "link": "https://reverseengineering.stackexchange.com/questions/2814/disassemble-edit-and-re-assembly-ios-ipa-apps",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to get jailbreak statistics for a University project related to security in mobile devices. My purpose is to disassemble, add a sample code and re-assemble to obtain a runnable iOS app again.</p>\n<p>I have read a lot about IDA, IDA pro, HEX-Rays, and o'tool to disassemble an ipa file.</p>\n<p>Since i'm working with a macbook pro, i think that using otool to disassemble an '.ipa' file is the best and faster way. I have tried it with a non-signed <code>.ipa</code> and I have obtained the assembly code.</p>\n<p>Then, I have difficulties. I have tried to create a new Xcode project, import this assembly code and try to compile it to generate a new app, without inserting new code just to simplify the process.</p>\n<p>But when i tried to compile, Xcode fails in every single code line.</p>\n<p>I think that my problem is, that the process described:</p>\n<ol>\n<li>Disassemble with otool</li>\n<li>Import the code in XCode</li>\n<li>Compile and build</li>\n<li>Obtain the new app</li>\n</ol>\n<p>Is not correct.</p>\n</div>",
    "votes": "6",
    "answers": 2,
    "views": "23k",
    "tags": [
        "disassembly",
        "assembly",
        "ios"
    ],
    "user": "swoken",
    "time": "Sep 20, 2013 at 21:11",
    "comments": [
        {
            "user": "swoken",
            "text": "<span class=\"comment-copy\">I was trying to add some functionality, but the solution of edit in HEX, is not good for add code. I was thinking to create my own code in XCode, compile and add it to the main program, but i think this will not work because my program will use memory positions that are already used in the main program. Thank you</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You won't be able to rebuild with XCode. You'd need to patch the decrypted app with a hex editor in order to make your desired changes.</p>\n<p>See <a href=\"http://www.minecraftforum.net/topic/1363777-how-to-make-mods-for-ios/\" rel=\"noreferrer\">http://www.minecraftforum.net/topic/1363777-how-to-make-mods-for-ios/</a> for a sample walkthrough.</p>\n</div>",
            "votes": "6",
            "user": "Jason Geffner",
            "time": "Sep 20, 2013 at 14:00",
            "is_accepted": true,
            "comments": [
                {
                    "user": "swoken",
                    "text": "<span class=\"comment-copy\">Hello Jason, I have seen in that forum the way to edit some things changing values in HEX after decrypting the code. I was trying to add some functionality, but this way to edit HEX is really hard to add code. I was thinking to create my own code in XCode, compile and add it to the main program, but i think this will not work because my program will use memory positions that are already used in the main program. Thank you</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<h3>Depending on your need</h3>\n<p>If you need to <strong>change the behavior of Objective-C</strong> (possibly also Swift) <strong>methods or classes</strong>, it is way easier to <strong>create a tweak</strong> for the app. There are also many advantages in doing so, one of them being that a tweak can be un/-installed easily at a large scale (just create a source for Cydia with your tweak).</p>\n<p>Note that if you need a one-time and <em>non permanent</em> change, consider using <strong>Cycript</strong> instead. It is really straightforward (cycript.org). Just inspect the target app's headers with <em>Clutch</em> and <em>class-dump-z</em> in order to have an idea of what you want to modify and you're good to go.</p>\n<h3>Creating a tweak</h3>\n<p>In order to create a tweak, you can use <a href=\"http://www.iosopendev.com\" rel=\"nofollow noreferrer\"><strong>iOSOpenDev</strong></a> (and its <a href=\"http://iphonedevwiki.net/index.php/Logos\" rel=\"nofollow noreferrer\"><em>Logos</em></a> template) or <strong>Theos</strong>. iOSOpendev allows you to create your tweak in Xcode and install it to your device, making it really convenient to use.</p>\n</div>",
            "votes": "0",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}