{
    "title": "Is the output of the gcc compilers the same for all ARM platforms?",
    "link": "https://reverseengineering.stackexchange.com/questions/2818/is-the-output-of-the-gcc-compilers-the-same-for-all-arm-platforms",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Trying to understand how the code is converted in ARM platform from code to binary. Are the gcc compilers used in the different ARM platforms (iOS, Android, Blackberry) the same compiler, except that the header and library files are different? Or are they totally different compilers?</p>\n</div>",
    "votes": "5",
    "answers": 2,
    "views": "521",
    "tags": [
        "arm"
    ],
    "user": "tuckmeng",
    "time": "Sep 21, 2013 at 0:32",
    "comments": [
        {
            "user": "ixje",
            "text": "<span class=\"comment-copy\">iOS used to be mainly GCC, nowadays its LLVM+Clang.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>While the \"GCC compiler\" may be the same software (generally speaking), the specific instances used for compiling code here and there can produce quite different output.</p>\n<ol>\n<li>when compiling GCC itself, you can set <a href=\"http://gcc.gnu.org/install/configure.html\">hundreds of options</a>, many of them influencing the generated code.</li>\n<li>even after building the compiler, every specific compile may use additional options, such as the target chip or architecture level, or specific optimization settings, which will again change the output.</li>\n<li>in addition to the mainline, official GCC from GNU, there are various forks from different organizations: Linaro GCC, Apple GCC, CodeSourcery GCC, BlackBerry GCC (qcc) and so on. Many of them have custom optimizations or other changes which affect output.</li>\n<li>even the mainline GCC sometimes has quite drastic changes from one version to another.</li>\n<li>the interfaces and executable formats may be different for different platforms, which will also affect the result. Android/Linux uses ELF while iOS has Mach-O. These two have different ideas about how things like shared libraries work.</li>\n</ol>\n<p>So, in short: no, the output is almost never the same. </p>\n</div>",
            "votes": "10",
            "user": "Igor Skochinsky",
            "time": "Sep 21, 2013 at 13:25",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are several different <a href=\"http://en.wikipedia.org/wiki/Calling_convention\">calling conventions</a> around on ARM platforms. They vary both according to the processor features (for example, on processors with floating point registers (VFP), it's more efficient to pass floats around in them, but you lose compatibility with processors without VFP) and according to the operating system.</p>\n<p>A given installation of an operating system defines one calling convention that all programs must use: the calling convention used by the standard library. Occasionally there may be more than one calling convention on a given system; this requires copies of all libraries for each calling convention.</p>\n<p>The Android <a href=\"http://developer.android.com/tools/sdk/ndk/index.html\">NDK</a> comes with a toolchain including a C compiler (a version of GCC). This version of GCC is set up for Android's calling convention. There is a separate toolchain for the kernels (the kernel doesn't need to use the same conventions since there are no direct function calls between userland programs and the kernel).</p>\n<p>iOS has several calling conventions for different processor versions. They are described in the <a href=\"https://developer.apple.com/library/ios/documentation/Xcode/Conceptual/iPhoneOSABIReference/iPhoneOSABIReference.pdf\">iOS ABI function call guide</a>.</p>\n</div>",
            "votes": "6",
            "user": "Gilles 'SO- stop being evil'",
            "time": "Sep 21, 2013 at 1:16",
            "is_accepted": false,
            "comments": []
        }
    ]
}