{
    "title": "Which IDA Pro Signature should be used for Borland Delphi 6.0-7.0 binaries as reported in PEiD?",
    "link": "https://reverseengineering.stackexchange.com/questions/2873/which-ida-pro-signature-should-be-used-for-borland-delphi-6-0-7-0-binaries-as-re",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am currently reverse engineering a binary written in Borland Delphi 6.0-7.0 as reported by PEiD. Is there a recommended signature to use when looking at this binary in IDA Pro? I currently am using the bds signature.  Thanks !</p>\n</div>",
    "votes": "18",
    "answers": 3,
    "views": "15k",
    "tags": [
        "disassembly",
        "ida",
        "malware"
    ],
    "user": "b_r0g",
    "time": "Oct 3, 2013 at 12:35",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It is important to understand that PEiD could potentially be identifying the wrong version of Delphi. While Delphi 6/7 are very similar (and frankly, all the way up to Delphi 2007 are very similar), you may be looking at a binary created with Delphi 2009 or newer. </p>\n<p>This is relevant because <a href=\"http://edn.embarcadero.com/article/38980\" rel=\"nofollow noreferrer\">Delphi 2009 introduced native unicode string support</a> and mapped the generic type <code>string</code> to <code>UnicodeString</code>, by default, which can affect string analysis. Delphi 2007 and earlier did not have native support for unicode strings.</p>\n<p>To complicate things slightly more, Delphi XE2 added 64-bit compilation support. So when dealing with a newer Delphi compiled binary, this may be relevant. (Delphi releases have been called Delphi 1-7, 2005, 2006, 2007, 2009, 2010, XE, XE2, XE3, XE4, and the latest is XE5). BDS stands for \"Borland Developer Studio\", although Delphi was later known as CodeGear Delphi and is now officially known as Embarcadero Delphi.</p>\n<p>There's <a href=\"https://stackoverflow.com/a/8460108/12458\">also this great answer on StackOverflow</a> that covers the differences between different Delphi versions.</p>\n<p>And in fact, on the <a href=\"http://www.itwriting.com/blog/5966-embarcadero-adopts-open-source-clang-for-future-c-versions.html\" rel=\"nofollow noreferrer\">Delphi and C++ Builder roadmap is a plan to move the Delphi compiler to Clang/LLVM</a> (their iOS and Android compilers are currently using LLVM, but not the Windows compilers...yet). So store that bit of trivia away for future decompilation...</p>\n<p>I looked at <a href=\"http://tuts4you.com/download.php?view.3518\" rel=\"nofollow noreferrer\">\"Detect it Easy\" v0.78</a>, <a href=\"http://www.rdgsoft.8k.com/\" rel=\"nofollow noreferrer\">RDG Packer Detector v0.7.1</a>, PEid, and <a href=\"http://exeinfo.atwebpages.com/\" rel=\"nofollow noreferrer\">Exeinfo PE</a> 0.0.3.4 Beta, and I found that <strong><em>only</em> Exeinfo PE could detect my Delphi 2010 compiled executable correctly</strong>:\n<img alt=\"enter image description here\" src=\"https://i.sstatic.net/RFzll.jpg\"/></p>\n<p><strong>On to the analysis</strong>. Once you've determined the correct Delphi compiler, things are often easier. Delphi GUI programs use a GUI framework called the 'VCL' (Visual Component Library). Its easy to look for the appropriate FLIRT signature by simply filtering on VCL:\n<img alt=\"enter image description here\" src=\"https://i.sstatic.net/aq8yT.jpg\"/></p>\n<p>Additionally, I like to also filter the FLIRT signatures on BDS as well. When looking at Delphi binaries I usually will add in the \"Extra atl/ie library\" and the \"win32 runtime\".</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/JBxDj.jpg\"/></p>\n<p>And finally, because Delphi creates native Windows binaries, I always make sure the mssdk32 FLIRT signature is added as well.</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/NcbAd.jpg\"/></p>\n<p>Good luck!</p>\n<p><strong>UPDATE</strong></p>\n<p><a href=\"http://ntinfo.biz/\" rel=\"nofollow noreferrer\">Detect It Easy v0.79 and newer</a> can correctly detect Delphi versions up through XE6</p>\n</div>",
            "votes": "17",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Signature you are referring to are <strong>Fast Library Identification and Recognition Technology</strong>, which is know as <strong>FLIRT</strong>. IDA ships wit most common Windows compilers, plus several non-Windows signatures. </p>\n<p>When binary is opened, IDA will try to apply <em>start up</em> signature files. Evidently, the entry point of the code is indicative enough to be able to identify complier used for given binary. If IDA successfully determines compiler used for stated binary, then it will load the signature files for corresponding compiler libraries and apply it to the remainder of the code. </p>\n<p>The signatures that IDA come with are for the most part associated with proprietary compilers such as Microsoft's Visual C++ and Borland Delphi. However, for the precise pattern matching you will need to generate signature files for each different version of the library.</p>\n<p>To overcome this hurdle, Hex-Rays makes tools available that allow you to generate your own signatures from static libraries. <strong>Fast Library Acquisition for Identification and Recognition</strong> <em>(FLAIR)</em> tool set is distributed to authorized (licensed) customers. Version of FLAIR needs to correspond to the version of IDA. The signature creation process is straight forward:</p>\n<ol>\n<li>Get the copy of the static library.</li>\n<li>Utilize FLAIR parser to create a pattern file.</li>\n<li>Run <em>sigmake.exe</em> to convert the pattern file into signature file</li>\n<li>Install new signature file by copying to <em>IDADIR/sig</em> directory.</li>\n</ol>\n<p>In order to apply signature files manually, you should go to File-&gt;Load File-&gt;FLIRT Signature File, which will pop up dialog box with all of the signature files installed into <em>IDADIR/sig</em> directory. Select a signature you would like to use and click OK.</p>\n</div>",
            "votes": "5",
            "user": "PSS",
            "time": "Nov 6, 2013 at 5:28",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Also a powerful tool when dealing with Delphi is IDR : <a href=\"http://kpnc.org/idr32/en/\" rel=\"nofollow\">IDR</a> (Interactive Delphi Reconstructor).</p>\n<p>You can export the result of this tool to use it with IDA pro.</p>\n<p>Just don't forget to download the coresponding signature for your binary <a href=\"http://kpnc.org/idr32/en/download.htm\" rel=\"nofollow\">http://kpnc.org/idr32/en/download.htm</a></p>\n<p>See also this <a href=\"https://reverseengineering.stackexchange.com/questions/2716/special-properties-of-delphi-object-pascal-executables/2726\">post</a> </p>\n</div>",
            "votes": "3",
            "user": "Maijin",
            "time": "Jun 20, 2014 at 22:35",
            "is_accepted": false,
            "comments": []
        }
    ]
}