{
    "title": "Tool or data for analysis of binary code to detect CPU architecture",
    "link": "https://reverseengineering.stackexchange.com/questions/2897/tool-or-data-for-analysis-of-binary-code-to-detect-cpu-architecture",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Assuming that I have binary file with code for an unknown CPU, can I somehow detect the CPU architecture? I know that it depends mostly on the compiler, but I think that for most CPU architectures it should be a lot of CALL/RETN/JMP/PUSH/POP opcodes (statistically more than others). Or maybe should I search for some patterns in code specific for a particular CPU (instead of opcode occurrences)?</p>\n</div>",
    "votes": "25",
    "answers": 6,
    "views": "9k",
    "tags": [
        "binary-analysis"
    ],
    "user": "n3vermind",
    "time": "Oct 6, 2022 at 19:23",
    "comments": [
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">If you have a binary file but don't know for which CPU, how can you see <i>opcodes</i>? If you know how to translate from binary to opcode, then you already <i>know</i> which CPU you have. (Or at least which family -- e.g. Z80, Intel, ARM, Motorola MC-680XX.)</span>",
            "time": null
        },
        {
            "user": "Stolas",
            "text": "<span class=\"comment-copy\">Read the magic, then the file format.</span>",
            "time": null
        },
        {
            "user": "joxeankoret",
            "text": "<span class=\"comment-copy\">1) (Stolas) In embed often you don't have a magic or the magic is something they invented. 2) (Jongware) You can see opcodes (common patterns of bytes) without actually knowing what are them pretty much the same way you can determine if a file is compressed or encrypted without being able to decrypt or decompress it.</span>",
            "time": null
        },
        {
            "user": "n3vermind",
            "text": "<span class=\"comment-copy\">@jongware I think that you confuse <i>opcode</i> with <i>assembler instruction</i>.</span>",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">@n3vermind: .. if you don't know the CPU, then how can you be sure you are looking at 'opcodes'? ARMs, for example, would be easy (all opcodes are 4 bytes and most start with 0xE0), except you have Thumb modes to consider. A statistic approach <i>may</i> work -- but you always have the code/data dichotomy that makes disassembling hard even when you know the CPU type.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><em>When you have a hammer, all the problems look like nails...</em></p>\n<p>I´ve studied something called Normalized Compression Distance - <a href=\"http://en.wikipedia.org/wiki/Normalized_Compression_Distance#Normalized_compression_distance\" rel=\"nofollow noreferrer\">NCD</a>  - some time ago, and I'd give it a try if I had a problem similar to yours.</p>\n<ol>\n<li><p>I'd make a database of examples. I would take 20 programs for each architecture you want to know, with variable sizes, and save them.</p>\n</li>\n<li><p>When confronted with a program that I wanted to know which architecture it is, I'd compute its NCD against all my examples.</p>\n</li>\n<li><p>I'd pick the best (smaller) NCD and would then verify it if is was a real match (let's say, trying to run it on the discovered architecture).</p>\n</li>\n</ol>\n<p><em>Update</em></p>\n<p>I've always done this <em>by hand</em>, when it comes to NCD. How I did it:</p>\n<ul>\n<li><p>you have 20 files for SPARC and you call them A01, A02, A03, and so on. Your x86 files: B01, B02, etc.</p>\n</li>\n<li><p>You get the unknown file and call it XX.</p>\n</li>\n<li><p>Choose your preferred compression tool (I used Gzip, but see remarks at the end of this answer).</p>\n</li>\n<li><p>Calculate NCD for the first pair:</p>\n</li>\n</ul>\n<p>NCD(XX,A01) = ( Z(XX+A01) - min(Z(XX), Z(A01) ) / max(Z(XX), Z(A01))</p>\n<p>Z(<i>something</i>) means that you compress the <em>something</em> with Gzip and get the file size after compression. For example, 8763 bytes, so Z(<i>something</i>) = 8763.</p>\n<p>XX + A01 -&gt; means that you concatenate things. You append the A01 file to the end of the XX file. In Linux, you could do a <code>cat XX A01 &gt; XXA01</code>.</p>\n<p>min() and max() -&gt; you calculate the compressed size of XX and A01, and use the minimum and maximum that you get.</p>\n<p>So you'll have a NCD value: it'll lie between 0 and 1, and use as many decimals places as you can, because sometimes the difference is in the 7th or 8th digit. It'll be like comparing 0.999999887 to 0.999999524.</p>\n<p>You'll do that for every file, so you'll have 20 NCD results for SPARC, 20 for x86...</p>\n<p>Get the smaller NCD of all. Let's say that the B07 file gave you the smaller NCD. So, probably, the unknown file is a x86.</p>\n<p>Tips:</p>\n<ul>\n<li><p>your unknown and your test files must have a similar size. When you compare a file with bigger or smaller ones, NCD won't do its magic. So, if you'll be testing files of 5 to 10k, I'd get test files of 2.5k, 5k, 7.5k, 10k, 12.5k ...</p>\n</li>\n<li><p>In my Master's degree I got better results always using the smaller NCD value. The second best method was to do some voting: get the 5 smaller NCD results, and see which architecture got more votes. Ex.: smaller NCD were A03, A05, B02, B06, B07 -&gt; B go 3 votes, so I'd say it's a x86...</p>\n</li>\n<li><p>compressors based on the Zip construction have a limitation of 32kB: the way they compress things, they just consider 32kB at time. If your XX + A01 is bigger than this, Gzip, Zip, etc., won't give you good results. So, for files that are bigger than 15 or 16kB, I'd choose another compressor: PPMD, Bzip...</p>\n</li>\n</ul>\n</div>",
            "votes": "16",
            "user": "tripleee",
            "time": "Nov 29, 2022 at 7:16",
            "is_accepted": true,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Excellent idea. I've had good results for other classification problems in the past.</span>",
                    "time": null
                },
                {
                    "user": "n3vermind",
                    "text": "<span class=\"comment-copy\">@woliveirajr do you have any suggestion about tool or library for computing NCD? So far I have found <a href=\"http://www.complearn.org/\" rel=\"nofollow noreferrer\">CompLearn</a> utilities which looks quite promising.</span>",
                    "time": null
                },
                {
                    "user": "woliveirajr",
                    "text": "<span class=\"comment-copy\">@n3vermind I´ve updated my answer: I think you could use CompLearn, but since I wanted more control (like which compressor to use), I´ve done a small program to suit my need. I explained how it works...</span>",
                    "time": null
                },
                {
                    "user": "koukouviou",
                    "text": "<span class=\"comment-copy\">@woliveirajr Do you have a link to your master thesis? I'd love to go over it</span>",
                    "time": null
                },
                {
                    "user": "woliveirajr",
                    "text": "<span class=\"comment-copy\">@koukouviou sorry, couldn't find it now (and it would be in portuguese, anyway). But here is one article that we wrote about it: <a href=\"http://www.inf.ufpr.br/lesoliveira/download/FSI2013.pdf\" rel=\"nofollow noreferrer\">inf.ufpr.br/lesoliveira/download/FSI2013.pdf</a>  --  Please let me know if I can help you or provide more information.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are some tools that can scan binary files for common opcodes found in various architectures. <a href=\"http://binwalk.googlecode.com\">Binwalk</a>'s -A option does this for example (it scans for ARM/MIPS/x86 and several other architectures). </p>\n</div>",
            "votes": "16",
            "user": "devttys0",
            "time": "Oct 8, 2013 at 13:05",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>My lazy hack: a small Python script which calculates bigram and trigram counts. I then search for a couple of the most common sequences on Google (quoted hex). Quite often I manage to find some hex dumps and can figure the CPU from the context. It would work even better if Google could search by raw binary values...</p>\n</div>",
            "votes": "11",
            "user": "Igor Skochinsky",
            "time": "Oct 8, 2013 at 20:37",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Anton Kochkov",
                    "text": "<span class=\"comment-copy\">May be I'm late to the party, but this site has Python API and surely can search raw binary values: <a href=\"http://www.binar.ly/search\" rel=\"nofollow noreferrer\">binar.ly/search</a></span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@AntonKochkov thanks, looks intersing! too bad it seems to index only malware...</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Typically, I try the most common CPUs first (ARM, PPC, MIPS and AVR), try to find if any of the plain strings says something about the processor, etc... And, when all else fail, I give a try to what you're asking for: statistical analysis of opcodes (if I'm sure it isn't neither encrypted nor compressed).</p>\n<p>I recommend you to read the Alexander Chernov and Katerina Troshina presentation <a href=\"http://www.recon.cx/2012/schedule/attachments/40_Chernov-Troshina.pdf\">\"Reverse engineering of binary programs for custom virtual machines\"</a>. Writing a tool like the one they wrote must be very hard (I guess) but writing a tool to try to determine which CPU seems to be compiled for using the techniques described in that presentation is not that hard (as long as you can collect enough samples for multiple different architectures).</p>\n</div>",
            "votes": "10",
            "user": "joxeankoret",
            "time": "Oct 8, 2013 at 13:12",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Two additional methods that haven't been mentioned yet.</p>\n<p><code>binwalk</code>'s disassembly scan (note: <a href=\"https://github.com/ReFirmLabs/binwalk/blob/master/INSTALL.md#dependencies\" rel=\"nofollow noreferrer\">must have <code>capstone</code> installed</a>)</p>\n<pre><code>Disassembly Scan Options:\n    -Y, --disasm                 Identify the CPU architecture of a file using the capstone disassembler\n    -T, --minsn=&lt;int&gt;            Minimum number of consecutive instructions to be considered valid (default: 500)\n    -k, --continue               Don't stop at the first match\n\n</code></pre>\n<p>Example output (image is ARM LE):</p>\n<pre><code>$ binwalk -Yk image.img\n\nDECIMAL       HEXADECIMAL     DESCRIPTION\n--------------------------------------------------------------------------------\n3             0x3             ARM executable code, 32-bit, big endian, at least 726 valid instructions\n1048576       0x100000        ARM executable code, 32-bit, little endian, at least 1250 valid instructions\n2099012       0x200744        ARM executable code, 32-bit, little endian, at least 846 valid instructions\n3158316       0x30312C        ARM executable code, 32-bit, little endian, at least 899 valid instructions\n4201328       0x401B70        ARM executable code, 32-bit, little endian, at least 1250 valid instructions\n5253066       0x5027CA        ARM executable code, 16-bit (Thumb), big endian, at least 2499 valid instructions\n6308406       0x604236        ARM executable code, 16-bit (Thumb), little endian, at least 2499 valid instructions\n</code></pre>\n<p><a href=\"https://github.com/airbus-seclab/cpu_rec\" rel=\"nofollow noreferrer\"><code>cpu_rec</code></a></p>\n<p>Can be used as either a standalone tool or a <code>binwalk</code> module.</p>\n<p><code>binwalk</code> usage:</p>\n<pre><code>Statistical CPU guessing Options:\n    -%, --markov                 Identify the CPU opcodes in a file using statistical analysis\n</code></pre>\n<p>Example output, used as a binwalk module (image is ARM LE):</p>\n<pre><code>$ binwalk -% image.img\n\nDECIMAL       HEXADECIMAL     DESCRIPTION\n--------------------------------------------------------------------------------\n0             0x0             None (size=0x800, entropy=0.757822)\n2048          0x800           CLIPPER (size=0x800, entropy=0.728492)\n4096          0x1000          None (size=0x2000, entropy=0.129643)\n12288         0x3000          ARMel (size=0x35c000, entropy=0.795123)\n3534848       0x35F000        None (size=0x800, entropy=0.797443)\n3536896       0x35F800        ARMel (size=0x16800, entropy=0.834972)\n3629056       0x376000        None (size=0x800, entropy=0.764094)\n3631104       0x376800        ARMel (size=0x16a000, entropy=0.797543)\n5113856       0x4E0800        None (size=0x1800, entropy=0.841936)\n5120000       0x4E2000        ARMel (size=0x1000, entropy=0.812677)\n5124096       0x4E3000        None (size=0x1000, entropy=0.844949)\n5128192       0x4E4000        ARMel (size=0xc000, entropy=0.792995)\n5177344       0x4F0000        None (size=0x24000, entropy=0.763681)\n5324800       0x514000        6502 (size=0x24000, entropy=0.974422)\n5472256       0x538000        None (size=0x137800, entropy=0.728785)\n\n</code></pre>\n</div>",
            "votes": "5",
            "user": "hairlessbear",
            "time": "Jan 2, 2021 at 4:48",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Machine learning can be used to identify the target CPU of machine code with a high degree of accuracy. For example, the <a href=\"https://github.com/kairis/isadetect\" rel=\"nofollow noreferrer\">ISAdetect</a> tool can identify machine code targeting 23 different architectures using machine learning. There is a <a href=\"https://isadetect.com/\" rel=\"nofollow noreferrer\">web API</a> that one can use to upload executable binaries or pieces of machine code to be analyzed by this tool.</p>\n<p>Here is the paper discussing the techniques implemented by ISAdetect:</p>\n<p><a href=\"https://arxiv.org/abs/1908.05459\" rel=\"nofollow noreferrer\">Towards usable automated detection of CPU architecture and endianness for arbitrary binary files and object code sequences</a></p>\n</div>",
            "votes": "3",
            "user": "julian",
            "time": "Aug 19, 2020 at 14:08",
            "is_accepted": false,
            "comments": []
        }
    ]
}