{
    "title": "Proprietary 3D Format Reverse Engineering: What Could These Numbers And Matrices Represent?",
    "link": "https://reverseengineering.stackexchange.com/questions/29070/proprietary-3d-format-reverse-engineering-what-could-these-numbers-and-matrices",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to reverse engineer a model format from an older Russian game (Pathologic) with limited success. It is a proprietary model format not recognized by any converters/editing tools (believe me, I've tried! someone on the fan forums confirmed this with the person behind the engine, also). I'd like to be able to read the models into a potential open-source recreation of the original engine. The original game uses Direct3D and is from 2005, so I read up on relevant docs to get a start. Unfortunately, it's not the \"x\" model format.</p>\n<p><strong>What I've got so far (for a simple mesh):</strong></p>\n<ul>\n<li>Texture file name/location</li>\n<li>Number of faces and vertices</li>\n<li>UV coordinates for each vertex</li>\n<li>Vertex buffer</li>\n</ul>\n<p><strong>Things I'm struggling to understand (least to most important)</strong></p>\n<ul>\n<li><p>File header: what could it mean?</p>\n</li>\n<li><p>\"Arbitrary\" padding in the file: what could determine its size?</p>\n</li>\n<li><p>12-element float matrices. Could be transformation matrices without the last row - to use with homogenous coordinate systems, but there's 6 of them in a mesh with 4 vertices and 2 faces - isn't that too many?</p>\n</li>\n<li><p>Mysterious 4 bytes describing each vertex: some kind of a color format?</p>\n</li>\n<li><p>Mysterious sets of 3 32-bit floats repeating multiple times - what could it be?</p>\n</li>\n<li><p>Where could the vertex normals be stored?</p>\n</li>\n</ul>\n<p>Attached is a very simple mesh (way under 1kB) I'm studying before moving on to the more complex ones. I believe it to be a simple textured plane. I've started with a similar mesh that was in XY plane, this one seems to be oriented a bit more arbitrarily. Since it's a plane, I assume it has 4 vertices and 2 faces.</p>\n<p><a href=\"https://drive.google.com/file/d/13pzBcUDmfhanpXx8CPLqPDPZP6-4P_fB/view?usp=sharing\" rel=\"nofollow noreferrer\">Simple Mesh</a></p>\n<p><strong>File's structure as far as I can understand it</strong></p>\n<ul>\n<li>Header at 0x00.</li>\n<li>Texture Filename Length at 0x11 (16 characters here)</li>\n<li>1 byte padding</li>\n<li>Texture filename (h2_door_DXT1.tex)</li>\n<li>1 byte padding</li>\n<li>Number of vertices at 0x23 (4 vertices)</li>\n<li>Number of faces at 0x27 (2 faces)</li>\n<li>12 bytes of recurring 3x 4-byte floats (first occurrence)</li>\n<li>Mysterious float</li>\n<li>12 bytes of recurring 3x 4-byte floats (second occurrence)</li>\n<li>12-element float matrix (transformation matrix?)</li>\n<li>73 bytes of unknown data</li>\n<li>12 bytes of recurring 3x 4-byte floats (third occurrence) at 0xC0</li>\n<li>Data for four vertices at 0xCC. For each vertex, there's 3x int16 for X,Y,Z coordinates, then, 4 mysterious bytes, finally, 2 32-bit floats for UV coordinates.</li>\n<li>Vertex buffer at 0x114. Two triangle descriptions, for each there's 3x int16 for the vertex IDs.</li>\n</ul>\n<p>After that it becomes a mix of 12-element float matrices and the recurring 3x floats with some padding/magic numbers between them.</p>\n<p><a href=\"https://i.sstatic.net/IYd30.png\" rel=\"nofollow noreferrer\"><img alt=\"File's preliminary map in a hex editor\" src=\"https://i.sstatic.net/IYd30.png\"/></a></p>\n<p>I'd appreciate any and all help with answering my questions/helping with the bullet points I'm struggling on. I could also provide other mesh examples as needed.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "435",
    "tags": [
        "binary-analysis",
        "file-format",
        "binary-format"
    ],
    "user": "Xtal44",
    "time": "Jul 30, 2021 at 23:44",
    "comments": [
        {
            "user": "mindoverflow",
            "text": "<span class=\"comment-copy\">Am I reading these correctly? <a href=\"https://pastebin.com/4qLcryW8\" rel=\"nofollow noreferrer\">pastebin.com/4qLcryW8</a></span>",
            "time": null
        },
        {
            "user": "Xtal44",
            "text": "<span class=\"comment-copy\">@mindoverflow almost, but not exactly. Between the \"mat?\" float array and list 3 float array there's 73 bytes of data I cannot identify. List 3 should start at 0xC0 (alternatively, offset +192). That would place vertex 0's X coordinate at 0xCC. 0xCC is 7D, 0xCD is 00, giving us 125 (a word, Little Endian). I've added the way I mapped the file out in a hex editor to the original post, I didn't know I could attach images before.</span>",
            "time": null
        },
        {
            "user": "mindoverflow",
            "text": "<span class=\"comment-copy\">I accidentally read 4-byte <code>uint16</code>s, which is nonsense. This should be correct: <a href=\"https://pastebin.com/bYjjerNR\" rel=\"nofollow noreferrer\">pastebin.com/bYjjerNR</a>   I'm afraid I can't help you any further here due to my limited knowledge of 3D formats, I'd suggest parsing a lot of headers and looking for correlations.</span>",
            "time": null
        },
        {
            "user": "Xtal44",
            "text": "<span class=\"comment-copy\">@mindoverflow thank you for trying your hand at it!</span>",
            "time": null
        },
        {
            "user": "mindoverflow",
            "text": "<span class=\"comment-copy\">I had an idea just now and tried to verify it. It's a bit off rouding-wise, but the \"matrices\" could actually be lists of normalized surface normals. That would make a lot more sense than the transformation matrices, too. Either way, could you upload a model that has some more tris?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm giving up for good. If you say that there's 21 .mesh files for 21x the same object in the scene, then chances are good that there's a lot more non-mesh data in this file (as you said, baked shadow info, world pos, colliders, actor references, possibly animation data, ... Sounds unusual to me, but there's probably a reason to put all of this into one file).</p>\n<p>I was able to find two zlib compressed streams in the actor file at 0x4B and 0x11C using binwalk, but that's about it. The mesh files are way more complex than they look at first glance...</p>\n<p>You might get some more info out of the files by changing random values and observing the effects, but chances are slim that you find out how these files really work without debugging or reverse engineering the executable.</p>\n</div>",
            "votes": "1",
            "user": "mindoverflow",
            "time": "Aug 9, 2021 at 6:08",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Xtal44",
                    "text": "<span class=\"comment-copy\">Thank you very much for your efforts! I will look into the zlib compressed streams, also. Reverse engineering the executable is not out of the question - I'm already doing so to figure out the proprietary script format (which also appears to be compiled to some kind of a proprietary assembly language, with C++ classes for each instruction in the main engine DLL) the game uses. Thanks for the suggestions.</span>",
                    "time": null
                }
            ]
        }
    ]
}