{
    "title": "Modify framework.dex which is in boot.oat?",
    "link": "https://reverseengineering.stackexchange.com/questions/29079/modify-framework-dex-which-is-in-boot-oat",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I pulled down <code>boot.oat</code> from an API22 Android phone. It's Android 5.1 Lollipop which brought the change from Dalvik to ART and is a bit mistified.</p>\n<p>As far as I understand, modifying boot.oat is not easy, and permanent, as this file is regenerated whenever a package installation is happening.</p>\n<p>Now, I have a class which I need to modify (just a very tiny bit of it), which resides in <code>framework.dex</code> which was the part of <code>boot.oat</code>.</p>\n<p>I have two questions:</p>\n<ol>\n<li>How can I repack <code>boot.oat</code>? Taking into account that I haven't touch <code>boot.art</code>?</li>\n<li>How can I make my change in <code>boot.oat</code> permanent? It's very well possible that I will install some new packages onto this system later, which will (might?) ruin my modification.</li>\n</ol>\n<p>Thanks!</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "342",
    "tags": [
        "android"
    ],
    "user": "Daniel",
    "time": "Aug 1, 2021 at 14:28",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">Are you sure that <code>boot.oat</code> is regenerated when a package is installed? I would have assumed that it is only regenerated after a system update has been installed.</span>",
            "time": null
        },
        {
            "user": "Daniel",
            "text": "<span class=\"comment-copy\">I might misunderstood something, and yes, <code>boot.oat</code> might only be replaced during system update, which is unlikely for these old devices. Can you help me on Q1 please?</span>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">As far as I remember the original dex file is completely included in the oat file (or was it in the art file? don't really remember that). If it is use a hex editor, search for the <a href=\"https://source.android.com/devices/tech/dalvik/dex-format#dex-file-magic\" rel=\"nofollow noreferrer\">DEX_FILE_MAGIC</a> and extract the dex file. Then decompilation should not be a problem.</span>",
            "time": null
        },
        {
            "user": "Daniel",
            "text": "<span class=\"comment-copy\">Original DEX is in <code>boot.oat</code> (framework.dex). I need to modify a class in <code>framework.dex</code>, and put it back to <code>boot.oat</code>. But I've various information on rewriting header hash, or CRC or whatever.</span>",
            "time": null
        },
        {
            "user": "Soma Mhoud",
            "text": "<span class=\"comment-copy\">Start to deodex with any kitchen, after that you can modify th framework.jar</span>",
            "time": null
        }
    ],
    "answers_data": []
}