{
    "title": "Unknown filesystem in GoPro Hero 9 firmware",
    "link": "https://reverseengineering.stackexchange.com/questions/29094/unknown-filesystem-in-gopro-hero-9-firmware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to extract the GoPro Hero 9's firmware to tweak some of the parameters. This is my first time doing any sort of reverse engineering but I'm hoping that by finding the filesystem I can update the constant and rebuild the firmware. Unfortunately, I haven't been able to identify the firmware's filesystem correctly. The firmware can be downloaded here: <a href=\"https://bit.ly/35JJlcc\" rel=\"nofollow noreferrer\">https://bit.ly/35JJlcc</a> or here: <a href=\"https://community.gopro.com/t5/en/Introducing-GoPro-Labs/ta-p/603173\" rel=\"nofollow noreferrer\">https://community.gopro.com/t5/en/Introducing-GoPro-Labs/ta-p/603173</a> by clicking HERO9 Black at the bottom.</p>\n<p><code>binwalk -e</code> doesn't seem to result in any useful information, very similar to <a href=\"https://reverseengineering.stackexchange.com/questions/6569/weird-binwalk-output-on-gopro-firmware\">this post</a>. Entropy analysis and browsing the hex dump seems to indicate the firmware isn't encrypted but I haven't been able to find any pointers to the underlying filesystem.</p>\n<p>In the extracted <code>binwalk -e</code> files I did notice that it seems to find a <code>romfs</code> file, but I suspect this is a false positive based on the file size? I'm not sure where to go from here, would appreciate any tips to figure out the underlying fs.</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "212",
    "tags": [
        "firmware"
    ],
    "user": "kevmo314",
    "time": "Aug 4, 2021 at 4:17",
    "comments": [
        {
            "user": "jdmc",
            "text": "<span class=\"comment-copy\">Wild guess: <a href=\"https://en.wikipedia.org/wiki/ext4\" rel=\"nofollow noreferrer\">ext4</a>? The Eufy Security cams use that filesystem.</span>",
            "time": null
        },
        {
            "user": "multithr3at3d",
            "text": "<span class=\"comment-copy\">@jdmc I believe you are correct, but I'll have to go back and check my exact notes later on how to extract. This means you'll manually have to mount the ext4 filesystem. Also note that the cameras have a separate RTOS, so you may be seeing that firmware in addition to the Linux filesystem.</span>",
            "time": null
        },
        {
            "user": "kevmo314",
            "text": "<span class=\"comment-copy\">It looks like it is indeed <code>ext4</code>, I managed to figure out the false positives and mount it correctly. <code>binwalk</code> seemed to produce different output on mac than linux. On the other hand, actually tweaking the param I'm looking to tweak doesn't seem to be as easy as I had hoped: it looks like it's hardcoded in to some binaries and not so easy to modify.</span>",
            "time": null
        },
        {
            "user": "jdmc",
            "text": "<span class=\"comment-copy\">For use with macOS, I've found that <a href=\"https://www.paragon-software.com/home/extfs-mac/\" rel=\"nofollow noreferrer\">extFS for Mac</a> by <a href=\"https://www.paragon-software.com/\" rel=\"nofollow noreferrer\">Paragon Software</a> works marvelously, and for anyone who needs access to extFS volumes on a regular basis, is well worth its price of US$40.</span>",
            "time": null
        }
    ],
    "answers_data": []
}