{
    "title": "Inserting resources.properties file into an APK - language compatibility",
    "link": "https://reverseengineering.stackexchange.com/questions/2913/inserting-resources-properties-file-into-an-apk-language-compatibility",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm reverse engineering an android application. It's been a while since I've poked with this but I\"m having an issue editing the APK to deal with some language areas.</p>\n<p>The original app is from a different country. When decompiling and recompiling, the app installs but errors out when you try to run it on the phone. This includes if I only do apktool d and then apktool b. via log cat I'm getting this exception:</p>\n<blockquote>\n<p>Caused by: java.util.MissingResourceException: Can't find resource for\n  bundle 'j.bc.l.resources.resources.resources_en_US', key ''</p>\n</blockquote>\n<p>from a ResourceBundle.getBundle call. Via <a href=\"http://developer.android.com/reference/java/util/ResourceBundle.html\" rel=\"nofollow\">this page</a> I'm assuming it's an issue related to resolving resources for different languages.</p>\n<p>I think the issue is it's defaulting to search a path that doesn't exist in the application, so it can't find the file and the application crashes. I unzipped the apk file and in j.bc.l.resources there is a resources.properties file, but no resources_en_US directory to search in.</p>\n<p>So at this point since I need to make changes to the application I'm assuming I need to put a resources_en_US in that directory with a new properties file, but I don't know how to patch that into the application. I can't unzip and rezip because as far as I know it messes up the headers so that apktool and installation will fail.</p>\n<p>So I need a way to put the resources.properties file into the correct location to resolve properly. The aren't any references in the code to resources_en_US so I'm assuming the only way to get it to work is to patch the directory into the app and rebuild it. But if there's an easier way to solve this issue I would be okay with that as well.</p>\n</div>",
    "votes": "7",
    "answers": 1,
    "views": "2k",
    "tags": [
        "android",
        "apk"
    ],
    "user": "Fewmitz",
    "time": "Dec 4, 2013 at 14:11",
    "comments": [
        {
            "user": "Denis Laskov",
            "text": "<span class=\"comment-copy\">Bottom line - APK is an archive You may extract files from, add files to and perform all other things. So just use Your favorite archive manager to open it and add  to APK whatever You need.</span>",
            "time": null
        },
        {
            "user": "Fewmitz",
            "text": "<span class=\"comment-copy\">I'm aware of that, but as I said in the second-to-last paragraph attempting to resign and install it after adding files fails. I get INSTALL_PARSE_FAILED_INCONSISTENT_CERTIFICATES which as of now I'm assuming is because I have different certs than the original. This could be how my app specifically was compiled or because this is an assessment and I don't have the original certs, but in either case unzipping adding files and rezipping doesn't get me anywhere.</span>",
            "time": null
        },
        {
            "user": "Mathew Hall",
            "text": "<span class=\"comment-copy\">Could you try <a href=\"http://stackoverflow.com/a/7189815/87872\">resigning the APK with the debug key</a>?</span>",
            "time": null
        },
        {
            "user": "Fewmitz",
            "text": "<span class=\"comment-copy\">That worked and everything installed properly. Thanks to both of you. I'll put a formal solution and close the question</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In order to get this to work I had to use a combination of the comments left on my original post. As I mentioned in the topic the issue looks like it being and issue with resource bundles not being included properly. My best guess is the original compilation settings were such that the default resource bundle is different than what's documented <a href=\"http://developer.android.com/reference/java/util/ResourceBundle.html\" rel=\"nofollow noreferrer\">here</a>. Whether that's an issue with language compatibility or just something that Eclipse (or whatever they used to build) does behind the scenes.</p>\n<p>In any case I took the resources.properties file out of resources\\ and copied it into resources\\resources_en_US, per the Exception that was being thrown. The constants/parameters that the app was reading from the properties file didn't look like anything special (and were all in English) so I didn't have to make any changes to it.</p>\n<p>After that I deleted the META-INF folder per <a href=\"https://stackoverflow.com/questions/7119839/re-sign-an-android-apk/7189815#7189815\">here</a>, then rezipped and sign with the default debug key:</p>\n<pre><code>jarsigner -sigalg MD5withRSA -digestalg SHA1 -keystore debug.keystore theApp.apk androiddebugkey\n</code></pre>\n<p>After that everything was kosher, so it was just a matter of combining everything in the right order.</p>\n</div>",
            "votes": "8",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}