{
    "title": "Problem with analyzing malware",
    "link": "https://reverseengineering.stackexchange.com/questions/29220/problem-with-analyzing-malware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>We have a malware that blocks all analytics software in real time.</p>\n<p>This software has blacklisted a large list of software that performs analysis (x64dbg, ida, serialport monitor, etc.)</p>\n<p>This software examines all items related to the software, including the following: package name,registry,driver</p>\n<p>And if there is this softwares, it closes them and avoids re-running.</p>\n<p>Developing proprietary software that they can not block is very time consuming and costly.</p>\n<p>what's the solution?How can we do our analysis in this situation?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "161",
    "tags": [
        "malware",
        "program-analysis"
    ],
    "user": "ILYA20",
    "time": "Aug 28, 2021 at 7:58",
    "comments": [
        {
            "user": "BadSugar",
            "text": "<span class=\"comment-copy\">The solution may be very simple, but... We need to know more about your setup! 1. Which analytics software is being used, version etc give all information? 2. Is it stop only on that malware? 3. where is the malware? Send here so we can make a better answer 4. how is the malware come?</span>",
            "time": null
        },
        {
            "user": "ILYA20",
            "text": "<span class=\"comment-copy\">We are not allowed to publish the software. When we debug, the malware detects what software is installed and what software is running, and if there is any analysis, monitoring and the like software, it stops immediately.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Not much information has been disclosed about the program to be analyzed or its execution environment, so it is difficult to provide specific recommendations or solutions.</p>\n<p>If you are in possession of the binary executable you want to analyze then total control over its behavior should be possible. There should also not be any need to develop a bespoke tool just to deal with the anti-analysis techniques implemented by the program.</p>\n<p>There are a variety of techniques and strategies one can employ to force a program to behave as one desires and many different tools available that can be used to accomplish this. Some are listed below.</p>\n<h2>Static binary rewriting</h2>\n<p><em>Static binary rewriting</em> is a means by which changes can be made to an executable file on disk, prior to execution. Perhaps some anti-debugging mechanisms can be patched such that they always return a value you desire? Frameworks that offer this capability include <a href=\"https://github.com/google/syzygy\" rel=\"nofollow noreferrer\">syzygy</a> (Windows) and <a href=\"https://github.com/GJDuck/e9patch\" rel=\"nofollow noreferrer\">e9patch</a> (Linux).</p>\n<p>Syzygy examples:</p>\n<ul>\n<li><a href=\"https://doar-e.github.io/blog/2017/08/05/binary-rewriting-with-syzygy/\" rel=\"nofollow noreferrer\">Binary rewriting with syzygy, Pt. I</a></li>\n<li><a href=\"https://github.com/googleprojectzero/winafl/blob/master/readme_syzygy.md\" rel=\"nofollow noreferrer\">WinAFL: Statically instrument a binary via syzygy</a></li>\n</ul>\n<p>e9patch examples:</p>\n<ul>\n<li><a href=\"https://github.com/GJDuck/e9patch/blob/master/README.md\" rel=\"nofollow noreferrer\">project readme</a></li>\n<li><a href=\"https://github.com/GJDuck/e9afl\" rel=\"nofollow noreferrer\">E9AFL: uses E9Patch to insert the AFL instrumentation via static binary rewriting</a></li>\n</ul>\n<h2>System call interception</h2>\n<p><em>System call interception/hooking</em> can grant significant control over process behavior at runtime without making any changes at all to the executable binary to be analyzed.</p>\n<p>On Linux this can be achieved in a variety of ways, such as:</p>\n<ul>\n<li><a href=\"https://attack.mitre.org/techniques/T1574/006/\" rel=\"nofollow noreferrer\">use of LD_PRELOAD to perform shared library injection/code interposition</a></li>\n<li><a href=\"https://nullprogram.com/blog/2018/06/23/\" rel=\"nofollow noreferrer\">system call emulation via ptrace()</a></li>\n<li><a href=\"https://github.com/GJDuck/e9syscall\" rel=\"nofollow noreferrer\">using an instrumented version of <code>libc.so</code> that intercepts all system calls</a></li>\n<li><a href=\"https://xcellerator.github.io/posts/linux_rootkits_02/\" rel=\"nofollow noreferrer\">via a loadable kernel module</a></li>\n</ul>\n<p>I'm not very familiar with windows, but Windows' DLL and kernel APIs strike me as more permissive than their Linux analogues. Here are some tools that may be of use for your analysis:</p>\n<ul>\n<li><a href=\"https://github.com/microsoft/Detours/wiki\" rel=\"nofollow noreferrer\">Detours: used to intercept Win32 APIs calls within an application, such as to add debugging instrumentation</a></li>\n<li><a href=\"https://github.com/cheat-engine/cheat-engine\" rel=\"nofollow noreferrer\">Cheat Engine</a> (?)</li>\n</ul>\n<h2>Dynamic Binary Instrumentation</h2>\n<p><em>Dynamic binary instrumentation</em> is a method of changing process behavior by modifying its machine code at runtime. Tools such as Pin, Frida, QDBI and DynamoRIO provide this functionality.</p>\n<h2>Emulation</h2>\n<p><em>Emulation</em> allows one to approximate process runtime behavior without directly executing it on the host. QEMU and Qiling are examples of emulators.</p>\n</div>",
            "votes": "1",
            "user": "julian",
            "time": "Aug 28, 2021 at 20:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ILYA20",
                    "text": "<span class=\"comment-copy\">Thanks to your useful information, we are using Windows, we will soon perform the necessary tests on what you wrote and report the output.</span>",
                    "time": null
                }
            ]
        }
    ]
}