{
    "title": "Does loading custom PDB help reversing behemoth program?",
    "link": "https://reverseengineering.stackexchange.com/questions/29421/does-loading-custom-pdb-help-reversing-behemoth-program",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<pre><code>What I reverse :\n    Old 4~8mb games compiled with vc++ 2006~2008(depends on version), whose source code is lost.\n    It(they) has the mixtures of their custom structures, classes and directX sdk classes.\n\nWhat I did with an IDA:\n    Clumsy way - find some functions(subroutines) do some roles in gameplaying.\n    Searching - find some structures which helps analyzing their settings.\n    Class informer - Helped a lot finding class hierarchy but was no use without knowing size of class member.\n</code></pre>\n<p>Question :</p>\n<ol>\n<li>I am currently trying new way: compiling old directX sdk examples with old compiler(vc++ 2008) to extract symbols for helping reversing. The RTTI clues say that the game uses directX classes(DxSurface, DxImageBase...) So I think it will help organizing classes from the bottom.</li>\n</ol>\n<p>1-1. For acquiring vtable and struct info of compiled directx class, I planned to compile some sample codes with directx library.</p>\n<p>1-2. With compiled PDB symbol, I expect to measure the size of some class, and more precise class information(that the class will implemented into struct and struct_vtbl).</p>\n<p>1-3. After successive 1-2, I'll apply this result to original project, reversing the old game.</p>\n<ol>\n<li><p>Does this plan valid for reversing the game?</p>\n</li>\n<li><p>I did the way mentioned above with libjpeg, but the compiled function call was usercall and the one in the actual game use cdecl call. How can I change calling convention in a whole project?</p>\n</li>\n</ol>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "112",
    "tags": [
        "ida",
        "c++",
        "class-reconstruction"
    ],
    "user": "d0v3",
    "time": "Oct 17, 2021 at 17:20",
    "comments": [
        {
            "user": "Irbis77",
            "text": "<span class=\"comment-copy\">Generally speaking any pdb file you can find will improve readability of the reversed solution. It will provide the original naming for the functions it can find. Even if they are not the ones you are interested in, still nice to have some of the code using proper naming.</span>",
            "time": null
        },
        {
            "user": "Irbis77",
            "text": "<span class=\"comment-copy\">Are you going to reverse the entire code base? Even if you do, then you probably want to start building your reversed project from few functions. At that point, it doesn't matter which definition the individual function has as you can always change it later and then decide whether you need it for entire project.</span>",
            "time": null
        },
        {
            "user": "d0v3",
            "text": "<span class=\"comment-copy\">Thxs for commenting. I am reversing an entire portable executable from base. I've done the way starting from a few functions(what you suggested). How I felt something's wrong because there were bunches of big class governing the functions. To reverse the project from a function to bunches of class, I'm designing the way to easily reconstruct a class.</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">Do you actually have the PDB for the game or not? The question is kinda unclear on that part</span>",
            "time": null
        },
        {
            "user": "d0v3",
            "text": "<span class=\"comment-copy\">Didn't consider clearing that. :( The game does not have pdb symbols, nor source code.  In that situation, I am trying an attempt to create some pdb file using a library which the game uses, by compiling some dx8 sample codes with an old compiler.</span>",
            "time": null
        }
    ],
    "answers_data": []
}