{
    "title": "How to decrypt/decode the strings found in desktop application with x64dbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/29489/how-to-decrypt-decode-the-strings-found-in-desktop-application-with-x64dbg",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm a beginner and I have no experience at all in Reverse Engineering. I want to study it so find the \"string\" references, but all I get is some incomprehensible strings which are probably encoded or something like that.</p>\n<p>I'm searching for a string: <code>OK! Expires:</code></p>\n<p>Is there a way to decode them so they became readable ?</p>\n<p>Here is what I got so far by search for a string references in All modules:</p>\n<p><a href=\"https://i.sstatic.net/PfIQm.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/PfIQm.png\"/></a></p>\n<p>I tried to start debugging, which was working today, but now suddenly it denies to work. Each time I attach the running app, it gives me an error (I've censored the application name for some reason):</p>\n<p><a href=\"https://i.sstatic.net/GkWcz.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/GkWcz.png\"/></a></p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "463",
    "tags": [
        "debugging",
        "x64dbg"
    ],
    "user": "aspirinemaga",
    "time": "Nov 1, 2021 at 19:51",
    "comments": [
        {
            "user": "Happy",
            "text": "<span class=\"comment-copy\">I have some questions about your question, have you checked if the binary is protected? can you debug normally?</span>",
            "time": null
        },
        {
            "user": "aspirinemaga",
            "text": "<span class=\"comment-copy\">No I didn't checked that, I'm an absolute beginner in RE. But I managed to somehow debug step by step the app, but I can no more reproduce it. I've launched a x64dbg first, then the app alone, and lastly I've attached the process (target), that was the only way to run the debug correctly</span>",
            "time": null
        }
    ],
    "answers_data": []
}