{
    "title": "IDA does not load PDB file",
    "link": "https://reverseengineering.stackexchange.com/questions/29513/ida-does-not-load-pdb-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have C++ project compiled (debug) with Visual Studio 2019, and I have IDA 5.0 Free version. When I load my .EXE file, IDA does not load correspond PDB file and return message: PDB total 0 symbol loaded. What is the matter? I need load PDB file. But if I compile my project with Visual Studio 2005 that PDB file is success loaded.</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "752",
    "tags": [
        "ida",
        "c++"
    ],
    "user": "black4joss",
    "time": "Nov 7, 2021 at 13:53",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">IDA 5.0 has been released 15 years ago, therefore your VS version was released 13 years after IDA. Most likely there was a file format change of PDB files during that long period. <a href=\"https://en.wikipedia.org/wiki/Program_database\" rel=\"nofollow noreferrer\">There are multiple PDB versions known</a>.</span>",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "<span class=\"comment-copy\">I’m voting to close this question because this question is too specific and it does not contribute to the Q&amp;A nature of RE.SE, nor does it demonstrate and RE concepts.</span>",
            "time": null
        },
        {
            "user": "julian",
            "text": "<span class=\"comment-copy\">@Robert your comment seems like a suitable answer. Can you post it as such? Thanks.</span>",
            "time": null
        },
        {
            "user": "black4joss",
            "text": "<span class=\"comment-copy\">I found solution, just added /DEBUG option to LINKER (project properties) command line in Visual Studio, after that during compilation VS added full debug information in PDB file. Before in VS LINKER command line was set to /DEBUG:FASTLINK (not complete debug information). And now PDB file fine loads in IDA. Sorry for the confusion \"PDB/PDF\".</span>",
            "time": null
        }
    ],
    "answers_data": []
}