{
    "title": "How to check for a valid PE file?",
    "link": "https://reverseengineering.stackexchange.com/questions/29569/how-to-check-for-a-valid-pe-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>How can I check if a file is a valid PE file? What programs I should use for such a check? Can I use PEiD or DiE tool to check it? Also, do I need to unpack the sample prior to checking?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "2k",
    "tags": [
        "pe"
    ],
    "user": "New Python learner",
    "time": "Nov 21, 2021 at 3:27",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE. Valid in what context? You realize certain PE files that, for example, Windows 95 would have swallowed, or NT 4 or XP, will not work on latest Windows 10 or vice versa. Look for the corkami zoo of <code>.exe</code> file samples (many of which are PE) and you will notice that some will be considered valid even by modern Windows, while others won't (but were in older Windows versions). That is: as it stands your question is far too vague to answer meaningfully. Please edit your question and add some context.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The <strong>ultimate judge</strong> is the <em>particular operating system</em> (more precisely, its <em>loader</em>), i.e. the validity of PE header is always necessary to consider in this context (as wrote the <a href=\"https://reverseengineering.stackexchange.com/users/245/0xc0000022l\">0xC0000022L</a> in his comment). <strong>If the loader loads and launch an executable, its PE header is (from its point of view) valid</strong>, even if some fields are empty or don't correspond to the documentation.</p>\n<p>One loader may ignore some fields (e.g. a checksum) <em>or even adjust an incorrect value(s),</em> the other simply refuses to load the same PE file.</p>\n<p>So your best testing tool is the operating system itself (but not for malware, of course ;-)).</p>\n</div>",
            "votes": "1",
            "user": "MarianD",
            "time": "Nov 16, 2021 at 13:41",
            "is_accepted": false,
            "comments": []
        }
    ]
}