{
    "title": "Brother DCP-L2550DW Identify Toner Reset TN-760 or TN-730 (Continued)",
    "link": "https://reverseengineering.stackexchange.com/questions/29673/brother-dcp-l2550dw-identify-toner-reset-tn-760-or-tn-730-continued",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm really continuing discussion on a previous question posed 2 years ago (<a href=\"https://reverseengineering.stackexchange.com/questions/20780/identifying-a-toner-chip-and-its-communication-protocol-to-re-program-it\">\"Identifying a toner chip and its communication protocol to re-program it\"</a>).</p>\n<p>I found that user to have the most information (which overall isn't a lot but more useful than anything on the Internet and nothing more has been posted since then! As of December 2021). For mine the context is for Brother DCP-L2550DW for toner TN-760 or TN-730.  Rather than TN227 or TN223. I followed the same format and made similar assumptions. Based on their discovery, I sort of just put my hypotheses here for SDA, GND, SCL, VCC (literally what the previous discussion Answer #1 stated as their guesswork and for whom 1 responder said it was correct for them?). I'm no engineer, so I had to just make analogous assumptions. For communication’s sake I put 1, 2, 3, and 4 for Pad 1, Pad 2, Pad 3, and Pad 4.</p>\n<p><a href=\"https://i.sstatic.net/AgFDi.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/AgFDi.jpg\"/></a></p>\n<p><a href=\"https://i.sstatic.net/c1HWD.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/c1HWD.jpg\"/></a></p>\n<p>I'm using IC2 Scanner program and running it in Arduino using ELEGOO UNO R3.  The problem is that when I physically connect to the configuration and any combination thereof and run the code (or “serial monitor”) the output stops. While I'm still physically holding the pins to the “pads” on the microchip (i.e. the FOUR fat rectangular contacts) the code is at a blank or just “writing”.  Upon release of the pins, it spews out gibberish, which I assume is the tested address for IC2.  I know I'm doing something wrong.</p>\n<p>My assumption based on the previous forum is that GROUND is 2 and VCC is 4. I have mixed all other combos to no avail. I strongly feel there is a noob mistake I'm doing.</p>\n<p>Want it thrown out there that I cannot identify the manufacturer for Brother and I agree with the previous user that whoever they partnered with encrypted their identity on the chip. I went on a few websites to identify WHO it is but I do not see any entity with a reverse “RJ” with “iii” symbol. I cannot find locate the data sheet to explain the bus controller configuration and what is SCL, SDA, GND, or VCC.</p>\n<p>So my option is simply reverse engineer with “IC2 Scanner” with arduino OR “logical analyzer”.  I'm opting for the former. I figured out how to bypass the printer “low toner” message and can print.  But I am dead curious how to reset this toner microchip, as I don't like this man-made block for DIYers for refilling our own cartridge. The chips can be reset bc I noticed on the market for Amazon or eBay some third party are selling these chips with similar design (<a href=\"https://rads.stackoverflow.com/amzn/click/com/B07GGL8ZB7\" rel=\"nofollow noreferrer\">New Era Toner</a>).  This microchip (IC2 + EEPROM or EPROM) has a similar look, with the “M” and inverted “M” or “W” on opposite top or sides of the microchip (see picture). And from those selling from 3rd party, It's consistent in design. The design is also similar to the card posted on this forum 2 years ago, albeit some differences.  So it's gotta be some mass batch for brother printers and a partner for whose identification remains elusive. I feel like their identity is within reach. Here is a website that I used but did not have my answer: <a href=\"https://how-to.fandom.com/wiki/How_to_identify_integrated_circuit_(chip)_manufacturers_by_their_logos/P-T\" rel=\"nofollow noreferrer\">How to identify integrated circuit (chip) manufacturers by their logos/P-T</a>.</p>\n<p>I am not averse to buying the genuine parts but based on some articles (<a href=\"https://blog.499inks.com/brother-inks/what-you-need-to-know-about-brother-microchip-cartridges.html\" rel=\"nofollow noreferrer\">What You Need To Know About Brother Microchip Cartridges</a>). Brother is now aggressive and jacking up the price to HALF the cost of the printer, which I find revolting.  And they are doing it BC they found a way to hijack our printers with the microchip. I figured I would buy another microchip third party maybe after 4-5 refills on my own (which BTW this printer is relatively new model 2021 so I discovered a chip on it). But even those have issues with low count or compatibility.</p>\n<p>Anyways thanks for your help. Not an engineer but I have rudimentary understanding of hardware software. I know fundamentals of programming or enough of it. My previous experience was successfuly resetting toner cartridge for Ricoh printers but finding Brother to be rather annoying in lack of information.  Reverse engineering seems to be the only key to get this to work and a few ppl figured out their way (3rd party sellers).</p>\n<p>PS - \"Continue\" mode that allows us to print after \"low toner\" status is still within the parameters of what Brother wants. It will disable your printer after using it once. So I do not have a means of printing further with this chip. <a href=\"https://support.brother.com/g/b/faqend.aspx?c=us&amp;lang=en&amp;prod=dcpl2550dw_us&amp;ftype3=2043&amp;faqid=faq00002828_005\" rel=\"nofollow noreferrer\">What is Toner Continue Mode? Brother</a>.</p>\n<p>Update: I have resigned to finding manufacturer. But I wanted to make one last point. Here is image of the previous forum (linked on top) side-by-side with my picture. One of the hidden commenters (5th responder) below on that discussion confirmed they were successful based on the hypothesus of the first commenter. And if that is true I noticed similarity in design as far as the circuitry on mine and the other original poster. And if THAT is true and the supposed circuitry is correct then possibly I have more of a software issue on the I2C scanner software. And I also don't know if mine is 5 volts or 3.3 volts (but I really want to say it would be 3.3 volts bc of my unscientific hunch).  I would have to invest in a \"logic analyzer\" which is where I might suspend activity for now since that is another rabbit hole. I added a link to a DIY Youtuber who is also not a professional engineer but who did a fantastic job explaining what he knew. In the comment section (gotta dig a little deep but not too longer) there is a reference for the I2C scan code to READ the chip. Under his guidance it supposedly is able to scan for the address but that's assuming one knows the circuitry of the EEPROM. Without knowing that step its just plain hard to continue. I included it to show what code I was using for my arduino UNO R3 which is producing the same results with the proposed configuration as when I don't touch the wires to anything (i.e. serial output runs address gibberish when I touch nothing on the other end).</p>\n<p>Side by side comparison of the two EEPROMS, original of which had confirmation of successful result. I had no luck.\n<a href=\"https://i.sstatic.net/g3n0C.jpg\" rel=\"nofollow noreferrer\"><img alt=\"Side by side comparison of the two EEPROMS\" src=\"https://i.sstatic.net/g3n0C.jpg\"/></a></p>\n<p><a href=\"https://www.youtube.com/watch?v=Wwd5UCi9Huw&amp;t=0s\" rel=\"nofollow noreferrer\">YouTube EEPROM Explanation with Source Code in comment section</a></p>\n<p>Also, here is the EEPROM under a microscope:\n<a href=\"https://i.sstatic.net/MaXIN.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/MaXIN.jpg\"/></a>\n<a href=\"https://i.sstatic.net/pNj3b.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/pNj3b.jpg\"/></a></p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "631",
    "tags": [
        "disassembly",
        "debugging",
        "debuggers",
        "hardware",
        "reassembly"
    ],
    "user": "G. L.",
    "time": "Dec 27, 2021 at 10:42",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">what is your actual question?</span>",
            "time": null
        },
        {
            "user": "G. L.",
            "text": "<span class=\"comment-copy\">I need to read-write from this chip.  I need to get the address from IC2 scanning. That depends on knowing the configuration for SCL-SDA-VCC-GND, which is my first question (give me a strategy or hint where to go).  Unfortunately location of the data sheet is next to impossible without manufacturer identification (another question if anyone knows who that may be based on the picture). My \"serial output\" produces nothing when I physically connect the four pins but the code spews out gibberish AFTER I release.  I don't know if thats symptomatic for something I'm doing wrong.</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">Please edit the question to make it clear what you want to achieve.</span>",
            "time": null
        },
        {
            "user": "G. L.",
            "text": "<span class=\"comment-copy\">Does anyone know what EEPROM this is? I think it says \"2031.. LC 153.. 00\" on it. And does anyone know who might be the manufacturer? Once I know that I should be able follow through and read and write to it.</span>",
            "time": null
        },
        {
            "user": "G. L.",
            "text": "<span class=\"comment-copy\">The manufacturer remains unknown. The only step that can be done is to use a logic analyzer. Those don't come cheap.  My next piece would be to work out logic analyzer w/ arduino Uno R3 but that's another rabbit hole.  Or take wild guesses (4 factorial?).  Also, I am running IC2 Reader that supposedly will test for address. I keep getting outputs for the addresses that aren't quite right (noob mistake?). It has \"write\" and \"read\" 128 bytes with no meaningful output. Same output even when I don't plug in the pins so any combination of pins has same output as if i put the contacts in mid-air.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If it is still interesting for someone- the pads are: SDA, GND, SCL, VCC(~3V)maybe standard 3.2v; from left to right in front of printer/or as seen connector inside.\nThe VCC is not constant, starting point at 0 on the scope: first pulse is 45ms, second - on the 60ms point, third- on the 75ms, fourth - on the 135ms point and all next 20ms one after another. All except first are short only around 1-2ms exactly to  read 2 packets of data. The reading pulses are more than 20. It is difficult with scope to get communication, but if someone try to write program to read the board in this sequence I think it will be success.</p>\n</div>",
            "votes": "1",
            "user": "elmech",
            "time": "May 28, 2023 at 21:05",
            "is_accepted": false,
            "comments": []
        }
    ]
}