{
    "title": "Automated instruction analysis of dynamic memory",
    "link": "https://reverseengineering.stackexchange.com/questions/29700/automated-instruction-analysis-of-dynamic-memory",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Introduction to problem: I have a binary executable with an unknown network packet protocol. I want to reverse engineer this packet protocol. My current way of doing it is to send some data and step through the instructions in disassembly to try to figure out what the application is doing with this data, and gradually construct the correct protocol. This solution is extremely inefficient. So I want to automate at least a part of this process.</p>\n<p>Assuming that my network receive function is:\n<code>int recv(SOCKET s, char * buf, int len, int flags);</code></p>\n<p>What I want to do is to automate instruction tracking for all instructions reading the chunk of memory pointed by <code>char * buf</code></p>\n<pre><code>mov eax, [globalRecvBufferPointer]\nmov dl, [eax]\ncmp dl, 20h\njz somewhere\n</code></pre>\n<p>In the example above, I want my automated tool to detect <code>mov dl, [eax]</code> and <code>cmp dl, 20h</code> instructions.<br/>\nAdding a hardware r/w breakpoint to <code>char * buf</code> lets me detect <code>mov dl, [eax]</code> but not the other.<br/>\nAnother problem I can think of at this stage is when memory pointed by <code>char * buf</code> is copied to stack or other memory locations.</p>\n<p>Are there ready-made tools for this kind of operation? If not, are there tools where I can implement this idea?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "91",
    "tags": [
        "packet",
        "automation"
    ],
    "user": "AcarX",
    "time": "Dec 10, 2021 at 13:09",
    "comments": [
        {
            "user": "user202729",
            "text": "<span class=\"comment-copy\">Isn't this impossible in the general case? Like if it do <code>add dl, 1</code> and <code>cmp dl, 21h</code> — there's always the option of decompiling the program and just look at the source, what's the issue with that?</span>",
            "time": null
        },
        {
            "user": "AcarX",
            "text": "<span class=\"comment-copy\">@user202729 What I described can be done manually and is what I currently do. I'm currently looking  into dynamic binary instrumentation frameworks which might be the tool that can help me implement this idea.</span>",
            "time": null
        },
        {
            "user": "user202729",
            "text": "<span class=\"comment-copy\">If the instruction has that exact format it's possible to use gdb Python scripting to parse the assembly listing or something.</span>",
            "time": null
        },
        {
            "user": "lockcmpxchg8b",
            "text": "<span class=\"comment-copy\">Unicorn Engine may be of interest; I've used it to emulate functions within a running program, but I've never tried to inject it into someone else's program...should be about the same.  Major issue will be handling system calls.  You'll have to set breaks to drop out of unicorn, actually run the call, then poke the results back into the emulated state.  Unicorn has built-in memory access hooks.  As an alternative, I posted complete code to <a href=\"https://stackoverflow.com/questions/47426472/how-to-remote-control-gdb-on-linux/47445907#47445907\">remote-control GDB here</a> (warning, slow!)</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Sounds like you want dynamic taint analysis. There is a well-supported, open-source option called <a href=\"https://github.com/panda-re/panda\" rel=\"nofollow noreferrer\">Panda</a>. If you have money to spend, check out the commercial offering <a href=\"https://www.tetrane.com/\" rel=\"nofollow noreferrer\">Reven</a>.</p>\n</div>",
            "votes": "3",
            "user": "Rolf Rolles",
            "time": "Dec 14, 2021 at 4:15",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Ta Thanh Dinh",
                    "text": "<span class=\"comment-copy\">Reven releases <a href=\"https://blog.tetrane.com/2021/Launching-REVEN-Free-Edition.html\" rel=\"nofollow noreferrer\">free editions</a> recently. Otherwise, implementing dynamic taint analysis with help of some DBI tools would be fun.</span>",
                    "time": null
                }
            ]
        }
    ]
}