{
    "title": "I don't find the body of a function that I called in the main function",
    "link": "https://reverseengineering.stackexchange.com/questions/29795/i-dont-find-the-body-of-a-function-that-i-called-in-the-main-function",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have created a very simple <code>x86</code> console program that uses <code>Visual Studio 2019 compiler</code> to sum 2 numbers just to see how is the program be after disassembly but I found something unclear to me.</p>\n<pre><code>// C++\n#include &lt;iostream&gt;\n\nint sum(int n, int n2) {\n    return n + n2;\n}\n\nint main() {\n    int result = sum(7, 3);\n    std::cout &lt;&lt; result;\n}\n</code></pre>\n<p>After disassembled</p>\n<pre><code>; The main function from outside\nPush edi\npush esi\npush dword ptr ds:[eax]\ncall &lt;consoleapplication._main&gt;\nadd esp, C\n\n; The main function from inside\nmov ecx, dword ptr ds : [&lt;&amp;? cout@std@@3V ? $basic_ostream@DU ? $char_traits@D@std@@@1@A&gt;]\npush A\ncall dword ptr ds : [&lt;&amp;? ? 6 ? $basic_ostream@DU ? $char_traits@D@std@@@std@@QAEAAV01@H@Z&gt;]\nxor eax, eax\nret\n</code></pre>\n<p>As you have seen in the second code block, the second line</p>\n<pre><code>push A\n</code></pre>\n<p>That is the result of the \"sum\" function but\n<strong>where is its body and where is the call instruction that calls it in the main function?</strong></p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "143",
    "tags": [
        "disassembly",
        "functions"
    ],
    "user": "Lion King",
    "time": "Dec 30, 2021 at 14:34",
    "comments": [
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">first of all you have already been advised quite a few times to post code and not screen shots  next for a question to have a meaningful answer you need to provide context like what architecture what compiler options , which compiler, what os , optimization etc. will you understand if i reply the body may have been inlined and optimized away</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Making a function <code>static inline</code> in C++ has a similar effect. Usually the function body will be completely inlined. In your case, however, the compiler knew <code>sum()</code> was only called once. It knew it was called with known (literal) arguments and so there was no point in delegating the computation to runtime. Essentially your example is <code>constexpr</code> without explicitly saying it. Optimizers in compilers these days are fairly smart and will catch much more convoluted cases (but fail with some trivial ones, too). Change the code to take in <code>argc</code> from <code>main()</code> and it should look different.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">... but even in that case your function could still be inlined (i.e. body disappears). There are actually cases where this is desired behavior and <code>static inline</code> on a function is one way to nudge the compiler in the right direction without using proprietary \"attributes\" like <code>__forceinline</code>.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<ol>\n<li><p>always post text instead of screen shots as much as possible .</p>\n</li>\n<li><p>always provide context .</p>\n</li>\n<li><p>the compilers , operating systems , architectures , headers everything evolve and what might have been correct yesterday might not be correct today .</p>\n</li>\n<li><p>code with all warnings and analysis enabled as much as possible .</p>\n</li>\n<li><p>provide a readily compilable code for some one to spend a few minutes trying to answer if you don't include headers most wont be bothered to look for them .</p>\n</li>\n</ol>\n<p><a href=\"https://stackoverflow.com/questions/4246514/why-does-gcc-say-named-return-values-no-longer-supported\">6) do you know your return statement has a problem called NRVO some compilers will spit cant return n+n2 named returns are not supported ?</a></p>\n<p>use scopes with {} make it a habit .</p>\n<p>and not to nitpick but printf is not c++.</p>\n<p>i have attached a gif below that should answer your question watch it several times test and edit your question what you do not understand in that gif\nand whether you were able to find the answer you were looking for by watching it</p>\n<p><a href=\"https://i.sstatic.net/lwHJ0.gif\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/lwHJ0.gif\"/></a></p>\n<p>As Commented there are several kinds of Optimization<br/>\nyou can read the docs for the compiler you use<br/>\nfor msvc cl.exe these are the Optimizations that can be performed</p>\n<pre><code>C:\\&gt;cl /nologo  /? | grep /O\n/O1 maximum optimizations (favor space) /O2 maximum optimizations (favor speed)\n/Ob&lt;n&gt; inline expansion (default n=0)   /Od disable optimizations (default)\n/Og enable global optimization          /Oi[-] enable intrinsic functions\n/Os favor code space                    /Ot favor code speed\n/Ox optimizations (favor speed)\n</code></pre>\n<p>optimized code is difficult to analyze<br/>\nthat is why there debug build are used when writing code<br/>\noptimized builds are used when releasing the code<br/>\nwhile releasing the symbols are also stripped away so an optimized release built binary is just bytes all over which the reverse engineer has to decipher</p>\n</div>",
            "votes": "0",
            "user": "blabb",
            "time": "Dec 30, 2021 at 19:47",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Lion King",
                    "text": "<span class=\"comment-copy\">Thank you for your tips, I have updated my question.</span>",
                    "time": null
                },
                {
                    "user": "Lion King",
                    "text": "<span class=\"comment-copy\"><code>-O1</code> and <code>-O2</code> are almost generate the same disassembly code (ambiguous code),  <code>-O0</code> is the only one that generates the normal code. But what if I face an application that uses <code>-O1</code> or <code>-O2</code> optimization option How can it be analyzed then?</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">O0 is debug build O1 is optimized for speed , O2 is optimized for size  there are several other O's  which does some special optimizations  debugging optimized code is difficult and needs experience because when they are optimized the symbols  are also normally  stripped out. so all you have are tons of bytes to peer and decipher (thats basically reverse engineering)</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">While I agree with your commentary about the question, not all parts seem to apply anymore (e.g. <code>printf</code>) and I think they should be left in comments, instead of going into the answer. Much in the same way you (correctly!) pointed out that code should be posted instead of screenshots, your answer would have gained a bit by linking to the Compiler Explorer example.</span>",
                    "time": null
                }
            ]
        }
    ]
}