{
    "title": "Why does this hooking function work and never cause a \"backwards\" jump?",
    "link": "https://reverseengineering.stackexchange.com/questions/29865/why-does-this-hooking-function-work-and-never-cause-a-backwards-jump",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<pre><code>//src = the place to write the hook, dst is the function you jump to, len is length \n//of stolen bytes (MUST fall on a boundray between instructions)\nBYTE* TrampHook32(BYTE* src, BYTE* dst, const DWORD len)\n{\n    //Make sure length is long enough for a jump\n    if (len &lt; 5) return 0;\n\n    //Allocate memory to execute the stolen bytes\n    BYTE* gateway = (BYTE*)VirtualAlloc(0, len, MEM_COMMIT | MEM_RESERVE, PAGE_EXECUTE_READWRITE);\n\n    //Copy the stolen bytes into allocated memory\n    memcpy_s(gateway, len, src, len);\n\n    //Calculate the relavibe address of the jump\n    uintptr_t gatewayRelativeAddr = src - gateway - 5;\n\n    //Add a jump at the end of the stolen bytes back to the original function\n    *(gateway + len) = 0xE9;\n\n    //Add the relative address into the jump\n    *(uintptr_t*)((uintptr_t)gateway + len + 1) = gatewayRelativeAddr;\n\n    //This inserts a jump to dst into the original function (pointed to by src.)\n    //Note: the function at dst must contain a jump to gateway otherwise this won't work\n    Detour32(src, dst, len);\n\n    //Return a pointer to the gateway\n    return gateway;\n}\n</code></pre>\n<p>This function is from a GuidedHacking tutorial. The purpose is to hook a function without destroying its original functionality by putting all the bytes overwritten by the jump instruction  in a spot in virtual memory to be executed after the injected code finishes. The line <code>uintptr_t gatewayRelativeAddr = src - gateway - 5;</code> seems to imply that gateway will always be less than src considering theres no such thing as a negative relative address, but how can the guy who wrote this be confident that the address returned by VirtualAlloc will be less than the one taken in to the function as the src parameter? Or maybe an RVA that goes past the limits of a DWORD will simply underflow to a huge number which the CPU will see and also end overflowing to a reasonable number therefore making this valid? pls help</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "183",
    "tags": [
        "x86"
    ],
    "user": "EatingTechnobladesRemainsAt3am",
    "time": "Jan 13, 2022 at 4:27",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE. Please turn to the help center or ask on our meta site if anything comes up.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>From the <a href=\"https://www.intel.com/content/www/us/en/developer/articles/technical/intel-sdm.html\" rel=\"nofollow noreferrer\">Intel 64 and IA-32 Architecture</a> manual:</p>\n<blockquote>\n<p><strong>Jump instruction</strong> — The JMP (jump) instruction unconditionally transfers program control to a destination instruction. The transfer\nis one-way; that is, a return address is not saved. A destination\noperand specifies the address (the instruction pointer) of the\ndestination instruction. The address can be a <strong>relative address</strong> or\nan <strong>absolute address.</strong> A <strong>relative address</strong> is a displacement\n(offset) with respect to the address in the EIP register. The\ndestination address (a near pointer) is formed by adding the\ndisplacement to the address in the EIP register. The displacement is\nspecified with a signed integer, <em><strong>allowing jumps either forward or\nbackward in the instruction stream.</strong></em></p>\n</blockquote>\n<p>Because the jump used is relative (0xE9) it doesn't matter if it is negative. Because jmp is relative to the instruction and the instruction takes 5 bytes -5 is used.</p>\n<p>Further explanation is here in <a href=\"https://reverseengineering.stackexchange.com/questions/19459/calculation-of-jmp-address-through-subtraction\">Calculation of jmp address through subtraction</a></p>\n</div>",
            "votes": "2",
            "user": "chentiangemalc",
            "time": "Jan 13, 2022 at 6:16",
            "is_accepted": false,
            "comments": []
        }
    ]
}