{
    "title": "How to determine file system or open unknown .img file",
    "link": "https://reverseengineering.stackexchange.com/questions/29890/how-to-determine-file-system-or-open-unknown-img-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a .img file which will not mount, open, extract or anything within Windows using either the tools built into Windows 10, WinRAR or 7-Zip, they all return errors.</p>\n<p>I'm trying to look at data contained within the file which is destined for a Telenav system and would add an update to existing data - or overwrite. I do not know the file system of the .img file which makes life even more interesting.</p>\n<p>I need some help pointing in the right direction as to how I may be able to view the information? It originally resided within a compressed folder. I'm fairly new to this stuff so please be gentle and guide me in the right direction if possible.</p>\n<p>I do have a ubuntu machine but yet to try on that. Still a Linux newb.</p>\n<p>I also can't add new tags so sorry if they're wrong too!</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "106",
    "tags": [
        "linux",
        "file-format"
    ],
    "user": "Dan Lewis",
    "time": "Jan 18, 2022 at 19:06",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">A good start would be to execute the two command-line programs <code>file</code> to get some basic information about the file and of course <code>binwalk</code>.</span>",
            "time": null
        },
        {
            "user": "Dan Lewis",
            "text": "<span class=\"comment-copy\">Thanks, I thought I'd boot it up on a Linux (Mint) machine that I had and it comes up with the offset but unknown partition table  ~/Desktop/test.img 20195573760B Sector size 512B Partition Table: unknown. When interrogating with 'file' it says 'DOS/MBR boot sector</span>",
            "time": null
        }
    ],
    "answers_data": []
}