{
    "title": "How can I differentiate the JTAG pins like TMS, TDI, TDO, & TCK using impedance",
    "link": "https://reverseengineering.stackexchange.com/questions/30015/how-can-i-differentiate-the-jtag-pins-like-tms-tdi-tdo-tck-using-impedance",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>How can I differentiate between the JTAG pins like TMS, TDI, TDO, &amp; TCK using impedance?</p>\n<p>Because when we connect JTAG (RS422) with unnamed pin, we got a problem. So I am asking how to identify pins using impedance between pins and GND pin.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "384",
    "tags": [
        "jtag"
    ],
    "user": "GURU SATHYASAI BABA",
    "time": "Feb 14, 2022 at 18:53",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">This is probably better asked over at Electronics SE. We don’t have much expertise in electrical stuff.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The impedance will vary depending on the model and manufacturer of the chip. There isn't much of a standard. More importantly, if the chip is on a PCB, the other components on the board will almost certainly mess up your impedance readings due to also passing some current when testing with a multimeter.</p>\n<p>Can you find the JTAG pins (or BGA balls) on the chip itself, and trace those back to the JTAG header you are trying to connect to?</p>\n<p>If you can't, or don't have any documentation for the chip, your best option may be some automated guessing. Tools like the \"Jtagulator\" can brute-force every possible combination in a matter of minutes and tell you which pinout is correct: <a href=\"http://www.grandideastudio.com/jtagulator/\" rel=\"nofollow noreferrer\">http://www.grandideastudio.com/jtagulator/</a></p>\n<p>Keep in mind that many modern chips have security features that allow JTAG to be disabled in production. So even if you find the correct pinout, the chip may simply have had JTAG disabled during the last stage of production, and if so, it will not respond to any JTAG commands.</p>\n</div>",
            "votes": "1",
            "user": "KrzysisAverted",
            "time": "Feb 13, 2022 at 0:02",
            "is_accepted": false,
            "comments": []
        }
    ]
}