{
    "title": "What does the \"Hint\" entry in the PE import section mean?",
    "link": "https://reverseengineering.stackexchange.com/questions/30164/what-does-the-hint-entry-in-the-pe-import-section-mean",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In a <a href=\"https://2022.ctf.zer0pts.com/\" rel=\"nofollow noreferrer\">ctf</a> there was a rev PE challenge where it appeared in the deassembly as if the programm was calling functions from the ADVAPI32 but instead called some different code because the import table was modified. I can't quite figure out what was getting called instead.\nA Binaryninja line where the ADVAPI function appears to be called:</p>\n<pre><code>CreateServiceA(&amp;var_20, 0, 0, 0x18, 0xf0000000)\n</code></pre>\n<p>The Import information I got from PEBear:</p>\n<p>Call Via: 81D8,\nName: CreateServiceA,\nOrdinal: -,\nOriginal Thunk: 4E908,\nThunk: 8360,\nHint: DAB9</p>\n<p>As I understood it the \"Original Thunk\" is the RVA where the \"Hint\" is located? But I don't really understand the rest.</p>\n<p><strong>My Question</strong>: What do the Thunks and the Hint mean, what exactly gets called and what was originally being called?</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "236",
    "tags": [
        "pe"
    ],
    "user": "Hellstormer",
    "time": "Mar 21, 2022 at 21:41",
    "comments": [
        {
            "user": "Hellstormer",
            "text": "<span class=\"comment-copy\">I'm not sure what information you need to answer my questions. I'll be happy to provide it if you point it out</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">which challenge is that?</span>",
            "time": null
        },
        {
            "user": "Hellstormer",
            "text": "<span class=\"comment-copy\">It is \"service\". But I think (after countless hours) I understand it now. They used a tool (<a href=\"https://github.com/d35ha/CallObfuscator\" rel=\"nofollow noreferrer\">github.com/d35ha/CallObfuscator</a>) to obfuscate the IAT of the PE and load in the correct functions at runtime right before the main function. Should I delete my question or attempt to answer it? I don't think anyone cares about the answer.</span>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">if you describe the implementation details in the answer, it can be useful. but maybe the title should be changed if it's not about the hint anymore.</span>",
            "time": null
        }
    ],
    "answers_data": []
}