{
    "title": "x64dbg isn't running the program I'm looking at",
    "link": "https://reverseengineering.stackexchange.com/questions/30179/x64dbg-isnt-running-the-program-im-looking-at",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm almost definitely being an idiot but I have opened up an .exe file in x64dbg and I can run the file just fine when looking at the assembly but it doesn't open a second window so I can see the program and interact with it.</p>\n<p>It seems to work with some other programs but not with others, is there any reason for this? Essentially all the programs that don't seem to run via x64dbg are older programs.</p>\n<p><strong>Example of how it usually works:</strong>\n<a href=\"https://i.sstatic.net/yGubJ.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/yGubJ.png\"/></a></p>\n<p><strong>This is the issue I'm now getting:</strong>\n<a href=\"https://i.sstatic.net/YJfeC.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/YJfeC.png\"/></a></p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "641",
    "tags": [
        "debuggers",
        "x64dbg"
    ],
    "user": "x02",
    "time": "Mar 25, 2022 at 1:22",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">Not sure if I understand but on the second image it looks like you are just at the EntryPoint - what happens if you just go further? Also what it looks like from quick look at the web, PixtopianBook is a GUI app so I would not expect to see a console there.</span>",
            "time": null
        },
        {
            "user": "x02",
            "text": "<span class=\"comment-copy\">@PawełŁukasik thanks for the comment. If I go further than the entry point it doesn't change anything in regards to my issue. But by what you've said I assume the x64dbg will only run a separate window for a console and not a GUI application, is that correct?</span>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<span class=\"comment-copy\">it's not x64dbg that will run any window, it's OS. x64dbg just run the program</span>",
            "time": null
        },
        {
            "user": "Luca D'Amico",
            "text": "<span class=\"comment-copy\">Ok, you are currently at the EP. What happens if you click on RUN (or F9)? If the program just closes, then it may use some antidebug tricks.</span>",
            "time": null
        }
    ],
    "answers_data": []
}