{
    "title": "Find DllMain using IDA Freeware",
    "link": "https://reverseengineering.stackexchange.com/questions/30187/find-dllmain-using-ida-freeware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I want to use the IDA Freeware Version 7.7 for finding the <strong>DllMain</strong> of a DLL file. The file is from the book Practical Malware Analysis. It is for Lab 05. Name of file is \"Lab05-01.dll\" and you can download that from <a href=\"https://practicalmalwareanalysis.com/labs/\" rel=\"nofollow noreferrer\">here</a> (use VM).</p>\n<p>So as Practical Malware Analysis mentioned, when I load the DLL at IDA Freeware, then, the first line of instruction at the graph view should be the start of DllMain.</p>\n<p>But when I load the DLL file at the IDA Freeware, the first line of graph view is NOT the <code>DllMain</code>. Because I checked from the solutions and my answer and book's answer were not the same.</p>\n<h2>Ways that I've Tested</h2>\n<ol>\n<li>Looking at the first line of instruction at the graph view which the book described. (Explained above that didn't worked)</li>\n<li>So I searched and found <a href=\"https://stackoverflow.com/questions/26345426/donot-know-how-to-find-the-address-of-dllmain\">THIS ARTICLE</a>.\nOne of the ways that was mentioned there was to go and find <code>DllMain</code> at the function windows. There was no function named <code>DllMain</code> (As you see in the picture)\n<img alt=\"A Picture of Functions\" src=\"https://i.sstatic.net/7mvqJ.png\">\nThe <code>DllMain</code> does NOT exist because if it did exist, then it would be above <code>EnumProcessModules</code> and below <code>DllEntryPoint</code>. (Note that I have sorted by name)</img></li>\n<li>So next thing I did was to look at the answer and see what is the name of the function which starts at the exact same address which the book says DllMain starts.\nThe book says the answer is <strong>1000D02E</strong>. I look at the function which had started from this location and that function had this name : <strong>sub_1000D02E</strong> , not <code>DllMain</code>.<img alt=\"The Function Highlighted is the DllMain\" src=\"https://i.sstatic.net/W1mmd.png\"/>\nThe function highlighted is the DllMain (I know this because I have looked at the solutions and as you see the function's name is not <code>DllMain</code> and I was unable to find that by myself)</li>\n</ol>\n<hr/>\n<p><strong>What should I do to find the DllMain?</strong></p>\n<p>Thank you in advance.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "856",
    "tags": [
        "ida",
        "dll"
    ],
    "user": "Hayeri",
    "time": "Mar 30, 2022 at 9:10",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Hmm, so here's the rub. I installed IDA Freeware 7.7 in my Linux VM and tried in parallel in my named license IDA Pro 7.7.</p>\n<p>Turns out this seems to be a limitation of IDA Freeware, in all likelihood a conscious one. In particular I can see with the freeware version that <code>DllEntryPoint</code> was not deemed a library function (cyan color), but with the commercial license it was.</p>\n<p>Freeware: <a href=\"https://i.sstatic.net/3OCRU.png\" rel=\"nofollow noreferrer\"><img alt=\"Freeware\" src=\"https://i.sstatic.net/3OCRU.png\"/></a></p>\n<p>Commercial:\n<a href=\"https://i.sstatic.net/O47Lp.png\" rel=\"nofollow noreferrer\"><img alt=\"Commercial license\" src=\"https://i.sstatic.net/O47Lp.png\"/></a></p>\n<p>It appears that based on <code>autoload.cfg</code> my commercial IDA will load FLIRT signatures <code>vc32rtf</code> (Microsoft VisualC 2-14/net runtime), which the freeware version doesn't do on its own.</p>\n<p>If you do that manually through <kbd>File</kbd> -&gt; <kbd>Load file</kbd> -&gt; <kbd>FLIRT signature file</kbd> your <code>DllEntryPoint</code> function should get collapsed and its color should indicate it's a <em>library function</em> (cyan). You can toggle collapsed/expanded mode with <kbd>Ctrl</kbd>+<kbd>Num+</kbd> by default.</p>\n<p>Now, if you expand the function you will notice it has been recognized as a library function, but so have some of the callees called <em>from</em> this library function. What's more, if you use <kbd>View</kbd> -&gt; <kbd>Open subviews</kbd> -&gt; <kbd>Function calls</kbd> you can see the overview of calls <em>from</em> <code>DllEntryPoint</code>.</p>\n<p><a href=\"https://i.sstatic.net/rBZrG.png\" rel=\"nofollow noreferrer\"><img alt=\"Function calls subview\" src=\"https://i.sstatic.net/rBZrG.png\"/></a></p>\n<p>As you can now see, there are only two called \"entities\" which aren't themselves library functions (<code>call eax ; dword_10092E58</code> and <code>call sub_1000D02E</code>). And after a cursory look under which conditions the function pointer stored in <code>dword_10092E58</code> gets called, we can surmise that <code>sub_1000D02E</code> must be our <code>DllMain</code>.</p>\n<p>Knowing this, we can now jump to it and manually rename it to <code>DllMain</code>. Once done it should show up as:</p>\n<pre><code>.text:1000D02E ; BOOL __stdcall DllMain(HINSTANCE hinstDLL, DWORD fdwReason, LPVOID lpvReserved)\n.text:1000D02E DllMain         proc near               ; CODE XREF: DllEntryPoint+4B↓p\n.text:1000D02E                                         ; DATA XREF: sub_100110FF+2D↓o\n</code></pre>\n<p>... in the \"IDA View-A\".</p>\n</div>",
            "votes": "4",
            "user": "0xC0000022L",
            "time": "Mar 28, 2022 at 11:38",
            "is_accepted": true,
            "comments": []
        }
    ]
}