{
    "title": "GDB via JTAG on ARM Hardware target without source code",
    "link": "https://reverseengineering.stackexchange.com/questions/3018/gdb-via-jtag-on-arm-hardware-target-without-source-code",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Does anyone have other solutions for connecting to a remote ARM target without IDA? This is the question and below I give examples of setup's i have tried, should anyone be interested.</p>\n<p><em>Update:</em> updated Codeworks test for remote gdb</p>\n<p><em>Update:</em> GDB setup fixed</p>\n<p>I have been looking at a ARM hardware target and have a stable JTAG connection using J-Link. Attempts to get IDA working nicely with the target fail via the JLinkGDBServer. JLinkExe works just fine. As a baseline with JlinkExe I can halt, go and single step. In IDA on connect it attempts to halt and does not notice that the PC (Program Counter) is NOT at 0x0. At this point it gets out of sync and causes the device to halt or jump to a error loop of the device, and IDA does not get the PC to follow it properly.</p>\n<p>So I've been looking at other solutions: GDB directly, Eclipse, Codeblocks.</p>\n<p><strong>GDB-&gt;JlinkGDBServer</strong> - stable: works pretty well thus far </p>\n<p><strong>Eclipse-&gt;JlinkGDBServer</strong> - issue with init: after adding the Hardware GDB Debugger from <a href=\"http://download.eclipse.org/tools/cdt/releases/helios\">http://download.eclipse.org/tools/cdt/releases/helios</a> I can set the debugger for an empty project to point to the GDBServer but any time I attempt to attach or debug it complains that it cannot start target. I'm not sure how to get it working without source code of target.</p>\n<p><strong>Codeblocks-&gt;GDB-&gt;JlinkGDBServer</strong> - works: codeworks Does support remote GDB when you setup an empty project. The Remote settings are in the Project settings. (remote gdb is not started for global debugging settings). Stability similar to GDB though the disassembly window in codeblocks is not working. Could just be me.</p>\n<p>At the moment I'm back to IDA and likely writing my own JLink Debugger plugin for it based on <a href=\"http://idaproarmdebug.sourceforge.net\">http://idaproarmdebug.sourceforge.net</a></p>\n</div>",
    "votes": "10",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "gdb",
        "debugging",
        "arm",
        "jtag"
    ],
    "user": "cyphunk",
    "time": "Nov 7, 2013 at 13:19",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>binnavi from google works well remotely with gdb, it does require a bit of setup though and also needs IDA to create the IDB which is then converted to navi database format.</p>\n<p><a href=\"https://github.com/google/binnavi/tree/master/debug/client/gdb\" rel=\"nofollow noreferrer\">https://github.com/google/binnavi/tree/master/debug/client/gdb</a></p>\n</div>",
            "votes": "1",
            "user": "1455J8KL",
            "time": "May 27, 2019 at 16:05",
            "is_accepted": false,
            "comments": []
        }
    ]
}