{
    "title": "how to get indirect callsite function return type and arguments",
    "link": "https://reverseengineering.stackexchange.com/questions/30338/how-to-get-indirect-callsite-function-return-type-and-arguments",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am using idapython to get function return type and arguments @ an indirect call instruction.</p>\n<p>I was able to sync ida disassembler with hexrays decompiler as asked <a href=\"https://reverseengineering.stackexchange.com/questions/30252/idapython-how-to-get-decompiler-output-corresponding-to-the-indirect-call/30258#30258\">here</a> and I can now get decompiled output for specific instruction. For e.g.</p>\n<p>for instruction:</p>\n<pre><code>call    rdx\n</code></pre>\n<p>I can get:</p>\n<pre><code>v4 = ((__int64 (__fastcall *)(_QWORD))fn2)(b) + v3;\n</code></pre>\n<p>My final goal is to get function return type for e.g. in above case it could be the type of variable <code>v4</code> and argument types, for e.g. type of variable <code>b</code>. So, say the function can possibly be:</p>\n<pre><code>return type: int\narg1 type: int\n....\n</code></pre>\n<p>I want to get these for indirect callsites.</p>\n<p>I checked the hexrays api but I believe there isn't any function which can give me return type and argument types/ count at a certain callsite.</p>\n<p>One way to achieve this may be to extract arguments using regex for e.g. in above case <code>b</code> and then hunt their type by searching through <code>lvars</code> method from decompiled object. But, it seems like a lot of work (and maybe error prone) for seemingly easier problem using some internal ida functions.</p>\n<p>Could you please give many any directions on how to solve this? really appreciated.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "564",
    "tags": [
        "ida",
        "idapython",
        "hexrays"
    ],
    "user": "R4444",
    "time": "Apr 28, 2022 at 3:03",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Don't use regular expressions. Generally speaking, never use regular expressions to solve problems in IDA. All of the text you'd be operating upon is available as data via the API, which provides a normalized form and can resolve ambiguities. Anyway, your rough plan of attack here is as follows:</p>\n<ol>\n<li>Although it's not strictly necessary, I'm going to strongly recommend <a href=\"https://github.com/patois/HRDevHelper\" rel=\"nofollow noreferrer\">installing HRDevHelper and using it often</a>. Any time you wonder \"how is X represented in the Hex-Rays ctree data structures?\", the fastest way to find out is to invoke HRDevHelper via its keyboard shortcut (default <kbd>ctrl</kbd>+<kbd>.</kbd>), see the answer visually, and then go to <code>hexrays.hpp</code> in the SDK for more specifics. (Note, you may want to change the default colors in the configuration file for HRDevHelper).</li>\n<li>After having done so, locate an indirect call in the decompilation, and use HRDevHelper to view its representation. Here's what we see for the following decompilation <code>(*(void (__fastcall **)(struct BINDING_HANDLE *, __int64))(*(_QWORD *)v5 + 8i64))(v5, 1i64);</code>:</li>\n</ol>\n<p><a href=\"https://i.sstatic.net/EY1l2.png\" rel=\"nofollow noreferrer\"><img alt=\"HRDevHelper output\" src=\"https://i.sstatic.net/EY1l2.png\"/></a></p>\n<ol start=\"3\">\n<li><p>Looking at the figure, we see that calls are represented by <code>cot_call</code> expressions, whose <code>.x</code> member describes the destination of the call. For indirect calls (like the one in the figure), we can see that the node for <code>.x</code> (off to the left) has the text <code>ptr.8</code> at the top. This indicates that <code>.x</code> is another expression of type <code>cot_ptr</code>. We can also see that the left <code>ptr.8</code> node has the function type printed inside of it. In fact, the type is stored in a <code>tinfo_t</code> object held within the <code>.x.type</code> member, and HRDevHelper is simply printing it for us.</p>\n</li>\n<li><p>To summarize: find <code>cot_call</code> expressions whose <code>.x</code> member does not have type <code>cot_obj</code> (as this is how direct calls are represented). Look at the <code>.x.type</code> member to determine the type of the indirect call. You're going to want to take a look at the <code>func_type_data_t</code> data type and the <code>tinfo_t::get_func_details</code> member function from <code>typeinf.hpp</code>. The former is derived from a vector of <code>funcarg_t</code> objects, which contain <code>tinfo_t</code> objects for each argument. The <code>rettype</code> field also describes the function's return type.</p>\n</li>\n<li><p>Now that we know how Hex-Rays represents indirect calls, the easiest (but not the only) way to get ahold of them is to use a <code>ctree_visitor_t</code>. There are several examples in <code>%IDADIR%\\python\\examples\\hexrays</code> (grep it for <code>ctree_visitor_t</code>); the simplest one is <code>vds7.py</code>. Give it a try; add a <code>visit_expr(self,expr)</code> method to its <code>cblock_visitor_t</code> class, try to implement the logic described in the previous bulletpoint, run the plugin, and see what happens.</p>\n</li>\n</ol>\n</div>",
            "votes": "2",
            "user": "Rolf Rolles",
            "time": "Apr 28, 2022 at 5:20",
            "is_accepted": true,
            "comments": [
                {
                    "user": "R4444",
                    "text": "<span class=\"comment-copy\">this is perfect! thank you!</span>",
                    "time": null
                }
            ]
        }
    ]
}