{
    "title": "Warning: struct->til conversion failed",
    "link": "https://reverseengineering.stackexchange.com/questions/30360/warning-struct-til-conversion-failed",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In IDA I noticed a particular struct (<code>FAST_MUTEX</code>) was actually part of a bigger struct whose size I could determine from the code.</p>\n<p>So I created a struct from the selection (<kbd>Create struct from selection</kbd>).</p>\n<p>Alas, whenever I now try to manipulate said new struct, I get the following warning:</p>\n<blockquote>\n<p>struct-&gt;til conversion failed</p>\n<p>files to calculate alignments for [...]</p>\n</blockquote>\n<p><a href=\"https://i.sstatic.net/nnZPO.png\" rel=\"nofollow noreferrer\"><img alt=\"struct-&gt;til conversion failed\" src=\"https://i.sstatic.net/nnZPO.png\"/></a></p>\n<p>So I decided to edit the created struct and give it the desired alignment of 0x40. But even this edit action caused the warning to pop up. The same happens when editing individual members of the struct, e.g. by going through the data carousel with <kbd>D</kbd>.</p>\n<p>Obviously I can simply check the checkbox and be oblivious of any future instances of the warning, but since it is a <em>warning</em> I'd like to know:</p>\n<ol>\n<li>what does the warning mean and how serious of an issue is it?</li>\n<li>how can I fix it without merely hiding it?</li>\n</ol>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "204",
    "tags": [
        "ida"
    ],
    "user": "0xC0000022L",
    "time": "May 3, 2022 at 7:49",
    "comments": [
        {
            "user": "Ray",
            "text": "<span class=\"comment-copy\">Good question. I tend to get it too from time to time carefully editing structs that are part of others. So far I've been lucky and it hasn't caused any kinds of mess in the parent structs so I kinda \"learned\" to ignore this warning...</span>",
            "time": null
        }
    ],
    "answers_data": []
}