{
    "title": "How can I use cutter like ida, trying to search by address",
    "link": "https://reverseengineering.stackexchange.com/questions/30426/how-can-i-use-cutter-like-ida-trying-to-search-by-address",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm new to reverse engineering and I'm trying to get into using a disassembler - I've been using reclass for a while now. I was looking at IDA Pro and that was 7k euros so that was not an option. I've been trying to use cutter and I'm wondering is it possible to search the address like IDA Pro, goto address.</p>\n<p>I'm also wondering what is the best alternative than IDA Pro?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "880",
    "tags": [
        "ida",
        "radare2",
        "address"
    ],
    "user": "Dankri jk",
    "time": "May 23, 2022 at 7:18",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE. Correction: as of this writing a new IDA Pro named license is $1975 US, so definitely not 7000 €. And if you want to learn working with a disassembler, you should start out by doing <i>that</i> instead of tainting the process by getting the decompiler plugin from Hex-Rays (which would be the only explanation for the price tag you mention). Most of us have worked with these tools without a decompiler option for many years. So if you want to learn the ropes, then simply go for a disassembler. (And I <i>understand</i> that even 2000 USD are a lot of money!)</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Regarding the second question, have a look <a href=\"https://reverseengineering.stackexchange.com/q/1817/245\">here</a>. Keep in mind the (edit) dates of these answers, because Cutter - for example - didn't exist back then.</span>",
            "time": null
        },
        {
            "user": "Dankri jk",
            "text": "<span class=\"comment-copy\">@0xC0000022L thanks! yeah 2000 is a lot more affordable atleast,i added the decompilers prob thats why the price tag. and ida pro is using plugins that cutter do not have like for example like a form for class informer. is there a way around that or?</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Regarding plugins, I think that indeed IDA has the richest environment of them, but I've also seen plenty of them for Ghidra. Additionally there are ways to synchronize your findings between several tools. But yes there are clearly differences. But if you are just starting out, you are in a much better place than I was many years ago (I recall only Sourcerer and IDA at the time). There are different free-of-charge solutions out there from which you can pick to learn the basics. And then when you have some momentum you can still purchase a tool. Tools won't magically do your work anyway.</span>",
            "time": null
        },
        {
            "user": "Dankri jk",
            "text": "<span class=\"comment-copy\">@0xC0000022L yeah the tools will just make the job easier! ghidra and cutter are completly diffrent? but the cutter has the ghidra decompiler in it. have to search up if there is a way to get the runtime typeinfo on cutter/ghidra like ida.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Seek or goto an address in cutter could be done by pressing <kbd>G</kbd>.\nIt'll take the focus to the top where you see an address bar like such</p>\n<p><strong><a href=\"https://i.sstatic.net/hCGgZ.png\" rel=\"nofollow noreferrer\"><img alt=\"strong text\" src=\"https://i.sstatic.net/hCGgZ.png\"/></a></strong></p>\n<p>Just paste the address or function name and press <kbd>Enter</kbd></p>\n</div>",
            "votes": "2",
            "user": "sudhackar",
            "time": "May 31, 2022 at 9:01",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Dankri jk",
                    "text": "<span class=\"comment-copy\">yeah apparently you have to search by function address</span>",
                    "time": null
                },
                {
                    "user": "sudhackar",
                    "text": "<span class=\"comment-copy\">@Dankrijk No you don't - function names work. Just that radare2/cutter use a different style of naming functions.</span>",
                    "time": null
                },
                {
                    "user": "Dankri jk",
                    "text": "<span class=\"comment-copy\">ahhh okay i didnt know that i just searched the addrsse and it came up. thanks for the information man &lt;3</span>",
                    "time": null
                }
            ]
        }
    ]
}