{
    "title": "Do disassemblers detect standard functions?",
    "link": "https://reverseengineering.stackexchange.com/questions/3044/do-disassemblers-detect-standard-functions",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Do disassemblers detect the use of C/C++ standard functions and specify them in the output code, adding the <code>#include</code> line to the appropriate header file (such as <code>stdio.h</code> or even <code>windows.h</code>)?</p>\n<p>If not, does the whole big library is being recognized as the developer's own business-logic code, and written fully? Aren't the standard libraries known binary sequences (or can be processed some way to be known, as a binary-code can be different because of addressing)?</p>\n<p>Do you know disassemblers that do detect standard functions and properly #include them in the output?</p>\n</div>",
    "votes": "5",
    "answers": 2,
    "views": "3k",
    "tags": [
        "ida",
        "disassembly",
        "disassemblers"
    ],
    "user": "Reflection",
    "time": "Apr 28, 2017 at 12:57",
    "comments": [
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\"><code>#include</code> sounds like you are expecting C output. Most disassemblers output assembler code. Also: \"standard\" libraries, well, there are <i>lots</i> of standards. IDA Pro (as mentioned in an answer below) recognizes <i>lots</i> of standard libraries -- but most likely not \"all\".</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>IDA Pro will do such things thanks to its FLIRT feature.\nYou can take a look here to get more information : <a href=\"https://reverseengineering.stackexchange.com/questions/175/what-is-a-flirt-signature\">What is a FLIRT signature?</a></p>\n</div>",
            "votes": "2",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Rolf Rolles",
                    "text": "<span class=\"comment-copy\">Note also that you can create your own FLIRT signatures using the <a href=\"https://www.hex-rays.com/products/ida/support/download.shtml\" rel=\"nofollow noreferrer\">FLAIR tools available on the Hex-Rays download page</a> (requires a login/password that is provided in the email you receive when you purchase a license).  So if your definition of \"standard library\" differs from IDA's, you have options.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>One thing that's important to realize is that standard runtimes are commonly treated as any other code or library. How compiled code is linked and loaded depends a lot on the platform. .net is very different from c++.</p>\n<p>Basically functions have at least three major ways of showing up inside of your binary: </p>\n<h3>Dynamically linked</h3>\n<p>This when a function is kept inside of a dynamically loaded library and is the case for many of the functions you'd get through <i>windows.h</i> as you said. Identifying these are generally easy as they're functionally separated and named either through their string name, decorated or undecorated, or through ordinal. Most disassemblers should handle dynamically linked standard functions without issues. This is the most common default for various compiler, runtime and platform options. This depends on the compiler being able to move the function to a separate compilation unit, which is commonly not the case with many templates in C++. Calling conventions are respected and prologue and epilogue are present.</p>\n<h3>Statically linked and not inlined</h3>\n<p>This is when a function is included inside of your binary but is functionally separate from other functions. This can be identified using a set of signatures of some form. IDA uses <a href=\"https://www.hex-rays.com/products/ida/tech/flirt/in_depth.shtml\">FLIRT signatures</a>. Something like <a href=\"http://www.zynamics.com/bindiff.html\">bindiff</a> uses a more varied and complex approach to comparing functions, for instance using flow graph analysis. Usually parameters are passed according to calling convention unless the binary is built with <a href=\"https://en.wikipedia.org/wiki/Link-time_optimization\">link time optimization</a> in which case the compiler is free to pass arguments in any order it feels like. If you're lucky the binary contains debug information which could allow for significant recovery of function names and parameters.</p>\n<h3>Statically linked and inlined</h3>\n<p>This is when a function is included inside of your binary and is not functionally separate from other functions. This generally happens when a function is small enough that the overhead to do a function call is expensive enough to warrant repeating the same function in the calling function or if the function is only called in very few locations, usually once, in the binary. This means that the disassembler has very little information to know that this was originally a separate function and debug information will not help much with recovery of these functions. There will be no function prologue or epilogue. Opcodes can be heavily rearranged/ The only tool I'm aware of that does very limited recovery of this sort of function is Hex-Rays decompiler, not diassembler. I've seen binaries with link time optimization where a function ends up being a massive result of hundreds of nested inlined functions, resulting in a function with thousands of branches. Separating them back out into their original functions would have been a very useful operation to have.</p>\n<h3>Finally</h3>\n<p>There is no solution that solves all the cases mentioned above. Hex-Rays IDA combined with their decompiler and BinDiff probably provides the most complete solution I know of. On very <a href=\"https://en.wikipedia.org/wiki/Reflection_%28computer_programming%29\">reflective platforms</a> such as .net, java or python this isn't much of an issue.  </p>\n</div>",
            "votes": "9",
            "user": "Peter Andersson",
            "time": "Nov 17, 2013 at 0:28",
            "is_accepted": false,
            "comments": [
                {
                    "user": "langlauf.io",
                    "text": "<span class=\"comment-copy\">Do you mean combining IDA decompiler and BinDiff? Or do you mean either IDA+decompiler or BinDiff? How would you use BinDiff to detect a library?</span>",
                    "time": null
                },
                {
                    "user": "Peter Andersson",
                    "text": "<span class=\"comment-copy\">You first detect the fact that they've used a lib. The you build the lib yourself using as close as possible compiler settings. Then you bindiff the binary against the library you just built. In my experience this can help a lot. This is of course for static linking with no symbols.</span>",
                    "time": null
                }
            ]
        }
    ]
}