{
    "title": "What change to the source code would produce an LT compare rather than an OLT compare in MIPS assembly?",
    "link": "https://reverseengineering.stackexchange.com/questions/30468/what-change-to-the-source-code-would-produce-an-lt-compare-rather-than-an-olt-co",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I need some help reverse engineering a function in MIPS assembly. It was compiled for the PlayStation 2's <a href=\"https://en.wikipedia.org/wiki/Emotion_Engine\" rel=\"nofollow noreferrer\">EmotionEngine</a> CPU. My goal is to produce a matching decomp of the function; it is the proof-of-concept for a project of mine that I am hoping will get the ball rolling for PS2 decompilation.</p>\n<p>The function is very simple; it takes two floats, <code>g</code> and <code>absLimit</code>, and limits the absolute value of <code>g</code> to <code>absLimit</code>.  Here is the C++ source code I have written so far (not matching):</p>\n<pre><code>// Limits the absolute value of g to absLimit\nfloat GLimitAbs(float g, float absLimit)\n{\n    float result = g;\n    if (g &gt; absLimit)\n        result = absLimit;\n    else if (g &lt; -absLimit)\n        result = -absLimit;\n    return result;\n}\n</code></pre>\n<p><a href=\"https://decomp.me/scratch/AbP3I\" rel=\"nofollow noreferrer\">Here</a> you can see the target assembly on the left, and the current compiled source on the right. The compiler is <code>ee-gcc 2.96</code> with standard optimization (<code>-O2</code>).</p>\n<p><a href=\"https://i.sstatic.net/F9YUZ.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/F9YUZ.png\"/></a></p>\n<p>As you can see, the target assembly has this confounding pattern of <code>c.lt.s</code> instructions followed by <code>nop</code>s, whereas my code produces <code>c.olt.s</code> instructions sans <code>nop</code>s.</p>\n<p>My research has not turned up much as there are very few resources for PS2 reversing. One thing I've learned is that the OLT compare \"<a href=\"https://www.cs.unibo.it/%7Esolmi/teaching/arch_2002-2003/AssemblyLanguageProgDoc.pdf#page=82\" rel=\"nofollow noreferrer\">does not signal an exception for unordered values</a>\" while the LT compare does. However, I don't fully understand what that means or what kind of code pattern would result in one over the other.</p>\n<p>Is there some change to the source that I'm missing that would produce a matching decomp of the function? Or could perhaps the only explanation be that I'm using the wrong compiler/assembler/etc? Any help would be appreciated.</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "105",
    "tags": [
        "assembly",
        "decompilation",
        "c++",
        "mips",
        "gcc"
    ],
    "user": "Zac",
    "time": "Jun 3, 2022 at 6:34",
    "comments": [
        {
            "user": "Michael Karcher",
            "text": "<span class=\"comment-copy\">I suspect the difference is rooted in different compiler flags. The missing NOPs are an indicator the right side is better optimized. Also OLT is faster than LT. Try compiling with less optimization than O2, and play around with math modes like -ffast-math or its negation.</span>",
            "time": null
        }
    ],
    "answers_data": []
}