{
    "title": "How can I override a x86 instruction in c++?",
    "link": "https://reverseengineering.stackexchange.com/questions/30466/how-can-i-override-a-x86-instruction-in-c",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to replace a jmp instruction with a ret in c++. How can I do that?\n<a href=\"https://i.sstatic.net/aS4nm.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/aS4nm.png\"/></a></p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "281",
    "tags": [
        "ida",
        "c++",
        "game-hacking"
    ],
    "user": "Mlemix",
    "time": "Jun 2, 2022 at 2:54",
    "comments": [
        {
            "user": "peter ferrie",
            "text": "<span class=\"comment-copy\">If you have the source code then you can change that instruction to a return directly.  If you have only the binary, then you'll need a hex editor, search for the instruction sequence, and change it there.  However, the snippet is insufficient to know what kind of return is needed here.  You might have more luck by changing the jump target to the functions true epilogue, so that the stack is cleared correctly.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It seems you are looking for one of the menu items underneath <kbd>Patch program</kbd> from the <kbd>Edit</kbd> item (on the main menu).</p>\n<p><a href=\"https://i.sstatic.net/IFKwE.png\" rel=\"nofollow noreferrer\"><img alt=\"Patch program menu item in IDA\" src=\"https://i.sstatic.net/IFKwE.png\"/></a></p>\n<p>Personally before I start patching around I enable the \"Number of opcode bytes\" option and give it a generous value of 7 or so:</p>\n<p><a href=\"https://i.sstatic.net/fLdjL.png\" rel=\"nofollow noreferrer\"><img alt=\"IDA Options dialog\" src=\"https://i.sstatic.net/fLdjL.png\"/></a></p>\n<p>In your case you seem already to be set on a specific course of action and have made up your mind about which opcode to patch to what, so you can go right ahead and patch the <code>EB ??</code> to <code>C3 90</code>, I reckon. The <kbd>Change byte</kbd> option could be exactly what you're looking for, but you need to know the hex representation of your opcodes to find the old one and replace it by the same number of bytes. Also, this seems to be limited to 16 bytes at a time, if I remember correctly.</p>\n<p>Alternatively pick the <kbd>Assemble...</kbd> option and enter <code>ret</code>. Any trailing bytes (your <code>jmp</code> should be at least two bytes) will simply appear as non-code.</p>\n<p>One point that may matter: this only applies to the IDB itself, not to the binary from which it got loaded. Use the last option in the popup menu for <em>that</em>.</p>\n</div>",
            "votes": "1",
            "user": "0xC0000022L",
            "time": "Jun 2, 2022 at 12:44",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Mlemix",
                    "text": "<span class=\"comment-copy\">not in IDA. I know how to do it in IDA. I'm asking how can I do it in a c++ dll.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@Mlemix That's not even a reverse engineering question then.</span>",
                    "time": null
                },
                {
                    "user": "Mlemix",
                    "text": "<span class=\"comment-copy\">do I ask that on regular stack overflow then? It kind of is a reverse engineering question, not sure.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@Mlemix Hmm, how to implement something in C++ would definitely be for StackOverflow, yes. Regarding the part where you take something like the <code>ret</code> mnemonic and try to get to <code>C3</code>, I think you want something like <a href=\"https://github.com/intelxed/xed\" rel=\"nofollow noreferrer\">xed</a>. Probably other libraries exist. But that part would also be \"forward\" engineering, as in <i>assembling</i> to the binary form. Also see recommendations <a href=\"https://reverseengineering.stackexchange.com/q/4664\">in <b>this</b> Q&amp;A</a>.</span>",
                    "time": null
                }
            ]
        }
    ]
}