{
    "title": "Why can't I view certain USER32.dll API calls in the disassembly?",
    "link": "https://reverseengineering.stackexchange.com/questions/30553/why-cant-i-view-certain-user32-dll-api-calls-in-the-disassembly",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to understand and patch the GUI in <strong>Microsoft Edge</strong>. When I look at the disassembly in 2 different debuggers <strong>(x64dbg and cutter)</strong>, the API calls responsible for much of the GUI functionality is completely missing. I look at the SYMBOLS and IMPORTS tabs to try and find them, but they're not there. Searching the disassembly for certain function names does not turn up any results.</p>\n<p>I know that these API calls are being made because they come up in an API monitor (I'm using the rohitab API monitor).</p>\n<p>So, to recap, API calls are being made (I can see them ), but the calls themselves do not appear in the disassembly (in 2 different debuggers!).</p>\n<p>I'm not very experienced with reverse engineering but I know from common sense that if you can't,</p>\n<ul>\n<li>Know what libraries the program uses, and</li>\n<li>Know where in the instruction sequence it's using them.</li>\n</ul>\n<p>Then you can't understand what's going on. Am I missing something here? Is it that certain USER32.dll functions just don't show up in debuggers? I'm looking for SetBkColor, SetTextColor, and SelectObject to name a few.</p>\n<p>I just want to be able to set breakpoints at certain API calls.</p>\n<p>How can I do that?</p>\n</div>",
    "votes": "3",
    "answers": 0,
    "views": "246",
    "tags": [
        "winapi",
        "windows-10"
    ],
    "user": "n0rmalguy011",
    "time": "Jul 4, 2022 at 19:17",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">You forgot to mention what file you have created the disassembly of. Also keep in mind that not all functionality has to be implemented in the main executables. A program consists of the EXE file and a set of program specific DLL files. The imports of the main exe file only cover the functionality implemented in the EXE file itself. So you have to also check all program specific DLL files for imports.</span>",
            "time": null
        },
        {
            "user": "n0rmalguy011",
            "text": "<span class=\"comment-copy\">@Robert The file is msedge.exe . Should be \"C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe\" in Windows.  Now, it's interesting what you say about the disassembly having only the exe functionality itself. I would think that at least the calls to these APIs would be in the disassembly (not the APIs or function definitions themselves, just the calls), because the program needs what is returned from them in order to function, right? How do I track what line of code called the API? Again, I can see what APIs were called because of an API monitor, I just want to set some breakpoints.</span>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">If you use a debugger check the list of loaded libraries, I assume you will find a lot DLLs that do not belong to Windows.</span>",
            "time": null
        },
        {
            "user": "n0rmalguy011",
            "text": "<span class=\"comment-copy\">@Robert Could you explain what you mean by DLLs that do not belong to Windows? And how that is related to what I just asked? No matter what, the DLLs run on the windows OS, yes? And if they are loaded by the program, they are used somewhere in the assembly code, right? I just want to know how to see where in the code the functions are being called so that I can set breakpoints on them and track what happened before and after the call.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Uhm, I think you are missing the obvious: 1.) look at the Chromium source to get started 2.) there's <i>little</i> (not nothing!) in the way of what resides in win32u.dll/win32k.sys, because modern browsers and many modern apps use DirectDraw, Direct2D and similar methods and completely draw their controls themselves. They are no longer classical <i>windows</i> in the sense user32.dll treated framed windows and their controls. You can even verify my claim by using Spy++ (or alternatives) to observe that all these fancy controls aren't <i>windows</i> anymore. For Opera this was true many years ago already.</span>",
            "time": null
        }
    ],
    "answers_data": []
}