{
    "title": "Trying to understand a simple compiled PSI binary file",
    "link": "https://reverseengineering.stackexchange.com/questions/30584/trying-to-understand-a-simple-compiled-psi-binary-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I was working with an old ios game, and found that it saved most of its data (players, worlds, anything in-between) in <code>MDB</code> files.. titled <code>data.mdb</code> and <code>lock.mdb</code>. There is a pair for every object type (A players save data, world settings and config, world data (terrain))</p>\n<p>At first I thought it was some strange microsoft database thing, but apparently they are <code>PSI</code> binary files after doing some more digging. I could be wrong.</p>\n<p>I am trying to understand how these formats work and if there is a particular known way to decompile them into something readable? Or are these a type of cryptographically sealed binary file, where they are compiled with a hash / password / key?</p>\n<p>I honestly have no clue where to start.</p>\n<p>Here is a sample from \"world_db\" which I assume represents the save data of the entire worlds terrain and items: <a href=\"https://github.com/MisterSirCode/world_db\" rel=\"nofollow noreferrer\">https://github.com/MisterSirCode/world_db</a></p>\n<p>If anyone could give me some clues or potentially has any information about these <code>MDB</code> files or <code>PSI v1</code> binary files I would appreciate it.</p>\n<p>All I can assume is that <code>lock.db</code> is the binary passcode / hash if it is a sealed binary file, since its so much smaller than the <code>data.db</code> file</p>\n<p><a href=\"https://i.sstatic.net/YACAb.png\" rel=\"nofollow noreferrer\"><img alt=\"overview of mdb files\" src=\"https://i.sstatic.net/YACAb.png\"/></a></p>\n<p>The <code>lock.db</code> file just looks like a 4 letter term repeated randomly</p>\n<p><a href=\"https://i.sstatic.net/ADjur.png\" rel=\"nofollow noreferrer\"><img alt=\"mdb file hex dump\" src=\"https://i.sstatic.net/ADjur.png\"/></a></p>\n<p>Something else that might be related? <a href=\"https://github.com/LMDB\" rel=\"nofollow noreferrer\">https://github.com/LMDB</a></p>\n</div>",
    "votes": "3",
    "answers": 0,
    "views": "181",
    "tags": [
        "binary",
        "ios",
        "binary-format"
    ],
    "user": "Mister SirCode",
    "time": "Jul 3, 2022 at 0:20",
    "comments": [
        {
            "user": "Mega Tonnage",
            "text": "<span class=\"comment-copy\"><code>data.mdb</code> doesn't seem to be encrypted or obfuscated... there are tons of legible strings indicating which game it likely is. I'd suggest investigating the game code to see how the data is accessed in order to work out how to modify it.</span>",
            "time": null
        },
        {
            "user": "Mister SirCode",
            "text": "<span class=\"comment-copy\">I have no clue how to put the file into an organized readable format...</span>",
            "time": null
        },
        {
            "user": "Mega Tonnage",
            "text": "<span class=\"comment-copy\">My point was that it is difficult to work purely from the data, so you should investigate the game code to see if that gives you some ideas on how the data is formatted. When you understand that, you should be a lot closer to being able to modify the data.</span>",
            "time": null
        },
        {
            "user": "growse",
            "text": "<span class=\"comment-copy\">I think you're on the right lines with LMDB. Try using some of the python tooling at <a href=\"https://lmdb.readthedocs.io/en/release/\" rel=\"nofollow noreferrer\">lmdb.readthedocs.io/en/release</a> to see if you can dump the database out to a CDB database (<a href=\"https://cr.yp.to/cdb.html\" rel=\"nofollow noreferrer\">cr.yp.to/cdb.html</a>).</span>",
            "time": null
        }
    ],
    "answers_data": []
}