{
    "title": "Does anyone recognize this jQuery website plugin?",
    "link": "https://reverseengineering.stackexchange.com/questions/30607/does-anyone-recognize-this-jquery-website-plugin",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am working on a site that was made years ago (not be me) and I need to identify a jQuery file manager plugin. This plugin shows a file manager view in a browser and allows the user to visually navigate a directory tree and view, upload, or download files.</p>\n<p>In its code it refers to itself as <code>documentLibrary</code> or <code>Document Library</code>. Based on file dates, it looks like this may have been implemented circa 2017.</p>\n<p>I have tried a variety of Google searches, as you can imagine the terms \"jQuery file manager\" and \"jQuery document library\" yield a lot of results that have nothing to do with what I am looking for. I have tried searching for pieces of the code, but I do not have any luck.</p>\n<p>I have found similarly named products related to a WordPress plugin and Sharepoint services, but they do not seem to be related to the plugin I am looking at.</p>\n<p>Here are some snippets that seem like they could be identifiable by someone familiar with this plugin.</p>\n<pre><code>    $.documentLibrary = function(element, options) {\n        \n        var defaults = {\n            ajax_url        : false,\n            csrf            : false,\n            file_container  : false,\n            folder_table    : false,\n            tool_bar        : false,\n            drop_zone       : false,\n            is_media_modal  : false,\n            example_callback: function() {},\n            restrict_files : []\n        };\n</code></pre>\n<pre><code>        plugin.init = function() {\n            plugin.settings = $.extend({}, defaults, options);\n            plugin.open_folders = [];\n            if(plugin.settings.csrf===false){throw \"Configuation Error: The document library requires a csrf token for ajax calls.\";}\n            if(plugin.settings.ajax_url===false){throw \"Document Library requires an ajax url.\";}\n            if(plugin.settings.folder_table === false ){\n                throw \"Document Library requires a file holder.\";\n</code></pre>\n<p>Thanks for any help. Let me know if I can provide more information.</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "28",
    "tags": [
        "javascript",
        "websites",
        "plugin"
    ],
    "user": "colonelclick",
    "time": "Jul 8, 2022 at 15:32",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">Jquery or general webdev site might be a better fit for this question.</span>",
            "time": null
        },
        {
            "user": "colonelclick",
            "text": "<span class=\"comment-copy\">Thank you for the suggestion, I will check!</span>",
            "time": null
        }
    ],
    "answers_data": []
}