{
    "title": "VMware Dynamic Analysis on Chosen Executable within VM",
    "link": "https://reverseengineering.stackexchange.com/questions/30633/vmware-dynamic-analysis-on-chosen-executable-within-vm",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to use vmware for debugging. What I am trying to achieve is once an executable has been opened inside a vm which runs on Windows, I would like to extract the runtime traces for that executable, the assembly instructions. Could somebody please help me with this, if it is possible?</p>\n<p>Also, if anybody knows any alternatives for extracting the runtime instructions, I would like to hear them. I tried to use PIN from Intel, PANDA, and other debuggers such as OllyDBG and Immunity Debugger, but unfortunately I did not get them to work.</p>\n<p>Thank you!</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "58",
    "tags": [
        "debugging",
        "vmware"
    ],
    "user": "odyssey",
    "time": "Jul 13, 2022 at 20:37",
    "comments": [
        {
            "user": "Mega Tonnage",
            "text": "<span class=\"comment-copy\">Cuckoo sandbox might give you part of what you're looking for (runtime executable behavior), but for the assembly instructions you'll need to disassemble the binary. Unless you mean that the binary has encrypted blobs that are decrypted at runtime and you want to dump those?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There is a a difference between debugging and tracing, basically you can debug an executable by using tools such as Immunity Debugger, OllyDbg, WinDbg, x64dbg etc.</p>\n<p>While debugging you can use breakpoints on specific Win32 API functions to print messages about the function calls and their arguments to build a very basic tracer.</p>\n<p>Another approach would be to build a DLL that places hooks on specific API functions and would log the function call and the arguments passed and that would give you a basic trace output as well.</p>\n<p>Also from your question it was not clear what were the problems that you had while try to debug using a debugger, why it didn't work for you, and what were the specific problems you had.</p>\n<p>Hope I helped.</p>\n</div>",
            "votes": "1",
            "user": "rotem.salinas",
            "time": "Jul 20, 2022 at 8:59",
            "is_accepted": false,
            "comments": []
        }
    ]
}