{
    "title": "How to debug an obfuscated self hashing program?",
    "link": "https://reverseengineering.stackexchange.com/questions/30657/how-to-debug-an-obfuscated-self-hashing-program",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I need to understand what the following obfuscated application does:</p>\n<pre><code>interpreter.py:\n    string = \"lambda x : obfuscated_code_to_interpret_variable_x\"\n    interpreter = eval(string)\n\n    instructions = read_instructions(argv[1])\n    interpreter(instructions)\n\ninstructions.txt:\n    04GFUHSDSLGHLDFIHGLDSHLFHGLSDGHFLFSHGLIFSHLGFLGFIIGFL...\n</code></pre>\n<p>You run the application typing the command <code>python3 interpreter.py instructions.txt</code></p>\n<p><code>instructions.txt</code> contains machine code (of some hypothetical machine). <code>interpreter.py</code> contains an interpreter that runs the machine code.</p>\n<p>I want to modify the interpreter by adding <code>print(variable)</code> statements inside the <code>string</code>,\nto see what the code does.</p>\n<p>The problem is that somewhere in the <code>instructions.txt</code> file, a file <code>interpreter.py</code> is read as a string, hashed, and checked that the hash equals to a predefined value. Thus, any modification to the <code>interpreter</code> variable will invalidate the hash.</p>\n<p>I also have no idea what the numbers inside the <code>instructions.txt</code> file mean, because only the obfuscated interpreter understands the meaning of those numbers. So I can't remove the hash check from the <code>instructions.txt</code> file, because I don't know where it is.</p>\n<p>Any ideas, how to deobfuscate such application?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "109",
    "tags": [
        "obfuscation",
        "deobfuscation",
        "hash-functions"
    ],
    "user": "mercury0114",
    "time": "Jul 19, 2022 at 9:35",
    "comments": [
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">Can you elaborate on how the obfuscated code obfuscated_code_to_interpret_variable_x looks like?</span>",
            "time": null
        },
        {
            "user": "mercury0114",
            "text": "<span class=\"comment-copy\">e.g. <code>def x(y): return z(y+1)</code> <code>def z(x): return x if x ^ 234 &lt; 10 else 0</code> ...  and so on, like 200 functions, with if/else statements, maths expressions, such as <code>(x || y &amp;&amp; z ^ 2)</code>, all of that to construct one big function F, which is then evaluated with an argument x, so <code>string = \"lambda x : F(x)\"</code></span>",
            "time": null
        },
        {
            "user": "mercury0114",
            "text": "<span class=\"comment-copy\">@ws basically, the whole interpreter processing is hidden behind <code>F(x)</code>. I would add <code>print</code> statements to print the variables of the inner functions of the implementation of <code>F(x)</code>, if I see that some variable is a constant, then I can delete the code computing that variable to simplify the function, and keep iterating. This technique has worked for me before.  But now adding <code>print</code> statements changes the value of <code>string</code>, and thus the hash(string).</span>",
            "time": null
        },
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">Are you sure that the integrity checking relies on reading the actual file ? Do you see something like such a file reading and hashing inside the obfuscated code?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If your suggestion that \"the obfuscated code actually reads the file and checks the kind of checksum of it\" is correct you can do the following (or at least that's the order of the actions I'd perform):</p>\n<ul>\n<li>First' I'd check that it really reads the file and not takes its contents from somewhere else. For this I'd run this on linux with <code>strace</code> and check how the python interpreter deals with this file on a level of system calls. If additional read exists, the option may be real. In addition it is possible that it loads some libraries, which can be seen when python interpreter is running with command line options <code>-d</code> (debug) and <code>-v</code> (verbose).</li>\n<li>If it opens \"interpreter.py\" I'd copy the script and run the copy from the same folder with changes. If it reads it <strong>by name</strong> and checks <strong>only its checksum</strong> the problem is solved.</li>\n<li>If this doesn't work, I'd suggest that it takes the file name from <code>__FILE__</code> constant, and change it in the copy to point to the original file. If the same assumptions remain, problem solved.</li>\n<li>If this doesn't work, I'd try to check for a library function that computes checksum and override it. If it exists, overridden function will return the required value, and same assumptions remain, problem solved.</li>\n<li>In addition I'd check if it imports <code>inspect</code> module and calls something like <code>inspect.getsource</code> (this gets the source of the function). If it is so - just override it with something that will return the original function.</li>\n<li>If this doesn't work, I'd seriously try to understand the obfuscated function, but there is one more option: it is possible to write LD_PRELOAD like library which will override all the file IO, and will push to the obfuscated code the original version for computing the checksum.</li>\n</ul>\n<p>Good luck.</p>\n</div>",
            "votes": "2",
            "user": "w s",
            "time": "Jul 19, 2022 at 12:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}