{
    "title": "IDA Pro for MIPS image",
    "link": "https://reverseengineering.stackexchange.com/questions/3066/ida-pro-for-mips-image",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have this file:</p>\n<pre><code>[ytti@lintukoto ~/tmp/ida]% file cat3k_caa-universalk9.SPA.03.03.00.SE.150-1.EZ.bin\ncat3k_caa-universalk9.SPA.03.03.00.SE.150-1.EZ.bin: data\n</code></pre>\n<p>It's image for Cisco Catalyst 3650 switch. The switch itself is running Cavium, probably Cavium Octeon CPU on Linux.</p>\n<p>I think the file on top of it has some proprietary headers (possible hash of file integrity too).\nIf I remove what I believe to be headers, I get this:</p>\n<pre><code>cat3k.mips: mc68010 demand paged executable not stripped\n</code></pre>\n<p>I can't get it open on IDA Pro, as it says it's binary file, and I need to choose entry point.</p>\n<p>I'm pretty sure it's self-decompressing image, so I'd probably want to be able to decompress it as well. But at least unzip and gzip fail on me.</p>\n<p>What I'm trying to accomplish is, the switch has certain command you use to escape proprietary process and access the Linux shell, before this command executes it presents you with a challenge and you have to give matching response, otherwise no soup^Wshell for you.</p>\n<p>I was thinking of finding the string which complains about incorrect response, seeing which part of the code jumps there. I'd expect to find some comparison there, and then I'd just flip the comparison around. With desired results that in future incorrect response would succeed (and correct response fail).<br/>\nI don't expect any particular efforts from Cisco to avoid customers from breaking their own kit willfully, this is more of easy for them to prove, that customer didn't break it accidentally by going to linux shell and killing some process.</p>\n<p>If there is some sort of integrity test of the file, then I might be shit out of luck.</p>\n<p>But I'd love some tips how to actually </p>\n<ol>\n<li>decompress this</li>\n<li>get it open in IDA Pro in meaningful way</li>\n</ol>\n<p>I can share the file upon request (it's useless without the switch, and if you own switch, you are eligible to the image, so I don't consider it 'warez').</p>\n<p>The challenge looks like this:</p>\n<pre><code>SWITCH#request system shell\nActivity within this shell can jeopardize the functioning of the system.\nAre you sure you want to continue? [y/n] y\nChallenge:\naa1344d4d0dfbf85b22a719e54fe1365b5be267344223bd66c3b6368b3bd2b7f6b8b03fe87ab57e6360634d8fb&gt;586c42c0918a3786f81a3a60\nPlease enter the shell access response based on the above challenge (Press \"Enter\" when do&gt;ne or to quit.): \nkakka\nKey verification failed\n</code></pre>\n</div>",
    "votes": "6",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ida",
        "disassembly",
        "binary-analysis",
        "mips"
    ],
    "user": "ytti",
    "time": "Jun 4, 2014 at 11:51",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'd start by plotting the entropy of the file by using for example <a href=\"http://binwalk.org/\" rel=\"nofollow\">binwalk</a> which is also part of <a href=\"http://code.google.com/p/firmware-mod-kit/\" rel=\"nofollow\">firmware-mod-kit</a>. This will give you an idea about the layout (bootloader, 2nd stage, main fw etc) of the file and if parts or the whole file is encrypted/compressed.\nNext you can use the same tool and let it try to automatically find known file types and/or compression algorithm(s) based on signatures.</p>\n<p>You can combine these 2 steps in one using</p>\n<pre><code>binwalk -B -E &lt;input&gt;\n</code></pre>\n<p>Consult the FAQ/Wiki for more information regarding the usage of binwalk. From that you can start extracting independent blocks and load them into IDA. </p>\n</div>",
            "votes": "5",
            "user": "0xC0000022L",
            "time": "Nov 21, 2013 at 14:22",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ytti",
                    "text": "<span class=\"comment-copy\">Many thanks, binwalk is epic, I wasn't aware. Now my problem isn't, I don't know what to do next, my problem is which of the next-step plans to do first :)</span>",
                    "time": null
                }
            ]
        }
    ]
}