{
    "title": "IDA Free vs IDA Home (to have Lumina)",
    "link": "https://reverseengineering.stackexchange.com/questions/30822/ida-free-vs-ida-home-to-have-lumina",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I use actually IDA Free and I want to know what do you think of IDA Home (particulary for the Lumina function).\nI don't found in Google a tool to know for exemple the functions recognized by the Lumina server of Hex-Ray or a post to describe this functionnalities for a real case of RE.</p>\n<p>So for the price, in case of RE on dll build in VS (MFC Library, Boost, openSSL, tinyXml and some other static library). <strong>Lumina can really save lot of my time to identify the \"real\" content between the embeded static library content ?</strong></p>\n<p><a href=\"https://i.sstatic.net/zyfX4.png\" rel=\"nofollow noreferrer\"><img alt=\"Version of IDA\" src=\"https://i.sstatic.net/zyfX4.png\"/></a></p>\n<p>Thank you in advance..</p>\n</div>",
    "votes": "4",
    "answers": 0,
    "views": "2k",
    "tags": [
        "ida",
        "c++",
        "x86-64",
        "mfc"
    ],
    "user": "Benoit POTIER",
    "time": "Aug 29, 2022 at 7:00",
    "comments": [
        {
            "user": "mumbel",
            "text": "<span class=\"comment-copy\">Free and home both have x64 lumina access per their website.  You might want clarify what information you're asking for.  Your 'google' comment is unclear as Ghidra, r2, and binary ninja are other tools that do what IDA does.</span>",
            "time": null
        },
        {
            "user": "Benoit POTIER",
            "text": "<span class=\"comment-copy\">Hi Mumbel, thank for your answer. I've IDA free but I don't have in app header the menu \"Lumina\" and in the product comparaison (IDA Website) the Lumina function is limited to IDA Home to IDA Teams. I can found some other posts in the website to confirm this; IDA Free don't have access to Lumina server. I have missed somethings ?</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@mumbel going by the comparison matrix above, IDA Free doesn't have access to the Lumina function database. This may be similar to how the auto-analysis differs between Pro and Free. So perhaps it formally has the ability to connect to a Lumina server but isn't able to access the part that is relevant to get the function \"fingerprints\"?!</span>",
            "time": null
        },
        {
            "user": "Joshua Terrill",
            "text": "<span class=\"comment-copy\">If you think Lumina is the determining factor between you using the free edition vs upgrading to some version of the home edition, I wouldn't recommend it. Personally, I've tried using Lumina on a number of different binaries, and in most cases, nothing ever comes back rendering it mostly useless (for me, at least). If you're wanting to use the Lumina features for your own internal team, I might recommend looking at a solution like this: <a href=\"https://www.synacktiv.com/en/publications/investigating-ida-lumina-feature.html\" rel=\"nofollow noreferrer\">synacktiv.com/en/publications/…</a></span>",
            "time": null
        },
        {
            "user": "Benoit POTIER",
            "text": "<span class=\"comment-copy\">@JoshuaTerrill thank you for answer. I don't need anything else 😊 Have a nice day !</span>",
            "time": null
        }
    ],
    "answers_data": []
}