{
    "title": "Extract resource images from a games APK",
    "link": "https://reverseengineering.stackexchange.com/questions/30831/extract-resource-images-from-a-games-apk",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm looking to pull the images off of the game \"Summoners War\" to use for wallpapers and such. I have access to the images themselves, but they seem to be encrypted and cannot be viewed. Looking at the image in a hex viewer shows that the png headers are missing and have been replaced.<a href=\"https://i.sstatic.net/aZ87B.png\" rel=\"nofollow noreferrer\"><img alt=\"screenshot of hex data\" src=\"https://i.sstatic.net/aZ87B.png\"/></a></p>\n<p>I do have access to the sourcecode after decompiling with APKTool, but I am not entirely sure what I am looking for in order to decrypt the images. Ive looked around for anything relating to 'decrypt' but a lot of it has been dead ends with network decryption, not decryption of the asset files.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "634",
    "tags": [
        "decryption",
        "apk"
    ],
    "user": "KevinT",
    "time": "Aug 27, 2022 at 12:46",
    "comments": [
        {
            "user": "KevinT",
            "text": "<span class=\"comment-copy\">Ah I see. Thanks I completely overlooked that the files were already in PNG so i was thinking in that direction. I was able to strip the first 16 bits, change the format to jpg and can view them.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Your hex dump shows the plan-text word <code>JFIF</code>. These four letters are an indicator for an <a href=\"https://en.wikipedia.org/wiki/JPEG\" rel=\"nofollow noreferrer\">JPEG image</a>, not a PNG image.</p>\n<p>The magic bytes of a JPEG image are <code>FF D8 FF</code> which are also present in your hex dump starting at offset <code>0x10</code> which indicates that with a high probability you have a JPEG image here.</p>\n</div>",
            "votes": "3",
            "user": "Robert",
            "time": "Aug 28, 2022 at 10:43",
            "is_accepted": false,
            "comments": []
        }
    ]
}