{
    "title": "Am I missing symbols when RE'ing shellcode?",
    "link": "https://reverseengineering.stackexchange.com/questions/30878/am-i-missing-symbols-when-reing-shellcode",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a question about reversing a <a href=\"https://blog.nviso.eu/2021/09/02/anatomy-and-disruption-of-metasploit-shellcode/\" rel=\"nofollow noreferrer\">tutorial</a> which shows how to reverse engineering shellcode. My question is simple:</p>\n<p>In figure 4, we see at (7) <code>TEX.ProcessEnvironmentBlock</code>: is this a comment, or was IDA able to figure this out?\nWhen I reverse engineer the same payload, I see</p>\n<pre><code>edx, fs:[eax, 30h]\n</code></pre>\n<p>And at (8) I see:</p>\n<pre><code>edx, [edx, 0Ch]\n</code></pre>\n<p>is my IDA set up not correct? I heard about hard coded vtable values(?) which have an integer identifier. Not sure if I am mixing up things at the moment, but is that what we are looking at?</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "164",
    "tags": [
        "ida",
        "shellcode"
    ],
    "user": "hongkongcoffin",
    "time": "Nov 29, 2022 at 7:08",
    "comments": [
        {
            "user": "blabb",
            "text": "<span class=\"comment-copy\">that is not a comment the analyzer has added the structure peb and applied it to relevent offset  go to structures tab insert peb structure abd right click on 0x30 ida should suggest the member</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The user has applied a structure field reference to that operand. To do the same yourself, place your cursor over the memory operand (i.e., <code>[eax+30h]</code>) and press <code>T</code> to bring up the list of possible structures to apply.</p>\n<p>Two more notes. IDA knows about many structures, but you might have to do a few things before you're able to select them from the <code>T</code> window as described above. If you don't see the structure you want in that window:</p>\n<ol>\n<li><p>The first thing to try is to go to the structures window (<code>Shift-F9</code> on Windows, or <code>View -&gt; Open subviews -&gt; Structures</code>) and press <code>Insert</code> to create  a structure. Then select <code>Add standard structure</code>, and choose the one you want.</p>\n</li>\n<li><p>If the structure you want doesn't appear in the window popped up by <code>Add standard structure</code>, you might have to load a type library first. Go to <code>View -&gt; Open subviews -&gt; Type libraries</code>, then right-click and select <code>Load type library...</code> to see the list that IDA has available.</p>\n</li>\n</ol>\n</div>",
            "votes": "1",
            "user": "Rolf Rolles",
            "time": "Sep 14, 2022 at 15:50",
            "is_accepted": false,
            "comments": []
        }
    ]
}