{
    "title": "How do I install fail2ban to Zyxel nas326",
    "link": "https://reverseengineering.stackexchange.com/questions/30902/how-do-i-install-fail2ban-to-zyxel-nas326",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So I just got Zyxel nas326 and I looked from internet how to protect nas from bruteforce attack and I found that fail2ban can protect my nas.</p>\n<p>Then I found that I can't download any programs to nas326. So now I ask how I can Install fail2ban to Zyxel nas326.</p>\n<p>I know in theory I can use wget to download it from my own ftp server and run it, because that nas have python by default, but command <code>pip</code> doesn't work\" (<code>python</code> work). Commands like <code>sudo</code> and <code>apt-</code> dont work</p>\n<p>Anyone have done this before? Any other suggestions for bruteforce protection?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "249",
    "tags": [
        "linux"
    ],
    "user": "UDC",
    "time": "Sep 20, 2022 at 15:00",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can still install things manually if you don't have package management tools available.</p>\n<p>You have ssh access, so you could simply copy the fail2ban files and configuration via <code>scp</code> from your machine.</p>\n<p>It's also possible that whenever you update the NAS firmware, all your customisation may disappear.</p>\n<p>I would suggest that you write a shell script, or an Ansible playbook, or use some other kind of configuration management to reapply your fail2ban config to the system if/when you update the firmware.</p>\n</div>",
            "votes": "2",
            "user": "Mega Tonnage",
            "time": "Sep 21, 2022 at 3:25",
            "is_accepted": false,
            "comments": [
                {
                    "user": "UDC",
                    "text": "<span class=\"comment-copy\">I hosted my own ftp server and used <code>wget</code> to get the file. Then I extraced the file and run <code>python setup.py install</code>. It started installing, but after while it said \"error: could not create '/usr/share/doc': Read-only file system\" Then I tried <code>chmod o-rwx foldername</code> . Then It gave error: \"chmod: usr/: Read-only file system\". :(</span>",
                    "time": null
                },
                {
                    "user": "Mega Tonnage",
                    "text": "<span class=\"comment-copy\">Yes, you may not be able to use standard install methods. Try placing the files where required manually... you don't really need the docs, so you could ditch those. These instructions may help: <a href=\"https://github.com/fail2ban/fail2ban/wiki/How-to-install-or-upgrade-fail2ban-manually\" rel=\"nofollow noreferrer\">github.com/fail2ban/fail2ban/wiki/…</a></span>",
                    "time": null
                }
            ]
        }
    ]
}