{
    "title": "Redirect exception handler?",
    "link": "https://reverseengineering.stackexchange.com/questions/30947/redirect-exception-handler",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm working on a localization project and have a few trampoline hooks to translate some text in an online game. Periodically throughout gameplay, there are checks that run in the background to ensure the <code>.text</code> section of the game hasn't been modified. Of course I've done this with the existence of trampoline hooks, so the check fails and I'm met with what looks like a custom error code of <code>INVALID_CALL_1</code>.</p>\n<p>I've attempted for months to figure out how this checksum is calculated, but I don't believe I have the skills necessary to figure this out, so I'm looking at other options.</p>\n<p>I'm wondering if this logic seems reasonable, but would you theoretically be able to re-direct how the exception is handled using something like <a href=\"https://learn.microsoft.com/en-us/windows/win32/api/errhandlingapi/nf-errhandlingapi-setunhandledexceptionfilter\" rel=\"nofollow noreferrer\">SetUnhandledExceptionFilter</a> to check if the exception matches <code>INVALID_CALL_1</code> and have it return <code>EXCEPTION_CONTINUE_EXECUTION</code> instead? I don't mind doing the work, but wanted to know if my logic is flawed as I haven't worked with the Windows API all that much and am unsure where to ask this question.</p>\n<p>Thanks.</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "54",
    "tags": [
        "function-hooking",
        "winapi",
        "game-hacking",
        "exception"
    ],
    "user": "isuckatreversing",
    "time": "Oct 3, 2022 at 18:31",
    "comments": [
        {
            "user": "Rolf Rolles",
            "text": "<span class=\"comment-copy\">Can you elaborate on what makes you sure that there's an exception thrown somewhere, as opposed to, say, an if-statement?</span>",
            "time": null
        }
    ],
    "answers_data": []
}