{
    "title": "Reversing .net crypter with obfuscated imports",
    "link": "https://reverseengineering.stackexchange.com/questions/30998/reversing-net-crypter-with-obfuscated-imports",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have started recently with reverse engineering. I came across the linked file. It is a packed/crypted putty.exe. (<code>WARNING: IT MAY BE BACKDOORED!!</code>)</p>\n<p>How it's working and loading putty.exe with runpe is clear. But it has anti reversing techniques I don't understand.</p>\n<p>For example, all imports are obfuscated. It can't be opened by ILSpy (dotpeek works).</p>\n<ul>\n<li>Can someone explain which technique is used to obfuscate the imports and how this works?</li>\n<li>Are they loading imports dynamically and how does this work?</li>\n<li>Is this done after compilation or in source code?</li>\n</ul>\n<p>Some code on how this is done would also be helpful.\nI did not know this is even possible.<br/></p>\n<p>Download Link (THE FILE MAY BE BACKDOORED SO BE CAREFUL):<br/>\npassword for the file is \"reverse\"<br/>\n<a href=\"https://easyupload.io/4ekdna\" rel=\"nofollow noreferrer\">https://easyupload.io/4ekdna</a><br/></p>\n<p><a href=\"https://i.sstatic.net/ulaB2.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/ulaB2.png\"/></a>\n<a href=\"https://i.sstatic.net/nUIEm.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/nUIEm.png\"/></a></p>\n<p>Thanks for help</p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "292",
    "tags": [
        "malware",
        "obfuscation",
        ".net"
    ],
    "user": "Sauseee",
    "time": "Mar 1, 2023 at 2:34",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It looks like the crypter is using a technique called \"Dynamic Import Obfuscation\". This means that the imports are not statically resolved at compile-time, but instead are resolved at runtime. This makes it more difficult to reverse engineer the program, because you cannot simply look at the imported symbols to understand what the program is doing.</p>\n<p>To understand how this works, you need to first understand how normal, static import resolution works. When a program is compiled, the compiler looks at all the symbols that are imported by the program and resolves them to specific addresses. This means that when the program is run, the system knows exactly which addresses to use for the imported functions.</p>\n<p>With dynamic import obfuscation, the process is slightly different. Instead of resolving the imports at compile-time, the program resolves them at runtime. This means that the program needs to have some way of knowing which functions to import, and then look up the addresses of those functions at runtime.</p>\n<p>There are different ways to do this, but one common method is to use a stub function. The program will first call the stub function, which will then resolve the address of the real function and return it. The program can then call the real function using the returned address.</p>\n<p>This technique makes it more difficult to reverse engineer the program, because it is not trivial to understand which functions are being imported and what they are doing. However, with some careful analysis, it is possible to understand what the program is doing. If you are interested in learning more about this technique, I suggest doing some research on dynamic import obfuscation.</p>\n</div>",
            "votes": "1",
            "user": "Ms_bot",
            "time": "Oct 15, 2022 at 17:09",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>To retrieve all used winapi's the best way at runtime level.\nOne of usefull tools is <a href=\"http://www.rohitab.com/apimonitor\" rel=\"nofollow noreferrer\">apimonitor</a>.\nJust configure it at api list you need and execute binary.</p>\n</div>",
            "votes": "0",
            "user": "BenjaminL",
            "time": "Jan 20, 2023 at 10:00",
            "is_accepted": false,
            "comments": []
        }
    ]
}