{
    "title": "Secure RE-ing a PHP script",
    "link": "https://reverseengineering.stackexchange.com/questions/310/secure-re-ing-a-php-script",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a very messy PHP script of which I need to determine the function. I can't quite understand the code, it's <em>really</em> messy. Now I thought that I perhaps could reverse engineer this script.</p>\n<p>What I want to do is to run this script (eventually with specific parts commented) to gain a better understanding of what part of the script does what. With that information, I should be able to get a full understanding of the script.</p>\n<p>However, I do not want to change anything in the database on the server, I do not want that the script is going to mail things, etc. Basically, the script should be totally separated from the world, but I do want to see what it <em>tries</em> to do. So, for example, when the script runs a <code>mail()</code> function, I want to see that a mail would've been sent if the script wasn't separated from the world.</p>\n<p>I therefore need a copy of the server installation (Ubuntu Server 12.04), which isn't that hard. The hard part is that I need to have a system which <em>acts</em> like it is the outside world, but actually is a <em>logging system</em> in which I can see what's happening. </p>\n<p>Are there any tools that can do this? If not, how should I go in building it myself?</p>\n</div>",
    "votes": "7",
    "answers": 4,
    "views": "427",
    "tags": [
        "tools",
        "php"
    ],
    "user": null,
    "time": "Mar 27, 2013 at 13:43",
    "comments": [
        {
            "user": "asheeshr",
            "text": "<span class=\"comment-copy\">Is the <a href=\"https://reverseengineering.stackexchange.com/questions/tagged/software\">software</a> tag necessary here ? <a href=\"http://meta.reverseengineering.stackexchange.com/q/3/189\">meta.reverseengineering.stackexchange.com/q/3/189</a></span>",
            "time": null
        },
        {
            "user": "user187",
            "text": "<span class=\"comment-copy\">@AshRj I removed it.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I would recommend using virtual machines to test your sample.  If the sample is going to be interacting with other machines (for example, if it sends mail but the mail server is located at mail.example.com) then you will probably want to emulate a two machine setup. If everything is already configured on the machine where your sample will be running (so mail calls are made locally) then you will probably only need one virtual machine.</p>\n<h2>Set up a Virtual Machine Host Only Network</h2>\n<p>You can use VMWare if you have it or you can use the <a href=\"http://www.virtualbox.org\" rel=\"noreferrer\">VirtualBox</a>, which is free. If you use a host only network (<a href=\"http://www.vmware.com/support/ws55/doc/ws_net_configurations_hostonly.html\" rel=\"noreferrer\">VMWare</a> or <a href=\"http://www.virtualbox.org/manual/ch06.html#network_hostonly\" rel=\"noreferrer\">VirtualBox</a> instructions) then you can sniff the network traffic of the VMs from within your host, but the traffic will never leave your host.</p>\n<h2>Before running the sample</h2>\n<p>If you suspect this php script will change the state of your virtual machine (for example it will drop databases or overwrite files) then I suggest you take a snapshot. This way you can always revert any changes that are made when the script runs. <a href=\"http://www.vmware.com/support/ws4/doc/preserve_snapshot_ws.html\" rel=\"noreferrer\">VMWare</a> or <a href=\"http://www.virtualbox.org/manual/ch01.html#snapshots\" rel=\"noreferrer\">VirtualBox</a> instructions.</p>\n<h2>Running the Sample</h2>\n<p>Once the virtual network is built, you can run your sample while capturing traffic with a tool like <a href=\"http://www.wireshark.org/\" rel=\"noreferrer\">wireshark</a>. This will capture all the network traffic</p>\n<h3>Getting outside feedback</h3>\n<p>As you described it, your sample probably won't need to communicate with fake services, but if it does, here are a few applications you can look into.</p>\n<ul>\n<li>Windows\n<ul>\n<li><a href=\"http://sourceforge.net/projects/fakenet/\" rel=\"noreferrer\">FakeNet</a> as mentioned by Mick, this is a good solution if you are running on windows XP SP3.</li>\n</ul>\n</li>\n<li>Linux\n<ul>\n<li><a href=\"http://www.inetsim.org/\" rel=\"noreferrer\">inetsim</a> - This will simulate responses for application level protocols such as HTTP, TCP or SMTP. It can also reply to DNS requests.</li>\n<li><a href=\"http://www.honeyd.org/\" rel=\"noreferrer\">honeyd</a> - This is ligheter than inetsim but will also simulate responses for application level protocols such as HTTP, TCP or SMTP. It can also reply to DNS requests.</li>\n<li><a href=\"http://nkush.blogspot.com/2010/11/fake-arp-daemon.html\" rel=\"noreferrer\">farpd</a> - This utility is very useful if you don't know the IP address that will be request.  This application can be used to redirect IP traffic to your virtual machine.</li>\n</ul>\n</li>\n</ul>\n</div>",
            "votes": "10",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You may be able to use the open-source <a href=\"http://sourceforge.net/projects/fakenet/\">FakeNet</a> to simulate a real network. </p>\n<p>However, FakeNet is designed to be run on an <strong>XP SP3 system</strong>, so using it would require you to ensure traffic is routed from your Ubuntu system/VM to an XP sp3 system/VM.</p>\n<p>There are likely some Linux based FakeNet alternatives out there, but I've used FakeNet before when analyzing Windows malware and it works very well.</p>\n<p><strong>Features</strong></p>\n<ul>\n<li>Supports DNS, HTTP, and SSL</li>\n<li>HTTP server always serves a file and tries to serve a meaningful file; if the malware request a .jpg then a properly formatted .jpg is served, etc.  The files being served are user configurable.</li>\n<li>Ability to redirect all traffic to the localhost, including traffic destined for a hard-coded IP address.</li>\n<li>Python extensions, including a sample extension that implements SMTP and SMTP over SSL.</li>\n<li>Built in ability to create a capture file (.pcap) for packets on localhost.</li>\n<li>Dummy listener that will listen for traffic on any port, auto-detect and decrypt SSL traffic and display the content to the console.</li>\n</ul>\n</div>",
            "votes": "5",
            "user": "Mick",
            "time": "Mar 27, 2013 at 14:12",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>A more general solution is to use something like <a href=\"http://php.net/manual/en/book.runkit.php\">runkit</a>, a PHP extension to intercept arbitrary function calls. Rather than trying to simulate a network (the safer option for your situation), if you instead knew the complete set of functions that you wanted to prevent from being called, you could simply <code>runkit_function_redefine</code> each to log a message instead.</p>\n</div>",
            "votes": "5",
            "user": "Daniel W. Steinbrook",
            "time": "Mar 28, 2013 at 2:34",
            "is_accepted": false,
            "comments": [
                {
                    "user": "amccormack",
                    "text": "<span class=\"comment-copy\">The downside to this kind of approach is you have to predefine what you want to catch where you may not know beforehand.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Since you already have the source file, I believe that there is a simpler and easier approach (as compared to rerouting network traffic on low levels would be to intercept the methods being called.)</p>\n<p>Firstly, identify and replace methods in your php file (remember to make a copy!). For example, if you want to intercept <code>mail()</code>, you can find <code>mail(</code> and replace it with <code>shim_mail(</code>. You can also do so for other <em>interesting</em> methods such as <code>mysql_connect()</code>. </p>\n<p>Once you finish, add <code>include 'shim.php';</code> at the top of your file. The \"shim\" will act as a layer between the php script and the actual method, so you can choose to log it to a text file, allow it to execute, or even point it to a replica database!</p>\n<p><strong>shim.php</strong>\n<pre><code>$logfile = 'log.txt';\n\nfunction shim_mysql_connect($server, $username, $password, $new_link = false, $client_flags = 0)\n{\n    file_put_contents($logfile, file_get_contents($logfile) . \"\\r\\nmysql_connect() to \" . $server . \" with username \" . $username . \" and password \" . $password);\n\n    // intercept the command and point it to the 'honeypot'\n    return mysql_connect('your_new_server', 'username', 'password');\n}\n\nfunction shim_mail($to, $subject, $message, $additional_headers = '', $additional_parameters = '')\n{\n    file_put_contents($logfile, file_get_contents($logfile) . \"\\r\\nmail() to \" . $to . \" with subject \" . $subject . \" and message \" . $message);\n\n    // don't actually send an email\n}\n\n?&gt;\n</code></pre>\n<p>In this shim file, you can add functions that you are interested to find out about (simply by copying the same method signature as the original file and printing relevant logs). By observing the log, you can probably find out a lot more about the php script!</p>\n<p>(while I was midway composing this, I realized that Daniel W. Steinbrook has also come up with a similar method. My method has a slight advantage that it is simpler without adding new dependencies, but runkit sounds like a more <em>correct</em> way. Either way, you can simply pick one that works!)</p>\n</p></div>",
            "votes": "3",
            "user": "jg0",
            "time": "Mar 28, 2013 at 8:23",
            "is_accepted": false,
            "comments": [
                {
                    "user": "amccormack",
                    "text": "<span class=\"comment-copy\">The simplicity of this technique is worth noting.</span>",
                    "time": null
                },
                {
                    "user": "Michael Anderson",
                    "text": "<span class=\"comment-copy\">This technique is NOT sufficient.  <a href=\"http://www.php.net/manual/en/functions.variable-functions.php\" rel=\"nofollow noreferrer\">php.net/manual/en/functions.variable-functions.php</a></span>",
                    "time": null
                }
            ]
        }
    ]
}