{
    "title": "Is there a Capturebat alternative on windows 10 for file capture?",
    "link": "https://reverseengineering.stackexchange.com/questions/31039/is-there-a-capturebat-alternative-on-windows-10-for-file-capture",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've been looking for a capturebat alternative that will function on Windows 10 and 64 bit.</p>\n<p>I'm not interested in capturbat's network capabilities; rather, I'm interested in its capacity to capture file changes and save a duplicate of all files that were created, edited, or deleted.</p>\n<p>I know you can manually copy all files or set permissions on a certain folder to avoid deletion, but isn't there something like to capturebat?</p>\n<p>thanks a lot,</p>\n</div>",
    "votes": "3",
    "answers": 0,
    "views": "103",
    "tags": [
        "malware",
        "static-analysis",
        "tools",
        "dynamic-analysis"
    ],
    "user": "dakar111",
    "time": "Oct 25, 2022 at 12:29",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">When talking about certain software please always include a link to the software web site.  Software recommendation question should better be posted here: <a href=\"https://softwarerecs.stackexchange.com\">softwarerecs.stackexchange.com</a> BTW: it would be more helpful if you would mention what functionality you want and not what you don't want...</span>",
            "time": null
        },
        {
            "user": "dakar111",
            "text": "<span class=\"comment-copy\">thanks for your comment  here is the link to capturebat:<a href=\"https://www.honeynet.org/projects/old/capture-bat/\" rel=\"nofollow noreferrer\">honeynet.org/projects/old/capture-bat</a>  and I specified in my thread what I need the software to do: \"I'm interested in its capacity to capture file changes and save a duplicate of all files that were created, edited, or deleted.\"</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">The only thing (other than an FSFD) that comes to mind are VSS snapshots. They deliver something that is somewhat akin to what you want. But the way you describe it it sounds as if a file system filter driver is involved. All links on the above site were dead, but someone <a href=\"https://github.com/ph0sec/CaptureBAT-client\" rel=\"nofollow noreferrer\">put it on GitHub</a>. A cursory look shows that this is an FS mini-filter, something that is supported to this day. So if you revive the project and overcome the hard code-signing requirements on modern Windows, you could arguably get it to work.</span>",
            "time": null
        },
        {
            "user": "peter ferrie",
            "text": "<span class=\"comment-copy\">I’m voting to close this question because it's not related to reverse-engineering.</span>",
            "time": null
        },
        {
            "user": "dakar111",
            "text": "<span class=\"comment-copy\">@peterferrie have you ever heard of Dynamic/Behavioral analysis?</span>",
            "time": null
        }
    ],
    "answers_data": []
}