{
    "title": "Decrypt Keybindings for EVE Online",
    "link": "https://reverseengineering.stackexchange.com/questions/31194/decrypt-keybindings-for-eve-online",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've had this idea for a while for a tool I'd like to make to assist people in getting used to keybinds in EVE Online. Not sure how useful it'd actually be, but seems like a fun project nonetheless.</p>\n<p>I've plenty experience with C#, C++ and .NET so that's all fine, my struggle is trying to understand the format this stuff is stored in.</p>\n<p>I have done some very, very basic reverse engineering in the past but my brain is far too smooth for something more complex like this.</p>\n<p>I've generated 2 files, <code>Old.dat</code> and <code>New.dat</code>, they should be identical - the only difference being I changed one keybinding. Which should be <code>charSheetSelectedPanel</code>.</p>\n<p><code>Old.dat</code> should have that feature bound to <code>ALT-A</code>.<br/>\n<code>New.dat</code> should have that feature bound to <code>CTRL-ALT-A</code>.</p>\n<p>I have set up a <a href=\"https://www.diffchecker.com/0djogReX\" rel=\"nofollow noreferrer\">DiffChecker here</a>. The change in question should be on line <code>59</code>.</p>\n<p>I've looked at this with HxD, but am not able to make any sense out of it. I'm aware that the shortcuts are most likely not gonna be strings, but rather integers that refer to keycodes. I'm hoping that they use known keycode formats.</p>\n<p>But so far no dice and have no idea how to approach this or if it's even feasible. Any pointers/help would be greatly appreciated!</p>\n</div>",
    "votes": "4",
    "answers": 0,
    "views": "94",
    "tags": [
        "decryption",
        "deobfuscation",
        "game-hacking",
        "unknown-data"
    ],
    "user": "Dealman",
    "time": "Dec 15, 2022 at 8:38",
    "comments": [
        {
            "user": "EncoderX",
            "text": "<span class=\"comment-copy\">I'm sorry i don't have enough points to add a comment to your post and this is not the answer you're looking for. May i know why you're not using Ida or x64/32dbg or even cheat engine in your workflow? I suppose you could hook the function that writes to file and check what happens there?</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Welcome to RE.SE. @EncoderX I converted your non-answer to a comment. Given your awareness of how the reputation affects the ability to comment, I reckon you don't mind.</span>",
            "time": null
        },
        {
            "user": "Dealman",
            "text": "<span class=\"comment-copy\">@EncoderX I'm still very new to this, I'll look those programs up and check out how hooking into the process works. The idea I have is nothing malicious, but I fear that the devs make not take kindly to you hooking into their game's process?</span>",
            "time": null
        }
    ],
    "answers_data": []
}