{
    "title": "exe file not opening after patching",
    "link": "https://reverseengineering.stackexchange.com/questions/31249/exe-file-not-opening-after-patching",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I hope everyone is well. I'm new here and I'm hope someone can help me with the problem I'm facing.\nI've been trying to reverse engineer a program but everytime I change an instruction, not matter how small it is, I always get the same result which is after I patch the file it simply wont open and it looks like it saved properly and everything is fine but it just doesn't open. I suspect it's probably an Anti-debug feature because other program I've dealt with in the past don't give me this issue. I've the basic solutions provided on the internet but nothing works. I'm use x64dbg and if I try to run the file in the debugger I get a \"A debbuger has been found running in your system. please unload it from memory and restart your program.\"\nAny information would greatly appreciated. Thank you in advance.</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "649",
    "tags": [
        "x64dbg"
    ],
    "user": "jjprince",
    "time": "Dec 8, 2022 at 18:37",
    "comments": [
        {
            "user": "Remko",
            "text": "<span class=\"comment-copy\">It might have a checksum to prevent any modifications or it could be digitally signed and checking it's own signature</span>",
            "time": null
        },
        {
            "user": "jjprince",
            "text": "<span class=\"comment-copy\">I've been trying to find the checksum but with no luck can you please advise me on how I would go about identifying it. Thank you for your response.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<blockquote>\n<p>after I patch the file it simply wont open</p>\n</blockquote>\n<p>do your best and forget the rest</p>\n<blockquote>\n<p>it looks like it saved properly and everything is fine but it just\ndoesn't open.</p>\n</blockquote>\n<p>did you figure that out just by looking into the matrix, Neo?</p>\n<p>Before debugging, hide the debugger using this option:</p>\n<p><a href=\"https://i.sstatic.net/6mbRC.png\" rel=\"nofollow noreferrer\"><img alt=\"How to hide debugger\" src=\"https://i.sstatic.net/6mbRC.png\"/></a></p>\n</div>",
            "votes": "2",
            "user": null,
            "time": "Dec 9, 2022 at 6:09",
            "is_accepted": false,
            "comments": [
                {
                    "user": "jjprince",
                    "text": "<span class=\"comment-copy\">I've tried to hide the Debugger but I still get the same result.</span>",
                    "time": null
                }
            ]
        }
    ]
}