{
    "title": "How to access files stored in mouse?",
    "link": "https://reverseengineering.stackexchange.com/questions/31261/how-to-access-files-stored-in-mouse",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I own a Razer Mamba Elite mouse. After plugging it in to the usb port, an software installation window shows up. Basically it's the Razer software to manage device's options such as profiles, macros, LED modes etc. The installer pop-up made my wonder, if I can browse the mouse just like a USB storage device, because it seems that it contains some files. Is there anyone who knows if it's possible and could tell me how, to achieve it? I mainly use Windows, but some Linux tinkering is fun for me too.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "293",
    "tags": [
        "windows",
        "linux",
        "hardware"
    ],
    "user": "Matt",
    "time": "Dec 11, 2022 at 13:59",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">I would start using an USB sniffer software to check what protocol is used for saving these \"files\". There are some USB sniffing tools for Windows or you use Wireshark + USBPcap to check the protocol. Once you have reverse engineered the protocol you can start to write your own tool to communicate with the mouse.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE. Have you tried the disk management snap-in of the management console (<code>diskmgmt.msc</code>) or something like USBDeView to list the USB devices? Side-note: <a href=\"https://www.uwe-sieber.de/usbdlm_e.html\" rel=\"nofollow noreferrer\">USBDLM</a> also comes with a tool to list USB drives. However, keep in mind that the mouse may act as MTP device or similar (this would be what you see when attaching certain cameras or phones to Windows). These appear in Windows Explorer namespace, but aren't technically mounted volumes in the sense that disk management deems volumes.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is it the wired or wireless version? And do you have the Razer software already installed or is it really started from the USB?</p>\n<p>You could tear down the mouse and identify the chips. If you are lucky you find some EEPROM which contains all files.</p>\n<p>Someone did a teardown some years ago but it looks like there is an empty place for maybe the EEPROM and a 8 pin header. The header can maybe be used for dumping/flashing files via USART/JTAG according to the datasheet.</p>\n<p><a href=\"https://www.reddit.com/r/MouseReview/comments/9ap7fp/razer_mamba_elite_has_paw3390_sensor_not_pmw3389/\" rel=\"nofollow noreferrer\">https://www.reddit.com/r/MouseReview/comments/9ap7fp/razer_mamba_elite_has_paw3390_sensor_not_pmw3389/</a></p>\n<p><a href=\"https://www.weistang.com/article-10685-4.html\" rel=\"nofollow noreferrer\">https://www.weistang.com/article-10685-4.html</a></p>\n</div>",
            "votes": "2",
            "user": "secfren",
            "time": "Dec 17, 2022 at 11:36",
            "is_accepted": false,
            "comments": []
        }
    ]
}