{
    "title": "turning decompiled C++ code into writable C++",
    "link": "https://reverseengineering.stackexchange.com/questions/31301/turning-decompiled-c-code-into-writable-c",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Here's my scenario I currently have a DLL that was made in like 2003 archived that has data and functions I still need to use and I'm also 90% sure the DLL doesn't work correctly as its too outdated. (Don't worry this is free software not under any license anymore).</p>\n<h2>Good news:</h2>\n<p>I already decompiled the code to C++ code (I got the assembly code to work as well but then I have no idea how to call the functions I need from C++ so I'm choosing to work with the decompiled C++ code).</p>\n<h2>The problem:</h2>\n<p>How do I convert the decompiled C++ code to writable C++ code as the decompiled C++ code is practically machine C++ code. I know there have been similar questions but no clear solutions.</p>\n<h2>To provide a diagram as to where my problem is check below:</h2>\n<p>(outdated)DLL &gt; Disassembled ASM &gt; Disassembled C++ nearly 85% writable but uses Qword Dword, precision integers like int32 or int64. &gt; convert to writable C++ code</p>\n<p>If you know any software that can translate decompiled C++ code into writable C++ that would be helpful as I have gotten too close to making this work.</p>\n</div>",
    "votes": "2",
    "answers": 2,
    "views": "3k",
    "tags": [
        "c++",
        "dll"
    ],
    "user": "DB_Coding",
    "time": "Dec 25, 2022 at 4:25",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<blockquote>\n<p>If you know any software that can translate decompiled C++ code into writable C++</p>\n</blockquote>\n<p>there is absolutely no software that would immediately generate a writable C/C++ listing, just as there is no such software that would replace or do the work of a reverse engineer.</p>\n<p><a href=\"https://hex-rays.com/\" rel=\"nofollow noreferrer\">Hex-Rays decompiler</a> does not create a writable C/C++ listing. It creates pseudocode that the reverse engineer must KNOW and BE ABLE to translate into a writable listing.</p>\n</div>",
            "votes": "1",
            "user": null,
            "time": "Dec 24, 2022 at 20:26",
            "is_accepted": false,
            "comments": [
                {
                    "user": "DB_Coding",
                    "text": "<span class=\"comment-copy\">Look man I'm not happy doing this I actually got the assembly code to recompile no problem at this point I'm forced to use C++ as there no command for C++ to read assembly data for functions unless you heard of one as then I would be done with this conversation this would be a complete 1 off for me.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I completely agree with previous answer of @rce, but would like to provide a bit more details regarding why is it really so.</p>\n<p>Let's assume that the initial code of this DLL was wrote in C++ and then was compiled as DLL. During the compilation the following information was <strong>completely and almost unrecoverably lost</strong> (if you don't have the corresponding .pdb file with debug information or RTTI inside):</p>\n<ul>\n<li>function names (part of which can be recovered from mangling data, but still)</li>\n<li>data types such as structures and classes (both names, inheritance if it was used and internal layout)</li>\n<li>Templates data</li>\n<li>Inline functions</li>\n</ul>\n<p>Reverse engineering of C++ code is recovering this information from the usage context.</p>\n<blockquote>\n<p>there is <strong>absolutely no software</strong> that would immediately generate a\nwritable C/C++ listing</p>\n</blockquote>\n<p>here means that you can not automatically generate the lost information out of nothing, so you'll need to perform some reverse engineering manually.</p>\n</div>",
            "votes": "0",
            "user": "w s",
            "time": "Dec 25, 2022 at 9:32",
            "is_accepted": false,
            "comments": []
        }
    ]
}