{
    "title": "Inverter BLE communication module receives commands in HCI_ACL but apk shows ATT",
    "link": "https://reverseengineering.stackexchange.com/questions/31339/inverter-ble-communication-module-receives-commands-in-hci-acl-but-apk-shows-att",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a solar inverter which can be queried through mobile apps, <em>eSolar O&amp;M</em> or <em>eSolar SET</em>. My goal is to read values from the inverter (solar power, grid consumption...) by querying the device from a home made program, and possibly implement this on an ESP32.</p>\n<p>The communication between the app and the inverter goes through a <a href=\"https://img.saj-electric.com/file/eSolar%20WiFI-2%20module%20User%20manual%20V0-20211229024257809.pdf\" rel=\"nofollow noreferrer\">BLE device</a>, which internally sends and gets information using the Modbus protocol.\nI've unpacked the <code>apk</code> and every command sent to the module is clearly available as an hexadecimal string, everything is very straightforward, from the string building to the hash applied to it. From the app point of view, this string is sent through <em>BLE</em> using <em>ATT</em> commands, yet when I try to send those commands either with a <code>python</code> script, <code>gatttool</code> or even using the <em>nRF Connect</em> mobile app, I receive an <code>ack</code> from the device (<code>49 04 02 01 00</code>) to the notification handle, but no result.<br/>\nIn order to understand the communication between the app and the device, I've enabled <em>HCI snooping</em> on the Android device and got a clean capture. And while what seems to be an initial setup (BLE characteristics, MTU negocition...) happen using <em>ATT</em> commands, it switches to <em>HCI_ACL</em> to query the device and the communication between the 2 becomes unreadable.<br/>\nMoreover, <code>grep</code>'ing the initial commands sent by the app in the extracted <code>apk</code> gives no match. I am sure the <code>apk</code> is the one installed.<br/>\nThe more puzzling is that a person from this inverter (<em>SAJ H1</em>) hacking community is able to send <em>ATT</em> commands and receives results, the only difference is that I have a more recent firmware on the <em>BLE</em> module.</p>\n<p><a href=\"https://i.sstatic.net/JdVaR.png\" rel=\"nofollow noreferrer\"><img alt=\"Wireshark Capture\" src=\"https://i.sstatic.net/JdVaR.png\"/></a></p>\n<p>Does this rings a bell to anyone? Any idea on how to proceed?</p>\n</div>",
    "votes": "3",
    "answers": 0,
    "views": "148",
    "tags": [
        "apk",
        "bluetooth"
    ],
    "user": "iMil",
    "time": "Dec 31, 2022 at 8:41",
    "comments": [],
    "answers_data": []
}