{
    "title": "What computer components improve the speed of disassembly in IDA Pro and plugins like BinDiff?",
    "link": "https://reverseengineering.stackexchange.com/questions/31389/what-computer-components-improve-the-speed-of-disassembly-in-ida-pro-and-plugins",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I’m disassembling binaries in <strong>IDA Pro</strong>.</p>\n<ul>\n<li>It usually takes <strong>15+ minutes</strong> just to pre-process/open one binary,</li>\n<li>Then another <strong>20-30 min</strong> before IDA is fully done disassembling and finally becomes idle.</li>\n<li>Another <strong>10+ mins</strong> to search for all string references.</li>\n<li>Further, something like <strong>BinDiff</strong> usually takes <strong>50-60+ mins</strong> each time I run it when comparing 2 disassembled .i64 files.</li>\n</ul>\n<p>What computer components are most important in these processes? Is it the CPU, RAM, storage/SSD, GPU, or some combo of those?</p>\n<p>I have an i7-9750H (2.60GHz, up to 4.50GHz with Turbo Boost, 6 Cores, 12MB Cache), 16 GB 2666MHz DDR4, an M.2 PCIe-NVMe SSD, and NVIDIA GeForce GTX 1650 Max-Q 4GB.</p>\n<p>I saw a similar question here (<a href=\"https://reverseengineering.stackexchange.com/questions/14053/is-there-a-way-to-improve-disassembler-speed\">Is there a way to improve disassembler speed?</a>), but I believe this is not a duplicate question because my binaries are much smaller and I’m still having these massive time delays. I’m wondering if any of these specific components could be holding me back and which would produce the highest throughout difference with regard to upgrading. Is it RAM size, RAM clock, CPU clock speed, CPU core count, CPU thread count, SSD read, write speed, or something else?</p>\n</div>",
    "votes": "3",
    "answers": 0,
    "views": "348",
    "tags": [
        "ida",
        "disassembly",
        "ida-plugin"
    ],
    "user": "Jacob Wheeler",
    "time": "Jan 17, 2023 at 10:20",
    "comments": [
        {
            "user": "Rolf Rolles",
            "text": "<span class=\"comment-copy\">How big are these binaries? (Disk size and number of functions are the metrics I'm most interested in; you can find the latter in the functions window, <code>Shift-F3</code>). How big is the address space for these binaries? IDA doesn't report this directly, but you can compute it by pressing <code>CTRL-S</code> to bring up the Segments window, and then subtracting the final <code>End</code> value by the first <code>Start</code> value.</span>",
            "time": null
        },
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">Which OS are you using? If it is Windows of any kind, did you try to disable antivirus software?</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">... and if Linux, are you running IDA natively. While I haven't had <i>this magnitude</i> of a performance impact, there could be some from running IDA in Wine. And if on Windows you may want to check for other resource hogs (MS Teams and other Electron-based apps are big contenders). Additionally you could use <code>Image File Execution Options</code> to raise or lower CPU and I/O priority by process name (e.g. to favor IDA) or use a solution such as Process Lasso (although I think there is no gratis offer for it).</span>",
            "time": null
        }
    ],
    "answers_data": []
}