{
    "title": "Making an exe file to recognize the Persian/Arabic characters",
    "link": "https://reverseengineering.stackexchange.com/questions/31431/making-an-exe-file-to-recognize-the-persian-arabic-characters",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So I have an <code>.exe</code> file  (<code>FileSplitter.exe</code>) and want to change the texts in its GUI to Persian/Arabic (It doesn't matter either is Arabic or Persian).</p>\n<p>Thus I changed it at first Hex Editing using HxD and the second time around with \"Resource Hacker\".</p>\n<p>Although the program is written with Wide Characters style and functions, it doesn't seem to recognize the characters and it gives \"<strong>?</strong>\".</p>\n<p>Therefore I thought the problem is the font, so I changed the font of the Dialog to \"Arial\"  but still it didn't work. I even changed the Dialog Language in Resource Hacker to Arabic/Persian it mostly broke the <code>.exe</code> file up and it wouldn't run but sometimes that it would work and run still couldn't recognize the characters. I even tried to change the manifest encoding to UTF-16LE but it seems Windows 11/10 only support UTF-8 encoding for manifest.</p>\n<p>And by the way the Program is written in MFC I can share the decompiled <code>.c</code> file with HexRays IDA Pro if you like but, it wouldn't help that much.</p>\n<p><a href=\"https://i.sstatic.net/yNIJX.png\" rel=\"nofollow noreferrer\"><img alt=\"\" src=\"https://i.sstatic.net/yNIJX.png\"/></a></p>\n<p>For example I edited the dialog into this code and when I run the <code>.exe</code> file it gives this error\n<a href=\"https://i.sstatic.net/MMlJB.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/MMlJB.png\"/></a></p>\n<p>So this is a reverse engineering project and I'm programming anything and can't use C++/C.</p>\n<p>What is the problem??</p>\n<p>Here is the exe file: <a href=\"http://www.mediafire.com/file/7yhqgwmkt004qj4/FileSplitter.exe\" rel=\"nofollow noreferrer\">http://www.mediafire.com/file/7yhqgwmkt004qj4/FileSplitter.exe</a></p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "78",
    "tags": [
        "ida",
        "hexrays",
        "decompile",
        "hex",
        "pe-resources"
    ],
    "user": "Fariwar Farsian",
    "time": "Jan 18, 2023 at 12:32",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE. Quite frankly I am not so sure this qualifies as a reverse engineering topic. But I'll play ball (for now). After copy-editing your question to bring some structure into it, I gather that the goal is to load your resource instead of the standard one, correct? In this case you first need to establish if the .exe has any anti-tampering measures in it. Going by your description -- for now -- I'd assume it doesn't. Next is to understand that MFC will usually attempt to load the resources (not just dialogs) based on the configured (system or user) locale.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">... in order for it to pick up your resource, you either need to change the existing resource -- which I gather you tried -- but leave <i>all</i> the traits about language intact, <i>or</i> you will have to add resources to the executable in your desired language. E.g. you could attempt to compile your shown resource script (the <code>.rc</code> file) with <code>rc.exe</code> from the Windows SDK and then link it into the existing <code>.exe</code>. I find the second option better, because if the developer used the default facilities it means the program could operate in its original language or Arabic, depending on the locale.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">There's potentially more, but it requires a look at the binary. Also, have you considered contacting the author to suggest contributing your translation? <b>Also</b> I was unable to download the file, but in either case it's bad style to attach files here, because eventually the links will go stale. We've seen it time and time again. This puts anyone seeing your question in a few years at quite a disadvantage, because depending on the quality of Q&amp;A they may not be able to make any sense of question or answer.</span>",
            "time": null
        },
        {
            "user": "Fariwar Farsian",
            "text": "<span class=\"comment-copy\">Hi thank you for your reply, at first I wanted to apologise so asking my question in the wrong section. So Let's get into the problem, No not quite that, I don't wanna load and entire custom resource file into it because in that way I think it would break the exe file but if it is the sufficient way to do it I'd be really glad to guide to do that cause I don't know how. now I've look into your idea about creating custom Dialog, there's just one thing about it, Let's say I'd create a custom resource file with my own Dialog and then injected it into the exe file but I can't make the buttons work</span>",
            "time": null
        },
        {
            "user": "Fariwar Farsian",
            "text": "<span class=\"comment-copy\">.....I can't make the buttons work their usual stuff, so they would be just empty with no action. By the way I changed the link of the exe file, you can download it now</span>",
            "time": null
        }
    ],
    "answers_data": []
}