{
    "title": "Reverse engineer Logitech Z906 serial console: getting started",
    "link": "https://reverseengineering.stackexchange.com/questions/3144/reverse-engineer-logitech-z906-serial-console-getting-started",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I would like to control my <a href=\"http://www.logitech.com/assets/36226/z906620-002920006ug403.pdf\" rel=\"noreferrer\">logitech Z906</a> remotely, e.g. with a webservice running on a raspberry pi connected to it's console.</p>\n<p>The console is connected over a DB-15 port to the subwoofer.</p>\n<p>I called logitech but they were unable to provide me with information concerning the protocol used between the console and the subwoofer.</p>\n<p>So I will need to reverse engineer this, however, I'm not sure on how to get started here. I suppose I just connect the console to a pc (running fedora), and press all the buttons and see what comes out, and then try the opposite, see what happens when I send these to the subwoofer?</p>\n<p>Do you have any general tips, what software to use, any special hardware?</p>\n<p>Do I just connect the 15 pins to 15 pins on my raspberry pi and read them out? Or is there an easy way to connect a DB-15 to a pc for easy testing (my vga port??)</p>\n<p><strong>follow up:</strong>\nSo far as I could tell the console is doing all audio decoding work, and sending raw analog signals to the subwoofer, so the console is doing a lot of inernal work, and is more then a simple frontend for sending commands to the subwoofer. Replacing all of this work is not what I want to do, I could just buy some 'dumb' audio equipment if I could do all the work that the console currently does, so I abandoned this project.</p>\n</div>",
    "votes": "11",
    "answers": 2,
    "views": "4k",
    "tags": [
        "serial-communication"
    ],
    "user": "Jens Timmerman",
    "time": "Apr 25, 2016 at 13:18",
    "comments": [
        {
            "user": "Kwibox",
            "text": "<span class=\"comment-copy\">Any luck so far? I would like to be able to control the z906 via rasberry as well. I wil examine the lines as soon as I have received my breadboard (not willing to cut in the cable directly)</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If I was doing this, in the absence of any other information at all, the first thing I would do is connect the sub to its console, and then cut open the cable and hook up a logic analyser or even just use a CRO to see what is happening on each of the 15 lines, and try and identify:</p>\n<ol>\n<li><p>Whether a line is even being used</p></li>\n<li><p>If it is simply just power (3v3, 5 or even 12V) or ground.  These can then also be confirmed / differentiated from signal lines using a multimeter to trace back to the relevant traces on the circuit boards.</p></li>\n<li><p>Attempt to guess what the protocol might be on each signal line</p></li>\n</ol>\n<p>I would start with a CRO on each line to try and identify the voltages first, so as to avoid potentially frying something else.</p>\n<p>The last thing I would do is just connect directly to a Raspberry Pi and hope for the best.</p>\n<p>Good tools for investigating unknown protocols include the Salae logic analyser (or clones), ant the OpenOCD software, and devices such as the Bus Pirate.</p>\n<p>Given this is audio gear it is not out of the question that only a couple of pins are actually used, possibly with the I2S protocol, or something else entirely.</p>\n</div>",
            "votes": "3",
            "user": "perror",
            "time": "May 23, 2014 at 6:56",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In case anyone ends up here.\nMy solution (years ago) was to program an Arduino with an IR LED to send commands to the unit mimicking the remote control.\nThe arduino also has ethernet and runs a webserver ( <a href=\"https://github.com/ovidiucp/TinyWebServer\" rel=\"nofollow noreferrer\">https://github.com/ovidiucp/TinyWebServer</a> )\nNot very elegant since there is the LED and its wire next to the unit but it gets the job done.</p>\n</div>",
            "votes": "1",
            "user": "Markos F",
            "time": "Dec 22, 2017 at 18:18",
            "is_accepted": false,
            "comments": []
        }
    ]
}