{
    "title": "Reverse engineering LCD memory map",
    "link": "https://reverseengineering.stackexchange.com/questions/31468/reverse-engineering-lcd-memory-map",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to get RAW data from a laser rangefinder device, but it has no PC connection ports. It has a small LCD screen onboard, where all data is displayed: distance, angle, battery level, etc. Since I've got no success with finding debug UART, I've managed to get a transaction to LCD driver IC and get a memory dump for each state of the LCD screen.\nSo, now I know the state of 128 bits of LCD controller memory, which is mapped somehow to segments on the LCD screen:</p>\n<p><a href=\"https://i.sstatic.net/eqNOw.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/eqNOw.png\"/></a></p>\n<p>I can change the text displayed on a screen by manipulating various parameters such as distance, angle, and battery level, and collecting the correspondence between the real LCD segment states and the memory map. However, the central function of converting bits to segments is still a puzzle. Additionally, I am having difficulty manipulating all the segments as desired, as making changes to one segment in a seven-segment display requires moving the device and can result in unpredictable changes in distance values. Furthermore, not all bits in the memory map are being used.\nMy question is:</p>\n<ol>\n<li>Are there any tools available to automate or simplify the finding of this mapping function? From a mathematical perspective, it appears to be a system of linear equations.</li>\n<li>Are there any other suggestions for resolving this problem?</li>\n</ol>\n</div>",
    "votes": "3",
    "answers": 0,
    "views": "74",
    "tags": [
        "dynamic-analysis",
        "firmware-analysis",
        "program-analysis"
    ],
    "user": "artsin",
    "time": "Jan 24, 2023 at 23:40",
    "comments": [
        {
            "user": "Gordon Freeman",
            "text": "<span class=\"comment-copy\">Maybe you can show us some examples of the contents of the memory &lt;==&gt; the display on LCD.</span>",
            "time": null
        }
    ],
    "answers_data": []
}