{
    "title": "Obfuscation indirect address",
    "link": "https://reverseengineering.stackexchange.com/questions/31550/obfuscation-indirect-address",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm studying a reverse engineering course and here is an example about obfuscation indirect addresses:</p>\n<p><a href=\"https://i.sstatic.net/ga7mI.png\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/ga7mI.png\"/></a></p>\n<p>The course says:</p>\n<ol>\n<li>The original code moves the content of the CH register to DL and the output will be 'I'.</li>\n<li>In the obfuscated code, the \"BL\" value, which is \"70\", will be moved to DL by the \"MOV DL, BL\" instruction.</li>\n<li>However, since \"ADD CS:[SI], AH\" is used, the contents of AH will be added to \"BL\". Therefore, BL value will be 72.</li>\n<li>Since the instruction will make a jump to the following 2 instructions, the CH contents will be moved to DL and the output will be 'I' in place of 'H'.</li>\n</ol>\n<p>I don't understand points 3 and 4.\nWill the last byte at the L1 line be incremented by 2?\nWhat really happens?</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "92",
    "tags": [
        "obfuscation"
    ],
    "user": "nerios",
    "time": "May 6, 2023 at 20:40",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Point 3 describes the self-modification of the \"MOV DL,BL\" instruction, that will become \"MOV BL,DL\".  However, the \"Therefore\" part is wrong.  DL is not defined, it might not hold 72 afterwards.  The \"LEA\" line should say \"L1+1\", otherwise the wrong part of the instruction is modified.</p>\n<p>Point 4 is wrong because point 3 is wrong.  It's trying to describe which register will be used after the self-modification.  The intention is that CH is no longer being moved, and CL would be used instead, but the faulty obfuscation does not involve CL, so the point is lost.</p>\n</div>",
            "votes": "2",
            "user": "peter ferrie",
            "time": "Feb 18, 2023 at 6:58",
            "is_accepted": false,
            "comments": [
                {
                    "user": "nerios",
                    "text": "<span class=\"comment-copy\">Thanks Peter, I think I understand the principle Too bad the example is wrong</span>",
                    "time": null
                }
            ]
        }
    ]
}