{
    "title": "Problems trying to debug a running application on my PC",
    "link": "https://reverseengineering.stackexchange.com/questions/31558/problems-trying-to-debug-a-running-application-on-my-pc",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've been reverse engineering an application out of necessity, meaning I'm a beginner on the subject. After days analyzing decompiled code from ILSpy I noticed that debugging the application would really help me to figure out better what parts of the code I should worry about, considering the decompiled version of the code is way too dense to work with. So in the last couple of days, I've been trying to run the target application and debug it on my own with dotpeek and Visual Studio. I found <a href=\"https://hmemcpy.com/2014/07/how-to-debug-anything-with-visual-studio-and-jetbrains-dotpeek-v1-2/\" rel=\"nofollow noreferrer\">this tutorial</a> as well as <a href=\"https://www.domstamand.com/debugging-your-dotnet-applications-and-packages-howto/\" rel=\"nofollow noreferrer\">this one</a> to help me out with the task, but I'm still failing for some reason.</p>\n<p>The thing is, I set up everything just fine, but after I set the breakpoint on the target method and used the application till reached that method, nothing happens on Visual Studio, not even errors, which left me not knowing where to look for problems.</p>\n<p>My first guess is that I'm not describing the method correctly for the \"Function breakpoint...\" option, so I tried all variations I could think of and the same results happened (nothing at all).</p>\n<p>The method is inside the application's .exe (around 150mb - plus around 30 dlls). It also requires you to have a FIFA game (21/22/23) installed on your PC to be used, but it isn't a commercial tool as opposed to the games. It can be downloaded <a href=\"https://www.fifaeditortool.com/download\" rel=\"nofollow noreferrer\">here</a>(the editor one) just in case anyone is able to test it. While the target method is located at:</p>\n<p>\"Fifa_Tool.ModWriter.WriteProject\"</p>\n<p>Which is triggered after you go to \"File&gt;Export to mod&gt;Save (at tool's window)&gt;Save (at Windows' window)\".</p>\n<p>Tried to provide everything I got in a concise way, does anyone have any insights to help me out?</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "69",
    "tags": [
        "debugging"
    ],
    "user": "Gabriel Minosso",
    "time": "Feb 17, 2023 at 12:49",
    "comments": [],
    "answers_data": []
}