{
    "title": "IDA Processor Module: How to maintain register values if instruction doesn't modify them directly (ex. STATUS register, FLAGS, etc.)?",
    "link": "https://reverseengineering.stackexchange.com/questions/31636/ida-processor-module-how-to-maintain-register-values-if-instruction-doesnt-mod",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm developing a processor module for a specific microcontroller. There are cases, when instruction modifies some register (lets call it STATUS) indirectly. By indirectly, I mean, that STATUS is not one of the operands for this instruction. As an example, let's take <code>rlc</code> instruction:</p>\n<pre><code>rlc A\n</code></pre>\n<p>It basically rotates A left with Carry (C). C is part of STATUS register (just one bit). I cannot modify anything within the <code>ev_ana_insn</code> callback as per IDA Pro documentation, so it looks like that:</p>\n<pre><code>def ev_ana_insn(self, insn):\n    if b == 0x67:  # rlc\n        insn.size = 1\n        insn.itype = self.itype_rlc\n        insn.Op1.type = ida_ua.o_reg\n        insn.Op1.reg = self.ireg_A\n</code></pre>\n<p>That's fine. But in <code>ev_emu_insn</code> I don't understand how and where should I modify the <code>STATUS</code> register, since it is missing (and shouldn't be there in the first place) from <code>insn</code>.</p>\n<p>I had a couple of thoughts, but they are not good enough in my opinion:</p>\n<ol>\n<li>Use <code>auxprefs</code> in <code>insn</code> or <code>specvals</code> in <code>Op1</code> and save the information about needed changes to the <code>STATUS</code> register. But still, I need to make these changes and track them somewhere during the analysis and emulation stages.</li>\n<li>Map the <code>STATUS</code> register to RAM segment and modify it there. Here as example of such an implementation: <a href=\"https://github.com/Treeki/TM155-tools/blob/master/ida-module/ht68fb560.py#L470\" rel=\"nofollow noreferrer\">https://github.com/Treeki/TM155-tools/blob/master/ida-module/ht68fb560.py#L470</a>, but I don't know if it's the correct approach.</li>\n<li>Put another <code>Op2</code> in my <code>insn</code>, assign it to the <code>STATUS</code> register and modify it during the emulation stage. However, this approach breaks the whole disassembler, since it expects 2 operands, but really there is only 1. I can play around with that during the output stage, but I don't think that it is a correct approach and is more like a hack.</li>\n</ol>\n<p>So, any input is much appreciated.</p>\n</div>",
    "votes": "3",
    "answers": 0,
    "views": "181",
    "tags": [
        "ida",
        "idapython",
        "ida-plugin",
        "idapro-sdk"
    ],
    "user": "none32",
    "time": "Mar 8, 2023 at 9:50",
    "comments": [
        {
            "user": "Rolf Rolles",
            "text": "<span class=\"comment-copy\">Do you actually need to do that? What negative effects are you experiencing by not modelling the changes to the <code>STATUS</code> register? This is common on other processors also, such as <code>adc</code> and <code>sbb</code> on x86, and I think the dependency and modifications to <code>eflags</code> are simply not modelled.</span>",
            "time": null
        },
        {
            "user": "none32",
            "text": "<span class=\"comment-copy\">Actually, I do. Some instructions with completely the same opcode have different mode of operation on operands (byte or word) based on flag in STATUS register. So, by not tracking this flag I don't know which instruction to display.</span>",
            "time": null
        },
        {
            "user": "Rolf Rolles",
            "text": "<span class=\"comment-copy\">Is it possible to track the value of the <code>STATUS</code> register statically? Suppose <code>A</code> is loaded with the result of calling a random number generator before invoking some instruction that modifies the <code>STATUS</code> register based upon the contents of <code>A</code>. How would you model the update to the <code>STATUS</code> register?</span>",
            "time": null
        },
        {
            "user": "none32",
            "text": "<span class=\"comment-copy\">Result of A is irrelevant. The only thing that could modify the STATUS register is a set of specific instructions, independent of the operand(s) contents. Also, it is being initialized during the RESET event to the predefined value. Therefore, it could be statically tracked.</span>",
            "time": null
        },
        {
            "user": "Rolf Rolles",
            "text": "<span class=\"comment-copy\">Suppose every possible instruction that could modify the <code>STATUS</code> register was in a <code>switch</code> statement, whose <code>switch</code> expression was the result of calling a randon number generator. How would you track the value of the <code>STATUS</code> register? (I realize this is probably not what's happening in your binary, but the questions are intended to be Socratic.)</span>",
            "time": null
        }
    ],
    "answers_data": []
}