{
    "title": "x32dbg error C0000005, EXCEPTION_ACCESS_VIOLATION",
    "link": "https://reverseengineering.stackexchange.com/questions/31699/x32dbg-error-c0000005-exception-access-violation",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Having some trouble with cracking a program, as the software does not prompt me to enter a serial key for activation. Instead, a serial key <code>924D-E42E-427D</code> is already displayed within the program. So one should call the owner of the program to activate it. However, the activation process requires calling the program owner and providing them with the serial key so that they can activate it for you from their database. Unfortunately, I am no longer able to contact<sup>1</sup> the owner and am seeking assistance from someone who can help me crack it.</p>\n<p>I'm using x32dbg. As a result, I tried to crack the program, but I am receiving an error message: (C0000005, <code>EXCEPTION_ACCESS_VIOLATION</code>).</p>\n<p><a href=\"https://i.sstatic.net/xkNqK.jpg\" rel=\"nofollow noreferrer\"><img alt=\"Screenshot with the mentioned serial number\" src=\"https://i.sstatic.net/xkNqK.jpg\"/></a></p>\n<p>I would greatly appreciate any suggestions or advice on how to crack this software. Please let me know if any further information is needed.</p>\n<p>link to executable : <a href=\"https://www.mediafire.com/file/7lbw6ckfs6szf49/electronics.exe/file\" rel=\"nofollow noreferrer\">https://www.mediafire.com/file/7lbw6ckfs6szf49/electronics.exe/file</a></p>\n<p><sup>1</sup> I have attempted to contact the owner of the program using the phone number provided, but it appears to be disconnected, and the owner's domain has been shut down.</p>\n</div>",
    "votes": "3",
    "answers": 0,
    "views": "448",
    "tags": [
        "x64dbg"
    ],
    "user": "tolier",
    "time": "Mar 22, 2023 at 12:59",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Hi and welcome to RE.SE. You write you're using x32dbg, but you also tagged windbg and ollydbg. Also, it's not clear what you are looking for. It sounds as if the software is already cracked with a hardcoded serial number or so. So the goal here is to undo the hardcoded serial and crack from scratch? Could you please edit your question to add in some more detail.</span>",
            "time": null
        },
        {
            "user": "tolier",
            "text": "<span class=\"comment-copy\">Sorry for confusing, I just added a small detail to the post</span>",
            "time": null
        },
        {
            "user": "tolier",
            "text": "<span class=\"comment-copy\">Thank you for your response. I apologize for tagging \"ollydbg\" since I am new to this platform and still learning how things work here. My intention was to attract as many people as possible to my post to seek their help in cracking a program that has not yet been cracked</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Aaaah, the added detail is quite relevant. This means it is probably a sort of key that is computed based on hardware and/or system details and is fed into a key generator of sorts. This exists in a lot of protection schemes, such that the actual activation is only valid for the given system.</span>",
            "time": null
        },
        {
            "user": "tolier",
            "text": "<span class=\"comment-copy\">I think so! Do you know any method to crack it?</span>",
            "time": null
        }
    ],
    "answers_data": []
}