{
    "title": "Decoding set of byte arrays representing light spectrum",
    "link": "https://reverseengineering.stackexchange.com/questions/31724/decoding-set-of-byte-arrays-representing-light-spectrum",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a small spectrometer that measures in the spectral range of 740-1070nm. The device is commercial, and used to send the raw data to the manufacturer's server for decoding, but that does not seem to work any more, so I'm hoping to decode the raw data.</p>\n<p>I have managed to make the device scan and output bytes, which it returns as follows:</p>\n<ul>\n<li>sample: 1800 bytes</li>\n<li>sampleDark: 1800 bytes</li>\n<li>sampleGradient: 1656 bytes</li>\n</ul>\n<p>The server used to return 331 floats between 0 and 1 representing the reflectance spectrum. I expect the calculation to be something along the lines of:</p>\n<p>At this point, I'm unable to decode the bytes to any kind of numeric values that make sense and have 331 values. Below, I'm attaching an example as Base64, with the expected reflectance output (From an old scan). <a href=\"https://github.com/kebasaa/SCIO-read/issues/6\" rel=\"nofollow noreferrer\">Based on a discussion</a>, it appears that the data is encrypted and compressed. Maybe the metadata can help decode it? How do we test encryption methods and compression in order to extract the image data?</p>\n<p>Here are a number of example scans with the device, along with some metadata: <a href=\"https://github.com/kebasaa/SCIO-read/tree/master/01_rawdata/scan_json\" rel=\"nofollow noreferrer\">https://github.com/kebasaa/SCIO-read/tree/master/01_rawdata/scan_json</a></p>\n<p>Here are a some example scans with expected output: <a href=\"https://github.com/kebasaa/SCIO-read/tree/master/01_rawdata/log_extracted\" rel=\"nofollow noreferrer\">https://github.com/kebasaa/SCIO-read/tree/master/01_rawdata/log_extracted</a></p>\n<p>Can someone help and/or point me in a direction that could help me decode this? Thanks!</p>\n<p>EDIT: Added multiple example scans and some with expected outputs</p>\n<p>EDIT: Made problem description more precise</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "80",
    "tags": [
        "decryption",
        "decompress",
        "api-reversing",
        "array"
    ],
    "user": "J-M",
    "time": "Apr 1, 2023 at 15:19",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">I would start with total darkness and a weak laser pointer (if that doesn't damage the device) with a matching wave length. Do multiple measures and compare them on byte level and check out how much bytes changed and where those bytes are.</span>",
            "time": null
        },
        {
            "user": "secfren",
            "text": "<span class=\"comment-copy\">Can you influence the wavelength somehow? I.e measure only a certain range?</span>",
            "time": null
        },
        {
            "user": "J-M",
            "text": "<span class=\"comment-copy\">Unfortunately I can't influence the wavelength. As for trying total darkness: Part of the measurement is that the device shines a light onto the sample. I could try to tape that shut to see if I can measure total darkness</span>",
            "time": null
        },
        {
            "user": "J-M",
            "text": "<span class=\"comment-copy\">I have added a scan of complete darkness (to the degree that I managed, by obscuring the sensor and light shining on the sample: <a href=\"https://raw.githubusercontent.com/kebasaa/SCIO-read/master/01_rawdata/scan_json/scan-dark.json\" rel=\"nofollow noreferrer\">raw.githubusercontent.com/kebasaa/SCIO-read/master/01_rawdata/…</a></span>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">Just having one sample for each scenario is not enough. If you want to understand if the data is encrypted you need multiple samples for the same scenario, e.g. total darkness.</span>",
            "time": null
        }
    ],
    "answers_data": []
}