{
    "title": "Help wanted identifying 4x mimo cellular data antennas in HR-01 5G router",
    "link": "https://reverseengineering.stackexchange.com/questions/31949/help-wanted-identifying-4x-mimo-cellular-data-antennas-in-hr-01-5g-router",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I would like to attach an external 4x mimo patch or yagi antenna to a sharp HR-01 5g home router.\n<a href=\"https://www.docomo.ne.jp/home_5g/router/\" rel=\"nofollow noreferrer\">https://www.docomo.ne.jp/home_5g/router/</a>\nI am relatively confident it is 4x mimo based on the following specs\n<a href=\"https://www.docomo.ne.jp/area/premium_4g/\" rel=\"nofollow noreferrer\">https://www.docomo.ne.jp/area/premium_4g/</a></p>\n<p>I'm also relatively certain it supports some if not all of these frequency ranges.<br/>\n5G (28GHz)<br/>\n5G (4.5GHz,3.7GHz)<br/>\n5G (3.5GHz,3.4GHz,2GHz,700MHz)<br/>\nLTE (800MHz)</p>\n<p>I am currently using the 800MHz frequency range.</p>\n<p>I'm uncertain which of the antennas are associated with cellular data and which are for other things.</p>\n<p>I've looked over some of the manuals on waveform corresponding to wiring for different 5g routers they support.\n<a href=\"https://www.waveform.com/a/b/guides/hotspots/\" rel=\"nofollow noreferrer\">https://www.waveform.com/a/b/guides/hotspots/</a></p>\n<p>But none of them seemed similar enough to my device to give me confidence in which antennas are for the cellular signal.\n<a href=\"https://www.waveform.com/a/b/guides/hotspots/verizon-arc-xci55ax\" rel=\"nofollow noreferrer\">https://www.waveform.com/a/b/guides/hotspots/verizon-arc-xci55ax</a> (this one had 8 connectors like mine)\n<a href=\"https://www.waveform.com/a/b/guides/hotspots/t-mobile-5g-gateway-sagemcom\" rel=\"nofollow noreferrer\">https://www.waveform.com/a/b/guides/hotspots/t-mobile-5g-gateway-sagemcom</a> (this one was a similar square shape to mine)</p>\n<p>I would be very grateful if anyone could review the pictures of the various antennas on my device and the PCB to see if any sense can be made of which 4 mimo antennas would be for cellular data.</p>\n<p>Images of antennas and PCB\n<a href=\"https://postimg.cc/gallery/tg2dd9M\" rel=\"nofollow noreferrer\">https://postimg.cc/gallery/tg2dd9M</a></p>\n<p>If any other information would be of assistance in making a determination let me know and I'll see what I can find.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "57",
    "tags": [
        "router",
        "rf"
    ],
    "user": "Peter",
    "time": "Jun 10, 2023 at 7:07",
    "comments": [
        {
            "user": "secfren",
            "text": "<span class=\"comment-copy\">Probably not easy, requires new equipment or at least more disassembly but: Trace connections from the antennas to the different chips or analyze the signal of each antenna. If it possible to selectively turn off Wifi or cellular then this also could help. Or attach/detach antennas on purpose and see if Wifi/Cellular signal drops or changes.</span>",
            "time": null
        },
        {
            "user": "Peter",
            "text": "<span class=\"comment-copy\">@secfren thanks for your reply. I'm a little reluctant to disconnect antennas and see what starts to fail as I've heard running radio devices without antennas attached may damage them. I may be able to tape aluminum foil over the antennas individually to see if I can drop any signals. Also I noticed that 4 of the antennas have 0612 on the label and the other 4 have 0806. It kind of makes me think that perhaps the 4x mimo for lte and 5g are 0806 and gps and wifi are the 0612 antennas. also the 4x 0806 and 1x 0612 are connected via coax, the remaining 3x 0612 antennas are pogo pin direct to pcb</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I used a hackrf to monitor the signals on the MHF4 connectors of the antennas I could disconnect.</p>\n<ul>\n<li>ANT0 black is LTE and cell (disconnecting it caused the modem to fail to start with no connectivity error)</li>\n<li>ANT1 white unknown perhaps mimo LTE but my modem never sent anything to this port</li>\n<li>ANT2 orange is wifi</li>\n<li>ANT3 grey is wifi</li>\n<li>ANT4 pcb-antenna unknown</li>\n<li>ANT5 blue unknown perhaps mimo LTE but my modem never sent anything to this port</li>\n<li>ANT6 pcb-antenna unknown</li>\n<li>ANT7 pcb-antenna unknown but length seems compatible with GPS antenna.</li>\n</ul>\n<p>I attached a log periodic antenna to ANT0 and was able to get an improved signal strength, but it wouldn't go any faster than 25 Mbps which seems to be the max my local cell tower will give me regardless of signal strength.</p>\n<p>I was unable to increase the speed using additional log periodic antennas as I couldn't get the modem to use the 2.1 ghz band as it seemed to always want to use 700-800 mhz. All the local towers that supported 700-800 mhz didn't seem to want to support the higher bitrate modes of mimo that are supposidely available. I'm guessing this is something to do with how my cell provider has things configured on the tower though.</p>\n</div>",
            "votes": "1",
            "user": "Peter",
            "time": "Jun 25, 2023 at 14:07",
            "is_accepted": false,
            "comments": []
        }
    ]
}