{
    "title": "Need Help Figuring out Multi-byte (in-memory) byte replacement using ida script (idc)",
    "link": "https://reverseengineering.stackexchange.com/questions/31953/need-help-figuring-out-multi-byte-in-memory-byte-replacement-using-ida-script",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>\"I am trying to create a simple IDC script for IDA 7.7, which takes a known memory address (in the format 0x00000000), a string of replacement bytes (either in the format ffffffff or ff ff ff ff, it doesn't matter; whatever is easiest), and a size of bytes to replace (which should match the replacement byte buffer).</p>\n<p>I was under the impression that it would be a simple for loop that starts at the given memory address and replaces each byte individually until it reaches the size of the 'buffer size' variable using the patchbyte function.</p>\n<p>Turns out, that didn't work. My next attempt was to get ChatGPT to do it because, why not? That was a little bit more fruitful, but instead of replacing the bytes I asked it to change to, it replaced the bytes with 00, and then the script wouldn't work after the first try.</p>\n<p>This is what I have from ChatGPT:</p>\n<pre><code>`static main()\n{\n    auto ea = 0x00400000;\n    auto buffer = \"ffffffff\";\n    auto buffer_size = 4;\n\n    // Check if the specified memory address is valid\n    if (ea == BADADDR)\n    {\n        Message(\"Invalid memory address!\");\n        return;\n    }\n\n    // Check if the buffer size is valid\n    if (buffer_size &lt;= 0)\n    {\n        Message(\"Invalid buffer size!\");\n        return;\n    }\n\n    // Check if the buffer is valid hexadecimal format\n    auto len = strlen(buffer);\n    if (len % 2 != 0)\n    {\n        Message(\"Invalid buffer format!\");\n        return;\n    }\n\n    auto i = 0;\n    for (i = 0; i &lt; buffer_size; i++)\n    {\n        auto value = buffer;\n        PatchByte(ea + i, value);\n    }\n\n    Message(\"Successfully patched the memory address!\");\n}`\n</code></pre>\n<p>The goal is to replace a large encryption key with one of my own, just for testing, which is why I want to patch the memory instead of the database or binary itself. But I also feel that a script or function like this may become useful for others aswell.</p>\n<p>Is this something I can only do by creating a plugin? (Please don't say that, I have never been able to successfully compile an IDA plugin..)</p>\n<p>Any help would be appreciated. Thanks!\"</p>\n<p>p.s. i am aware the buffersize check only checks for a number over 0</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "103",
    "tags": [
        "ida",
        "patching",
        "script",
        "idc"
    ],
    "user": "user3654535",
    "time": "Jun 9, 2023 at 2:10",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can do this with IDC or IDAPython without compiling a C++ plugin, but there are a number of problems with your code snippet. For example, <code>value</code> is not an integer, and is computed the same way for every loop iteration. I wouldn't recommend just copying and pasting code from ChatGPT; you should try actually writing it yourself, according to the documentation for IDC or IDAPython.</p>\n<p>Here's a one-liner to do it in IDAPython:</p>\n<p><code>for idx,byte in enumerate([0xFF,0xFE,0xFD,0xFC,0xFB]): ida_bytes.put_byte(0x180004F76+idx,byte)</code></p>\n<p>Replace <code>0x180004F76</code> with the address you want to write to, and <code>[0xFF,0xFE,0xFD,0xFC,0xFB]</code> with the bytes you want to write there.</p>\n</div>",
            "votes": "0",
            "user": "Rolf Rolles",
            "time": "Jun 9, 2023 at 4:57",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user3654535",
                    "text": "<span class=\"comment-copy\">thank you, and yes i understand; ive had many experiences with chatgpt giving incorrect responses for code. I was having an issue finding documentation for idc scripting, i could find the function code, variable information but nothing about the nuances of the idc scripting language itself.</span>",
                    "time": null
                }
            ]
        }
    ]
}