{
    "title": "Is a rootful jailbreak necessary to debug imessage with ida pro for <= ios 16.0.3?",
    "link": "https://reverseengineering.stackexchange.com/questions/32240/is-a-rootful-jailbreak-necessary-to-debug-imessage-with-ida-pro-for-ios-16-0",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In this pdf file written by the great Saleo: <a href=\"https://saelo.github.io/presentations/36c3_messenger_hacking.pdf\" rel=\"nofollow noreferrer\">https://saelo.github.io/presentations/36c3_messenger_hacking.pdf</a>\n<a href=\"https://i.sstatic.net/8EoHd.jpg\" rel=\"nofollow noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/8EoHd.jpg\"/></a></p>\n<p>Saleo was able to debug the called method names of imessage during runtime with ida pro, which suggests that he was able to attach debugserver or an equivalent to imessage. My question is whether a rootful jailbroken iphone is necessary to set up a similar debugging environment, or whether a rootless jailbreak will also suffice. In case a rootless jailbreak is not enough due to lack of permission, what are some ways by which a similar imessage debugging environment with ida pro can be set up, for a rootless jailbroken A12+ device &lt;= ios 16.0.3?</p>\n<p>*Edit: I have figured out that a jailbroken iphone is necessary for any serious ios app research, and that the alternative is doing it on an M1+ macbook pro. Does anyone have experience or intuition regarding the exploit chain that will eventually trigger a PPL bypass for A12+ devices running on &lt;= ios 16.0.3?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "379",
    "tags": [
        "ida",
        "debugging",
        "ios"
    ],
    "user": "rasputin",
    "time": "Sep 27, 2023 at 22:39",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">The linked pdf mentions iOS 12 and 13. I am not a jailbreaking expert, but the first rootless jailbreaks I have encountered were for iOS 15+. Therefore you can assume that for debugging a fully jailbroken phone with root access was used. The changelog of the latest Frida 16.1.4 release mentioned something about using Frida in rootless iOS environments. As Frida is not far away form a debugger, debugging on a rootless device may not be impossible.</span>",
            "time": null
        },
        {
            "user": "rasputin",
            "text": "<span class=\"comment-copy\">Does anyone have experience debugging native apps like imessage in a post ios 16 rootless environment?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can still jailbreak IPhone X, iOS 15.0 - 16.7 and achieve rootful using palerain. <a href=\"https://ios.cfw.guide/archived-palera1n-rootful/\" rel=\"nofollow noreferrer\">https://ios.cfw.guide/archived-palera1n-rootful/</a></p>\n<p>You will then be able to use tools like frida and debugserver to debug IMessage.</p>\n<p>Here is a good resource to get started with Frida and looking at IMessage: <a href=\"https://www.youtube.com/watch?v=miSg0Km2V-w\" rel=\"nofollow noreferrer\">https://www.youtube.com/watch?v=miSg0Km2V-w</a></p>\n</div>",
            "votes": "0",
            "user": "robgg",
            "time": "Sep 27, 2023 at 0:04",
            "is_accepted": false,
            "comments": [
                {
                    "user": "rasputin",
                    "text": "<span class=\"comment-copy\">I appreciate your answer. I have to add the condition for A12+ devices, however...</span>",
                    "time": null
                }
            ]
        }
    ]
}