{
    "title": "Is there any database of malicious code for MIPS processor to evaluate detection method?",
    "link": "https://reverseengineering.stackexchange.com/questions/3227/is-there-any-database-of-malicious-code-for-mips-processor-to-evaluate-detection",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I need a database of malicious code for MIPS processor Assembly or C to inject in Mibench and evaluate my detection mechanism at run time. Is there anything like this for MIPS? what about for other processors?\nI have shellcodes for MIPS and I want virus like codes for MIPS.\nDon't we have any attack benchmark for this purpose?</p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "489",
    "tags": [
        "assembly",
        "mips"
    ],
    "user": "Kaykha",
    "time": "Jun 4, 2014 at 11:52",
    "comments": [
        {
            "user": "Ange",
            "text": "<span class=\"comment-copy\">a database of code? detection of what?</span>",
            "time": null
        },
        {
            "user": "Kaykha",
            "text": "<span class=\"comment-copy\">I compile my C code to assembly and inject malicious code in it and the assemble it and test detection mechanism. I need malicious assembly code for this</span>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">Typically, assembly code in itself is not inherently malicious. It's how it interacts with the system resources and the user that makes it malicious, and for that you would need to know the operating system on which the code was running.</span>",
            "time": null
        },
        {
            "user": "dingo_kinznerhook",
            "text": "<span class=\"comment-copy\">I don't think this is a dumb question, despite the fact that it has been voted down. Kaykha, you are trying to develop a detection mechanism for malicious embedded code? You are asking \"Is there any resource containing known MIPS malware samples and documented infection techniques that work on embedded MIPS targets, specifically MiBench?\"</span>",
            "time": null
        },
        {
            "user": "Kaykha",
            "text": "<span class=\"comment-copy\">It's a research project. I want to show proposed method's results for real changes in the executing program. I need assembly code to add it to the healthy program and observe effects of this modifications on the observed parameters. thanks.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You are asking for a database of MIPS code for evaluating a detection technique, but I'm not sure that there are databases of embedded malware for public evaluation the same way that there are databases of desktop malware. If there are, I would love to know about them.</p>\n<p>As an alternative (and I am sure you have done this), try searching for examples of MIPS shellcode and crafting exploits that work on your own framework. This is a lot of work, but there are definitely examples of MIPS shellcode and malicious embedded logic described in articles (like <a href=\"http://www.shell-storm.org/shellcode\" rel=\"nofollow\">www.shell-storm.org/shellcode</a>, <a href=\"http://www.metasploit.com\" rel=\"nofollow\">metasploit</a>, etc.) that you could use. They are just not in a unified database. Also, you may need to do some work to craft things that will exploit things in MiBench.</p>\n</div>",
            "votes": "1",
            "user": "dingo_kinznerhook",
            "time": "Dec 20, 2013 at 21:55",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Kaykha",
                    "text": "<span class=\"comment-copy\">Thanks for link. I saw it and now my work is only on shellcode. but I want to extend to Virus like codes for MIPS. because shellcodes dont return to main program but viruses return to program and progrom finishes its work although malicious task done.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you want a database about malicious code, you may want to take a look at IDS and antivirus, like <a href=\"http://www.clamav.net/lang/en/\" rel=\"nofollow\">ClamAV</a> or <a href=\"http://snort.org/\" rel=\"nofollow\">Snort</a>.</p>\n</div>",
            "votes": "0",
            "user": "jvoisin",
            "time": "Dec 20, 2013 at 10:58",
            "is_accepted": false,
            "comments": []
        }
    ]
}