{
    "title": "How to unpack a TFTP file with Firmware",
    "link": "https://reverseengineering.stackexchange.com/questions/3228/how-to-unpack-a-tftp-file-with-firmware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have 2 files but I have no idea, how to unpack them.</p>\n<p><a href=\"http://forum.ican3800.zajsoft.net/download/ADB3800TW-Italy/239113254011.ldr\" rel=\"noreferrer\">239113254011.ldr</a></p>\n<p><a href=\"http://forum.ican3800.zajsoft.net/download/ADB3800TW-Italy/239113254012.krn\" rel=\"noreferrer\">239113254012.krn</a></p>\n<p>Inside is a Firmware for ADB(iCan)3800TW used in Italy. We need to unpack it and delete the root password.</p>\n<p>Can somebody help please?</p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "903",
    "tags": [
        "firmware"
    ],
    "user": "joseff",
    "time": "Dec 19, 2013 at 19:21",
    "comments": [
        {
            "user": "joseff",
            "text": "<span class=\"comment-copy\">Yes, I know about Binwalk, just tried, but have found nothing. That is the reason, why I ask here. :-)</span>",
            "time": null
        },
        {
            "user": "devttys0",
            "text": "<span class=\"comment-copy\">Try a newer version of binwalk perhaps? Binwalk shows me a valid Zlib compressed block of data at offset 0x230 in the ldr file. After decompression it contains readable strings and what appears to be executable code. No dice on the krn file, but analysis of the decompressed Zlib data may help with understanding the krn file.</span>",
            "time": null
        },
        {
            "user": "joseff",
            "text": "<span class=\"comment-copy\">Wow. How did you opened the ldr file? It show me, that there is something, but it say that the zlib archive is defect and not possible to open. Can you write some manual, with what and how you have extracted this from the file?</span>",
            "time": null
        },
        {
            "user": "devttys0",
            "text": "<span class=\"comment-copy\">What are you using to decompress it? I used Python's zlib module.</span>",
            "time": null
        },
        {
            "user": "joseff",
            "text": "<span class=\"comment-copy\">Yes, it is working. Thank you very much. This is a small step forward after a very long time. Well, now to the second file (.krn). There is a sequence of 14 bytes in the file, which is repeated every 64 KB, it looks like something to mark blocks... On the other hand, binwalk calculated entropy close to 1 in the entire file. So there will be some compression. That does not go together. The sequence must go away... ??? After those 14 bytes is always increasing number. Always the same structure up to 32. byte. It is possible, that somewhere on the beginning is one or more \"small\" pictures.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can try to use <a href=\"https://code.google.com/p/binwalk/\">binwalk</a>. It can be used in various ways:</p>\n<ul>\n<li>Embedded file identification <strong>and</strong> extraction</li>\n<li>Executable code identification</li>\n<li>Entropy analysis and graphing (useful for compression and encryption identification)</li>\n<li>\"Smart\" strings analysis </li>\n</ul>\n<p>You could try to open your file with <a href=\"http://www.7-zip.org/\">7zip</a>, since it supports a shitload of compression formats.</p>\n<p>And also worth looking at the <a href=\"https://code.google.com/p/firmware-mod-kit/\">firmware mod kit</a>.</p>\n</div>",
            "votes": "7",
            "user": "jvoisin",
            "time": "Dec 20, 2013 at 1:30",
            "is_accepted": false,
            "comments": []
        }
    ]
}