{
    "title": "Anyone familiar with this \"AceDB\" file format?",
    "link": "https://reverseengineering.stackexchange.com/questions/32304/anyone-familiar-with-this-acedb-file-format",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm currently engrossed in penetration testing my Samsung SPH-M330. And to be fair, I have found a couple entry points (WHY ARE YOU PEOPLE USING STRCPY()!?)</p>\n<p>Anyway, I'm now taking a look at \"/brew/card1/DB/Ace.dat\" as it defines the installed J2ME programs and I've figured out a way to modify it.</p>\n<p>Problem is, I don't know what this \"AceDB\" format is. Interesting how the beginning of the file is: \"AceDB Created By Insun Kang,\"...\"SangJung Woo\". Not something you expect in a binary blob! Intriguingly, the phone is the one generating that text. Delete \"Ace.dat\" and restart the phone, all the listed games/apps disappear, but that string is still present in the \"now empty\" file.</p>\n<p>Anyone familiar with this? Here's a link to the samples I've uploaded: <a href=\"https://drive.google.com/drive/folders/12QpbYtsb6BlMgAw2A3nHM_bGzfi6tJzZ\" rel=\"nofollow noreferrer\">https://drive.google.com/drive/folders/12QpbYtsb6BlMgAw2A3nHM_bGzfi6tJzZ</a></p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "87",
    "tags": [
        "file-format"
    ],
    "user": "qwerty keyboard",
    "time": "Sep 18, 2023 at 15:56",
    "comments": [
        {
            "user": "Tommy",
            "text": "<span class=\"comment-copy\">The only SangJung Woo on LinkedIn <a href=\"https://www.linkedin.com/in/sangjungwoo/\" rel=\"nofollow noreferrer\">is an employee of Samsung</a> and lists responsibilities including \"Database Core development such as Catalog system and Heap manager\" for the period from 2007–2010, during which the SPH-M330 came out. An Insun Kang was also <a href=\"https://www.linkedin.com/in/insun-kang-1147396/\" rel=\"nofollow noreferrer\">at Samsung until 2007</a>. Odds on it's a proprietary Samsung file format.</span>",
            "time": null
        },
        {
            "user": "qwerty keyboard",
            "text": "<span class=\"comment-copy\">Good digging thanks! Looks like I have my work cut out then.</span>",
            "time": null
        },
        {
            "user": "raspiduino",
            "text": "<span class=\"comment-copy\">Or maybe you can dump the firmware and look at where the string is generated</span>",
            "time": null
        },
        {
            "user": "qwerty keyboard",
            "text": "<span class=\"comment-copy\">I would, but unfortunately that isn't really an option as both ram and nand dumping via the debug port is disabled on the phone.</span>",
            "time": null
        },
        {
            "user": "CherryDT",
            "text": "<span class=\"comment-copy\">It's probably the format described in <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0164121209000491?via%3Dihub\" rel=\"nofollow noreferrer\">this paper</a> which is unfortunately not available for free unless your university or such has access to it. You can buy it though. - Someone <a href=\"https://blog.moneybag.de/c750-serie-pvr-aufnahmezeit-beim-samsung-manuell-andern/comment-page-1/#comment-1310\" rel=\"nofollow noreferrer\">here</a> described in 2011 they were able to find code to access such a DB online and were able to compile it but they didn't link the source so even though it may exist in the Wayback Machine, I don't know where without URL...</span>",
            "time": null
        }
    ],
    "answers_data": []
}