{
    "title": "Tools to hook browser's Javascript function implementations",
    "link": "https://reverseengineering.stackexchange.com/questions/32358/tools-to-hook-browsers-javascript-function-implementations",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm wondering if there is a way to hook or inject code into Javascript's  implementation of a native function. For example, print the calling parameters whenever an <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/SubtleCrypto/encrypt\" rel=\"nofollow noreferrer\">encrypt()</a> function is called. I not looking for a solution that works from inside the browser e.g. some kind of extension because it may break the behavior of my program or may get detected. I'm looking a way to patch a Javascript's implementation of a method something probably faster than patching the V8 (or whatever engine is used).</p>\n<p>Thanks you for your time.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "248",
    "tags": [
        "javascript",
        "websites"
    ],
    "user": "tur11ng",
    "time": "Oct 4, 2023 at 16:17",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you have access to the DevTools console and you're able to make the call to <code>encrypt</code> happen whenever you want after the page loads, then you could just redefine the <code>encrypt</code> method to log what's being passed to it:</p>\n<pre><code>let encryptCopy = crypto.subtle.encrypt;\n\ncrypto.subtle.encrypt = function() {\n    console.log(arguments);\n    encryptCopy.apply(this, arguments);\n};\n</code></pre>\n<p>If you need to redefine before the document fully loads, then you could do the following:</p>\n<ol>\n<li><em>Open DevTools.</em></li>\n<li><em>Click on the Network tab.</em></li>\n<li><em>Click where it says \"No Throttling\" and set that to \"Slow 3G\" (or create your own custom slower speed).</em></li>\n<li><em>Click the Sources tab.</em></li>\n<li><em>As soon as you hit Enter in the address bar to visit your page, click on the pause button in the DevTools debugger.</em></li>\n<li><em>Paste the code above into the console and hit enter to redefine the method.</em></li>\n<li><em>Unpause execution, then go back to the Network tab and disable throttling so you're not waiting 8 bajillion years for the page to load.</em> =)</li>\n</ol>\n<p>I know you said no extensions, but instead of doing that stuff above, if you can use <a href=\"https://www.tampermonkey.net/documentation.php\" rel=\"nofollow noreferrer\">Tampermonkey</a>, then you could create a userscript to run at <code>document-start</code>, then place the code above inside of a <code>MutationObserver</code> so that your version of <code>encrypt</code> is used when the page loads.</p>\n<p><strong>Example:</strong></p>\n<pre><code>// ==UserScript==\n// @name         Sniff encrypt()\n// @namespace    http://tampermonkey.net/\n// @version      0.1\n// @description  Redefine encrypt to view its params.\n// @author       dsasmblr\n// @match        https://*.PutYourSiteHere.com/*\n// @grant        none\n// @run-at       document-start\n// ==/UserScript==\n\n(function() {\n    'use strict';\n\n    const t = document.body;\n    const c = { childList: true, subtree: true };\n\n    const cb = (mutList, obs) =&gt; {\n        if (mutList) {\n            let encryptCopy = crypto.subtle.encrypt;\n\n            crypto.subtle.encrypt = function() {\n                console.log(arguments);\n                encryptCopy.apply(this, arguments);\n            };\n        };\n\n        obs.disconnect();\n    };\n\n    const obs = new MutationObserver(cb);\n\n    obs.observe(t, c);\n})();\n</code></pre>\n<p><em>(Make sure you change the <code>@match</code> line to contain your domain name of interest. Keeping the asterisks where they are means the script will run on every page of the domain, so change that to be the specific page you want it to run on if need be.)</em></p>\n<p>If you have problems with trap <code>debugger</code> statements to catch DevTools, then click the <code>Deactivate breakpoints</code> button in the Sources tab (its to the far-right of the pause/play execution button). If there are window dimension checks that seem to be happening when opening DevTools, undock DevTools from the window (via the hamburger menu options where you can choose where you want to dock DevTools).</p>\n<p>Short of that, you could try compiling your own build of Chromium with a <code>console.log()</code> added in the definition of <code>encrypt</code> (which I gather you don't quite want to do if you can avoid it).</p>\n<p>My final initial suggestion is that you could try utilizing instrumentation like <a href=\"https://frida.re/docs/quickstart/\" rel=\"nofollow noreferrer\">FridaJS</a> to hook your browser and intercept the data.</p>\n</div>",
            "votes": "2",
            "user": "dsasmblr",
            "time": "Oct 6, 2023 at 21:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}