{
    "title": "Updating legacy library in an already compiled binary",
    "link": "https://reverseengineering.stackexchange.com/questions/32369/updating-legacy-library-in-an-already-compiled-binary",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm dealing with a reverse engineering challenge involving a binary application that was statically compiled with a legacy library. While the legacy library is not vulnerable, it lacks certain features that would significantly improve the functionality of the binary. Importantly, I have access to the open-source code of this library.</p>\n<p>My goal is to enhance the binary by incorporating these missing features from the new version of the library. Specifically, I want to:</p>\n<ol>\n<li>Take the binary compiled with the legacy library.</li>\n<li>Integrate the additional features from the new version of the library into the binary.</li>\n<li>Rebuild or modify the binary so that it utilizes the enhanced library functionality.</li>\n</ol>\n<p>Is this feasible, and if so, what are the general steps or techniques involved in achieving this task? Have you ever heard about something like that?</p>\n<p>Any advice or insights would be greatly appreciated.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "78",
    "tags": [
        "c++",
        "c",
        "linux",
        "elf",
        "patching"
    ],
    "user": "st0l4s",
    "time": "Oct 6, 2023 at 13:37",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is what I have done in similar cases but adapted to your scenario:</p>\n<ul>\n<li>Build the new open source library as a standard SO or DLL that is loadable by your target. If you're unlucky, you might need to use an old compiler...</li>\n<li>Patch the entry point of your target to load the SO/DLL as soon as it's safe or, alternatively, directly modify the binary to add a new library to it so you don't have to load it yourself.</li>\n<li>Hook the exported functions of the library statically linked inside your binary and forward them to the newly built library. If you're unlucky, the functions are in-lined and then your life would not be so nice (but most likely the functions aren't in-lined).</li>\n</ul>\n<p>By doing this you minimize the number of pure assembler patches you need to write and once it's working, you will almost \"magically\" have your target working with newest versions of your target library (but you will have to test to verify it's compatible and they didn't break something).</p>\n<p>Oh, by the way! Naturally, you will need to find first where the library is inside the binary. You can diff with <a href=\"https://github.com/joxeankoret/diaphora\" rel=\"nofollow noreferrer\">Diaphora</a> a version of your open source library against your target and import the symbols you need.</p>\n<p>Hope it helps.</p>\n</div>",
            "votes": "1",
            "user": "joxeankoret",
            "time": "Oct 6, 2023 at 16:06",
            "is_accepted": true,
            "comments": []
        }
    ]
}