{
    "title": "Objective-C stub functions on AARCH64",
    "link": "https://reverseengineering.stackexchange.com/questions/32383/objective-c-stub-functions-on-aarch64",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm analyzing some functions I see in Machos binaries and I see that whenever there's <code>bl</code> instruction to an objective-c stub function that resides in the <code>__objc_stubs</code> section and in that function there's eventually a call with <code>br</code> instruction to the <code>_objc_msgSend</code> symbol that resides in the <code>_got</code> section that will eventually get resolved when the <code>libobjc.dylib</code> will get loaded by the <code>dyld</code>, for example:</p>\n<pre><code>adrp x1, 0x24e000\nldr x1, [x1, #0x670] =&gt; some selector pointer\nadrp x16, 0x1fc000\nldr x16, [x16, #0xd48] =&gt; _objc_msgSend stub location\nbr x16\n</code></pre>\n<p>Now I wonder why there isnt any <code>ret</code> instruction at the end of these stubs to return to the code flow of the original function that called this stub? Will the <code>ret</code> instruction just be present in the <code>_objc_msgSend</code> from <code>libobjc.dylib</code> and it will eventually call it by itself?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "75",
    "tags": [
        "arm",
        "mach-o",
        "arm64"
    ],
    "user": "Jorayen",
    "time": "Oct 11, 2023 at 19:17",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is an example of optimizing a <em>tail call</em> - a call to another function which is done as the last statement of the current function. Because the LR (link register) has not been modified, the ret/blr of the destination function will directly return to the caller of the stub.</p>\n</div>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Oct 28, 2023 at 13:11",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jorayen",
                    "text": "<span class=\"comment-copy\">Can I ask what is a way to detect tail call compared to just a branch in a function? Is the presence of unconditional branch without any other flow paths in the function indicated a tail call 100%? Or are there edge cases where it's not true somehow? Maybe it can be identified by counting references to the branch target from other already identified functions and if it's more than 1 then we can conclude the branch target is a new function rather than just a label in some function?</span>",
                    "time": null
                }
            ]
        }
    ]
}