{
    "title": "How does Play integrity api assures Genuine app binary",
    "link": "https://reverseengineering.stackexchange.com/questions/32527/how-does-play-integrity-api-assures-genuine-app-binary",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I discovered that we can use the Play integrity api instead of safetynet now to assure the integrity off an app that is running. I am wondering if people have a way of bypassing the \"Genuine app binary\"-aspect of this method.\nI could not find much information on how they check if the app is modified or not.</p>\n<p>I would like to evaluate how secure it really is. Because if you would for example send a hash of your apk with your integrity api request, then the app could be patched to just send the correct hash value I think. Or does this login happen in the google play services?</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "304",
    "tags": [
        "android",
        "patching",
        "frida"
    ],
    "user": "user45316",
    "time": "Nov 27, 2023 at 12:06",
    "comments": [
        {
            "user": "ynwarcs",
            "text": "<span class=\"comment-copy\">In theory, it can be bypassed. An actor can replicate the behaviour of the client-side integrity component and fool the server into thinking the client binary is legitimate. Whether it's something that's going to be done in practice depends on the effectiveness of the implementation and whether it's worth doing for the actor.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Q. Can some attacker bypass \"Genuine App Binary\" check  ?</p>\n<p>A.\nWell, yes and no.</p>\n<p>Let's reframe the question first.</p>\n<p>Q1.) Can some attacker spread cracked version of my app around if I enabled \"Genuine App Binary\" check  ?</p>\n<p>A.\nNo. They can't. That's the benefit of App Integrity check. That is the level of security this protection provides.\nOften, you'll see cracked version of games being spread around. Your app won't be one of them.\nBut, your app won't work on lot of Chinese phones since they don't ship with google play services.\nIf you decided to provide a non-google play version, the protection will become useless. Google explains this in their docs.</p>\n<p>Q2). How they check if app is modified or not ?</p>\n<p>A.\nApp Integrity check is a four-way communication. Your app, app server, Google Play Services &amp; google servers.</p>\n<p>Both your app &amp; google check the signatures of each other. If attacker modifies your app, google services will pick the correct signature up &amp; check will trip, and vis-versa. So, we can't just simply \"patch\" your app to send the correct signature hash. The payload is AES encrypted.</p>\n<p>To get an idea of this protection, you can do this experiment:\nInstall \"Play Integrity API checker\" from play store. Open it and click \"Check\", and after the results, click on \"&lt;&gt;\" button to see the response. Take a screenshot or note it down.</p>\n<p>Now, just resign the app &amp; install it. Try it again, it'll pass the first tests again. Click on \"&lt;&gt;\" to see response and screenshot/note it down.</p>\n<p>Now, compare both responses. You'll notice that it'll fail some tests. \"UNRECOGNIZED_VERSION\", \"UNEVALUATED\" is what you'll see on some values instead of positive values. That's app integrity.</p>\n<p>Source code of both the app itself &amp; server is available on Github. Try tampering with them and try to pass those failed test. You'll slowly realize how this even works.</p>\n<p>Q3). I still have doubts. Can we bypass this ?</p>\n<p>A. Difficult question. How exactly do you want to bypass it ?\nIt depends. Define \"bypassing\" what exactly, and I'll try to answer in comments.</p>\n<hr/>\n<p>Reference :-\n<a href=\"https://support.google.com/googleplay/android-developer/answer/10183279\" rel=\"nofollow noreferrer\">https://support.google.com/googleplay/android-developer/answer/10183279</a></p>\n</div>",
            "votes": "0",
            "user": "Vansh Santoshi",
            "time": "Jul 22, 2024 at 11:55",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Vansh Santoshi",
                    "text": "<span class=\"comment-copy\">App link:- <a href=\"https://play.google.com/store/apps/details?id=gr.nikolasspyr.integritycheck\" rel=\"nofollow noreferrer\">play.google.com/store/apps/…</a></span>",
                    "time": null
                }
            ]
        }
    ]
}