{
    "title": "Microchip ATSAME70Q21-CN unable to connect with JTAG or SWD",
    "link": "https://reverseengineering.stackexchange.com/questions/32534/microchip-atsame70q21-cn-unable-to-connect-with-jtag-or-swd",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First time delving into hardware reverse engineering and can't seem to connect using JTAG nor SWD.  I found two identical devices that I'm trying to understand how they work and see if I can extract the firmware.  One device I'm sacrificing to research, the ATSAME70Q21 is a BGA which I removed to help with identifying traces.  The board has 10 holes that I've mapped the following pins:</p>\n<p>Pin 1 -&gt; +3V3</p>\n<p>Pin 2 -&gt; J11 (SWDIO/TMS)</p>\n<p>Pin 3 -&gt; F9 (SWCLK/TCK)</p>\n<p>Pin 4 -&gt; C10 (TDO/TRACESWO/WKUP13)</p>\n<p>Pin 5 -&gt; H12 (NRST) - Low to Reset</p>\n<p>Pin 6 -&gt; (GND)</p>\n<p>Pin 7 -&gt; M9 (PD19/NCS3/CTS2/UTXD4)</p>\n<p>Pin 8 -&gt; M10 (PD18/NCS1/SDCS/RTS2/URXD4)</p>\n<p>Pin 9 -&gt; A12 (TDI/PB4)</p>\n<p>Pin 10 () -&gt; UNKNOWN</p>\n<p>The data sheet is rather confusing, it seems like JTAG is only used for manufacturing and the SW_DP isn't clear what needs to be set, I'm probably just missing it though. From the datasheet:\n\"8.2.1 Serial Wire Debug Port (SW-DP) Pins\nThe SW-DP pins, SWCLK and SWDIO, are commonly provided on a standard 20-pin JTAG connector\ndefined by ARM. For additional information about voltage reference and reset state, refer to the\nTable 4-1.\nAt startup, the SW-DP pins are configured in SW-DP mode to allow connection with debugging\nprobe. For more details, refer to 16. Debug and Test Features.\nThe SW-DP pins can be used as standard I/Os to provide users more general input/output pins when\nthe debug port is not needed in the end application. Mode selection between SW-DP mode (System\nIO mode) and general IO mode is performed through the AHB Matrix Special Function Registers\n(MATRIX_SFR). Configuration of the pad for pull-up, triggers, debouncing and glitch filters is possible\nregardless of the mode.\nThe JTAGSEL pin is used to select the JTAG boundary scan when asserted at a high level. It integrates\na permanent pulldown resistor of about 15 kΩ to GND, so that it can be left unconnected for normal\noperations.\nThe JTAG Debug Port TDI, TDO, TMS and TCK is inactive. It is provided for Boundary Scan\nManufacturing Test purpose only.\"</p>\n<p>Going through the traces, I did find they had a 0 Ohm resistor going to ground for the JTAGSEL pin and right next to it was an empty pad that switched it to VDDIO.  I moved that pin but it didn't change anything.  The datasheet mentions that to put it into JTAG mode, JTAGSEL (B11) has to be high, TST (H11) has to be high and PD0 (D4) has to be to GND.  The board doesn't appear to have an easy way to bring TST high and PD0 to GND.  I can upload pictures if that would help.</p>\n<p>I've tried using a JTAGulator to identify pins, which is seemed to do quite well but couldn't connect via JTAG.  I've also tried a Segger J-Link Edu Mini with no luck.</p>\n<p>Anyone have any possible next steps?  Any insight would be greatly appreciated.</p>\n<p><a href=\"https://ww1.microchip.com/downloads/aemDocuments/documents/MCU32/ProductDocuments/DataSheets/SAM-E70-S70-V70-V71-Family-Data-Sheet-DS60001527.pdf\" rel=\"nofollow noreferrer\">Datasheet</a></p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "106",
    "tags": [
        "serial-communication",
        "jtag"
    ],
    "user": "kumaichi",
    "time": "Nov 30, 2023 at 3:36",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It seems the JTAG pins are only intended for boundary scan (e.g. for board connectivity testing), and you should use the SWD pins for debugging.</p>\n</div>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Dec 2, 2023 at 22:18",
            "is_accepted": false,
            "comments": [
                {
                    "user": "kumaichi",
                    "text": "<span class=\"comment-copy\">Thanks Igor for your response.  Yes, I removed components and ran wires to connect everything for the JTAG and as you stated, it had no effect.  I can't seem to get SWD to work either.  I've connected a logic analyzer and there is nothing happening on the SWD  wires either.  Anything else I could possibly try?  Thanks again!</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">Have you actually connected a debug probe to SWD pins? There won't be anything happening without a debugger driving the device.</span>",
                    "time": null
                },
                {
                    "user": "kumaichi",
                    "text": "<span class=\"comment-copy\">I have connected the JTAGulator and Hydrabus using OpenOCD but there is nothing coming across while connected to the device via the SWDIO/TMS and SWCLK/TCK.</span>",
                    "time": null
                },
                {
                    "user": "kumaichi",
                    "text": "<span class=\"comment-copy\">VTref=3.299V Type \"connect\" to establish a target connection, '?' for help J-Link&gt;connect Please specify device / core. &lt;Default&gt;: ATSAME70Q21A Type '?' for selection dialog Device&gt; Please specify target interface:   J) JTAG (Default)   S) SWD   T) cJTAG TIF&gt;s Specify target interface speed [kHz]. &lt;Default&gt;: 4000 kHz Speed&gt; Device \"ATSAME70Q21A\" selected. Connecting to target via SWD Failed to attach to CPU. Trying connect under reset. Cannot connect to target.</span>",
                    "time": null
                },
                {
                    "user": "kumaichi",
                    "text": "<span class=\"comment-copy\">I hooked up a logic analyzer between the J-Link and the device and it keeps getting parity errors over and over again:Reset:56 AP RD A:1 Parity:Error! Stop:1! ACK:3!  Reset:58 AP WR A:3 Parity:Error! Stop:1! ACK:6!  Reset:58 DP RD A:0 ACK:7!  Reset:32? Reset:50? DP RD A:3 Parity:Error! Stop:1! ACK:5!  AP RD A:2 Stop:1! Park:0! ACK:7!  AP WR A:3 Stop:1! ACK:7!  DP WR A:3 Parity:Error! Park:0! ACK:7!  DP WR A:0 Stop:1! Park:0! ACK:4 Failure</span>",
                    "time": null
                }
            ]
        }
    ]
}