{
    "title": "how to diassemble an .obj file",
    "link": "https://reverseengineering.stackexchange.com/questions/32637/how-to-diassemble-an-obj-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm new to programming and recently studying an ancient DOS assembly program written for 80186 and assembled with MASM. There are some .obj files that I want to open and take a look. I tried obj2asm.exe and IDA 5.0 (freeware version), but both programs could not deliver accurate results. As far as I know those .obj files are just lists of data indexes in format similar to below:</p>\n<p>IG  SEGMENT PUBLIC  'ROM'\nPUBLIC  INDEX1</p>\n<p>INDEX1      DB  000H,000H   ; A<br/>\nDB  021H,000H   ; B<br/>\nDB  06FH,020H   ; C<br/>\n......\n......</p>\n<p>There are no assembly instruction in the .obj files.\nWhat should I do in order to accurately diassemble those .obj files? This DOS program is very important to my study and I'm desperate to get the correct files. Could anyone please give me some advice? Your kind assistance is very much appreciated! Thank you in advance!</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "142",
    "tags": [
        "assembly",
        "disassemblers"
    ],
    "user": "skyforest",
    "time": "Jan 12, 2024 at 14:04",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This obj (or omf) file is an assembled 8086 executable that should contain executable code (no headers).</p>\n<p>IDA Pro can disassemble it, but the free version won't.</p>\n<p>Ghidra can handle it.</p>\n<p>You may have to select the processor type manually and/or set the loading address (0x100).</p>\n</div>",
            "votes": "1",
            "user": "Yotamz",
            "time": "Jan 12, 2024 at 18:03",
            "is_accepted": true,
            "comments": [
                {
                    "user": "skyforest",
                    "text": "<span class=\"comment-copy\">I tried Ghidra and it worked like a charm. Thanks again for your kind assistance. Have a nice day!</span>",
                    "time": null
                },
                {
                    "user": "Yotamz",
                    "text": "<span class=\"comment-copy\">You're welcome. If this answered your question - please mark the answer as accepted. Thanks</span>",
                    "time": null
                }
            ]
        }
    ]
}