{
    "title": "How to make a apk packages manually like other linux distro packages?",
    "link": "https://reverseengineering.stackexchange.com/questions/32650/how-to-make-a-apk-packages-manually-like-other-linux-distro-packages",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Because Android Linux-based and it has its own package format named APK, so it will be possible to create <a href=\"https://en.wikipedia.org/wiki/Apk_(file_format)\" rel=\"nofollow noreferrer\">APK packages</a> manually from a specification like a specification for <code>pacman</code> packages in Arch Linux.</p>\n<p>But I can't find a Specification for APK packages as self-explanatory as other distro packages like <a href=\"https://wiki.archlinux.org/title/Creating_packages\" rel=\"nofollow noreferrer\"><code>pacman</code> (Arch) specification</a>.</p>\n<p>How to make an APK package by packing compiled files and others manually like for Linux distros?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "63",
    "tags": [
        "android",
        "apk"
    ],
    "user": "Smm",
    "time": "Jan 17, 2024 at 14:39",
    "comments": [
        {
            "user": "sudhackar",
            "text": "<span class=\"comment-copy\">Hello and welcome to RE.SE! I can't see how this is related to reverse engineering.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@Smm Welcome to RE.SE. Android can hardly be described as a GNU/Linux distro. Because the GNU part is missing. Sure, you can skip the fact that conventionally Linux distros are defined by kernel+userland and insist on it being purely about the Linux kernel, but even then the relationship to other Linux package formats is distant. APKs are an extension of JARs which themselves are glorified ZIP files. <a href=\"https://apktool.org/\" rel=\"nofollow noreferrer\">apktool</a> can do what you want. That's the only relation I see to reverse engineering (!= RCE). As it stands I have to agree with sudhackar.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Even Arch uses tooling for package creation (<code>makepkg(8)</code>, <code>pacman(8)</code>), so I am not sure what it is you want exactly. So you should edit your question to clarify.</span>",
            "time": null
        },
        {
            "user": "Smm",
            "text": "<span class=\"comment-copy\">Thanks , for editing kindly mr \"0xC0000022L\"</span>",
            "time": null
        },
        {
            "user": "Smm",
            "text": "<span class=\"comment-copy\">Yes \"arch uses tooling for package Creation\"  but its enough transparent about how its works for example I know it moves some files into some standard directories and track them  its simple as I can create a package manager like this of Linux but I can't reach transparency like this in apk files and how they operate also how to pack them in most optimized way what community you suggest to move question into it ?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>From reading your question, I think you're trying to build a command line package manager &amp; compiler for android. Cool &amp; complicated project, but I can atleast point you out to a direction.</p>\n<p>All android apks are assembled &amp; compiled through gradle.\nWhile compiling an android app on Android Studio, you'll see gradle in action helping to compile the app.</p>\n<p>You can compile the entire app from source through command line using gradlew.bat/sh scripts that android studio generates.</p>\n<p>Essentially, the script downloads the compatible gradle version defined in configuration files &amp; uses android SDK &amp; JDK present in the environment.</p>\n<p>That gradlew script is where you should start digging.</p>\n<p>Useful links:\n<a href=\"https://developer.android.com/build/building-cmdline\" rel=\"nofollow noreferrer\">https://developer.android.com/build/building-cmdline</a></p>\n<p>Similar Project that's been running for a while:\n<a href=\"https://github.com/AndroidIDEOfficial/AndroidIDE\" rel=\"nofollow noreferrer\">https://github.com/AndroidIDEOfficial/AndroidIDE</a></p>\n</div>",
            "votes": "0",
            "user": "Vansh Santoshi",
            "time": "Jul 22, 2024 at 9:39",
            "is_accepted": false,
            "comments": []
        }
    ]
}