{
    "title": "Symbols in Ghidra based on r/w possible?",
    "link": "https://reverseengineering.stackexchange.com/questions/32725/symbols-in-ghidra-based-on-r-w-possible",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is it possible to have a symbol file with different names for an address based on whether a instruction is accessing the address read or write?</p>\n<p>For example, I have a hardware address $FF8800 for a sound chip.</p>\n<p>In read access, it is PSG Read Data.\nIn write access, it is PSG Register Select.</p>\n<p>I would like the disassmbly to reflect the name in context.</p>\n<p>Possible?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "54",
    "tags": [
        "ghidra",
        "symbols"
    ],
    "user": "Trevor Acton",
    "time": "Feb 11, 2024 at 15:27",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can use ghidra's Overlay memory blocks to achieve this. How much work this involves will depend on how many such memory locations are involved and whether they are in contiguous range(s).</p>\n<p>To get you started for your specific case, the following instructions should help:</p>\n<ul>\n<li><p>Using the Memory Map window, create two Overlay memory blocks, both located at <code>0xFF8800</code>, allocating to each the larger number of bytes (if they aren't the same) required for either the read or the write version of the register, making the block names something like <code>PSGRead</code> and <code>PSGwrite</code>,</p>\n</li>\n<li><p>In the Listing window:</p>\n<ul>\n<li>Press <code>g</code> (for \"go to address\") and enter <code>PSGRead::FF8800</code>, then,</li>\n<li>Press <code>l</code> (for \"label\") and enter a label name of your choice--perhaps <code>ReadData</code>.</li>\n</ul>\n</li>\n<li><p>Repeat those two steps in the Listing window using the address <code>PSGWrite::FF8800</code> and a label something like <code>RegisterSelect</code>.</p>\n</li>\n<li><p>For each instruction in the Listing window that accesses address <code>FF8800</code>:</p>\n<ul>\n<li>Click on the operand that references that address.</li>\n<li>Press <code>r</code> (for \"reference\") to open the Reference Editor window, where, depending on whether the access is a <code>read</code> or a <code>write</code>, you can either:\n<ul>\n<li>Alter an existing reference to the corresponding label, or,</li>\n<li>Add a new reference to the corresponding label.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>If that, supplemented by Ghidra's built-in help, doesn't get you there, reply here and either I or someone else can give additional help.</p>\n</div>",
            "votes": "1",
            "user": "g1l1t1",
            "time": "Feb 28, 2024 at 18:13",
            "is_accepted": false,
            "comments": []
        }
    ]
}