{
    "title": "convert Pdf to Executable",
    "link": "https://reverseengineering.stackexchange.com/questions/32737/convert-pdf-to-executable",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am taking a intro to reversing course. After learning patching we got a home work to find the flag and write a writeup on how we did it. Part of the riddle is to figure out where exactly to find the flag. I was thinking maybe the pdf with the instructions on the home work has the flag in it. Is there a way to convert it to a executable format PE, so i can analyse it with IDA? If not what else can I do to find the flag if all I have is a pdf</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "155",
    "tags": [
        "pdf"
    ],
    "user": "Talia Isaacson",
    "time": "Feb 15, 2024 at 19:12",
    "comments": [
        {
            "user": "jsotola",
            "text": "<span class=\"comment-copy\">what would the executable do?</span>",
            "time": null
        },
        {
            "user": "julian",
            "text": "<span class=\"comment-copy\">Do the PDF instructions state where to download the binary from? Since it's a reversing course and not a file forensics course the flag should be in some executable binary that you download from somewhere.</span>",
            "time": null
        },
        {
            "user": "fpmurphy",
            "text": "<span class=\"comment-copy\">I suggest you use a tool like <code>pdfStreamDumper.exe</code> to examine the PDF file for 'malicious` code.  The tool will list all the streams in the PDF file.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There is no conversion from pdf to PE and such conversion makes little sense.</p>\n<p>A pdf can contain embedded javascript which can be defined as executable code in the broad sense.</p>\n<p>There are some useful tools for analyzing pdf files here:</p>\n<p><a href=\"https://stackoverflow.com/questions/10220497/extract-javascript-from-malicious-pdf\">https://stackoverflow.com/questions/10220497/extract-javascript-from-malicious-pdf</a></p>\n<p>A good starting point would be opening the file in a hex editor and looking for clues, maybe hidden instructions.</p>\n</div>",
            "votes": "0",
            "user": "Yotamz",
            "time": "Feb 16, 2024 at 6:27",
            "is_accepted": false,
            "comments": []
        }
    ]
}