{
    "title": "How to hook or call \"non-native/non-exported functions\"?",
    "link": "https://reverseengineering.stackexchange.com/questions/32842/how-to-hook-or-call-non-native-non-exported-functions",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I wrote this simple application in C++ to learn about reverse engineering:</p>\n<pre><code>#include &lt;iostream&gt;\n#include &lt;windows.h&gt;\n\nvoid PrintMessage(const char *message) {\n    std::cout &lt;&lt; message &lt;&lt; \"\\n\";\n}\n\nint main() {\n    while (true) {\n        if (GetAsyncKeyState(VK_SPACE) &amp; 0x1) {\n            PrintMessage(\"Space Pressed\");\n        }\n    }\n    return 0;\n}\n</code></pre>\n<p>First of all, I don't know what is the right way to call them, and probably that's the reason why I cannot find any information about it, but by \"non-native/non-exported functions\" I mean any function that was written within the app and not imported from another DLL, like <code>user32.dll</code> for <code>MessageBox</code> native API.</p>\n<p>Assuming I don't know anything about the app above, but I have it's compiled executable file, is it possible to find <code>PrintMessage</code>'s address in it, and hook or call it from an external process? (through DLL injection, maybe?)</p>\n<p>My goal is to write a second app, that can attach to the one above to achieve 2 things:</p>\n<ul>\n<li>Log every time <code>PrintMessage</code> is called by the app, and it's arguments.</li>\n<li>Force <code>PrintMessage</code> call to log an arbitrary message from the outside.</li>\n</ul>\n<p>I've found plenty of tutorials about Native Functions, mainly Windows API, but none related to what I'm trying to achieve. Is it even possible? What should I look for to learn about it?</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "67",
    "tags": [
        "windows",
        "dynamic-analysis",
        "function-hooking"
    ],
    "user": "Unknown X",
    "time": "Mar 28, 2024 at 19:54",
    "comments": [
        {
            "user": "Robert",
            "text": "<span class=\"comment-copy\">The <code>PrintMessage</code> function should be seen as function if you load the compiled binary in Ghidra or a similar tool. However the compiler my optimize your code and automatically inline the code of <code>PrintMessage</code>, in such a case you won't find a separate function. If you have a function you can hook it. For hooking a non-exported function using frida please see <a href=\"https://stackoverflow.com/q/68332781/150978\">my related answer on Stackoverflow</a>.</span>",
            "time": null
        },
        {
            "user": "Unknown X",
            "text": "<span class=\"comment-copy\">@Robert Thank you. After compiling my app on debug mode, I was able to find the functions using x64dbg. However, release mode does what you're saying about optimizing and inlining functions. In those cases, is still possible to hook to inline functions? I believe that most real apps use release settings to deliver their software, so I wonder if this technique could be used on real scenarios with more knowledge to detect inline functions, or if inline functions cannot be called from the outside.</span>",
            "time": null
        },
        {
            "user": "Unknown X",
            "text": "<span class=\"comment-copy\">@Robert Also, is there any conventions that compilers use for preparation of functions? I've found a tutorial where a DLL written in C was injected to an app written in C as well, so the pointer to the function address worked like a charm. I wonder if different compilers use different \"prologue\" for their functions (e.g. parameters setup), or there are a standard of calling conventions for every compiler.</span>",
            "time": null
        }
    ],
    "answers_data": []
}