{
    "title": "S30+ Game Development",
    "link": "https://reverseengineering.stackexchange.com/questions/32843/s30-game-development",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>How can I get started developing games for the S30+ operating system on Windows or Linux?</p>\n<p>I have a new nokia 150, which seems to run the correct operating system, although I'm not sure if this phone is bricked or not.  However, there are other models out there such as the 6310.  I think with the 6310 it is indeed possible to run old .vxp files and play games on it.</p>\n<p>However, how would I go about developing these games or even apps.  The new Nokias seem to be gaining market share now, so then surely there is a growing market (although not active) for app development.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "220",
    "tags": [
        "windows",
        "linux",
        "development",
        "game",
        "windowsphone"
    ],
    "user": "Kynemix",
    "time": "Mar 28, 2024 at 5:42",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Some Series 30+ phones support the <a href=\"https://lpcwiki.miraheze.org/wiki/MediaTek_MRE\" rel=\"nofollow noreferrer\">MediaTek MRE</a> (VXP) application format. However, as the name suggests, these apps are only supported on devices that are based on a MediaTek chipset. Nokia phones released since 2020, like the 6310 and the 150, run on an Unisoc chipset instead, meaning they cannot run any user-installed applications.</p>\n<p><em>(Note: I'm assuming you're talking about the 2020 or 2023 version of the 150. The 2017 version runs on a MediaTek chipset, however it does not support VXP apps either.)</em></p>\n<p>If you want to get started with VXP app development, there are two routes for setting up your build environment:</p>\n<ol>\n<li>Using the official <a href=\"https://archive.org/details/mre-sdk\" rel=\"nofollow noreferrer\">MRE SDK</a> (Windows only). This involves setting up Visual Studio 2008 along with the RealView Development Suite (an old ARM compiler), and configuring the MRE SDK as an add-in for Visual Studio. I have not tried this route myself, but there is a guide on <a href=\"https://github.com/UstadMobile/ustadmobile-mre\" rel=\"nofollow noreferrer\">UstadMobile's GitHub</a>.</li>\n<li>Using the <a href=\"https://github.com/gtrxAC/mre-makefile\" rel=\"nofollow noreferrer\">MRE Makefile</a> (Windows/Linux). This is a build script that aims to be as straight-forward and cross-platform as possible, however it currently only supports phones with a newer version of the MRE runtime (won't be a problem for Nokias, but it does exclude some phones from other brands). To start using MRE Makefile, you'll need to set up the dependencies, edit the included manifest.json to your liking, and start coding. Use the 'make' command to build your project. I wrote a bit more about it <a href=\"https://lpcwiki.miraheze.org/wiki/Developing_for_old_phones/MRE#Using_the_Makefile\" rel=\"nofollow noreferrer\">here</a>.</li>\n</ol>\n</div>",
            "votes": "0",
            "user": "gtrxAC",
            "time": "Apr 27, 2024 at 1:30",
            "is_accepted": false,
            "comments": []
        }
    ]
}