{
    "title": "How did a cheap amazon RF key managed to clone original key with rolling codes?",
    "link": "https://reverseengineering.stackexchange.com/questions/32892/how-did-a-cheap-amazon-rf-key-managed-to-clone-original-key-with-rolling-codes",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a garage and I have the original key which is 433MHz and the specifications say it is a rolling code. Here is a table of the specifications:</p>\n<ul>\n<li>Range in open field (m): 100</li>\n<li>Frequency: 433.92 MHz</li>\n<li>Coding type: Rolling code</li>\n<li>Number of buttons (channels): 2 push buttons</li>\n<li>Programming:*Teach transmitter into receiver</li>\n</ul>\n<p>I wanted my friend to also use the garage so I bought a simple 433MHz \"universal\" RC key from Amazon and it managed to clone the key. <strong>My friend can use the Amazon key to open the garage door.</strong></p>\n<p>I wanted to know more and decided to hook up a RC receiver to an arduino to check the data.</p>\n<p>rcSwitch shows random raw data, however the binary shows a 15bit of positives (111111111111111). I'm guessing the random data is because of the rolling code.</p>\n<p>I tried to resend some of the signals received from the key with an RC transmitter also hooked to another arduino but the garage door won't open. I'm guessing because of the rolling code.</p>\n<p>So how did the amazon \"universal\" key manage to clone the rolling code algorithm/secret? Has it to do something with the \"Programming\" specification?</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "115",
    "tags": [
        "encryption"
    ],
    "user": "Skywalker",
    "time": "Apr 13, 2024 at 16:14",
    "comments": [
        {
            "user": "President James K. Polk",
            "text": "<span class=\"comment-copy\"><i>... and it managed to clone the key.</i> What was the exact sequence of steps you performed to clone the key?</span>",
            "time": null
        },
        {
            "user": "Skywalker",
            "text": "<span class=\"comment-copy\">The amazon key just copied the master key by putting it in learning mode (holding a button) and then send the signal from the master key and done... I'm not sure how it works and I'm really second guessing if  the master key actually is a rolling code.</span>",
            "time": null
        },
        {
            "user": "Ben Voigt",
            "text": "<span class=\"comment-copy\">I think you mean \"original\" key and not \"master key\".</span>",
            "time": null
        },
        {
            "user": "Skywalker",
            "text": "<span class=\"comment-copy\">Yes you are right, I mean the original key.</span>",
            "time": null
        }
    ],
    "answers_data": []
}