{
    "title": "sp analysis failed - red marks in code",
    "link": "https://reverseengineering.stackexchange.com/questions/32897/sp-analysis-failed-red-marks-in-code",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is start of func:</p>\n<p><a href=\"https://imgur.com/n0jbT1E\" rel=\"nofollow noreferrer\">https://imgur.com/n0jbT1E</a></p>\n<p>This is end of func:</p>\n<p><a href=\"https://imgur.com/GiQQAYP\" rel=\"nofollow noreferrer\">https://imgur.com/GiQQAYP</a></p>\n<p>What means red mark \"sp analysis failed\"?</p>\n<p>I looked in C++ source code of this disassembled code, there is much more lines of code in this function. Maybe its some error?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "63",
    "tags": [
        "ida"
    ],
    "user": "black4joss",
    "time": "Apr 15, 2024 at 12:03",
    "comments": [
        {
            "user": "Ali Rizvi-Santiago",
            "text": "<span class=\"comment-copy\"><a href=\"https://hex-rays.com/blog/igors-tip-of-the-week-27-fixing-the-stack-pointer/\" rel=\"nofollow noreferrer\">hex-rays.com/blog/…</a></span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Please don't post pictures, post text or text <i>and</i> pictures.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>From my experience usually when you get this message \"sp analysis failed\", it means that the stack frame that was created in the current function's prologue was incorrectly freed or only partially freed causing the return address to be different than the next instruction after the call to the current function, which means that the function will return to an unknown address that was pushed to stack during the execution of the current function and was not properly cleaned (either intentionally or because of a bug).</p>\n<p>another reason it might be caused by is misalignment of stack again due to a partial cleanup of the stack frame.</p>\n<p>if you want to read more about stack frame's and how the stack should align tight after a call and right before a return instruction, <a href=\"https://stackoverflow.com/questions/3699283/what-is-stack-frame-in-assembly\">this</a> thread in stack overflow.</p>\n<p>Looking at the snippet pictures you attached it looks like the stack should be aligned... since the function begins with 3 pushes and ends with 3 pops, but we don't know what happens in the middle of the function, there might be more push instructions that are not popped from the stack causing the stack to be misaligned with the return address before returning back to the caller function.</p>\n</div>",
            "votes": "1",
            "user": "rotem.salinas",
            "time": "May 6, 2024 at 8:41",
            "is_accepted": false,
            "comments": []
        }
    ]
}