{
    "title": "Find Dereference And Write to Offset of Pointer",
    "link": "https://reverseengineering.stackexchange.com/questions/32956/find-dereference-and-write-to-offset-of-pointer",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I want to find objects within a large C++ codebase that have a function that writes to 16 bytes offset off a pointer stored in an instance variable.</p>\n<p>So for example given the code has:</p>\n<pre><code>MyClass object1 = new MyClass(pointer1);\nobject1.dereferenceAndWrite16BytesOffMyPointer(); // This would dereference the instance's pointer and write to 16 bytes past that pointer\n</code></pre>\n<p>I would want to detect the object1 and its targeted dereferenceAndWrite16BytesOffMyPointer function.</p>\n<p>I tried using manual inspection of mov and other instructions with 0x16 offsets via objdump but this is difficult and time consuming. Is there a better approach?</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "46",
    "tags": [
        "decompilation",
        "c++"
    ],
    "user": "098029384098",
    "time": "May 6, 2024 at 22:45",
    "comments": [
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">Can you give a bit more context? Are you able to compile this codebase? Which processor and OS it is compiled for? How much time do you have for this task? For example if you're able to compile it for Linux with debug information you have pahole utility (<a href=\"https://linux.die.net/man/1/pahole\" rel=\"nofollow noreferrer\">linux.die.net/man/1/pahole</a>) to detect pointers in such an offset.</span>",
            "time": null
        },
        {
            "user": "rotem.salinas",
            "text": "<span class=\"comment-copy\">Not sure if you are using IDA Pro or not, if you have access to IDA Pro you could cross-reference the pointer and then sort the list to focus on dereferences of the said pointer and then see where exactly it is being written with 16 bytes. Also, this can be done using IDAPython by enumerating the cross-references for the pointer and following the same logic.</span>",
            "time": null
        },
        {
            "user": "098029384098",
            "text": "<span class=\"comment-copy\">@ws pahole keeps failing and not analyzing the shared library</span>",
            "time": null
        },
        {
            "user": "098029384098",
            "text": "<span class=\"comment-copy\">@rotem.salinas I will try IDAPython</span>",
            "time": null
        },
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">@098029384098 Are you compiling with -g option? Pahole extracts data from debug information.</span>",
            "time": null
        }
    ],
    "answers_data": []
}