{
    "title": "The dumb dvr performs factory settings automatically and does not save the settings",
    "link": "https://reverseengineering.stackexchange.com/questions/32971/the-dumb-dvr-performs-factory-settings-automatically-and-does-not-save-the-setti",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a DVR device from Hikvision that does not save any changes or settings, and when it is restarted, it returns to the factory state... I tried another dump, not from the same brand name, and it worked, but only connected to the server. Now I want us to fix the dumb. This is my first question here. Is there anyone here interested in that?</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "42",
    "tags": [
        "binary-analysis",
        "hardware",
        "hex",
        "firmware-analysis"
    ],
    "user": "elctro1991",
    "time": "May 18, 2024 at 21:20",
    "comments": [
        {
            "user": "Rup",
            "text": "<span class=\"comment-copy\">That sounds like a talk-to-customer-services problem. Are you sure the physical storage is OK, backed by a working battery, any reset jumper is not shorted, etc?</span>",
            "time": null
        },
        {
            "user": "Rup",
            "text": "<span class=\"comment-copy\">Unless you’re saying the storage is OK with the second image? But then Hikvision still owe you a working image, so talk to them.</span>",
            "time": null
        },
        {
            "user": "elctro1991",
            "text": "<span class=\"comment-copy\">RUb, thanks for your response, but allow me to respond to your comments Yes, I am sure about the actual storage unit. I replaced it with a new one (25Q128). Yes, the battery is also new and its size is correct in millimeters. There are no links to reset  There is no solution from Hikvision, they do not talk about repair matters......but it is possible to repair in a simpler way than usual, which is to transfer the serial number to another working dump.. Is there anyone here interested in this matter?</span>",
            "time": null
        },
        {
            "user": "jsotola",
            "text": "<span class=\"comment-copy\"><code>Is there anyone here interested in that?</code> ... is that really your only question? ... what use is a <code>yes</code> answer?</span>",
            "time": null
        }
    ],
    "answers_data": []
}