{
    "title": "Jump back to the caller",
    "link": "https://reverseengineering.stackexchange.com/questions/3302/jump-back-to-the-caller",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm debugging some app inside the ollydbg, so this two steps i set to start debugging the app.</p>\n<ol>\n<li>I load the exe from file menu with input arguments</li>\n<li>Set breakpoint on msvcr71.printf function</li>\n</ol>\n<p>After this two initial steps, when I hit F9 the app show some messages generated with printf function depending from the input arguments(by now i'm testing wrong password which shows the app messages about wrong password). So now I need to jump to the code which hold the logic, the code that made the call to printf, by checking if the pass was good or bad. How this can be done, when I have set breakpoint?</p>\n<p>Thanks</p>\n</div>",
    "votes": "11",
    "answers": 3,
    "views": "9k",
    "tags": [
        "ollydbg",
        "debugging"
    ],
    "user": "Igor",
    "time": "Dec 31, 2013 at 15:30",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Here is a way how you would go back to the caller. The following is a small C++ crackme for demonstration</p>\n<pre><code>#include&lt;stdio.h&gt;\n#include&lt;string.h&gt;\n#include&lt;conio.h&gt;\n\nint main()\n{\n    char code[50];\n    char valid[]=\"12345\";\n    printf(\"Enter your password : \\n\");\n    gets(code);\n    if(!strcmp(code,valid))\n        printf(\"That's it!!!\\n\");\n    else\n        printf(\"Try again!!!\\n\");\n    getch();    \n    return 0;\n}\n</code></pre>\n<hr/>\n<h2>Step 1</h2>\n<p>Now as usual you load the app in OllyDBG. Now assume that we do not know anything the inner logic of the crackme. So lets put a breakpoint on the functions which prints on the console. So the best bet is to search for all intermodular calls.</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/xzPZ9.png\"/></p>\n<hr/>\n<h2>Step 2</h2>\n<p>So you see it calls <code>puts</code> .This function is used to display a string on the console and is called from 3 places. So lets place a breakpoint on the function itself so that we can know from where it is called.</p>\n<p>Now the function is defined at <code>VA 0x75898D04</code> . So put a breakpoint over there.</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/iiuXm.png\"/></p>\n<hr/>\n<h2>Step 3</h2>\n<p>Now run the app by pressing <kbd>F9</kbd> till breakpoint is hit.</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/V3kKQ.png\"/></p>\n<p>Now look at the stack at the bottom right it shows the place from where <code>puts</code> would return after executing as well as the parameters passed to this function.</p>\n<p>Since this parameter passed is the string asking for password we can skip it until we get to the badboy message string. So continue pressing <kbd>F9</kbd> until you get to the point where the parameter passed is the badboy message. (The console meanwhile asks for the password and write something there)</p>\n<p>So we run till here.</p>\n<hr/>\n<h2>Step 4</h2>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/xf2mx.png\"/></p>\n<p><code>puts</code> would return to <code>VA 0x401C66</code> and the parameter passed is the badboy message.\nSo lets go to <code>0x401C66</code>.\nPress <kbd>Ctrl</kbd>+<kbd>G</kbd> in the CPU window to go there.\nYou can also press <kbd>Enter</kbd> directly on the return address shown on the stack.</p>\n<p>So we land here.</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/k1CwR.png\"/></p>\n<hr/>\n<h2>Step 5</h2>\n<p>Just above the <code>puts</code> call there is a <code>strcmp</code> call checking our entered serial with a hardcoded value. If you explore a little you can see that the hardcoded value is <code>12345</code></p>\n<p>(You may set a breakpoint on the <code>strcmp</code> call and restart the target to see what is being compared to whom)</p>\n<p>So that's the serial which would skip the badboy message and land us to the goodboy message.</p>\n<p>I am not suggesting the <kbd>Ctrl</kbd>+<kbd>F9</kbd> method because you may sometimes encounter function which never returns. Such functions are specifically coded to obfuscate and thwart static and dynamic analysis. However in other cases <kbd>Ctrl</kbd>+<kbd>F9</kbd> method is pretty good.</p>\n</div>",
            "votes": "13",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Once your breakpoint on <code>printf()</code> is hit, press <kbd>Ctrl</kbd>+<kbd>F9</kbd> to tell OllyDbg to run until the end of the <code>printf()</code> function, then press <kbd>F7</kbd> to single-step the return instruction back to the caller.</p>\n</div>",
            "votes": "4",
            "user": "Jason Geffner",
            "time": "Dec 27, 2013 at 22:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Igor",
                    "text": "<span class=\"comment-copy\">If I try ctrl + f9, the code print just the first meesage from all three, otherwise with f9 print all three messages. Both ctrl+f9 or f9 skips the code till kifastsystemcallret call. So the code stuck here so i can't move, just to restart the app. With ctrl + f9, after this hit i hit f7, but the code not jump to that code logic i need, something random. Thanks for your help.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">Please post a screenshot of OllyDbg paused at the <code>printf()</code> breakpoint.</span>",
                    "time": null
                },
                {
                    "user": "Igor",
                    "text": "<span class=\"comment-copy\">Ok to update you a little. I'm learning from the book 'secret of reverse engineering. <a href=\"http://i.imgur.com/To9LhuV.png\" rel=\"nofollow noreferrer\">i.imgur.com/To9LhuV.png</a> This one is about the breakpoint.  <a href=\"http://i.imgur.com/r7M7xCN.png\" rel=\"nofollow noreferrer\">i.imgur.com/r7M7xCN.png</a> This screenshot shows where code skips after i hit f9.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">That breakpoint is not on the <code>printf()</code> function; it's on the call to the <code>printf()</code> function. And don't bother using <code>F9</code> in this context as it will just run your program until it terminates.</span>",
                    "time": null
                },
                {
                    "user": "Igor",
                    "text": "<span class=\"comment-copy\">With ctrl + f9 the app in debug mode print just the first message and not printing the other two. But if I use ctrl + f9 and then f7 as you tell me here how it looks and where go the code <a href=\"http://i.imgur.com/aWBrdCg.png\" rel=\"nofollow noreferrer\">i.imgur.com/aWBrdCg.png</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Both of Your ScreenShots are irrelevent the app has terminated in first screenshot \nand it is in some random ZwMapSection in second screenshot </p>\n<p>you posted you set a bp on printf was the breakpoint hit ?\nif it was hit then you can look at the call stack using ctrl+k \nollydbg will show you who called printf </p>\n<p>your screenshots do not show if you had hit the break and if you are suspended in call to printf as Jason posted in his comment</p>\n<p>also with ollydbg you can use runtrace feature to trace the complete path that can help you isolate the logic have you tried using it </p>\n</div>",
            "votes": "1",
            "user": "blabb",
            "time": "Dec 29, 2013 at 17:48",
            "is_accepted": false,
            "comments": []
        }
    ]
}