{
    "title": "Extracting / converting an unknown 1990s graphics file format (.ATR)",
    "link": "https://reverseengineering.stackexchange.com/questions/33177/extracting-converting-an-unknown-1990s-graphics-file-format-atr",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>For about a month I've been working towards trying to crack the file structure on the graphical assets from the old JumpStart CD-ROM games. A large percentage of these games do not have their sprites archived, and despite community efforts the unfamiliar file formats have stumped everyone else I've asked about this. These had been contained in a format called .rsc, but someone else had managed to make a script to extract these assets out. Unfortunately that still doesn't fix the issue, as the sprites are seemingly contained within another unknown file type that was contained within the .rsc files.</p>\n<p>Now I want to see if it's possible to extract or convert the data for the sprites into something that can be turned into a sprite sheet (.png, .bmp, etc). <strong>Here are the details:</strong></p>\n<ul>\n<li><p>The sprites themselves appear to be in a file format called .ATR files, and are <em>unrelated</em> to the Atari based format of the same name. Attempting to open them through programs for those files resulted in errors / crashing. From what I've seen nobody else has been able to open these either, unlike the .rsc files.</p>\n</li>\n<li><p>Alongside the .ATR files were .SCR and .SCN files. I attempted to view the structure of these to see if there could be any indication as to what it'd be doing. The .SCR files only contained comments, and the .SCN files seemingly mention the .ATRs (when viewed in a hex editor), but other than that I'm stuck.</p>\n</li>\n<li><p>When I viewed the structure of the .ATRs in a hex editor, I noticed a repeating section of bytes (0xFF) that occurred often in the file at different points, each for same amount of . As well, the beginning of the file always had the same signature \"ATR12\" followed by the filename, and then it mentions the scene background. Here's a picture example of what most of these look like: <a href=\"https://imgur.com/a/WE0TniA\" rel=\"nofollow noreferrer\">https://imgur.com/a/WE0TniA</a> (image cuts it off). However, certain ones, like ones for characters, have a structure that looks more like <em>this</em> : <a href=\"https://imgur.com/a/taAIj7b\" rel=\"nofollow noreferrer\">https://imgur.com/a/taAIj7b</a> .</p>\n</li>\n<li><p>The game's engine is a closed source, in house engine called Broadway, and the game I've been trying to work from was written in C++. I'm including this in case it'd help at all.</p>\n</li>\n</ul>\n<p>Any help / information would be super appreciated, as if it's possible to turn these back into viewable images, that would solve the years long preservation problem that these games have. I'd like some more opinions on what this could all mean to hopefully get a better idea on if these are compressed, or if they're encrypted, or if they can be converted at all. <strong>Here is a link to download some of these files (.ATR, .SCN, and .SCR) for one particular section of the game:</strong> <a href=\"https://drive.google.com/file/d/1pIe6AKtKstM1ViIZ7aFkHLnU5cvvdcUt/view?usp=sharing\" rel=\"nofollow noreferrer\">https://drive.google.com/file/d/1pIe6AKtKstM1ViIZ7aFkHLnU5cvvdcUt/view?usp=sharing</a>. Thanks!</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "103",
    "tags": [
        "binary-analysis",
        "file-format",
        "decompress",
        "binary-diagnosis",
        "unknown-data"
    ],
    "user": "bearyberriez",
    "time": "Aug 23, 2024 at 13:32",
    "comments": [
        {
            "user": "Ian Cook",
            "text": "<span class=\"comment-copy\">Do you have screenshots of the section of the whichever game the linked files are from correspond too ?</span>",
            "time": null
        },
        {
            "user": "bearyberriez",
            "text": "<span class=\"comment-copy\">@IanCook I do! The separate sections use specific naming formats, this room (ChalkBoard001) appears like this : <a href=\"https://imgur.com/a/d62TPXW\" rel=\"nofollow noreferrer\">imgur.com/a/d62TPXW</a></span>",
            "time": null
        }
    ],
    "answers_data": []
}