{
    "title": "Cannot call function (properly) in ollydbg",
    "link": "https://reverseengineering.stackexchange.com/questions/3374/cannot-call-function-properly-in-ollydbg",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I need some help regarding calls in assembly with Ollydbg.\nI'm messing around with a simple application.\nSo far, so good, I created a codecave for myself to add some code.</p>\n<p>But whenever I try to create a call to a function outside my debugged executable module to, for example, a <code>kernel32</code> or <code>msvcrt</code> function, it messes everything up.</p>\n<p>Let's look at some random call in the application:</p>\n<pre><code>0041D654     FF15 DC714200  CALL DWORD PTR DS:[&lt;&amp;KERNEL32.GetCommandLineA&gt;]\n</code></pre>\n<p>When I double click it, it shows me <code>CALL DWORD PTR DS:[4271DC]</code>\nSo, <code>4271DC</code> seems to point to <code>76FB496D</code>, which is, indeed:</p>\n<pre><code>76FB496D &gt;-FF25 60070177    JMP DWORD PTR DS:[&lt;&amp;api-ms-win-core-processenvironment-l1-2-0.Get&gt; ;KERNELBA.GetCommandLineA\n</code></pre>\n<p>Well, I just stole that from the application itself.\nNow I want to create a call to <code>kernel32</code> myself.\nI assemble a line and enter <code>CALL DWORD PTR DS:[Kernel32.GetCommandLineA]</code>\nNow it's saying:</p>\n<pre><code>0041D654     FF15 6D49FB76  CALL DWORD PTR DS:[KERNEL32.GetCommandLineA]\n</code></pre>\n<p>Looking good!</p>\n<p>Assemble the line <code>CALL DWORD PTR DS:[76FB496D]</code>. Giving this a run works fine ofcourse, but whenever I run it like this on another pc, all hell breaks loose.</p>\n<p>My question is: How can I make such an pointer <code>CALL DWORD PTR DS:[4271DC]</code>, so the code runs on all pc's?</p>\n<p>I can of course use <code>CALL DWORD PTR DS:[4271DC]</code> in the application to call the function <code>getcomandlineA</code> whenever I want, but I don't know the (dynamic?) pointer to, let's say, <code>kernel32.lstrcpy</code>.</p>\n</div>",
    "votes": "4",
    "answers": 3,
    "views": "2k",
    "tags": [
        "ollydbg"
    ],
    "user": "Dennis van den Berg",
    "time": "Jan 7, 2014 at 9:05",
    "comments": [
        {
            "user": "0xec",
            "text": "<span class=\"comment-copy\">You can disable ASLR by editing in a PE editor such as CFF Explorer. Then it will work on all machines.</span>",
            "time": null
        },
        {
            "user": "Stolas",
            "text": "<span class=\"comment-copy\">When ASLR is enable you can do something like this to find the LoadLibrary function: <a href=\"https://code.google.com/p/w32-dl-loadlib-shellcode/source/browse/trunk/w32-dl-loadlib-shellcode.asm\" rel=\"nofollow noreferrer\">code.google.com/p/w32-dl-loadlib-shellcode/source/browse/trunk/…</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The address at 004271DC is resolved at the application start via the executable Imports. Those addresses are different for every executable. The address where the module and functions are loaded (here 76FB496D) is also not guaranteed to always stay the same so you shouldn't hardcode them.  </p>\n<p>A generic method to call a function in any executable is to dynamically import it with LoadLibrary and GetProcAddress as described here : <a href=\"https://stackoverflow.com/questions/8696653/dynamically-load-a-function-from-a-dll\">https://stackoverflow.com/questions/8696653/dynamically-load-a-function-from-a-dll</a></p>\n</div>",
            "votes": "4",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you just want to use a single <code>CALL</code>, you need to make sure that your target API function is statically imported. You can use a tool like <a href=\"http://www.woodmann.com/collaborative/tools/index.php/IIDKing\" rel=\"nofollow\">IIDKing</a> to add your target API function to your PE file's static imports.</p>\n</div>",
            "votes": "3",
            "user": "Jason Geffner",
            "time": "Jan 7, 2014 at 2:41",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Call to hard-coded addresses will not work for different reasons, the most obvious is ASLR, which randomizes the base address of every DLL, which means that the function address will be different at every boot.</p>\n<p>Solving this issue is far from simple as the use of <code>LoadLibrary</code> and <code>GetProcAddress</code>, classically used by developers to dynamically import DLL will also have a dynamic address, so you can't use them to determine the address of your sought function.</p>\n<p>To solve this issue you have to use shellcode techniques; in other words you will have to include assembly code that parse the <code>PEB</code> structure to determine the base address of Kernel32 address, search for your function in export table and finally use the it.</p>\n<p>Another more advanced techniques for more complex usage is the use of reflective DLL injection, but it is a bit far from what you are looking for.</p>\n</div>",
            "votes": "2",
            "user": "3asm_",
            "time": "Jan 7, 2014 at 14:24",
            "is_accepted": false,
            "comments": []
        }
    ]
}