{
    "title": "Break on returning to a specific module",
    "link": "https://reverseengineering.stackexchange.com/questions/3405/break-on-returning-to-a-specific-module",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm debugging an application in OllyDbg, I pause the program at a specific place. Now I am deep inside ntdll and other gui related module calls, judging from the stack. <strong>I'ld like to break as soon as the application returns to any function within a specified (the main) module.</strong> Is there such breakpoint condition? How can I do this? </p>\n</div>",
    "votes": "6",
    "answers": 2,
    "views": "5k",
    "tags": [
        "ollydbg",
        "debugging",
        "memory",
        "callstack"
    ],
    "user": "Dominik Antal",
    "time": "Jan 8, 2014 at 8:24",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Go to the memory window in Ollydbg. Find the code section (usually .text) of the module you want to break on return to. Right click the memory section and set break-on-access or hit <kbd>F2</kbd>. You'll break once execution reaches that memory. You can also change the memory access to read only and you'll get an exception when execution hits that memory segment.</p>\n<p>You can also use a trace and set a conditional stop when EIP is within a certain range, to do this simply set the condition by going to Debug, Set Condition (<kbd>Ctrl</kbd>+<kbd>T</kbd>). Then start the trace with Debug, Trace Into (<kbd>Ctrl</kbd>+<kbd>F11</kbd>)or Debug, Trace Over (<kbd>Ctrl</kbd>+<kbd>F12</kbd>). This will enable you to see where you came from, even if the call is indirect.</p>\n<p>It's not guaranteed to be on return but if you're in a different module it's fairly likely that the return is when the first execution happens. You could also be triggering on calls through imports, through object vtables or some other mechanism. You'd need to study the state you're in when the break hits.</p>\n</div>",
            "votes": "7",
            "user": "Peter Andersson",
            "time": "Jan 8, 2014 at 9:01",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Dominik Antal",
                    "text": "<span class=\"comment-copy\">I've never would have thought that I can set break \"point\" on a whole memory section... wow.</span>",
                    "time": null
                },
                {
                    "user": "Peter Andersson",
                    "text": "<span class=\"comment-copy\">I haven't studied the mechanism in detail but the way I would solve it if I were writing a debugger is to set the entire memory region as no access then the debugger catches the exception when an attempt to access it is made. That way you would get a sort of memory region breakpoints. I'm not sure how OllyDbg implements it.</span>",
                    "time": null
                },
                {
                    "user": "Dominik Antal",
                    "text": "<span class=\"comment-copy\"><a href=\"http://www.stackoverflow.com/questions/3771785/whats-the-principle-of-ollydbgs-memory-breakpoint\">Related.</a></span>",
                    "time": null
                },
                {
                    "user": "rollsch",
                    "text": "<span class=\"comment-copy\">How do you \"find the code section\" in memory? How do I determine where in memory my program has been loaded? Edit: I just realised if you expand the memory section you can easily find it, thanks.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In normal condition <code>alt+f9 execute till user code</code> should get you back to user code</p>\n</div>",
            "votes": "4",
            "user": "blabb",
            "time": "Jan 8, 2014 at 18:33",
            "is_accepted": false,
            "comments": []
        }
    ]
}