{
    "title": "Why IDA Pro generated a \"j_printf\" function call?",
    "link": "https://reverseengineering.stackexchange.com/questions/3435/why-ida-pro-generated-a-j-printf-function-call",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Test platform is windows 32 bit.  IDA pro 64</p>\n<p>So, basically I use IDA pro to disassemble a PE file, and do some transformation work on the asm code I get, to make it <strong>re-assemblable</strong>.</p>\n<p>In the transformed code I generated, the system function call like <code>printf</code> will be written just as the usual way.</p>\n<pre><code>extern printf\n....\n....\ncall printf\n</code></pre>\n<p>I use this to reassemble the code I create:</p>\n<pre><code>nasm -fwin32 --prefix _ test.s\ncl test.obj /link msvcrt.lib\n</code></pre>\n<p>I got a PE executable file, and basically it works fine (Like a hello world program, a quick sort program and others).</p>\n<p>But then, as I use <strong>IDA pro to re-disassemble the new PE executable file I create</strong>, strange things happened.</p>\n<p>IDA pro generates function call like this:</p>\n<p><img alt=\"IDA pro\" src=\"https://i.sstatic.net/2ttKz.png\"/></p>\n<p>and when I use:</p>\n<pre><code>idaq.exe -B test.exe \n</code></pre>\n<p>to generate new assembly code, in the printf function call part, it generate this:</p>\n<pre><code>call j_printf\n</code></pre>\n<p>Without the <code>j_printf proc near</code> function define...</p>\n<p>So basically I am wondering if anyone know how do deal with this, to let IDA pro generate </p>\n<pre><code>call printf\n</code></pre>\n<p>or </p>\n<pre><code>call _printf\n</code></pre>\n<p>again or any other solution?</p>\n</div>",
    "votes": "7",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "disassembly",
        "windows",
        "reassembly"
    ],
    "user": "lllllllllllll",
    "time": "Jan 11, 2014 at 6:20",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">possible duplicate of <a href=\"http://reverseengineering.stackexchange.com/questions/2857/why-is-jmp-used-with-call\">Why is JMP used with CALL?</a></span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@JasonGeffner: while I agree that it looks like a duplicate, the question is asked completely differently (which will aid future internauts when searching).</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It's cl.exe that's inserting the jump thunk. It has some advantages, such as making it easier to redirect a function during runtime after load and makes it so that the loader only has to do a single relocation for that function. The other option would be to use an indirect call through an address. Neither is really optimal for performance due to the distance between the call and the jump or the address, which can hurt caching. You can <a href=\"http://msdn.microsoft.com/en-us/library/4khtbfyf%28VS.80%29.aspx\">disable the jump thunk by disabling incremental linking</a>.</p>\n<p>That said, what you're doing is probably a bad idea. IDA is not really made to produce code that can be reassembled. What's normally done is that you extend the last section or add a new section with the patched code then redirect the original code to the patch through a call or a jump.</p>\n</div>",
            "votes": "9",
            "user": "Peter Andersson",
            "time": "Jan 11, 2014 at 6:11",
            "is_accepted": true,
            "comments": []
        }
    ]
}