{
    "title": "How do I trace instructions in an Immunity Debugger PyCommand?",
    "link": "https://reverseengineering.stackexchange.com/questions/3450/how-do-i-trace-instructions-in-an-immunity-debugger-pycommand",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This sounds like a very simple thing to accomplish but I can't seem to get it working.</p>\n<p>I'd like to run a part of a program in ImmDbg instruction by instruction and keep track of some actions that it performs (which jumps it takes, when registers are modified, etc...). This is of course a tedious process to do by hand and sometimes I need to automate it and add some custom behavior based on the target.</p>\n<p>I didn't find tracing facilities in the Python APIs, so I tried to step through the code. The sample code below should simply execute 10 instructions.</p>\n<pre><code>import immlib\n\nimm = immlib.Debugger()\n\ndef main(args):\n    for i in range(10):\n        imm.stepIn()\n\n    return \"OK\"\n</code></pre>\n<p>However, it appears to be executing sometimes less than 10 instructions and each stepIn() call freezes the program for about a second, rendering the script way too slow to perform anything useful.</p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "python",
        "debugging",
        "immunity-debugger"
    ],
    "user": "Sigill",
    "time": "Jan 13, 2014 at 11:01",
    "comments": [
        {
            "user": "Peter Teoh",
            "text": "<span class=\"comment-copy\">the answer is simple:   just look at mike.py inside the pycommand subdirectory.   it has the stepIn() loop.   the reason why your execution take too long is because when you encountered system DLL you are supposed to stepover it, as shown in \"mike.py\".</span>",
            "time": null
        },
        {
            "user": "Peter Teoh",
            "text": "<span class=\"comment-copy\">and additionally, remember to enable tracing (via calling stepIn() above) only when a particular breakpoint is reached (use LogBpHook).</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you just want to trace instructions to create a control flow graph (CFG) and even a fairly-accurate data flow graph (DFG), pyCommand is admittedly clunky compared to the tools we have available:</p>\n<p><strong>PLATFORM AGNOSTIC</strong></p>\n<ul>\n<li>pydbg (python)</li>\n<li>capstone disassembly (python, with added taint analysis support)</li>\n<li>Intel Pintools (C/C++, faster than all the above)</li>\n<li>openREIL (highly experimental)</li>\n</ul>\n<p><strong>LINUX</strong></p>\n<ul>\n<li>perf (linux kernel module which already implements CFG creation)</li>\n<li>valgrind/callgrind (callgrind is responsible for CFG creation)</li>\n</ul>\n<p>Please note the python solutions with be slower (but easier to implement) than the C/C++ solutions.</p>\n</div>",
            "votes": "1",
            "user": "grepNstepN",
            "time": "May 20, 2016 at 16:15",
            "is_accepted": false,
            "comments": []
        }
    ]
}