{
    "title": "Does code injected into process memory always belong to a page with RWX access?",
    "link": "https://reverseengineering.stackexchange.com/questions/3482/does-code-injected-into-process-memory-always-belong-to-a-page-with-rwx-access",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've seen a few memory forensics tutorials, which start by looking for injected code in the \"victim's\" process memory. They always seem to find the injected code in pages which have RWX access (i.e. PAGE_EXECUTE_READWRITE). </p>\n<p>Does this assumption always hold? Does code injected (e.g. by malware) into the process memory of a \"victim\", always belong to a page with RWX access? Or can the page access be changed, by the code that is injected? If so, how can this change be done via winapi?</p>\n</div>",
    "votes": "6",
    "answers": 3,
    "views": "6k",
    "tags": [
        "windows",
        "memory",
        "winapi"
    ],
    "user": "Benny",
    "time": "Jan 19, 2014 at 11:57",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The assumption does not hold true, as it is possible to alter page protection flags <em>after</em> you've allocated memory.</p>\n<p>The usual mechanism for code injection on Windows is as follows:</p>\n<ol>\n<li>Call <code>OpenProcess</code> for the target process, to get a handle that has appropriate access privileges.</li>\n<li>Use <code>VirtualAllocEx</code> to allocate a buffer in the target process, with a set of memory page access flags.</li>\n<li>Use <code>WriteProcessMemory</code> to copy the memory to the target.</li>\n<li>Either patch existing code to jump to the new code block, or use <code>CreateRemoteThread</code> to execute within the process via a new thread.</li>\n</ol>\n<p>Now, there are two options here. The first is that you can specify <code>PAGE_EXECUTE_READWRITE</code> as a flag to <code>VirtualAllocEx</code>, so that you have the right to use <code>WriteProcessMemory</code> on that page, and also the right to execute that memory when you get to step 4. This is the \"lazy\" way that leads to having RWX buffers hanging around. The alternative way is to pass <code>PAGE_READWRITE</code> when allocating the block, then write the code, and call <code>VirtualProtectEx</code> to swap the flag over to <code>PAGE_EXECUTE_READ</code> before step 4. This gives you an RW buffer when copying data, then an RX buffer when executing.</p>\n<p>Pseudocode:</p>\n<pre><code>rights = PROCESS_VM_OPERATION |\n         PROCESS_VM_READ | PROCESS_VM_WRITE | \n         PROCESS_QUERY_INFORMATION | \n         PROCESS_CREATE_THREAD;\n\nhandle = OpenProcess(rights, false, pid);\n\ntargetAddr = VirtualAllocEx(handle, NULL, 4096, MEM_RESERVE | MEM_COMMIT, PAGE_READWRITE);\n\nbuffer = \"Hello, world!\\0\";\nbytesWritten = 0;\nWriteProcessMemory(handle, targetAddr, buffer, 14, &amp;bytesWritten);\n\noldProtect = 0;\nVirtualProtectEx(handle, targetAddr, 4096, PAGE_EXECUTE_READ, &amp;oldProtect);\n\nthreadId = 0;\nCreateRemoteThread(handle, NULL, 0, targetAddr, NULL, 0, &amp;threadId);\n</code></pre>\n</div>",
            "votes": "8",
            "user": "Polynomial",
            "time": "Jan 19, 2014 at 13:20",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Benny",
                    "text": "<span class=\"comment-copy\">thanks for the detailed answer. In the alternative (\"non-lazy\") way of code injection you described, is it possible to swap the PAGE_EXECUTE_READWRITE with PAGE_EXECUTE or PAGE_EXECUTE_WRITECOPY, as an alternative to PAGE_EXECUTE_READ which you gave in your example?</span>",
                    "time": null
                },
                {
                    "user": "Polynomial",
                    "text": "<span class=\"comment-copy\">PAGE_EXECUTE should work fine, but looks weird since it's rare to see PAGE_EXECUTE on allocations. Using PAGE_EXECUTE_WRITECOPY <i>should</i> work, but VirtualAllocEx doesn't support it. I don't know if VirtualProtectEx does.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The reason for targeting the RWX pages is that the injected code most often carries data in the same region as the code, and requires that the data are writable.  Thus the W flag is needed.  The X flag is required to support DEP, in case the process opted in, or if the system enforces it for everyone.  The R flag is entirely optional when requesting the page.  Windows will ensure that it is set anyway.\nIt is of course possible for malware to allocate two regions, one [R]X and one [R]W, and write only to the writable section, but I don't recall ever seeing this technique being used.  For one thing, it complicates the injected code.</p>\n</div>",
            "votes": "2",
            "user": "peter ferrie",
            "time": "Jan 20, 2014 at 4:39",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Page access can be changed. See <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/aa366898%28v=vs.85%29.aspx\" rel=\"nofollow\">VirtualProtect</a>, <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/aa366786%28v=vs.85%29.aspx\" rel=\"nofollow\">Memory Protection Constants</a> and <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/aa366899%28v=vs.85%29.aspx\" rel=\"nofollow\">VirtualProtectEx</a> documentation.\nInjected code should be executable and readable, but not necessarily \n writable.</p>\n</div>",
            "votes": "1",
            "user": "w s",
            "time": "Jan 19, 2014 at 12:40",
            "is_accepted": false,
            "comments": []
        }
    ]
}