{
    "title": "Ollydbg 'Copy all modifications to executable' doesn't copy all modifications",
    "link": "https://reverseengineering.stackexchange.com/questions/3579/ollydbg-copy-all-modifications-to-executable-doesnt-copy-all-modifications",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm editing executables on a(n) (almost) daily bases in Ollydbg and it is very annoying that the 'Copy all modifications to executable' doesn't work properly.</p>\n<p>All the code I edit in the .text section is copied to the new executable, but all the changes made to the .rsrc section (resources) is not copied. (Using 'Copy all...')</p>\n<p>To save my changes made in the .rsrc section, I need to select the modified code in this section and specifically click 'Copy to executable'.</p>\n<p>Is there a workaround to actually copy <strong>ALL</strong> modifications?</p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "8k",
    "tags": [
        "ollydbg"
    ],
    "user": "Dennis van den Berg",
    "time": "Feb 1, 2014 at 11:44",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You need two times to save the changes. Once for .text section and re-do  for .rsrc section.</p>\n<p>Each time you use this option OllyDBG just save all change of the section that you use \"copy to executable\"</p>\n</div>",
            "votes": "1",
            "user": "HamiD",
            "time": "Feb 2, 2014 at 16:37",
            "is_accepted": false,
            "comments": [
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">@ Hamid ollydbg depends on analysis data to save all modifications and it does not analyse any section apart from code section if you have n number of modifications in rsrc section you may need to do copy to executable n number of times if all your modifications are in .rsrc section  ollydbg iirc will not even show the copy all modifications context menu in any other section except code section for which it has analysis data and a copy of its internal modifications (int cc hit trace runtrace name symbol info) and external modifications (patch window) blind copyall is illogical requirement imho</span>",
                    "time": null
                },
                {
                    "user": "HamiD",
                    "text": "<span class=\"comment-copy\">@blabb The best choices is to change the data in resource section use the resource editor software. It's a mistake, if you have N section you need to do 'copy to executable' N times, Each time a section. if you use 'copy to executable' in resource section you cannot save another change in another section, you just save this section.But the changes should be in the range of PE file size. Sometimes VSize is greater than RSize.</span>",
                    "time": null
                }
            ]
        }
    ]
}