{
    "title": "What is the Ubicom32 toolchain and where can I find it?",
    "link": "https://reverseengineering.stackexchange.com/questions/3592/how-to-disassemble-ubicom32-binaries",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am currently reversing firmware for some device.\nWithout any issues I was able to reach deep into its core and extract the file-system. Now I was trying to reverse some of the special applications on this device. After checking the file format I noticed the following: It is an ELF 32-bit MSB (big-endian) on the Ubicom32 platform. </p>\n<p>After googling, checking woodmann and tinkering with it a bit I couldn't find too much information about this format expect the fact that \"it exist\".</p>\n<p>Are there tools (or plug-ins) that handle this file format? Can I just regard this as ARM or MIPS? I did find <a href=\"https://dev.openwrt.org/browser/trunk/target/linux/ubicom32?rev=19815&amp;order=name#files/arch/ubicom32\" rel=\"nofollow\">OpenWRT - Ubicom32 Kernel</a> but no toolchain.</p>\n</div>",
    "votes": "7",
    "answers": 3,
    "views": "2k",
    "tags": [
        "firmware",
        "ubicon32"
    ],
    "user": "Markus Orreilly",
    "time": "Sep 2, 2013 at 16:33",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Ubicom32 is a proprietary architecture, not at all related to ARM or MIPS (other than the fact that it is RISC...well, kind of). IIRC it was designed specifically for networking and multimedia streaming applications, so it's a bit of an odd architecture. It was developed by Ubicom, but they were bought by Qualcomm.</p>\n<p>There are Linux tool chains out there for it, the best place to get them that I've found is from vendor GPL releases. If there is no GPL release for your particular device, look for other Ubicom-based devices from that vendor (or other vendors) which do have GPL releases.</p>\n<p>Beware that just having a toolchain probably won't be sufficient for reversing the code, you'll need an assembly reference to understand the instructions as well. AFAIK Ubicom never released this publicly, but some creative Googling turned up some mostly complete references for me a while back. I'll see if I can track down the links.</p>\n<p><strong>UPDATE</strong>: Found the datasheet for the IP5000 series Ubicom CPUs, which includes an instruction set reference: <a href=\"http://www.texim-europe.com/getfile.aspx?id=68544\">http://www.texim-europe.com/getfile.aspx?id=68544</a></p>\n</div>",
            "votes": "8",
            "user": "devttys0",
            "time": "Aug 31, 2013 at 14:56",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Stolas",
                    "text": "<span class=\"comment-copy\">Thank you a lot. Seems like reversing this just turned into a lot more effort.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>For those interested I found the: <a href=\"https://www.codeaurora.org/cgit/external/ubicom/ubicom32/\" rel=\"nofollow\">GNU Toolchain including GDB</a>.</p>\n</div>",
            "votes": "3",
            "user": "Stolas",
            "time": "Sep 2, 2013 at 16:33",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can find the toolchain in Western Digital N900's <a href=\"http://support.wdc.com/product/download.asp?groupid=1703&amp;sid=179&amp;lang=en\" rel=\"nofollow\">GPL source code</a>.</p>\n</div>",
            "votes": "-1",
            "user": "Ange",
            "time": "Dec 17, 2013 at 8:09",
            "is_accepted": false,
            "comments": [
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">Could you elaborate a bit ? :)</span>",
                    "time": null
                }
            ]
        }
    ]
}