{
    "title": "Runtime memory reading with injection",
    "link": "https://reverseengineering.stackexchange.com/questions/3623/runtime-memory-reading-with-injection",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm reversing an application written in C. I have a certain function that I want to log runtime, without pausing/stopping the application. </p>\n<p>My desired values of that function are: </p>\n<ul>\n<li><code>[ESP + 4]</code> which is the length of a buffer </li>\n<li><code>[ESP + 8]</code> which is a <em>pointer</em> to a string buffer</li>\n</ul>\n<p>Then I want to read the buffer and write it into a file.</p>\n<p>First thing I was told to use is Immunity's <code>LogBpHook</code>, which worked great, but it stops the application and it becomes really slow due to this, because it's a frequently called function. </p>\n<p>Then I tried to setup <code>FastLogHook</code> which sounds more like what I'm after. It injects a log stub and stores encountered values, but as far as I know it can not perform further memory readings like the one I described above anyway (if it can please tell me). Also it constantly crashed my application so it's out of the question.</p>\n<p>So I left with the idea of injecting a customized code stub that would take care of further readings and logging of the values into a file. Is there any tool that could do this, or I have to manually write+inject this assembly?</p>\n<p><strong>How can I log function parameters runtime, without stopping the application?</strong></p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "1k",
    "tags": [
        "assembly",
        "memory",
        "immunity-debugger",
        "functions",
        "callstack"
    ],
    "user": "Dominik Antal",
    "time": "Apr 8, 2015 at 17:08",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<ol>\n<li>You can write your hooking library (DLL) which will patch the API you are targeting. This patch will just print to file/console the parameters and continue back to the original function. There will be no stops on the way. To actually hook the APIs you will need to inject the DLL into the target application. You can use <a href=\"http://research.microsoft.com/en-us/projects/detours/\" rel=\"nofollow\">Detours from Microsoft</a> as and example which is a software package for re-routing Win32 APIs underneath applications.\n<ol>\n<li><a href=\"http://www.codeproject.com/Articles/2082/API-hooking-revealed\" rel=\"nofollow\">API hooking revealed</a> - an article on <strong>CodeProject</strong> with examples. But you can find on the net endless examples for this technique.</li>\n<li><a href=\"http://www.codeproject.com/Articles/30140/API-Hooking-with-MS-Detours\" rel=\"nofollow\">API Hooking with MS Detours</a></li>\n</ol></li>\n<li><a href=\"http://www.rohitab.com/apimonitor\" rel=\"nofollow\">API Monitor</a> - API Monitor is a free software that lets you monitor and control API calls made by applications and services. Its a powerful tool for seeing how applications and services work or for tracking down problems that you have in your own applications.</li>\n<li><a href=\"http://en.wikipedia.org/wiki/Instrumentation_%28computer_programming%29\" rel=\"nofollow\">Process instrumentation</a> - <code>instrumentation refers to an ability to monitor or measure the level of a product's performance, to diagnose errors and to write trace information.</code>\n<ol>\n<li><a href=\"http://en.wikipedia.org/wiki/Pin_%28computer_program%29\" rel=\"nofollow\">Pin is a platform for creating analysis tools</a> - <code>A pin tool comprises instrumentation, analysis and callback routines.</code> <a href=\"http://resources.infosecinstitute.com/pin-dynamic-binary-instrumentation-framework/\" rel=\"nofollow\">Here</a> you can find an intro to writing pintool which you can extend to your needs. This is pretty powerful technique and more hard to adapt among all that I've listed here. The original site from <a href=\"http://software.intel.com/en-us/articles/pintool/\" rel=\"nofollow\">Intel</a> and specifically at <a href=\"http://software.intel.com/sites/landingpage/pintool/docs/62732/Pin/html/index.html#FunctionArguments\" rel=\"nofollow\">Finding the Value of Function Arguments</a> can help you with what you are looking for.</li>\n</ol></li>\n</ol>\n</div>",
            "votes": "4",
            "user": "PhoeniX",
            "time": "Feb 5, 2014 at 14:08",
            "is_accepted": true,
            "comments": [
                {
                    "user": "jbh",
                    "text": "<span class=\"comment-copy\"><a href=\"http://www.frida.re/\" rel=\"nofollow noreferrer\">Frida</a> is another Process Instrumentation possibility that is easy to set up. It injects Googles V8 (javascript) engine into the running process and then you can interact with the process using python bindings. They have an example of how to dump arguments of functions. Best of luck</span>",
                    "time": null
                }
            ]
        }
    ]
}