{
    "title": "\\??\\C:\\ Question Marks in Paths",
    "link": "https://reverseengineering.stackexchange.com/questions/3798/c-question-marks-in-paths",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I often come across paths similar to <code>\\??\\C:\\Windows</code> when looking in memory.  I have been unable to understand why the double '<code>?</code>' is appended to some paths. My google-fu is failing me with the ability to find a reason for the double '<code>?</code>'.Any assistance would be appreciated.</p>\n</div>",
    "votes": "7",
    "answers": 2,
    "views": "7k",
    "tags": [
        "windows",
        "memory"
    ],
    "user": "user4089",
    "time": "Apr 18, 2017 at 16:33",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>From <a href=\"http://a.co/7DtLqTA\" rel=\"nofollow noreferrer\">Windows Internals, Part 1 (6th Edition)</a> --</p>\n<blockquote>\n<p>All object-manager functions related to namespace management are aware\n  of the instanced directories and participate in providing the illusion\n  that all sessions use the same namespace. Windows subsystem DLLs\n  prefix names passed by Windows applications that reference objects in\n  \\DosDevices with <em>\\??</em> (for example, C:\\Windows becomes \\??\\C:\\Windows).\n  When the object manager sees the special \\?? prefix, the steps it\n  takes depends on the version of Windows, but it always relies on a\n  field named <em>DeviceMap</em> in the executive process object (EPROCESS, which\n  is described further in Chapter 5) that points to a data structure\n  shared by other processes in the same session.</p>\n<p>The <em>DosDevicesDirectory</em> field of the <em>DeviceMap</em> structure points at the\n  object manager directory that represents the process’ local\n  \\DosDevices. When the object manager sees a reference to \\??, it\n  locates the process’ local \\DosDevices by using the\n  <em>DosDevicesDirectory</em> field of the <em>DeviceMap</em>. If the object manager\n  doesn’t find the object in that directory, it checks the <em>DeviceMap</em>\n  field of the directory object. If it’s valid, it looks for the object\n  in the directory pointed to by the <em>GlobalDosDevicesDirectory</em> field of\n  the <em>DeviceMap</em> structure, which is always \\Global??.</p>\n</blockquote>\n</div>",
            "votes": "5",
            "user": "Jason Geffner",
            "time": "Jan 13, 2018 at 19:02",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Alec Wenzowski",
                    "text": "<span class=\"comment-copy\">-1 this does not answer the question and should not be the accepted answer. OP asked about <code>\\??` and not </code>\\\\?`</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">You're absolutely right. I wasn't able to delete my answer because it was already marked as accepted, but I edited it to reflect the correct answer.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have been searching for an answer to this question for a while and I know this question is years old but on the off chance someone else comes across this question I will leave my response here. </p>\n<p>The above answer is referring to non-canonicalized device paths where as you are asking about <code>\\??\\</code> not <code>\\\\?\\</code> there may only be a small difference in the question but the answer is completely different.</p>\n<p><code>\\??</code> is a \"fake\" prefix which refers to per-user Dos devices, so here is an image that will hopefully help you understand what the process is: <a href=\"https://i.sstatic.net/LOeeO.png\" rel=\"noreferrer\"><img alt=\"enter image description here\" src=\"https://i.sstatic.net/LOeeO.png\"/></a></p>\n<p>Some definitions that may help you understand:</p>\n<ul>\n<li>\\Device - Default location for kernel driver Device Objects </li>\n<li>\\GLOBAL?? - System location for symbolic links to devices including drive letters</li>\n<li>\\BaseNamedObjects - System location for named resources</li>\n<li>\\Sessions\\X - Directory for the login session X </li>\n<li>\\Session\\0\\DosDevices -\nDirectory for the “Dos Devices” for each logged in  user.</li>\n</ul>\n</div>",
            "votes": "14",
            "user": "woffles2.0",
            "time": "Apr 18, 2017 at 9:22",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jem Tucker",
                    "text": "<span class=\"comment-copy\">This should be accepted as the correct answer</span>",
                    "time": null
                },
                {
                    "user": "Paul",
                    "text": "<span class=\"comment-copy\">Why's the \"Blah\\..\\\" there in the orange box?</span>",
                    "time": null
                }
            ]
        }
    ]
}