{
    "title": "IDAPython on OSX",
    "link": "https://reverseengineering.stackexchange.com/questions/3931/idapython-on-osx",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I wrote a simple IDAPython script that relies on some non-standard Python library.  I'm able to build the library on Windows and run the script in IDA without issue.</p>\n<p>When I try to do this on OSX, IDA complains that the 3rd-party library doesn't exist.  I notice that from the shell on my Mac, the version of Python I'm using is 2.7.x, but IDA says the Python version its using is 2.6.x.</p>\n<p>Doing <code>sys.executable</code> in the IDA window and from my shell both seem to print <code>/usr/bin/python</code>.</p>\n<p>Where is this 2.6 python binary? Or, more importantly, how should I properly install this 3rd party library so that IDAPython can see it and use it?</p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "idapython"
    ],
    "user": "mrduclaw",
    "time": "Mar 21, 2014 at 18:52",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">Try <code>sys.path</code> instead.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've run into the same issue - everything worked fine on Windows, with oddness on OSX.</p>\n<p>As Igor mentions in the comment above, running sys.path in the IDA interpreter showed that although the default Python interpreter for the OS (<code>/usr/bin/python</code>) was 2.7, IDA is using python 2.6 (seems OSX has python 2.5 through 2.75 installed, because... reasons/masochism/other).</p>\n<p>Invoking the <code>pip</code> installer with Python-2.6, and afterwards running pip-2.6 to install your libraries should fix the issue, although it would be nice if IDA used the system default Python interpreter in this instance.</p>\n</div>",
            "votes": "4",
            "user": "perror",
            "time": "Apr 23, 2014 at 7:32",
            "is_accepted": false,
            "comments": []
        }
    ]
}