{
    "title": "How to break on not-yet-loaded kernel driver",
    "link": "https://reverseengineering.stackexchange.com/questions/3983/how-to-break-on-not-yet-loaded-kernel-driver",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've been reversing a sample of the Uroborus trojan for my own learning joy. I'm having a hard time following it once it loads a windows kernel driver that implements the rootkit.  I've set up my environment for Kernel debugging (using IDA's windbg plugin) and set a breakpoint for the new driver (it's called Fdisk.sys, so I've been typing \"bu fdisk.sys!DriverEntry\").  However, IDA never breaks when the driver is loaded. I can tell that it has run because it starts hiding a registry key (Ultra3), and dumping the memory and using Volatility to look at unloaded modules, I can see that fdisk.sys was unloaded.  I can also confirm that it's installed hooks into a number of kernel API's.  How do I get IDA/windbg to break on the driver before it gets to run? </p>\n</div>",
    "votes": "5",
    "answers": 3,
    "views": "3k",
    "tags": [
        "ida",
        "malware",
        "debugging",
        "kernel-mode"
    ],
    "user": "Andrew",
    "time": "Mar 28, 2014 at 13:53",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>For some reason I have yet to determine, every effort to set a breakpoint on this module by name (fdisk.sys) is failing.  The driver isn't loaded at bootup (at least, not at the point that I'm investigating right now).  It's loaded by a module and then unloaded again fairly soon thereafter. </p>\n<p>I finally used a debugger (indside my VM) to step through the module that launches the driver, stopped execution after the file was written to disk, and used a hex editor to change the first instruction to INT 3.  That worked; when the driver loads the exception is caught by the kernel debugger and I'm able to start reviewing.  <em>phew</em></p>\n<p>Now I gotta figure out why I couldn't get it break by name.....</p>\n</div>",
            "votes": "6",
            "user": "Andrew",
            "time": "Apr 7, 2014 at 14:16",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It may be late but:\nIf you use WinDBG(kd) to debug the kernel use</p>\n<pre><code>sxe -c \".echo fdisk loaded;\" ld:fdisk.sys\n</code></pre>\n<p>this is usable in user and kernel mode and cause the debugger break-in after module loaded and before entry-point.</p>\n</div>",
            "votes": "5",
            "user": "sealed...",
            "time": "May 11, 2014 at 3:48",
            "is_accepted": false,
            "comments": [
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">be aware sxe ld will only work for the first time load and not subsequnet loads of the same module take a look at the exchange between pavel and raj here for a partial workariund to sxe ld recurring breaks <a href=\"https://osronline.com/showthread.cfm?link=233022\" rel=\"nofollow noreferrer\">osronline.com/showthread.cfm?link=233022</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>For windbg take a look at my answer here</p>\n<p><a href=\"https://reverseengineering.stackexchange.com/questions/1380/how-can-you-reliably-unpack-a-windows-driver-manually/2638#2638\">How can you reliably unpack a Windows driver manually?</a></p>\n<p>if you are using virtual kd and vmware just run the script when virtual kd breaks for the first time after the connection </p>\n<p>it will simply print out all the driver details as and when they are loaded right from bootphase </p>\n<p>for other vms you need to set <code>sxe -ibp; and reboot</code> and run the script on Initial breakin</p>\n</div>",
            "votes": "4",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}