{
    "title": "Extracting data from a Program for external use",
    "link": "https://reverseengineering.stackexchange.com/questions/4062/extracting-data-from-a-program-for-external-use",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am looking at basically capturing VU Meter data from an audio recording program, preferably the highest resolution possible, and inputting that data into a circuit to power LED's, respectively.  I am hoping there is a way to \"harness\" this data from the audio program. I've attached a picture of what exactly these look like...</p>\n<p>Then, using a AD557 microprocessor (handles 8-bit digital input) can then output my required voltage to drive my external LED VU Meter circuit.</p>\n<p>This is the program I am using (Pro Tools) and the video gives you a visual idea as well.  <a href=\"https://www.youtube.com/watch?v=d5IUWJY9b0Q\" rel=\"nofollow noreferrer\">https://www.youtube.com/watch?v=d5IUWJY9b0Q</a></p>\n<p>As it stands, there are a few options for getting the metering data from this program. The first, using the HUI protocol via MIDI, does not provide the resolution I, or others are looking for to provide external metering. The second option, is a secure protocol (Eucon) that is only available for developers, and I cannot obtain this. None the less, this above information is not important.</p>\n<p>Since I am fairly new to programming, I am asking for help regarding the means to obtain this metering 'data' another way. How would I be able to obtain the raw data of these meters from the program? Is there a specific method I could try? I'm hoping someone could shoot out answers or a straight up resolution to how I could get this data. Hope this clarifies a little.</p>\n<p>Hope someone can help! Thank You!</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/4ocCk.png\"/> </p>\n</div>",
    "votes": "3",
    "answers": 2,
    "views": "309",
    "tags": [
        "debuggers"
    ],
    "user": "Scott K",
    "time": "Apr 13, 2014 at 2:54",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I think what you're after is developing a plugin for protools.  </p>\n<p>Check <a href=\"https://www.avid.com/us/partners/audio-plugin-dev-program\" rel=\"nofollow\">this</a> site out to get started.  I have no idea what \"Applying to be a plugin developer\" means in the world of ProTools, but the SDK that you'll get access to will likely answer most of your questions.  </p>\n<p>From a reverse engineering perspective, I'll add to @BraveNewCurrency 's answers and suggest finding out where ProTools stores the *.wav files for each of its tracks, and writing a DSP program to capture what you want.  You didn't specify whether or not the data had to be real-time, so this approach won't work if you need real-time.  </p>\n<p>Outside of this, BraveNewCurrency's first answer is the only other option I see.  Reverse-engineering ProTools will likely be quite difficult because there's usually a TON of piracy protection on flagship studio software... Don't know about ProTools, but Cubase has a hardware dongle and emulating that isn't trivial.  </p>\n<p>The problem to solve here is to be able to find where ProTools stores its audio-buffers at runtime and more or less be able to monitor the data.  OR if you can figure out what functions its using to access audio data, hook them perhaps by using <a href=\"http://research.microsoft.com/en-us/projects/detours/\" rel=\"nofollow\">Detours</a>.</p>\n</div>",
            "votes": "1",
            "user": "avgvstvs",
            "time": "Jun 2, 2014 at 14:20",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I don't have a real answer, I can think of two possible routes:</p>\n<ol>\n<li><p>Reverse engineer the Pro Tools program to find out where it draws the meters, and patch it to 'do something else' like send serial data to your Microcontroller.</p></li>\n<li><p>Total hack: Have a webcam look at your screen. Write a program in <a href=\"http://opencv.org/about.html\" rel=\"nofollow\">OpenCV</a> that parses the on-screen bargraph and turns it into numbers for your micro-controller.</p></li>\n</ol>\n<p>Depending on your priorities/skills, #2 may actually be simpler.</p>\n</div>",
            "votes": "1",
            "user": "perror",
            "time": "Jun 2, 2014 at 17:04",
            "is_accepted": false,
            "comments": []
        }
    ]
}