{
    "title": "PE file - data directory",
    "link": "https://reverseengineering.stackexchange.com/questions/4210/pe-file-data-directory",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you remove \"data directory\" from a \"PE file\" what will happen ?\nI think loader will give an error, but I'm not sure. Please try to correct me.</p>\n</div>",
    "votes": "2",
    "answers": 2,
    "views": "2k",
    "tags": [
        "pe"
    ],
    "user": "Javed Ahmed",
    "time": "Apr 30, 2014 at 4:29",
    "comments": [
        {
            "user": "SSpoke",
            "text": "<span class=\"comment-copy\">you mean <code>.data</code> and not directory you mean <code>Section</code> or <code>Segment</code> right? deleting it is pretty simple just get a PEditor by yoda and delete it, you won't be able to run the program it will just say <code>is not a valid Win32 application</code></span>",
            "time": null
        },
        {
            "user": "Javed Ahmed",
            "text": "<span class=\"comment-copy\">Thanks for the reply. But I'm talking about 16 data directories(128 bytes) in Optional header of a PE file. All other things like data section, section table and other section will be intact, but i'm just deleting the Data directories from PE optional header. So what will happen will loading this PE file ? Any help will be appreciated ..</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can't exactly \"delete\" this directory, however you can set the <code>NumberOfRvaAndSizes</code> field to 0 and then the system loader won't use the entries from it. From the <a href=\"http://www.phreedom.org/research/tinype/\" rel=\"nofollow\">TinyPE page</a>:</p>\n<blockquote>\n<p>The PE specification says that the number of data directories is\n  specified in the NumberOfRvaAndSizes header field and the size of the\n  PE optional header is variable. If we set NumberOfRvaAndSizes to 0 and\n  decrease SizeOfOptionalHeader, we can remove the data directories from\n  the file.</p>\n</blockquote>\n<p>However, the resulting file won't work in Windows 2000 \"<em>because the loader tries to call a function from KERNEL32, but KERNEL32.DLL is not loaded</em>\". So normally you should add at least an Import Table directory, which needs <code>NumberOfRvaAndSizes</code> to be at least 2. (You also need an import directory if you want your file to do anything useful, like call functions from other DLLs :)</p>\n</div>",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Apr 30, 2014 at 9:49",
            "is_accepted": false,
            "comments": [
                {
                    "user": "SerG",
                    "text": "<span class=\"comment-copy\">Why is \"at least 2\" for only an Import Table directory?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@SerG: because import directory is index #1</span>",
                    "time": null
                },
                {
                    "user": "clockw0rk",
                    "text": "<span class=\"comment-copy\">I'm sure you CAN delete this directory, after setting the NumberOfRvaAndSizes to 0, you cut the next 128 bytes and move every following byte to the left 128. Oh, and is Windows2000 still a thing?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I haven't done this since the early days of MSDOS filenames in 8.3 form.  If you edit the dard disc directory area with a hex editor and change the flag byte(s) which signify that a file is an extended directory then you can open that file as if it was a file.  I don't know what happens with later Ms DOSs, though.  Easy enough to test with WinHex, if you want.</p>\n</div>",
            "votes": "0",
            "user": "Paddywhacker",
            "time": "Apr 30, 2014 at 8:59",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">This is completely irrelevant to PE file format.</span>",
                    "time": null
                }
            ]
        }
    ]
}