{
    "title": "Why addresses of variable on stack are not consecutive?",
    "link": "https://reverseengineering.stackexchange.com/questions/4250/why-addresses-of-variable-on-stack-are-not-consecutive",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The code below is generated by gcc from a simple scanf program. \nMy question is that </p>\n<ol>\n<li>Why these 3 addresses of variables are not consecutive when allocated?</li>\n<li>If not, when could I speculate the number of variables generated from stack by watching the\nclause like <code>add esp, N</code> which is often at the end of a routine? Is it related with calling convention?</li>\n<li>In this example, why compiler does not generated the <code>add esp, 20h</code> with it?</li>\n</ol>\n<p>C code </p>\n<pre><code>#include &lt;stdio.h&gt;\nint main() {\n  int x;\n  printf (\"Enter X:\\n\");\n  scanf (\"%d\", &amp;x);\n  printf (\"You entered %d...\\n\", x);\n  return 0;\n};\n</code></pre>\n<p>asm</p>\n<pre><code>main            proc near\nvar_20          = dword ptr -20h\nvar_1C          = dword ptr -1Ch\nvar_4           = dword ptr -4\n                push    ebp\n                mov     ebp, esp\n                and     esp, 0FFFFFFF0h\n                sub     esp, 20h\n                mov     [esp+20h+var_20], offset aEnterX ; \"Enter X:\"\n                call    _puts\n                mov     eax, offset aD  ; \"%d\"\n                lea     edx, [esp+20h+var_4]\n                mov     [esp+20h+var_1C], edx\n                mov     [esp+20h+var_20], eax\n                call    ___isoc99_scanf\n                mov     edx, [esp+20h+var_4]\n                mov     eax, off set aYouEnteredD___ ; \"You entered %d...\\n\"\n                mov     [esp+20h+var_1C], edx\n                mov     [esp+20h+var_20], eax\n                call    _printf\n                mov     eax, 0\n                leave\n                retn\nmain            endp\n</code></pre>\n</div>",
    "votes": "4",
    "answers": 4,
    "views": "1k",
    "tags": [
        "disassembly",
        "assembly",
        "x86",
        "c"
    ],
    "user": "upton",
    "time": "May 3, 2014 at 17:43",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There is only actually one local variable in your function: x. This variable is located on the stack where you would expect it, at <code>ebp-4</code>. IDA is getting confused because this particular function, instead of pushing variables onto the stack before calling a function, is moving them instead. This tricks IDA into thinking those are local variables when they're actually just the locations at the top of the stack.</p>\n<pre><code>mov     [esp+20h+var_1C], edx  &lt;===&gt; push edx\nmov     [esp+20h+var_20], eax  &lt;===&gt; push eax\n</code></pre>\n<p>I can't definitively explain why gcc is doing this, but my guess is that you compiled without optimizations. This instruction layout might make debugging easier.</p>\n<p>I think you're also confusing calling conventions with local variable cleanup. Every function needs to clean up its own local variable area. Your main() function is doing that with the <a href=\"https://stackoverflow.com/questions/5474355/about-leave-in-x86-assembly\"><code>leave</code></a> instruction. Calling conventions are related to cleaning up the <strong>parameters</strong> passed to a function.</p>\n</div>",
            "votes": "5",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>there is no add esp ,20 because of the leave instruction (LEAVE PROCDURE ) instruction </p>\n<p>quoted ftom intel instruction manual</p>\n<pre><code>6.5.2 LEAVE Instruction\nThe LEAVE instruction, which does not have any operands, reverses the action of the previous ENTER instruction. \nThe LEAVE instruction copies the contents of the EBP register into the ESP register to release all stack space allocated to the procedure. Then it restores the old value ofthe EBP register from the stack. This simultaneously \nrestores the ESP register to its original value. A subsequent RET instruction then can remove any arguments and \nthe return address pushed on the stack by the calling program for use by the procedure.\n</code></pre>\n<p>as to the other part in your question i guess it is because the compiler didn't generate any push argument instruction it utilises the top part for moving the args into stack \nand bottom part for varargs storage </p>\n<pre><code>mov [esp],%d\nmov [esp+4] , ADDR where to store the input ie ADDR of [esp+1c]\n</code></pre>\n</div>",
            "votes": "3",
            "user": "blabb",
            "time": "May 3, 2014 at 17:44",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There's actually only one stack variable in this function: <code>var_4</code></p>\n<p>In the disassembly above, IDA incorrectly detects arguments passed to <code>_puts()</code>, <code>___isoc99_scanf()</code>, and <code>_printf()</code> as local stack variables. To see this, let's analyze the following snippet:</p>\n<pre><code>mov     [esp+20h+var_20], offset aEnterX ; \"Enter X:\"\ncall    _puts\n</code></pre>\n<p><code>var_20</code> is defined by IDA at the beginning of this function as <code>-20h</code>, so <code>mov [esp+20h+var_20], offset aEnterX</code> is effectively saying <code>mov [esp+20h+-20h], offset aEnterX</code>, which is the same as <strong><code>mov [esp], offset aEnterX</code></strong>. In other words, the code is just pushing <code>offset aEnterX</code> onto the stack before calling <code>_puts()</code>, and IDA is unfortunately detecting that \"alternative push\" as a local stack variable.</p>\n</div>",
            "votes": "3",
            "user": "Jason Geffner",
            "time": "May 3, 2014 at 17:48",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><sub>(I deal more with code generated by Visual C++, so some parts of this answer are just educated guesses.)</sub></p>\n<blockquote>\n<p>1.Why these 3 addresses of variables are not consecutive when allocated?</p>\n</blockquote>\n<p>Variable alignment and even <em>presence</em> on the stack is up to the compiler and can differ based on the specific compiler version you use, the optimization options being used, and other factors.</p>\n<p>The 3 variables in your example are not all \"real\" variables. <code>var_4</code> is the variable corresponding to your <code>x</code>, whereas <code>var_1C</code> and <code>var_20</code> are simply results of GCC's approach to passing arguments to deeper function calls. When you write <code>scanf(\"%d\", &amp;x);</code>, GCC knows that it will need to pass two 4-byte variables to that function on the stack, so it pre-emptively reserves enough room for them upon entering the function. This way, it doesn't need to <code>push</code> anything onto the stack (which might be problematic if there's no stack space left...), it just needs to <code>mov</code> the arguments into that preallocated space.</p>\n<p>That doesn't explain why there's a gap between the two allocations, though. GCC also prefers to align stack allocations to 16 bytes<sup>1</sup>, and <sub>this is where I am guessing</sub> it seems that the sizes needed for \"real local variables\" and \"space reserved for deeper function arguments\" are aligned independently before being summed into the final value of \"reserved stack space\".</p>\n<p><sup>1</sup>You can control this alignment by using <a href=\"http://gcc.gnu.org/onlinedocs/gcc-3.2/gcc/i386-and-x86-64-Options.html\" rel=\"nofollow noreferrer\"><code>-mpreferred-stack-boundary=num</code></a>.</p>\n<blockquote>\n<p>2.If not, when could I speculate the number of variables generated from stack by watching the clause like <code>add esp, N</code> which is often at the end of a routine? Is it related with calling convention?</p>\n</blockquote>\n<p>As you can see in this example, that instruction does not always get generated. Its counterpart, <code>sub esp, N</code>, is a much better indicator. From that you can make educated guesses about the amount/sizes of local variables.</p>\n<p>Calling convention is not related to a function's local variables, it controls the way the arguments are passed <em>into</em> the function and whose responsibility it is to clean them up afterwards.</p>\n<blockquote>\n<p>3.In this example, why compiler does not generated the <code>add esp, 20h</code> with it?</p>\n</blockquote>\n<p>The function in your example begins with <code>push ebp; mov ebp, esp</code>, which saves the original values of both <code>ebp</code> and <code>esp</code>. The <code>leave</code> instruction at the end does the reverse - it restores the saved values of <code>esp</code> and <code>ebp</code>, so there's no need to calculate anything.</p>\n<p>The saved <code>ebp</code> is also known as a <a href=\"https://stackoverflow.com/questions/579262/what-is-the-purpose-of-the-frame-pointer\"><em>frame pointer</em></a>. It is possible to instruct the compiler <em>not</em> to generate it, in which case the original value of <code>esp</code> needs to be restored using that calculation you mentioned.</p>\n</div>",
            "votes": "2",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}