{
    "title": "What skills, other than practice, should I acquire to be good at reverse engineering softwares?",
    "link": "https://reverseengineering.stackexchange.com/questions/4266/what-skills-other-than-practice-should-i-acquire-to-be-good-at-reverse-enginee",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>What would help me to be improve my self, What subjects should I study and learn from which increase my ability to be be better at reverse engineering a software ? i.e: Calculus, Integration ?</p>\n</div>",
    "votes": "7",
    "answers": 2,
    "views": "3k",
    "tags": [
        "software-security"
    ],
    "user": null,
    "time": "May 4, 2014 at 20:32",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">There's a new book on practical reverse engineering (Bruce Dang et al), it lists some of the stuff. Other than that this is pretty opinion-based indeed (not really suitable for Q&amp;A).</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Such questions rarely have straightforward answers but I'll try to point you on <strong>a</strong> right path.</p>\n<p>Firstly, <strong>Build a toolbox</strong> : gather as much tools as you can &amp; start playing. Then, master the ones which you find useful or develop your own when you can do better. By tools, I mean <em>disassemblers</em>, <em>hexeditors</em>, <em>decompilers</em>, <em>debuggers</em>, <em>automation scripts</em>, ...</p>\n<p>Secondly, <strong>Be methodical</strong> : with experience &amp; practice you'll be able to come up with a set of steps to follow when reversing. These steps will certainly have to be updated with more experience but they'll surely help you find valuable information &amp; data about your target.</p>\n<p>Thirdly, <strong>Never blindly trust your tools</strong> or <strong>Know your tools</strong> : always cross-reference the outputs of different tools (use multiple disassemblers, ...). Most tools have strengths and weaknesses and you must know them in order to understand what you're looking at. For example, <code>objdump</code> (the <code>binutils</code> disassembler) performs <code>linear sweep</code>, a technique which can easily be fooled by misalignments and mixing data with instructions. A wise reverser would use another disassembler which implements another disassembly algorithm (IDAPro, r2 - radare, ...) and compare the results.</p>\n<p>Fourthly, <strong>RTFM</strong> : documentation will in most, if not all, cases be your best friend. Any documentation related to the architecture, the tools you're using, the target application, the programming language, the compiler, ... is a gold mine. It will help you understand how all the machinery manages to function. You'll have to educate yourself in compilation (use &amp; study different compilers : <strong>GNU's</strong> <code>gcc</code>, <strong>Intel's</strong> <code>icc</code>, <strong>PGI's</strong> <code>pgcc</code>, <strong>CAPS</strong> compilers suite, <strong>IBM's</strong> <code>xlc</code>, ...), static &amp; dynamic linking, object file formats (ELF32, ELF64, PE, COFF, Macho, ...), calling conventions and ABIs, compiler optimizations, link time optimizations, code morphing, cryptography, ... to know how the application was built, obfuscated, and secured. All that, in order to find an exploitable weak spot in the chain. I would also recommend you following the scientific work conducted in all those areas, especially obfuscation, static &amp; dynamic analysis, instrumentation, binary code patching, disassembly, ... The field of binary code analysis is still at its infancy, and every now and then researchers come up with great techniques and algorithms which end up implemented in many industrial products.</p>\n<p>Fifthly, <strong>Be sharp</strong> : there's no such thing as garbage. As Lavoisier once said : \"Rien ne se perd, rien ne se crée, tout se transforme.\" (\"Nothing is lost, nothing is created, everything is transformed.\"). Keep in mind that any piece of valuable information can help. It can be poetry, calculus, physics, Boolean algebra, ... you never know what you'll stumble upon. A successful reverse engineer is an educated one !   </p>\n<p>Finally, <strong>Develop top programming skills :</strong> : learn as many programming languages as you can : assembly (<code>x86</code>, <code>ARM</code>, <code>6502</code>, ...), <code>C</code>, <code>C++</code>, <code>Python</code>, <code>Haskell</code>, ... and learn how to extract code patterns from low level constructs - this is just a matter of experience &amp; sharpness. Each language is designed on top of a set of paradigms : <code>Functional programming</code>, <code>OOP</code>, ... Knowing those paradigms helps a lot when analyzing code.</p>\n<p>I do not think there's enough space for me to cover everything but I hope this will help you narrow your search &amp; find useful documentation, tutorials, ... on the web.</p>\n</div>",
            "votes": "13",
            "user": "yaspr",
            "time": "May 5, 2014 at 6:08",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">+1 for bolding <b>RTFM</b>. \"Executable file formats\", for example, is a never-ending study story.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There's always some special kind of software that requires specific mathematical skills. For example, if you want to reverse some malware that encrypts files, skills in cryptography will help you identify algorithms. Or, if you want to reverse some software that calculates, say, antennas, knowing equations from radio engineering will help you.</p>\n<p>But, to improve your skills in reversing \"general\" software, the best you can do is learn several assembly languages, i'd recommend at least intel (32 bit and 64 bit), and arm instruction sets, registers, and flags. Also, get at least some theoretical knowledge about compilers, how they work, and which approaches to compiler optimizations there are.</p>\n<p>Write small (C) programs, compile them to assembler, use different optimization flags, and learn how the compiler translates them into assembler code. Learn about the various ways to arrange the stack, so you'll recognize patterns when you see compiled assembly code.  </p>\n<p>While, in some cases, you'll encounter hand-crafted assembly, most of what you're going to reverse in \"real life\" will be compiled in some way or other, and in most cases, it'll be C or C++ that gets compiled. (C# and Java as well, but these are special cases, because decompilation is easy with those except if obfuscated). See this question <a href=\"https://reverseengineering.stackexchange.com/questions/4213/is-there-a-way-to-adjust-local-variables-when-a-function-doesnt-utilize-ebp\">Is there a way to adjust local variables when a function doesn't utilize ebp?</a>, or this <a href=\"https://reverseengineering.stackexchange.com/questions/4189/can-someone-tell-me-what-this-memcpy-or-maybe-its-a-memset-looks-like-a-memset\">Can someone tell me what this memcpy or maybe it's a memset? looks like a memset, rep movsd and rep movsb This is a packet sending function</a> - both are easy to solve if you just know how compilers work, and if you've compared respective assembly/C code.</p>\n<p>Apart from that, as you already said, lots of experience, in reversing AND in programming. Theres's lots of algorithms that are quite hard to understand when you just see the implementations - a few weeks ago, i came across a function that had lots of ifs and variable swapping that i wasn't able to make any sense of, until i suddenly realized that i used exactly the same stuff some 10 years ago when i once implemented <a href=\"http://en.wikipedia.org/wiki/Bresenham%27s_line_algorithm\" rel=\"nofollow noreferrer\">Bresenham's algorithm</a>. This is the kind of stuff you can't really learn - a lot of the \"magical\" realizations of experienced reversers is not magic, they're just good memory. </p>\n</div>",
            "votes": "7",
            "user": "2 revsGuntram Blohm",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}