{
    "title": "How to reuse symbol/data defined in .bss section?",
    "link": "https://reverseengineering.stackexchange.com/questions/4306/how-to-reuse-symbol-data-defined-in-bss-section",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>So basically I am trying to re-use some assembly code/data dumped by <code>objdump</code> from 32 bit ELF binary on Linux.</p>\n<p>So basically, in the disassembled binary, I found some symbol referring to <code>.bss</code> section like this:</p>\n<pre><code> 80486b7:   mov    0x804b264,%eax   &lt;- 0x804b264 is an addr in .bss\n 80486bc:   movl   $0x0,0x4(%esp)\n 80486c3:\n 80486c4:   mov    %eax,(%esp)\n 80486c7:   call   804876c &lt;sum&gt;\n</code></pre>\n<p>By digging into the original source code, I find out that <code>0x804b264</code> is used for <code>stdin</code> in <code>.bss</code> section.</p>\n<p>IMHO, there are basically two situations on <code>.bss</code> section's data:</p>\n<ol>\n<li><p>uninitialized data, will be uninitialized in the source code</p></li>\n<li><p>some global/system related data (such as <strong>stdin</strong> in the above situation)</p></li>\n</ol>\n<p>So when trying to re-use <code>.bss</code> section's data, I have tried this way:</p>\n<pre><code>.section .bss\nS_0x804B260 : .byte 0x00\n           .byte 0x00\n           .byte 0x00\n          .byte 0x00\nS_0x804B264 : .byte 0x00          &lt;- I lift addr into symbol!\n          .byte 0x00\n         .byte 0x00\n         .byte 0x00\n         .byte 0x00\n</code></pre>\n<p>and in the <code>.text</code> section, I will also lift corresponding addr into symbol.</p>\n<p><strong>same situation works fine for <code>.rodata</code> and <code>.data</code> section</strong></p>\n<p>But the problem is that, there are some global variables (such as <strong>stdin</strong> <strong>stdout</strong>), locating in <code>.bss</code> section, while are not initialized by <strong>user defined code</strong>, which means that in my re-used asm code, this symbol variable will always be <strong>zero</strong>!</p>\n<p>I tried to manually substitute symbols corresponding to <strong>stdin</strong>, and it seems that it works fine.</p>\n<p>But the problem is that:</p>\n<ol>\n<li><p>How can I identify which symbol in the <code>.bss</code> section is some variables that initialized by system? such as <strong>stdin</strong>, <em>stdout*</em> and others?</p></li>\n<li><p>If it is not possible, then is there anyway that I can enforce system to use memory in the <code>.bss</code> section where I want it to use?</p></li>\n</ol>\n<p>Am I clear? Could anyone give me some help?</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "824",
    "tags": [
        "disassembly",
        "assembly",
        "elf",
        "reassembly"
    ],
    "user": "lllllllllllll",
    "time": "May 10, 2014 at 16:24",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm afraid you're not too clear when you talk about \"reusing\" some part of a program. What exactly do you want to do? Load the original program into a debugger, then call just one single function of it? Extract a ranged of addresses and turn that into a new program? Or extract one function from the original program, possibly together with everything the function depends on, then embed that function into a larger program?</p>\n<p>You're wrong in one thing: the .bss section is NOT initialized at all at program start (at least not to anything but a load of <code>\\0</code> bytes). The initialization of stuff like <code>stdout</code> is done in runtime before main() starts. Stuff that gets initialized with constant data goes into the .data segment.</p>\n<p>(On a side note: One of the reasons why the stdout FILE structure isn't put into .data and initialized as constants is most runtimes on unix-like systems will check if their file descriptor goes to a terminal or something else, and turn on/off buffering depending on that check).</p>\n<p>When you extract a part of the code, you'll have to check each reference to .data AND .bss (and to .text - the code - as well if the extracted part depends on any libraries etc.). For each of those references, you'll have to decide what to do with them - share them with the new program, keep them for the functions you extracted, whatever.</p>\n<p>If you're lucky, and have an unstripped executable, you can use <code>nm</code> to find out which symbol is where; if you're not that lucky, you'll have to disassemble/decompile everything, understand it, rewrite it into new source, and compile it together with whatever you want to embed it in.</p>\n</div>",
            "votes": "2",
            "user": "Guntram Blohm",
            "time": "May 10, 2014 at 18:18",
            "is_accepted": true,
            "comments": []
        }
    ]
}