{
    "title": "IDA - save work on kernel mode debugging",
    "link": "https://reverseengineering.stackexchange.com/questions/4337/ida-save-work-on-kernel-mode-debugging",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm working with IDA pro on a kernel mode function (VMware + windbg) and I'm a annoying because I can't save the workstation state. IDA crash after 3 hours when I \"quit and save memory status\".\nIs there a plugin or anything else that could make me able to save my work (variables rename, commentaries and  others) ?\nThanks for reading (and answers =)</p>\n</div>",
    "votes": "3",
    "answers": 2,
    "views": "888",
    "tags": [
        "ida",
        "dynamic-analysis",
        "kernel-mode"
    ],
    "user": "user4559",
    "time": "May 15, 2014 at 7:51",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Did you try debug IDA?  You may save your work via IDA <a href=\"http://www.hexblog.com/?p=415\" rel=\"nofollow\">snapshot</a> feature.</p>\n</div>",
            "votes": "3",
            "user": "DOD",
            "time": "May 19, 2014 at 6:21",
            "is_accepted": true,
            "comments": [
                {
                    "user": "DOD",
                    "text": "<span class=\"comment-copy\">I don't understand you (oh, my bad English). Did you try simple dump IDA db to IDC file?? (File-&gt;Produce file-&gt;\"Dump data base to IDC file\")</span>",
                    "time": null
                },
                {
                    "user": "user4559",
                    "text": "<span class=\"comment-copy\">sorry wrong send, here is the full comment : Hi, thanks for your answer ! I tried with the snapshot functionality but an initial database is requiered.  In order :    - I start my virual machine   - I attach IDA with winDBG to start kernel mode debbugging   - I place comments and wanna save them for next session My problem is that I only have a temporary database and I can't save it because it's only a live work session.  Any idea how to solve that ?</span>",
                    "time": null
                },
                {
                    "user": "user4559",
                    "text": "<span class=\"comment-copy\">(I'm probably hard to read, I'm french and my english is not awesome !) I never used IDC file, and I don't understand how it works for loading them. In my last message I mean that I try to save a live analysis state. So I probably need to save all the memory state of my current virtual machine if I wanna keep my comments and modifications. Is this message more clear ?</span>",
                    "time": null
                },
                {
                    "user": "DOD",
                    "text": "<span class=\"comment-copy\">I'm never had some problem. I do understand you. Sorry but I'm thinking what I can't help you. Did you try read [this]?(<a href=\"http://www.hexblog.com/?p=92\" rel=\"nofollow noreferrer\">hexblog.com/?p=92</a>).  What version of IDA are you using?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I solved my problem with IDC files and VM snapshot =)\nI'm on IDA 6.4 and the snapshot function doesn't work in live debugging. \nMy solution is to take a snapshot of my virtual machine (on VMware workstation) to have everytime the same kernel state. When I wanna reload my work, I begin to load the virtual machine snapshot then I attach IDA to my virtual machine with windbg and finally I can load my IDC file using the script file option.</p>\n<p>Thank you very much for you answer, it really was helpful !</p>\n</div>",
            "votes": "0",
            "user": "user4559",
            "time": "May 24, 2014 at 14:05",
            "is_accepted": false,
            "comments": []
        }
    ]
}