{
    "title": "Setting an USB Emulation and Fuzzing Platform?",
    "link": "https://reverseengineering.stackexchange.com/questions/4536/setting-an-usb-emulation-and-fuzzing-platform",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I would like to analyze (and fuzz) a USB device and I need a bit of guidance to setup a full platform to discuss with the device.</p>\n<p>First, I would like to know what are the most used hardware cards to emulate and perform fuzzing on USB devices. I've heard about the <a href=\"http://goodfet.sourceforge.net/hardware/facedancer11/\">FaceDancer11 card</a> with a Python API (see a few  blog posts [<a href=\"http://travisgoodspeed.blogspot.fr/2012/07/emulating-usb-devices-with-python.html\">1</a>,<a href=\"http://travisgoodspeed.blogspot.fr/2012/10/emulating-usb-dfu-to-capture-firmware.html\">2</a>] from <a href=\"http://travisgoodspeed.blogspot.fr/\">Travis Goodspeed</a>). But, are they others ?</p>\n<p>Also, if someone could come with a list of the needed hardware devices and, maybe, some existing Python libraries that are useful to have and, what development effort is needed to setup such a platform, it would be helpful.</p>\n</div>",
    "votes": "9",
    "answers": 2,
    "views": "1k",
    "tags": [
        "hardware",
        "fuzzing",
        "usb"
    ],
    "user": "perror",
    "time": "Jun 5, 2014 at 8:03",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Apart from the <code>FaceDancer</code> from Goodspeed, I have never been able to find anything similar. I personally use the <code>FaceDancer[11 &amp; 21]</code> and now I built my own emulator (not that easy if your electronics skills are rusty). But depending on the kind of analysis you want to perform you could find different other types of hardware, or software for that matter. </p>\n<p>For sniffing I suppose <a href=\"http://openvizsla.org/\" rel=\"nofollow\"><code>OpenVizsla</code></a> is a great tool (Free &amp; Open). Thought it is not available for sale yet, you can implement it yourself on an <code>FPGA</code> &amp; try it. You also have the <a href=\"http://www.adafruit.com/products/708\" rel=\"nofollow\">Beagle</a> from Total Phase which is quite expensive thought.</p>\n</div>",
            "votes": "2",
            "user": "yaspr",
            "time": "Jun 5, 2014 at 9:47",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Page 4 of <a href=\"https://www.nccgroup.com/media/190706/usb_driver_vulnerabilities_whitepaper_january_2013.pdf\" rel=\"nofollow\">https://www.nccgroup.com/media/190706/usb_driver_vulnerabilities_whitepaper_january_2013.pdf</a> gives a good introduction to setting up a USB-fuzzing test platform.</p>\n<blockquote>\n<p>Testing USB drivers on host machines is not a straightforward process,\n  because you either need to emulate a USB device or proxy the traffic\n  between a device and the host. As a result of how the protocol works\n  it would be extremely difficult to convert a USB host e.g. a PC into a\n  USB device and therefore, if you are not modifying the traffic\n  en-route via some kind of hooking or proxy solution, you need to use a\n  hardware-based approach. This section details the various different\n  approaches to testing USB hosts and compares the relative merits of\n  each...</p>\n</blockquote>\n</div>",
            "votes": "2",
            "user": "Jason Geffner",
            "time": "Jun 5, 2014 at 13:44",
            "is_accepted": false,
            "comments": []
        }
    ]
}