{
    "title": "Would OllyDbg help recognizing the passed parameters between the caller and the calle?",
    "link": "https://reverseengineering.stackexchange.com/questions/4720/would-ollydbg-help-recognizing-the-passed-parameters-between-the-caller-and-the",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The calling convention used in assembly differs depending to the compiler, so I need to know \nHow ollydbg2.01 would help me to recognize the parameters passed from caller to the callee and the values returned back from the callee to the caller for a CALL instruction.\nThe assembly which I am working on is compiled by Microsoft visual C++.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ollydbg"
    ],
    "user": "was.chm",
    "time": "Jun 27, 2014 at 7:36",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Ollydbg already shows the parameters passed to a functions in the CPU window. This of course works for standard functions such as <code>printf</code> , <code>CreateFileA</code> which Ollydbg knows about. For example see the image below. The parameters to <code>CreateWindowExA</code> are shown.</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/XeAoA.png\"/></p>\n<p>Now the return value of a function is <em>usually</em> kept in register <code>eax</code> in <code>x86</code>. So just note the value after the function returns. Of course in case of a hand-coded assembly the return value may be anywhere.</p>\n</div>",
            "votes": "2",
            "user": "0xec",
            "time": "Jun 27, 2014 at 8:18",
            "is_accepted": true,
            "comments": [
                {
                    "user": "was.chm",
                    "text": "<span class=\"comment-copy\">But in general case like CALL 0049E6D0, Dose OllyDbg help recognizing passed parameters and returned values between caller and callee parts of assembly?</span>",
                    "time": null
                },
                {
                    "user": "0xec",
                    "text": "<span class=\"comment-copy\">@user3778418 In a general case <code>ollydbg</code> cannot guess the number &amp; types of parameters passed to a function. You need some other program for that like <code>IDA</code> which have better analysis capabilities.</span>",
                    "time": null
                }
            ]
        }
    ]
}