{
    "title": "Legality of Decompilation [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/4744/legality-of-decompilation",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<div>\n<aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n<div class=\"d-flex fd-column fw-nowrap\">\n<div class=\"d-flex fw-nowrap\">\n<div class=\"flex--item wmn0 fl1 lh-lg\">\n<div class=\"flex--item fl1 lh-lg\">\n<div>\n<b>This question already has answers here</b>:\n                                \n                            </div>\n</div>\n</div>\n</div>\n<div class=\"flex--item mb0 mt4\">\n<a dir=\"ltr\" href=\"/questions/60/is-reverse-engineering-and-using-parts-of-a-closed-source-application-legal\">Is reverse engineering and using parts of a closed source application legal?</a>\n<span class=\"question-originals-answer-count\">\n                                (4 answers)\n                            </span>\n</div>\n<div class=\"flex--item mb0 mt8\">Closed <span class=\"relativetime\" title=\"2014-07-02 13:55:35Z\">10 years ago</span>.</div>\n</div>\n</aside>\n</div>\n<p>How \"legal\" is it to read and edit .exe files, .dll files, and other compiled source files? Decompilation is taking the compiled code of a program, often minified and obfuscated, and trying to get the original source code back as it was written, or at least get it in a form a person could read. There are various reasons a person or company would make its code harder to read while compiling it, but the 2 I've seen most often have to do with saving resources, like space, RAM, power, etc., and making it so the code is harder to read so the user can not see what it does as easily. As we are a community about questioning the practices of reverse engineering, I think it's safe to say most of us don't like the second reason. I am asking for facts here, though, not opinions.</p>\n<p>Because this question could get very broad, I will limit this to laws in particular countries and rules of various influential or popular companies, but info about generalities is also welcome. I am definitely not asking about morals/ethics, although I know those will certainly come up.</p>\n<p>There was already <a href=\"https://reverseengineering.stackexchange.com/questions/60/is-reverse-engineering-and-using-parts-of-a-closed-source-application-legal\">a question about the legality of reverse engineering in general</a>, but I'm talking only about decompilation here. As the answers to this question stated, decompilation is one type of reverse engineering. As far as I could tell, the other question didn't get answers about decompilation specifically, though you are free to provide these yourself. One answer did say the question was too broad, but perhaps this question will have a better scope.</p>\n</div>",
    "votes": "2",
    "answers": 2,
    "views": "13k",
    "tags": [
        "decompilation",
        "law"
    ],
    "user": "trysis",
    "time": "10 years ago",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">So reverse code engineering (RCE) is not a superset of decompilation then?</span>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">I would take any answers to your question on this site with a grain of salt. If you have legal questions, you should be talking with lawyers, not with reverse engineers.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@trysis: well this is not a forum, but a Q&amp;A site, so discussion is actually not encouraged.</span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">@trysis: that depends on the context. So a cautious \"ynos\" to that question. Most of these questions suck because they are either US-centric or otherwise make assumptions, and so do most of the answers - and many not even explicitly. And in the worst case it morphs into a discussion and becomes opinion-based. And yes, those should <b>definitely</b> be closed. And even if we'd have an answer for each individual jurisdiction, what about an international team (or company)?</span>",
            "time": null
        },
        {
            "user": "Franck Dernoncourt",
            "text": "<span class=\"comment-copy\">You might be interested in this <a href=\"http://area51.stackexchange.com/proposals/67858/law?referrer=VbiBXJnq7T0Ioi5i8nXuKg2\">Law Stack Exchange proposal</a>  which is now in commitment phase.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Legality of decompilation depends on the <code>EULA</code> (End User License Agreement) of the binary you wish to work with. While Open Source License Agreements like <code>GPL</code> may allow to edit/decompile the binary, other closed source proprietary agreements will prevent you in most cases.</p>\n<p>That being said decompiling is always legal to somewhat a limited extend according to copyright laws of Europe and the US.</p>\n<p>More information on this topic here\n<br/><a href=\"https://uk.answers.yahoo.com/question/index?qid=20111105222757AAGuJvd\" rel=\"nofollow noreferrer\">https://uk.answers.yahoo.com/question/index?qid=20111105222757AAGuJvd</a>\n<br/><a href=\"http://en.wikipedia.org/wiki/Decompiler#Legality\" rel=\"nofollow noreferrer\">http://en.wikipedia.org/wiki/Decompiler#Legality</a>\n<br/><a href=\"https://security.stackexchange.com/questions/30359/is-decompiling-software-considered-unethical-or-illegal\">https://security.stackexchange.com/questions/30359/is-decompiling-software-considered-unethical-or-illegal</a></p>\n</div>",
            "votes": "3",
            "user": "Community",
            "time": "Mar 17, 2017 at 13:14",
            "is_accepted": true,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">So what do you do in legislation where it's fully legal to decompile (reverse engineer) something for the purpose of interoperability? Which ranks higher: law or EULA?</span>",
                    "time": null
                },
                {
                    "user": "0xec",
                    "text": "<span class=\"comment-copy\">@0xC0000022L It's always legal to decompile for the purposes of interoperability. The DMCA allows it for Security Testing, Evaluation and Reverse Engineering. If someone releases a closed source malware (which obviously applies to all), AV companies would definitely RE &amp; decompile it. They cannot be held guilty by the law.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">so the DMCA affects me in what way? The point is legislation differs based on location and time and so does the content of your answer.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In Australia, you need to have a valid license for the software and be reversing for \"compatibility\" purposes. Which is pretty wide and includes investigating a security issue. Obviously if the code is available from the vendor, you need to get hold of that source code instead of reversing.</p>\n</div>",
            "votes": "3",
            "user": "Vitaly Osipov",
            "time": "Jul 1, 2014 at 5:43",
            "is_accepted": false,
            "comments": []
        }
    ]
}