{
    "title": "compiled binary - what do disassembled instructions correspond to in C/C++ source (Linux GCC)",
    "link": "https://reverseengineering.stackexchange.com/questions/4801/compiled-binary-what-do-disassembled-instructions-correspond-to-in-c-c-sourc",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>sorry about the messy title! Basically here's what I want to know. </p>\n<p>This might sound a bit silly but, if you have a disassembled instruction say:</p>\n<pre><code>jz 0x8048e1a\n</code></pre>\n<p>and you also have the source code, how do you go about figuring out what this instruction relates to in the source code? </p>\n<p>I should probably mention that I am using Intel's PIN as the application that spits out these disassembled instructions, so I know which function/routine these instructions belong to, I just want to be a bit more precise. </p>\n<p>Thanks for any help/hints. </p>\n</div>",
    "votes": "4",
    "answers": 3,
    "views": "2k",
    "tags": [
        "c++",
        "c",
        "disassembly"
    ],
    "user": "Faheem",
    "time": "Jul 2, 2014 at 14:57",
    "comments": [
        {
            "user": "ajp15243",
            "text": "<span class=\"comment-copy\">Do you want to know where <code>jz</code> or some other specific assembly instruction comes from (a specific question), or do you want to know general methodologies on how to go about reverse-engineering assembly code to match against source code (a general question, probably too broad for SO/SE)?</span>",
            "time": null
        },
        {
            "user": "Faheem",
            "text": "<span class=\"comment-copy\">Well, basically I have an application that spits out a dissembled instruction and now I have to go find what it corresponds to in the source code. The disassembled instruction that is spat out, is usually a jump instruction.</span>",
            "time": null
        },
        {
            "user": "PlasmaHH",
            "text": "<span class=\"comment-copy\">@Achilles: impossible. there is no 1 on 1 mapping. multiple source code lines can end up in one asm insruction, as well as the other way round or mixed.</span>",
            "time": null
        },
        {
            "user": "Faheem",
            "text": "<span class=\"comment-copy\">@PlasmaHH : Is there any possibility to at least figure out the Basic block that the instruction comes from?</span>",
            "time": null
        },
        {
            "user": "Hans Passant",
            "text": "<span class=\"comment-copy\">You cannot reasonable go from machine code back to source code.  Particularly the optimizer makes a big olde mess of it.  The other way around is feasible, ask your compiler to generate an assembly listing.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you have the source code (and the means to compile it), you shouldn't be using a decompiler. The compiler is <em>already</em> producing a mapping between the original source code and the assembly instructions; that's what debugging information <em>is</em>.</p>\n<p>The easiest way to see it in action is to start the program in the debugger, set a breakpoint, and when that breakpoint hits, switch to the disassembly view. That'll show you the instructions, as well as the source lines which led to them. (If the compiler had optimizations enabled there won't always be a good correspondence between the two, but you can at least see the rudiments.)</p>\n<p>You can also tell your compiler to stop after the code generation phase, and output an assembly file instead of object code. Depending on the compiler, you may also be able to get it to annotate the assembly with the source lines; this'll produce similar information to what you can see in the debugger's disassembly view.</p>\n<p>The details of how you do all that depend entirely on your IDE. Read its documentation.</p>\n</div>",
            "votes": "3",
            "user": null,
            "time": "Jul 2, 2014 at 15:32",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you're using the GCC toolchain, you can use objdump to disassemble and mix with source code:</p>\n<pre><code>objdump -S executable &gt; disasm.txt\n</code></pre>\n<p>See the objdump man pages for more options and information.</p>\n<p>If you're using a different toolchain, see the docs for that toolchain.</p>\n</div>",
            "votes": "3",
            "user": null,
            "time": "Jul 2, 2014 at 15:44",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<h2>For that <em>specific</em> instruction:</h2>\n<pre><code>jz 0x8048e1a\n</code></pre>\n<ul>\n<li>it's a conditional jump, so search your function for an <code>if</code>, <code>for</code>, <code>do</code>/<code>while</code> or ternary expression (<code>?:</code>)</li>\n<li>it jumps if the zero flag is set, but you'll need to check the previous instruction(s) to see what sets that flag. You may be able to line that logic up with one of the branch conditions you identified above</li>\n<li>it jumps to an address - where is it? What does the code at that address do? You may be able to match that up with the contents of a conditional branch.</li>\n<li>what happens if it <em>doesn't</em> branch? You may be able to line <em>that</em> up with a conditional branch (or the implicit jump of a branch not taken)</li>\n<li>note that the compiler/optimizer are allowed to reverse the sense of comparisons and branches, for example to jump to a nested block, and then back</li>\n</ul>\n<h2>In general:</h2>\n<ul>\n<li>if you have the source, compile to assembler and include all the source and line number annotations your compiler supports\n<ul>\n<li>it may help to do this once with optimization disabled, so you get a fairly clean translation, and then compare this to the optimized version. The intermediate step can help clarify what your optimizer changed.</li>\n</ul></li>\n<li>if you have the source but can't compile (or don't know the compile flags used), include all the source etc. annotations your disassembler supports instead</li>\n<li>look for distinctive points in the code:\n<ul>\n<li>function entry and exit are easy to spot</li>\n<li>calls to out-of-line (especially libc or other library) functions should show up cleanly, and limit the optimizer's ability to reorder at least the function's arguments, and logic dependent on its result</li>\n</ul></li>\n<li>instruction-step through the code in a debugger, watching <em>both</em> the source line number and the instruction. The line number may jump around crazily if the optimizer has been busy, but it'll give you an idea how the two relate</li>\n<li>just <em>read</em> the source and understand its logic and control flow. Then just <em>read</em> the assembly and understand <em>it's</em> logic and control flow. Then think about how they match up.</li>\n</ul>\n</div>",
            "votes": "3",
            "user": "Useless",
            "time": "Jul 2, 2014 at 16:01",
            "is_accepted": false,
            "comments": []
        }
    ]
}