{
    "title": "Understanding segment prefixes in assembly for Linux",
    "link": "https://reverseengineering.stackexchange.com/questions/5832/understanding-segment-prefixes-in-assembly-for-linux",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In looking at some assembly, I have come across a few instructions using segment prefixes. For example</p>\n<pre><code>&lt;address&gt;: ....  mov eax,DWORD PTR gs:0x20\n</code></pre>\n<p>I understand the basics of memory segments, but how could I get the 'absolute' memory address (particularly in GDB) of the data being accessed here? For example, I may want to break on further access, or examine the memory in that area.</p>\n<p>Edit: I know how to get the value of <code>$gs</code>, but not sure how to use that information with the given instruction to get the actual address of memory. And yes, this is under Linux.</p>\n</div>",
    "votes": "9",
    "answers": 1,
    "views": "950",
    "tags": [
        "disassembly",
        "linux",
        "gdb"
    ],
    "user": "HenryC",
    "time": "Jul 11, 2014 at 18:28",
    "comments": [
        {
            "user": "perror",
            "text": "<span class=\"comment-copy\">You should specify what operating system you are targeting because the usage of these register is OS dependent (though I suppose this is a Unix-based system because you refer to GDB).</span>",
            "time": null
        },
        {
            "user": "Simeon Pilgrim",
            "text": "<span class=\"comment-copy\">Are you ask how you get the value of GS or how to use that value to make absolute address?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>On Linux, in protected mode, the segment registers aren't standard \"segments\" anymore, instead, they're called selectors, and include information if the segment is readable/writable/executable. The real address they're pointing to is \"hidden\" in a table in the kernel and the segment register is used as an index into that table, but the physical address shouldn't matter to you much anyway, since your application deals with virtual memory only, and the virtual address that gs maps to isn't even accessible in your \"normal\", ds/ss-referenced, virtual address space.</p>\n<p>Linux uses the gs register to make some per-cpu-information available to the process. The special offset 0x20, which you're using in your example, is initialized to some random value, which the compiler reads whenever it enters a function and writes on the stack, and checks when the functions terminates, to detect buffer overflows.</p>\n<p>Read more about the overflow protection on <a href=\"http://en.wikipedia.org/wiki/Buffer_overflow_protection\">wikipedia</a>, and more about the percpu structure in <a href=\"http://www.cs.fsu.edu/~baker/devices/lxr/http/source/linux/arch/x86/include/asm/stackprotector.h\">the linux kernel source</a>.</p>\n</div>",
            "votes": "10",
            "user": "Guntram Blohm",
            "time": "Jul 11, 2014 at 17:18",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">On Windows, you can use <code>GetThreadSelectorEntry()</code> in user-mode to get the base address of a segment. But as @guntram-blohm said above, it looks like there's no such user-mode functionality in Linux.</span>",
                    "time": null
                },
                {
                    "user": "broadway",
                    "text": "<span class=\"comment-copy\">In his particular example, as well, it looks like it's just the glibc stack canary code anyways, although thread local storage uses fs or gs typically as well.</span>",
                    "time": null
                }
            ]
        }
    ]
}