{
    "title": "Adding another section to an idb file",
    "link": "https://reverseengineering.stackexchange.com/questions/5874/adding-another-section-to-an-idb-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm debugging a process inside a VM via Olly, and occasionally exporting a section dump when needed and loading it on the host system for better analysis.</p>\n<p>Right now I'm looking at a dump of a certain code section that's referencing function calls in another, dynamically allocated, section. In the debugger I can of course see all the function calls, but in IDA all I have are calls to immediate addresses that don't exist.</p>\n<p>I'd like to be able to dump the referenced section and somehow bluntly attach it to the same .idb so IDA would be able to resolve the references for me.</p>\n<p>I couldn't find anything about it on google or when digging around the menus.\nDid I miss something or is this impossible or requires an addon? It's also possible for me to write an idapython script that defines and copies the section over, but I don't see any relevant API calls.</p>\n<p>Debugging via IDA and taking a full memory snapshot is a solution I'd like to not have to use; I enjoy using olly.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida"
    ],
    "user": "Sleeptime",
    "time": "Jul 16, 2014 at 16:41",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>After loading the main dump into IDA, in IDA's menubar go to <code>File</code> → <code>Load file</code> → <code>Additional binary file...</code>, select the dump of the dynamically allocated memory, and specify the dynamic allocation address as the <code>Loading segment</code>.</p>\n</div>",
            "votes": "5",
            "user": "Jason Geffner",
            "time": "Jul 16, 2014 at 17:21",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Sleeptime",
                    "text": "<span class=\"comment-copy\">Is there also a way to cut a binary out if I loaded it in the wrong offset? :)</span>",
                    "time": null
                }
            ]
        }
    ]
}