{
    "title": "crackme binary crashing on Raspberry pi",
    "link": "https://reverseengineering.stackexchange.com/questions/5906/crackme-binary-crashing-on-raspberry-pi",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I was trying out a basic ARM crackme <a href=\"http://crackmes.cf/users/blankwall/arm_crack1/\" rel=\"nofollow noreferrer\">here</a>. Upon running it on my Raspberry pi, it segfaults without giving me any warning. Moreover, I'm unable to set breakpoints anywhere(even on the entry point). Is there some gdb/ARM quirk that I should be aware of? This has happened on an earlier occasion too with another CTF challenge.</p>\n<p>I do get the feeling that my questions is incomplete -- however, I'm not sure what additional information I could provide to help diagnose the problem. If you could let me know what additional information is required, I could update the question with that.</p>\n<p>Some output :-</p>\n<pre><code>$ file arm_crack1\narm_crack1: ELF 32-bit LSB executable, ARM, version 1 (SYSV), dynamically linked (uses shared libs), for GNU/Linux 2.6.16, BuildID[sha1]=0xbb39a930c55e6d62c7cc083bb94567adcfe5cc3b, stripped\n$ ldd arm_crack1\n    not a dynamic executable\n</code></pre>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "663",
    "tags": [
        "arm",
        "crackme"
    ],
    "user": null,
    "time": "Jan 1, 2018 at 16:40",
    "comments": [
        {
            "user": "Peter Andersson",
            "text": "<span class=\"comment-copy\">Could you also include a ldd dump? Might be interesting to see how everything gets linked together on the target system. I haven't tried taking a look at the binary to see if there is any dependencies. If it doesn't depend on any libraries it's probably doing syscalls directly which can change between kernel versions.</span>",
            "time": null
        },
        {
            "user": "Peter Andersson",
            "text": "<span class=\"comment-copy\">have you tried running strace on it? What kernel version are you running on the RPi?</span>",
            "time": null
        }
    ],
    "answers_data": []
}