{
    "title": "Does MSVCXXX.dll means that the PE file is compiled by Microsoft Visual C?",
    "link": "https://reverseengineering.stackexchange.com/questions/5972/does-msvcxxx-dll-means-that-the-pe-file-is-compiled-by-microsoft-visual-c",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>While viewing the PE headers and imported functions of some programs designed with visual C. I found that they all include one of these functions:</p>\n<ul>\n<li><code>MSVCRT.DLL</code></li>\n<li><code>MSVCR80.DLL</code></li>\n<li><code>MSVCR90.DLL</code></li>\n<li><code>MSVCR100D.DLL</code></li>\n<li><code>MSVCRT20.DLL</code></li>\n<li><code>MSVCRT40.DLL</code></li>\n<li>And other DLLs which starts with the MSVC prefix.</li>\n</ul>\n<p>Does this mean that any program (even malware) that imports any of these functions must be compiled by MSVC ?</p>\n</div>",
    "votes": "1",
    "answers": 2,
    "views": "384",
    "tags": [
        "disassembly",
        "c++",
        "c",
        "pe"
    ],
    "user": "Ahmed",
    "time": "Jul 29, 2014 at 17:15",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>While it's possible for something to be compiled with a compiler other than MSVC and \"manually\" import from an MSVC DLL, it's extremely unlikely and uncommon.</p>\n<p>Chances are, yes, if you see something importing from an MSVC DLL, it was very likely compiled with MSVC.</p>\n<p>Keep in mind though that it's possible to have an executable compiled with MSVC that doesn't import functions from an MSVC DLL.</p>\n</div>",
            "votes": "2",
            "user": "Jason Geffner",
            "time": "Jul 29, 2014 at 15:34",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>\"Extremely unlikely and uncommon\" sounds exactly like something malware would try/strive for.  </p>\n<p>Using normal WinAPI functions, as a distraction for the reverser or a time-wasting mechanism against an emulator, in malware packers is common <a href=\"http://www.mcafee.com/au/resources/reports/rp-packer-layers-rogue-antivirus-programs.pdf\" rel=\"nofollow\"></a>.<br/>\nThere is no reason for not using msvcrt.dll functions (However one cannot count on Redistributable Packs for Visual Studio X being installed so the presence of msvcrt90.dll and similar is a flag against it being malware), so the presence of msvcrt* is not reliable at all.</p>\n<p>Entry-point signature, Rich signature or the debug directory would be better choices.</p>\n<p>Just quickly: Those with a D are the debug versions. </p>\n</div>",
            "votes": "-2",
            "user": "user45891",
            "time": "Jul 29, 2014 at 21:14",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">\"'Extremely unlikely and uncommon' sounds exactly like something malware would try/strive for.\" -- Over the past eleven years of analyzing malware, I've never once seen non-MSVC-built malware import from an MSVC DLL. But even if malware did, so what? There's no real benefit to doing so.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">\"Using normal WinAPI functions in packers is common, actually mandatory .\" -- No, it's not mandatory.</span>",
                    "time": null
                },
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">Only slightly better obfuscation would be to add  imports of all major C compilers (Borland, Watcom, gcc). I see no point in doing so. It would be easier still to <i>not</i> use any external DLLs.</span>",
                    "time": null
                },
                {
                    "user": "user45891",
                    "text": "<span class=\"comment-copy\">@JasonGeffner Ok I revise my word choice. It isn't mandatory per se but you need SOMETHING to waste time for the emulators. So either normal WinAPI functions or just plain junkcode like in old-timey polymorph engines (with the pointless math and stack movments). And the latter one has it's problems like: <a href=\"http://arxiv.org/ftp/arxiv/papers/1104/1104.3228.pdf\" rel=\"nofollow noreferrer\">arxiv.org/ftp/arxiv/papers/1104/1104.3228.pdf</a>  So, it isn't strictly mandatory but it is the most sensible and IMO only worthwhile approach</span>",
                    "time": null
                }
            ]
        }
    ]
}