{
    "title": "Problem while debugging with gdbserver in IDA Pro",
    "link": "https://reverseengineering.stackexchange.com/questions/6064/problem-while-debugging-with-gdbserver-in-ida-pro",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm new to debugging with IDA Pro and I ran into the problem that my breakpoint is not hit while attempting to debug with gdbserver. The program is written by myself and it is simple to debug with gdb. Can someone please help me regarding debugging with IDA? Here are the steps I perform for debugging: </p>\n<ol>\n<li><p>Start gdbserver version 7.7 configured as \"x86_64-linux-gnu\" in a terminal on my localhost like so:</p>\n<pre><code>$ gdbserver --multi localhost:1234\nListening on port 1234\n</code></pre></li>\n<li><p>Open a new database in IDA Pro version 6.6, set a breakpoint in the code, chose the \"Remote GDB\nDebugger\" and start a new process. The IDA output window shows the following\nmessage:</p>\n<pre><code>FFFFFFFFFFFFFFFF: process /home/benny/3-challenge has started (pid=0)\nFFFFD8F8: got SIGTRAP signal (Trace/breakpoint trap) (exc.code 5, tid 27171)\n</code></pre></li>\n<li><p>A <strong>Warning</strong> pops up in IDA giving me the following message:</p>\n<pre><code>FFFFD8F8: got SIGTRAP signal (Trace/breakpoint trap) (exc.code 5, tid 27171)\n</code></pre></li>\n<li><p>The terminal where the gdbserver is running shows the following\nmessage:</p>\n<pre><code>Remote debugging from host 127.0.0.1\nProcess /home/benny/3-challenge created; pid = 27171\n</code></pre></li>\n</ol>\n<p>I guess the SIGTRAP may already be a problem, however, I don't understand why I get it. What am I doing wrong?</p>\n<p>Anyway going further by ignoring the warning:</p>\n<ol start=\"5\">\n<li><p>The IDA Debug View shows the RIP at memory position <code>FFFFD8F8</code> which is in an unexplored region of the binary: <code>MEMORY:FFFFD8F8 db ?;</code></p></li>\n<li><p>Press F9 in IDA pops-up an \"Exception Handling\" dialog, which looks like this <img alt=\"enter image description here\" src=\"https://i.sstatic.net/bF849.png\"/></p></li>\n<li><p>Click \"Yes (pass to app)\", which terminates the execution of the debugging session and the IDA output window prints </p>\n<pre><code>Debugger: process has exited (exit code 5)\n</code></pre></li>\n</ol>\n<p>While the output on the terminal running gdbserver prints</p>\n<pre><code>Child terminated with signal = 0x5 (SIGTRAP)\nreadchar: Got EOF\nRemote side has terminated connection.  GDBserver will reopen the connection.\nListening on port 1234\n</code></pre>\n<p>Please let me know if you need more info.</p>\n<p>UPDATE: I got fed up with GDB server and am now using Intel PIN for debugging, which works like a charm with IDA Pro.</p>\n</div>",
    "votes": "7",
    "answers": 1,
    "views": "8k",
    "tags": [
        "ida",
        "debugging",
        "gdb",
        "x86-64"
    ],
    "user": "Benny",
    "time": "Oct 11, 2015 at 10:31",
    "comments": [
        {
            "user": "Stolas",
            "text": "<span class=\"comment-copy\">What are you debugging? It might hold some anti-debugging methods.</span>",
            "time": null
        },
        {
            "user": "Benny",
            "text": "<span class=\"comment-copy\">As I said in the second sentence of my question: \"The program I am debugging is written by myself\". It is extremely simple and doesn't contain anti-debugging methods.</span>",
            "time": null
        },
        {
            "user": "Stolas",
            "text": "<span class=\"comment-copy\">oops missed that. Sorry, can you share it so I can try to reproduce it on my boxes?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The <code>SIGTRAP</code> is generally raised by a debug break exception (<code>int 3</code>).</p>\n<p>When IDA receives it, it's asking you whether to pass it to the program (unhandled).  If you do, and you do not have a signal handler installed for <code>SIGTRAP</code>, the program will die with a <code>SIGTRAP</code> error, as you see.</p>\n<p>You want IDA to <strong>discard</strong> the exception, and continue execution (if you want to continue) or <strong>suspend</strong> to investigate state in IDA.</p>\n</div>",
            "votes": "3",
            "user": "Zach Riggle",
            "time": "Oct 13, 2014 at 21:55",
            "is_accepted": false,
            "comments": []
        }
    ]
}