{
    "title": "Unknown compression algorithm",
    "link": "https://reverseengineering.stackexchange.com/questions/6099/unknown-compression-algorithm",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I got data which is compressed but I fail to find the compression algorithm.\nThe data is part of a larger file from which I know the layout, So I managed to find out few things. What I know:</p>\n<ul>\n<li>I don't have the binary executable that load the data, I only have the updated version which no longer support the old copression algo. I tortured it in many way and it just doesn't contain the corresponding code</li>\n<li>it is compressed (100% sure of it)</li>\n<li>it can be home made as it was replaced later (see below)</li>\n<li>no magic numbers so far</li>\n<li>it is not plain:\n     <ul>\n<li>deflate (wrong header)</li>\n<li>lzma (wrong header)</li>\n<li>gzip (wrong header)</li>\n<li>Quantum (wrong header)</li>\n<li>Microsoft CAB (wrong header)</li>\n<li>Bzip2 (wrong header)</li>\n<li>Zip (wrong header)</li>\n</ul>\n</li>\n<li>the uncompressed size is given in the file containing the data, this file layout is fully reversed and does not contain any clue</li>\n<li>it might be encrypted but is unlikely because of speed requirements</li>\n<li>if it is encrypted, it gives the same output given the same data input at the beginning of the sequence (by guess on some uncompressed data located nearby)</li>\n<li>it is from 2001 and has been replaced by deflate since</li>\n<li>Some of those data only output ASCII and nothing else (I know it from the layout of the container file) and have a compression ratio of about 0.30  (compressedSize/uncompressedSize) everytime</li>\n<li>I don't have any before/after data sadly</li>\n</ul>\n<p>EDIT: There are the 32 first bytes in hex:\nb9daed36cb64bedb61b9dd2cb72afd8ee565b0dd2ea00f0afda2c36eb25b0016</p>\n<p>I made histograms of several of those data and they all match a specific pattern. Something is going on with the powers of 2 obviously but I fail to see what.</p>\n<p><a href=\"https://i.sstatic.net/MRK5H.jpg\" rel=\"noreferrer\"><img src=\"https://i.sstatic.net/bq9jG.png\" title=\"Hosted by imgur.com\"/></a></p>\n<p>Anyone has a idea what it could be? What can I do to gather further information? Does it look Lempel-Ziv based? If yes how could I reverse it?</p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "4k",
    "tags": [
        "file-format"
    ],
    "user": "search4everNever",
    "time": "Aug 19, 2014 at 14:28",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">If you don't have the executable how did you get this file? Also, show a dump of the 16-32 bytes of the header.</span>",
            "time": null
        },
        {
            "user": "search4everNever",
            "text": "<span class=\"comment-copy\">Updated to answer + hex dump of the header</span>",
            "time": null
        },
        {
            "user": "perror",
            "text": "<span class=\"comment-copy\">You may find this question and answers interesting to look at: &gt; <a href=\"https://reverseengineering.stackexchange.com/questions/1463/are-there-any-tools-or-scripts-for-identifying-compression-algorithms-in-executa\">Are there any tools or scripts for identifying compression algorithms in executables?</a></span>",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "<span class=\"comment-copy\">\"The output is ASCII and nothing else\" - that, coupled with a ratio of \"about 0.30\" actually suggests a <i>simple</i> compression scheme, rather than a complicated: a dedicated text-only compression scheme. Can we see this file?</span>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">Have you tried contacting the company that made the software?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<ul>\n<li>First of all, you forgot lzo. AFAIR it was invented in 1996.</li>\n<li>Second of all, it is possible that the compressed data has no corresponding standard header (which makes all \"incorrect header\" mistakes not necessarily true).</li>\n<li>Third of all, the histogram doesn't look like histogram of data compressed as one piece, it is possible that it has some internal structure (may be blobs with sizes before them ?).</li>\n</ul>\n<p>I'd suggest to write script that runs different decompression algorithms on parts of the data and to observe results.</p>\n</div>",
            "votes": "3",
            "user": "w s",
            "time": "Aug 20, 2014 at 7:09",
            "is_accepted": false,
            "comments": []
        }
    ]
}