{
    "title": "Can I send gdb command from IDA Debugger to gdbserver?",
    "link": "https://reverseengineering.stackexchange.com/questions/6127/can-i-send-gdb-command-from-ida-debugger-to-gdbserver",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I want to send gdb command (like \"backtrace\", \"b *0xAAAAAAA\", \"i b\", ...) from IDA debugger to gdbserver over gdb remote debugging and receive result and print it to output view of IDA, can I do it? Anyone have tried it before? </p>\n<p>I found that function \"SendDbgCommand\" in IDA help </p>\n<blockquote>\n<p>Send arbitrary command to the debugger engine. Returns: the command\n  output.</p>\n<p>Note: this function is available for the following debuggers: windbg,\n  gdb, bochs</p>\n<p>string SendDbgCommand(string cmd);</p>\n</blockquote>\n<p>But when i tried it, in idc script or idapython script, it didn't work!</p>\n<p>more detail: </p>\n<ul>\n<li>i used ida 6.1 remote GDB debugger and my remote machine is Ubuntu, run command </li>\n</ul>\n<blockquote>\n<p>gdbserver --multi localhost:12345</p>\n</blockquote>\n<p>as normal remote debugging session and everything is alright</p>\n<p>now, i want to use other gdb commands (like above) beside operators provided by ida GUI</p>\n<ul>\n<li>i tried idapython script from: <a href=\"https://code.google.com/p/idapython/source/browse/trunk/Scripts/DbgCmd.py?r=344\" rel=\"noreferrer\">https://code.google.com/p/idapython/source/browse/trunk/Scripts/DbgCmd.py?r=344</a>\nbut it didn't work, when execute SendDbgCommand, it return IDC_FAILURE</li>\n</ul>\n<blockquote>\n<pre><code>if s.startswith(\"IDC_FAILURE\"):\n    raise Exception, \"Debugger command is available only when the debugger is active!\"\n</code></pre>\n</blockquote>\n<ul>\n<li>i also tried use SendDbgCommand in idc script but i didn't work too, it returns 0</li>\n</ul>\n<p>Anyone can help me please? Thank you so much! </p>\n</div>",
    "votes": "6",
    "answers": 1,
    "views": "4k",
    "tags": [
        "ida",
        "gdb"
    ],
    "user": "user3746442",
    "time": "Aug 27, 2014 at 10:41",
    "comments": [
        {
            "user": "perror",
            "text": "<span class=\"comment-copy\">You didn't explain enough what you already tried, what configuration you used and, also, what was the problem you encountered when running it. Try to give more details.</span>",
            "time": null
        },
        {
            "user": "user3746442",
            "text": "<span class=\"comment-copy\">ok, i am going to add more detail!</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The commands you're trying to use are implemented in the GDB executable, not <code>gdbserver</code>. The <code>gdbserver</code> implements the <a href=\"https://sourceware.org/gdb/current/onlinedocs/gdb/Remote-Protocol.html\" rel=\"nofollow\">Remote Serial Protocol</a>, and IDA is using that to send commands (read/write registers/memory, set breakpoints etc.) and get results.</p>\n<p>Since IDA is not using the GDB program itself, it cannot process its commands. You need to use IDA commands to control the executable and retrieve the information.</p>\n<p>The \"GDB\" commandline at the bottom allows you to send the so-called \"monitor commands\" which allow the remote stub to implement various functionality not covered by the protocol. For example, VMWare's GDB stub supports \"r\" command to get details about some registers.</p>\n</div>",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "Aug 27, 2014 at 12:10",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user3746442",
                    "text": "<span class=\"comment-copy\">ah ... so gdbserver has private commands and ida communicates with it by remote serial protocol and SendDbgCommand is used to send the gdbserver's private commands?</span>",
                    "time": null
                }
            ]
        }
    ]
}