{
    "title": "Reverse-engineering of an Unity dll",
    "link": "https://reverseengineering.stackexchange.com/questions/6190/reverse-engineering-of-an-unity-dll",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm working on a project which requires me to extract, edit, and reproduce part of a proprietary hash algorithm.. which is contained inside a dll.</p>\n<p>The dll is used by an Unity game, and includes Unity between its references too.</p>\n<p>This dll invokes some external functions contained in another dll (which I suppose has been written in c++, considering the DllImport etc present in the source code) with all the real hash logic and methods... and here comes the problem.</p>\n<p>I've not been able to find and locate that dll: no trace in the folder at all.</p>\n<p>So I suppose that Unity (or whatever tool) managed somehow to embed it inside the dll code itself... but after further decompilation, disassemblation etc, the dll does not present any code to eventually extract it!</p>\n<p>The fact is that ILSpy is able to show this external dll in the \"parent\" dll references, marking it as a \"module\", but I have no idea about how to proceed to extract it (if it's relly there!).</p>\n<p>I also tried to bypass the problem, including the entire dll into a C# project, and invoking its public functions at runtime (like the Unity game does)... but it seems that somehow, this idea is not working at all (read something about the fact that unity can run c# code, but I cannot init Unity via C#... or something like that).</p>\n<p>So... After struggling for days, I decided to ask here to some experts.</p>\n<p>Anyone can help me?</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "9k",
    "tags": [
        "dll",
        "android"
    ],
    "user": "W00dL3cs",
    "time": "Sep 9, 2014 at 8:05",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<blockquote>\n<p><em>This dll invokes some external functions contained in another dll (which I suppose has been written in c++, considering the DllImport\n  etc present in the source code) with all the real hash logic and\n  methods... and here comes the problem. <br/> I've not been able to find and\n  locate that dll: no trace in the folder at all.</em></p>\n</blockquote>\n<p>Use <a href=\"http://technet.microsoft.com/en-us/sysinternals/bb896653\" rel=\"nofollow\"><em>Process Explorer</em></a> or <a href=\"http://processhacker.sourceforge.net/\" rel=\"nofollow\"><em>Process Hacker</em></a> to find which modules are loaded in the address space of the process. When you find the required dll, check whether there exists a valid path for that module in disk. If there is one then you may simple copy over the dll for further analysis.\n <a href=\"http://www.joachim-bauch.de/tutorials/loading-a-dll-from-memory/\" rel=\"nofollow\">Otherwise the dll may have been loaded from memory</a>. In such case you have to dump that dll from memory.</p>\n<p>Next using a PE detection tool such as <a href=\"http://exeinfo.atwebpages.com/\" rel=\"nofollow\"><em>ExeInfo PE</em></a> , <a href=\"http://ntinfo.biz/index.php/detect-it-easy\" rel=\"nofollow\"><em>Detect It Easy</em></a> scan the dll. If it is a managed DLL (aka .net) check if a .net decompiler such as <a href=\"http://www.jetbrains.com/decompiler/\" rel=\"nofollow\"><em>dotPeek</em></a> or <a href=\"http://www.red-gate.com/products/dotnet-development/reflector/\" rel=\"nofollow\"><em>reflector</em></a> can decompile it readily. If it is obfuscated, try using <a href=\"https://github.com/0xd4d/de4dot\" rel=\"nofollow\"><em>de4dot</em></a> before decompiling.</p>\n<p>If it is a native dll IDA Pro is your best option for analyzing the dll. </p>\n<hr/>\n<p>There are quite a few ways to package a dll inside an executable. </p>\n<ul>\n<li>For native dlls to be embedded inside native executables, you can\nsimply store them as resources, which will be written to disk at\nruntime and loaded subsequently. Another way is to load it completely\nfrom memory as said previously.</li>\n<li>For native dlls to be embedded inside managed executables, you may\nuse the resource method.</li>\n<li>For managed dlls to be embedded inside managed executables, you may\nuse the resource method, but writing it to disk is not needed.</li>\n</ul>\n<p>See this article <a href=\"http://www.codeproject.com/Articles/528178/Load-DLL-From-Embedded-Resource\" rel=\"nofollow\">on loading a dll from embedded resource</a> for more info.</p>\n</div>",
            "votes": "2",
            "user": "0xec",
            "time": "Sep 7, 2014 at 5:25",
            "is_accepted": false,
            "comments": [
                {
                    "user": "W00dL3cs",
                    "text": "<span class=\"comment-copy\">Unlucky I cannot dump memory unless tools such those you named are available for Android too (as the dll is used by an Unity mobile game, I forgot to mention it). Already tried to check for path at runtime, and also analyzing the dll with dotPeek and Reflector exposed nothing more than those external calls... without actually having access to the un-managed dll at all.</span>",
                    "time": null
                },
                {
                    "user": "0xec",
                    "text": "<span class=\"comment-copy\">@W00dL3cs Please add the android tag then. For Android it would be a <i>Shared Object (.so)</i> not a <i>dll</i>. Also check <i><a href=\"http://docs.unity3d.com/Manual/PluginsForAndroid.html\" rel=\"nofollow noreferrer\">this</a></i> page.</span>",
                    "time": null
                },
                {
                    "user": "0xec",
                    "text": "<span class=\"comment-copy\">@W00dL3cs If you have got the <i>apk</i> of the game, Open it in a Archive Editor like WinRAR, and check in the following directory <i>Assets-&gt;Plugins-&gt;Android</i> whether the required file exists.</span>",
                    "time": null
                },
                {
                    "user": "Ian Cook",
                    "text": "<span class=\"comment-copy\">It sounds like the android app is using mono so it could well be a DLL rather than a shared object.</span>",
                    "time": null
                },
                {
                    "user": "W00dL3cs",
                    "text": "<span class=\"comment-copy\">I scraped the content of the .apk, and found a .so file with similar name as the dll referenced in the main one... the fact is that decompiling such dll exposes external calls to another dll, not to a shared object!</span>",
                    "time": null
                }
            ]
        }
    ]
}