{
    "title": "Computer Malware: More complex than metamorphic?",
    "link": "https://reverseengineering.stackexchange.com/questions/6196/computer-malware-more-complex-than-metamorphic",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have read the topic on <a href=\"https://reverseengineering.stackexchange.com/questions/1696/what-are-the-differences-between-metamorphic-oligomorphic-and-polymorphic-malwa\">oligo-, poly- and metamorphic malware</a>. I have done a quick google search, and it seems like the concept of metamorphic malware was already known in the DOS age and in the 1990s at 32-bit Windows (according to <a href=\"http://www.google.at/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0CCEQFjAA&amp;url=http%3A%2F%2Fwww.symantec.com%2Favcenter%2Freference%2Fhunting.for.metamorphic.pdf&amp;ei=sOcMVOyTCMLVaov5gIgM&amp;usg=AFQjCNH7YtpHpkUAoS5gPPKGBagXA97jNQ&amp;bvm=bv.74649129,d.d2s\" rel=\"nofollow noreferrer\">Hunting For Metamorphic by Ször and Ferrie</a>).</p>\n<blockquote>\n<p>Are there more complex methods of self-modification in computer malware than metamorphism in modern times?</p>\n</blockquote>\n<p><strong>Edit</strong></p>\n<p>The answer by Jason Geffner is very interesting, dealing with problematic reverse-engineering techniques. As soon as you have the plain code, can you create a detection mechanism? I understand that for polymorphism (where there is an underlying unprotected layer) or for VMs. But what about codes that can change this underlying layer, such as metamorphic codes do (see the reference above)?</p>\n<p>There, reversing gives you the underlying layer, which is not constant - right? I also wonder whether there are advanced techniques of metamorphism developed since the last 10 year or so, or did this type of self-modification become extinct?</p>\n<p><strong>Edit2</strong>\nAs I cannot comment due to too less friend-points, Jason: I intented to ask this as my original question. The info you gave is interesting, unfortunatly it doensn't answer fully my oringial question (which I have stated not well enough as it seems). With my edit above, I wanted to clarify what I wanted to know. I dont think a new question is required as this is the originally intented question, do you agree?</p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "561",
    "tags": [
        "malware",
        "obfuscation"
    ],
    "user": "Laniakea",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">One question per post :) Please create a new question for your Edit above - <a href=\"http://reverseengineering.stackexchange.com/questions/ask\">reverseengineering.stackexchange.com/questions/ask</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Metamorphism wasn't used for obfuscation as much as it was used to defeat static AV signatures.</p>\n<p>In terms of modern* obfuscation:</p>\n<ul>\n<li>A custom virtual machine can be a pain to analyze, especially if it's a custom crafted one (as opposed to something like VMProtect which is more widely studied).</li>\n<li>Obfuscation that involves code running in the kernel can also be challenging for many reversers, since many common reverse engineering tools are designed for user-mode targets.</li>\n<li>Chunked packing, where not all code is deobfuscated at the same time, can be difficult to analyze.</li>\n</ul>\n<p>There are plenty of other methods of complex obfuscation that I'm sure others will name on this thread :)</p>\n<p>And although you didn't ask about it, a modern* polymorphic technique is server-side polymorphism, where the polymorphic engine is on a remote server and it is used to churn out millions of variations of a malware sample.</p>\n<p><em>*</em> Note that \"modern\" in this context means the past 10 years or so.</p>\n</div>",
            "votes": "5",
            "user": "Jason Geffner",
            "time": "Sep 8, 2014 at 2:05",
            "is_accepted": false,
            "comments": [
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">As a note regarding virtual machines: various protectors like Themida can use multiple random virtual machines chained. For example, a random VM \"A\" that emulates a random VM \"B\", etc... A pain in the ass to analyse.</span>",
                    "time": null
                },
                {
                    "user": "Mario Krenn",
                    "text": "<span class=\"comment-copy\">Jason: Thanks for your answer, unfortunatly it does not answer my original question (which deals with metamorphism, you talk about obfuscation techniques). Could you maybe mention something about the original question aswell? Would be interesting! :)</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">I did answer your original question before you changed your question :) Please ask only one question per post.</span>",
                    "time": null
                }
            ]
        }
    ]
}