{
    "title": "Detecting SSDT and inline hooks in kernel",
    "link": "https://reverseengineering.stackexchange.com/questions/6217/detecting-ssdt-and-inline-hooks-in-kernel",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I did a simple SSDT Hooks detector that iterates through all entries and checks if any address is outside the Kernel module. If so, I can even go back and using the <code>syscall</code> find out what function was supposed to be there. \nI suppose that at this point I could also try to undo the hook, but I haven't tried yet. </p>\n<p>I use <code>ZwQuerySystemInformation</code> to get a list of modules and I always assume that the first module is the kernel. \nHow safe is this approach? Is there a chance that the kernel module would not be the first? I could search by name, but it's not always the same so I tried to avoid that; I can make it to search for one of the names the kernel module could have. \nI also need that list to see from what module comes the hook.\nIs there a way that I can get a list of the loaded modules without <code>ZwQuerySystemInformation</code>? It can hide information from me if it is hooked. </p>\n<p>Regarding inline hooks, right now I iterate through all the exports from the kernel module and check each function's code to see if it begins with a relative jump or a push offset &amp; ret. Should I also check if the address to which the jump / ret is made is outside the kernel module or it's redundant? \nIf I don't check for the jump address I get a false positive (I think) for <code>KePollFreezeExecution</code> which jumps inside the kernel module.\nu <code>nt!KePollFreezeExecution</code> in WinDbg gives the following output</p>\n<pre><code>jmp nt!KeIpiGenericCall+0x132\nint 3\n</code></pre>\n<p>Seems ok. </p>\n<p>I know this isn't perfect (someone could place the hook anywhere inside the function code or maybe find a place inside the kernel module where to put his functions and so on), but I'm just doing it to understand how all of this works.</p>\n<p>Also, I'm aware that on x64 this methods won't be so simple to implement, but at the moment I'm experimenting with x86. </p>\n<p>More of a \"how should I approach this\" question than \"how should I code this\".  </p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "windows",
        "kernel-mode",
        "function-hooking"
    ],
    "user": "user3002428",
    "time": "Sep 10, 2014 at 15:44",
    "comments": [
        {
            "user": "0xec",
            "text": "<span class=\"comment-copy\">See <i><a href=\"http://reverseengineering.stackexchange.com/questions/3882/how-does-kernel-detective-check-if-api-functions-are-hooked\">this</a></i> and <i><a href=\"http://www.malwaretech.com/2013/10/ring3-ring0-rootkit-hook-detection-22.html\" rel=\"nofollow noreferrer\">this</a></i></span>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Whether it's outside the kernel module is only going to catch the simplest hook methods. Like every PE file when loaded into memory the NT kernel will have \"gaps\". Basically the remainder of a section up to its logical size or even just when functions are aligned with more than necessary NOPs. Those gaps can be (ab)used to store the trampolines and your detection code won't even consider them hooks.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If your looking for SSDT hooking with WinDbg, have tried the SwishDbgExt.dll?</p>\n<p><s>Here is the link to the author's page - <a href=\"http://www.msuiche.net/2014/07/16/thats-so-swish\" rel=\"nofollow noreferrer\">http://www.msuiche.net/2014/07/16/thats-so-swish</a></s></p>\n<p><s>Update: <a href=\"http://www.msuiche.net/2014/08/19/swishdbgext-update-0-6-20140817/\" rel=\"nofollow noreferrer\">http://www.msuiche.net/2014/08/19/swishdbgext-update-0-6-20140817/</a></s></p>\n<p><em>Edited</em> (07/01/2020): you can find the project on <a href=\"https://github.com/comaeio/SwishDbgExt\" rel=\"nofollow noreferrer\">GitHub</a></p>\n</div>",
            "votes": "3",
            "user": "Yennefer",
            "time": "Jan 7, 2020 at 21:32",
            "is_accepted": false,
            "comments": []
        }
    ]
}