{
    "title": "Simple Program Being Paused Somewhere in ntdll",
    "link": "https://reverseengineering.stackexchange.com/questions/6236/simple-program-being-paused-somewhere-in-ntdll",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The following is a simple program I wrote to be debugged in OllyDbg:</p>\n<pre><code>main(){\n    exit(0);\n}\n</code></pre>\n<p>I compiled the program and opened it in OllyDbg. The program pauses at some weird location in ntdll. I went into options and set a breakpoint at the entry. The program still paused at the same location in ntdll. I then set a breakpoint at main. And it still pauses at some location in ntdll. </p>\n<p>What am I doing wrong here?</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ollydbg",
        "c"
    ],
    "user": "hi im gosu",
    "time": "Sep 15, 2014 at 4:32",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">What version of OllyDbg are you using?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The first break is always the system breakpoint.</p>\n<p>If you do not want Ollydbg to stop at system breakpoint goto options.</p>\n<p><kbd>Alt</kbd>+<kbd>o</kbd> -&gt; events and change the make first pause at to EntryPoint Of Main module    </p>\n<p>When, a parent process creates a child with <code>DEBUG_XXXX</code> flags it should know when the process initialisation has been finished so a notification called <code>ProcessCreate DebugEvent</code> is raised <code>DbgBreakPoint</code> in <code>ntdll.dll</code> is a part of that <code>DebugEvent Notification</code> usually termed as <code>SystemBreakPoint</code>.</p>\n<p>Which version of Ollydbg are you using 1.10 or 2.01, do you have plugins loaded ? \nA simple executable with just an exit should either stop on <code>System BreakPoint</code> or <code>WinMainCrtStartup</code> or at <code>main()</code> only not anywhere else.</p>\n</div>",
            "votes": "2",
            "user": "perror",
            "time": "Sep 15, 2014 at 20:10",
            "is_accepted": false,
            "comments": [
                {
                    "user": "hi im gosu",
                    "text": "<span class=\"comment-copy\">I did that though, that's the thing. It stills breaks at the system break point. Can I ask what's so special about the \"system breakpoint.\" Is it unique? Why choose it?</span>",
                    "time": null
                }
            ]
        }
    ]
}