{
    "title": "Storing files on keyboard memory",
    "link": "https://reverseengineering.stackexchange.com/questions/6388/storing-files-on-keyboard-memory",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is it theoretically possible to take these new smarter keyboards such as the K70 RGB and tap into the onboard memory which in the case of the K70 RGB, is used for storing lighting profiles and the likes, is it possible to tap into that for storage ?</p>\n<p>I realize it would be tiny storage but I was thinking of things such as hiding master password lists or encryption keys or something cool in there, a place no one would think to look or even know how to look..</p>\n<p>So... is it theoretically possible to monitor how the keyboard stores the profile to the memory when you tell it too, and watch it's process and somehow break that and emulate it to store your own files?</p>\n<p>Or, is there some tech hurdle I am missing here due to my noobyism...</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "3k",
    "tags": [
        "hardware"
    ],
    "user": "Damien",
    "time": "Oct 6, 2014 at 15:56",
    "comments": [
        {
            "user": "Stolas",
            "text": "<span class=\"comment-copy\">Please not this is a guess and this is only verifyable if you open it up. BUt no you can't. As there is not enough space to store real information. Open the keyboard and reverse the software to make sure you can or can't</span>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">Do you know how much is stored on the keyboard, and how much on the PC by the driver? Do the PC and the keyboard actually share that information? If you can change some settings on the PC, and these settings are truly stored on the keyboard (are they unchanged if you attach the keyboard to a different PC?), then it should be possible to continue with your, er, quest, by learning USB protocols, and monitoring the communication between PC and keyboard by something like <a href=\"http://sourceforge.net/projects/usbsnoop/\" rel=\"nofollow noreferrer\">sourceforge.net/projects/usbsnoop</a>.</span>",
            "time": null
        },
        {
            "user": "Spektre",
            "text": "<span class=\"comment-copy\">I would do the test proposed by @GuntramBlohm with internet off because modern tech drivers/apps sucks so I would be not suprised much if it stores the profiles on some server instead of local HDD or OnBoard memory. Especially if the driver need any frameworks like ATI ... If the test confirms the OnBoard memory is used then post more info like connection type (USB,PS2?) IC's onboard, driver info etc ...</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is it theoretically possible to store custom things in the onboard memory of input devices like keyboards or mice? </p>\n<p><strong>Yes</strong>.</p>\n<p>I can't give you an exhaustive list of devices you could use for this purpose, but I can give you <em>at least</em> one, which should be enough to satisfy \"theoretically possible\".</p>\n<p>The <a href=\"http://rads.stackoverflow.com/amzn/click/B0083H4NG4\" rel=\"nofollow\">Perixx MX-2000 IIB</a> comes with onboard memory, to the tune of at least 1,285 bytes. 261 of those bytes are required for mouse configuration and settings, but 1,024 of those bytes are reserved for macro memory, which can be used for any other purpose, even when macros are not enabled. You can absolutely store arbitrary data in those sectors, and even have the data recallable on button click (actually using it as a macro) or otherwise dumping the data via USB. </p>\n<p>I've come across this through reverse engineering the windows driver for this mouse making a <a href=\"https://github.com/pzl/mx2000drv\" rel=\"nofollow\">linux port</a>. An extremely quick way to accomplish what you want with this mouse is using this driver, and using the <strong>dump</strong> and <strong>load</strong> commands. The dump command creates a 1285-byte binary file with the memory contents of the mouse. Opening this with a hex editor, the first 1024 bytes should be easily seen to be all <code>0xFF</code>. Feel free to put any arbitrary data there, it doesn't cause adverse effects to the mouse until macros are enabled. After editing the file, you can update the mouse memory using the load command. Of course, you can read it back with another dump. </p>\n</div>",
            "votes": "2",
            "user": "Dan P",
            "time": "Feb 19, 2015 at 22:24",
            "is_accepted": false,
            "comments": []
        }
    ]
}