{
    "title": "Windbg: going from vftable to c++ class",
    "link": "https://reverseengineering.stackexchange.com/questions/6436/windbg-going-from-vftable-to-c-class",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>As part of an assignment, I am delving into the world of Internet Explorer, and am trying to figure out exactly what class(es) are being allocated on the heap.</p>\n<p>In the <code>mshtml!CEventObj::GenericGetElement()</code> method, the <code>eax</code> register points to an instance of a class, <code>edi</code> points to the object it references, and <code>esi</code> points to the vftable.</p>\n<p>This being said, I inserted a breakpoint that would list these registers each time through the function, and they always point to the same vftable.</p>\n<p>The vftable in question is <code>mshtml!CBodyElement</code>, but does this actually mean that all these instances are of the <code>CBodyElement</code>, or could they be for classes derived from <code>CBodyElement</code>. </p>\n<p>If they are from derived classes, how do I determine the actual classes being allocated ?</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "dynamic-analysis",
        "windbg"
    ],
    "user": "dnraikes",
    "time": "Oct 13, 2014 at 8:26",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>A derived class will get its own <code>vtable</code> if it overrides any of the virtual functions.</p>\n<p>If the derived class does not override any virtual functions, it will use the original <code>vtable</code>.</p>\n<p>I would say that your assumption is correct ~90% of the time.</p>\n<p>The best that you can do for <em>static</em> type recovery, is to look at the <code>vtable</code> being used.</p>\n<p>What you can do to help a bit is to turn one PageHeap with stack tracking (<code>gflags.exe /i iexplore.exe +hpa +ust</code>) and look at the address allocated for the object (<code>!heap -p -a 0xaddress</code>).  This will give you a full stack trace to the allocation-site of the object, which is sometimes to determine the type of object (e.g. if a <code>Factory</code> pattern was used).</p>\n<p>Finally, there are additional dynamic analysis tricks you can play.  I wrote a Pin tool and IDA Python plugin, <a href=\"https://github.com/zachriggle/ida-splode\" rel=\"nofollow noreferrer\">ida-splode</a> for almost exactly this application.  By capturing information at runtime, you can enhance your IDA traces.  Below is an example screenshot from the slide deck.  The better symbol information you have (or the better fleshed-out your IDB is), the better the information you get.</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/A0XBu.png\"/></p>\n</div>",
            "votes": "2",
            "user": "Zach Riggle",
            "time": "Oct 13, 2014 at 21:48",
            "is_accepted": true,
            "comments": []
        }
    ]
}