{
    "title": "Why the extracted content differs?",
    "link": "https://reverseengineering.stackexchange.com/questions/6539/why-the-extracted-content-differs",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I used <strong>binwalk</strong> to extract <code>firmware.bin</code> image, the extracted content is <code>squashfs-root</code> dir, and a separate <code>dpc.squashfs</code> file. Then I used <strong><a href=\"https://github.com/devttys0/sasquatch\" rel=\"nofollow\">sasquatch</a></strong> utility to extract content of dpc.squashfs file, and I got the same <code>squashfs-root</code> directory. I compared content of both <code>squashfs-root</code> directories and find, that the squashfs-root dir extracted with binwalk have <code>www</code> and <code>www_safe</code> folders, whereas in squashfs-root dir extracted with <code>sasquatch</code> that folders are missing. Why the extracted content differs?</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "408",
    "tags": [
        "binary-analysis",
        "decompilation",
        "linux",
        "firmware",
        "unpacking"
    ],
    "user": "Lexx Luxx",
    "time": "Oct 28, 2014 at 12:42",
    "comments": [
        {
            "user": "devttys0",
            "text": "<span class=\"comment-copy\">Binwalk uses unsquashfs, or one of the unsquashfs's from the firmware-mod-kit, so this may be a bug in sasquatch. You can try forcing the compression type in sasquatch with the -c option instead of letting sasquatch try to guess, which might help. It's probably best to submit this as an issue on the sasquatch github page you linked to, along with a copy of the firmware image.</span>",
            "time": null
        },
        {
            "user": "devttys0",
            "text": "<span class=\"comment-copy\">I attempted to replicate this with firmware from a Vonage ATA, as it was the only firmware I could find that had both the www and www_safe directories you mentioned. It extracted fine both through binwalk and directly with sasquatch. Again, if you're having bugs with either of these tools, it should probably be reported to the binwalk / sasquatch project pages rather than here.</span>",
            "time": null
        },
        {
            "user": "Lexx Luxx",
            "text": "<span class=\"comment-copy\">Thank you for the help. I tested sasquatch more times, and in my tests it extracts full content of the .squashfs file, include www and www_safe dirs, even without the <code>-c lzma</code> option. Don't know why this happen when I tested first time. Maybe this somehow related to file permissions, as sometimes these directories been extracted with <code>drwx--x--x (711)</code> permission, and this prevents accessing them. Sometimes it been extracted with <code>drwxr-xr-x (755)</code> permission. It extracted fine with binwalk, in fact, it wasn't necessary to use sasquatch tool, but I didn't know content of this squashfs-root.</span>",
            "time": null
        }
    ],
    "answers_data": []
}