{
    "title": "Detecting weaknesses/vulnerabilities (in games). Scientific papers/Tutorials?",
    "link": "https://reverseengineering.stackexchange.com/questions/6585/detecting-weaknesses-vulnerabilities-in-games-scientific-papers-tutorials",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am a student of informatics with additional games engineering.\nI currently have a project about Reverse Code Engineering. Mainly my task is to gather information about the topic \"Detecting weaknesses/vulnerabilities with RCE\" and write something about it.\nGathering the information, was the easy part, as with a little bit of google scholar search and references in papers I came up with a broad palette of papers. \"Program Slicing\", \"Taint Analysis\", \"Fuzzing\", \"Symbolic execution\" ...</p>\n<p>Now in addition to collecting the information and writing a paper, I have to make a little implementation. What exactly my implementation does, I have to decide on my own. It can be anything, as long as it has to do with detecting weaknesses and vulnerabilities with reverse code engineering.\nNow my problem:\nI never actually did any reverse code engineering. I have no idea what \"implementation\" I could make (with my little(no) practical knowledge of RCE).\nWith my instructor I talked about detecting vulnerabilities in games as my studies have to do with games engineering and games are an interesting topic for me.\nHowever when searching for scientific papers about detecting vulnerabilities in games I couldn't find anything. Most of the search results in scholar had to do with legal affairs and the rest had to do with anything in RCE, but games.\nAlso with normal google searching I couldn't find anything useful (papers/tutorials), but only news or descriptions of RCE in general and so on.\nI tried several combinations of different words like \"game(s)\", \"vulnerabilities\", \"weaknesses\",\"reverse code engineering\".</p>\n<p>Now I don't know if I just have the wrong way of searching, in this case, or if the stuff I search, really is hard (impossible?) to find.</p>\n<p>That's why i came here to ask you, if you know any good sources. Tutorials and/or scientific papers about detecting vulnerabilities in games?</p>\n<p>Maybe there is no information about that on the internet.\nMaybe (I don't know this) it could even be, that the task of detecting vulnerabilities in games is too demanding for someone with almost no knowledge in RCE and that I shouldn't even try to do this.\nThen I would have to program something else (easier).\nBut then again, I wouldn't know what to do. A program slicing algorithm? I have no idea of the difficulty level of certain implementations.\nTherefore if you can give me any hints on what else (beside games) would be apropriate implementing, I would be grateful to hear. Additionally links to good tutorials about implementing the alternative would be nice.</p>\n<p>I work on windows (99% of the time) and I am able to use Java, C++, C, C#, Python and Haskell.</p>\n<p>I really appreciate any help you can provide.</p>\n</div>",
    "votes": "0",
    "answers": 2,
    "views": "1k",
    "tags": [
        "windows",
        "c",
        "python",
        "java",
        "vulnerability-analysis"
    ],
    "user": "Timotheus",
    "time": "Nov 4, 2014 at 17:43",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The approach to finding security vulnerabilities in games is no different than the approach to finding security vulnerabilities in other applications.</p>\n<p>As discussed <a href=\"https://reverseengineering.stackexchange.com/a/3213/1562\">here</a>, \"Most vulnerabilities in closed-source products are found via fuzzing and static reverse engineering... Typically you don't need to analyze the entire program, but only the entrypoints for user-input.\"</p>\n<p>In the context of games, the entrypoints are typically network data (server-to-client, client-to-client, and if you have access to the server binaries then client-to-server (and server-to-server if supported)), saved game files, non-executable mods like \"skins\", etc.</p>\n<p>For example, here's a game vulnerability that I discovered and reported several years ago:</p>\n<ul>\n<li><a href=\"http://packetstormsecurity.com/files/82124/Alien-Arena-7.30-Code-Execution.html\" rel=\"nofollow noreferrer\">Advisory</a></li>\n<li><a href=\"http://www.slideshare.net/JasonGeffner/anonymous-remote-arbitrary-code-execution-in-alien-arena\" rel=\"nofollow noreferrer\">Presentation</a></li>\n</ul>\n<p>Though RCE was required to develop the exploit, the vulnerability was found without RCE. Nonetheless, you can see this as an example of a game containing a security vulnerability.</p>\n<p>With regard to finding vulnerabilities in closed-source products, there are countless papers, tutorials, and books available. <a href=\"http://amzn.com/047008023X\" rel=\"nofollow noreferrer\">The Shellcoder's Handbook</a> is one that comes to mind.</p>\n</div>",
            "votes": "5",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Stolas",
                    "text": "<span class=\"comment-copy\">Read the book: Exploiting Online Games: Cheating Massively Distributed Systems</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This is a good (maybe starting to show its age) book <a href=\"http://rads.stackoverflow.com/amzn/click/0132271915\" rel=\"nofollow\">Exploiting Online Games: Cheating Massively Distributed Systems</a>.</p>\n<p>It has a general intro on game hacking, sections on reversing and exploiting. You'll find all you need there. You don't seem to be required to do binary reversing for your project. It sounds like any project on figuring out how a client or server works will do - even if they are in Lua :)</p>\n</div>",
            "votes": "0",
            "user": "Vitaly Osipov",
            "time": "Nov 7, 2014 at 1:28",
            "is_accepted": false,
            "comments": []
        }
    ]
}