{
    "title": "Why is IAT filled with static addresses instead of function names?",
    "link": "https://reverseengineering.stackexchange.com/questions/6699/why-is-iat-filled-with-static-addresses-instead-of-function-names",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>When a program is packed the OriginalFirstThunk tends to be discarded. When the loader resolves the imports, then how does it know which functions to look for? For some reason the IAT (FirstThunk) is magically filled with addresses even before system load, not function names. Why is that? It's as if the linker wrote down the DLL name and all the function addresses from the DLL directly into the IAT at compile time. Who's to say the addresses won't change on a DLL update? Or on ASLR?</p>\n<p>Why is there addresses in the IAT in the first place? Isn't it supposed to point to the function names and be changed at runtime? If there already exist \"pre-compiled\" addresses in the IAT, then why would we even need to go set up the IAT when the executable gets loaded?</p>\n<p>Considering this, why do we even need OriginalFirstThunk? If IAT has the function names or the addresses it seems useless to me.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "530",
    "tags": [
        "unpacking",
        "iat",
        "import-reconstruction"
    ],
    "user": "ltnaisha",
    "time": "Oct 23, 2016 at 20:38",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<blockquote>\n<p>When the loader resolves the imports, then how does it know which\n  functions to look for?</p>\n</blockquote>\n<p>It parses the Import Table. For each entry, it parses the DLL name and associated function names and/or function ordinals.</p>\n<blockquote>\n<p>For some reason the IAT (FirstThunk) is magically filled with\n  addresses even before system load, not function names. Why is that?</p>\n</blockquote>\n<p>It's for <a href=\"http://msdn.microsoft.com/en-us/library/1080da4y.aspx\" rel=\"nofollow\">bound imports</a>. There's a good explanation of bound imports at the bottom of <a href=\"http://win32assembly.programminghorizon.com/pe-tut6.html\" rel=\"nofollow\">Iczelion's Tutorial 6: Import Table</a> in the Appendix.</p>\n<blockquote>\n<p>Who's to say the addresses won't change on a DLL update? Or on ASLR?</p>\n</blockquote>\n<p>They <em>will</em> very likely change, in which case the Windows loader will ignore the bound function addresses and replace those address in the IAT with the dynamically resolved function addresses at runtime.</p>\n<blockquote>\n<p>Why is there addresses in the IAT in the first place? Isn't it\n  supposed to point to the function names and be changed at runtime?</p>\n</blockquote>\n<p>No, the Import Table contains the function names; the Import Address Table contains function addresses.</p>\n</div>",
            "votes": "4",
            "user": "Jason Geffner",
            "time": "Nov 24, 2014 at 15:19",
            "is_accepted": true,
            "comments": []
        }
    ]
}