{
    "title": "Is it legal to publicly post about security issues without informing the provider first (in Europe)? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/6748/is-it-legal-to-publicly-post-about-security-issues-without-informing-the-provide",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<div>\n<aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n<div class=\"d-flex fd-column fw-nowrap\">\n<div class=\"d-flex fw-nowrap\">\n<div class=\"flex--item wmn0 fl1 lh-lg\">\n<div class=\"flex--item fl1 lh-lg\">\n<div>\n<b>Closed.</b> This question is <a href=\"/help/closed-questions\">off-topic</a>. It is not currently accepting answers.\n                                \n                            </div>\n</div>\n</div>\n</div>\n</div>\n<hr class=\"my12 outline-none baw0 bb bc-blue-400\"/>\n<div class=\"fw-nowrap fc-black-500\">\n<div class=\"d-flex fd-column lh-md\">\n<div class=\"mb0 d-flex\">\n<div class=\"flex--item mr8\">\n<svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\"><path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\"></path></svg>\n</div>\n<p> This question does not appear to be about reverse engineering within the scope defined in the <a href=\"https://reverseengineering.stackexchange.com/help/on-topic\">help center</a>.</p>\n</div>\n<div class=\"mb0 mt6 d-flex\">\n<p class=\"ml24 pl2\">Closed <span class=\"relativetime\" title=\"2014-12-02 07:23:31Z\">10 years ago</span>.</p>\n</div>\n<div class=\"ml24 pl2\">\n</div>\n</div>\n</div>\n<div class=\"mt24 d-flex gsx gs8\">\n<a class=\"s-btn s-btn__outlined flex--item js-post-notice-edit-post\" href=\"/posts/6748/edit\">\n                        Improve this question\n                    </a>\n</div>\n</aside>\n</div>\n<p>Do I have to contact the producer of a software before publicly posting (Twitter, Blog, ...) about security issues of it? Does it matter how this knowledge was acquired (reverse engineering, sniffing network traffic, trial &amp; error, ...)? I'm living in Europe (if it matters).</p>\n<p>What about posting exploits? Is there any law prohibiting an exploit with source code, so a security issue could be reproduced by anyone?</p>\n<p>I'm talking about general-purpose software like Smartphone apps or desktop applications.</p>\n</div>",
    "votes": "3",
    "answers": 2,
    "views": "539",
    "tags": [
        "law"
    ],
    "user": "muffel",
    "time": "10 years ago",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">This question appears to be off-topic because it is about law.</span>",
            "time": null
        },
        {
            "user": "perror",
            "text": "<span class=\"comment-copy\">@GuntramBlohm: Well, we had a discussion about that at the beginning of this site. And, finally, it seems to be okay to speak about the legal aspects of reverse-engineering here (if the question is focused enough). People have a lot of questions about the legal aspects of Reverse and a lot of beliefs about it (most of them are wrong, indeed). Trying to explain better all these mechanisms (as you did) should help. And, no, lawyers are not really better than technicians to answer this question (believe me!), most of them won't understand the question if it is stated with technical terms.</span>",
            "time": null
        },
        {
            "user": "Franck Dernoncourt",
            "text": "<span class=\"comment-copy\">You might be interested in this <a href=\"http://area51.stackexchange.com/proposals/67858/law?referrer=VbiBXJnq7T0Ioi5i8nXuKg2\">Law Stack Exchange proposal</a>  which is now in commitment phase.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The best and ethical thing to do in this situation would be to contact the producer of the software/system and provide them with examples that verify the security problem.  If you want to verify information was received, make contact via phone with recipient and send it via a secure verifiable method ( including  overnight express etc....) .  If it is indeed an  exploit this will allow vendor time to hopefully patch their system and get ahead of any attacks that would benefit from the release of said information.  If vendor is ethical and appreciative , they in turn should give you credit for the reporting the security error once they have mitigated the problem (assuming you want to be named).   </p>\n</div>",
            "votes": "0",
            "user": "Lou",
            "time": "Nov 30, 2014 at 19:50",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Short answer: don't ask us, ask a lawyer.</p>\n<p>Long answer: Noone, not even a lawyer, will be able to give you any sound advice without knowing the specifics of your situation, which include the country you live in. There's no European law that supersedes the law of each state, like Federal Law in the U.S. does, each country is responsible for turning EU directives into country law itself. Details may vary greatly between EU states.</p>\n<p>Even if you provided very specific details, we probably couldn't help you, because we're technicians, not lawyers. We can probably help you with producing an exploit; we can't tell you if and where it's legal to publish it.</p>\n<p>And even if some of us were lawyers: Imagine we tell you it's ok. You publish your exploit. You get arrested and sued because we were wrong. \"I asked some forum guys who seemed highly knowledgable about this\" won't help your case <em>at all</em>. If you get a written statement from a lawyer telling you what you're going to do is ok, and he's wrong, your chances are good you'll be able to make him (well, his insurance company) pay for your damages. You won't get anything from us.</p>\n</div>",
            "votes": "6",
            "user": "Guntram Blohm",
            "time": "Nov 30, 2014 at 13:28",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jörg W Mittag",
                    "text": "<span class=\"comment-copy\">Also, even if we <i>were</i> lawyers, depending on the specific jurisdiction, we might abstain from answering your question, because it might be construed as giving legal advice and thus making us liable for damages … and I'm not sure how our insurance companies might like such stupidity.</span>",
                    "time": null
                },
                {
                    "user": "Cybergibbons",
                    "text": "<span class=\"comment-copy\">I've not been able to find a solicitor/lawyer in the UK who is really willing to analyse, on a case-by-case basis, whether releasing security research is legal.  The problem is that the vast bulk of their work is with security companies contracted to work for other companies, not the lone researcher working without authorisation.</span>",
                    "time": null
                }
            ]
        }
    ]
}