{
    "title": "Is there a way to copy a flash drive's firmware?",
    "link": "https://reverseengineering.stackexchange.com/questions/6765/is-there-a-way-to-copy-a-flash-drives-firmware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm pretty new to this subject, but I read up on BadUSB and Psychson, and think that they are incredibly cool projects.  It got me thinking that I'd like to delve into the depths of USB and see where it takes me.  I bought a couple of drives from Amazon, and I'd like to know if there is an established way to copy the firmware, so that I can study, and hopefully reverse engineer it.  Are there tools I should know about?  Any tips would be great!</p>\n<p>Thanks</p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "1k",
    "tags": [
        "firmware",
        "usb"
    ],
    "user": "Kmanc",
    "time": "Dec 5, 2014 at 1:23",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I don't think that there is a \"one size fits all\" kind of firmware extraction from the drive which will work with any drive. Otherwise firmware updating could have a standard interface across all makers.</p>\n<p>I am not even sure that many drives will support this feature, since customers do not REALLY need it and developers should have access to the binaries/source. You might want to take a look at the AHCI specification</p>\n<p>What you could do instead is check the drive manufacturer for firmware updates then work with those binaries</p>\n</div>",
            "votes": "2",
            "user": "Eric",
            "time": "Dec 8, 2014 at 0:36",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Kmanc",
                    "text": "<span class=\"comment-copy\">I guess I probably should have specified that I'm working with the Phison 2307, which should be workable (to my knowledge).  Thanks for the advice though!</span>",
                    "time": null
                }
            ]
        }
    ]
}