{
    "title": "Change a text in DOS executables [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/6776/change-a-text-in-dos-executables",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<div>\n<aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n<div class=\"d-flex fd-column fw-nowrap\">\n<div class=\"d-flex fw-nowrap\">\n<div class=\"flex--item wmn0 fl1 lh-lg\">\n<div class=\"flex--item fl1 lh-lg\">\n<div>\n<b>Closed.</b> This question is <a href=\"/help/closed-questions\">off-topic</a>. It is not currently accepting answers.\n                                \n                            </div>\n</div>\n</div>\n</div>\n</div>\n<hr class=\"my12 outline-none baw0 bb bc-blue-400\"/>\n<div class=\"fw-nowrap fc-black-500\">\n<div class=\"d-flex fd-column lh-md\">\n<div class=\"mb0 d-flex\">\n<div class=\"flex--item mr8\">\n<svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\"><path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\"></path></svg>\n</div>\n<p> Questions asking for help <b>reverse-engineering a specific system</b> are off-topic unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem.</p>\n</div>\n<div class=\"mb0 mt6 d-flex\">\n<p class=\"ml24 pl2\">Closed <span class=\"relativetime\" title=\"2014-12-07 23:36:25Z\">10 years ago</span>.</p>\n</div>\n<div class=\"ml24 pl2\">\n</div>\n</div>\n</div>\n<div class=\"mt24 d-flex gsx gs8\">\n<a class=\"s-btn s-btn__outlined flex--item js-post-notice-edit-post\" href=\"/posts/6776/edit\">\n                        Improve this question\n                    </a>\n</div>\n</aside>\n</div>\n<p>We have a DOS executable program like to <a href=\"https://en.wikipedia.org/wiki/Norton_Commander\" rel=\"nofollow\">NC</a>. How do we find and change a text or a ASCII art in it?</p>\n<p>I'm a newbie in reverse.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "dos"
    ],
    "user": "ali",
    "time": "10 years ago",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">Hexdump it, disassemble it, find the text, change it. Your question is way too unspecific to be answered well.</span>",
            "time": null
        },
        {
            "user": "ali",
            "text": "<span class=\"comment-copy\">Which tool can help me? IDA Pro DOSBox Plugin? <a href=\"http://reverseengineering.stackexchange.com/questions/3766/dos-program-debug-in-ida?rq=1\">This Answer?</a></span>",
            "time": null
        },
        {
            "user": "Spektre",
            "text": "<span class=\"comment-copy\">@ali. some compilers have decompilers I saw borland TP7/TCPP versions that make the source code in Pascall/C++ but only for programs compiled by them of coarse. also forget about variable/function names they where auto-generated. for asm I thing NASM has also some disassembler in the full package but I could be wrong haven't use it in a looooong time</span>",
            "time": null
        },
        {
            "user": "ali",
            "text": "<span class=\"comment-copy\">Thank you <a href=\"http://reverseengineering.stackexchange.com/users/4709/spektre\">@Spektre</a> :)</span>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">Note that it's ok to ask about a specific system, as long as it's a 'i came this far, i'm stuck now' kind of question. The problem i have with this post is the <i>unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem</i> part. The question could mean anything from \"are there any tools that will let me modify dos executables\" to \"how do i find a text string in an executable if my hex editor doesn't find it\" to \"how do i handle packed DOS executable\". This makes it hard to know what the OP expects and what kind of answer would actually help him.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><strong>Tools</strong></p>\n<p>Any hex editor will do. Under <strong>DOS</strong> both NC and VC have their own which are enough. Very good <strong>DOS</strong> tool is HIEW (hex editor + x86 dissasembler).</p>\n<p><strong>what to do</strong></p>\n<ol>\n<li><p><strong>determine the executable form</strong></p>\n<p>open it as text/hex and if no program string are present then they are in different file or the file is packed/encrypted. Some executables are packet by <strong>PKLITE</strong> tools so unpack them. If file is encrypted you have to try to decrypt it first.</p></li>\n<li><p><strong>find the text you want to change</strong></p></li>\n<li><p><strong>edit the text</strong></p>\n<p>The string size must stay the same !!! If program uses any kind of <strong>CRC</strong> then you have to override the call by <code>nop/jump</code> or change the comparison values to the new <strong>CRC</strong></p></li>\n<li><p><strong>that should be all but</strong></p>\n<p>If the program uses those texts in specific ways then some thing can be broken like search for specific character/pattern in string to do some crazy effect etc. So if the edit is bugged return to original executable and try to edit string one by one ... to detect which strings will broke the exe. After that just leave those as are and edit the rest to what you need</p></li>\n<li><p><strong>if all fails</strong></p>\n<p>Then write TSR launcher for your program (terminate and stay program) that will change the text screens for you. In DOS there are no access violations so you can do anything...</p>\n<p>For example:</p>\n<ol>\n<li><p><strong>detect the actual screen the program is presenting</strong></p>\n<p>Text mode <strong>VideoRAM</strong> is at <code>B800:0000h</code>  if my memory serves well Each character is represented by <code>2</code> BYTEs (one is ASCII and one is color attributes). Standard text-mode used in <strong>DOS</strong> is <code>80x25</code> characters so read the specific positions of screen and detect strings that match each page of program.</p></li>\n<li><p><strong>if page detected</strong></p>\n<p>Then rewrite it by your new page (can flicker a bit)</p></li>\n<li><p><strong>continue this scanning in some timer</strong> ... (PIT interrupt or keyboard interrupt)</p></li>\n<li><p><strong>you can combine this with keyboard keystrokes detection</strong></p>\n<p>This way you know if you hit <strong>F1</strong> then page <strong>F1</strong> will occur etc. This can be used for hard to detect pages (have no title).</p></li>\n</ol></li>\n</ol>\n<p><strong>Windows</strong></p>\n<p>You could write window App that will present the DOS program. Just you need to pass mouse movement and keyboard events to the DOS program (which can be run as hidden process) and present the (invisible) DOS screen in your Window. In Windows use <strong>DLPORTIO</strong> driver or any other way to get <strong>Kernel mode</strong> access rights so you can actually read / access the <strong>DOS VRAM</strong> or access the <strong>commandline</strong> or <strong>DOSbox backbuffer</strong> by <strong>WinAPI</strong> in <strong>gfx</strong>. Decode it back to text (the font is usually fixed so that should be easy enough) and recode it to your new texts and present back in your window App.</p>\n<p><strong>[Notes]</strong></p>\n<p>Graphical DOS program means it uses graphic video mode instead of Text mode. NC is example of Text mode program not graphical !!! Some Text mode based Apps use different text modes so you should detect actual text mode resolution. I think some call to EGA/VGA BIOS <code>int 13h</code> should do the trick or you can hook up the entire interrupt for this. If you got aligned lines and table borders then that can be also used for resolution detection. You should do this once in a while because resolution can change during operation for example try <strong>ALT+F9</strong> in <strong>VC</strong>.</p>\n</div>",
            "votes": "6",
            "user": "Spektre",
            "time": "Jan 9, 2016 at 9:48",
            "is_accepted": true,
            "comments": []
        }
    ]
}