{
    "title": "IDA Pro: How can I set memory breakpoint on field of structure?",
    "link": "https://reverseengineering.stackexchange.com/questions/6782/ida-pro-how-can-i-set-memory-breakpoint-on-field-of-structure",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>How can I set memory breakpoint on field of structure ?</p>\n<p>Currently if I mapped structure to memory region it uses starting address of structure as address of all fields. See screenshow</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/d6dt6.png\"/></p>\n<p>As result I cannot quickly add breakpoint to field <code>isHandshakeReceived</code>. I'd need to manually calculate its address.</p>\n<p>Is there easier method ?</p>\n</div>",
    "votes": "3",
    "answers": 2,
    "views": "2k",
    "tags": [
        "ida"
    ],
    "user": "expert",
    "time": "Dec 7, 2014 at 22:49",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Like most input fields in IDA, the breakpoint dialogue's Location field accepts expressions like </p>\n<pre><code>eax + GetMemberOffset(GetStrucIdByName(\"foo_t\"), \"isHandshakeReceived\")\n</code></pre>\n<p>I have no idea why IDA doesn't accept <code>0x376e5f0 + foo_t.isHandshakeReceived</code>... Anyway, being able to enter expressions is very useful and it can save a lot of hassle.</p>\n<p>The erroneous address display is a result of the simplistic way in which IDA manages things internally. Basically, everything contained in a struct or array belongs to its starting address ('head'), and if the display is continued over multiple lines then IDA simply reprints the starting address instead of the correct address. It's a bit annoying but that's the way IDA works.</p>\n<p>P.S.: perhaps it would be worth it to file a defect report or post in IDA's bug forum; after all, the displayed addresses are definitely wrong. I wouldn't hold my breath but who knows...</p>\n</div>",
            "votes": "1",
            "user": "DarthGizka",
            "time": "Jan 7, 2015 at 6:25",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>To the best of my knowledge IDA can't go through and automatically identify</p>\n<p>Use DbgHook in the following way:</p>\n<pre><code>class DbgHook(DBG_Hooks):\n... snip ...\ndebugger = DbgHook()\ndebugger.hook()\n</code></pre>\n<p>Using this class will require you to implement the <code>def dbg_bpt(self,tid,ea)</code> callback. This call back is called when a breakpoint is hit in your code. From there you can set a breakpoint on the instruction where the base address of the structure is moved into a register. You can get the value of that register in your code using the following:</p>\n<pre><code>from idc import *\nstructAddr = idc.GetRegValue('EAX')\n</code></pre>\n<p>In your dbg_bpt callback you can calculate the offset inside the structure and set an access breakpoint on that address using <code>SetBptAttr(address, bptattr, value)</code> where address is the address of the member (calculated off of the register) and value is <code>BPT_RDWR</code>.</p>\n<p><a href=\"https://www.hex-rays.com/products/ida/support/idapython_docs/\" rel=\"nofollow\">Here</a> is the IDA Python API documentation and <a href=\"https://github.com/deresz/funcap\" rel=\"nofollow\">here</a> is a good sample project implementing debugger callbacks.</p>\n</div>",
            "votes": "0",
            "user": "Fewmitz",
            "time": "Dec 8, 2014 at 4:02",
            "is_accepted": false,
            "comments": []
        }
    ]
}