{
    "title": "Call Eax in IDA PRO",
    "link": "https://reverseengineering.stackexchange.com/questions/6870/call-eax-in-ida-pro",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>My situation: </p>\n<p>I analyze some piece of code and I have the following line:</p>\n<pre><code>         ...\n         call eax\n         ...\n</code></pre>\n<p>I am using IDA PRO. My problem is that I can not go to the place where eax points. I mean: normally, I have something like </p>\n<pre><code>        ...\n        call sub_xxxxxx\n        ...\n</code></pre>\n<p>and when I click on sub_xxxxxx, then IDA PRO shows me the code at sub_xxxxxx. Sometimes, there is also an offset. \nBut now, I have that register, and when I click on that then IDA PRO is not going to that location. It opens a window where I can rename the register. \nI guess, IDA does not know where to go or something like that.</p>\n<p>I also try to open it with ollydbg, but since the file is a .bin file, I could not open it(in the search window, before opening, the .bin file was not listed) </p>\n<p>How can I handle that problem ?</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "assembly"
    ],
    "user": "user3097712",
    "time": "Dec 16, 2015 at 17:06",
    "comments": [
        {
            "user": "gandolf",
            "text": "<span class=\"comment-copy\">To address the Olly issue, you could just rename the bin file to .exe so Olly sees it.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You would need to statically determine what the value(s) of <code>eax</code> could be by statically reverse engineering the surrounding code, or (if you can run the target in a debugger) set a breakpoint on that <code>call eax</code> instruction and see what value of <code>eax</code> is used at runtime.</p>\n<p>Note that for the dynamic approach, different runtime scenarios may cause <code>eax</code> to hold different values at that instruction address at runtime.</p>\n</div>",
            "votes": "5",
            "user": "Jason Geffner",
            "time": "Dec 21, 2014 at 22:34",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user3097712",
                    "text": "<span class=\"comment-copy\">ok, thx. Is there a way to open the .bin file using ollydbg?</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">If the .bin file is actually a PE EXE or PE DLL, then yes. Just manually specify the full file path of the file in OllyDbg's open-file dialog box. Or drag-and-drop the file into OllyDbg's MDI client window.</span>",
                    "time": null
                }
            ]
        }
    ]
}