{
    "title": "How can one debug a program that can only be started by other processes?",
    "link": "https://reverseengineering.stackexchange.com/questions/6917/how-can-one-debug-a-program-that-can-only-be-started-by-other-processes",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am now trying to figure out the innards of a custom made program that I've found difficult to debug using a debugger.</p>\n<p>The program starts by using a bash script wrapper to process input parameters, and then execute an encrypted perl script, which somehow starts another process which is a binary executable and cannot be started independently(even if I add all the parameters as seen using ps au when it is running normally, it still says some .so file is missing). </p>\n<p>Now suppose one wants to debug this binary using something like IDA, how do you set it up? Take IDA as an example, in the \"process option\" I have used the bash wrapper in \"App path\", the binary as \"input file path\", and it turns out the debugger would not go into the binary's space, and just stays in the exceptions inside glibc library and none of the breakpoints set in the binary would be reached. (However the program was running fine, just that debugger cannot go inside.) </p>\n<p>Any thoughts about what is happening and the right way of doing it?</p>\n</div>",
    "votes": "2",
    "answers": 0,
    "views": "191",
    "tags": [
        "linux",
        "debugging",
        "anti-debugging",
        "multi-process",
        "process"
    ],
    "user": "Disenchanted Toad",
    "time": "Dec 29, 2014 at 5:24",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">\"(even if I add all the parameters as seen using ps au when it is running normally, it still says some .so file is missing)\" probably means the starter script messes around with <code>LD_LIBRARY_PATH</code>, <code>LD_PRELOAD</code> or something similar. The first thing i'd try to do is <code>strace -f -s 9999 &lt;bash_script&gt;</code> and maybe add <code>-v execve</code> to see the parameters and environment when the binary process gets started.</span>",
            "time": null
        },
        {
            "user": "Disenchanted Toad",
            "text": "<span class=\"comment-copy\">Thanks, this is quite helpful. It was indeed some LD_ related problem.</span>",
            "time": null
        }
    ],
    "answers_data": []
}