{
    "title": "Decompile injected SWF in a specific environment",
    "link": "https://reverseengineering.stackexchange.com/questions/6943/decompile-injected-swf-in-a-specific-environment",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to reverse a swf file that is loaded into a AS3 application and executed by that application. The problem is that the injected file is obfuscated and no decompiler could manage to show me a clear code. Further more, while using <a href=\"http://www.swfwire.com/debugger\" rel=\"nofollow\">SWFWire Debugger</a>, which did its job, I found out that the loaded swf was checking the environment in which it was executed. Therefore when loaded by SWFWire Debugger it redirects me to a stub making the swf crash itself.</p>\n<p>Therefore, i tried to recreate the environment in which the swf was executed by creating a AS app and loaded it through a <a href=\"http://helpx.adobe.com/flash/kb/load-external-swf-swf.html#main_Using_the_ActionScript_3_0_Loader_class\" rel=\"nofollow\">Loader</a>. It work well and the injected file did not crash which lets me think that the stub function was not called, but i am still not exactly sure of what are the actions performed to the app by this injected file so i was wondering how could i debug the injected swf like in SWFWire Debugger, but keeping all the AS environment that i recreated so that the debug would not lead me again to a stub.</p>\n<p>I am not sure that my explanations are very clear,\nif you want any further details or just to clarify the situation let me know.</p>\n<p><em>Note: The app is using Action Script 3</em></p>\n<p>Edit: Also found out that the injected swf makes itself crash when it detected that it's bytecode was modified. The problem is that SWFWire Debugger modifies the bytecode of what one is trying to debug to add trace all around the code. Therefore, as the injected swf's bytecode is modified it will make itself crash when debugged.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "835",
    "tags": [
        "anti-debugging",
        "swf"
    ],
    "user": "Abricot",
    "time": "Jan 4, 2015 at 10:23",
    "comments": [
        {
            "user": "MrSynAckSter",
            "text": "<span class=\"comment-copy\">Have you tried <a href=\"http://www.swftools.org/swfdump.html\" rel=\"nofollow noreferrer\">swftools.org/swfdump.html</a>? Also, in what way is the file obfuscated?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>This doesn't answer your question, however I will try to provide ideas for workarounds (can't leave them in a comment as I don't have enough reputation points):</p>\n<ul>\n<li>Have you tried debugging the external swf file that loads the one you want to reverse? This way it won't crash itself and you will still have a debugging session available.</li>\n<li>Since you state that \"you are still not exactly sure of what are the actions performed to the app by the injected file\", why don't you decompile the \"loader\" swf, find the position in the code where the injection is done, and based on the handle given to the new swf, find all references/function calls from the parent to the injected and from there tracing back (in static code analysis) to find when the new file is used. This might give you very useful insights.</li>\n<li>Also, let me provide you with some swf decompilers that I have experience with and in the vast majority of the time manage to perform correct decompilation (usually if one fails another may succeed):\n<ul>\n<li><a href=\"http://www.sothink.com/product/flashdecompiler/\" rel=\"nofollow\">Sothink SF Decompiler</a></li>\n<li><a href=\"http://www.flash-decompiler.com/\" rel=\"nofollow\">Trillix Flash Decompiler</a></li>\n<li>Show My Code Online Decoder / Decompiler (give it a search because again due to reputation I can't post a third link)</li>\n</ul></li>\n</ul>\n</div>",
            "votes": "1",
            "user": "The Dart Code",
            "time": "Jan 13, 2015 at 15:35",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Abricot",
                    "text": "<span class=\"comment-copy\">Thanks for your reply! When I say that i am not exactly sure of what is done by the loaded swf i only meant that there are some obfuscated operations that are made in a loop changing the values of some variables in memory used by the loader (main app) and my goal is to obviously discover what is doing the loop. Concerning your decompilers, i already tried Sothink and Show my code which did not give any interesting results. I will be trying trillix soon. Thanks.</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">@Abricot: Don't forget to mark the answer as 'correct' if it fit your question and scoring a good answer is also nice.</span>",
                    "time": null
                }
            ]
        }
    ]
}