{
    "title": "Intercept serial check",
    "link": "https://reverseengineering.stackexchange.com/questions/6967/intercept-serial-check",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've been playing around with RE for a bit now and a friend sent over a crackme. I figured mise well try and crack it. </p>\n<p>The first thing I did was to put the executable into <code>Exeinfo PE</code> and there was nothing special there. So next I loaded the DLL into there and it came up with <code>PEcompact ver.1.41 - v1.84</code> and it said to unpack it.</p>\n<p>So I found an unpacker called <code>GUnPacker</code> loaded it in there and it gave me <code>Address : &lt;0x0041E738&gt; ---- Is OEP(FOEP) Possibly...</code> Not sure what to do with this since I am fairly new to the whole DLL being packed.</p>\n<p>When you load the exe it gives me a ID #:<code>00FF-7514-B10D</code> and then it asks for a serial. I loaded the DLL into <code>dllexp</code> and there is a function named <code>GetSerial</code>. </p>\n<p>Also I believe it is a VB6 exe.</p>\n<p>Is there any way to intercept that or something so that when I debug the program I can break when it is called and retrieve the serial?</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ollydbg",
        "dll"
    ],
    "user": "NotSoPro",
    "time": "Jan 6, 2015 at 7:28",
    "comments": [
        {
            "user": "PhoeniX",
            "text": "<span class=\"comment-copy\">If you are in the study phase, I would suggest to leave all unpackers aside and go dirty, otherwise you will end up as another <code>code monkey</code>. Why do you believe its VB6?</span>",
            "time": null
        },
        {
            "user": "NotSoPro",
            "text": "<span class=\"comment-copy\">Ok sounds like a plan. And Exeinfo PE says that its <code>MS Visual Basic 5.0-6.0</code> so I opened it with VB Decompiler and it opens fine. Other than that I'll take your word and go through those links.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Your question is too broad and it looks that you lack basics in the RCE in general. I would suggest to start with some theory :</p>\n<ul>\n<li><a href=\"http://rads.stackoverflow.com/amzn/click/0764574817\" rel=\"nofollow\">Reversing: Secrets of Reverse Engineering</a> - nice book for an intro</li>\n<li><a href=\"http://www.woodmann.com/collaborative/knowledge/index.php/Category:RCE_Knowledge\" rel=\"nofollow\">Collaborative RCE Knowledge Library</a> - dig here deep and you find your gold</li>\n</ul>\n<p>in addition try some easy ones from:</p>\n<ul>\n<li><a href=\"http://www.crackmes.de\" rel=\"nofollow\">Crack me collection</a></li>\n</ul>\n<p>and in parallel go over first tuts here:</p>\n<ul>\n<li><a href=\"https://tuts4you.com/download.php?list.17\" rel=\"nofollow\">Lenas Reversing for Newbies</a> - some will say that they are not so good, but you know...</li>\n</ul>\n<p>I think this will give you an answer for the question. Other then this, try to ask the above in amore specific way as we do not have the binary to really pin-point you what to do.</p>\n<p>Have fun.</p>\n</div>",
            "votes": "1",
            "user": "PhoeniX",
            "time": "Jan 6, 2015 at 7:25",
            "is_accepted": false,
            "comments": []
        }
    ]
}