{
    "title": "Are there any open source test suites for testing how well a disassembler performs?",
    "link": "https://reverseengineering.stackexchange.com/questions/74/are-there-any-open-source-test-suites-for-testing-how-well-a-disassembler-perfor",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>A key tool in reverse engineering is a good disassembler, so to ensure that a disassembler is performing properly, are there any good test suites available for use to test the correctness of a disassembler?  Are these architecture specific, or can they be configured to work across multiple object architectures?  A good test should include checking the more obscure architecture instructions and malformed portable execution files.</p>\n<p>Here is <a href=\"http://sourceware.org/cgi-bin/cvsweb.cgi/src/gas/testsuite/gas/i386/?cvsroot=src\">one specifically for i86</a> that I have seen.  Are there any that are modular across architectures?</p>\n</div>",
    "votes": "16",
    "answers": 5,
    "views": "1k",
    "tags": [
        "tools",
        "disassembly"
    ],
    "user": "WilliamKF",
    "time": "Mar 20, 2013 at 18:30",
    "comments": [
        {
            "user": "Andrew",
            "text": "<span class=\"comment-copy\">When you say \"correctness of a disassembler\", do you mean correctness of an instruction decoder, or, do you mean correct control flow graph recovery and other kinds of high-level semantic information?</span>",
            "time": null
        },
        {
            "user": "WilliamKF",
            "text": "<span class=\"comment-copy\">Well, which is the more interesting question?  I'm guessing the later, correct flow graph recovery...</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There is a paper called \"<a href=\"http://roberto.greyhats.it/pubs/issta10-nversion.pdf\" rel=\"nofollow\">N-version Disassembly: Differential Testing of x86 Disassemblers</a>\" (PDF) by  Roberto Paleari, Lorenzo Martignoni, Giampaolo Fresi Roglia, and Danilo Bruschi which compares several x86 disassemblers in a formal fashion.</p>\n<p>To quote the papers abstract:</p>\n<blockquote>\n<p>The output of a disassembler is used for many different purposes\n  (e.g., debugging and reverse engineering). Therefore, disassemblers\n  represent the ﬁrst link of a long chain of stages on which any\n  high-level analysis of machine code depends upon. In this paper we\n  demonstrate that many disassemblers fail to decode certain\n  instructions and thus that the ﬁrst link of the chain is very weak. We\n  present a methodology, called N-version disassembly, to verify the\n  correctness of disassemblers, based on differential analysis</p>\n</blockquote>\n<p>Not sure if this is slightly off topic to your question but may be of interest to you.</p>\n</div>",
            "votes": "14",
            "user": "Ruslan",
            "time": "Aug 24, 2015 at 14:17",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Andrew",
                    "text": "<span class=\"comment-copy\">Interesting paper! Not a wholly surprising conclusion. Godefroid and Taly have an MSR TR (<a href=\"http://research.microsoft.com/apps/pubs/default.aspx?id=156020\" rel=\"nofollow noreferrer\">research.microsoft.com/apps/pubs/default.aspx?id=156020</a>) where they automate instruction synthesis and discovered errors in their manually specified semantics.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>In a lot of papers I've read, decompilation tool authors use the <a href=\"http://www.spec.org/benchmarks.html\">SPEC benchmarks</a> to measure the effectiveness of their decompiler. This produces kind of a holistic view of how well the system works, from instruction decoding to control flow recovery. Those benchmarks aren't free or open source though. </p>\n<p>The GCC and clang compilers also ship with benchmarks for testing. Those might be worth investigating.</p>\n<p>Also, Regehr's <a href=\"https://github.com/csmith-project/csmith\">csmith</a> project can generate arbitrary C programs for compiler testing/fuzzing. This could be useful for testing decompilers and binary analysis systems?</p>\n</div>",
            "votes": "8",
            "user": "Andrew",
            "time": "Mar 20, 2013 at 16:37",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">FWIW we do use <code>cmith</code> for testing the Hex-Rays decompiler, and it does help.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The gas testcase suite that you link to is not only for i386.  The <a href=\"http://sourceware.org/git/?p=binutils.git;a=tree;f=gas/testsuite/gas;hb=HEAD\" rel=\"nofollow\">parent directory</a> contains test cases for x86-64, arm, alpha, and many other architectures.</p>\n</div>",
            "votes": "6",
            "user": "Janus Troelsen",
            "time": "May 2, 2013 at 4:47",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I made a <a href=\"https://code.google.com/p/corkami/source/browse/trunk/wip/MakePE/examples/asm/opcodes32.asm?r=1569\" rel=\"nofollow\">file</a> containing all x86 opcodes (at the time) and many encoding forms, that helped me to actively find many bugs in many disassemblers (IDA, Hiew, BeaEngine, OllyDbg, XED, hte...), particularly lesser known forms and undocumented ones.</p>\n<p>(slightly off-topic maybe - not a ready-made test suite)</p>\n</div>",
            "votes": "5",
            "user": "Ange",
            "time": "Mar 22, 2013 at 13:51",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Janus Troelsen",
                    "text": "<span class=\"comment-copy\">Did you file bugs for all of them? Did they get fixed?</span>",
                    "time": null
                },
                {
                    "user": "Ange",
                    "text": "<span class=\"comment-copy\">I did, they were.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The <a href=\"http://radare.org\" rel=\"nofollow\">radare2</a> project uses an extensive <a href=\"https://github.com/radare/radare2-regressions/tree/master/t.asm\" rel=\"nofollow\">test-suite</a> for each of its disassembler engine, along with more specific tests, like <a href=\"https://github.com/radare/radare2-regressions/tree/master/t.formats\" rel=\"nofollow\">formats</a>, its own <a href=\"https://github.com/radare/radare2-regressions/tree/master/t.anal\" rel=\"nofollow\">analysis capabilities</a>, …</p>\n</div>",
            "votes": "2",
            "user": "jvoisin",
            "time": "Aug 24, 2015 at 19:05",
            "is_accepted": false,
            "comments": []
        }
    ]
}