{
    "title": "Unload plugin without closing the .IDB?",
    "link": "https://reverseengineering.stackexchange.com/questions/7977/unload-plugin-without-closing-the-idb",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>IDC has a RunPlugin() function but there seems to be no way to unload a plugin explicitly. I searched high and wide - including the Hex-Rays forums - but found no answers. And judging by <a href=\"https://www.hex-rays.com/forum/viewtopic.php?p=9051#p9051\" rel=\"nofollow\">this post</a> I'm not the only one.</p>\n<p>At the moment I'm trying to figure out how certain SDK functions work, by adding some test code to a plugin and loading it into IDA. If I use <code>PLUGIN_KEEP</code> then I can experiment by calling my functions from the IDC prompt, but I have to close the database to unload the plugin. If I use <code>PLUGIN_UNL</code> then I effectively have only one function with a single integer parameter, which severely restricts experimentation...</p>\n<p>Currently I'm working around that by having <code>PLUGIN_KEEP</code> set upon load but patching <code>PLUGIN_UNL</code> into <code>PLUGIN.flags</code> if the plugin's run function is called with parameter 666, or if the parameter is 0 and this isn't the first call to the run function. The latter is convenient because it allows loading/unloading with a single hotkey, without farting around with the command prompt. The plugin gets loaded automatically when an .IDB is opened, and then it can be unloaded and reloaded freely via the hotkey configured in <code>PLUGIN.wanted_hotkey</code>.</p>\n<p>However, overall it seems a rather hackish approach relying on undocumented functionality. Is there a better/cleaner way of unloading a plugin, or are there caveats that I should be aware of?</p>\n</div>",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "ida-plugin",
        "idapro-sdk"
    ],
    "user": "DarthGizka",
    "time": "Jan 8, 2015 at 11:48",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<span class=\"comment-copy\">Some further hints can be found <a href=\"https://hex-rays.com/blog/what-is-qscripts/\" rel=\"nofollow noreferrer\">over on the Hex-Rays blog</a>.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<blockquote>\n<p>Currently I'm working around that by having PLUGIN_KEEP set upon load\n  but patching PLUGIN_UNL into PLUGIN.flags</p>\n</blockquote>\n<p>This is not a \"workaround\" but actually a documented way to have IDA unload your plugin.</p>\n<pre><code>#define PLUGIN_UNL  0x0008      ///&lt; Unload the plugin immediately after calling 'run'.\n                                ///&lt; This flag may be set anytime.\n                                ///&lt; The kernel checks it after each call to 'run'\n                                ///&lt; The main purpose of this flag is to ease\n                                ///&lt; the debugging of new plugins.\n</code></pre>\n</div>",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Jan 8, 2015 at 11:44",
            "is_accepted": true,
            "comments": []
        }
    ]
}