{
    "title": "large exe in ollydbg",
    "link": "https://reverseengineering.stackexchange.com/questions/7982/large-exe-in-ollydbg",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to debug an executable(PEID shows Visual Basic 5.0 - 6.0) using ollydbg v1.10. The exe is quiet big about 74 mb and olly is always crashing during the analysis process.</p>\n<p>I am on windows 7, 3 gigs of RAM and Intel Quad core Q6600.</p>\n<p>Tried Olly 2.0 as well as Ollydbg by The legend of Random also but the same thing happens.</p>\n<p>Are there any plugins that can handle the analysis process or is there something i need to do to make it work? Please suggest.</p>\n</div>",
    "votes": "0",
    "answers": 2,
    "views": "915",
    "tags": [
        "ollydbg",
        "executable",
        "visual-basic"
    ],
    "user": "Arunabh Ray",
    "time": "Jan 8, 2015 at 22:06",
    "comments": [
        {
            "user": "Filipe YaBa Polido",
            "text": "<span class=\"comment-copy\">Why OllyDbg? If you know it is compiled with VB, use a specific VB debugger/decompiler.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Large exe files are <em>primarily</em> due to large amounts of embedded data. Embedded data may mean binary resources and/or overlay. Large file sizes can also be due to <a href=\"https://kb.iu.edu/d/akqn\" rel=\"nofollow\">static linking</a>.</p>\n<p>If it is due to overlay then you may try to strip the overlay using any decent PE editor such as <em><a href=\"http://exeinfo.atwebpages.com/\" rel=\"nofollow\">exeinfo pe</a></em> and then try to load it in Ollydbg to do an analysis. However the exe will probably function differently with a missing overlay. </p>\n<p>The other and more probable reason for crashing may be due to an anti-debugging trick or a bug such as the fpu bug in Ollydbg v1. For that try to use a patched Ollydbg and there are plenty available.</p>\n</div>",
            "votes": "1",
            "user": "0xec",
            "time": "Jan 9, 2015 at 3:56",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>As u mentioned, olly crashes, probably it doesnt, but becayse the file is large olly takes some times and hangs for that time being, windows 7 shows the error message fir closing the olly or to wait, just hit wait application to respond, and there can also be an exploit which is crashing olly so check for that, and also if peid shiws its a vb app, iw ould first load it in vb decompiler, it gives a better result for visual basic applications after refrencing to it, debug it in olly.</p>\n</div>",
            "votes": "0",
            "user": "Alok Saini",
            "time": "Jan 14, 2015 at 14:52",
            "is_accepted": false,
            "comments": []
        }
    ]
}