{
    "title": "Java .class bytecode debugger",
    "link": "https://reverseengineering.stackexchange.com/questions/7991/java-class-bytecode-debugger",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>What is the good Java debugger for .class files, if no source code available? jdb is seems pretty weak :(\nI don't need to decompile .class, but I want to debug bytecode.</p>\n</div>",
    "votes": "12",
    "answers": 3,
    "views": "8k",
    "tags": [
        "java"
    ],
    "user": "Drop Drop",
    "time": "Jan 10, 2015 at 4:57",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<blockquote>\n<p><strong><a href=\"http://www.drgarbage.com/bytecode-visualizer/\" rel=\"noreferrer\">Bytecode Visualizer</a></strong>\n<br/>Inspect, understand and debug Java bytecode, no matter if you have the corresponding source.</p>\n</blockquote>\n<p><p></p>\n<blockquote>\n<p><strong><a href=\"https://github.com/nlfiedler/jswat\" rel=\"noreferrer\">JSwat Debugger</a></strong>\n<br/>JSwat is a graphical Java debugger front-end, written to use the Java Platform Debugger Architecture and based on the NetBeans Platform. Its features include sophisticated breakpoints; colorized source code display with code navigator; movable display panels showing threads, call stack, visible variables, and loaded classes; command interface for more advanced features; and Java-like expression evaluation, including method invocation.</p>\n</blockquote>\n<p><p></p>\n<blockquote>\n<p><strong><a href=\"http://sourceforge.net/projects/jbcd/\" rel=\"noreferrer\">Java ByteCode Debugger (JBCD)</a></strong>\n<br/>JBCD is an interactive debugger for Java bytecode. It allows a programmer to step through bytecode one statement at time. The tool is indended for people who are writing programs to generate or modify bytecode. JBCD can be used with any Java compiler</p>\n</blockquote>\n<p><p></p>\n<blockquote>\n<p><strong><a href=\"https://the.bytecode.club/pages.php?page=bytecode-viewer\" rel=\"noreferrer\">Bytecode Viewer</a></strong>\n<br/>Bytecode Viewer is a Java Bytecode Viewer, GUI Procyon Java Decompiler, GUI CFR Java Decompiler, GUI FernFlower Java\n  Decompiler, GUI Jar-Jar, Hex Viewer, Code Searcher, <strong>Debugger</strong> and more.\n  It's written completely in Java, and it's open sourced.</p>\n</blockquote>\n<p><p></p>\n<blockquote>\n<p><strong><a href=\"https://code.google.com/p/javasnoop/\" rel=\"noreferrer\">JavaSnoop</a></strong>\n<br/>A tool that lets you intercept methods, alter data and otherwise hack Java applications running on your computer.</p>\n</blockquote>\n<p><p></p>\n<blockquote>\n<p><strong><a href=\"http://andrei.gmxhome.de/bytecode/index.html\" rel=\"noreferrer\">Bytecode Outline</a></strong>\n<br/>Bytecode Outline plugin shows disassembled bytecode of current java editor or class file, allows bytecode/ASMifier code compare for java/class files and shows ASMifier code for current bytecode. It also allows to disassemble and <a href=\"http://andrei.gmxhome.de/bytecode/debugging.html\" rel=\"noreferrer\"><strong>debug classes</strong></a> without attached source code on any operating system where Eclipse is running.</p>\n</blockquote>\n<p><p></p>\n<p>Addendum: <a href=\"http://blog.crowdstrike.com/native-java-bytecode-debugging-without-source-code/\" rel=\"noreferrer\">This blog</a> from <em>Crowdstrike Inc.</em> will also be helpful</p>\n</p></p></p></p></p></p></div>",
            "votes": "14",
            "user": "0xec",
            "time": "May 10, 2015 at 3:38",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">Thanks for the blog link! I'll talk to our webmaster to see if he can fix the broken images.</span>",
                    "time": null
                },
                {
                    "user": "Victor Grazi",
                    "text": "<span class=\"comment-copy\">Just a note to say that your first offering, Bytecode Visualizer, does not show you the stack or variable table, which is kind of a major limitation. I take it from your description that JSwat does, but that seems to be discontinued.</span>",
                    "time": null
                },
                {
                    "user": "got trolled too much this week",
                    "text": "<span class=\"comment-copy\">Most of these are far too old to be useful. The Dr. Garbage stuff doesn't work in recent Eclipses etc. JBCD is from  2003 and was probably useless even you wrote this answer, except for Java 2 or something that ancient.</span>",
                    "time": null
                },
                {
                    "user": "got trolled too much this week",
                    "text": "<span class=\"comment-copy\">And Bytecode Viewer, which is still maintained, might claim it's a \"Debugger\", but it isn't.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Possibly the best disassembler &amp; assembler is <a href=\"https://github.com/Storyyeller/Krakatau\" rel=\"nofollow noreferrer\">Krakatau</a>. It's written in python. Bytecode viewer has built-in Krakatau, but it sometimes can't perform as expected.</p>\n<p>Another one is <a href=\"http://dirty-joe.com/\" rel=\"nofollow noreferrer\">dirtyjoe</a> which is also a great tool.</p>\n</div>",
            "votes": "1",
            "user": "sks15",
            "time": "Jun 4, 2018 at 10:50",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The real answer as of mid-2024 is <a href=\"https://mrt4ntr4.github.io/Noverify-Java-Crackme-3/\" rel=\"nofollow noreferrer\">this</a>:</p>\n<blockquote>\n<p>Also I asked Col-E(Recaf’s Developer) about any good bytecode debuggers and unfortunately, <strong>it turns out there aren’t any as of now!</strong></p>\n</blockquote>\n<p>The Bytecode Visualizer doesn't run in any Eclipse from the past 9 years or so. The other tools (except JSwat) from the top-voted answer aren't actually debuggers (even though some claim that in their description.) JSwat probably never had byte-code level stepping based on its more detail description (on github) and has also been dead for 10+ years.</p>\n<p>Your best bet: use jdb (with <code>step</code>) and watch the <code>bci</code> (byte code instruction) counter, while having the disassembled file on the side.</p>\n<p>If you wonder what Recaf is: a perhaps better version of Bytecode Viewer, but still not a debugger. These two are static analyzers that let you search for strings, method/field site calls etc. Recaf lets you also modify bytecode and reassemble. (Sometimes the result is broken though, esp. with newer features like INVOKEDYNAMIC.)</p>\n<p>And if you want to try your hand at dynamic instrumentation, btrace is a modern/supported tool and can run in unsafe mode, in which it can modify stuff. Ibid Byte Buddy. Neither is a debugger as such though. They substitute for the defunct JavaSnoop though (but are not 'zero-conf' unlike that thingy). Both of these [as did JavaSnoop] use the Java agent interface, not the debugging API.</p>\n<p>Now to be slightly more pedantic on the last point, Oracle/Sun did unify the APIs under one umbrella of JVMTI, so the <a href=\"https://docs.oracle.com/javase/8/docs/platform/jvmti/jvmti.html#SingleStep\" rel=\"nofollow noreferrer\">step function</a> and the bytecode <a href=\"https://docs.oracle.com/javase/8/docs/platform/jvmti/jvmti.html#RetransformClasses\" rel=\"nofollow noreferrer\">retransform</a> are in the same thingy, but generally tools that use one don't use the other and vice-versa.</p>\n</div>",
            "votes": "0",
            "user": "got trolled too much this week",
            "time": "Jun 27, 2024 at 13:11",
            "is_accepted": false,
            "comments": []
        }
    ]
}