{
    "title": "SHA + Mersenne Twister",
    "link": "https://reverseengineering.stackexchange.com/questions/8029/sha-mersenne-twister",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm trying to decrypt some audio files. At first I thought that they were encrypted using Blowfish, but apparently \"SHA + Mersenne Twister used for generate key and decrypt\". What exactly does this mean? I know that SHA is a hashing algorithm and that Mersenne Twister is a PRNG but I don't really know what that statement means or what to do.</p>\n<p>If someone could shed even a little bit of light on what this might mean that would be helpful.</p>\n</div>",
    "votes": "2",
    "answers": 2,
    "views": "659",
    "tags": [
        "encryption",
        "hash-functions"
    ],
    "user": "puggsoy",
    "time": "Jan 16, 2015 at 6:53",
    "comments": [
        {
            "user": "Henno Brandsma",
            "text": "<span class=\"comment-copy\">You cannot really say without looking into the binary. So what binary is used?</span>",
            "time": null
        },
        {
            "user": "puggsoy",
            "text": "<span class=\"comment-copy\">It's from the game BattleBlock Theater. I uploaded the executable here: <a href=\"http://zenhax.com/viewtopic.php?p=2564#p2564\" rel=\"nofollow noreferrer\">zenhax.com/viewtopic.php?p=2564#p2564</a> Unless you something else?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It looks like someone has written code to decrypt these files.</p>\n<p>You can see the details of the implementation here: <a href=\"https://github.com/magcius/bbtucrypt/\" rel=\"nofollow\">bbtucrypt</a></p>\n</div>",
            "votes": "1",
            "user": "booto",
            "time": "Mar 20, 2015 at 5:22",
            "is_accepted": true,
            "comments": [
                {
                    "user": "puggsoy",
                    "text": "<span class=\"comment-copy\">Oh my goodness thank you!! The BattleBlock Theater WMA files are exactly the files in question. I don't know how I didn't find this myself. Once again thank you so much for telling me :)</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>(I had this as a comment initially, but upon thinking about it more, I believe that it is the actual answer).</p>\n<p>The output of the Mersenne Twister can be used as the key for decryption. The result of the decryption attempt is hashed using SHA. The hash is compared to a predetermined hash value, in order to determine if the decryption was successful. That way, the key is never stored anywhere.</p>\n<p>By using a good random number generator instead of simply iterating through all possible values, it might seem like the answer will be found sooner (but in fact the probability should be equal).</p>\n<p>In that case, it's an implementation of Random Decryption Algorithm (RDA), just another name for a brute-force attack.</p>\n</div>",
            "votes": "0",
            "user": "peter ferrie",
            "time": "Jan 18, 2015 at 22:29",
            "is_accepted": false,
            "comments": [
                {
                    "user": "puggsoy",
                    "text": "<span class=\"comment-copy\">OK, I think I get what you're saying. But how do I know what to use as the Mersenne Twister seed? And what algorithm is used for the actual decryption? Basically I just want to find the key used for decryption and decrypt the files. I already have one of the decrypted files, which I could use for confirmation, and with luck the other files should have a same key (or use one derived in the same manner).</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">The seed is irrelevant, and so is the Twister itself.  You'll potentially be iterating through all possible values until you find the right one, no matter what starting value that you use.  You could just start at 0, try 1, 2, 3, ... for the same eventual result.  You don't need a RNG for that.</span>",
                    "time": null
                }
            ]
        }
    ]
}