{
    "title": "Compiling plugins for use with IDA 5.0 free?",
    "link": "https://reverseengineering.stackexchange.com/questions/8084/compiling-plugins-for-use-with-ida-5-0-free",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Is there a tutorial somewhere on how to make plugins work with IDA 5.0 free?</p>\n<p>Plugins built against the normal SDK libs don't work because the WLL of free IDA exports everything by ordinal and not by name. I wrangled with Microsoft's LIB tool to make a suitable import lib from a .def file for a few functions but now IDA says 'not IDA DLL file'...</p>\n<p>Also, is there a .DEF file or a VC++ import lib for IDA 5.0 free?</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "ida-plugin",
        "idapro-sdk"
    ],
    "user": "DarthGizka",
    "time": "Jan 23, 2015 at 14:17",
    "comments": [
        {
            "user": "DarthGizka",
            "text": "<span class=\"comment-copy\">Would the people who keep voting down this question please indicate what the problem is that they're having with it? I have done due diligence by Googling high and wide, and the question is clearly on topic (both because IDA is the reversing tool par excellence, and because reverse engineering is required to build plugins for free IDA).</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I found the reason why the plugin didn't work: the PLUGIN symbol wasn't exported from the dll (.plw). </p>\n<p>In headers prior to version 5.1 the symbol isn't declared __declspec(dllexport), meaning it has to be exported via a .DEF file or a workaround has to be used so that the symbol definition can be made __declspec(dllexport) despite the wrong declaration in the header:</p>\n<pre><code>#define PLUGIN  sCaPeGoAt_PLUGIN\n#include \"loader.hpp\"             // plugin_t, PLUGIN_KEEP etc.\n#undef  PLUGIN\n\nextern \"C\"                        \n__declspec(dllexport)\nplugin_t PLUGIN = \n{\n   IDP_INTERFACE_VERSION,\n   ...\n};\n</code></pre>\n<p>With the scapegoat soaking up the wrong declaration, VC++ accepts the __declspec(dllexport) on the definition and compiles it. Now the plugin works perfectly fine in IDA 5.0 free... Without the fix, the build stops with the following message:</p>\n<pre><code>error C2370: 'PLUGIN' : redefinition; different storage class\n</code></pre>\n<p>The problem of obtaining a decent .DEF or .LIB still remains, though. Reversing the WLL to identify the functions behind the ordinals is a bit cumbersome and slow going... There are plugins for IDA free around, so the libs must be out there somewhere (unless they were got under a gag agreement).</p>\n<p><strong>UPDATE</strong>: for VC++ there's a much easier way to accomplish the same thing, without evil macro trickery:</p>\n<pre><code>#pragma comment (linker, \"/export:PLUGIN=_PLUGIN\")\n</code></pre>\n<p>or simply</p>\n<pre><code>#pragma comment (linker, \"/export:_PLUGIN\")\n</code></pre>\n<p>since the leading underscore seems to get stripped automatically.</p>\n</div>",
            "votes": "3",
            "user": "DarthGizka",
            "time": "Jan 24, 2015 at 9:10",
            "is_accepted": false,
            "comments": []
        }
    ]
}