{
    "title": "Emulating a sentinel c-plus security dongle to attach to a virtual machine",
    "link": "https://reverseengineering.stackexchange.com/questions/8153/emulating-a-sentinel-c-plus-security-dongle-to-attach-to-a-virtual-machine",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>My company has an ancient payroll system that we want to virtualise so that it can be preserved for legal reasons. The software runs on an operating system called <a href=\"http://www.theos-software.com/\" rel=\"nofollow noreferrer\">THEOS</a>.</p>\n<p>We've run into a bit of a snag. The operating system depends on a security dongle being present to install and run. The device is a sentinel C-Plus A (see below). It connects to a parallel port and acts a passthrough device for a parallel printer.</p>\n<p><img alt=\"Sentinel C-Plus A\" src=\"https://i.sstatic.net/jqNze.jpg\"/></p>\n<p>I've been exploring options on how to virtualise this dongle. My plan is to somehow emulate the dongle, attach the virtual device to VMware machine and install THEOS as a VM (I already know THEOS is compatible with VMware).</p>\n<p>So far, I've managed to find <a href=\"http://forum.exetools.com/showthread.php?t=10992\" rel=\"nofollow noreferrer\">this forum</a> which is hosting a dumper and emulator for this dongle, but I'm not able to download it as I'm not a member (and cannot join without an invite code).</p>\n<p>I've also found <a href=\"http://www.dongleservice.com/emulate-sentinel-cplus.phtml\" rel=\"nofollow noreferrer\">this business</a> that claims to be able to create an emulator for this dongle, and am in the process of contacting them about it. However, we would prefer to do this ourselves rather than go through someone else.</p>\n<p>Does anyone have any advice or experience for a situation like this? Or perhaps information on how we can access the tools hosted on the exeforums site?</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "2k",
    "tags": [
        "hardware",
        "virtual-machines",
        "dongle"
    ],
    "user": "eltommo",
    "time": "Jun 24, 2020 at 11:43",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">Have you tried contacting theos about this? They might supply an official solution, which has the benefit of not breaking any licenses and come with a vendor guarantee that it'll continue to work long-term.</span>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">From <a href=\"http://www.theos-software.com/reasons.pdf\" rel=\"nofollow noreferrer\">theos-software.com/reasons.pdf</a> - \"a physical or virtual dongle is required for every THEOS machine\". So yes, as @GuntramBlohm suggested, contact the vendor :)</span>",
            "time": null
        },
        {
            "user": "eltommo",
            "text": "<span class=\"comment-copy\">Yeah, I have tried contacting theos. I did get a response from them about the fact that theos could be virtualised, but I haven't managed to hear back from them about the security dongle yet. @JasonGeffner Interesting; I hadn't seen the word 'virtual dongle' in the other documentation I was looking at. This gives me some hope; I'll push the vendors harder.</span>",
            "time": null
        },
        {
            "user": "eltommo",
            "text": "<span class=\"comment-copy\">Just heard back from THEOS; no dice. The response was that USB dongles are supported, but not virtual devices. We will persist with attempting to emulate our dongle as we would rather not depend on specific hardware to preserve this system (other than our ESXi host)</span>",
            "time": null
        },
        {
            "user": "Michel Dansereau",
            "text": "<span class=\"comment-copy\">QUESTION: Has there been any update on this? I ask b/c I'm in a situation where I need to \"transport\" my THEOS server and I can't seem to get the virtual machine to see the physical dongles (I have both a USB and LPT version). I thought it was my VM setup, but everything seems right there. Thanks.</span>",
            "time": null
        }
    ],
    "answers_data": []
}