{
    "title": "Bypassing Enigma loader",
    "link": "https://reverseengineering.stackexchange.com/questions/8236/bypassing-enigma-loader",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Currently I'm trying to get past Enigma's loader, which asks you for a name &amp; key, as an excercise.</p>\n<p>I have very little progress, as I haven't worked too much with packers.</p>\n<p>What I did was breakpoint on <code>CreateWindowExA</code>, and then I put random data at key / name, and then click <code>Register</code>, which effectively breaks at <code>CreateWindowExA</code>.</p>\n<p>From there, I'm able to check the stack and go back a few calls, but I'm really lost as there's a lot of bloat code (short functions with x87 instructions), and I don't know where to continue.</p>\n<p>I also know that the routine that checks the serial is virtualized, so I should patch the places which check the return of the function that checks the serial instead of the function itself, but then again, I get lost when looking at the stack.</p>\n<p>Here's my progress so far:</p>\n<p>The breakpoint on <code>CreateWindowExA</code>, which gets called when you input an invalid serial\n<img alt=\"enter image description here\" src=\"https://i.sstatic.net/eA0gF.png\"/></p>\n<p>The function that calls it:\n<a href=\"http://screenshotuploader.com/i/1502/t_q0c.png\" rel=\"nofollow noreferrer\">http://screenshotuploader.com/i/1502/t_q0c.png</a></p>\n<p>And that function, before and after calling <code>CreateWindowExA</code>, calls these two weird x87 functions:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/2ZgUw.png\"/></p>\n<p><em>the function that is marked in the previous screenshot</em></p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/d5G5N.png\"/></p>\n<p><em>this one gets called a few instructions after <code>CreateWindowExA</code></em></p>\n<p>After going one more function back, I see:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/yOBsE.png\"/></p>\n<p>The problem with that function is that it's using some tricks to change the return address (I guess), like this:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/LoWvz.png\"/></p>\n<p>Which then leads to weird code which expects a function pointer in <code>edx</code> returned by a funtion that is dereferencing a pointer to a <code>word</code> (2 bytes)!</p>\n<p>Here's the code that calls the function that returns a pointer to a function:\n<img alt=\"enter image description here\" src=\"https://i.sstatic.net/CxzoC.png\"/></p>\n<p>And here's the function that returns a pointer in <code>edx</code>:\n<img alt=\"enter image description here\" src=\"https://i.sstatic.net/43Cm7.png\"/></p>\n<p>It is really weird, as it 1) derefs a <code>word</code> (2 bytes, not enough for a function pointer!), and 2) <code>FLDCW</code> loads a x87 FPU control word... what's happening here?!</p>\n<p>Also, that's the last return I can see in the stack, as the rest of the values are zeroed, and there's no branch which checks the serial at this depth, so I don't know where to continue looking at.</p>\n<hr/>\n<p>And if not enough, the program closes each time I input an invalid serial, which makes it harder, because the next time the offsets are totally different and I can't find the code so I breakpoint a bit before, so I'm really lost!</p>\n<p>Dumping the executable at runtime does absolutely nothing, as it's still packed as it was before, it just makes it 4x bigger (50MB -&gt; 200MB), and doesn't help at all.</p>\n<p>Any help would be great, even a simple idea, like a hint on what to do next, where to breakpoint, where to look at, or whatever you can think of, would help a lot.</p>\n</div>",
    "votes": "4",
    "answers": 0,
    "views": "2k",
    "tags": [
        "debugging",
        "unpacking",
        "crackme"
    ],
    "user": "rev",
    "time": "Feb 13, 2015 at 19:05",
    "comments": [
        {
            "user": "qnet Ug",
            "text": "<span class=\"comment-copy\">I also have a problem with my files, if you were able to figure out please help me too. <a href=\"https://workupload.com/file/TQ9LCnExkdj\" rel=\"nofollow noreferrer\">workupload.com/file/TQ9LCnExkdj</a> thats the link to my files</span>",
            "time": null
        },
        {
            "user": "Yotamz",
            "text": "<span class=\"comment-copy\">This does not really answer the question. If you have a different question, you can ask it by clicking <a href=\"https://reverseengineering.stackexchange.com/questions/ask\">Ask Question</a>. To get notified when this question gets new answers, you can <a href=\"https://meta.stackexchange.com/q/345661\">follow this question</a>. Once you have enough <a href=\"https://reverseengineering.stackexchange.com/help/whats-reputation\">reputation</a>, you can also <a href=\"https://reverseengineering.stackexchange.com/help/privileges/set-bounties\">add a bounty</a> to draw more attention to this question. - <a href=\"/review/late-answers/24665\">From Review</a></span>",
            "time": null
        }
    ],
    "answers_data": []
}