{
    "title": "Reverse decryption algorithm",
    "link": "https://reverseengineering.stackexchange.com/questions/8311/reverse-decryption-algorithm",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've been working to disassemble a decryption algorithm for a particular software. The way it works is that the serial key contains all the appropriate information, gets crunched in the algorithm which outputs plaintext data (It's actually binary data but this is not that important here).</p>\n<p>I now want to create an algorithm which will re-encrypt arbitrary data.</p>\n<p>After some work I managed to greatly reduce the code base for the decryption process. Here is how it works :</p>\n<pre><code>BigUnsigned hash_func(BigUnsigned serial, BigUnsigned running_value, BigUnsigned encrypt_key)\n{\n    return (serial * running_value) - (((serial * running_value) / encrypt_key) * encrypt_key);\n}\n\nvoid do_the_thing()\n{\n    BigUnsigned key1 = hash_func(buSerial, buSerial, buEncryptKey);\n    BigUnsigned key2 = hash_func(buSerial, key1, buEncryptKey);\n\n    BigUnsigned result = 1;\n    int key_select = 0;\n    unsigned int weird_number = 0xc3530000;\n    for(int i = 0; i &lt; 8; ++i, weird_number *= 4){\n        result = hash_func(result, result, buEncryptKey);\n        result = hash_func(result, result, buEncryptKey);\n        if(weird_number &gt;&gt; 30){\n            key_select++;\n            if(key_select &lt; 3){\n                result = hash_func(result, key2, buEncryptKey);\n            }else{\n                result = hash_func(result, buSerial, buEncryptKey);\n                if(key_select == 4){\n                    key_select = 0;\n                }\n            }\n        }\n    }\n}\n</code></pre>\n<p>both <code>buSerial</code> and <code>buEncryptKey</code> are 16 unsigned int (512-bits). I don't get how I can create an algorithm that encrypt new data from this. The problem I have is that key2 is generated from the final result which I don't know beforehand.</p>\n<p>I'm using <a href=\"https://mattmccutchen.net/bigint/\" rel=\"nofollow\">this BigInt library</a></p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "762",
    "tags": [
        "cryptography"
    ],
    "user": "Eric",
    "time": "Feb 22, 2015 at 12:22",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Do you have any more information, especially, one or two examples for buEncryptKey? Is that a prime number?</p>\n<p>The reason i'm asking is: your <code>hash_func</code> is a modulo function, it calculates <code>(serial*running_value) % encrypt_key</code>. This makes <code>key1 = serial^2%encrypt_key</code> and <code>key2 = serial*(serial^2%encrypt_key)%encrypt_key = serial^3 % encrypt_key</code>. And polynomials modulo prime numbers are often used in CRC calculations, or <a href=\"http://en.wikipedia.org/wiki/Fletcher%27s_checksum\" rel=\"nofollow noreferrer\">Fletcher's checksum</a>.</p>\n<p>The rest of the loop calculates <code>(result^4 % encrypt_key)</code>, and then <code>result*(serial^3) % encrypt_key</code>, or <code>(result*serial % encrypt_key)</code>, depending on some bits in <code>weird_number</code>.</p>\n<p>However, your key_select seems a bit fishy - could you please make sure that key_select is calculated this way, and isn't just <code>(weird_number &gt;&gt; 30) &amp; 0x03</code> ? The way <code>weird_number</code> is treated in the loop would make it logical to check 2 bits of it in each round (which coincides with the multiplication with 4), and i'd expect 2 of the bits in weird_number to be used to select one of your if-else cases; in your code right now, it doesn't make sense to use 2 bits of weird_number at once. (Also, it doesn't make sense NOT to mask the higher bits away, but as weird_number is just a 2-byte integer anyway, they'll get thrown away with each shift).</p>\n<p>Once you get the maths of your function right, you might be able to find it on the internet, or maybe the people of math.stackexchange.com or crypto.stackexchange.com might have a pointer where this algorithm is used, and how to create a matching reverse function.</p>\n<p><strong>UPDATE</strong></p>\n<p>&lt;rant&gt;</p>\n<blockquote>\n<p>On a totally unrelated problem at work today, i checked the contents\n  of two different SSL client certificates. One of them said: modulus\n  (large hex number), exponent: 0xbf0453. The other said: modulus\n  (different large hex number), exponent: 0xcd01b7. Then i thought of\n  your <code>weird_number</code> and had an idea. Then i googled for rsa algorithm.\n  And now, i think i know what's happening.</p>\n</blockquote>\n<p>&lt;/rant&gt;</p>\n<p>From <a href=\"http://en.wikipedia.org/wiki/RSA_%28cryptosystem%29#Signing_messages\" rel=\"nofollow noreferrer\">Wikipedia</a> about signing messages using RSA: </p>\n<blockquote>\n<p>When Bob receives the signed message, he [...] raises the signature to\n  the power of e (modulo n) [...], and compares the resulting hash value\n  with the message's actual hash value.</p>\n</blockquote>\n<p>This is exactly what your algorithm is doing. It optimizes the math a bit, by calculating x^4 in each loop, and then factoring in x or x^3 depending on 2 bits of the exponent. This seems to be a variation on <a href=\"http://en.wikipedia.org/wiki/Exponentiation_by_squaring#Montgomery.27s_ladder_technique\" rel=\"nofollow noreferrer\">Montgomery's ladder technique</a>, that uses 2 bits at once instead of one bit.</p>\n<p><code>e</code> is your <code>weird_number</code> (50003, only the high 16 bits are used), and <code>n</code> is your <code>encrypt_key</code>. (You might want to make sure i'm correct by letting your BigInteger library calculate <code>serial^50003 % encrypt_key)</code> and compare the result to your \"plaintext data\", i didn't actually check it.)</p>\n<p>To calculate the input, you'll need the signing algorithm, from the same paragraph in Wikipedia:</p>\n<blockquote>\n<p>Alice wishes to send a signed message to Bob. She can use her own\n  private key to do so. She produces a hash value of the message, raises\n  it to the power of d (modulo n) [...], and attaches it as a\n  \"signature\" to the message.</p>\n</blockquote>\n<p>To calculate the input, you need <code>n</code> (which you have) and <code>d</code> (which you don't have). To calculate <code>d</code>, you need to factor <code>n</code> into its two generating prime numbers (<code>p</code>, <code>q</code>) where <code>n=pq</code>. This fits with Wolfram Alpha saying <code>n</code> is not a prime, but, unfortunately, finding these numbers is hard - after all, the algorithm is designed to be uncrackable. However, 512 bits isn't state of the art anymore, and the crypto.stackexchange.com guys say <a href=\"https://crypto.stackexchange.com/questions/3931/is-512-bit-rsa-still-safe-for-signature-generation\">factorization of a 512 bit number is quite feasible today</a>.</p>\n<p>Still, you'll probably have to invest a lot more time to reach your goal. Sorry to deliver bad news. </p>\n</div>",
            "votes": "2",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:48",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Eric",
                    "text": "<span class=\"comment-copy\">Thanks for the help. Wolfram alpha reports that ecryptKey is not a prime. key_select is indeed not the original. The original disassembly generated was very ugly and I resorted to a few shortcuts.</span>",
                    "time": null
                },
                {
                    "user": "Eric",
                    "text": "<span class=\"comment-copy\">serial^50003 is VERY long. I saw a... piece of software for this particular program that would... encrypt new information which would be decrypted correctly afterwards by the program (if you know what I mean). Maybe I overlooked something in the simplification process.</span>",
                    "time": null
                },
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\"><code>serial^50003</code> is VERY long, true. But you just need <code>(serial^50003)%encrypt_key</code>. As an easier example, imagine you want to calculate (7^11)%5. This is equal to <code>((7^3)*(7^3)*(7^3)*(7^2))%5</code>. But this is <i>also</i> equal to <code>(((7^3)%5) * ((7^3)%5) * ((7^3)%5) * ((7^2)%5))%5</code> - taking the remainder after each step makes the numbers much smaller and <i>doesn't change the result</i>. This is basically what the algorithm you disassembled does.</span>",
                    "time": null
                }
            ]
        }
    ]
}