{
    "title": "Will this code run in real machine or is it some kind of Anti Reversing code?",
    "link": "https://reverseengineering.stackexchange.com/questions/8351/will-this-code-run-in-real-machine-or-is-it-some-kind-of-anti-reversing-code",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am reversing a file which is not running properly in Vmware.The code from the AEP is as shown below :</p>\n<pre><code>POP EDI     ; value of edi is 0x7C816D4F kernel32.7C816D4F\nPUSH EAX    ;value of eax is 0\nINC EBP     ;value of ebp was 0x12FFF0\nIN EAX,DX   ;value of DX is 0xEB94    \nAAS\nIN AL,0BF                      \nDEC ESP\n</code></pre>\n<p>What I think is that  a privileged instruction(IN) is called from user mode which is not allowed and therefore execution fails.\nIN is used for anti VM code but it requires specific values (VMXh port value in EAX etc) but in my case it is not being used.</p>\n<p>My question is ,is it some kind of anti debugging or is the file corrupt and will it run on a non VM machine(in my case XP).</p>\n<p>And lastly,if a packer uses the method I mentioned above ie calling IN from usermode for Anti-reversing how come the sample runs on a real machine(since in this case also the privileged instruction will be called in user mode).</p>\n</div>",
    "votes": "3",
    "answers": 2,
    "views": "407",
    "tags": [
        "malware",
        "debugging",
        "x86"
    ],
    "user": "rebel87",
    "time": "Feb 28, 2015 at 10:03",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Not easy to answer since there's not much context provided, but a few possibilities:</p>\n<ol>\n<li>The unpacking stub detected the VM at some point before executing the code above, and due to the VM detection, the unpacking stub caused the above junk code to be executed.</li>\n<li>The unpacking stub set up an exception handler before executing the code above, and the exception handler expects and catches the privileged instruction exception.</li>\n<li>This code is never executed and you're looking at the wrong memory.</li>\n</ol>\n</div>",
            "votes": "3",
            "user": "Jason Geffner",
            "time": "Feb 28, 2015 at 18:13",
            "is_accepted": false,
            "comments": [
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">and the first three characters spell \"_PE\".  I doubt that it's executed code.  Port 0xBF is not defined by standard hardware.</span>",
                    "time": null
                },
                {
                    "user": "rebel87",
                    "text": "<span class=\"comment-copy\">Thanks for the answer Jason: 1&gt;This code is at the AEP and there is no TLS code present so I doubt that VM detection is possible. 2&gt;There is no SEH routine barring the default one i.e. there is only one entry in the SEH chain 3&gt;This code must run because it these are the instructions present at the AEP.</span>",
                    "time": null
                },
                {
                    "user": "rebel87",
                    "text": "<span class=\"comment-copy\">Thanks for the comment Peter,could you elaborate how did you come to this conclusion...</span>",
                    "time": null
                },
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">@rebel87: <code>aas</code> is an extremely rare opcode to see in modern compiled code; so is, <code>dec esp</code> -- subtracting only 1 from the stack pointer. Seeing 'random' disassembly such as this is an immediate red flag.</span>",
                    "time": null
                },
                {
                    "user": "rebel87",
                    "text": "<span class=\"comment-copy\">@Jongware Thanks for the answer ,I'll keep that in mind i.e.    Rare opcode is suspectible...</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I think I got the answer from :\n<a href=\"https://stackoverflow.com/questions/89607/what-is-a-privileged-instruction\">https://stackoverflow.com/questions/89607/what-is-a-privileged-instruction</a></p>\n<p>Summary of the answers in that post :</p>\n<p>The cause is probably a corrupted stack or a messed up function pointer call ,this usually happens when using function pointers that point to invalid data. It can also happen if you have code that trashes your return stack or if you are using old compilers/libraries.</p>\n<p>The guy who programmed the exe  may be using a local array and it is near the top of the function declaration. His bounds checking may have gone insane and overwritten the return address and it points to some instruction that only kernel is allowed to execute.</p>\n</div>",
            "votes": "0",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": true,
            "comments": []
        }
    ]
}