{
    "title": "How would I search an IDA pro database for instances of I.P addresses?",
    "link": "https://reverseengineering.stackexchange.com/questions/8360/how-would-i-search-an-ida-pro-database-for-instances-of-i-p-addresses",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Simple as that. I have a massive Disassembly, that I want to check for I.P addresses. Since the text search in IDA doesn't seem to have a regex function, I'm not sure the best way to get this done. Perhaps a script? </p>\n<p>I also realize this may be complicated by the fact that some of the I.P adresses may not exist as strings. </p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "disassembly"
    ],
    "user": "MrSynAckSter",
    "time": "Apr 2, 2015 at 19:31",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">Are these specific IP addresses you know, or are you looking for anything that looks like a random IP address?</span>",
            "time": null
        },
        {
            "user": "MrSynAckSter",
            "text": "<span class=\"comment-copy\">Anything that looks like a random i.p address</span>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">You'll never find random IP addresses that aren't strings that way, since just about every byte combination might be an IP address. Or better, you'll find way too many. Even your \"Hello world!\" string might be 110.145.154.154 .. As for strings, right-clicking the strings window and selecting \"modify filters\" brings up a dialog that includes a \"regular expression\" checkbox.</span>",
            "time": null
        },
        {
            "user": "MrSynAckSter",
            "text": "<span class=\"comment-copy\">That's a useful answer, thanks! I would have expected a regex search to have been under the text search functionality.</span>",
            "time": null
        },
        {
            "user": "MrSynAckSter",
            "text": "<span class=\"comment-copy\">However, if you have any tips for automatically finding spots where I.P addresses that <i>aren't</i> strings are loaded into memory (I'm trying to find the \"call home\" i.p for an antivirus) I'm all ears.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<blockquote>\n<p>Only responds to ping probes from arbitrary hosts</p>\n</blockquote>\n<p>In that case, reverse engineer the code that calls <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms740120%28v=vs.85%29.aspx\" rel=\"nofollow\"><code>recvfrom()</code></a> to find out how it validates the source IP of the received ping packet.</p>\n</div>",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Mar 2, 2015 at 22:29",
            "is_accepted": false,
            "comments": []
        }
    ]
}