{
    "title": "How can I statically unpack a file packed with an unknown packer without executing it?",
    "link": "https://reverseengineering.stackexchange.com/questions/8412/how-can-i-statically-unpack-a-file-packed-with-an-unknown-packer-without-executi",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I want to implement a generic, static unpacker that can statically unpack files that have been packed with unknown packers.\nIn fact, I want it to be able to unpack packers which I just think of.</p>\n<p>Thanks a lot for your help.</p>\n</div>",
    "votes": "-1",
    "answers": 1,
    "views": "738",
    "tags": [
        "static-analysis",
        "unpacking",
        "decryption",
        "packers",
        "decompress"
    ],
    "user": "Alireza Jafari Fard",
    "time": "Mar 8, 2015 at 6:54",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can't. You don't know how the file is packed, the only thing you have is the unpacking code in the file. You could try running the file through an emulator like QEMU, so the unpacking takes place in the emulator, not in the \"physical\" computer. However, that still executes the code.</p>\n<p>And you'll have the problem that you don't know when you reach the end of the unpacker start the original program - there's no way to tell unless you have several different executables which are packed with an identical packer and check where they start behaving differently. (And even then, they might be encrypted with different keys, so your programs will behave differently when they retrieve the key).</p>\n<p>You can't even know if the unpacker unpacks everything at once, or only the main program, and unpacks the rest of the program on the fly when it's being used.</p>\n<p>Believe me, many people would already have implemented this if it was possible.</p>\n</div>",
            "votes": "4",
            "user": "Guntram Blohm",
            "time": "Mar 7, 2015 at 22:51",
            "is_accepted": false,
            "comments": []
        }
    ]
}