{
    "title": "The Suffering - Ad supported [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/8453/the-suffering-ad-supported",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<div>\n<aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n<div class=\"d-flex fd-column fw-nowrap\">\n<div class=\"d-flex fw-nowrap\">\n<div class=\"flex--item wmn0 fl1 lh-lg\">\n<div class=\"flex--item fl1 lh-lg\">\n<div>\n<b>Closed</b>. This question needs to be more <a href=\"/help/closed-questions\">focused</a>. It is not currently accepting answers.\n                                \n                            </div>\n</div>\n</div>\n</div>\n</div>\n<hr class=\"my12 outline-none baw0 bb bc-blue-400\"/>\n<div class=\"fw-nowrap fc-black-500\">\n<div class=\"d-flex fd-column lh-md\">\n<div class=\"mb0 d-flex\">\n<div class=\"flex--item mr8\">\n<svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\"><path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\"></path></svg>\n</div>\n<p><b>Want to improve this question?</b> Update the question so it focuses on one problem only by <a href=\"/posts/8453/edit\">editing this post</a>.</p>\n</div>\n<div class=\"mb0 mt6 d-flex\">\n<p class=\"ml24 pl2\">Closed <span class=\"relativetime\" title=\"2015-03-16 06:16:39Z\">10 years ago</span>.</p>\n</div>\n<div class=\"ml24 pl2\">\n</div>\n</div>\n</div>\n<div class=\"mt24 d-flex gsx gs8\">\n<a class=\"s-btn s-btn__outlined flex--item js-post-notice-edit-post\" href=\"/posts/8453/edit\">\n                        Improve this question\n                    </a>\n</div>\n</aside>\n</div>\n<p>I aplogize in advanve for my beginners question. I also aplogize if this post is in the wrong thread or the wrong board. I just thought this may belong here.</p>\n<p>The technical part:\nI just downloaded the Game \"the suffering\" a few days ago. It is for free but ad supported and therefore has no reason not to play it, if you havent done that yet. ;)</p>\n<p>The tricky part is that the servers serving the ads are offline because the publisher does not even exist anymore.</p>\n<p>Sadly this means the game is unplayable because before it loads up it checks against the ad-serving server and then starts the game or does not.</p>\n<p>So I thought this is an opportunity for me to learn sth. New and I decided to look into this problem and want to understand the process behind this online-check and maybe get it to run in the end or at least understand how it works.</p>\n<p>I am a certified IT-Engineer and have some experience in programming aswell so I am nit a total noob when it comes to IT-Problems.</p>\n<p>Where I need help from you guys is where to start and how to get to know what the game is actually doing. I already tried wireshark and some other tools but this does not help me to understand what it is doing and who the check process works.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "135",
    "tags": [
        "software-security"
    ],
    "user": "Keks411",
    "time": "10 years ago",
    "comments": [
        {
            "user": "rev",
            "text": "<span class=\"comment-copy\">quick fix: redirect the ads host to a random host with your <code>hosts</code> file. if that does not work, you'll have to tell us more information about that game: format, platform, etc. basically, give us some context.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Your wireshark logs should tell you if the game tries to resolve some DNS entries that don't exist anymore (or maybe even some that do exist), and to which IP addresses it connects. If you're lucky, it'll connect to a port 80 somewhere, so you'd know it's trying to talk to a web server.</p>\n<p>Next, you could set up your own web server, and use tricks like an entry in the <code>hosts</code> file to redirect the traffic to your own server(*) and check what the game tries to access. If it issues a <code>GET /randomad.jpg HTTP/1.0</code>, place an 1x1 white pixel jpg file on your server, and look what happens.</p>\n<p>(*) Obviously, this won't work if the game tries to access an IP address directly. The easiest way to resolve this, in my opinion, is installing VirtualBox, creating a host-only network with IP addresses in the range you want to monitor, and assigning the target IP to your guest. If you want to do this more often, the most flexible way is replacing your router with a Linux box and using <code>iptables</code> to do all kind of dirty stuff to your network packets.</p>\n<p>Of course, the game could request a <code>ad-info.xml</code> file, or not use HTTP at all. In this case, it's going to be much harder, as you don't know what response is expected, and there are no real servers to trace anymore. This is where you'll have to learn a <em>lot</em> about assembly and processor architecture, and use tools like <a href=\"http://www.ollydbg.de/\" rel=\"nofollow\">Ollydbg</a> and <a href=\"https://www.hex-rays.com/products/ida/support/download_freeware.shtml\" rel=\"nofollow\">Ida</a> to disassemble the program, search for where the program tries to display an ad, and change the program code accordingly. You will need a lot of time for this (at least several months if you're new to assembly), but you'll also learn a lot doing this.</p>\n</div>",
            "votes": "2",
            "user": "Guntram Blohm",
            "time": "Mar 13, 2015 at 17:06",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">Instead of using VirtualBox or messing with routers, it's much easier to just <a href=\"http://support.microsoft.com/en-us/kb/839013\" rel=\"nofollow noreferrer\">create a loopback network adapter</a> and statically assign a given IP address to it.</span>",
                    "time": null
                },
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">Thank you for your suggestion, i never knew windows had this. I can only repeat what i said, you're an astonishing source of tools i'm putting in my box.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">The professional respect is mutual ;)</span>",
                    "time": null
                }
            ]
        }
    ]
}