{
    "title": "Unpacking and dumping using ollydump",
    "link": "https://reverseengineering.stackexchange.com/questions/8463/unpacking-and-dumping-using-ollydump",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to learn how to unpack a malware. I am trying this with ollydbg. However, when I try to dump the unpacked using ollydump plugin. It prompts the error \"Bad DOS signature!!\". Could someone help me with this?</p>\n<p>What I found so far is:</p>\n<ul>\n<li>Malware is calling VirtualAlloc (allocated region is readable/writable and executable/)</li>\n<li>I kept a hardware breakpoint on the allocated address</li>\n<li>when the control reached that memory, I ran ollydump. It throws \"Bad DOS Signature\"<img alt=\"enter image description here\" src=\"https://i.sstatic.net/RLyf6.png\"/></li>\n</ul>\n<p>Any pointers to unpack this malware?</p>\n</div>",
    "votes": "3",
    "answers": 4,
    "views": "13k",
    "tags": [
        "ollydbg",
        "malware",
        "unpacking",
        "dumping"
    ],
    "user": "aMa",
    "time": "Mar 14, 2015 at 12:39",
    "comments": [
        {
            "user": "user2823000",
            "text": "<span class=\"comment-copy\">If the section you're trying to dump does not look like a regular PE file (\"MZ\", \"PE\", etc), you most likely didn't hit the unpacked file yet.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The malware <em>could</em> destroy its PE Headers at runtime so you might want to look for a tool that is capable of handling those cases.\n<a href=\"https://tuts4you.com/download.php?view.3503\" rel=\"nofollow\">Scylla</a> should do the job.</p>\n</div>",
            "votes": "2",
            "user": "Skyküff",
            "time": "Dec 2, 2015 at 16:16",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>if you dont wanna unpack exe manually;<br/>\n<br/>1. use peid to identify packing type.  -- <a href=\"https://tuts4you.com/request.php?398\" rel=\"nofollow noreferrer\">download peid</a> </p>\n<p><a href=\"https://i.sstatic.net/0MmoH.jpg\" rel=\"nofollow noreferrer\"><img alt=\"image\" src=\"https://i.sstatic.net/0MmoH.jpg\"/></a></p>\n<ol start=\"2\">\n<li>search in the same site for that packing type(in picture its aspack 2.001). you'll see tutorial for it. </li>\n<li>search google for <strong>aspack 2.001 unpacker</strong> .\nmaybe  even you get an app to unpack it automatically</li>\n</ol>\n<hr/>\n<p>peid tutorial -   tuts4you.com/download.php?view.398</p>\n</div>",
            "votes": "1",
            "user": "bh_earth0",
            "time": "Sep 29, 2015 at 8:43",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>As there are little data about the unpack flow, here is the general approach you should follow in most packed malwares. This will probably be more complicated if we are talking about some custom and sophisticated packers.</p>\n<p>I also strongly suggest to avoid various automatic unpacking plugins as they leaving you without the understanding of the process.</p>\n<p>So in most cases unpackers (in terms of unpack process) will try to:</p>\n<ul>\n<li>validate their payload</li>\n<li>allocate new memory to store the unpacked code (data). This will (in most cases) be done with the help of <code>VirtualAlloc(Ex)</code></li>\n<li>unpack routing will take the obfuscated code and write the clean one to the allocated space</li>\n<li>at the end of the process transfer control to the payload</li>\n</ul>\n<p>What you should try to do:</p>\n<ul>\n<li>place the HW breakpoint on the <code>VirtualAlloc(Ex)</code> as there are packers which will check the preamble for the BP placements. Press <code>execute till ret</code> and at the <code>EAX</code> you will get the allocated memory area address</li>\n<li>right click on the <code>EAX</code> to follow the address in <code>Dump</code></li>\n<li>place the <code>Memory On Write</code> breakpoint or <code>HW on write</code> breakpoint which should get you to the actual unpack routine</li>\n<li>analyze the flow of the unpack routing to place another breakpoint at the end of the unpack process</li>\n<li>once the unpacking is done, right click on the <code>Dump</code> windows to save the unpacked payload to the file.</li>\n</ul>\n<p>In your case, the payload will probably will not be the clean <code>MZ</code> file or in contrary, the unpack routing intentionally had crippled the payload.</p>\n<p>Probably this will be an iterative process as you also need to validate that the unpacked payload is actually the code. Try to use </p>\n<ul>\n<li><code>Trace</code></li>\n<li>in addition place <code>HW on Execute</code> at the beginning of the unpacked payload</li>\n<li>dump unpacking routine / area and open it in IDA to understand (find) if there are any control transferring process near by.</li>\n</ul>\n<p>Have Fun!</p>\n</div>",
            "votes": "1",
            "user": "PhoeniX",
            "time": "May 31, 2016 at 6:52",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Megabeets",
                    "text": "<span class=\"comment-copy\">Asked originally by @IhorBats and commented by me since the user doesn't have sufficient reputation: \"Thanks for description how to extract payload, do you know any book/articles that can help me actually do that?\"</span>",
                    "time": null
                },
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">I would suggest to go over Practical Malware Analysis book. In addition, you can check <a href=\"http://opensecuritytraining.info/Welcome.html\" rel=\"nofollow noreferrer\">opensecuritytraining.info/Welcome.html</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If it is as standard packer there are tools that will unpack it.  If you are looking to learn how to manually unpack or if it is not a standard unpacker then you can proceed.  It does not look like it has finished unpacking.  You may have to keep going to get to a valid \"original\" entry point. </p>\n</div>",
            "votes": "0",
            "user": "Milhous",
            "time": "Sep 30, 2015 at 15:18",
            "is_accepted": false,
            "comments": []
        }
    ]
}