{
    "title": "How to extract a function call graph from IDA's Pro disassembled file (.asm file)?",
    "link": "https://reverseengineering.stackexchange.com/questions/8482/how-to-extract-a-function-call-graph-from-idas-pro-disassembled-file-asm-file",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am totally new to reverse engineering science and does not know much about the assembly language. By the way, I am working on a data set of disassembled malicious files available at <a href=\"https://www.kaggle.com/c/malware-classification\" rel=\"nofollow\">kaggle</a>. These files are generated by IDA Pro and I do not have access to executable files or IDA Pro.</p>\n<p>In addition, I have read several papers on this topic and tried to implement one of them, <a href=\"http://dx.doi.org/10.1145/1653662.1653736\" rel=\"nofollow\">this one</a>. However, I need to generate a <strong>Function Call Graph</strong> from these codes. I have googled for hours, but could not find any open source tool to <strong>statically</strong> generate this graph from disassembled files.</p>\n<p>I am a computer science student, hence, as is expected, I am willing to implement one if there are no ones out there, however, I do not know how or where to begin. </p>\n<p>To sum it up, I have the following questions:</p>\n<pre><code>1- How to generate function call graphs from disassembled files, statically?\n2- Are there any algorithms, tools, or libraries to do this task or similar ones?\n</code></pre>\n<p>Regards</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "disassembly",
        "functions",
        "call"
    ],
    "user": "Ali Shakiba",
    "time": "Mar 17, 2015 at 12:38",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Note: You'll probably get a better answer on stackoverflow, as your question is more about creating software than about reversing it.</p>\n<p>First, you'll want to split your text file into blocks. You can do that looking for the <code>============= S U B R O U T I N E ============</code> comments that IDA emits, or checking the <code>sub_XXXX proc [near|far]</code>  and <code>sub_XXXX endp</code> markers.</p>\n<p>Then, to find your connections, look for the <code>call</code> statements in each of these procedures.</p>\n<p>Last, you need to layout the boxes and draw connections. You could use <a href=\"http://en.wikipedia.org/wiki/Graphviz\" rel=\"nofollow\">Graphviz</a> to do that (you need to write a definition file in a syntax they call \"dot language\"), or check the Wikipedia <a href=\"http://en.wikipedia.org/wiki/Graph_drawing\" rel=\"nofollow\">Graph drawing</a> page, which has explanations of the algorithms used, as well as links to various other software packages which might fit your need better.</p>\n</div>",
            "votes": "3",
            "user": "Guntram Blohm",
            "time": "Mar 17, 2015 at 15:42",
            "is_accepted": true,
            "comments": []
        }
    ]
}