{
    "title": "Reverse engineering Devolo firmware",
    "link": "https://reverseengineering.stackexchange.com/questions/8521/reverse-engineering-devolo-firmware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to do some reverse engineering to a Devolo dlan wifi 500 device (MIPS architecture). My objective is to put there some firmware modified by me.</p>\n<p>This is where I got so far:</p>\n<ol>\n<li>Downloaded a firmware update from <a href=\"http://update.devolo.com/linux2/apt/pool/main/d/devolo-firmware-dlan500-wifi/\" rel=\"nofollow noreferrer\">http://update.devolo.com/linux2/apt/pool/main/d/devolo-firmware-dlan500-wifi/</a></li>\n<li>Extracted firmware image from debian package</li>\n<li>Analyzed image with binwalk</li>\n<li>Extracted contents with firmware mod kit (present on google code).</li>\n<li>Modded image</li>\n<li>Rebuilded with fmk</li>\n<li>Used web interface of device to upload new firmware</li>\n</ol>\n<p>It failed on step 7. I get a message saying something like \"this file does not contain valid data\". So, some sort of verification is performed by the device before installing updates.</p>\n<p>So I kept investigating. The devolo image contains a devolo header/footer, a uboot and a uimage. The header/footer must contain some sort of checksum. I tried picking the valid (unmodified) update and changed one bit on the padding, uploaded it to the device and got the same error message.</p>\n<p>If I knew where the checksum is or how is obtained, I could change it after rebuilding the image. However I found no documentation about the devolo formats. To try to find the sum I compared the hexadecimal of two devolo images: wifi and wireless(the wireless image is on the same site from where I downloaded the wifi image; could not post this link and the fmk link because I have less than 10 reputation :( ). The headers/footers are very similar in most fields, though I found no 32byte field to be a sum. Perhaps someone more experienced on reverse engineering could help me.</p>\n<p>I could try to brute force the sum. Since it is a sum, I could create a collision by adding bits to the padding areas. For this I have two ideas:</p>\n<ol>\n<li>Send through the network every combination possible;</li>\n<li>Use the downloaded image's libraries to test the sum locally;</li>\n</ol>\n<p>Option 1 would probably take a few years...</p>\n<p>For option 2, I tried using a qemu virtual machine and compile there, and cross compiling, with no results, due to the devolo libs using an old libc version (<a href=\"https://stackoverflow.com/questions/29153924/how-to-solve-c-conflicts-between-system-and-library-dependencies\">https://stackoverflow.com/questions/29153924/how-to-solve-c-conflicts-between-system-and-library-dependencies</a>).</p>\n<p>My last idea is to somehow emulate the downloaded firmware in my amd64 machine, to compile some code there that would use the devolo libs, thus circumventing the dependency problems.</p>\n<p>So, I would thank any tips/mistakes on my previous steps, and any pointers on how to run the downloaded image on my pc.</p>\n</div>",
    "votes": "7",
    "answers": 1,
    "views": "3k",
    "tags": [
        "firmware",
        "mips"
    ],
    "user": "Camandros",
    "time": "Dec 25, 2020 at 22:29",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<span class=\"comment-copy\">Find the error message in the extracted code, the verification routine should be nearby.</span>",
            "time": null
        },
        {
            "user": "Camandros",
            "text": "<span class=\"comment-copy\">Found the message. It is in an executable, so it's rather hard to get something from there. But it was a nice idea</span>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">If you've already set up your system for cross compiling, you'll have a mips objdump somewhere. Run it on your executable, then inspect the code; mips assembler is (imho) much easier to learn than x86 or arm. You could also use www.onlinedisassembler.com instead of objdump, or check if the <a href=\"https://retdec.com/\" rel=\"nofollow noreferrer\">Retargetable Decompiler</a> works better with MIPS now (it didn't, last time i looked, 3 months ago).</span>",
            "time": null
        },
        {
            "user": "z3ky",
            "text": "<span class=\"comment-copy\">can you give me some help to extract the bin from the downloaded .dvl file? Maybe this will help to debrick my dlan500 wifi</span>",
            "time": null
        },
        {
            "user": "sudhackar",
            "text": "<span class=\"comment-copy\">If you have a new question, please ask it by clicking the <a href=\"https://reverseengineering.stackexchange.com/questions/ask\">Ask Question</a> button. Include a link to this question if it helps provide context. - <a href=\"/review/low-quality-posts/18138\">From Review</a></span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Each section in the firmware file has a crc32 over its contents.</p>\n<p>See <a href=\"https://github.com/booto/develo_fw\" rel=\"nofollow\">this</a>.</p>\n<p>It should make option 1 more viable.</p>\n<p>More details:\nInside the squashfs image there's whole heap of busybox based tools and a handful of standalone programs. There's one (<em>/usr/sbin/chunk</em>) that looked likely to have logic concerning the traversal of the firmware files. It contains a number of the 32bit values that matched the values in the firmware file that look like magic/fourcc values. strings(1) output was also pretty encouraging.</p>\n</div>",
            "votes": "3",
            "user": "booto",
            "time": "Mar 23, 2015 at 18:42",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">I like this answer, but a little bit of \"how do you know?\" would make it even better.</span>",
                    "time": null
                },
                {
                    "user": "Camandros",
                    "text": "<span class=\"comment-copy\">Dude, wow. Just wow. It works perfectly. Thanks for the code. Can you please please PLEASE tell me how you did this?</span>",
                    "time": null
                },
                {
                    "user": "booto",
                    "text": "<span class=\"comment-copy\">I used IDA to analyse the binary I mentioned in the 'more details' part of the answer.</span>",
                    "time": null
                },
                {
                    "user": "Camandros",
                    "text": "<span class=\"comment-copy\">Yeah but why <i>usr/sbin/chunk</i>? Amongst all binaries, why that one in particular? Or you analyzed all of them? (thanks again btw)</span>",
                    "time": null
                },
                {
                    "user": "booto",
                    "text": "<span class=\"comment-copy\">I had a quick look at a few (it wasn't the first), and it looked like it was the best one to check out in greater detail. Multiple references to manipulating firmware, and the fourcc values (e.g. DVCO, VRNT, etc) all make an appearance. The format of the file itself seems to have some similarities with <a href=\"http://www.libpng.org/pub/png/spec/1.2/PNG-Structure.html\" rel=\"nofollow noreferrer\">PNG</a>, (?) of all things (crc is a bit different, and the firmware format supports some basic encryption).</span>",
                    "time": null
                }
            ]
        }
    ]
}