{
    "title": "Identifying the pinout of an unknown protocol (Rollei 6000 Camera-Lens communication)",
    "link": "https://reverseengineering.stackexchange.com/questions/8541/identifying-the-pinout-of-an-unknown-protocol-rollei-6000-camera-lens-communica",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I would like to control a lens with an Arduino board, but of course, I first have to find out how the protocol works. Using an oscilloscope I was able to find out that the protocol uses High and Low states (about 20ms long) to transfer information, but without even knowing where the ground is, that information is rather unreliable.\nSo what I know so far is this:</p>\n<p>There are 10 pins, two of which would have to be power and ground for the motors in the lens.\nThe communication is digital, but not necessarily serial (e.g. Camera sends High on Pin X and the shutter in  the lens opens and on the next High the shutter closes)\nMy guess is that the protocol is in fact serial as there seems to be a control mechanism in the lens checking the accuracy of the shutter speeds (for which it would need to know them; the shutter speed dial is on the camera)</p>\n<p>How would I find out the pinout of this connector?</p>\n<p>The lens is from the Rollei 6000 Series with the PQ shutter. By googling I could only find information about the communication with the filmback.</p>\n<p>Thank you for you answers.</p>\n</div>",
    "votes": "1",
    "answers": 1,
    "views": "484",
    "tags": [
        "serial-communication",
        "protocol",
        "communication"
    ],
    "user": "Jan Hettenkofer",
    "time": "Mar 24, 2015 at 11:23",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>First thing i'd use is a digital oscilloscope, possibly with an included logic analyzer. Something like <a href=\"http://www.linkinstruments.com/mso19.html\" rel=\"nofollow\">this</a> is affordable and allows you to monitor up to 8 channels at the same time. Being able to see the delta times between different lines changing High/Low might help you a lot. (I'm not affiliated with this specific company; their products seem fine from the web site description; you may or may not find a better product/better price elsewhere).</p>\n<p>Once you have reason to assume one of the lines uses serial communication, you might be interested in a <a href=\"http://en.wikipedia.org/wiki/Bus_Pirate\" rel=\"nofollow\">Bus Pirate</a> to investigate further. The Bus pirate also allows you to emulate serial transmission without having to program the arduino a lot; once you know how the protocol works, you can start implementing it (or use a pre-made library).</p>\n<p>Since you don't know which of the lines is GND, i'd connect ground to the ground pin of the camera's battery. That way, you know for sure it's not on a data line that might change its voltage, and once you've identified the lines that seem to be 'always high' or 'always low', you know which ones are (probably) the power supply.</p>\n<p>Depending on the physical layout of your hardware, it might be difficult to hook the logic analyzer/bus pirate to the pins while the lens is on the camera. What worked for me in such cases was making a paper template that had holes where the pins were supposed to be, and glue a bunch of thin aluminium foil stripes between two of these templates (of course the stripes need to be insulated from each other). If done with thin paper, you should be able to put it between the camera and the lens.</p>\n<p>Also, i suggest some kind of precise time source with the logic analyzer, and using a cheap webcam to make a movie when you experiment with camera settings and lens reactions. This will allow you to match individual movie frames with signal transitions later, so you have a much better reference between \"which switches did i press\", \"what did the camera/lens do\", and \"which signals appeared on the data lines\" than when you try to write things down while experimenting.</p>\n</div>",
            "votes": "0",
            "user": "Guntram Blohm",
            "time": "Mar 24, 2015 at 12:48",
            "is_accepted": true,
            "comments": []
        }
    ]
}