{
    "title": "Dynamic instrumentation tools",
    "link": "https://reverseengineering.stackexchange.com/questions/8642/dynamic-instrumentation-tools",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've discovered recently <a href=\"http://www.pintool.org/\" rel=\"noreferrer\">PIN</a> which allows to dynamically instrument the binary code while still making the program believe it is running unmodified.</p>\n<p>Even more recently, I've heared about <a href=\"http://www.dyninst.org/\" rel=\"noreferrer\">Dyninst</a> and <a href=\"http://www.dynamorio.org/\" rel=\"noreferrer\">DynamoRIO</a>. Do you know some other tools like this? And more importantly, do you know the difference between those? What are their strenghs and their weaknesses for the topic of reverse engineering and binary code analysis?</p>\n<p>More specifically, the properties I'm interested in are:</p>\n<ul>\n<li>Open source licence</li>\n<li>Operating system portability (Linux, Windows, Mac, ...)</li>\n<li>Hardware architecture portability (x86 (32 and 64 bits), ARM, ...)</li>\n<li>Run the program unnoticeably, especially when the programs perform some tricks like executable code generation / modification, instruction overlap, memory image checksum, etc.</li>\n<li>Hard to detect (how about a program reading <code>/proc/self/maps</code> or trying to <code>mmap</code> all the memory pages that should be free or even reading hardware instruction counters?)</li>\n</ul>\n<p>But of course, other usual properties are also very welcome, like low overhead and ease of use.</p>\n</div>",
    "votes": "5",
    "answers": 1,
    "views": "1k",
    "tags": [
        "dynamic-analysis",
        "instrumentation"
    ],
    "user": "Celelibi",
    "time": "Apr 6, 2015 at 5:42",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><a href=\"http://frida.re/\" rel=\"nofollow\">frida</a> is cross-platform (OS X, Windows, Linux, iOS, Android) and also supports multiple architecture.</p>\n<p>The main functionality is running some javascript code every time a function is called or when returning from a function.</p>\n</div>",
            "votes": "3",
            "user": "Tyilo",
            "time": "Apr 8, 2015 at 2:27",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Celelibi",
                    "text": "<span class=\"comment-copy\">I may have some doubts about the performance if the user code is in javascript.</span>",
                    "time": null
                }
            ]
        }
    ]
}