{
    "title": "Ollydbg does not find all referenced strings while Reverse Engineering AoneVideo2AudioConverter",
    "link": "https://reverseengineering.stackexchange.com/questions/8665/ollydbg-does-not-find-all-referenced-strings-while-reverse-engineering-aonevideo",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am following <a href=\"http://securityxploded.com/reverse-engineering-video-converter.php\" rel=\"nofollow noreferrer\">this</a> tutorial on reverse engineering. In the step where I \"search for all referenced strings\" I get a window as follows:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/fdlgI.png\"/></p>\n<p>When compared to the image on the tutorial for the step, I found that the column headings of my window are : <strong>Address Command Comments</strong> where as according to the tutorial it is supposed to be: <strong>Address Disassembly Text String</strong> (It is not seen on the tutorial but I dig the internet before making this post).</p>\n<p>I am using Windows 8.1. I have run Ollydbg as administrator with compatibility mode for Windows 7 and Windows XP SP3, used Ollydbg 1.10 and 2.0 but I get same results. The module loaded is also the correct (not the ntdll). The exe version is a different one but I installed it and the overall functionality of the new version is still the same - gives out the exactly same error message for invalid registration.</p>\n<p>What am I doing wrong/missing here?? What might be the reason of this and how can I overcome it?</p>\n</div>",
    "votes": "2",
    "answers": 3,
    "views": "14k",
    "tags": [
        "disassembly",
        "ollydbg",
        "executable",
        "patch-reversing"
    ],
    "user": "mathakoot",
    "time": "Apr 28, 2017 at 12:52",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">If i had written a software and found there's a tutorial how to crack it on the internet, i'd change a few things to break the tutorial. This is the thing you're missing.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p><strong>possibilities:</strong></p>\n<ol>\n<li>Maybe the protection has been changed as @Guntram Blohm said.</li>\n<li>Have you checked your OllyDBG version. I guess this problem might have been occurred because your version doesn't support OS architecture or to be more specific, it doesn't have the proper plugins.</li>\n</ol>\n<p><strong>Suggestions:</strong></p>\n<ul>\n<li>Try to use \"R4ndoms_OllyDBG\" mod of OllyDBG... it's compatible with Win 7/8 x86/x64.</li>\n<li>Don't go after strings, try to go after the api (that you think it's being implemented), or you can look in the stack.</li>\n<li>Use another debugger like x64dbg or IDA Pro.</li>\n</ul>\n</div>",
            "votes": "3",
            "user": "Yaser Alnajjar",
            "time": "Jun 8, 2015 at 18:14",
            "is_accepted": true,
            "comments": [
                {
                    "user": "mathakoot",
                    "text": "<span class=\"comment-copy\">I checked out the R4ndoms tutorial on reverse engineering and it using the OllyDbg on the blog, I could do it and did not find any problems with the labels. It was way before you posted the comment but since it worked for me, I am marking this right.</span>",
                    "time": null
                },
                {
                    "user": "mathakoot",
                    "text": "<span class=\"comment-copy\">Could you suggest some tutorial/study blog where I can explore the API related technique that you've mentioned?</span>",
                    "time": null
                },
                {
                    "user": "Yaser Alnajjar",
                    "text": "<span class=\"comment-copy\">Lena's tutorials are the best. Watch the first 20 videos because each one has great amount of info.If you just want to find that specfic tutorial, you'll find it easily because it has an appendix (ex. html file) listing the most important APIs. Also, you can use IDAFactor plugin to do so, still I advice you to watch the series to know exactly what you are doing.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>There are a lot of way to hide strings to the debugger.\nA simple encryption at runtime can daunt new reverser to work on it.</p>\n<p>Try this plugin sometimes it helps to find strings that Ollydbg doesn't show:</p>\n<p><a href=\"https://tuts4you.com/download.php?view.107\" rel=\"nofollow\">https://tuts4you.com/download.php?view.107</a></p>\n<p>If also with Ultra string reference you don't get results, run the software in the debugger and then search for the string in Memory, then you can Memory breakpoint that area and understand where the software work with it and if there are encryptions to defeat.</p>\n</div>",
            "votes": "3",
            "user": "itseeder",
            "time": "Apr 9, 2015 at 9:39",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The windows that says <strong>disassembly</strong> is from ollydbg version <strong>1.10</strong>.<br/>\nThe windows that says <strong>command</strong> the one you are looking at is from ollydbg <strong>2.01</strong>.</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/zszlM.png\"/></p>\n</div>",
            "votes": "2",
            "user": "perror",
            "time": "Jun 8, 2015 at 12:14",
            "is_accepted": false,
            "comments": []
        }
    ]
}