{
    "title": "How to set a breakpoint on GetProcAddress in IDA Pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/8688/how-to-set-a-breakpoint-on-getprocaddress-in-ida-pro",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm usibng IDA 6.5.140116 and cannot seem to get a breakpoint to break.</p>\n<p>My workflow is:</p>\n<ol>\n<li>Open the Imports subview</li>\n<li>Double click on the Name column for the row representing GetProcAddress. This jumps to the IDA View-EIP window.</li>\n</ol>\n<p><img alt=\"IDA View-EIP window\" src=\"https://i.sstatic.net/mnYtv.png\"/></p>\n<ol start=\"3\">\n<li>With the GetProcAddress line selected, I press F2 to set a breakpoint</li>\n</ol>\n<p><img alt=\"Breakpoint settings\" src=\"https://i.sstatic.net/wHJLU.png\"/></p>\n<p>When I run the application, these breakpoints NEVER get hit.  The application isn't using ASLR.  I'm wary about the breakpoint being in .idata when perhaps I need it on the first instruction of GetProcAddress in kernel32.  I'm not sure how to set that exactly.</p>\n<p>I just want to have a breakpoint thrown whenever a certain API call (in this case GetProcAddress... but also RegQueryValueExA for example)  but the press F2 on the address obtained via the Imports window doesn't seem to be working.  What am I missing?  How can I improve my workflow for this?</p>\n</div>",
    "votes": "0",
    "answers": 0,
    "views": "3k",
    "tags": [
        "ida"
    ],
    "user": "Float",
    "time": "Apr 11, 2015 at 21:42",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">You're setting the breakpoint on the pointer to <code>GetProcAddress</code>, not the function itself. In your case, IDA seems not to have recognized the <code>GetProcAddress</code> function itself, and named it <code>unk_7577126E</code>. Set your breakpoint there.</span>",
            "time": null
        },
        {
            "user": "Float",
            "text": "<span class=\"comment-copy\">I agree @GuntramBlohm.  Perhaps a better question would be: Why doesn't IDA properly identify GetProcAddress and instead calls it unk_757126E?</span>",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "<span class=\"comment-copy\">@Float that is indeed a completely different question. One answer could be that the name \"GetProcAddress\" is already taken\".</span>",
            "time": null
        }
    ],
    "answers_data": []
}