{
    "title": "How can I sync structs across multiple IDA databases?",
    "link": "https://reverseengineering.stackexchange.com/questions/8708/how-can-i-sync-structs-across-multiple-ida-databases",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am reversing a few modules which share many c++ classes.  I am currently maintaining a single header file which contains every struct definition from each database.  I update this using a produced header file after working on a module.  I then import it when I begin working on a separate module.  This approach is error prone, and I have lost some progress by mistakenly overwriting modified structs in different databases.</p>\n<p>Is it possible to configure IDA Pro to read and write to a single struct definition file across multiple databases?    If not, what would be a best practice for this type of situation?</p>\n</div>",
    "votes": "6",
    "answers": 2,
    "views": "1k",
    "tags": [
        "ida"
    ],
    "user": "question_asker_777",
    "time": "Apr 16, 2015 at 12:46",
    "comments": [
        {
            "user": "joxeankoret",
            "text": "<span class=\"comment-copy\">I would love to have such a feature. Unfortunately, today it isn't possible. I have the very same problem...</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>you can try extending <a href=\"http://www.openrce.org/downloads/details/227/Structure_Dump\" rel=\"nofollow\">this plugin</a> which already implements the export and import part of the functionality.</p>\n</div>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Apr 16, 2015 at 16:16",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>It is impossible to configure IDA to do it.</p>\n<p>The best simple practice for this that I can imagine is using source control tools such as git or svn for storing exported files.</p>\n</div>",
            "votes": "0",
            "user": "w s",
            "time": "Apr 16, 2015 at 14:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}