{
    "title": "Load multiple modules in one IDA database",
    "link": "https://reverseengineering.stackexchange.com/questions/8711/load-multiple-modules-in-one-ida-database",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a game (Crysis 2) and the developers exported each DLL to be loaded separately by the main executable instead of merging all of them. Instead of having 9 instance of IDA open everytime and switching between tabs I wanted to load all the modules together as if they were 1 executable. I looked at this :</p>\n<p><a href=\"http://www.hexblog.com/?p=6\" rel=\"noreferrer\">http://www.hexblog.com/?p=6</a></p>\n<p>and when I tried the script it had a syntax error, which I later fixed. Once I \"fixed\" it (by merely commenting the function call out) I tried running the script again and ended up with this :</p>\n<p><img alt=\"IDA Error from the script\" src=\"https://i.sstatic.net/swC8v.png\"/></p>\n<p>It then loads the segment but doesn't load strings, imports etc. because as the error stated the main structure in the PE file format was not found..</p>\n<p>Does anyone have any solutions to this or any alternative ways of loading all the DLLs in one database?</p>\n</div>",
    "votes": "5",
    "answers": 0,
    "views": "4k",
    "tags": [
        "ida"
    ],
    "user": "Knochove",
    "time": "Apr 16, 2015 at 18:57",
    "comments": [
        {
            "user": "Carlos Garcia",
            "text": "<span class=\"comment-copy\">There is a second part to the post you mention, describing a better method (<a href=\"http://www.hexblog.com/?p=7\" rel=\"nofollow noreferrer\">hexblog.com/?p=7</a>) Have you tried that?</span>",
            "time": null
        },
        {
            "user": "Knochove",
            "text": "<span class=\"comment-copy\">@CarlosGarcia I tried to use that method by loading the main executable in IDA then running it but sadly the other modules (all the other DLLs) don't get loaded so dumping it would be dumping only the executable by itself. (In short IDA debugger doesn't load the other modules).</span>",
            "time": null
        }
    ],
    "answers_data": []
}