{
    "title": "How should I approach debugging a PE which create a large database?",
    "link": "https://reverseengineering.stackexchange.com/questions/8718/how-should-i-approach-debugging-a-pe-which-create-a-large-database",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am reversing several modules which are dynamically and statically linked into an executable.  I have started learning active analysis by attaching one of my database files to the win32 exe using the local win32 debugger (default settings).  </p>\n<p>Relocating my idb's annotations to map correctly to the exe seems to be taking longer than it should.   I am currently doing static analysis by comparing one idb against a memory snapshot because the relocation time does not seem to be worth the wait.  This creates, what I think may be, unnecessary work because I have to manually copy the annotations from the single module idb to the snapshot idb.</p>\n<p>I want to find out if I can change how I use IDA to speed up relocation.  I have no notion of how long this should take given the database's and exe's size.  </p>\n<pre><code>idb:  ~133 Mb\nexe:  ~650 Mb     Size taken from task manager\nrelocation time:  ~15+ minutes\n</code></pre>\n<p>This is very open ended.  I guess I'm looking for debugger settings, hidden annotation performance hits, etc.  If this is normal I will try to adjust my debugging practice to get the most out of a session.</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "581",
    "tags": [
        "ida",
        "debugging",
        "dynamic-analysis"
    ],
    "user": "question_asker_777",
    "time": "Apr 17, 2015 at 22:52",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If the problem is the time it takes for IDA to rebase the IDB when debugging, then some possible solutions:</p>\n<ol>\n<li><p>Disable ASLR from module, so it keeps loading at the same base address (same base address from the IDB)</p>\n<ul>\n<li>Pros: Works well for main executable</li>\n<li>Cons: might be a problem for DLLs (see 3.); alter file.</li>\n</ul></li>\n</ol>\n<p>How to: Remove <code>IMAGE_DLLCHARACTERISTICS_DYNAMIC_BASE</code> (0x40) from <code>IMAGE_NT_HEADERS.OptionalHeader.DllCharacteristics</code>.</p>\n<ol start=\"2\">\n<li><p>[<strong>Dangerous</strong>] Disable ASLR system wide (would be possible in a spare VM).</p>\n<ul>\n<li>Pros: same as 1.</li>\n<li>Cons: Same as 1. ; Lower whole system protection</li>\n</ul></li>\n</ol>\n<p>How to: change <code>HKLM\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Memory Management\\MoveImages</code></p>\n<ol start=\"3\">\n<li><p>Rebase all DLLs so they don't collide (apply this with 1.)</p>\n<ul>\n<li>Pros: all DLLs will have different address base</li>\n<li>cons: alter files.</li>\n</ul></li>\n</ol>\n<p>How-to: </p>\n<ul>\n<li><code>Rebase</code> tool (rebase.exe; deprecated by editbin.exe)</li>\n<li><a href=\"https://msdn.microsoft.com/en-us/library/xd3shwhf.aspx\" rel=\"noreferrer\">editbin.exe</a> with <code>/REBASE</code> option</li>\n<li><a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/aa363364%28v=vs.85%29.aspx\" rel=\"noreferrer\">ReBase API</a> </li>\n</ul>\n<p>Simply use different base addresses for all the DLLs (do not apply this on system DLLs).</p>\n<ol start=\"4\">\n<li>Use external debugger and synchronize IDB with it.</li>\n</ol>\n<p>How-to:</p>\n<ul>\n<li><p>use <a href=\"https://github.com/quarkslab/qb-sync\" rel=\"noreferrer\">QB-sync</a>: it allows you to debug a binary from a debugger (windbg, ollydbg, gdb, etc.) and synchronize the database with the debugger <strong>without</strong> rebasing the IDB.</p></li>\n<li><p>Pros: works well, lots of things can be done from debugger</p></li>\n<li>Cons: Needs to be confident with an external debugger</li>\n</ul>\n</div>",
            "votes": "5",
            "user": "Neitsa",
            "time": "Apr 18, 2015 at 12:41",
            "is_accepted": true,
            "comments": []
        }
    ]
}