{
    "title": "How to create HexRays variables in IDAPython correctly?",
    "link": "https://reverseengineering.stackexchange.com/questions/8889/how-to-create-hexrays-variables-in-idapython-correctly",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Let's assume we have a function which has a following variables in it:</p>\n<ul>\n<li>Local variables on stack of different types, including types defined in local types window</li>\n<li>Local variables of different types mapped to registers</li>\n<li>Function parameters of different types</li>\n</ul>\n<p>I have 2 IDBs with the same function based on the same binary and I want to pass this data from one IDB to another.\nLet's also assume that I have a solution of passing related data types between databases.</p>\n<p>I know that I can iterate the local variables in decompiled function by using  user_lvar_visitor_t class. \nI also know that there is a function save_user_lvar_settings these variables by using of the same iterator class user_lvar_visitor_t.</p>\n<p>I have the following questions regarding this:</p>\n<ul>\n<li>Which data should I gather from the first database to create these variables in second database correctly (with IDAPython, IDA version is 6.8)?</li>\n<li>How can I create these variables in the second database to make use of save_user_lvar_settings or restore_user_lvar settings (with IDAPython, IDA version is 6.8)?</li>\n</ul>\n<p>Update: Before asking this question I reviewed the following IDA collaboration solutions:  </p>\n<ol>\n<li>Collabreate</li>\n<li>ida2sql</li>\n<li>IDA toolbag</li>\n<li>IDAsynergy</li>\n<li>IDAsync</li>\n</ol>\n<p>One more update</p>\n<ol start=\"6\">\n<li>Diaphora</li>\n</ol>\n<p>And was not able to find solution for my problem in any them.</p>\n</div>",
    "votes": "6",
    "answers": 0,
    "views": "730",
    "tags": [
        "idapython",
        "hexrays"
    ],
    "user": "w s",
    "time": "Jul 28, 2015 at 9:05",
    "comments": [
        {
            "user": "langlauf.io",
            "text": "<span class=\"comment-copy\">Not an answer but maybe of help: ida2sql, see <a href=\"https://github.com/zynamics/ida2sql-plugin-ida\" rel=\"nofollow noreferrer\">github.com/zynamics/ida2sql-plugin-ida</a>. You could have a look at how they treat variables. This may help you, at least, with the first question.</span>",
            "time": null
        },
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">Unfortunately they are not working with hexrays related data. However you are right, I had to update my question with a list of packages I reviewed before asking this question.</span>",
            "time": null
        },
        {
            "user": "tmr232",
            "text": "<span class=\"comment-copy\">Maybe <a href=\"https://github.com/joxeankoret/diaphora\" rel=\"nofollow noreferrer\">Diaphora</a> ? They do use the HexRays data when comparing databases.</span>",
            "time": null
        },
        {
            "user": "w s",
            "text": "<span class=\"comment-copy\">@tmr232 Yes, they use HexRays, but I was unable to find how they passing local variables between databases. As far as I can see, they comparing 2 hex-rays decompilations on a base of AST tree comparison.</span>",
            "time": null
        }
    ],
    "answers_data": []
}