{
    "title": "DLL entry point in memory",
    "link": "https://reverseengineering.stackexchange.com/questions/8966/dll-entry-point-in-memory",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I've been looking into the PE format using a random DLL as a test case. When I look manually at the entry point specified in the optional header (and add the image base, because RVA) it doesn't match the entry point address IDA gives in the exports list.</p>\n<p>I know reading the entry point from the DLL isn't the problem, since if I calculate:</p>\n<pre><code>(AddressOfEntryPoint - [.text section virtual]) + [.text section offset]\n</code></pre>\n<p>(which should give the file offset to the entry point) you can find at the offset the same bytes that IDA says should be in the entry function.</p>\n<p>Also I know that IDA must be calculating the entry point from this field since <code>DLLEntryPoint</code> isn't in the exports list.</p>\n<p>Am I missing something? If I do the same analysis on a normal executable everything works.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "4k",
    "tags": [
        "dll",
        "entry-point"
    ],
    "user": null,
    "time": "May 23, 2015 at 15:57",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">\"it doesn't match the entry point IDA gives\" -- Are you referring to the entry point IDA shows you when you're statically disassembling the DLL, or the entry point you see at runtime when debugging the DLL with IDA?</span>",
            "time": null
        },
        {
            "user": "user12522",
            "text": "<span class=\"comment-copy\">@JasonGeffner the static DLL entry point, which should, AFAIK, be the same at runtime if it wasn't relocated.</span>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">What is the Image Base according to the PE headers? And when you scroll up to the very top of IDA's disassembly, what does IDA report as the \"<code>Imagebase</code>\"? (should be right after the line \"<code>Format      : Portable executable for 80386 (PE)</code>\")</span>",
            "time": null
        },
        {
            "user": "user12522",
            "text": "<span class=\"comment-copy\">@JasonGeffner The image base is the same in the headers as in IDA, <code>0x10000000</code>, which is a bit off from the default <code>0x400000</code> but I guess that's to save relocating.</span>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<span class=\"comment-copy\">Please post screenshots of the mismatch and/or share a link to the binary.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>When you open a DLL file with IDA, if IDA is able to find the <code>DllMain()</code> function then it will automatically navigate to that function when you first disassemble the DLL. Note that the DLL's entry point (which IDA names \"<code>DllEntryPoint</code>\") does not always (and in fact often does not) point to the <code>DllMain()</code> function.</p>\n<p>You can see in the image below (full-size at <a href=\"https://i.sstatic.net/CMUou.png\" rel=\"nofollow noreferrer\">https://i.sstatic.net/CMUou.png</a>) that the DLL's entry point is <code>10807A1C</code>. I've pointed from the entry point's artificial entry in the Exports table (since IDA gets the address from the PE's Entry Point field, not the actual PE Export Table) to the disassembly for the entry point code via arrow #1.</p>\n<p>The code at the entry point (named <code>DllEntryPoint()</code> by IDA) calls <code>___DllMainCRTStartup()</code> via arrow #2. Then <code>__DllMainCRTStartup()</code> calls <code>DllMain()</code> via arrow #3.</p>\n<p>The two function executed before <code>DllMain()</code> are from VC++ 6's runtime library.</p>\n<p><img alt=\"IDA\" src=\"https://i.sstatic.net/CzKQj.png\"/></p>\n</div>",
            "votes": "2",
            "user": "Jason Geffner",
            "time": "May 26, 2015 at 22:11",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user12522",
                    "text": "<span class=\"comment-copy\">Thanks for all your help man, I appreciate it. I've just realized the mismatch was down to the IDA db being out of sync, as always just a very stupid mistake. Nothing wrong with your answer though.</span>",
                    "time": null
                }
            ]
        }
    ]
}