{
    "title": "Anti-kernelmode functions (specifically zwquerysysteminformation) [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/8968/anti-kernelmode-functions-specifically-zwquerysysteminformation",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<div>\n<aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n<div class=\"d-flex fd-column fw-nowrap\">\n<div class=\"d-flex fw-nowrap\">\n<div class=\"flex--item wmn0 fl1 lh-lg\">\n<div class=\"flex--item fl1 lh-lg\">\n<div>\n<b>Closed</b>. This question needs <a href=\"/help/closed-questions\">details or clarity</a>. It is not currently accepting answers.\n                                \n                            </div>\n</div>\n</div>\n</div>\n</div>\n<hr class=\"my12 outline-none baw0 bb bc-blue-400\"/>\n<div class=\"fw-nowrap fc-black-500\">\n<div class=\"d-flex fd-column lh-md\">\n<div class=\"mb0 d-flex\">\n<div class=\"flex--item mr8\">\n<svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\"><path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\"></path></svg>\n</div>\n<p><b>Want to improve this question?</b> Add details and clarify the problem by <a href=\"/posts/8968/edit\">editing this post</a>.</p>\n</div>\n<div class=\"mb0 mt6 d-flex\">\n<p class=\"ml24 pl2\">Closed <span class=\"relativetime\" title=\"2015-05-28 09:44:09Z\">9 years ago</span>.</p>\n</div>\n<div class=\"ml24 pl2\">\n</div>\n</div>\n</div>\n<div class=\"mt24 d-flex gsx gs8\">\n<a class=\"s-btn s-btn__outlined flex--item js-post-notice-edit-post\" href=\"/posts/8968/edit\">\n                        Improve this question\n                    </a>\n</div>\n</aside>\n</div>\n<p>I'm working on a program that has lots of checks, and I've decided to start by disabling their anti-kernel mode, as it'd surely be more easy to isolate than normal anti-debugging. After poking around a little, I found that <code>ntdll.zwquerysysteminformation</code> runs in a loop in the main thread called by several <code>.vmp</code> addresses. Since I <strong>can't make memory changes, even in DLLs</strong> (or debug it normally), I was thinking about setting up kernel mode breakpoints until I have a bit more to go off of, but to do that, I'd need the offset from the base structure containing the byte. Microsoft doesn't seem to provide this, so would anyone happen to know? Or maybe have general pointers on getting past kernel mode detection in obfuscated targets? I know this is pretty broad, but I'm pretty sure they'd only have used the most basic of methods.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "1k",
    "tags": [
        "disassembly",
        "debuggers",
        "kernel-mode"
    ],
    "user": "asd",
    "time": "9 years ago",
    "comments": [
        {
            "user": "higaki",
            "text": "<span class=\"comment-copy\">What is being detected by the check you're trying to disable? Sorry, your question seems a bit unclear about this. Also, when you say \"the base structure\" and \"the byte\", what base structure and what byte are you referring to?</span>",
            "time": null
        },
        {
            "user": "asd",
            "text": "<span class=\"comment-copy\">The check I'm trying to disable detects the presence of kernel mode debuggers. I hope to patch it by patching ZWQuerySystemInformation and I'm not sure how</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I think the check you're talking about (<code>NtQuerySystemInformation</code> with <code>SystemKernelDebuggerInformation</code>) simply checks <code>KdDebuggerEnabled</code> and <code>KdDebuggerNotPresent</code> under the hood (both are single bytes exported from <code>ntoskrnl.exe</code>). You could simply patch those two to get past that particular check. Alternatively, you could go for hooking NtQuerySystemInformation either in usermode (you've mentioned that you can't make memory changes, but that's usually not true - if a memory change at some location is detected, then make the change somewhere else) or in kernelmode (requiring a PatchGuard bypass on 64-bit systems).</p>\n<p>However, your kernel debugger might still be detected by its window/driver name.</p>\n</div>",
            "votes": "0",
            "user": "higaki",
            "time": "May 24, 2015 at 2:49",
            "is_accepted": true,
            "comments": [
                {
                    "user": "asd",
                    "text": "<span class=\"comment-copy\">Sorry for not knowing much about this, but what offsets are those bytes from the structure returned? Their integrity checker uses dynamic regions including a few DLLs, so making edits REALLY isn't favorable and certainly isn't future proof based on the growth of security in the last few months. I've changed the driver name after enabling unsigned drivers and patched all threads that use GetWindowText(A), so I think it should be realistically impossible to see its presence with the patching of the bytes.</span>",
                    "time": null
                },
                {
                    "user": "higaki",
                    "text": "<span class=\"comment-copy\">If you try calling NtQuerySystemInformation with SystemKernelDebuggerInformation and a 0-byte buffer, the function will tell you that it needs exactly 2 bytes for its output (ie. the returned structure has a size of 2), so we can infer that those two bytes are KdDebuggerEnabled and KdDebuggerNotPresent. An answer at <a href=\"http://stackoverflow.com/questions/14791901\">stackoverflow.com/questions/14791901</a> confirms that  this is the correct order. Also, you may want to take care of FindWindow and EnumWindows as well.</span>",
                    "time": null
                }
            ]
        }
    ]
}