{
    "title": "How to connect to embedded device via charge-only USB?",
    "link": "https://reverseengineering.stackexchange.com/questions/8987/how-to-connect-to-embedded-device-via-charge-only-usb",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>For research purposes (vulnerability-analysis), I would like to connect to an embedded Linux-based device via USB. The USB is only intended for the (re)charging (according to the manufacturer of course). Bluetooth is used for the actual communication.</p>\n<p>The device is not listed (via <code>lsusb</code> in Linux or <code>system_profiler SPUSBDataType</code> in OSX) when connected on a PC.</p>\n<p>As a matter of fact, I know that a group of security researchers that has managed to connect to the device via USB. However, this was more than 1.5 year ago. This 'feature' might me disabled by the manufacturer.</p>\n<p>So, what are the possibilities? Are there any tools I can try?</p>\n<p>Thanks in advance.</p>\n</div>",
    "votes": "2",
    "answers": 1,
    "views": "187",
    "tags": [
        "tools",
        "embedded",
        "vulnerability-analysis",
        "usb"
    ],
    "user": "Saf",
    "time": "May 26, 2015 at 10:27",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">The fact that the device uses an USB style connector for charging doesn't mean there's any USB logic chip inside. Maybe the manufacturer had that, for debugging purposes, in the first batch of devices, and removed the logic chip entirely in the meanwhile, especially if someone used it to break in.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>The only way to know whether you can or cannot use the USB port to have access to the device is by probing the Data pins and trying to sniff any traffic. </p>\n<p>A USB connector is composed of 4 pins : USB Vcc (+5V), USB Data-, USB Data+, and GND. If the device is using the Data+ &amp; Data- pins, then you're in business, something must be going on which should most likely be investigated. If those pins are dead, it simply means that the device isn't using them for communication. You can use one of <a href=\"http://www.totalphase.com/solutions/apps/usb-analyzer-guide/\" rel=\"nofollow\">these devices</a> in order to sniff the traffic, or you can use <a href=\"http://openvizsla.org/\" rel=\"nofollow\">this one</a>.</p>\n<p>Another approach which might necessitate a bit more skills in electronics, is to use an oscilloscope on those two pins. Data circulates as an electrical signal, thus you should be able to see transfer patterns if there are any. This option is somehow the most economical since you can easily use any oscilloscope software and invest in the probes (cable) which is way less expensive than the hardware sniffers proposed earlier.</p>\n</div>",
            "votes": "2",
            "user": "yaspr",
            "time": "May 26, 2015 at 14:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}