{
    "title": "Get used jQuery plugins from website",
    "link": "https://reverseengineering.stackexchange.com/questions/90/get-used-jquery-plugins-from-website",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I want to know what jQuery plugins Facebook uses for their special scrollbar, like the two on the left, not the normal one on the right:</p>\n<p><img alt=\"enter image description here\" src=\"https://i.sstatic.net/odVcU.png\"/></p>\n<p>(<a href=\"http://www.pcworld.com/article/240475/two_important_facebook_hover_tricks.html\" rel=\"nofollow noreferrer\">source</a>)</p>\n<p>Generally, how should I go when I want to know what jQuery plugin [website X] uses for [behaviour Y]?</p>\n</div>",
    "votes": "7",
    "answers": 3,
    "views": "2k",
    "tags": [
        "javascript",
        "websites"
    ],
    "user": null,
    "time": "Mar 20, 2013 at 18:51",
    "comments": [
        {
            "user": "user187",
            "text": "<span class=\"comment-copy\">I know this <a href=\"http://stackoverflow.com/q/7125185/1544337\">has been asked on SO</a>, but the answers do not provide basic ideas to reverse engineer javascript.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Both Firefox and Chrome have useful debugging tools to help you find out more information about scripts relating to a behavior. I'll be explaining mostly in Chrome as their default debug tools are more extensive</p>\n<p>As a start, you can usually use <code>Right Click-&gt;Inspect Element</code> to find out information about an element quickly. However this does not appear to work on Facebook's ticker - doing so will select the \"Ticker News\" behind the scrollbar like this:</p>\n<p><img alt=\"inspect fail\" src=\"https://i.sstatic.net/Iq3Vy.png\"/></p>\n<p>Because we cannot see the element being modified, we will have to make some guesses. The ticker stories themselves do not appear to have anything related to the scrollbars. After traveling up to the parent and folding <code>&lt;div class=\"tickerActivityStories\"&gt;</code>, we can start to see things clearly</p>\n<p>By hovering over (and invoking the scrollbars's \"appear\" code) we can observe the page's DOM and note the differences.</p>\n<p><img alt=\"comparison\" src=\"https://i.sstatic.net/2lWVK.png\"/></p>\n<p>So it appears that <code>&lt;div class=\"uiScrollableAreaTrack\"&gt;</code> as it responds accordingly whenever the mouse enters/leaves. The name also makes sense (implies that it's the scrollbar's tracks). By unfolding that <code>div</code>, we'll notice that there is even a \"gripper\" for the scrollbar!</p>\n<p><img alt=\"gripper\" src=\"https://i.sstatic.net/gAaV3.png\"/></p>\n<p>To find out what Javascript is involved with the scrollbars, click on <code>&lt;div class=\"uiScrollableAreaGripper\"</code>, and on the right pane, unfold the <code>Event Listeners</code> tab. We can assume that it responds to focus, and under the <code>Focus</code> section, you'll notice a few references to Javascript files. Hover over the filenames and Chrome will show you the link of the Javascript files. </p>\n<p><img alt=\"listeners\" src=\"https://i.sstatic.net/5WKL1.png\"/></p>\n<p>If you're in luck, the files may have a recognizable name (such as <code>typeahead.min.js</code> or similar, which you can google). Unfortunately in most cases, including ours, we are likely looking at proprietary code or minified code. (Minified code is extremely common to reduce file sizes so that pages load faster)</p>\n</div>",
            "votes": "8",
            "user": "jg0",
            "time": "Mar 21, 2013 at 16:23",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>You can use a profiler and debug tool in your browser to examine the website. Webkit browsers (like Google chromium) have those build in. Firefox has a good plugin called firebug.</p>\n<p>With the profiler you can see which functions are called how often, which can give you an idea where to look. Then with the debugger you can set break points in the javascript code to narrow down the exact location</p>\n</div>",
            "votes": "2",
            "user": "txwikinger",
            "time": "Mar 21, 2013 at 13:29",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I used <a href=\"https://noraesae.github.io/perfect-scrollbar/\" rel=\"nofollow noreferrer\">https://noraesae.github.io/perfect-scrollbar/</a> that is very similar and easy to use</p>\n</div>",
            "votes": "0",
            "user": "Nicolás Kuglien",
            "time": "Jan 26, 2017 at 19:51",
            "is_accepted": false,
            "comments": []
        }
    ]
}