{
    "title": "Tracing function call args with IDA Pro",
    "link": "https://reverseengineering.stackexchange.com/questions/9029/tracing-function-call-args-with-ida-pro",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Right now I'm trying to place a trace point and hook it with the Python code that pulls all relevant stuff from the stack. Unfortunately it just gives me the garbage all the time, because the value in cpu.esp is being updated <strong>after</strong> this code is getting executed, while I need it to happen before.</p>\n<pre><code>class TraceRegisters(DBG_Hooks):\n    def dbg_bpt(self, tid, ea):\n        fn = GetFunctionName(ea)\n        if fn.startswith(\"Read\"):\n            print \"%s(0x%x)\" % (fn, Dword(cpu.esp+4))\n        elif fn.startswith(\"Write\"):\n            print \"%s(0x%x, 0x%x)\" % (fn, Dword(cpu.esp+4), Dword(cpu.esp+8))\n        return 0\n</code></pre>\n<p>I'm feeling sorry for doing it in a callback that is intended for deciding if the debugger should stop, but I just couldn't find anything better.</p>\n<p>Is there a way to do what I want with just the power of IDAPython and/or plain IDA?</p>\n</div>",
    "votes": "5",
    "answers": 0,
    "views": "2k",
    "tags": [
        "ida",
        "idapython",
        "functions"
    ],
    "user": "vdudouyt",
    "time": "May 30, 2015 at 11:40",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">If the instruction where you place your trace point is a <code>call</code>, just subtract 4 from each of your <code>esp</code> offsets, since the <code>call</code> will subtract 4 from <code>esp</code>. Likewise, if your trace point is on a <code>ret</code>, add 4 to each offset. And if it's anything else, put your trace point at the next instruction.</span>",
            "time": null
        },
        {
            "user": "vdudouyt",
            "text": "<span class=\"comment-copy\">The problem is that the value contained in cpu.esp is absolutely garbage. That's because this callback runs before IDA pro actually breaks, while I'd love it to run after.</span>",
            "time": null
        },
        {
            "user": "vdudouyt",
            "text": "<span class=\"comment-copy\">By the way, I managed to overcome this problem by attaching this callback to a hotkey in debugger. So that it stops on a breakpoint first, then I press F12, and then it logs this message and continues forward. And - voila! - it's working fine. The only problem is that now I have to tap this hotkey like crazy.</span>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">I'm <b>very</b> astonished to read that the CPU registers doesn't seem to be updated when the breakpoint condition runs. This is against all my experience, and <a href=\"https://www.hex-rays.com/products/ida/support/idadoc/1407.shtml\" rel=\"nofollow noreferrer\">Hex-Rays explicitly mentions evaluating register variables in a breakpoint condition</a>. Maybe it's a python problem, did you try idc directly? What happens if you print cpu.esp in your function, then compare it with what IDA shows in the breakpoint? Oh, and <i>maybe</i> you need to call RefreshDebuggerMemory if the memory configuration has changed.</span>",
            "time": null
        },
        {
            "user": "javs",
            "text": "<span class=\"comment-copy\">Had the exact same problem, RefreshDebuggerMemory at the top of the callback does indeed resolve the issue.</span>",
            "time": null
        }
    ],
    "answers_data": []
}