{
    "title": "OpenOCD, Buspirate JTAG reads fail after short time",
    "link": "https://reverseengineering.stackexchange.com/questions/9063/openocd-buspirate-jtag-reads-fail-after-short-time",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a board that I'm reversing - and attempting to dump the image out of the NAND flash.</p>\n<p>Board has a SAMSUNG s3c2440 SOC CPU, and there's a SAMSUNG k9f1g08u0d 128 MB NAND flash device.</p>\n<p>I'm using a BusPirate through JTAG to connect. I am able to run OpenOCD and view the chip, dump registers, etc.</p>\n<p>However, the whole setup is unstable. I'm running on a Linux host PC. Steps are:</p>\n<ul>\n<li>power up the target </li>\n<li>power up buspirate </li>\n<li>start openocd daemon</li>\n<li>start telnet into openocd daemon</li>\n<li>enable debug_level 3 </li>\n<li>just watch the debug messages flow on the openocd daemon window.</li>\n<li><p>the flow of messages stops after 15 seconds or so with the following error:</p>\n<pre><code>Error: 7399 146854 bus_pirate.c 1091 buspirate_serial_read() should have read = 15 actual size = 0 \nError: 7399 146854 bus_pirate.c 1091 buspirate_serial_read() Error treading data timeout = 10, len = 0, size = 15\n</code></pre></li>\n</ul>\n<p>I have a Buspirate 3, with the latest version 6.1 firmware.\nOpenocd is version 0.9.0</p>\n<p>Any suggestions to get a setup to be more stable is welcomed.</p>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "336",
    "tags": [
        "jtag"
    ],
    "user": "doe0731",
    "time": "Jun 4, 2015 at 16:13",
    "comments": [
        {
            "user": "devttys0",
            "text": "<span class=\"comment-copy\">I often have devices that dynamically disable JTAG after boot in order to use the JTAG pins for additional I/O. Not sure if that's what's happening here, but worth checking into. Can you test your setup on some known-good development board to see if you still have the same issues?</span>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">devttys0's comment is a good hint, especially if it always happens at the same stage in the boot process. However, your description of 'start openocd', 'telnet into openocd' seems to explain that this happens after the system has been running for a while. I'd expect a problem with the signal itself, maybe caused by  a bad power supply or similar, that disturbs the signal on the JTAG pins. Do you have a scope to hook up to the pins to verify this? Also, the folks at the electrical engineering SE might have more experience with this.</span>",
            "time": null
        }
    ],
    "answers_data": []
}