{
    "title": "How to update the injected calls' address after patching binary?",
    "link": "https://reverseengineering.stackexchange.com/questions/9165/how-to-update-the-injected-calls-address-after-patching-binary",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>After using IDA analysing a dll file, I replaced a call with another one. That is, replacing <code>CALL xxxx</code> with <code>CALL ds:yyyy</code>. (<code>ds:yyyy</code> has been referenced by other locations already). And I used IDA to patch the binary.</p>\n<p>But the problem is, when executing the module, <code>ds:yyyy</code> is not updated based on the module imagebase, and therefore an invalid address.</p>\n<p>How can I deal with this kind of situation? Need I patch the reloc section too?\nThanks.</p>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "262",
    "tags": [
        "ida",
        "pe",
        "patching"
    ],
    "user": "haohaolee",
    "time": "Jun 17, 2015 at 17:30",
    "comments": [
        {
            "user": "Spl3en",
            "text": "<span class=\"comment-copy\">Could you provide more information about the address yyyy ? Is it an address from another module, an address that changes everytime you launch the binary, or a static address ?</span>",
            "time": null
        },
        {
            "user": "haohaolee",
            "text": "<span class=\"comment-copy\">@Spl3en Thanks for reply. I have managed to solve this. It is an address that would be changed every time I launch it because of the ASLR and address relocation. I add a reloc record in relocation table and it runs well.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Answer it myself. It is actually a portable executable. And the addresses that are hard-coded will be updated every time I launch it by relocation table.</p>\n<p>I modified the table by tools and it runs well.</p>\n</div>",
            "votes": "1",
            "user": "haohaolee",
            "time": "Jun 22, 2015 at 8:29",
            "is_accepted": false,
            "comments": []
        }
    ]
}