{
    "title": "How to debug the DLL of an EXE using IDA Pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/9328/how-to-debug-the-dll-of-an-exe-using-ida-pro",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I'm fairly new to the RE world, started right around a week and have gotten my hands dirty with some really good stuff on this website. Pardon my naive knowledge.</p>\n<p>Currently, I'm trying to <strong>reverse a DLL file of a certain EXE</strong>. \nThe EXE makes calls to functions of this DLL for looking up certain values which I plan to patch eventually.</p>\n<p>How do I go about debugging the DLL while the application is running? </p>\n<p><strong>I would like to be able to place a break point in my DLL and get a hit in IDA Pro while the call is made from the application.</strong></p>\n<p>Right now, I patch the DLL by simply hoping for it to work, but I'm pretty sure that there exists a much productive method.</p>\n<p>I'm using <strong>IDA Pro</strong> as my flavor of tool.\nYou could suggest me if some other disassembler can help me achieve the same.</p>\n<p>Could someone be kind enough to guide me around this task?</p>\n</div>",
    "votes": "22",
    "answers": 1,
    "views": "46k",
    "tags": [
        "ida",
        "debugging",
        "dll",
        "dll-injection"
    ],
    "user": "Pramod Mohandas",
    "time": "Jul 11, 2015 at 18:14",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Very easy, if I got you right:</p>\n<ol>\n<li>Make an Ida project from the DLL, i.e. drag and drop the dll into the blank Ida page.</li>\n<li>In Menu Debugger, Process Options, put the path to your exe into the textbox \"Application\", Into \"input file\" put the path to your DLL. Confirm with OK.</li>\n<li>Start with menu Debugger, Start Process or F9.</li>\n</ol>\n<p>Your breakpoint should be hit.</p>\n</div>",
            "votes": "30",
            "user": "josh",
            "time": "Jul 11, 2015 at 20:11",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Pramod Mohandas",
                    "text": "<span class=\"comment-copy\">Exactly what I was looking for. Is it possible for me to debug the DLL when the application is already running as a process?</span>",
                    "time": null
                },
                {
                    "user": "josh",
                    "text": "<span class=\"comment-copy\">Menu Debugger, Attach to Process...</span>",
                    "time": null
                }
            ]
        }
    ]
}