{
    "title": "Why are PUSHF and POPF so slow?",
    "link": "https://reverseengineering.stackexchange.com/questions/9348/why-are-pushf-and-popf-so-slow",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>the experiment is on <code>32-bit</code> <code>x86</code> Linux.</p>\n<p>I am doing some static binary instrumentation work, and basically I am trying to insert some instructions below to the beginning of every basic block. </p>\n<pre><code>BB23 : push %eax\n\nmovl index,%eax\nmovl $0x80823d0,buf(,%eax,0x4)\nadd $0x1,%eax\ncmp $0x400000,%eax\njle BB_23_stub\nmovl $0x0,%eax\nBB_23_stub:movl %eax,index\n\npop %eax\n</code></pre>\n<p>Note that I need to use <code>cmp</code> instruction, and in order to guarantee that <code>flags</code> can restore to the original value, I use <code>pushf</code> and <code>popf</code> to store\\load <code>flags</code> on the stack. </p>\n<p>Then it becomes this:</p>\n<pre><code> BB_23 :    push %eax\n       pushf               \n       movl index,%eax\n       movl $0x17,buf(,%eax,0x4)\n       add $0x1,%eax\n       cmp $0x400000,%eax\n       jle BB_23_stub\n       movl $0x0,%eax\nBB_23_stub:movl %eax,index\n       popf             \n       pop %eax\n</code></pre>\n<p>I tested the performance with and without <code>pushf</code> and <code>popf</code> (I am using <code>gzip</code> and <code>bzip</code>). And to my surprise, performance penalty could increase  even 3 times after using the <code>pushf</code> and <code>popf</code> instructions!!</p>\n<p>However, without <code>pushf</code> and <code>popf</code>. The compression results of <code>gzip</code> and <code>bzip</code> are incorrect.</p>\n<p>So here is my question:</p>\n<p>Why pushf and popf so slow? Am I using it in a correct way?</p>\n<p>I cannot afford too much performance penalty introduced by pushf and popf. Is there any way I can avoid the high overhead and also keep the correct semantics? (protecting the value in flags, basically..)</p>\n<p>Am I clear enough? Could anyone give me some help?</p>\n</div>",
    "votes": "5",
    "answers": 4,
    "views": "2k",
    "tags": [
        "binary-analysis",
        "x86",
        "instrumentation",
        "binary"
    ],
    "user": "lllllllllllll",
    "time": "Sep 19, 2015 at 2:49",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">1) Just an idea without any claim to correctness: <code>pushf</code> might wreck havoc on the instruction pipeline, since it needs all flags valid, while most other instructions don't care about the flags. In the same way, the pipeline might get delayed by popf if an instruction that needs a flag follows. 2) I'd replace your <code>add</code> - <code>cmp</code> - <code>jle</code> - <code>mov</code> combo with <code>inc %eax</code>, <code>and $0x3fffff, %eax</code> which should speed up the code a bit since it avoids a branch. This won't help you with flags, however, I don't see a way to do this without touching flags.</span>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">Oh, and replacing <code>inc %eax</code>  with <code>lea eax, [eax+1]</code> (sorry, Intel Syntax, I don't really like AT&amp;T syntax and don't know how to translate it right now) will avoid changing the flags like <code>inc</code> does. Now if i could just figure out how to do the <code>and</code> without changing flags and you could get rid of those pesky <code>pushf</code> and <code>popf</code> instructions ...</span>",
            "time": null
        },
        {
            "user": "lllllllllllll",
            "text": "<span class=\"comment-copy\">@GuntramBlohm. Brilliant!! I really really appreciate your kind help! It really saves my ass..</span>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">You seem to be starting with index 0, incrementing up to <code>0x400000</code> and wrapping around there. If you can afford to do it the other way round, you could misuse the <code>loop</code> instruction which doesn't change flags. Initialize your index to <code>0x400000</code>, use <code>ecx</code> instead of <code>eax</code>, and to decrement and re-init on zero, use <code>loop forward</code>, <code>mov $0x400000, %ecx</code>, <code>forward: movl %ecx, index</code>. Consider the <code>loop</code> a <code>decrement and jump if not zero</code>.</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Clever (some would say incomprehensible) misuse of x86 features could do this for you. The <code>loop</code> instruction will decrement the <code>ecx</code> register, jump if it's nonzero, and not modify flags. You can use this as a <code>jump forward</code> instruction as well, like this:</p>\n<pre><code>BB23:      push %ecx\n           movl index, %ecx\n           movl $0x17, buf-4(,%ecx,4)\n           loop BB23_stub\n           movl $0x400000, %ecx\nBB23_stub: movl %ecx, index\n           pop %ecx\n</code></pre>\n<p>Note that ecx runs from 0x400000 to 1 here, not from 0 to 0x3fffff, so i had to subtract <code>4</code> from the address of <code>buf</code>, and you need to read the buffer top to bottom when analyzing it. Don't forget to initialize <code>index</code> to <code>0x400000</code> at the start of your code somewhere. You'll have to test how much the penalty of  branching in <code>loop</code> costs in comparison to how much removing <code>pushf</code>/<code>popf</code> gains.</p>\n</div>",
            "votes": "9",
            "user": "Guntram Blohm",
            "time": "Jul 14, 2015 at 19:27",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Peter Cordes",
                    "text": "<span class=\"comment-copy\"><code>loop</code> is really slow (7 uops, throughput of one per 5 cycles), but saving/restoring the flags is even slower.  (<code>pushf</code> = 3 uops, <code>popf</code> = 9).  (Intel SnB/Haswell).</span>",
                    "time": null
                },
                {
                    "user": "Peter Cordes",
                    "text": "<span class=\"comment-copy\">Yes, it sounds like <code>loop</code> is your best option.  Just keep in mind, that one <code>loop</code> is taking more execution resources, and more space in the uop cache, than all 6 other instructions combined.  Hopefully it's still light-weight enough for your purposes.</span>",
                    "time": null
                },
                {
                    "user": "Peter Cordes",
                    "text": "<span class=\"comment-copy\">Possibly faster: <code>push %eax / lahf / use flags / sahf / pop %eax</code>.  load/store AH from/to flags are single-uop, single-cycle-latency instructions on current Intel and AMD CPUs.  If you're instrumenting something that doesn't touch the MMX / x87 registers, you could use them for storing index, and maybe also for masking it after wraparound.  Oh, I see there was already an answer with this.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>If you look at <code>lib/Target/X86/X86InstrInfo.cpp</code> in the <code>LLVM</code> source code you can see that they prefer the <code>LAHF</code> and <code>SAHF</code> instructions to <code>PUSHF</code> and <code>POPF</code> for speed reasons.  These instructions don't deal with the overflow flag <code>OF</code> so this must be handled with separately.</p>\n<pre><code>alt_pushf:        seto %al                  ; save OF to AL\n                  lahf                      ; save other flags to AH\n                  push %eax                 ; push\n\nalt_popf:         pop %eax                  ; pop\n                  addb $127, %al            ; restore OF\n                  sahf                      ; restore other flags\n</code></pre>\n<p>I don't know if this will be any faster than @GuntramBlohm's clever <code>LOOP</code> option so it might be worth benchmarking.</p>\n<p>(Note that should you want to use this in future for 64-bit code you will need to check for the presence of the <code>LAHF</code> and <code>SAHF</code> instructions.)</p>\n</div>",
            "votes": "4",
            "user": "Ian Cook",
            "time": "Jul 18, 2015 at 20:07",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Posting a 2nd answer for a different method, combining <code>cmov</code> to avoid a skip-1-instruction branch with @Ian Cook's nice lahf/sahf.</p>\n<pre><code>       push   %ecx\n       movl   index, %ecx\n\n       push   %eax\n       seto   %al            # save OF to AL\n       lahf                  # save other flags to AH\n\n       movl   $0x17,  buf(,%ecx,0x4)\n       dec    %ecx\n       cmovc  buflen, %ecx       # load buflen constant from memory on wraparound\n\n       addb $127, %al            # restore OF\n       sahf                      # restore other flags\n       pop %eax\n\n       movl   %ecx,index\n       pop %ecx\n</code></pre>\n<p>This is 14 insns, all single-uop single cycle latency (on Intel).  So it's probably still slower than the LOOP version, except for not affecting the branch predictor if this code is duplicated all over the place.</p>\n<p>With <a href=\"https://en.wikipedia.org/wiki/Intel_ADX\" rel=\"nofollow\">Intel ADX</a> (add-with-carry using CF or OF, to allow two dep chains in parallel), you can avoid clobbering the overflow flag.  But it doesn't take an immediate arg, so you need a constant (-4) in memory.  You need to detect wrapping around zero, and avoid <code>cmp</code>.  This instruction set extension was first supported in Broadwell (barely available for desktops, and not even all currently-for-sale laptops have it.)</p>\n<p>Anyway, <code>clc / adcx  minus_one, %ecx</code>  instead of <code>dec %ecx</code> would save net instructions (one clc to save a <code>seto</code> and <code>addb $127</code> to save/restore the overflow flag), which isn't much.  13 uops is still more than my other answer, using an MMX reg for sub/mask to avoid touching flags.</p>\n<p>Another possibility is using <code>lea</code>, and zeroing the high bits with a non-flag-affecting left and right shift (<a href=\"https://en.wikipedia.org/wiki/Bit_Manipulation_Instruction_Sets#BMI2\" rel=\"nofollow\">BMI2</a> (Haswell) instruction set's <code>SHLX / SHRX</code>).  This avoids touching flags entirely:</p>\n<pre><code>       push   %ecx\n       movl   index, %ecx\n\n       movl   $0x17,  buf(,%ecx,0x4)\n       lea    -1(%ecx), %ecx\n       push   %eax\n       movl   $bit_count, %eax   # 32 - significant bits in buflen\n       shlx   %eax, %ecx, %ecx   # shift count has to be in a reg\n       shrx   %eax, %ecx, %ecx\n       pop    %eax\n\n       movl   %ecx,index\n       pop %ecx\n</code></pre>\n<p>Well crap, no-flag shifts are only available as (Intel syntax) <code>shrx  r32a,  r/m32,  r32b</code>, loading the the value to be shifted, not the shift count.  And an immediate shift count isn't available either, so I still needed to push/pop eax to get a 2nd register.</p>\n<p>So this is 11 uops on Intel, all single-cycle latency.  It still doesn't beat the mmx version.</p>\n</div>",
            "votes": "2",
            "user": "Peter Cordes",
            "time": "Jul 22, 2015 at 8:30",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>What if you have <code>index</code> count downward, and unconditionally mask it to handle wraparound, instead of a conditional?  Hmm, <code>AND</code> sets all the flags, including <code>OF</code> (which isn't saved/restored with <code>lahf/safh</code>).  You could use an MMX register, but <code>PAND</code> doesn't have an immediate form, so you'd need to have the constant in memory.</p>\n<pre><code>BB23:      push %ecx\n           ; movq %mm0, -8(%esp)   ; not safe if a signal handler fires while data is below the stack.\n            ;  x86 has no red-zone.  But we can't sub $16, %esp  without clobbering flags\n           movq   %mm0, save_mm0\n           movd   index, %mm0\n           psubd  one, %mm0      ;  mmx has no dec-by-one\n           pand   my_mask, %mm0   ; (0x400000-1).  0-max -&gt; untouched.  all-1s after wraparound -&gt; max\n           movd   %mm0, %ecx\n           movl   $0x17, buf(,%ecx,4)\n           ; movq   -8(%esp), %mm0\n           movq   save_mm0, %mm0\n           movl   %ecx, index\n           pop    %ecx\n</code></pre>\n<p>On Intel, this is 10 uops, so it's potentially faster than the version using <code>LOOP</code>.  Or only 8, if the code you're instrumenting doesn't use MMX, or doesn't use SSE, so you could avoid saving / restoring a vector reg.  Jumps interrupt the flow of uops from the decoders or uop cache, so it has that going for it, too.</p>\n<p>It needs another 8 bytes of constants.  If they're in the same cache-line as index, that's not a big deal.  It does take significantly more instruction bytes.  On the upside, it's branchless, so inserting it all over the place won't pollute the branch predictor with a lot of taken branches.  (Arranging branches so the non-taken case is the common one would be better.  The save/restore flags version could use a cmov from a zeroed memory location, instead of a branch.)</p>\n<p>On SnB and newer, <a href=\"https://stackoverflow.com/questions/26046634/micro-fusion-and-addressing-modes\">the scaled-offset version of store might not micro-fuse</a>.   If the immediate data doesn't count as a 3rd input dependency, then it still can.  Otherwise, scale everything up by 4, including the constant for <code>psubd</code>, then the store is <code>movl $0x17, buf(%ecx)</code>.</p>\n<p>My first version was going to save %mm0 on the stack, but there's no push for MMX regs.  That would have made it 11 uops, counting the stack-engine synchronization uop inserted before the <code>movq %mm0, -8(%rsp)</code>, since it follows a stack instruction (<code>push</code>).</p>\n</div>",
            "votes": "1",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}