{
    "title": "Reverse Engineering Firmware",
    "link": "https://reverseengineering.stackexchange.com/questions/9476/reverse-engineering-firmware",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I have a HEX file with a firmware for Attiny45. What I want to do is to extract some kind of formula that is coded inside it. I have done some research (mostly to find out that \"it is not possible\", etc, etc) but I decided I could give it a try since other parts of my research showed me that most of the people that ask this type of question barely knows what a HEX file is.</p>\n<p>The objective of this post is not to came up with a brightly C code from the HEX file but rather build solid knowledge about the subject. I'm aware that the compiler, doing its job, can make my own job harder but there is some kind of structure (maybe primitive) that needs to be followed for the CPU to be able to execute the code.</p>\n<p>So, I sat on my desk and coded a little Python tool to help me in the process. It loads the HEX file, and I interactively can add information to it. Here is what I've got so far:</p>\n<p>The first line of the HEX file, says:</p>\n<pre><code>: 02 0000 04 0000 FA\n</code></pre>\n<p>Which was decoded by the tool to:</p>\n<pre><code>:       --&gt; MARK\n02      --&gt; RECORD LENGTH\n0000    --&gt; LOAD OFFSET\n04      --&gt; RECORD TYPE (EXTENDED LINEAR ADDRESS RECORD)\n0000    --&gt; DATA\nFA      --&gt; CHECKSUM\n</code></pre>\n<p>Seems that this line serves the propose of telling that the initial address on which code should be put is <code>0x0000</code>.</p>\n<p>Second, the next line says:</p>\n<pre><code>: 20 0000 00 34C0FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF50C07EEE7EB9 51\n</code></pre>\n<p>The tool decoded it to:</p>\n<pre><code>:    --&gt; MARK\n20   --&gt; LENGHT OF THE RECORD\n0000 --&gt; OFFSET\n00   --&gt; RECORD TYPE (00 -&gt; DATA RECORD) 34C0FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF50C07EEE7EB9 (ACTUAL DATA)\n51   --&gt; CHECKSUM\n</code></pre>\n<p>Here is where the fun and the questions starts.</p>\n<ol>\n<li><p>I could not find anywhere the memory map of the ATTiny45. I thought it should be somewhere in the data sheet or the instruction set manual. From what I could figure out, at <code>0x0000</code> lives the interrupt vector (page 49, data sheet) and the first one is the reset vector. So, AVR being little endian and instructions being 16bits-wide, I can decode that the reset vector contains the value <code>0xC034</code>. Using the instruction set, I figure out that <code>0xC034</code> is:</p>\n<pre><code>rjump 0x034\n</code></pre>\n<p>Is this correct?</p></li>\n<li><p>Continuing with this line of thinking, the same line pointed before shows that some of the interrupt vectors have values <code>0xFFFF</code>, which causes me surprise but does not seem to be a problem since probably these will be disabled. The only other vector that have a working value is <code>USI_OVF_ISR</code>, which is equal to <code>0xC050</code>. So, according to the ideas presented before, this says that <code>USI_OVF_ISR</code> has the instruction:</p>\n<pre><code>rjump 0x050\n</code></pre>\n<p>Is this also correct?</p></li>\n<li><p>If the reset vector points to <code>0x034</code>, this says that the program will begin running at <code>0x034</code>. The next line</p>\n<pre><code>: 20 0020 00 7FE77FB9B89A089570EE7EB95FB9B89A08957EEE7EB9B898089570EE7EB9B898 22\n</code></pre>\n<p>Shows that <code>0x034</code> is <code>0xB898</code> and that is the first instruction that will be executed.</p>\n<p>Is this correct?</p></li>\n</ol>\n</div>",
    "votes": "3",
    "answers": 1,
    "views": "830",
    "tags": [
        "firmware",
        "hex"
    ],
    "user": "daniel.franzini",
    "time": "Jul 28, 2015 at 12:46",
    "comments": [],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<ol>\n<li><p>Seems to be almost correct, since the <a href=\"http://www.atmel.com/Images/Atmel-2586-AVR-8-bit-Microcontroller-ATtiny25-ATtiny45-ATtiny85_Datasheet.pdf\" rel=\"nofollow\">data sheet</a> says in chapter 8.1, Resetting the AVR:</p>\n<blockquote>\n<p>The instruction placed at the Reset Vector must be a RJMP – Relative\n  Jump – instruction to the reset handling routine</p>\n</blockquote>\n<p>However, page 202 - instruction set summary - explains <code>RJMP</code> like this:</p>\n<pre><code>RJMP    k    Relative Jump PC   PC + k  + 1        \n</code></pre>\n<p>Which would imply that <code>RJMP</code> at address <code>PC=0</code> with a <code>k=0x34</code> jumps to address <code>0x35</code>.</p>\n<p>Unfortunately, the data sheet doesn't seem to have an opcode table to confirtm that <code>C0</code> is indeed a <code>RJMP</code>.</p>\n<p>Also, Chapter 5.1 says</p>\n<blockquote>\n<p>The ATtiny25/45/85 contains \n  2/4/8K bytes On-chip In-System Reprogrammable Flash memory for program storage. Since all AVR instructions are 16 or 32 bits \n  wide, the Flash is organized as 1024/2048/4096 x 16.</p>\n</blockquote>\n<p>and Chapter 9 shows a table (page 48) that has examples of <code>RJMP</code> instructions which, though they need 2 bytes, are packed into one address each. Starting at offset 0, and with 15 reset vectors that are 16 bits wide each, the program starts at address <code>0x0F</code>. So the address space seems to be divided into 16-bit chunks per address, not 8-bit bytes, which would mean you have to double your addresses to get the appropriate byte index in your hex array.</p></li>\n<li><p>Seems incorrect to me, since PC is <code>0D</code> (at offset <code>1A</code> in your hex bytes) and <code>r=50</code>, so the <code>RJMP</code> should jump to <code>0D+50+1</code>=<code>5E</code>, or offset <code>BC</code> (<code>2*0x5E</code>) in your hex bytes.</p></li>\n<li><p>According to my assumption that addresses denote 16-bit words, and adding the <code>+1</code> from the opcode tab, you should probably look at <code>0x35*2=0x6A</code> to find the first instruction to be executed.</p></li>\n</ol>\n</div>",
            "votes": "2",
            "user": "Guntram Blohm",
            "time": "Jul 28, 2015 at 22:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}