{
    "title": "BSWAP and CMP as obfuscation for Anti-Debugging?",
    "link": "https://reverseengineering.stackexchange.com/questions/9507/bswap-and-cmp-as-obfuscation-for-anti-debugging",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am trying to attach debug a program that has an \"anti-debug\" feature on it.  When stepping through, it seems to step through a maze of call and jmp commands that eventually just loop around.  The loop only happens when stepping line by line and I am trying to understand it.  </p>\n<p>I don't know if there is added obfuscation, but why would lines such as this appear?</p>\n<pre><code>014D658C   0FCA    BSWAP EDX\n014D658E   0FCA    BSWAP EDX\n</code></pre>\n<p>If I understand correctly, BSWAP will just invert the bits, but twice in a row should leave the EDX register untouched.  I've also noticed other strange things like comparing registers and then seemingly doing nothing with the result (no jump calls after or setcc or anything like that)</p>\n<pre><code>014D657C   66:81FF 8408     CMP DI,884\n014D6581   30D8             XOR AL,BL\n014D6583   8D96 1A30A4DD    LEA EDX,DWORD PTR DS:[ESI+DDA4301A]\n</code></pre>\n</div>",
    "votes": "1",
    "answers": 0,
    "views": "134",
    "tags": [
        "anti-debugging"
    ],
    "user": "Chemistpp",
    "time": "Jul 30, 2015 at 19:21",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<span class=\"comment-copy\">Yes,  this looks like obfuscation. The two <code>BSWAP</code>s don't do anything (watch out for code jumping to the second <code>BSWAP</code> however, and the <code>CMP DI,884</code> doesn't do anything either (as the the next instruction resets the flags). This may be an attempt to evade antivirus signatures as well, by introducing nonsense into the code that can be modified to different nosense easily.</span>",
            "time": null
        },
        {
            "user": "Chemistpp",
            "text": "<span class=\"comment-copy\">Okay, I am currently going through the loop each process at a time trying to resolve what is actually important.  This is kind of fun, like a puzzle.</span>",
            "time": null
        },
        {
            "user": "josh",
            "text": "<span class=\"comment-copy\">BSWAP does not invert bits, but swaps the low and high-order 16 bits of a 32 bit register. Two in a row (with the same register) are a NOP.</span>",
            "time": null
        },
        {
            "user": "Chemistpp",
            "text": "<span class=\"comment-copy\">Yeah, I meant invert them from end to end, but I can see how that is confusing.  I meant swap the order is all.  Twice in a row, still is pointless.</span>",
            "time": null
        },
        {
            "user": "Chemistpp",
            "text": "<span class=\"comment-copy\">Done some reading about this, apparently people can get serious and send you into a loop softly at first that is nonsensical just to waste your time... filthy.  I've learned about assembly language though.</span>",
            "time": null
        }
    ],
    "answers_data": []
}