{
    "title": "Reverse engineer malware embedded in Microsoft rtf",
    "link": "https://reverseengineering.stackexchange.com/questions/9523/reverse-engineer-malware-embedded-in-microsoft-rtf",
    "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>I am currently trying to analyse a particular document that was flagged as malware in our honey pot.</p>\n<p>In virus total is shows up as being a Trojan and I have reason to believe it might be connected to </p>\n<p><a href=\"https://github.com/rapid7/metasploit-framework/blob/master/modules/exploits/windows/fileformat/ms14_017_rtf.rb\" rel=\"nofollow\">https://github.com/rapid7/metasploit-framework/blob/master/modules/exploits/windows/fileformat/ms14_017_rtf.rb</a></p>\n<p>I am searching Google and seeing very little information on how I can go about diagnosing  and reversing this. I want to see where it might be trying to connect back and what this is actually doing.</p>\n<p>How can I go about reverse engineering  malware embedded in a Windows rtf and see what this is designed to do ?</p>\n<p>I can provide the malware if anyone wants.</p>\n</div>",
    "votes": "0",
    "answers": 1,
    "views": "200",
    "tags": [
        "malware"
    ],
    "user": "LUser",
    "time": "Aug 1, 2015 at 6:06",
    "comments": [
        {
            "user": "LUser",
            "text": "<span class=\"comment-copy\">Why was this marked down without a comment?</span>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<div class=\"s-prose js-post-body\" itemprop=\"text\">\n<p>Analysis often isn't worth it, unless your interest is academic don't spend too much time in analysing it. AV companies tend to use sandboxes and just monitor behaviour, that might be enough for you. Run the malware along with wireshark to see where it connects out to and block the C&amp;C server IP address (as well as the domain the email was from and delete the message from all inboxes).</p>\n<p>K, since that didn't answer your question, there seems to be a lot of research on the topic. A quick google for \"extract rtf payload\" gives a number of articles as well as some scripts to do it. Throw this in olly or ida and let the tracing begin.</p>\n<p>O, and I hope your patching level was up to date :)</p>\n</div>",
            "votes": "1",
            "user": "s3c",
            "time": "Aug 1, 2015 at 7:45",
            "is_accepted": true,
            "comments": [
                {
                    "user": "LUser",
                    "text": "<span class=\"comment-copy\">The google search would have sufficed, but thanks for being verbose!</span>",
                    "time": null
                }
            ]
        }
    ]
}