{
    "title": "What is the average time for malware analysis?",
    "link": "https://reverseengineering.stackexchange.com/questions/10642/what-is-the-average-time-for-malware-analysis",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I was wondering what is the average time for you to classify (by reverse engineering) if a suspicious file is a malware or not?\n </p>\n <p>\n  Thanks\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 3,
    "views": "774",
    "tags": [
        "malware"
    ],
    "user": "Danny Spatny",
    "time": "Aug 17, 2015 at 23:02",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The question will likely get closed as\n  <strong>\n   primarily opinion-based\n  </strong>\n  , but I'll give my answer anyway.\n </p>\n <p>\n  If you're just trying to determine if it's likely malicious or not, it can\n  <em>\n   usually\n  </em>\n  be done in less than 5 minutes.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Jason Geffner",
            "time": "Aug 18, 2015 at 1:24",
            "is_accepted": false,
            "comments": [
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">the point being that determining the likelihood of it being malicious is very different from understanding what exactly it does.  We can decide quickly if it's probably malicious or not, but a complete analysis can take weeks, if it's ever done at all.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  In most cases You don't need RE to identify, if specific sample is \"malware\" or not. Initial dynamic analysis usually is more than enough to answer the question, if it malware or not.\n </p>\n <p>\n  In cases, where You need to use RE to clarify it category, it depend on mostly 2 factors:\n </p>\n <ol>\n  <li>\n   Researcher's skill-set and knowledge of methods and techniques to analyse.\n  </li>\n  <li>\n   Ability of malware author to create code, that hard to be detected\\reversed\\analysed.\n  </li>\n </ol>\n <p>\n  But You first of all need to define \"malicious activity\", and then just look for it in sample.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Denis Laskov",
            "time": "Aug 18, 2015 at 9:55",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This is an extremely loaded question and has just as much to do with forensics as it does with reverse engineering. If you're working in a role as a network security analyst and have been tasked with determining whether a binary is malicious, it can be assumed that one of your chief priorities is to identify host-based or network-based signatures. These will be used to help your security admin colleagues detect and eliminate the threat throughout your network. However, unless you're working with a virus from the early 90s, you're not going to find an obvious message like, \"WARNING: THIS PROGRAM WILL DESTROY YOUR MACHINE!\" in the program's strings.\n </p>\n <p>\n  Anti-RE/debugging/VM and encoding/obfuscation techniques (which are common in modern malware and can extend the time of your analysis considerably) aside, smart malware behaves similarly to legitimate programs and use standard OS APIs to do its work. To reiterate the comment from the user above, you must set a standard on what is considered to be malicious activity.\n </p>\n <p>\n  With all that said, backdoors, keystroke loggers, downloaders, etc. all have unique behavioral indicators. For example, if you run\n  <code>\n   strings\n  </code>\n  on the binary in question and can see a routable IP address, and that IP does not trace back to a legitimate organization, that is a good indication this binary is a reverse shell, and the IP can be used as a network-based signature. This is something that can be done in 2 minutes, but this alone is, by no means, thorough or sufficient.\n </p>\n <p>\n  For more information on malware analysis techniques, I\n  <strong>\n   strongly\n  </strong>\n  recommend\n  <em>\n   Practical Malware Analysis\n  </em>\n  by Sikorski and Honig.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "AK-33",
            "time": "Aug 21, 2015 at 7:56",
            "is_accepted": false,
            "comments": []
        }
    ]
}