{
    "title": "How should I approach decrypting packet protocols?",
    "link": "https://reverseengineering.stackexchange.com/questions/10819/how-should-i-approach-decrypting-packet-protocols",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm able to see the packets before they're encrypted by setting a breakpoint before the encryption subroutine. My problem is that this subroutine is really complicated and goes really deep. Which steps should I follow in order to obtain this encryption function? Or rather to be able to decrypt this packet protocol?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "439",
    "tags": [
        "ida",
        "packet"
    ],
    "user": "AcarX",
    "time": "Dec 16, 2015 at 17:07",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<html><body><span class=\"comment-copy\">\n Have you used signsrch to check if your program has some standard encryption algorithms linked in?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "AcarX",
            "text": "<html><body><span class=\"comment-copy\">\n Now i did. Here's the result:\n <a href=\"http://i.imgur.com/GGjXa7Z.png\" rel=\"nofollow noreferrer\">\n  i.imgur.com/GGjXa7Z.png\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<html><body><span class=\"comment-copy\">\n This is a good start - there are several encryption algorithms in your binary (AES (Rijndael), Windows Crypt, Blowfish, ...). Set hardware breakpoints on those data tables, and step over the encryption function. Or, check where these tables are used, and set normal breakpoints on the code that uses them. Or, look at the source code of open-source implementations of these, and compare the source with your subroutine.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "AcarX",
            "text": "<html><body><span class=\"comment-copy\">\n I'm afraid i cannot find the address(003758f8 for ex.) for these tables in IDA.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "<html><body><span class=\"comment-copy\">\n This is because these are file offsets, and IDA label names are made from memory locations. But IDA shows the memory location and the file offset next to each other at the bottom of the IDA View (disassembly resp. graphical view), this should help you find them.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}