{
    "title": "Decompile binary executable into c / asm code by emulation, is it possible?",
    "link": "https://reverseengineering.stackexchange.com/questions/10847/decompile-binary-executable-into-c-asm-code-by-emulation-is-it-possible",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am thinking on a decompilation method which uses the runtime behavior of the binary executable to extract usable compilation data. Analysing the runtime behavior (i.e. trapping after every cpu instruction and check what it does), we could get a lot of additional infos, like:\n </p>\n <ul>\n  <li>\n   we could differentiate between the static constant data (\"\n   <code>\n    .text\n   </code>\n   \") and the binary asm\n  </li>\n  <li>\n   additional information, what type of data is in which register or global / local variable (pointers, floats and integers)\n  </li>\n  <li>\n   where the cpu instructions are starting\n  </li>\n  <li>\n   from the stack behavior we could get highly useful heuristics, where are the functions / internal functions and how long / what type of parameters they have.\n  </li>\n </ul>\n <p>\n  On my opinion, maybe even the holy grail, the recompilable source code wouldn't be so far away.\n </p>\n <p>\n  Is it possible? Does any tool / software already exist which is capable to do this?\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "1k",
    "tags": [
        "disassembly",
        "decompilation",
        "tracing"
    ],
    "user": "peterh",
    "time": "Sep 13, 2015 at 2:17",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<html><body><span class=\"comment-copy\">\n What you're saying sounds like a combination of\n <a href=\"https://github.com/deresz/funcap\" rel=\"nofollow noreferrer\">\n  funcap\n </a>\n and\n <a href=\"https://www.hex-rays.com/products/decompiler/index.shtml\" rel=\"nofollow noreferrer\">\n  Hex-Rays Decompiler\n </a>\n .\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "peterh",
            "text": "<html><body><span class=\"comment-copy\">\n @JasonGeffner Thanks! They sound quite interesting.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Stolas",
            "text": "<html><body><span class=\"comment-copy\">\n In the university of Moscow there is an employee that cracked my heavily obfuscated crackme using a patched version of qemu to emulate the code and jump over anti debug code.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "peterh",
            "text": "<html><body><span class=\"comment-copy\">\n @Stolas I think at first would be even enough if normal binary (without intentionally setup anti-disasm traps) would be decompilable. For example, if an asm code could be even created, it would be already transformable to an equivalent C code, which would be compilable on other architectures, too.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Stolas",
            "text": "<html><body><span class=\"comment-copy\">\n @peterh if you are looking to build something like this, I made a bare version once with libemu as base. I used this to emulate the code and run it as libemu.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This problem is linked to the halting problem on a Turing machine (which is known to be undecidable).\n </p>\n <p>\n  Approaching decompilation through emulation suppose that you have to run through all the branches of the software at least once, and reaching all possible program points cannot be guaranteed if you have to go through a (potentially) infinite loop.\n </p>\n <p>\n  Yet, this is a theoretical problem that you unlikely find in real life (except if it has been planted here intentionally to prevent the full exploration through emulation).\n </p>\n <p>\n  But, in a more practical perspective, exploring all paths can be done only if you can easily run through all the path at runtime, which is not the case when the user is required to solve a challenge (possibly on-line) such as giving a password whose hash is stored in the program or prove that he posses a private key by signing a message and returning it to the software.\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "perror",
            "time": "Sep 8, 2016 at 8:03",
            "is_accepted": true,
            "comments": [
                {
                    "user": "peterh",
                    "text": "<span class=\"comment-copy\">I think in case of conditional branches the direction of the condition could be negated to map the alternate direction, too. Of course it would cause likely a software fault, but it should be done only once on every conditional jump in the binary, which is not too many.</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">Except if you actually need the result to process the rest of the software (let say that it generates a key from the user input and use it to decipher the assembly code of the rest of the program).</span>",
                    "time": null
                },
                {
                    "user": "peterh",
                    "text": "<span class=\"comment-copy\">I am thinking on a 2-phase solution: 1) run the software unmodified, and collect as many data as it is possible 2) using the collected data, only the conditional branches need to be revisited which weren't mapped into both directions.</span>",
                    "time": null
                }
            ]
        }
    ]
}