{
    "title": "\"Incompatible saved desktop has been ignored\" in IDA",
    "link": "https://reverseengineering.stackexchange.com/questions/10850/incompatible-saved-desktop-has-been-ignored-in-ida",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  When I launch IDA for the first time, I move my windows to reflect my perfect window setup. Then I save the desktop and set it as default, plus I additionally save a named backup.\n </p>\n <p>\n  After this, I close IDA, launch it again, and everything works.\n </p>\n <p>\n  However, after some time (days-weeks) I get message: \"incompatible saved desktop has been ignored\" and my desktop is completely reset to default. Restoring the desktop from the backup results in the same message. This has already happened a couple of times and each time it was very annoying. What is the reason for this behavior and how can I keep my desktop?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "162",
    "tags": [
        "ida",
        "tools"
    ],
    "user": "rr-",
    "time": "Sep 13, 2015 at 7:54",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This message is shown if a user changes screen resolution between IDA restarts, which happens particularly often when using IDA inside a virtual machine (which gets arbitrary resolution unless it's launched fullscreen). So to keep the desktop, make sure to maintain the same screen resolution when launching IDA.\n </p>\n <p>\n  I haven't tested if the default desktop is overwritten as soon as IDA starts with different resolution than previous session. Having a named backup for this scenario certainly won't hurt.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "rr-",
            "time": "Sep 13, 2015 at 7:54",
            "is_accepted": true,
            "comments": []
        }
    ]
}