{
    "title": "Why hook a function rather than set a breakpoint",
    "link": "https://reverseengineering.stackexchange.com/questions/10901/why-hook-a-function-rather-than-set-a-breakpoint",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I know hooking is usually used as a technique when one would rather use external (or injected) code to manipulate an executable, vs breakpoints which are usually set by a debugging framework in an attached executable.\n </p>\n <p>\n  Why would one prefer hooking function calls rather than setting a breakpoint?\n </p>\n <p>\n  The only examples I can think of are:\n </p>\n <ul>\n  <li>\n   if somehow the control port used for debugging is sabotaged and you just need quick info (e.g. malware: the program is debugging itself as an anti-RE trick)\n  </li>\n  <li>\n   tool preference/preferring a program/tool/automated tool that collects information rather than the tedious task of debugging an application\n  </li>\n </ul>\n <p>\n  Can anyone think of reasons other than these?\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 2,
    "views": "1k",
    "tags": [
        "debugging",
        "malware",
        "function-hooking",
        "breakpoint"
    ],
    "user": "grepNstepN",
    "time": "Sep 18, 2015 at 19:00",
    "comments": [
        {
            "user": "perror",
            "text": "<html><body><span class=\"comment-copy\">\n Hooking and breakpoints are used for very different usage, I am afraid you cannot really compare them. It is a bit like trying to compare a fish and a bike. To be more precise, breakpoint is used to stop a program in order to analyze the memory at this point. And, hooking won't stop the program but run a given function at start and at exit of a given program block.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "grepNstepN",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks for the reminder! Ive only read about hooking & never used it. Ive read zines, CTF & crackmes writeups that use hooks due to time checks or something implemented in the target.  However, in all the situations encountered I never thought \"cant use a debugger in this situation! Lets go hooking!\" The only time I have is anti-malware or AV, which led to this question. When would you\n <i>\n  need\n </i>\n to utilize hook rather than debug (outside of the aforementioned reasons) outside of AV/malware usage? I know its preferred when REing packers because it would be faster than dbg or writing a dbg script.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xec",
            "text": "<html><body><span class=\"comment-copy\">\n 1) Hooks exists in the same address space as that of the target. So you have full access to all memory. In case of breakpoints, the debugger and debugee exists in different address space. In order to read memory, special API needs to be used, like\n <code>\n  ReadProcessMemory\n </code>\n on Windows. 2) Hooks properly implemented, are usually difficult to detect. Debuggers are noisy.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "grepNstepN",
            "text": "<html><body><span class=\"comment-copy\">\n thanks ya'll. I'd like to mark @ExtremeCoders comment as an answer but it won't let me, so I'll add it in an answer.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Both hooks and debuggers are easy enough to detect if you're looking for them. Using API in order to read the debugee's memory by the debugger is no real disadvantage, in my opinion.\n </p>\n <p>\n  I find debugging to be more documented, resilient and OS supported than any manual hooking.\nAlthough Microsoft for example provides the Detours hooking library, this is still not a functionality supported by the OS and Microsoft highlights that usage of hooking is discouraged.\n </p>\n <p>\n  The major reason I often see hooking being used instead of debugging is for the following reasons:\n </p>\n <ol>\n  <li>\n   Monitoring the entire system is required instead of specific processes.\n  </li>\n  <li>\n   There's no need to trace the full flow of execution, but instead only record specific events (such as network communication, for example).\n  </li>\n </ol>\n <p>\n  Although hooking could potentially be used for debugging, these two techniques are usually used for completely different things.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Jun 10, 2018 at 2:25",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  @ExtremeCoders comment was a sufficient answer:\n </p>\n <blockquote>\n  <p>\n   1) Hooks exists in the same address space as that of the target. So you have full access to all memory. In case of breakpoints, the debugger and debugee exists in different address space. In order to read memory, special API needs to be used, like\n   <code>\n    ReadProcessMemory\n   </code>\n   on Windows.\n  </p>\n  <p>\n   2) Hooks properly implemented, are usually difficult to detect. Debuggers are noisy.\n  </p>\n </blockquote>\n <p>\n  Forgot to look at my question in that regard.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "julian",
            "time": "Jun 10, 2018 at 18:10",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Paweł Łukasik",
                    "text": "<span class=\"comment-copy\">Maybe add this comment w/ quotes as part of the accepted answer?</span>",
                    "time": null
                }
            ]
        }
    ]
}