{
    "title": "Using MyNav Python Scripts With IDA Pro 6.1 On Windows 7",
    "link": "https://reverseengineering.stackexchange.com/questions/11073/using-mynav-python-scripts-with-ida-pro-6-1-on-windows-7",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I just came across the MyNav Python scripts and would like to use some of their functionality on my IDA Pro database. I have IdaPython installed properly, but I cannot seem to get the plugins to show up in the menu. I have gone to File > script and run MyNav.py, but all that happens is the myexport.pyc and mybrowser.pyc files get generated where I have the source files.\n </p>\n <p>\n  I tried copying those into the plugins directory and restarting, but nothing shows up. The install documentation on the google code page is non-existent. Has anyone had any success installing this plugin package?\n </p>\n <p>\n  I am using Python 2.7 with IdaPython 1.5.2, but have also tried with Python 2.6\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "520",
    "tags": [
        "ida",
        "idapython",
        "ida-plugin"
    ],
    "user": "MrJman006",
    "time": "Oct 9, 2015 at 21:45",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<html><body><span class=\"comment-copy\">\n <i>\n  \"I cannot seem to get the plugins to show up in the menu\"\n </i>\n - Where in the menu are you looking? After you run\n <code>\n  mynav.py\n </code>\n , the new menu items should appear in the\n <b>\n  Edit → Plugins\n </b>\n menu.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "MrJman006",
            "text": "<html><body><span class=\"comment-copy\">\n That is where I looked an I only see the following items, Sample plugin, Jump to next fixup, and Sample chart builder.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "joxeankoret",
            "text": "<html><body><span class=\"comment-copy\">\n That's weird. Menu-items should be populated. Can you run, for example, the script mybrowser.py to see if the browser appears? PS: I'm the author.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "MrJman006",
            "text": "<html><body><span class=\"comment-copy\">\n I ran it and saw a graph pop up with boxes and a bunch of blue lines connecting them. I think it is the right output I should be seeing.,\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "MrJman006",
            "text": "<html><body><span class=\"comment-copy\">\n @joxeankoret I don't know if it helps any, but also tried running the myexport.py and it get an error \"Unable to open database file...\\python\\idaapi.py in IDAPython_ExecScript\" There is more, but it's just a stack unwind from what it looks like. Line 80 in openDatabase, 280 in main, and 284 in <module> main(). I can post a screenshot in my question if you need it.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}