{
    "title": "Emulate juan DVR R7816 in Qemu",
    "link": "https://reverseengineering.stackexchange.com/questions/11083/emulate-juan-dvr-r7816-in-qemu",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I Want to emulate cctv dvr in qemu.this dvr is from juan cctv and the model is R7816.it is an 16ch dvr.I Have firmware upgrade file in .rom format which i can extract with binwalk.But i dont know what to do after that.please help.\n </p>\n <p>\n  Here is the dvr firmware link which i want to emulate in qemu.\n  <a href=\"http://www.everpro.biz/down/html/download/FWHI2116_20130821_DVR_R7816_1_8_3_7969B10.zip\" rel=\"nofollow\">\n   Click here to download\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "firmware",
        "qemu",
        "emulation"
    ],
    "user": "anmoloo7",
    "time": "Oct 12, 2015 at 11:05",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Just the firmware and qemu won't help you much. When the firmware starts up, it will try to communicate with the hardware - initialize the network card, check which channels have cameras attached to them, probably read some configuration values from non-volatile storage, check the total/free space of the hard disk, this kind of stuff.\n </p>\n <p>\n  On a plain qemu emulation, the hardware just isn't there. So the firmware will probably send a command to the to read the MAC address from the network card (to determine its own serial number), then wait until the network card responds. But, the non-existant network card never responds. So if you're lucky, the firmware will throw an error message and abort the boot; if you aren't lucky, it will just enter an endless loop without you knowing what's happening.\n </p>\n <p>\n  Anyway, unless you a) write qemu modules to emulate everything the hardware of your dvr does, or b) disassemble the firmware, and patch all the device drivers to simulate hardware that isn't there, you won't be able to run your firmware with qemu.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Guntram Blohm",
            "time": "Oct 12, 2015 at 18:26",
            "is_accepted": false,
            "comments": []
        }
    ]
}