{
    "title": "When to use OllyDgb over Immunity Debugger",
    "link": "https://reverseengineering.stackexchange.com/questions/11280/when-to-use-ollydgb-over-immunity-debugger",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have always been curious when I should use OllyDbg over Immunity Debugger.\n </p>\n <p>\n  Immunity Debugger has inherited code from OllyDbg and can perform scripted debugging with Python.\n </p>\n <p>\n  Interestingly enough, most of the times I do a Google search for a reverse engineering task with Immunity Debugger, I end up with search results related to exploit development. When I search for the same task with OllyDbg, I regularly find information more relevant to the reverse engineering task I am trying to accomplish.\n </p>\n <p>\n  If Immunity Debugger supports scripted debugging in Python (which simplifies the scripting process as opposed to making a plugin for OllyDbg), then why would I want to use OllyDbg over Immunity Debugger?\n </p>\n</div>\n</body></html>",
    "votes": "7",
    "answers": 1,
    "views": "11k",
    "tags": [
        "ollydbg",
        "debugging",
        "tools",
        "immunity-debugger"
    ],
    "user": "itsbriany",
    "time": "Nov 9, 2015 at 1:43",
    "comments": [
        {
            "user": "0xec",
            "text": "<html><body><span class=\"comment-copy\">\n Both of them are almost the same. It is a matter of personal preference. If you are good at python, you should be using ImmDbg. Yes, ImmDbg seems to be used more in exploit development but you can also achieve the same results in Olly.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Dominik Antal",
            "text": "<html><body><span class=\"comment-copy\">\n Both of them are dynamic debugging tools, and you can pretty much do anything with both of them. Ollydbg is older, and has a lot of plugins that are not available in immunity. That being said they are both  great, I usually prefer Olly simply because I can setup keybindings/shortcuts the way I like it. Immunity is great because of the Python scripting feature.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Stolas",
            "text": "<html><body><span class=\"comment-copy\">\n Both are rather old, I'd recommend giving winDBG a look\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Immunity Debugger is forked from OllyDbg v1.10.\n </p>\n <p>\n  So you should use the latest version of OllyDbg (\n  <a href=\"http://www.ollydbg.de/version2.html\" rel=\"noreferrer\">\n   currently v2.01\n  </a>\n  ) instead of Immunity Debugger if you want any OllyDbg v2-specific features/fixes. If you don't need those OllyDbg v2-specific features/fixes though, then there's no benefit to using OllyDbg v1.10 over Immunity Debugger.\n </p>\n</div>\n</body></html>",
            "votes": "10",
            "user": "Jason Geffner",
            "time": "Nov 9, 2015 at 15:30",
            "is_accepted": true,
            "comments": [
                {
                    "user": "itsbriany",
                    "text": "<span class=\"comment-copy\">Thanks! I didn't know that OllyDbg v2 had some unique features that Immunity Debugger did not have!</span>",
                    "time": null
                }
            ]
        }
    ]
}