{
    "title": "Find a string in an object file",
    "link": "https://reverseengineering.stackexchange.com/questions/11325/find-a-string-in-an-object-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a libcocos2djs.so file, which presumably is a mobile game using Cocos2d. Result of\n  <code>\n   file\n  </code>\n  :\n </p>\n <blockquote>\n  <p>\n   ELF 32-bit LSB shared object, ARM, EABI5 version 1 (SYSV), dynamically linked, interpreter /system/bin/linker, stripped\n  </p>\n </blockquote>\n <p>\n  The game sends HTTP requests to the game server. For each request, the program adds an integer timestamp query parameter to the request URL, then calculates the MD5 hash of the URL concatenated with a secret string, and then adds this MD5 hash as a query parameter to the URL.\n </p>\n <p>\n  Example:\n </p>\n <blockquote>\n  <p>\n   Original URL: /some_endpoint\n  </p>\n  <p>\n   With timestamp: /some_endpoint&time=324234243\n  </p>\n  <p>\n   With hash (MD5 the above string concatenated with a secret string): /some_endpoint&time=324234243&hash=870839dba52a8fc6f47f44742116a40b\n  </p>\n </blockquote>\n <p>\n  This secret string is what I want to find out.\n </p>\n <p>\n  I learnt to use a version of objdump that supports ARM to disassemble this object file, but since my assembly knowledge is limited, I don't know where to start and it would be great if someone can point me to the right direction. I just need one secret string.\n </p>\n <p>\n  The old versions of the game were using Unity, which could be easily decompiled, and I found the secret string was hard-coded in the source code. They use a new secret string for the new version and it's very likely the secret string is still hard-coded in the source code. Not sure if this information is helpful.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "2k",
    "tags": [
        "disassembly",
        "debugging",
        "decompilation",
        "strings"
    ],
    "user": "Dr. Alpha",
    "time": "Jun 17, 2020 at 9:54",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<html><body><span class=\"comment-copy\">\n libcocos2djs.so is from\n <a href=\"https://github.com/cocos2d/cocos2d-js\" rel=\"nofollow noreferrer\">\n  Cocos2d-JS\n </a>\n , a framework library. Your game's string is not in that file.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Dr. Alpha",
            "text": "<html><body><span class=\"comment-copy\">\n @JasonGeffner I found lots of function names of the game in this .so file. I think the game is written in C++ and is compiled with Cocos2d-x code into this .so file.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I Know IDA-PRO has some good plugins to find\n  <code>\n   Crypt\n  </code>\n  algorithms such as AES, DES, Triple DES and others..\n </p>\n <p>\n  As well as cryptography algorithms, it can find Hashing algorithms as well as MD5, this is pretty easy because the MD5 algorithm has couple of static intiatiors which are easy to look for in the memory (\n  <code>\n   0x67452301\n  </code>\n  <code>\n   0xefcdab89\n  </code>\n  ,\n  <code>\n   0x98badcfe\n  </code>\n  ,\n  <code>\n   0x10325476\n  </code>\n  ). Anyways i would open up the SharedObject in IDA pro, look for the MD5 algorithm, and then look for the string attached to the sent data as a salting mechanism. So if ill have to put the reversing technique into steps it would be:\n </p>\n <ol>\n  <li>\n   Find the MD5 hash function\n  </li>\n  <li>\n   Look for the function calling the MD5 function, and with what parameters (One of the parameters should be the data to hash - The data containing the MagicString)\n  </li>\n  <li>\n   If you still dont know which part of the string is the MagicString, Try understanding what changed the current string and added the Salting MagicString\ni would look for strcat variants\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "2",
            "user": "0xAK",
            "time": "Nov 20, 2015 at 16:06",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you have the patience to sort the output, try running the file through the\n  <a href=\"https://sourceware.org/binutils/docs/binutils/strings.html\" rel=\"nofollow\">\n   <code>\n    strings\n   </code>\n  </a>\n  utility (if you're on Linux or Mac, it's probably already installed, just type\n  <code>\n   strings --version\n  </code>\n  in the terminal to test it).\n </p>\n <p>\n  This tool is not super fancy, so it will print a lot of junk together with any other text strings found. If you're certain the text you're looking for is there, it shouldn't take too long to manually sort through the output and find it.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "glampert",
            "time": "Nov 20, 2015 at 2:06",
            "is_accepted": false,
            "comments": []
        }
    ]
}