{
    "title": "Reverse engineer intercom connection (22pin internal connector)",
    "link": "https://reverseengineering.stackexchange.com/questions/11335/reverse-engineer-intercom-connection-22pin-internal-connector",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a Urmet Signo 1740/40 intercom device in my apartment, and I've been brooding on a way to replicate (some of) its functionality from a different device (such as a Raspberry Pi) so that I can control it from e.g. a web interface or mobile app. However, I could use some pointers to get started with the electronic aspects of it.\n </p>\n <p>\n  After opening up the device, I found the following PCB. The thing that immediately draws attention is the 22-pin connector that connects the front side of the device to the PCB (bottom-left just below the dip switches). Given that the front panel contains the buttons as well as audio/video interfaces, it would appear that everything I would want flows via this connection. See the photos below.\n </p>\n <p>\n  My main question is: what would be the best way to approach reading the signal from an external device? I thought about wiring each of the pins to GPIO input pins of a Pi to try and reading out the value while using different functionality of the device, but I feel like I know way too little about this thing to know if that will cause damage. I would like to learn how to do this properly, though.\n </p>\n <p>\n  Does anyone recognise this type of connector? Is this likely to be a standard, or is it something proprietary they might have cooked up themselves? What equipment would you suggest when trying to do this?\n </p>\n <p>\n  I have not really been able to find any documents on the technical specifications of this device other than install guides.. Are these things commonly available? What is a good starting point?\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/heUNu.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"PCB\" src=\"https://i.sstatic.net/heUNu.jpg\"/>\n  </a>\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/TiNQE.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"pins\" src=\"https://i.sstatic.net/TiNQE.jpg\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "1k",
    "tags": [
        "hardware"
    ],
    "user": "Joost",
    "time": "Nov 16, 2015 at 7:54",
    "comments": [
        {
            "user": "MarkU",
            "text": "<html><body><span class=\"comment-copy\">\n Looks like a standard 22-pin ribbon cable connector. Not a commonly used size, but certainly possible. Digikey, mouser, newark, element14, mcmelectronics, or your favorite disti may carry these. There is no standard pinout for these.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Joost",
            "text": "<html><body><span class=\"comment-copy\">\n Right, I've been looking around a bit for one of those. Is the voltage standard for these things, though? Is it reasonable to assume 3.3V or 5V? I'm a bit wary of just plugging it onto things, and I do not immediately see how to properly measure this (given that it's not a closed circuit).\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Pieter Helsen",
            "text": "<html><body><span class=\"comment-copy\">\n Did you end up finding a suitable solution to this problem? I'm contemplating a similar project for an Urmet videophone.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Unless you don't mind destroying a few Raspberry Pi boards, I'd strongly advise\n  <strong>\n   against\n  </strong>\n  just hooking this up to Pi GPIO pins!  This kind of connector is common, but the pinout is unlikely to be standardized.  You're going to have to do some investigation to figure it out.\n </p>\n <p>\n  Here's the approach I'd use.\n </p>\n <h2>\n  Trace the pins\n </h2>\n <p>\n  This circuit board is not to large but it looks rather dense, so it might be a 4-layer board.  To the extent that you are able, examine the traces leading up to the connector and see if you can follow them backward to something you can identify.  For example, it's likely that at least two of the pins are to supply power to the other (front panel) circuit board.  You can also, probably more easily, trace things back from the front panel circuit board and figure out their function. For example, tracing back from the speaker might get you back to an audio amplifier and the input of that to digital-to-analog converter and the input of that to a connect.  That would tell you a lot about both the function and signalling characteristics of some of the pins.\n </p>\n <h2>\n  Identify the major components\n </h2>\n <p>\n  I can't quite make out the part number of the IC labelled U12, but it could be a small microcontroller that serves as the brains for this thing.  Identifying the parts by looking up the numbers can give you some clues as to what the entire circuit might be doing.\n </p>\n <h2>\n  Look at the signals with a voltmeter and/or oscilloscope\n </h2>\n <p>\n  I'd recommend using a voltmeter first to check any signals with the top board disconnected.  That will quickly tell you what voltages are present (e.g. +3.3V, +5V, +12V, +24V, etc.) and also may give you some clue as which ones are driven by the bottom board.  Take careful notes on what you observe on each pin.\n </p>\n <h2>\n  Make an \"extension\" cable\n </h2>\n <p>\n  Buy the parts to make a small jumper cable between the boards.  You'll want to keep it short so that impedences on the lines don't interfere with the operation of the intercom.  You can also install a connector in the middle to allow you to grab any particular pin conveniently with a minigrabber.  Something like this:\n  <a href=\"https://i.sstatic.net/zcOvr.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"ribbon cable with three connectors\" src=\"https://i.sstatic.net/zcOvr.jpg\"/>\n  </a>\n </p>\n <p>\n  Then you can explore the signals (again with voltmeter and oscilloscope) while the circuit is working.\n </p>\n <h2>\n  Build a safe interface board\n </h2>\n <p>\n  It's likely that there will need to be some level conversion between this circuit and a Raspberry Pi.  Even if there weren't, it's probably a good idea to build some isolation into the interface circuit so that you don't let the\n  <em>\n   magic smoke\n  </em>\n  out of either the intercom or the Pi.  You might be able to start by just intercepting a few pins for functions of particular interest and you can then test with software to see if your understanding of the protocol(s) and pin functions are correct.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Edward",
            "time": "Nov 17, 2015 at 15:35",
            "is_accepted": false,
            "comments": []
        }
    ]
}