{
    "title": "Limitations of capstone's disassembly capabilities compared to IDA",
    "link": "https://reverseengineering.stackexchange.com/questions/11339/limitations-of-capstones-disassembly-capabilities-compared-to-ida",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I was wondering if there are any limitations of capstone's disassembling capabilities when compared to IDA.\n </p>\n <p>\n  If yes, are those limitations inherent, i.e. a result of the different design/techniques that capstone and ida use? Or are they rather due to \"not yet implemented\" features, e.g. capstone's fewer supported CPUs?\n </p>\n <p>\n  If there are inherent limitations, could you give an example?\n </p>\n <p>\n  I am talking about the disassembling only, i.e., I am not interested in things like available APIs, commercial support, license models, plug-in systems, debugging support etc. Just the pure disassembly.\n </p>\n <p>\n  Capstone is mentioned as one answer to the post\n  <a href=\"https://reverseengineering.stackexchange.com/questions/1817/is-there-any-disassembler-to-rival-ida-pro\">\n   \"Is there any disassembler to rival IDA Pro?\"\n  </a>\n  , but it seems to be a copied/pasted text from the capstone website.\n </p>\n <p>\n  PS: The working of IDA is explained/discussed\n  <a href=\"https://reverseengineering.stackexchange.com/questions/2347/what-is-the-algorithm-used-in-recursive-traversal-disassembly\">\n   here\n  </a>\n  .\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "disassembly",
        "disassemblers",
        "capstone"
    ],
    "user": "langlauf.io",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [
        {
            "user": "0xec",
            "text": "<html><body><span class=\"comment-copy\">\n There is no point in comparing between the two. IDA is more than a disassembler.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "langlauf.io",
            "text": "<html><body><span class=\"comment-copy\">\n I would like to compare the disassembly capabilities, not the two tools. I tried to clarify this in my question.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There is no point in comparing between the two. IDA is more than a disassembler, it is a reversing tool which implements(or could be implemented via plugins) almost every feature you can think of.\n </p>\n <p>\n  Capstone on the other hand, is a simple disassembler engine. It by alone cannot generate the same quality of output as IDA.\n </p>\n <p>\n  For instance, IDA has cross-referencing capability. Cross-refs are generated by a dedicated analysis engine which uses input from the disassembly engine. A disassembly engine,\n  <em>\n   by its own\n  </em>\n  can neither find cross-refs, nor can it recursively disassemble like IDA.\n </p>\n <p>\n  You are comparing a disassembly framework to a tool with a myriad of features. They are not comparable with each other.\n </p>\n <p>\n  If you are talking about just the textual disassembler output, then there is not much of a difference per se.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "0xec",
            "time": "Nov 17, 2015 at 9:24",
            "is_accepted": true,
            "comments": [
                {
                    "user": "langlauf.io",
                    "text": "<span class=\"comment-copy\">I see. I mixed up cross-referencing (and probably more stuff  such as stack frame reconstruction etc.) with disassembly capabilities. But nevertheless this is a valuable insight for me that capstone alone is not able to generate the same \"quality output\" which I understand as disassembled instructions + refs + stack frame info + ....</span>",
                    "time": null
                }
            ]
        }
    ]
}