{
    "title": "Unpacking binary statically",
    "link": "https://reverseengineering.stackexchange.com/questions/113/unpacking-binary-statically",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Say I have a binary that I'm not able to execute (for example it runs on some device that I don't have one of), but I can disassemble it. I can get the docs on the architecture. (It's MIPS little endian in my case.) But the binary has very few imports, very few strings, etc., so it really seems like it's packed.\n </p>\n <p>\n  How can I go about\n  <em>\n   statically\n  </em>\n  unpacking it? (Edit: I mean, unpacking it without any access to the original device.)\n </p>\n</div>\n</body></html>",
    "votes": "8",
    "answers": 4,
    "views": "4k",
    "tags": [
        "obfuscation",
        "unpacking",
        "executable"
    ],
    "user": "EfForEffort",
    "time": "Mar 26, 2013 at 8:17",
    "comments": [
        {
            "user": "cb88",
            "text": "<html><body><span class=\"comment-copy\">\n You could try running it with one of the user mode emulators supplied with QEMU... it would help if you knew more about it probably a disassembler would help like IDA perhaps it is one of the types the free version can work with. Also I am not sure what you mean by \"static unpacking\"\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Remko",
            "text": "<html><body><span class=\"comment-copy\">\n Ida Pro and the Bochs emulator seems like a way to go, see\n <a href=\"https://www.hex-rays.com/products/ida/support/tutorials/debugging_bochs.pdf\" rel=\"nofollow noreferrer\">\n  here\n </a>\n for a tutorial.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n @Remko: alas Bochs only emulates x86 so it's unlikely to help here\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "EfForEffort",
            "text": "<html><body><span class=\"comment-copy\">\n @cb88, I have a copy of IDA Pro. And what I mean is I wish to unpack the binary but I don't have the device it was originally intended for. Seems like QEMU+mipsel is the way to go; I'm downloading debian-mipsel now.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "cb88",
            "text": "<html><body><span class=\"comment-copy\">\n You could probably do it in a chroot as well,with gentoo mips and a static qemu usermode emulator, if qemu system emulation is too buggy or hard to get data back out of.\n <a href=\"http://www.gentoo.org/proj/en/base/embedded/handbook/?part=1&chap=5\" rel=\"nofollow noreferrer\">\n  gentoo.org/proj/en/base/embedded/handbook/?part=1&chap=5\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Over the 30+ embedded device firmwares I've seen in the past I have rarely seen them using anything proprietary. Often it's just gzip/LZMA or a similar compression they're using (albeit sometimes with modified or stripped headers).\n </p>\n <p>\n  Thus as a first step I would try something like\n  <a href=\"http://code.google.com/p/binwalk/\">\n   binwalk\n  </a>\n  to search for known compression algorithms. If that doesn't help try tools for finding crypto constants such as\n  <a href=\"http://www.hexblog.com/ida_pro/files/findcrypt2.zip\">\n   Find Crypt\n  </a>\n  or\n  <a href=\"http://aluigi.altervista.org/mytoolz/signsrch.zip\">\n   Sign search\n  </a>\n  . This only works if the crypto is a software implementation. If it's a more sophisticated device, say a set-top-box, with a hardware accelerated decryption engine and OTP memory for storing the key then you're out of luck without run-time access (unless they greatly screw up passing the key from OTP to the decryption engine).\n </p>\n <p>\n  Finally you could try to find out if they use some proprietary algorithm and either emulate that algorithm using\n  <a href=\"http://wiki.qemu.org/Main_Page\">\n   QEMU\n  </a>\n  or\n  <a href=\"http://gxemul.sourceforge.net/\">\n   gxemul\n  </a>\n  or write your own decompressor in higher level language.\n </p>\n</div>\n</body></html>",
            "votes": "8",
            "user": "ixje",
            "time": "Mar 21, 2013 at 8:47",
            "is_accepted": true,
            "comments": [
                {
                    "user": "EfForEffort",
                    "text": "<span class=\"comment-copy\">This is a good idea. I ran binwalk and it found nothing except that it's an ELF (i.e., it reported only what file(1) reported). Sign search also didn't find anything. I guess the next step is QEMU.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  several possible ways:\n </p>\n <ol>\n  <li>\n   <p>\n    identify the packer\n   </p>\n   <ul>\n    <li>\n     get standard packers of your platform (\n     <a href=\"http://upx.sourceforge.net/\" rel=\"nofollow\">\n      UPX\n     </a>\n     for example), check if it's not the one used.\n    </li>\n    <li>\n     If it's a standard packer, then maybe you've already won, as it might be documented, or even better, like UPX, it can unpack itself and is open-source.\n    </li>\n   </ul>\n  </li>\n  <li>\n   <p>\n    identify the algorithm\n   </p>\n   <ul>\n    <li>\n     there are not so many good+widespread packer algorithms (NRV, LZMA, JCAlg, ApLib, BriefLZ). they're usually easily identifiable by their body size or their constants. (I implemented several of them in pure python in\n     <a href=\"https://code.google.com/p/kabopan/source/browse/#svn%2Ftrunk%2Fkbp%2Fcomp\" rel=\"nofollow\">\n      Kabopan\n     </a>\n     )\n    </li>\n    <li>\n     if you can easily identify the packing/encryption algorithm, then you can probably find a clean implementation for static unpacking\n    </li>\n   </ul>\n  </li>\n  <li>\n   <p>\n    get your hands dirty\n   </p>\n   <ul>\n    <li>\n     if you still don't know the algorithm and it's apparently really a custom one, then read another packer for the same platform (ie once again, read UPX Mips binary and its source), so it can make you familiar with similar (packer) tricks used on your platform.\n    </li>\n    <li>\n     then look for the likely compression algorithm (likely a different-looking piece of code, people\n     <strong>\n      very rarely\n     </strong>\n     mess with them, and re-implement the algorithm in your favorite language, and unpack externally (locate parameters, apply algorithms, modify/reconstruct binary)\n    </li>\n   </ul>\n  </li>\n  <li>\n   <p>\n    Lazy method by bruteforcing: some algorithms like\n    <a href=\"http://corkami.googlecode.com/svn/trunk/wip/MakePE/examples/packer/aplib.py\" rel=\"nofollow\">\n     ApLib\n    </a>\n    don't have any header nor parameter (not even a size): the algorithm just requires a pointer to a compressed buffer, so it's sometimes enough to just blindly try it on any offset of your binary, and check if we get a decent decompressed buffer (not too small, not huge+full of 00s).\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Ange",
            "time": "Mar 26, 2013 at 16:17",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  In\n  <a href=\"http://www.idabook.com/\" rel=\"nofollow\">\n   The Ida Pro Book\n  </a>\n  , Chris Eagle demonstrates use of a plugin called\n  <a href=\"http://www.idabook.com/x86emu/\" rel=\"nofollow\">\n   ida-x86emu\n  </a>\n  , which can be used to statically unpack binaries by simulating execution within the IDA database.  Check it out; it's open-source, and it's pretty easy to use.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "user1354557",
            "time": "Mar 22, 2013 at 17:34",
            "is_accepted": false,
            "comments": [
                {
                    "user": "EfForEffort",
                    "text": "<span class=\"comment-copy\">Unfortunately doesn't help as this is a MIPS binary =[</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  My general answer would be \"by simulating self-modifying operations against the packed binary\".  So for example, this would encompass removing the compression that most packers are veiled under.  Doing so will require \"statically tracing\" the execution flow through the packer, whose code may be subject to self-modification.\n </p>\n <p>\n  That explanation works for a traditional style of packing, wherein the sections of the binary are merely compressed/encrypted.  It might be the case that more sophisticated unpacking strategies are required, for example as described in my paper \"Unpacking Virtualization Obfuscators\"\n  <a href=\"http://static.usenix.org/event/woot09/tech/full_papers/rolles.pdf\" rel=\"nofollow\">\n   1\n  </a>\n  .\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Rolf Rolles",
            "time": "Mar 21, 2013 at 7:43",
            "is_accepted": false,
            "comments": []
        }
    ]
}