{
    "title": "Analysing eCos image",
    "link": "https://reverseengineering.stackexchange.com/questions/11503/analysing-ecos-image",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm working on unpacking a firmware image. I've already uncompressed the original image, but I'm stuck in the current step.\n </p>\n <p>\n  This is the current uncompressed image:\n  <a href=\"https://www.dropbox.com/s/vxxz3x8ek84iie0/Firmware_N30?dl=0\" rel=\"nofollow\">\n   https://www.dropbox.com/s/vxxz3x8ek84iie0/Firmware_N30?dl=0\n  </a>\n </p>\n <p>\n  According to what I have found this is an eCos image:\n  <a href=\"http://ecos.sourceware.org/\" rel=\"nofollow\">\n   http://ecos.sourceware.org/\n  </a>\n </p>\n <p>\n  I want to separate the binaries, analyse how they work and see if it's possible to make modifications. How can I continue?\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 0,
    "views": "2k",
    "tags": [
        "disassembly",
        "binary-analysis",
        "firmware",
        "unpacking",
        "binary"
    ],
    "user": "tnas",
    "time": "Apr 28, 2017 at 12:44",
    "comments": [
        {
            "user": "tmr232",
            "text": "<html><body><span class=\"comment-copy\">\n What do you mean by separating the binaries? It is one big executable file. Also, do you know what processor is this?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "tnas",
            "text": "<html><body><span class=\"comment-copy\">\n @tmr232 I don't have a lot of experience with eCos. I assumed there were separate executable files inside the image, but, by your comment, looks like the entire file is the executable? As for the device's CPU, it's a Broadcom BCM5357C0. According to binwalk, this is little endian MIPS (MIPSEL) code.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "tmr232",
            "text": "<html><body><span class=\"comment-copy\">\n Well, as you can\n <a href=\"https://imgur.com/IKmRQwJ\" rel=\"nofollow noreferrer\">\n  see\n </a>\n (I added bitmap headers to the firmware using\n <a href=\"https://gist.github.com/tmr232/8fc9279c1aac47762c23\" rel=\"nofollow noreferrer\">\n  this\n </a>\n ) the strings (gray part) are all located together. This usually means that this is a single executable file and not a mashup of many. What you should do now is figure the correct loading address of the firmware so that you can analyze it. This can be done either by looking at specs (for the processor), using the device's shell, or by maximizing the number of string references.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "tnas",
            "text": "<html><body><span class=\"comment-copy\">\n @tmr232 By your comment and by further research I've been doing on eCos, it now seems clear to me that this is a single executable. Thanks! Unfortunately I don't have access to a shell on the device, since it doesn't appear to have an UART port or anything. I'll try to look up processor specs, but in case I don't find anything useful, could you explain the part about maximizing the number of string references?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}