{
    "title": "How can I figure out what serial port communication protocol is a software using?",
    "link": "https://reverseengineering.stackexchange.com/questions/11615/how-can-i-figure-out-what-serial-port-communication-protocol-is-a-software-using",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm working to adapt an stress excercise test software so that it can work with a treadmill that uses a different communication protocol.\n </p>\n <p>\n  The communicate via a RS232 cable, with a USB-RS232 adapting device on the laptop end.\n </p>\n <p>\n  I have created a pair of virtual ports using com0com and have written a program in VB (using Visual Studio) that can open, read and write on the virtual ports. The purpose being that the program can work as a translator.\n </p>\n <p>\n  I have the treadmill protocol but not the software one, so I'm trying to listen to what the software tells to the virtual port and figure out what protocol it's using.\n </p>\n <p>\n  Is this option viable? Are there any further reading material / software I could use?\n </p>\n <p>\n  The only messages I got sof far were:\n </p>\n <p>\n  \"?\" when first running the test\n </p>\n <p>\n  \"ìù 015ñ 000\" when I set the treadmill on/off\n </p>\n <p>\n  If I don't answer, the software displays the message \"treadmill failed\". If I send any array of characters, it doesn't display the message and appears to start the test.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "384",
    "tags": [
        "serial-communication",
        "protocol"
    ],
    "user": "Facundo Peloso",
    "time": "Dec 22, 2015 at 12:54",
    "comments": [
        {
            "user": "GMG",
            "text": "<html><body><span class=\"comment-copy\">\n The best way to understand a communication protocol is to examine all traffic in hex, not in ASCII\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}