{
    "title": "How Do I get proficient at Reverse engineering?",
    "link": "https://reverseengineering.stackexchange.com/questions/11766/how-do-i-get-proficient-at-reverse-engineering",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Please bear with me as I explain this situation.\n </p>\n <p>\n  Maybe 10 days ago I took up the challenge of reverse engineering an Android app. Learning from scratch, I installed ADB, Apktool, Android Studio, Notepad++ with Smali highlighting etc. My approach has been to write test programs in Android studio that mirror the workings of the APK, and then decompile with Apktool to help me do Smali modifications. I've been successful in modifying the application to log all HTTP requests, headers, cookies, and post data to the android log.\n </p>\n <p>\n  My next challenge was to figure out how an important algorithm in the app works. This is what stumped me. I spent the last 3 or 4 days spending the majority of my day analysing Smali code making almost no progress. Apparently the algorithm is done (at least in part if not mostly) in a native library with the .so extension.\n </p>\n <p>\n  <strong>\n   One of the extremely frustrating things about Reverse engineering is how small the community is\n  </strong>\n  . There are very few resources on the web (At least compared to other things). I've probably bitten off more than I can chew. I always attempt difficult projects that are above my skill level. For this task, I'm guessing I need to become very familiar with ARM and I'll have to use IDA Pro to analyse the .so file? To explain my knowledge level:\n </p>\n <ul>\n  <li>\n   I have very little experience using Ollydbg in Windows (I have slight\nunderstanding of registers and CMP, JMP, ADD commands, etc.)\n  </li>\n  <li>\n   I have no\nexperience using IDA Pro. I'm quite new to reverse engineering, but I've had success with simple Smali modding because it's simple in\nsome situations.\n  </li>\n  <li>\n   I know basic Java (To be clear, I'm not a complete beginner, variables, for loops, arrays, classes (to an extent) are second nature to me)\n  </li>\n  <li>\n   I know basic C++ if not more than\nbasic\n  </li>\n  <li>\n   I've done a lot of VB.NET programming.\n  </li>\n  <li>\n   I feel quite knowledgeable in Python.\n  </li>\n </ul>\n <p>\n  So I'm experienced with programming, but not really reverse engineering. How in over my head am I attempting to understand this complex native library (When I already know practically nothing about native libraries/JNI)? Could the professionals here please give me some specific examples of how I can get to the level where I am knowledgeable enough to complete my goal? I don't want to just give up because this is a difficult challenge. Please give me suggestions of how I can progress enough to complete my goal. I assume I'll need to learn IDA Pro and how ARM works.\n </p>\n <p>\n  Thanks\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "android",
        "apk"
    ],
    "user": "43.52.4D.",
    "time": "Jul 26, 2021 at 9:15",
    "comments": [
        {
            "user": "SSpoke",
            "text": "<html><body><span class=\"comment-copy\">\n There is nearly nothing you have to know with IDA PRO if\n <code>\n  F5 key\n </code>\n works on your SO file functions.. you could do\n <code>\n  CTRL+F5\n </code>\n and read code which if you understand programming language you would have not so much difficulty understanding the algorithm it pumps out. If you cannot do F5.. then yes.. you will have more difficulty.. since it's\n <code>\n  .so\n </code>\n to my understanding this means linux.. I only did\n <code>\n  .DLL\n </code>\n /\n <code>\n  .EXE\n </code>\n with IDA PRO have no idea how\n <code>\n  .so\n </code>\n files handle.. could be exactly the same just different operating systems.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "SSpoke",
            "text": "<html><body><span class=\"comment-copy\">\n If you have alot of time.. find out which export of the\n <code>\n  .so\n </code>\n file you need and trace it in ollydbg.. I'm sure ollydbg is ported to linux and could load up\n <code>\n  .so\n </code>\n files, so a artificial call of that export making a simple program that loads up that\n <code>\n  .so\n </code>\n file and calls that export and trace it. If all else falls.. and you need answer to that algorithm what I usually do is make TCP/UDP servers for a specific\n <code>\n  .dll\n </code>\n file call then retrieve the answers by sending specific packets to my server.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "SSpoke",
            "text": "<html><body><span class=\"comment-copy\">\n did you try both\n <code>\n  idaq\n </code>\n ? and\n <code>\n  idaq64\n </code>\n ? It should work.. I found this post indicating it's the same thing on windows and linux\n <a href=\"http://reverseengineering.stackexchange.com/questions/2664/how-to-decompile-linux-so-library-files-from-a-ms-windows-os\" title=\"how to decompile linux so library files from a ms windows os\">\n  reverseengineering.stackexchange.com/questions/2664/…\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Vitaly Osipov",
            "text": "<html><body><span class=\"comment-copy\">\n @43.52.4D. Reversing (even java hah) is more involved than a bit of googling and asking strangers on the Internet for advice. One needs to understand (at least a bit) how the underlying stuff actually works. Think and experiment, that's my only advice.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Vitaly Osipov",
            "text": "<html><body><span class=\"comment-copy\">\n @43.52.4D. That's what reversing boils down to - thinking and figuring it out :) There are no tricks or magic spells, only human brain vs binary code. A bit like in math - paper and pencil, everything else is crutches\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   I spent the last 3 or 4 days\n  spending the majority of my day analysing Smali code making almost no\n  progress.\n  </p>\n </blockquote>\n <p>\n  I know it feels like you've made \"no progress\", but I'd encourage you to not look at it that way. You spent 3 or 4 days figuring out which approaches\n  <em>\n   don't work\n  </em>\n  , which is in itself progress. And you also built up 3 or 4 days of reverse engineering experience, regardless of how fruitful the immediate outcome was.\n </p>\n <blockquote>\n  <p>\n   Apparently the algorithm is done (at least in part if not\n  mostly) in a native library with the .so extension.\n  </p>\n  <p>\n   ...\n  </p>\n  <p>\n   How in over my head am I attempting to understand this complex native library?\n  </p>\n </blockquote>\n <p>\n  Given that you've determined that the Java code calls out to the .so library, it shouldn't be too difficult to find the native function in the .so library since the native function would be exported-by-name for JNI compatibility. This means that you don't in fact need to \"understand this complex native library\" in its entirety, but rather just the one native function in question (in addition to the functions that that function calls).\n </p>\n <p>\n  If the native code is not heavily obfuscated and if you have\n  <a href=\"https://www.hex-rays.com/products/decompiler/index.shtml\">\n   Hex-Rays for ARM\n  </a>\n  , it should be relatively\n  <a href=\"https://www.hex-rays.com/products/decompiler/compare_arm0.shtml\">\n   easy to understand\n  </a>\n  the target function. If, on the other hand, you don't have Hex-Rays, then you can use the\n  <a href=\"https://www.hex-rays.com/products/ida/support/download_demo.shtml\">\n   evaluation version of IDA Pro\n  </a>\n  to disassemble the target function. You'd need to manually analyze the ARM instructions to determine what the function is doing. Although that can be tedious, ARM instructions and the architecture in general are\n  <a href=\"http://infocenter.arm.com/help/index.jsp?topic=/com.arm.doc.set.architecture/index.html\">\n   very well-documented\n  </a>\n  . Approach it as you would when learning any new programming language.\n </p>\n <p>\n  Start analyzing the function from the very first instruction, and keep high-level notes on what each instruction is doing in the context of the function. Keep track of what values get stored in what registers and how memory is used. On first-pass, your goal is to determine\n  <em>\n   what\n  </em>\n  the function is doing (based on the instructions). Once you've extrapolated\n  <em>\n   what\n  </em>\n  the function is doing, your second-pass should focus on trying to understand\n  <em>\n   why\n  </em>\n  the function is doing what it's doing. After some time, things should begin to \"click\" in your mind, you'll get that \"aha!\" moment, and you'll understand how the target algorithm works.\n </p>\n</div>\n</body></html>",
            "votes": "8",
            "user": "Jason Geffner",
            "time": "Jan 15, 2016 at 14:11",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Antimony",
                    "text": "<span class=\"comment-copy\">Nitpick: JNI functions don't have to be exported by name. They could be registered in an obfuscated JNI_OnLoad function. I've never seen that in the wild though.</span>",
                    "time": null
                },
                {
                    "user": "Ta Thanh Dinh",
                    "text": "<span class=\"comment-copy\">This is very true: \"I know it feels like you've made \"no progress\", but I'd encourage you to not look at it that way. You spent 3 or 4 days figuring out which approaches don't work, which is in itself progress. And you also built up 3 or 4 days of reverse engineering experience, regardless of how fruitful the immediate outcome was.\"</span>",
                    "time": null
                },
                {
                    "user": "43.52.4D.",
                    "text": "<span class=\"comment-copy\">@JasonGeffner well I realized the code was using a native library partly from searching online about others attempting to crack the same algorithm, and partly because there was a .so file in the lib folder matching the  function names in Smali. Searching for the library name without the extension turns up zero results.  But I think I know where it begins to be called. The difficult part for me now is because I have no idea how native libraries are called so I don't know what to search for. Knowing what parameters are passed to it, would be helpful.</span>",
                    "time": null
                },
                {
                    "user": "43.52.4D.",
                    "text": "<span class=\"comment-copy\">@JasonGeffner an interesting side approach is POSSIBLY just figuring out what parameters get passed to the function and then whenever I need to use the algorithm to generate a value, maybe I could just call the .so file without ever learning how the algorithm actually works. (Especially if it turns out to be a colossal set of instructions)</span>",
                    "time": null
                },
                {
                    "user": "broadway",
                    "text": "<span class=\"comment-copy\">If you don't have hex-rays, you might be able to use retdec as well, which produces some reasonably high quality output (relative to typical output of native code decompilers). <a href=\"https://retdec.com/\" rel=\"nofollow noreferrer\">retdec.com</a></span>",
                    "time": null
                }
            ]
        }
    ]
}