{
    "title": "Putting instructions in placeholder code IDA?",
    "link": "https://reverseengineering.stackexchange.com/questions/11925/putting-instructions-in-placeholder-code-ida",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  In IDA, is it possible to convert placeholder data into a code segment?\n </p>\n <p>\n  In the end of the library I am working with, there is an uninitialized segment starting at 016AAB31.\n </p>\n <p>\n  The hex and actual data (which is question mark strings), however, does not allow me to put arm asm instructions into it, using the edit feature. It claims that it cannot convert the \"????\"s to hexadecimal integers.\n </p>\n <p>\n  Is there a way to extend the code segment to let me add more code, or any other way to do this? Thanks\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "482",
    "tags": [
        "ida",
        "assembly",
        "arm",
        "segmentation"
    ],
    "user": "Aspire",
    "time": "Feb 3, 2016 at 0:32",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<html><body><span class=\"comment-copy\">\n Your uninitialized segment is probably a .bss segment, which basically means \"I need 123456 bytes in ram, but because they are all initialized to 0, I won't inflate the executable by repeating 123456 zero bytes\". So there's no space present in your file, and even if there was, your library relies on these bytes being 0, so you can't put anything there.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <code>\n   Edit > Segments > Create Segment\n  </code>\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Zach Riggle",
            "time": "Feb 3, 2016 at 16:48",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Aspire",
                    "text": "<span class=\"comment-copy\">I have tried this but it still does not let me do so, with the same error. In addition, even if I am able to get the code into there, (and label the segment as pure code) it does not transfer into instructions, only the hex characters that make up the instructions.</span>",
                    "time": null
                },
                {
                    "user": "Zach Riggle",
                    "text": "<span class=\"comment-copy\">Have you actually told IDA that it's code?  e.g. Select the address and hit <code>C</code> or invoke <code>idc.MakeCode</code>?</span>",
                    "time": null
                },
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">Create segment has to do with segmentation registers in (mainly old, 16 bit) x86 code, and arm/thumb switches on arm, but nothing with executable file segments.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I would recommend against doing this in IDA. IDA is not a patching tool. Although there are plugins for IDA that implement this, there are far better choices for executable format editors, that are better equipped to add additional sections and manupulate data in it, which seems to be what you're after.\n </p>\n <p>\n  I suspect IDA won't be able to patch in the modified/new section even if you managed to create it. I\n  <em>\n   think\n  </em>\n  you'll have to use another tool for the job.\n </p>\n <p>\n  Since you're working with ARM assembly, I'll assume you're working on an executable in the elf format. For that, simply using\n  <code>\n   objcopy --add-section\n  </code>\n  would do the trick. You might also want to take a look at\n  <code>\n   --set-section-flags\n  </code>\n  afterwards.\n </p>\n <p>\n  More advanced tools include the\n  <a href=\"https://github.com/thorkill/eresi\" rel=\"nofollow\">\n   eresi\n  </a>\n  and\n  <a href=\"http://www.radare.org/r/\" rel=\"nofollow\">\n   radare\n  </a>\n  projects. Both capable and designed to manipulate ELF executables to ease the work of a reverse engineer and/or security researcher.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "NirIzr",
            "time": "Oct 21, 2016 at 13:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}