{
    "title": "IDAPython loading parameters bruteforce",
    "link": "https://reverseengineering.stackexchange.com/questions/12030/idapython-loading-parameters-bruteforce",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a binary file for known hardware platform, but nothing more is known.\n </p>\n <p>\n  When I load this file in IDA (with default parameters), nothing good happens - at least does not appear xrefs to readable strings.\n </p>\n <p>\n  I suggest that the case in the loading parameters: the loading address and the entry point. Maybe some even.\n </p>\n <p>\n  The only solution I see in the bruteforce these parameters and re-launch auto analysis. Before that I would like to help IDA by designation some pieces of code - readable strings as strings, small common hardware patterns as code pieces.\n </p>\n <p>\n  Success criteria - the appearance of xrefs to the strings.\n </p>\n <p>\n  Unfortunately I'm newbie in IDAPython, and I'm only has learned to show to IDA strings (by MakeStr-function).\n </p>\n <p>\n  How can I change loading parameters and launch full auto-analysis in IDAPython script?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "294",
    "tags": [
        "ida",
        "idapython"
    ],
    "user": "ersten",
    "time": "Feb 14, 2016 at 21:02",
    "comments": [
        {
            "user": "tmr232",
            "text": "<html><body><span class=\"comment-copy\">\n Before you go ahead and bruteforce - what do you know about the platform? Do you know the hardware's boot address and such?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "ersten",
            "text": "<html><body><span class=\"comment-copy\">\n Unfortunately I'm know only platform type - PowerPC and nothing more.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "tmr232",
            "text": "<html><body><span class=\"comment-copy\">\n And is the binary file the full firmware?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "ersten",
            "text": "<html><body><span class=\"comment-copy\">\n I'm not sure, but I'm assuming that it is not full firmware, most likely, this is only part of the changeable firmware.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "tmr232",
            "text": "<html><body><span class=\"comment-copy\">\n Do you have a running version of the software, or only the binary?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}