{
    "title": "IDA Pro get line number in main view",
    "link": "https://reverseengineering.stackexchange.com/questions/12051/ida-pro-get-line-number-in-main-view",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm writing a plugin for IDA and I need to get the line number of an instruction in the main view when someone clicks on that instruction or somewhere in the view. I noticed that there is\n  <code>\n   GetLineNumber(ea)\n  </code>\n  but it only gives me the line number in the source files, not the line num of the disassembled code.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 0,
    "views": "1k",
    "tags": [
        "ida",
        "idapython",
        "ida-plugin"
    ],
    "user": "RuinedMachine",
    "time": "Oct 2, 2018 at 20:02",
    "comments": [
        {
            "user": "ebux",
            "text": "<html><body><span class=\"comment-copy\">\n What do you mean line number in the disassembled code? In the disassembly view IDA starts the line with the address (ea).\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "RuinedMachine",
            "text": "<html><body><span class=\"comment-copy\">\n yeah exactly, but the ea is not what I need: imagine if the ida view was like a text editor: I need the number of the line of this \"text\" editor containing the instructions. I would use the ea, but the ea is not in a 1:1 relationship with the lines.  EDIT: basically I need it because I have to sync the view with another custom view I create. Are there alternatives to do that?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "ebux",
            "text": "<html><body><span class=\"comment-copy\">\n I don't think IDA would calculate this kind of line number. Why don't you synchronize using the ea?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "RuinedMachine",
            "text": "<html><body><span class=\"comment-copy\">\n my view keeps annotations for some lines of the code so the line num would be perfect since, as I said, the ea is not 1:1 with the lines (more lines may have the same ea). after having digged through the idapython source I started to suspect that IDA would not keep track of that info... I will find a way to sync with the ea. Thanks anyway.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}