{
    "title": "Best 3G USB Modem for Reverse Engineering?",
    "link": "https://reverseengineering.stackexchange.com/questions/12207/best-3g-usb-modem-for-reverse-engineering",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  My idea is to automate the process of keeping in touch with my server in a portable and internet independent manner. The most optimal solution in my case is an SMS Gateway/Relay because I travel a lot and I want to eliminate the situation when I do not have internet access (WiFi or SIM). The 3G USB Modem is the best solution because I can keep it in my home wall plate, and the little ones cost around 7 Euro (Huawei K4305) in my town.\n </p>\n <p>\n  My problem is that I didn't found a custom firmware with a web shell integrated to build the php file that request the information from my server API and send via sms to my mobile number. (I don't want online SMS Gateways like SMSGlobal)\n </p>\n <p>\n  Is there a \"BinWalk / Firmware Mod Kit\" friendly FW version or projects related to this? My knowledge in reverse engineering is poor. Thank you for your attention and time!\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "851",
    "tags": [
        "firmware",
        "hardware",
        "usb"
    ],
    "user": "UTF-32",
    "time": "Mar 13, 2016 at 2:32",
    "comments": [
        {
            "user": "UTF-32",
            "text": "<html><body><span class=\"comment-copy\">\n Found something\n <a href=\"http://sh.com.hr/en/modificiranje-huawei-e3372-lte-sticka\" rel=\"nofollow noreferrer\">\n  Huawei E3372\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  What exactly are you trying to do?\nFrom what it sounds like, you have a need (ping/pong events for metrics) but you're assuming the best solution is to perform whatever you described...you're\n  <a href=\"https://joi.ito.com/weblog/2005/03/05/yak-shaving.html\" rel=\"nofollow\">\n   shaving a yak\n  </a>\n  which means reverse engineering on stack exchange isn't what you really need (probably serverfault).\n </p>\n <p>\n  if you're polling or performing ping/pong client-server communications for simple metrics or something, just sign up with O2 or Deutsch Telekom (best coverage in EU AFAIK), pop the SIM card into your 3g/4g dongle and use the dongle on your server.\n </p>\n <p>\n  From there, you can just use your cellphone to text the number associated with the dongle's sim card (parsing the text message is left to the reader as an exercise). For your server, you can either send an email to an SMS-to-email gateway to send a response back to your cellphone.\n </p>\n <p>\n  However, this (Reverse-engineering on stack exchange) ISN'T the place to ask for solutions in the 1st place for problems like that. \nAlso, I strongly believe you're shaving a yak.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "grepNstepN",
            "time": "Jun 23, 2016 at 20:17",
            "is_accepted": false,
            "comments": []
        }
    ]
}