{
    "title": "Cannot find the error message",
    "link": "https://reverseengineering.stackexchange.com/questions/12285/cannot-find-the-error-message",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to reverse engineer a program called HD sentinel. What it does, is that shows the health of your disk. Anyway, i try to register, this way i take the error message. Then, i open ollydbg. I extract the program inside the ollydbg. I change the module to \"HDSentinel.exe\"(because by default is ntdll). Then i search for strings, and i search for the particular error. I got nothing. I try to run the program inside ollydbg, and then search for the error. Nothing again. What i am doing wrong ??\n </p>\n</div>\n</body></html>",
    "votes": "-3",
    "answers": 1,
    "views": "475",
    "tags": [
        "executable"
    ],
    "user": "Revolution",
    "time": "Mar 23, 2016 at 18:00",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<html><body><span class=\"comment-copy\">\n \"What am i doing wrong\" - probably nothing. Except expect that a software that's less than 20 years old makes bypassing registration that easy.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Revolution",
            "text": "<html><body><span class=\"comment-copy\">\n You know, i am not asking from users in stackexchange \"hate\" comments. If you can help me ok, else please get out.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There are various ways of how strings are processed. They are probably aren't in text-planed format. Or probably stored in resources section which you won't find by search strings, have you checked to set a bp on LoadString? it could also be that your application uses a 3rd party dll to handle registration scheme and/or some tricks to encrypt strings. You could also try to pause the program after you get the error message while in debugger and look for call stack and go backward in calls to find where are those messages came from.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "RCECoder",
            "time": "Mar 29, 2016 at 11:10",
            "is_accepted": false,
            "comments": []
        }
    ]
}