{
    "title": "Attaching Ida to a process",
    "link": "https://reverseengineering.stackexchange.com/questions/12320/attaching-ida-to-a-process",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am a little new to ida. So don't judge on the question I am about to ask but I am tired chasing my tail around. I am trying to attach ida to a running process but I get the following error messages:\n </p>\n <blockquote>\n  <p>\n   Can not reset debug privilege: Not all privileges or groups referenced\n  are assigned to the caller.\n  </p>\n  <p>\n   Can not set debug privilege: Not all privileges or groups referenced\n  are assigned to the caller.\n  </p>\n </blockquote>\n <p>\n  Troubleshooting: I am running windows 7 and I have added user account to allow to debug programs in the secpol.msc file. \nAny help will be greatly appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "-1",
    "answers": 2,
    "views": "9k",
    "tags": [
        "ida",
        "debugging",
        "debuggers"
    ],
    "user": "Sam",
    "time": "Apr 1, 2016 at 23:10",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<html><body><span class=\"comment-copy\">\n Not sure if this helps, as i'm running IDA on Linux. But i never had any problems when i started the win32_remote.exe (or win64_remotex64.exe) server with admin privileges and told IDA to use the remote debugger, so this might work for you. I could imagine that even when your account is allowed to debug programs, it isn't allowed to debug programs that are running under an account that has privileges you don't have, because that ability would effectively give you unrestricted admin rights on the system.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Did this happen when debugging a 64-bit application? Because there you get exactly this message  - at least in Windows - when you try to start the Ida remote server to debug a program without admin privilege:\n </p>\n <p>\n  \"IDA Windows 64-bit remote debug server(MT) v1.15. Hex-Rays (c) 2004-2012\nCan not set debug privilege: Not all privileges or groups referenced are assigned to the caller.\"\n </p>\n <p>\n  With 64 bit debugging this is relevant, as there the use of the remote server is mandatory, even when debugging locally. You must not forget to start it as administrator, otherwise you get the mentioned error message in the servers window. Trying to attach to a process anyway causes Ida to present the following message box:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/aJFxR.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/aJFxR.jpg\"/>\n  </a>\n </p>\n <p>\n  Tested in Ida 64-bit, V6.3\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "josh",
            "time": "Apr 8, 2016 at 17:26",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Those aren't error messages; they're notifications.\n </p>\n <p>\n  The \"debug privilege\" in Windows is a bit of a misnomer. A debugger process does not typically need to have the debug privilege in order to debug a target process.\n </p>\n <p>\n  A process with the debug privilege can open a handle to any other process and circumvent the standard\n  <a href=\"https://msdn.microsoft.com/en-us/library/windows/hardware/ff563674.aspx\" rel=\"nofollow\">\n   access checks\n  </a>\n  performed by Windows. But if you only need to debug a process for which you already have permission to open a handle then there's no need for the privilege.\n </p>\n <p>\n  <a href=\"https://support.microsoft.com/en-us/kb/131065\" rel=\"nofollow\">\n   Official wording from Microsoft\n  </a>\n  regarding the debug privilege:\n </p>\n <blockquote>\n  <p>\n   This functionality is provided for system-level debugging purposes.\n  For debugging non-system processes, it is not necessary to grant or\n  enable this privilege.\n  </p>\n </blockquote>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Jason Geffner",
            "time": "Apr 4, 2016 at 13:47",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Sam",
                    "text": "<span class=\"comment-copy\">I realize that now! I was setting up ida wrong in the beginning. Thanks for the microsoft reference.</span>",
                    "time": null
                }
            ]
        }
    ]
}