{
    "title": "Legality of reverse engineering firmware",
    "link": "https://reverseengineering.stackexchange.com/questions/12324/legality-of-reverse-engineering-firmware",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Not sure if this is the correct place to post this, but I am having some questions regarding the legality of reverse engineering firmware.\n </p>\n <p>\n  Specifically, I was looking into the Nintendo 3DS firmware. The EULA clearly states:\n </p>\n <blockquote>\n  <p>\n   You may not publish, copy, modify,\n   <strong>\n    reverse engineer\n   </strong>\n   , lease, rent,\n  decompile, or disassemble any portion of the Software, or bypass,\n  modify, defeat, tamper with, or circumvent any of the functions or\n  protections of your Nintendo 3DS, unless otherwise permitted by law.\n  </p>\n  <p>\n   Code of Conduct:\n  </p>\n  <p>\n   To help keep the Network Services friendly and safe for all users, you\n  will not engage in any harmful, illegal, or otherwise offensive\n  conduct, such as:\n  </p>\n  <p>\n   Trying to modify or gain unauthorized access to another person’s\n  Nintendo Device or Network Account or trying to modify,\n   <strong>\n    reverse\n   </strong>\n   <strong>\n    engineer\n   </strong>\n   , or gain unauthorized or automated access to any of\n  Nintendo’s computers, hardware, software, or networks used to provide\n  the Network Services or any feature of a Nintendo Device;\n  </p>\n  <p>\n   Hosting, intercepting, emulating,\n   <strong>\n    reverse engineering\n   </strong>\n   , or redirecting\n  the communication protocols used by Nintendo as part of a Nintendo\n  Device or the Network Services, regardless of the method used to do\n  so; or do anything that might bypass or circumvent measures employed\n  to prevent or limit access to any area, content or code of any\n  Nintendo Device or Network Services (except as otherwise expressly\n  permitted by law);\n  </p>\n </blockquote>\n <p>\n  And yet you see blog posts like these:\n  <a href=\"http://gaasedelen.blogspot.ca/2014/03/depackaging-nintendo-3ds-cpu.html\">\n   http://gaasedelen.blogspot.ca/2014/03/depackaging-nintendo-3ds-cpu.html\n  </a>\n </p>\n <p>\n  My question is, what are the legal implications of reverse engineering the 3DS firmware and posting your finding in a blog post?\n </p>\n</div>\n</body></html>",
    "votes": "8",
    "answers": 1,
    "views": "1k",
    "tags": [
        "firmware"
    ],
    "user": "SivaDotRender",
    "time": "Apr 2, 2016 at 14:58",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n I'd argue that, since this was evidently done for academic purposes, different rules apply.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This depends on a multitude oft things, especially your location, and you should really ask a lawyer. If Nintendo sues you, \"a random guy in the internet said it was ok\" won't help you anything; your lawyer can at least help you in court and should have insurance to cover up if things really go wrong.\n </p>\n <p>\n  There are limits to what an EULA can forbid you to do. But this depends a lot in your location. In the US, EULAs\n  <em>\n   tend\n  </em>\n  to overrule rights that laws give you, in EU, law\n  <em>\n   tends\n  </em>\n  to overrule EULAs. There is an EU directive that, greatly simplified, says you are allowed to reverse engineer stuff if you want to interface it with other stuff and the manufacturer doesn't give you neccesary documentation.\n </p>\n <p>\n  This is sometimes misinterpreted to mean \"as long as you live in the EU, reverse engineering is ok\".\n  <strong>\n   This is wrong\n  </strong>\n  . A EU directive is not comparable to US federal law; it just means the individual states have to pass laws with a general content. They have considerable leeway in doing so, and sometimes, EU directives don't get turned into national law at all. So what might be ok in one state might not be in another one. Or, you might be required to prove you asked for documentation and were refused before you reverse engineered anything.\n </p>\n <p>\n  And even the existance of a blog post does not mean the blogger isn't breaking any laws. Nintendo might just not know about the post, or not care, or not want to draw the attention a lawsuit means. This doesn't mean they won't sue you.\n </p>\n <p>\n  And of course, you may be doing something that turns out to be legal after a 3 year lawsuit that cost you several dozen thousand dollars. Companies have far greater resources than you do; winning your case in the end can still mean lots of trouble in the first place.\n </p>\n <p>\n  So, any advice you can get on the internet will be bad advice. Don't take it. Ask someone who can take into account the specifics of your situation, and whom you can hold responsible in the case of bad advice.\n </p>\n</div>\n</body></html>",
            "votes": "8",
            "user": "Guntram Blohm",
            "time": "Apr 2, 2016 at 23:30",
            "is_accepted": true,
            "comments": [
                {
                    "user": "DarthGizka",
                    "text": "<span class=\"comment-copy\">Good summary. To boot, even if EU/local law allows us to stick our noses under the hood, that does not necessarily mean that we are allowed to tell third parties about what we see there (least of all the world at large).</span>",
                    "time": null
                },
                {
                    "user": "rev",
                    "text": "<span class=\"comment-copy\">I really want to point out something: in a world controlled by code, reverse engineering creates transparency. If you REALLY need to put some information on the internet, creating a fake account with a proxy (Tor, whatever) and posting it is enough. If it's THAT important it'll get spread, and suing won't be an effective tool to censor it. They can't sue you (the author) because you're anonymous and they can't go around sueing everybody that shares the information.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Law <i>always</i> overrules a EULA (it's why the salvatory clauses exist, usually at the end of contracts, so that some invalid provision in a contract doesn't invalidate the whole contract). Good point about EU directives not <i>being</i> law, though. Also I wholeheartedly agree that a lawyer needs to be consulted when unsure (which is, after all, why the question was posited).</span>",
                    "time": null
                }
            ]
        }
    ]
}