{
    "title": "Find messagebox string with ollydbg",
    "link": "https://reverseengineering.stackexchange.com/questions/12438/find-messagebox-string-with-ollydbg",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  For some reason i can't find any string matching the MessageBox text of a program when searching with \"search all reference strings\" , why is that?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "2k",
    "tags": [
        "disassembly",
        "ollydbg"
    ],
    "user": "Cornelius Aurel",
    "time": "Apr 13, 2016 at 17:21",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There are many, many\n  <em>\n   possible\n  </em>\n  reasons:\n </p>\n <ul>\n  <li>\n   the MessageBox text may be combined from several shorter snippets before being used\n  </li>\n  <li>\n   the text may be hidden in the resource part of the executable\n  </li>\n  <li>\n   the text may be loaded from a resource file at runtime, possibly depending on the language of the windows installation\n  </li>\n  <li>\n   the text may be in the executable file in an uncommon format; for example, if the software was written in chinese first, then translated to english, the strings may be in some UTF-16 or even UTF-32 format instead of the more common ASCII/UTF-8/ISO-8859-X formats\n  </li>\n  <li>\n   the application may be a client/server application, where the client retrieves the text from the server, and never stores/produces it itself\n  </li>\n  <li>\n   the text may have been deliberately obfuscated/encrypted in the executable file, to prevent people with ollydbg searching for it\n  </li>\n  <li>\n   and much more that doesn't come to mind right now.\n  </li>\n </ul>\n</div>\n</body></html>",
            "votes": "5",
            "user": "0xC0000022L",
            "time": "Apr 14, 2016 at 11:55",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Cornelius Aurel",
                    "text": "<span class=\"comment-copy\">It probably has to do something with networking, as it checks if updates has been found.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@CorneliusAurel: well the string could also be retrieved from the update server, when checking for an update, sure. But you provide too few details to be able to tell the exact cause. Unless you improve your answer a lot, Guntram's answer is along the lines of what you can expect. And a good answer at that.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Probably you can't find the string you are looking for because strings are encrypted in that executable.\n </p>\n <p>\n  This is a common thing, and is done in the attempt to make the life of reverse engineers much harder.\n </p>\n <p>\n  It can be a simple encryption like\n  <code>\n   xor\n  </code>\n  -ing the strings, or some much more complex encryption.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "0xC0000022L",
            "time": "Apr 14, 2016 at 11:55",
            "is_accepted": false,
            "comments": []
        }
    ]
}