{
    "title": "Interact with a 868,95 MHz device",
    "link": "https://reverseengineering.stackexchange.com/questions/12435/interact-with-a-868-95-mhz-device",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've got a device that measures the heat in my apartment and sends the data to a master every day. It works on 868,95 MHz frequency. I want to be able to read this data. I've got some basic in Arduino, can it be a way?\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "562",
    "tags": [
        "radio-interception"
    ],
    "user": "Luca Scalvi",
    "time": "Apr 13, 2016 at 15:34",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Googling for \"868 MHZ Arduino\" yields several results of transmitters/receivers (transceivers) that can be attached to an arduino, including example programs. You could start with buying 1 of those, put it in receive mode, leave it on for 24h and check what it receives, and check if it really receives data only once in 24h, or maybe more often.\n </p>\n <p>\n  Then, save the data, start experimenting, change the temperature in your apartment, and check how the bytes change, to find out which byte is which.\n </p>\n <p>\n  Of course, if your apartment has such a sensor, it's probable the surrounding apartments have the same, and you'll receive their transmissions as well. Probably part of the data that gets transmitted is some kind of sender id; monitoring the time differences between receptions should give you, after a while, an idea which data comes from which sender; check what's common between them to find out what's the ID and what's the actual data.\n </p>\n <p>\n  Also, googling for the model number of your transmitter, together with \"technical manual\" or similar, might give you some hints about the protocol that's used, which might save you some hassle in decoding everything yourself.\n </p>\n <p>\n  Of course, all of this is vague, but as long as your question doesn't go into any more detail, answers can't either.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Guntram Blohm",
            "time": "Apr 13, 2016 at 17:01",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Dominik Antal",
                    "text": "<span class=\"comment-copy\">Alternatively, a simple 20$ RTLSDR USB stick could get the job done with  Gnuradio. Search for \"gnuradio decoding\" on google orr the the <a href=\"https://ham.stackexchange.com/search?q=decoding\">HAM</a> subsite. Also <a href=\"https://www.sigidwiki.com/wiki/Signal_Identification_Guide\" rel=\"nofollow noreferrer\">this</a> could come handy. Good luck, sounds like a fun project!</span>",
                    "time": null
                },
                {
                    "user": "Luca Scalvi",
                    "text": "<span class=\"comment-copy\">Thanks for all these informations. I'm on a very initial stage. I'm analyzing what it's in front of me. I also have an optical interface, but I feel more comfortable on te rf way...I'll give you soon more informations</span>",
                    "time": null
                }
            ]
        }
    ]
}