{
    "title": "XMPP clubs in league of legends",
    "link": "https://reverseengineering.stackexchange.com/questions/12487/xmpp-clubs-in-league-of-legends",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Hopefully I'm asking this at the right place. League of legends recently added the option to join a club. Clubs still use the\n  <a href=\"https://en.wikipedia.org/wiki/XMPP\" rel=\"nofollow\">\n   XMPP protocol\n  </a>\n  just like before for their public chat rooms:\n  <a href=\"http://leagueoflegends.wikia.com/wiki/User_blog:Sevenix/Connecting_to_the_LoL_chat_using_XMPP\" rel=\"nofollow\">\n   XMPP for public rooms\n  </a>\n  .\n </p>\n <p>\n  For public chat rooms, you connect through the \"lvl.pvp.net\" server.\n </p>\n <p>\n  For the private clubs' chat rooms, the server is now \"pgc.pvp.net\".\n </p>\n <p>\n  My problem is that I can't figure out how to find the room address to connect to a club. The clubs are private rooms. Only someone that is part of the club can view and chat in the club. Unlike for a public chat room, where the address is simply:\n  <strong>\n   <em>\n    pu~\"Channel name hashed and no capital letters\"\n   </em>\n  </strong>\n  , a club address is a UUID and therefore, unlike public rooms, it's impossible to figure out the room address from the club name.\n </p>\n <p>\n  Riot is fine with people connecting to the XMPP server from outside apps, but they haven't provided an easy way to find the UUID for a club room.\n </p>\n <p>\n  How do I find what it is for my club?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 4,
    "views": "1k",
    "tags": [
        "protocol",
        "strings",
        "networking",
        "sniffing"
    ],
    "user": "Apos",
    "time": "Apr 20, 2016 at 2:26",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "<html><body><span class=\"comment-copy\">\n Is there any official documentation that leads to the pgc.pvp.net server? Your link doesn't mention it. If the official documentation doesn't have any hints, and if the official client uses xmpp as well, use\n <a href=\"https://mitmproxy.org/\" rel=\"nofollow noreferrer\">\n  mitmproxy\n </a>\n to sniff on its connection to the server.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Apos",
            "text": "<html><body><span class=\"comment-copy\">\n I contacted an employee from Riot and he told me the server.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Azami",
            "text": "<html><body><span class=\"comment-copy\">\n I'm currently working on a way to detect premades in a game, and my first check is to see if two players have the same club name. If you found a way to identify them in XMPP, I'd be glad to hear it!\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There are two possibilities:\n </p>\n <ol>\n  <li>\n   The League of Legends client uses an embedded algorithm to\n   <a href=\"https://en.wikipedia.org/wiki/Injective_function\" rel=\"nofollow\">\n    injectively\n   </a>\n   map a club name to a club UUID.\n  </li>\n  <li>\n   The League of Legends client sends the club name to the server and receives the club UUID in response.\n  </li>\n </ol>\n <p>\n  Either way, you'd be able to see what UUID-channel is eventually joined by the League of Legends client by sniffing the XMPP traffic, as @guntram-blohm suggested.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Apr 20, 2016 at 14:46",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Apos",
                    "text": "<span class=\"comment-copy\">Does Fiddler4 allow me to do that? I've also tried to search the right info with Wireshark, but no luck so far with those two. mitmproxy doesn't seem to work well with Windows?</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">I'd try <a href=\"https://github.com/vergl4s/pentesting-dump/blob/master/net/Windows/EchoMirage-3.1.exe?raw=true\" rel=\"nofollow noreferrer\">Echo Mirage</a>.</span>",
                    "time": null
                },
                {
                    "user": "Apos",
                    "text": "<span class=\"comment-copy\">I used Echo Mirage, but it looks like the XMPP traffic is behind SSL.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">Echo Mirage works pretty well at decrypting OpenSSL-based SSL traffic and Winsock-based SSL traffic, but if League of Legends is using neither, you'll likely have to apply your own hooks manually to see the traffic in plaintext.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  From what I found out when I searched a bit for a chat bot, you will have a hard time finding out the UUID. With the old private chat rooms you were able to get the id by sending an invite to the room. But now even the invites to the clubs are handled by the rtmp server of Riot (afaik but def. not from xmpp) and most clients/libs/apis to connect to this server were discontinued from development in 2014 when Riot introduced their API and planned to ban the accounts used for this.\n </p>\n <p>\n  One option you could try is to search in the logs of the client. At least the public chatrooms are saved in a file if you tick them as open on startup. \nI miss the really extensive logs of everything they produced in 2011. It included everything from chatroom names to names of pre/postmatch chat room names etc.\n </p>\n <p>\n  If you find a solution I would be interested in it.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "M. Vol",
            "time": "May 9, 2016 at 12:26",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you connect to LoL chat with XMPP and get info of someone from your club you will see:\n </p>\n <pre><code><clubsData>hYmfLrVHS1lU6FAz2BLS4UrbAmcJpH2+HEIYl0rwSQT8m9e3VBMRYLDDNY8Zp4E/LlU8h+27BaWenG7FyL/5I/7yvhy/9CfHoo0rpDuPHs1LwPgHjlwAUUxtvdbGI84h8EU+F+JfYkX8ykl+PyDe89xRBRy7EkDofuDBvzbRVdk=</clubsData>\n</code></pre>\n <p>\n  The clubsData above is from someone that is only in my club. The snippet below is of someone in that same club along with 2 other clubs:\n </p>\n <pre><code><clubsData>hfjHs7InQ85+N0x4O66jpcJ+815YE3z9HUuBiaCEwbe9HLN3LYvkZzxEEOFwMJs72UgOiFKh+fjhpyhQCkXd2OP7OKu5GahsHfHCrSfdJB5yut46Je8ech+o4meWHbJsLpbz0G/RCm6XKrcHpWc5n38LlxzqHIBiPd9cGKJxj18=</clubsData>\n</code></pre>\n <p>\n  I'm not actually sure what to do with that information, but thought it might help someone here.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "lyolyo",
            "time": "May 18, 2016 at 3:03",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I also noticed what IyoIyo mentioned about the clubsData (I'm using the Pidgin XMPP client to connect to Riot's chat servers), and have been trying to determine what to do with that data. I've been trying to join my own club in which I know the actual name, but I'm stuck at the UUID step too.\n </p>\n <p>\n  As a result, I haven't made much progress but I was wondering if any of you has figured this issue out in the meantime - finding the room name of a club in order to join, assuming its server is \"pgc.pvp.net\" as Amos mentioned.\n </p>\n <p>\n  -\n </p>\n <p>\n  Pardon my \"answer\" post as I also stumbled upon this issue recently and literally just made a SE account to reply to this thread lol.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "xintiao",
            "time": "Aug 11, 2016 at 9:39",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Apos",
                    "text": "<span class=\"comment-copy\">I haven't made more progress. My plan was originally to make a bot to kick offline people out and invite them again when they'd be back online. My club has so many members that the 50 players limit wasn't high enough (There are never 50 people online at the same time usually). Instead I just made more than 1 club. It sucks that not everyone is together, but oh well... The extra work around was to create a Discord room.</span>",
                    "time": null
                },
                {
                    "user": "Apos",
                    "text": "<span class=\"comment-copy\">Since they added clubs to their android \"LoL Friends\" app, it's probably easier to reverse engineer that.</span>",
                    "time": null
                }
            ]
        }
    ]
}