{
    "title": "How would I go about getting an application's XMPP request before it is SSL-encrypted?",
    "link": "https://reverseengineering.stackexchange.com/questions/12850/how-would-i-go-about-getting-an-applications-xmpp-request-before-it-is-ssl-encr",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <strong>\n   Disclaimer:\n  </strong>\n  I am\n  <strong>\n   very\n  </strong>\n  new to Reverse Engineering, though it captivates me. Hence, I'm apologizing beforehand if I say anything ridiculous in the following, and hope you will help me find the way!\n </p>\n <p>\n  <strong>\n   Context:\n  </strong>\n  I have an application which seems coded in Adobe AIR and running on my x64 Windows 7. This application does a lot of things, but what interests me is: it communicates with an\n  <strong>\n   XMPP\n  </strong>\n  server through port 5223, through\n  <strong>\n   SSL\n  </strong>\n  . My goal is to be able to read the XML requests sent by the client to the server\n  <strong>\n   before\n  </strong>\n  they are SSL-encrypted (so right after the request is created, but right before it is encrypted).\n </p>\n <p>\n  <strong>\n   Unsuccessful tries:\n  </strong>\n  I attempted to set up a\n  <strong>\n   MitM\n  </strong>\n  , but the application won't accept my custom-crafted certificate because it is different from the real server certificate. I also attempted to use\n  <strong>\n   Echo Mirage\n  </strong>\n  , but without any success.\n  \n\n  \n\n  \n\n  I have read a bit about\n  <a href=\"https://en.wikipedia.org/wiki/Hooking\" rel=\"nofollow\">\n   hooking\n  </a>\n  , and figured it was adapted to my problem. I was thinking: if I can get the application to print the XMPP request before SSL-encrypting it, the job would be done. To do so, implementing a C# hook with\n  <a href=\"https://easyhook.github.io/\" rel=\"nofollow\">\n   EasyHook\n  </a>\n  seemed like a good idea to me.\n </p>\n <p>\n  Am I largely mistaken? If not, how exactly would I go about getting my hook function to print the requests, and before which function call should I place it?\n  \n\n  I am open to any documentation you might have for me!\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "247",
    "tags": [
        "function-hooking"
    ],
    "user": "Azami",
    "time": "Jun 15, 2016 at 13:16",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Thanks for providing a good amount of context in your question.\n </p>\n <p>\n  Yes, hooking is the way to go. The function that you'd want to hook is the function that performs the SSL encryption, as it would be the function that receives the plaintext as input.\n </p>\n <p>\n  The hard part is finding that encryption function. To do so, I recommend that you use\n  <a href=\"https://technet.microsoft.com/en-us/sysinternals/processmonitor.aspx\" rel=\"nofollow\">\n   Process Monitor\n  </a>\n  to capture the network-send events and double-click on those events to see the callstack. You can then use a disassembler and/or a debugger to analyze the functions in the callstack that are called prior to the low-level network send call. This will help you narrow down which functions to analyze so that you can more easily find the function that performs the encryption.\n </p>\n <p>\n  Alternatively, you can try to find the encryption function by searching for cryptographic functions via a tool like\n  <a href=\"https://www.aldeid.com/wiki/PEiD#Krypto_Analyzer\" rel=\"nofollow\">\n   PEiD with its Krypto ANALyzer plugin\n  </a>\n  and then analyzing them with a disassembler.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Jason Geffner",
            "time": "Jun 15, 2016 at 14:31",
            "is_accepted": false,
            "comments": []
        }
    ]
}