{
    "title": "How would I go about imaging a propriatary flash or eeprom memory chip?",
    "link": "https://reverseengineering.stackexchange.com/questions/12873/how-would-i-go-about-imaging-a-propriatary-flash-or-eeprom-memory-chip",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've been playing around a lot with the xeltek reader, which lets me image various memory chips. Usually, I just use the catalog number used to get the chip's datasheet and search xelteks database for a proper adapter.\n </p>\n <p>\n  But what if I have an electronic device that uses a proprietary chip or no catalog number is given.\n </p>\n <p>\n  How would I go about making a binary image of the mystery chip in question? Is there any readily available hardware that will help do this?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "307",
    "tags": [
        "memory",
        "digital-forensics",
        "memory-dump"
    ],
    "user": "ChipsAhoy",
    "time": "Jun 17, 2016 at 14:21",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am\n  <strong>\n   no expert in the matter\n  </strong>\n  but that seems\n  <strong>\n   highly unlikely\n  </strong>\n  . There are 2 ways how to approach that I know of:\n </p>\n <ol>\n  <li>\n   <p>\n    <strong>\n     detect/exploit/sniff known interface\n    </strong>\n   </p>\n   <p>\n    Like\n    <strong>\n     SPI,JTAG\n    </strong>\n    ,... or even memory interface (address,data and control buses) and do the dump with some\n    <strong>\n     MCU\n    </strong>\n    to\n    <strong>\n     PC\n    </strong>\n    adapter attached to it or dump to\n    <strong>\n     SD\n    </strong>\n    card or what ever. This is not invasive approach but needs to have the interface present. If you do not have the pinout for the chip (or the\n    <strong>\n     PCB\n    </strong>\n    ...) try to find the other stuff connected to it.  Also using oscilloscope helps.\n   </p>\n   <p>\n    However if the access to data is restricted you're out of luck (fuses,\n    <strong>\n     HW/SW\n    </strong>\n    key ...). Also this way is not guaranteed that you will got the whole memory dump either. Mostly the interfaces are controlled by software so you would need to hack in the protocol. With\n    <strong>\n     HW\n    </strong>\n    interfaces you got direct chip access according to your privileges set by fuses...\n   </p>\n   <p>\n    see related\n    <a href=\"https://reverseengineering.stackexchange.com/q/12812/4709\">\n     Thought I found serial port - broke embedded device instead! Help?\n    </a>\n   </p>\n  </li>\n  <li>\n   <p>\n    <strong>\n     Die shot analysis\n    </strong>\n   </p>\n   <p>\n    In some cases the chip is sliced to obtain a die shot (but that of coarse destroys the chip for good). Then according to used technology you can reverse engineer the whole circuit diagram including\n    <strong>\n     PROM\n    </strong>\n    related stuff and obtain the data \"directly\". With\n    <strong>\n     EEPROM\n    </strong>\n    is this tricky as the information is stored as charge so you would need some really tricky sensors to scan that more like some liquid crystal based solution. but the possibility of error is extremly high as the info can be discharged by the slicing, by any contact with air or anything. Better would be reverse the circuit and detect programming interface on some spare chip and then use\n    <strong>\n     #1\n    </strong>\n    on the real one ...\n    <strong>\n     FLASH\n    </strong>\n    memories are based on domino technology so it should be detectable from the die shot directly like\n    <strong>\n     PROM\n    </strong>\n    too.\n   </p>\n   <p>\n    See related:\n   </p>\n   <ul>\n    <li>\n     <a href=\"https://reverseengineering.stackexchange.com/a/8773/4709\">\n      How was the Zero Flag implemented on Z80 ALU?\n     </a>\n    </li>\n    <li>\n     <a href=\"https://reverseengineering.stackexchange.com/a/3111/4709\">\n      Physically auditing the layout of transistors inside a processor made at 22mm process die\n     </a>\n    </li>\n   </ul>\n  </li>\n </ol>\n <p>\n  To make some universal\n  <strong>\n   HW\n  </strong>\n  for this you would need to have some analog multiplexors switching matrix to be able to support any pinout and then prior to use configure which pin is what (power supply, data, ...). That is more or less possible (considering voltage, current, impedance, and frequency requirements) but to use it you would need the necessary info you do not have for unknown chip anyway ...\n </p>\n <p>\n  To detect the chip first you would need to try power it up which will most likely burn any chip with wrongly selected pins... making universal detection impossible. For a group of similar chips is this possible but again you would need some info about them ...\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ChipsAhoy",
                    "text": "<span class=\"comment-copy\">Thanks for thorough response. So assuming I had an infinite supply of chips to test, would it be just trial and error?   The only pre-existing knowledge I would have about the electronic device is the 28 connector pin out that it interfaces with other electronic devices with.</span>",
                    "time": null
                },
                {
                    "user": "Spektre",
                    "text": "<span class=\"comment-copy\">@ChipsAhoy If you got the pinout then you know which pins are power, ground, shield and interfaces so there are no guesses ... but to have minimal circuit  usually chips need few capacitors, crystal etc ... which can be deduced from PCB you are inspecting.  Then it is just matter of scanning for programing protocol ...</span>",
                    "time": null
                }
            ]
        }
    ]
}