{
    "title": "How to find address of more complicated, unknown data structures",
    "link": "https://reverseengineering.stackexchange.com/questions/12904/how-to-find-address-of-more-complicated-unknown-data-structures",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to read messages from a (32bit windows application) chat window. Unfortunately, the window has a custom class, therefore\n  <a href=\"https://msdn.microsoft.com/de-de/library/windows/desktop/ms633520(v=vs.85).aspx\" rel=\"nofollow\">\n   GetWindowText()\n  </a>\n  doesn't help. I need to read the data from memory somehow.\n </p>\n <p>\n  I've looked into it with CheatEngine and found the strings I was looking for in several places. However, it seems that their location changes from time to time, because the value at the addresses changed, for example when new text was entered in the chat.\n </p>\n <p>\n  Unfortunately I'm no expert on this subject. My naive assumption would be, that the strings are contained in some vector-like data structure (and the changing values at the addresses could be caused by reallocation?), but I'm not sure about that ofcourse.\nI have written a basic MemoryScanner thats able to find some integer values (and I'm sure I could extend it to find strings as well), but how do I proceed from here, if I neither know the address of the chat messages nor the exact layout of the underlying data structure?\n </p>\n <p>\n  I'm grateful for any suggestions!\n </p>\n <p>\n  EDIT: I have started to analyze the program with IDA Pro. I have found several strings (in the .rdata section), that are regularly used in the chat, even 'printf'-like with name replacements.\nI have set breakpoints on these strings, as well as the functions that call these strings. However, they don't get triggered when chat messages are entered.\n </p>\n <p>\n  Is there something I need to know about the .rdata segment? Does it get loaded on program startup for example? If so, how would I proceed from here?\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "569",
    "tags": [
        "ida",
        "windows",
        "memory",
        "strings"
    ],
    "user": "Johannes Stricker",
    "time": "Jun 24, 2016 at 11:58",
    "comments": [
        {
            "user": "Patrick Roberts",
            "text": "<html><body><span class=\"comment-copy\">\n Well the long way is to disassemble the application binary so you can look at the data structure yourself. Right now, you don't really have enough information to refine your memory scanner so that's the only way I can think of.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Johannes Stricker",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks, do you have any good links/tutorials on how to do that? I have only found\n <a href=\"http://opensecuritytraining.info/IntroductionToReverseEngineering.html\" rel=\"nofollow noreferrer\">\n  this\n </a>\n so far, but haven't started to work on it, yet.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Patrick Roberts",
            "text": "<html><body><span class=\"comment-copy\">\n There are plenty of resources available on this site alone. If you want a tool, there is\n <a href=\"https://www.hex-rays.com/products/ida/\" rel=\"nofollow noreferrer\">\n  IDA\n </a>\n , which has a tag\n <a href=\"https://reverseengineering.stackexchange.com/questions/tagged/ida\">\n  ida\n </a>\n here you can ask questions about.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Johannes Stricker",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks. I have started to get familiar with IDA PRO. I've edited the initial question with my current progress. I'd appreciate a hint in the right direction ;)\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There is also out of the box solution for this possible I developed to acquire IR image feed from special industry camera available only as a preview in the camera software. I needed the feed in my own application to regulate some heat process in Real-Time. I come up with this:\n </p>\n <ol>\n  <li>\n   <p>\n    <strong>\n     Obtain target window Windows handler\n    </strong>\n   </p>\n   <p>\n    Each visual component in Windows App has its own Handler and some are handled as windows as well. So:\n   </p>\n   <ol>\n    <li>\n     list all the Apps running in your system\n    </li>\n    <li>\n     detect which one is your chat\n    </li>\n    <li>\n     list all of its child handles/subwindows\n    </li>\n    <li>\n     detect the right chat subwindow/subcomponent\n    </li>\n   </ol>\n   <p>\n    for more info and C++ source how to do it see:\n   </p>\n   <ul>\n    <li>\n     <a href=\"https://reverseengineering.stackexchange.com/a/11920/4709\">\n      is ther a way an app can display a message without the use of messagebox API?\n     </a>\n    </li>\n   </ul>\n  </li>\n  <li>\n   <p>\n    <strong>\n     obtain its Canvas image\n    </strong>\n   </p>\n  </li>\n  <li>\n   <p>\n    <strong>\n     OCR it\n    </strong>\n   </p>\n   <p>\n    Chats has usually pixel perfect single font so it should be easy and not too slow if done right so RealTime should be possible. You can use direct pixel comparison or something more advanced but still simple like:\n   </p>\n   <ul>\n    <li>\n     <a href=\"https://stackoverflow.com/a/22879053/2521214\">\n      OCR and character similarity\n     </a>\n    </li>\n   </ul>\n   <p>\n    Or use any OCR lib out there alike Tesseract ...\n   </p>\n  </li>\n  <li>\n   <p>\n    <strong>\n     do your stuff with the text ...\n    </strong>\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Johannes Stricker",
                    "text": "<span class=\"comment-copy\">Thanks for the idea. I've tried to do this with OCR using opencv and tesseract. My results were quite good, without too much optimization, however the OCR took around 3seconds every time, which is just way too slow. I would at least need something around ~500ms.</span>",
                    "time": null
                },
                {
                    "user": "Spektre",
                    "text": "<span class=\"comment-copy\">@JohannesStricker that should be doable in few <code>[ms]</code> have you some screen shots?  I do not use any of the libs I am more used to code it myself in C++. As this is pixel perfect the Tesseract and OpenCV is overkill.  I like to try it. I need  screen-shot of the full alphabet and or ASCII used and then one or more shots of some messages so I can test the speed... although it would take me a bit of time to code it but have it in my wish-list  for some time so its good reason/time as any anyway Last time I did OCR for commercial purposes the OpenCV/Tesseract was too slow against that OCR I linked</span>",
                    "time": null
                },
                {
                    "user": "Johannes Stricker",
                    "text": "<span class=\"comment-copy\">Okay, so what you would try to do is just grab the character pattern and do the OCR yourself? That might be possible and I would maybe use it as a last resort, if I am unable to retrieve the messages from memory. Thanks for the input!</span>",
                    "time": null
                },
                {
                    "user": "Spektre",
                    "text": "<span class=\"comment-copy\">@JohannesStricker Yep that was exactly what I was thinking</span>",
                    "time": null
                }
            ]
        }
    ]
}