{
    "title": "What's the most straightforward way to change a simple thing in Android APK java application?",
    "link": "https://reverseengineering.stackexchange.com/questions/12941/whats-the-most-straightforward-way-to-change-a-simple-thing-in-android-apk-java",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I need to make some simple tweaks to Android APP that keeps crashing. Viewing the code and seeing possible problems is pretty simple.\n </p>\n <p>\n  I can either:\n </p>\n <ul>\n  <li>\n   Use\n   <a href=\"http://ibotpeaches.github.io/Apktool/install/\" rel=\"nofollow\">\n    Apktool\n   </a>\n   (eg.\n   <code>\n    apktool d name_of_apk.apk -o my_folder\n   </code>\n   ) and then view\n   <code>\n    .smali\n   </code>\n   files that will be created from\n   <code>\n    classes.dex\n   </code>\n  </li>\n  <li>\n   Use dex2jar, then view or decompile the\n   <code>\n    jar\n   </code>\n   file using JD-Gui\n  </li>\n  <li>\n   Just use\n   <a href=\"https://bytecodeviewer.com/\" rel=\"nofollow\">\n    https://bytecodeviewer.com/\n   </a>\n   which allows me to view the .dex file\n  </li>\n </ul>\n <p>\n  As you noticed, all above was about\n  <strong>\n   viewing\n  </strong>\n  the code. I need to submit changes to it though. One way to do this would be to simply re-create the original project from decompiled sources, presumably using Android Studio.  That seems like boring and tedious process.\n </p>\n <p>\n  Since changes I need to perform are miniscule, such as changing\n  <code>\n   debug\n  </code>\n  to\n  <code>\n   true\n  </code>\n  , I would appreciate simpler solution... Is it possible to just edit bytecode of the\n  <code>\n   .dex\n  </code>\n  file?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "1k",
    "tags": [
        "android",
        "java",
        "apk"
    ],
    "user": "Tom치코 Zato",
    "time": "Jun 27, 2016 at 14:03",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Use apktool to disassemble it into smali, edit the smali, then reassemble with apktool. I've done it tons of times, and it's easy.\n </p>\n <p>\n  You could also manually edit the dex file in simple cases, but this is a HUGE pain. I generally only resort to it in cases where smali itself can't handle something properly.\n </p>\n <p>\n  Note that dex files are much harder to manually edit than java classfiles due to all the extra constraints. First off, you have to update the checksums at the top of the file each time. Additionally, all the string tables must be sorted, which means that even simple renamings can change the entire file if it changes the order of any strings. There's also a lot of things that give offsets into the file. You pretty much need an assembler for dex.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Antimony",
            "time": "Jun 27, 2016 at 14:11",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Tom치코 Zato",
                    "text": "<span class=\"comment-copy\">How can I edit the smali files? I tried to put them into bytecode editor but it didn't understand the format...</span>",
                    "time": null
                },
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">Smali files are text files, comparable to assembly code. Change them using your favourite text editor. <code>apktool</code> uses <code>baksmali</code> and <code>smali</code> internally to \"disassemble\" and \"assemble\" them.</span>",
                    "time": null
                }
            ]
        }
    ]
}