{
    "title": "What are the steps, to extract an unknown archive file in this case?",
    "link": "https://reverseengineering.stackexchange.com/questions/13126/what-are-the-steps-to-extract-an-unknown-archive-file-in-this-case",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've never did something like this before, but I have programming experiences. There are two files:\n  <code>\n   data00.big\n  </code>\n  and\n  <code>\n   data01.big\n  </code>\n  , which I would like to extract.\n </p>\n <p>\n  I've tried Dragon Unpacker, which can unpack\n  <code>\n   .big\n  </code>\n  files. But it seems, that they aren't valid\n  <code>\n   .big\n  </code>\n  files, just some kind of custom archive, which is named\n  <code>\n   .big\n  </code>\n  , so it seems, I have to write my own unpacker.\n </p>\n <p>\n  The archive was created in 1999. As far as I know, it contains mostly graphic and sound files.\n </p>\n <p>\n  <code>\n   data00.big\n  </code>\n  opened in hexeditor:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/RqJq8.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"hex\" src=\"https://i.sstatic.net/RqJq8.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "decompilation",
        "unpacking",
        "file-format"
    ],
    "user": "Iter Ator",
    "time": "Jul 24, 2016 at 11:42",
    "comments": [
        {
            "user": "w s",
            "text": "<html><body><span class=\"comment-copy\">\n Can you post a link to the actual files ?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I see filenames. That is an extremely important starting point - if I did not, I'd have to assume the file is encrypted, compressed, or does not use filenames at all, which are all harder to unpack.\n </p>\n <p>\n  For the moment, skip the header \"BigFile\" and the immedtaly following data and concentrate on these filenames alone.\n </p>\n <p>\n  If the filenames have different lengths, you can verify if these are records of a fixed length (where the filenames are padded), or have different lengths, in which case there may be a \"length\" value - or not. A length value may not be necessary, the file names can be terminated by a special value such as\n  <code>\n   0\n  </code>\n  .\n </p>\n <p>\n  There are other values too - usually, in an archive format, these are file lengths. There can also be a file\n  <em>\n   offset\n  </em>\n  - but from where? (E,g., start of file, start of archive data excluding the header, start of actual data, and so on.) A per-file offset is not required if all files appear end to end, then the lengths are enough.\n </p>\n <p>\n  There may be additional information per file record; I have encountered flags, file type codes, date/time stamps, checksums, and more. Usually, after you found out what the most important bits mean, the remaining data makes sense as well.\n </p>\n <p>\n  To find out what byte means what, write a small program to print out each file name and all of its associated data, up to the next file entry. Don't bother with trying to get a correct 'file count' yet. Most likely this is one of the numbers in the header at the start; you can go back to that when you got the file list details right. For starters, just write out the data of the first few dozen of entries.\n </p>\n <p>\n  Keep in mind that you cannot tell right away if extra data comes before or after the file name! Or even both.\n </p>\n <p>\n  File sizes and offsets are usually 4 byte numbers; the endianness can be trivially checked (all small numbers are good, all conspicuously large must be an error). Similar but varying numbers may be file sizes. A number that keeps increasing must be an absolute file offset. Numbers that always contain data in some binary positions and none in others can be flags of some kind. Large values, hovering around similar values, can very well be a time stamp. Finally, random looking full 4 byte numbers might be a checksum.\n </p>\n <p>\n  If you get consistent good results in decoding the data for the test set of file records, find the start and end of the list by trial and error. It's here that you may discover that the \"end\" of a record is actually the\n  <em>\n   start\n  </em>\n  of the next one.\n </p>\n <p>\n  This will tell you (1) the number of records, and (2) the start of the record data. You can inspect if these numbers appear in the \"BigFile\" header - particularly the number of records would be useful.\n </p>\n <p>\n  If you can locate numbers that \"look\" like they could be file lengths and (optionally) offsets, you can write a test program to extract a single file. This may also help with determining the order of data; if you extract a file that is clearly a PNG image but its associated filename is \"config.txt\", you have something in the wrong order.\n </p>\n <p>\n  An alternative to the above is focussing on the\n  <em>\n   data\n  </em>\n  first. Some file types, such as PNG images, should be entirely self containing: if you find the start of a PNG image, you can immediately extract it in its entirety by looking for the tell-tale\n  <code>\n   IEND\n  </code>\n  marker. Then you have a reliable file length and so you can search for a match in the file record set.\n </p>\n</div>\n</body></html>",
            "votes": "9",
            "user": "Jongware",
            "time": "Jul 24, 2016 at 14:12",
            "is_accepted": true,
            "comments": []
        }
    ]
}