{
    "title": "How do I change a string correctly in IDA Pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/13201/how-do-i-change-a-string-correctly-in-ida-pro",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to patch a cydia tweak which has been developed by using Objective-C. I would like to modify a piece of code to suite my need.\n </p>\n <p>\n  I'm using IDA Pro V6.8 for my examining. After inspecting, I recognize that each Hex byte would represent a part of an assembly line code.\n </p>\n <p>\n  <em>\n   Bellow is a screenshot for the code that I need to change.\n  </em>\n  <a href=\"https://i.sstatic.net/I0Yb2.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/I0Yb2.png\"/>\n  </a>\n </p>\n <p>\n  Looking at the above screenshot, we need to have 8 bytes\n  <em>\n   (4A F2 A6 50 C0 F2 01 00)\n  </em>\n  to represent a \"MOV\" instruction. Let's me say something about these 8 bytes:\n </p>\n <ol>\n  <li>\n   As I know, the first four bytes\n   <em>\n    (4A F2 A6 50)\n   </em>\n   represent for \"#(cfstr_UnknownCallbac - 0x9F56)\" which you see in the screenshot.\n  </li>\n  <li>\n   The two following bytes\n   <em>\n    (C0 F2)\n   </em>\n   represent for an MOV instruction.\n  </li>\n  <li>\n   The last two bytes\n   <em>\n    (01 00)\n   </em>\n   would tell the system to move value from the string into the register, in this case, the register is R0.\n  </li>\n </ol>\n <p>\n  <strong>\n   I have some concerns about the MOV instruction and the first four HEX bytes (4A F2 A6 50)\n  </strong>\n </p>\n <ol>\n  <li>\n   <p>\n    What does the \"0x9F56\" in the instruction means?\n   </p>\n  </li>\n  <li>\n   <p>\n    How does the system know that the first four bytes reflect correctly to \"#(cfstr_UnknownCallbac - 0x9F56)\" not any other string variables?\n   </p>\n  </li>\n  <li>\n   <p>\n    <em>\n     I need to create a new string and then I will use it to replace the existing \"#(cfstr_UnknownCallbac - 0x9F56)\"\n    </em>\n    . I believe that I just need to replace the first four HEX bytes so that it would point to the new string, but I don't know what are the HEX codes should I have here.\n   </p>\n  </li>\n </ol>\n <p>\n  Any help is appreciated, thank you very much.\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "10k",
    "tags": [
        "patch-reversing"
    ],
    "user": "Josh",
    "time": "Aug 3, 2016 at 15:18",
    "comments": [
        {
            "user": "joxeankoret",
            "text": "<html><body><span class=\"comment-copy\">\n Isn't it easier to just overwrite the previous string where that string actually is?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Josh",
            "text": "<html><body><span class=\"comment-copy\">\n I would like to have a new string something like \"There is an error when processing your request.\"\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  To understand what's happening, you need to learn about\n  <a href=\"https://en.wikipedia.org/wiki/Position-independent_code\" rel=\"nofollow noreferrer\">\n   Position Independent Code\n  </a>\n  (PIC).\n </p>\n <p>\n  In a nutshell, the compiler wants the executable code to be correct independent of where in memory it gets loaded. In the case of a shared library, the OS may load it at a different place every time; even if statically linked, PIC will make the linker's life easier.\n </p>\n <p>\n  The \"trick\" that's normally used on ARM processors to produce PIC is using PC (Program Counter) relative addresses. The compiler doesn't produce code that says \"the string is at address 0x123456\", it produces \"the string is 0x1234 bytes behind this instruction\". Thus, when the program is moved in memory, the \"0x1234\" stays the same.\n </p>\n <p>\n  Which is why your 2nd instruction adds the program counter to the relative address in R0.\n </p>\n <p>\n  Now, to know what\n  <code>\n   ADD R0, PC\n  </code>\n  really does, you need to know how the processor works. The processor is in Thumb (2 byte instructions) mode as you can see from the 2 bytes difference between\n  <code>\n   9F52\n  </code>\n  and\n  <code>\n   9F54\n  </code>\n  , and when the processor executes the\n  <code>\n   ADD R0, PC\n  </code>\n  instruction, the prefetch unit will already have read the first two bytes of\n  <code>\n   BLX _MSlog\n  </code>\n  . So the PC that gets added is actually\n  <code>\n   9F56\n  </code>\n  . This should answer your\n  <strong>\n   first question\n  </strong>\n  : in the display of the opcode's meaning, IDA subtracts the value it knows to be added in the next instruction.\n </p>\n <p>\n  <strong>\n   Second question\n  </strong>\n  : I don't know the internals of IDA, but I'm 99% sure it looks for\n  <code>\n   ADD Rx, PC\n  </code>\n  instructions, and produces a string reference like yours at the preceding instruction that loads\n  <code>\n   Rx\n  </code>\n  , just because it knows this is the standard way of achieving PIC on ARM.\n </p>\n <p>\n  <strong>\n   Third question\n  </strong>\n  : Manually disasembling Thumb is hard - really hard - as you can see if you check the\n  <a href=\"https://ece.uwaterloo.ca/~ece222/ARM/ARM7-TDMI-manual-pt3.pdf\" rel=\"nofollow noreferrer\">\n   Thumb instruction set\n  </a>\n  . And no,\n  <code>\n   4a f2 a6 50\n  </code>\n  isn't just a data offset; it loads the lower 16 bits of the value, and\n  <code>\n   C0 F2 01 00\n  </code>\n  loads the higher 16 bits of the value. The\n  <a href=\"https://www.onlinedisassembler.com/odaweb/6xokUFH4/0\" rel=\"nofollow noreferrer\">\n   Online Disassembler\n  </a>\n  translates those two sets of 4 byte instructions to\n </p>\n <pre><code>movw r0, #42406 ; 0xa5a6          \nmovt r0, #1\n</code></pre>\n <p>\n  and you can read\n  <a href=\"https://stackoverflow.com/questions/7800055/movw-and-movt-in-arm-assembly\">\n   here\n  </a>\n  about the\n  <code>\n   movw\n  </code>\n  and\n  <code>\n   movt\n  </code>\n  instructions. IDA is friendly enough to show all of this as one single 8-byte instruction, but under the hood, a lot more is going on.\n </p>\n <p>\n  So if you really want to change an offset like this, get familiar with the thumb manual I linked above, learn each and every bit, and assemble the new instructions manually. Or, just (ab)use the gnu assembler in the way I outlined in my answer to\n  <a href=\"https://reverseengineering.stackexchange.com/questions/9094/offset-calculation-for-branch-instruction-in-arm/9096#9096\">\n   this question\n  </a>\n  . Just write a bare minimum assembler snippet and have\n  <code>\n   as\n  </code>\n  handle the gory details for you.\n </p>\n <p>\n  But, as @joxeankoret said: if you just want to change a string, and don't need the original string anwhere else, and the new string isn't longer than the old one, overwriting the string with the new one will be much easier than finding a place for your new string and adjusting the offsets. You can jump to that position by double clicking the label in IDA, or just scroll to the address\n  <code>\n   2FF4C\n  </code>\n  (\n  <code>\n   1A5A6+9F56\n  </code>\n  ).\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Josh",
                    "text": "<span class=\"comment-copy\">Much appreciate your very detailed answer. PIC and the thumb are quite new for me. I am going to look at these terms right away. Hopefully I will figure out the solution soon. Have a nice day!</span>",
                    "time": null
                }
            ]
        }
    ]
}