{
    "title": "Reverse Engineering a 16-bit CRC algortihm",
    "link": "https://reverseengineering.stackexchange.com/questions/13435/reverse-engineering-a-16-bit-crc-algortihm",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a set of data bytes and their CRC values available to me. I want to know the CRC algorithm used by it.\n </p>\n <p>\n  CRC is 16 bit long.\n </p>\n <p>\n  firstly I tried to find out using CRC RevEng but that is showing \"no model found message\".\n </p>\n <p>\n  Then I followed\n  <a href=\"http://www.cosc.canterbury.ac.nz/greg.ewing/essays/CRC-Reverse-Engineering.html\" rel=\"nofollow noreferrer\">\n   CRC Reverse Engineeing\n  </a>\n  paper written by Greg Ewing.\n </p>\n <p>\n  Then I found that my data set is following the superposition principle\nso I came to the conclusion that it is using some standard algorithm to calculate CRC.\n </p>\n <p>\n  According to Greg's paper:\n  \n\n </p>\n <blockquote>\n  <p>\n   two CRC values obtained from two 1-bit messages, where the 1 bits are in adjacent positions, will have thier resulting CRCs differ by just one shift-xor cycle. To be precise, if C1 corresponds to the message with a 1 in position\n   <code>\n    i\n   </code>\n   , and C2 corresponds to the message with a 1 in position\n   <code>\n    i+1\n   </code>\n   , then C1 is derived from applying one shift-xor cycle to C2. (If this seems backwards, it's because the further the 1 bit is from the end of the message, the more shift-xor cycles get applied to the CRC.)\n  </p>\n  <p>\n   There are two possibilities. If the leading bit of C2 (the one about to be shifted out) is 0, then C1 will be equal to C2 shifted by one place. If it is 1, then C2 will be equal to C1 shifted one place and xored with the polynomial.\"\n  </p>\n </blockquote>\n <p>\n  In my case polynomial is not coming same every time.\n </p>\n <p>\n  I have printed CRC values for different messages, their LSB and CRC value after right shift operation and polynomial value to be XORed in order to drive C1 from C2\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/535OF.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/535OF.png\"/>\n  </a>\n </p>\n <p>\n  I have observed that I can get C1 from C2 by three polynomial values which are shown in above image 0x9008, 0x8000, 0x1008\n </p>\n <p>\n  I don't know why it is coming different.\nI am stuck at this point\n </p>\n <p>\n  I'm hoping that I can get more hints here on Reverse Engineering Stack Exchange.\n </p>\n <p>\n  Roy\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 0,
    "views": "835",
    "tags": [
        "crc",
        "binary-diagnosis"
    ],
    "user": "Roy4u",
    "time": "Jun 17, 2020 at 9:54",
    "comments": [
        {
            "user": "NirIzr",
            "text": "<html><body><span class=\"comment-copy\">\n You also forgot\n <code>\n  0x0\n </code>\n as a value, which makes me wonder if you have any errors there. I also suggest taking a look at the messages and trying to predict their CRC. specifically very short messages, and ones that are similar to each other.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Roy4u",
            "text": "<html><body><span class=\"comment-copy\">\n According to Grag william paperActually when LSB is zero we don't have need to XOR with any polynomial according to Grag Williams Paper but in my case sometimes there is a need to XOR with polynomial that's why i didn't mention zero as value.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}