{
    "title": "Suppress IDA welcome dialog in batch mode",
    "link": "https://reverseengineering.stackexchange.com/questions/13441/suppress-ida-welcome-dialog-in-batch-mode",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I try to disassemble a bunch of PE files with the free version of IDA.\nHowever, I can't figure out how to suppress the beginning welcome message:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/fkkEn.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/fkkEn.png\"/>\n  </a>\n </p>\n <p>\n  My batch command looks like this:\n </p>\n <pre><code>\"C:\\Program Files (x86)\\IDA Free\\idag\" -c -B target.exe\n</code></pre>\n <p>\n  Additionally, I also checked the\n  <code>\n   C:\\Program Files (x86)\\IDA Free\\cfg\n  </code>\n  folder, especially\n  <code>\n   idagui.cfg\n  </code>\n  .\n </p>\n <p>\n  Do I consider the wrong version? Is it a limitation of the free IDA version?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "889",
    "tags": [
        "ida",
        "disassembly",
        "windows",
        "pe"
    ],
    "user": "knx",
    "time": "Sep 6, 2016 at 12:58",
    "comments": [
        {
            "user": "Nordwald",
            "text": "<html><body><span class=\"comment-copy\">\n Please note\n <i>\n  batch mode\n </i>\n refers to using ida in an automated fashion, utilzing a script which is run on startup like explained by @Nirlzr\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "knx",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks @Nordwald - executing the above command should however generate a meaningful\n <code>\n  target.asm\n </code>\n file of the original\n <code>\n  target.exe\n </code>\n ? Correct? Or are there any drawbacks/errors when not supplying a script file during the process of\n <code>\n  ASM\n </code>\n generation? I understand that a batch mode is normally only reasonable for advanced tasks, controlled by a script. But I only want to generate the\n <code>\n  ASM\n </code>\n files for a bigger corpus of executables..\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Nordwald",
            "text": "<html><body><span class=\"comment-copy\">\n When using IDA Pro, the above command line works without welcome screen (using idaq).  This seems to be version dependant\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  the\n  <code>\n   -A\n  </code>\n  flag only works with\n  <code>\n   -S\n  </code>\n  (used for executing a script when IDA starts).\nWithout it,\n  <code>\n   -A\n  </code>\n  has no meaning: What will IDA do when the binary it is running? will it hang forever? will it save the IDB? will it exit afterwards? all of these questions are answered with a script, actually doing those things.\n </p>\n <p>\n  Logically, You\n  <em>\n   must\n  </em>\n  suppliy a script for IDA to function autonomously.\n </p>\n <p>\n  Please also note these two hickups:\n </p>\n <ol>\n  <li>\n   Autonomous mode won't suppress the licese agreement dialog that pops up the first time IDA is started, you'll have to do that manually (or edit the relevant registry key on windows, for example). Actually IIRC IDA is stuck without showing any dialog or ever running the script when the license dialog box pops up in autonomous mode.\n  </li>\n  <li>\n   Your script will execute when the IDA starts. Without calling\n   <code>\n    idaapi.autoWait()\n   </code>\n   it won't wait for autoanalysis to finish. Also, without calling\n   <code>\n    idaapi.qexit(0)\n   </code>\n   it will never terminate.\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "3",
            "user": "NirIzr",
            "time": "Sep 6, 2016 at 10:19",
            "is_accepted": false,
            "comments": [
                {
                    "user": "knx",
                    "text": "<span class=\"comment-copy\">Thank you for your answer! Just for clearification: my understanding so far was, that performing the above mentioned command (without <code>-S</code>), IDA will open the file, performing the autoanalysis and saves the ASM file to a location. Afterwards it closes the process and I can proceed with the next executable. So, of course there is no additionally processing, as my pure goal is the generation of the ASM file. So to reach this goal, the above mentioned processing should be right? As soon as I start supplying an additional script file, I HAVE to supply further commands (as you mentioned) - correct?</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">&gt; \"IDA will open the file, performing the autoanalysis and saves the ASM file to a location.\" AFAIK this is incorrect. There's no <i>default</i> behavior for <code>-A</code>. If that's what you want to do, you'll have to write a small <code>idc</code>/<code>ipython</code> script that performs these operations.</span>",
                    "time": null
                },
                {
                    "user": "knx",
                    "text": "<span class=\"comment-copy\">Okay - please forget about the <code>-A</code> - as I'm performing just the following command <code>\"C:\\Program Files (x86)\\IDA Free\\idag\" -c -B target.exe</code>. For me it seems to work fine (roughly inspected the generated ASM files). Sorry, I will delete the mentioned <code>-A</code> switch... it just causes confusion.</span>",
                    "time": null
                }
            ]
        }
    ]
}