{
    "title": "How to download Linksys firmware from router",
    "link": "https://reverseengineering.stackexchange.com/questions/13581/how-to-download-linksys-firmware-from-router",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  A co-worker gave me his mom's Linksys router that he is convinced has been hacked to include a MitM.  We could just upgrade the firmware, but that wouldn't be any fun and so I thought this might be a learning opportunity to play with Binwalk.\n </p>\n <p>\n  All of the tutorials assume you already have a binary and I am not even sure if there is a way to non-destructively extract the firmware out of an existing router.\n </p>\n <p>\n  I ran a full port scan on it and only TCP/80 and TCP/1783 are active...so TFTP doesn't look like an option.\n </p>\n <p>\n  Any pointers would be appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 2,
    "views": "601",
    "tags": [
        "malware",
        "binary"
    ],
    "user": "CraigO",
    "time": "Sep 25, 2016 at 2:54",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you are able to get a shell on your router, it is possible that a good part of the read-only filesystem is stored as a squashfs file and overlaid on boot. Obtaining that, along with NVRAM settings should be a good representation of the firmware.\n </p>\n <p>\n  Also if you have hardware access, there is a chance of a UART console in form of pads/pins on your router's PCB. Connecting that to a cheap ~$5 USB serial might allow you to pause your router early in the boot process and extract the firmware out via tftp, assuming u-boot which is very common.\n </p>\n <p>\n  <a href=\"http://www.devttys0.com/2012/11/reverse-engineering-serial-ports/\" rel=\"nofollow\">\n   http://www.devttys0.com/2012/11/reverse-engineering-serial-ports/\n  </a>\n </p>\n <p>\n  (devttys0's blog is an excellent read on router-hacking)\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "jg0",
            "time": "Sep 25, 2016 at 6:37",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The only reliable way is to use an external flasher to dump the flash chip.\nAnything you read from the running router itself could be intercepted and masked by the modified firmware to appear genuine (like the old-time DOS stealth viruses did).\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Igor Skochinsky",
            "time": "Sep 25, 2016 at 7:09",
            "is_accepted": false,
            "comments": []
        }
    ]
}