{
    "title": "Immunity Debugger - !mona suggest",
    "link": "https://reverseengineering.stackexchange.com/questions/13605/immunity-debugger-mona-suggest",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have been going through some tutorials for exploit development that use the\n  <code>\n   !pvefindaddr\n  </code>\n  command to help with creating unique patterns and discovering the offset.\n </p>\n <p>\n  I know that mona has replaced\n  <code>\n   pvefindaddr\n  </code>\n  - but from what I can see in the examples I am following the\n  <code>\n   !pvefindaddr suggest\n  </code>\n  command gives you an exploit suggestion in perl, while\n  <code>\n   !mona suggest\n  </code>\n  basically writes you a metasploit module.\n </p>\n <p>\n  I looked at the options with:\n </p>\n <p>\n  <code>\n   !mona help suggest\n  </code>\n </p>\n <p>\n  And there don't seem to be many options available. Is it possible to get suggest to offer you exploits written in any format other than a metasploit module? I couldn't seem to get\n  <code>\n   pvefindaddr\n  </code>\n  working in immunity - I'm assuming it doesn't really work anymore as mona has replaced it, so I wondered if mona had any flexibility?\n </p>\n <p>\n  <em>\n   I tried asking this in security stack exchange and was pointed here!\n  </em>\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "exploit",
        "immunity-debugger",
        "metasploit"
    ],
    "user": "user3046771",
    "time": "Sep 28, 2016 at 10:35",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <code>\n   mona.py\n  </code>\n  only supports automatically generating Metasplpoit modules. You can't get it to output the exploitation code in any other form.\n </p>\n <blockquote>\n  <p>\n   pvefindaddr already suggested a payload layout based on that information, mona takes things one step further. In fact, it will attempt to produce a full blown Metasploit module, including all necessary pointers and exploit layout.\n  </p>\n </blockquote>\n <p>\n  This is probably partially because in order to function, the\n  <code>\n   suggest\n  </code>\n  command uses the\n  <code>\n   findmsp\n  </code>\n  command which requires a \"Metasploit pattern\" (hence the name \"find msp\"), a textual pattern that uses a sequence of characters in a way that never repeats the same 4 bytes offset, making it extremely easy to identify the offset of each part of the pattern. This pattern is extensively used in the Metasploit Framework to ease exploit development.\n </p>\n <blockquote>\n  <p>\n   This command will automatically run findmsp (so you have to use a cyclic pattern to trigger a crash), and then take that information to suggest an exploit skeleton\n  </p>\n </blockquote>\n <p>\n  There are a few things you can do:\n </p>\n <ol>\n  <li>\n   <p>\n    You can always carve out the code out of the Metasploit module, or rewrite it in a different language (such as perl).\n   </p>\n  </li>\n  <li>\n   <p>\n    Use the\n    <code>\n     findmsp\n    </code>\n    command directly (as mentioned,\n    <code>\n     suggest\n    </code>\n    internally uses it to get the information needed for the exploit), it will provide you the details of affects memory regions, pointers, registers and so on, so you could build the exploit yourself.\n   </p>\n   <blockquote>\n    <p>\n     At crash time, simply run findmsp and you will get the following information:\n     <ul>\n      <li>\n       Locations where the cyclic pattern can be found (looks for the first bytes of a pattern) and how long that pattern is\n      </li>\n      <li>\n       Registers that are overwritten with 4 byte of a cyclic pattern and the offset in the pattern to overwrite the register\n      </li>\n      <li>\n       Registers that point into a cyclic pattern, the offset, and the remaining size of the pattern\n      </li>\n      <li>\n       SEH records overwritten with 4 bytes of a cyclic, offset, and size\n      </li>\n      <li>\n       Pointers on the current thread stack, into a cyclic pattern (offset + size)\n      </li>\n      <li>\n       Parts of a cyclic pattern on the stack, the offset from the begin of the pattern and the size of the pattern.\n      </li>\n     </ul>\n    </p>\n   </blockquote>\n   <blockquote>\n    <p>\n     In all cases, findmsp will search for normal pattern, uppercase,lowercase, and unicode versions of the cyclic pattern.\n    </p>\n   </blockquote>\n  </li>\n  <li>\n   <p>\n    Finally,\n    <code>\n     pvefindaddr\n    </code>\n    is probably not working with your version of Immunity Debugger because it's newer that versions supported by\n    <code>\n     pvefindaddr\n    </code>\n    . Since it's now deprecated it is no longer updated with newer releases of Immunity Debugger. You could fetch an older version and use that instead.\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "3",
            "user": "NirIzr",
            "time": "Sep 28, 2016 at 10:32",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user3046771",
                    "text": "<span class=\"comment-copy\">Hey, thanks for the comprehensive answer! Tells me everything I need to know :-)</span>",
                    "time": null
                }
            ]
        }
    ]
}