{
    "title": "How to make Freescale imx233 mp3 player boot with identical type player firmware.sb?",
    "link": "https://reverseengineering.stackexchange.com/questions/13720/how-to-make-freescale-imx233-mp3-player-boot-with-identical-type-player-firmware",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <strong>\n   Goal\n  </strong>\n  :\n </p>\n <p>\n  1 - To load a older version of the firmware on the device because it has features the newer version does not.\n </p>\n <p>\n  2 - To set the player up as a multi-boot (U-boot). key press for original OS or my custom compiled linux OS.\n </p>\n <p>\n  <strong>\n   Hardware\n  </strong>\n  :\n </p>\n <p>\n  mp3 player based on mx23 from Freescale, mmc/SD storage 8GB, USB, 4“ LCD, UART.\n </p>\n <p>\n  I have 3 of the players and as far as I can tell the hardware is the same between the players. (LCD, MMC, UART, etc)\n </p>\n <p>\n  OTP eFuse sets the boot mode as SD_MBR_BOOT—SD Master Boot Record (MBR) mode.\nThey do NOT use Boot Control Block (BCB). (\n  <a href=\"https://reverseengineering.stackexchange.com/questions/6666/why-would-copying-a-micro-sd-card-using-dd-fail-to-produce-a-bootable-card\">\n   see question\n  </a>\n  )\n </p>\n <p>\n  On one of the players I have soldered to the UART test pads and with a buffer connected to a PC serial port. \nI will call this the\n  <strong>\n   TEST\n  </strong>\n  player, and the other 2 that do not have the UART soldered I will call\n  <strong>\n   DONOR-1\n  </strong>\n  and\n  <strong>\n   DONOR-2\n  </strong>\n  .\n </p>\n <p>\n  The\n  <strong>\n   TEST\n  </strong>\n  player has the newer firmware that I would like to replace with the older firmware.\n  <strong>\n   DONOR-1\n  </strong>\n  and\n  <strong>\n   DONOR-2\n  </strong>\n  both have an older firmware version.\n </p>\n <p>\n  I also have a firware-update.SB file that is the newer version.\n </p>\n <p>\n  I have 4 unique firmware.SB files all different versions. Two of them contain the feature I want.\n </p>\n <p>\n  <strong>\n   What I have done so far\n  </strong>\n  :\n </p>\n <p>\n  With a custom compiled linux, I have made an image of the original OS from the mmc using dd. Image is in 3 parts due to 3G limit of fat32. This has been done for all 3 players. I load linux using the HID recovery mode.\n </p>\n <p>\n  I am able to dd the\n  <strong>\n   TEST\n  </strong>\n  image to the\n  <strong>\n   TEST\n  </strong>\n  player without any problems.\n </p>\n <p>\n  <em>\n   If I replace any of the SB files with the other 3 the player will not boot\n  </em>\n  . The LCD back light does come on.\n </p>\n <p>\n  <em>\n   If I dd the whole image from the\n   <strong>\n    DONOR\n   </strong>\n   s the player will not boot\n  </em>\n  . The LCD back light will come on.\n </p>\n <p>\n  I have decrypted the recovered SB file from the images with sbtoelf (Rockbox). I have done the same with my image that has u-boot and linux in it as a comparison.\n </p>\n <p>\n  The firmware SB files have 8 sections in them. 3 bootable and 5 clear text.\n </p>\n <p>\n  My SB file has 1 section. Bootable.\n </p>\n <p>\n  I have used ‘arm_disass’ to disassemble the ELF files. My knowledge here is weak, but I dont think that the disassemble program catches when the code switches between 16bit Thumb2 instructions and 32bit ARM instructions...\n </p>\n <p>\n  In short I am not able to get any firmware to boot on the\n  <strong>\n   TEST\n  </strong>\n  device except the one that originally came from it.\n </p>\n <p>\n  The partition tables does not make sense to me.\n </p>\n <p>\n  <code>\n   fdisk -l\n  </code>\n </p>\n <pre><code>sectors  = 512\n</code></pre>\n <p>\n  <strong>\n   TEST\n  </strong>\n </p>\n <pre><code>p1* 193406   15859711  7833153   1  FAT12\np2       4     126207    63102  53  OnTrack DM6 Aux\np3  189310     191357     1024   1  FAT12\np4  191358     193405     1024   1  FAT12\n</code></pre>\n <p>\n  <strong>\n   DONOR-1\n  </strong>\n  is similar but not\n  <a href=\"http://pastebin.com/tNusGhYS\" rel=\"nofollow noreferrer\">\n   exact\n  </a>\n </p>\n <p>\n  The players have a FAT32 partition that is larger that 7GB when it is plugged into a computer. Shows up as a mass storage device. This is where the media lives. Notice the missing blocks.\n </p>\n <p>\n  The firmware includes the\n  <a href=\"http://www.datasheetlib.com/datasheet/90559/mcimx233djm4b_freescale-semiconductor.html?page=1380\" rel=\"nofollow noreferrer\">\n   MBR_SIGMATEL_ID\n  </a>\n  after the MBR signature (55AA).\n </p>\n <p>\n  <a href=\"http://pastebin.com/ZT9g9LF0\" rel=\"nofollow noreferrer\">\n   MBR and MBR_SIGMATEL_ID\n  </a>\n  of\n  <strong>\n   TEST\n  </strong>\n </p>\n <p>\n  Working with the\n  <strong>\n   TEST\n  </strong>\n  player and its good image:\n </p>\n <p>\n  I have removed the MBR_SIGMATEL_ID and there is not change in the way the player boots or does not boot.\n </p>\n <ul>\n  <li>\n   Moved the boot flag from P1 to P2: Does not boot.\n  </li>\n  <li>\n   Moved the boot flag from P1 to P3: Starts to boot then crashes.\n  </li>\n  <li>\n   Moved the boot flag from P1 to P4: Starts to boot then crashes.\n  </li>\n  <li>\n   Removed the boot flag: Starts to boot then crashes\n  </li>\n </ul>\n <p>\n  <strong>\n   I am not sure what to do next.\n   <em>\n    Any suggestions?\n   </em>\n  </strong>\n </p>\n <p>\n  STMP3780 “Safe Binary” u-boot linux-fslc mx23 imx233  ARMv5\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "337",
    "tags": [
        "disassembly",
        "firmware",
        "arm",
        "hardware"
    ],
    "user": "jc__",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [
        {
            "user": "NirIzr",
            "text": "<html><body><span class=\"comment-copy\">\n I would start copying parts of one of the donor's file system to the test one, and seeing when stuff gets wrong. For example, does logically copying the first (bootable) partition working? does copyingg certain files of that partition working? Right now the question seems a bit to broad, I don't think we can come up with an answer without further tinkering.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "jc__",
            "text": "<html><body><span class=\"comment-copy\">\n In the question you can see that I did copy the cloned image from the DONAR and the extracted SB file to the type 53 partition. The result was the same. I am not sure how to see \"where stuff goes wrong\". I have captured the debug output from all boot attempts via the duart. The duart contains a lot of noise but I can still see most of it. I am trying to trace the.. logic flow that way.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "jc__",
            "text": "<html><body><span class=\"comment-copy\">\n When I am using the HID recovery mode and have loaded my custom linux kernel I am able to fdisk the mmc. The partition table does not match up with the data. Example. P1,P3,P4 are identified as FAT12. I cannot mount any of the partitions. If I change any of the partition info, type or boot flag, the device will not boot. When the device is normal and plugged into a PC a FAT32 mass storage device can be mounted on the host PC.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "jc__",
            "text": "<html><body><span class=\"comment-copy\">\n JTAG is not available. I am attempting to match up the debug output to the strings in the BIN and ELF files to see what section of code the boot crashes on. Using objdump, strings, arm_disass (rockbox), sbtoelf (rockbox).\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "jc__",
            "text": "<html><body><span class=\"comment-copy\">\n What other information can I provide here? I have done much more that what is noted here.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  What I found out about the firmware and hardware on these identical systems.\n </p>\n <p>\n  They are in fact not identical. There is a hardware difference in the LCD used. This is the reason the older firmware did not work.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "jc__",
            "time": "Nov 1, 2018 at 15:17",
            "is_accepted": false,
            "comments": []
        }
    ]
}