{
    "title": "Why does TOTP secret change every second?",
    "link": "https://reverseengineering.stackexchange.com/questions/13744/why-does-totp-secret-change-every-second",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Lately I've been inspecting a key generator program in IDA Pro. I believe the thread\n  <a href=\"https://security.stackexchange.com/questions/136557/random-key-generated-every-second-how-can-i-tell-how-it-is-created\">\n   here\n  </a>\n  discusses a similar key generator. Therefore, it may be referred to for certain details. The key generator takes a device serial number as input and generates a 32 byte (character) master key along with a\n  <a href=\"https://github.com/google/google-authenticator/wiki/Key-Uri-Format\" rel=\"nofollow noreferrer\">\n   OTPAUTH URI\n  </a>\n  of the form in the link aforementioned.\n </p>\n <ul>\n  <li>\n   The master key is only a function of the current time (in seconds from epoch). Therefore changes every second regardless of different serial numbers.\n  </li>\n </ul>\n <p>\n  Since the key changes every second, so does the OTPAUTH URI. I wonder how is the server supposed to verify a TOTP once a client enters it under this situation?\n </p>\n <p>\n  <strong>\n   Edit:\n  </strong>\n  So now there are some new questions:\n </p>\n <ul>\n  <li>\n   How do I authenticate to a server with this keygen knowing that the keygen is using\n   <code>\n    srand(time(NULL))\n   </code>\n   for the seed while calling\n   <code>\n    rand()\n   </code>\n   8 consecutive times to generate a 32-byte random sequence.\n  </li>\n  <li>\n   Is it logical to say the time step for the OTP codes is still 30 seconds while we know that the key and consequently secret are changing every second? Does this translate to the fact that the OTP validity is 1 seconds now?\n  </li>\n </ul>\n <p>\n  <strong>\n   Vulnerability:\n  </strong>\n  Isn't the server susceptible to creating TOTPs of the future and saving them in a repository by an adversary? While I'm writing this section 1476946414 seconds have passed since epoch. Assume creating a TOTP for the time equivalent to 1476947000 seconds passed from epoch. The keygen may be modified such that 1476947000 is passed to\n  <code>\n   srand()\n  </code>\n  instead of\n  <code>\n   time(NULL)\n  </code>\n  . Presumably there will also be enough time to derive the TOTP from the OTPAUTH URI.\n </p>\n <p>\n  <strong>\n   Patching using IDA Pro 6.8:\n  </strong>\n </p>\n <p>\n  So I thought its better to continue in a hands on fashion. Scrolling through the disassembly, I changed the call to\n  <code>\n   time(NULL)\n  </code>\n  to a\n  <em>\n   mov\n  </em>\n  instruction, assigning my favorite time to\n  <em>\n   eax\n  </em>\n  . In order to check my patch I ran the original keygen on the favorite time. The results were equivalent. Three things still bother me:\n </p>\n <ol>\n  <li>\n   May the validation process the server carries out be concealed in the keygen or the keygen is what its only expected to be, a keygen?!\n  </li>\n  <li>\n   The disassembly has a bunch of strings resembling openssl subroutines I presume. For instance\n   <em>\n    digest.c\n   </em>\n   ,\n   <em>\n    pmeth_gn.c\n   </em>\n   ,\n   <em>\n    pmeth_lib.c\n   </em>\n   , etc. The codes are available on the web. However, I found no lucid documentation for a layman. I suspect if the server's validation parameters are defined here. I've also been able to detect SHA256 and SHA512 cryptographic constants in the disassembly using\n   <em>\n    findcrypt2\n   </em>\n   .\n  </li>\n  <li>\n   I've been cautioned that the keys are generated using Linux. What effect may this have? I'm still on the Windows track!\n  </li>\n </ol>\n <p>\n  <strong>\n   Switching to Linux:\n  </strong>\n </p>\n <ol start=\"4\">\n  <li>\n   <p>\n    So I installed Ubuntu 16.04 and ran the patched linux binary keygen. The key file and the secret were completely different from the ones generated by Windows for the same time. Before reaching the specified time, I created the HMAC and derived the TOTP codes for that specific time and entered them exactly on the specific time. However, I was not able to authenticate. It may seem that the server is not expecting TOTPs for the current time. I have no idea TOTPs for what time should I feed to the server!\n   </p>\n  </li>\n  <li>\n   <p>\n    While\n    <em>\n     findcrypt2\n    </em>\n    did not find any sign of AES in Windows keygen binary, it did notice multiple\n    <em>\n     Rijndael\n    </em>\n    's in the Linux keygen binary (just adding as additional info).\n   </p>\n  </li>\n  <li>\n   <p>\n    I have been able to receive the server binary. I think the authentication procedure must be outlined there. But where should I look?\n   </p>\n  </li>\n </ol>\n <p>\n  <strong>\n   Here is the Final Problem:\n  </strong>\n  The key generator program is used to produce device specific keys. There is a weakness in how these keys are generated which should be exploited to generate valid one-time codes for any device.\n </p>\n <ol start=\"7\">\n  <li>\n   <p>\n    The serial number may be any 9-digit number. I personally have been working with 381151134.\n   </p>\n  </li>\n  <li>\n   <p>\n    Usage:\n    <strong>\n     keygen [-g OR -m master_key_file] -k serial -o master_output_file\n    </strong>\n   </p>\n  </li>\n  <li>\n   <p>\n    To download the keygen Linux binary click\n    <a href=\"https://www.dropbox.com/s/b1m5k6gqdt3alu6/keygen?dl=0\" rel=\"nofollow noreferrer\">\n     here\n    </a>\n    . The Windows binary is found\n    <a href=\"https://www.dropbox.com/s/gphy562usvbvxk1/keygen.exe?dl=0\" rel=\"nofollow noreferrer\">\n     here\n    </a>\n    .\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "733",
    "tags": [
        "ida",
        "disassembly"
    ],
    "user": "Newbie",
    "time": "Mar 17, 2017 at 13:14",
    "comments": [
        {
            "user": "NirIzr",
            "text": "<html><body><span class=\"comment-copy\">\n The question is a bit confusing to me. Can you perhaps edit it and add some order and clarifications? From what i can tell i think digest is related to the actual hash generation and if i'd have to guess i'd say the rand() values are fed into the hash's digest function.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Newbie",
            "text": "<html><body><span class=\"comment-copy\">\n @NirIzr I just modified the question. In case more info is needed, please let me know. I was trying to keep it short though!\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Newbie",
            "text": "<html><body><span class=\"comment-copy\">\n @NirIzr I cut the question into pieces. It's easier to proceed step by steps!\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "kennytm",
            "text": "<html><body><span class=\"comment-copy\">\n That's easy, the server could just generate 300 master keys to allow the password generated last 5 minutes be valid.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Newbie",
            "text": "<html><body><span class=\"comment-copy\">\n @kennytm Won't the server be under risk then? Let me ask another way. What should a client do to authenticate to the server, assuming the server will simply generate one TOTP having no database? I want to know why on earth should the server care about a clients authentication, holding a bunch of master keys? Shouldn't the client sort out the way to properly authenticate to the server once the rules are on ground?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   Since the key changes every second, so does the OTPAUTH URI. I wonder how is the server supposed to verify a TOTP once a client enters it under this situation?\n  </p>\n </blockquote>\n <p>\n  The server\n  <em>\n   must\n  </em>\n  be aware of previously generated keys to provide usability. Either by generating previous keys on the fly (I can imagine an algorithm that tries\n  <code>\n   t-0\n  </code>\n  and if that fails\n  <code>\n   t-1\n  </code>\n  and if that fails\n  <code>\n   t-2\n  </code>\n  for a predefined range to allow users to input a value some time after moving to the next.\n </p>\n <p>\n  Otherwise the entire generate-insert-send-validate process is limited to a short window. Accepting more than one valid key at a time is acceptable because the range remains short, values are still hard to predict, brute-forcing remains impossible (this can be further mitigated by limiting the accepted key's range after several incorrect attempts).\n </p>\n <blockquote>\n  <p>\n   How do I authenticate to a server with this keygen knowing that the keygen is using srand(time(NULL)) for the seed while calling rand() 8 consecutive times to generate a 32-byte random sequence.\n  </p>\n </blockquote>\n <p>\n  Without reverse engineering the entire key generation algorithm and actual generation process it is impossible to know. You'll need to reverse engineer the function calling\n  <code>\n   rand()\n  </code>\n  and build a simulator for the key generation process.\n </p>\n <p>\n  If what you described is the entire process, You're left with figuring out how are those\n  <code>\n   rand()\n  </code>\n  values are joined together (are they concatenated? xored to each other? How is the final value encoded?)\n </p>\n <p>\n  <em>\n   EDIT: Answer additional question presented under 'Vulnerability'\n  </em>\n </p>\n <blockquote>\n  <p>\n   Isn't the server susceptible to creating TOTPs of the future and saving them in a repository by an adversary?\n  </p>\n </blockquote>\n <p>\n  It is, but as I mentioned in this answer in response to you're first question that does not necessarily happens. The validation code can generate the TOTP keys it considered reasonable/potential every time it needs to execute a validation.\n </p>\n <p>\n  Additionally, this requires an adversary to hack gain access to that secure storage however if an adversary gained access to that secure storage to steal the TOTP keys, he might as well steal the master key used to generate those keys and gain the ability to generate TOTP keys as he wishes. For this reason storing the keys in the same place the master key is stored does not increase risk.\n </p>\n <p>\n  Obviously, the server has the ability to generate keys in order to validate them, and must be made sure to be trustworthy for the mechanism to function securely. This is a common requirement for most cryptographic protocols that certain points are to be trusted. After all, in order for the server to validate the user, it is reasonable to assume the server is protected.\n </p>\n <p>\n  One could consider some kind of\n  <a href=\"https://en.wikipedia.org/wiki/Public-key_cryptography\" rel=\"nofollow\">\n   asymmetric key\n  </a>\n  protocol instead of a symmetric key. However since this protocol is designed to validate a user by the server, it becomes moot whenever the server becomes untrusted.\n </p>\n <p>\n  If an adversary hacks into a server to generate future keys, once this is detected replacing the master key (and all future TOTP keys accordingly) is a requirement.\n </p>\n <blockquote>\n  <p>\n   May the validation process the server carries out be concealed in the keygen or the keygen is what its only expected to be, a keygen?!\n  </p>\n </blockquote>\n <p>\n  The keygen and the server carry out the same basic process. Once as a way to provide proof of knowledge (the keygen), and one to verify it (server).\n </p>\n <p>\n  The keygen is able to execute perform validations and the server is able to crete proofs, but that shouldn't happen (although it might, and that can ge risky and expose the protocol to vulnerabilities).\n </p>\n <blockquote>\n  <p>\n   The disassembly has a bunch of strings resembling openssl subroutines I presume. For instance digest.c, pmeth_gn.c, pmeth_lib.c, etc. The codes are available on the web. However, I found no lucid documentation for a layman. I suspect if the server's validation parameters are defined here. I've also been able to detect SHA256 and SHA512 cryptographic constants in the disassembly using findcrypt2.\n  </p>\n </blockquote>\n <p>\n  I'm not really sure what's the question here. I don't think any SSH functionality is directly related to the key generation, but I might be wrong.\n </p>\n <blockquote>\n  <p>\n   I've been cautioned that the keys are generated using Linux. What effect may this have? I'm still on the Windows track!\n  </p>\n </blockquote>\n <p>\n  Windows and Linux implement\n  <code>\n   srand\n  </code>\n  and\n  <code>\n   rand\n  </code>\n  differently. Specifically, they're using different constants or a different number of iterations and combinations between iterations. The basic block for common rand functions is this:\n </p>\n <pre><code>int myrand(void) {\n    next = next * 1103515245 + 12345;\n    return((unsigned)(next/65536) % 32768);\n}\n</code></pre>\n <p>\n  Where 1103515245 and 12345 are two constant values that often change between implementations.\n </p>\n <p>\n  <a href=\"https://sourceware.org/git/?p=glibc.git;a=blob_plain;f=stdlib/rand_r.c;hb=HEAD\" rel=\"nofollow\">\n   This\n  </a>\n  is glibc's version. You can see it's more complicated. Reverse engineering the specific implementation is probably the safest way.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Oct 21, 2016 at 1:25",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Newbie",
                    "text": "<span class=\"comment-copy\">I am convinced by the first section of your answer. As for the second part however, I proposed a much simpler scheme than an entire reverse engineering. It's been added to the main question as 'vulnerability'. I'll appreciate your opinion on it!</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">@Newbie I updated my answer to address your new question. It feels as if another question is supposed to exist under the vulnerability title, but i couldn't figure what it should be. You're encouraged to edit your question again to highlight that additional question.</span>",
                    "time": null
                },
                {
                    "user": "Newbie",
                    "text": "<span class=\"comment-copy\">I appreciate your additional explanation. Actually questions are upcoming quite frequently but I will keep the step by step fashion if you dont mind. I implemented the vulnerability scenario I proposed myself in the question by modifying the <i>srand</i> (<i>time</i> (NULL)) to simply <i>srand</i> (preferred epoch time). In doing so I used IDA Pro 6.8 to modify a function call to <i>time_(NULL) to _mov eax, preferred time in hex</i> The patch works. Both the key &amp; OTPAUTH URI generated by the patched program equal the results of the initial keygen ran on that specific time.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">step-by-step questions are perfectly fine, but if you don't mind, can you add additional details to the original question instead of in comments? Once you do that I'll edit my answer again with any needed clarifications.</span>",
                    "time": null
                },
                {
                    "user": "Newbie",
                    "text": "<span class=\"comment-copy\">Sorry for making it hard for you. Its one huge question now!</span>",
                    "time": null
                }
            ]
        }
    ]
}