{
    "title": "IDA & patching question",
    "link": "https://reverseengineering.stackexchange.com/questions/13794/ida-patching-question",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have an app in which I have to manually alter several flags in order to get to the part of the code Im interested in (imagine altering ZF to pass JNZ instruction). I have to do this every time I run application. What is the best way to do this permanently so I can simply run app to the part Im interested in?\n </p>\n <p>\n  I can patch binary (in different program - ie change jnz to jmp) and load it in IDA again but I have no idea how to load IDA database into it (to get my comments, function names I made etc etc).\n </p>\n <p>\n  Is there any way to do this?\n </p>\n <p>\n  Thanks.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ida",
        "patching"
    ],
    "user": "Kra",
    "time": "Oct 23, 2016 at 10:37",
    "comments": [
        {
            "user": "w s",
            "text": "<html><body><span class=\"comment-copy\">\n The simplest way I see is writing IDAPython script to do all the manual altering automatically. BTW, you have patching capabilities in IDA, why not to use it ?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Kra",
            "text": "<html><body><span class=\"comment-copy\">\n What capabilities are you referring to? I can patch instruction in IDA but it wont survive next app run (jnz patched to jmp will still look like jmp in IDA but app will jump elsewhere as if jnz is still there)\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "w s",
            "text": "<html><body><span class=\"comment-copy\">\n Regarding the IDAPython: you can use put_dbg_byte or write_dbg_memory when on breakpoint to patch your jnz to jmp.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You don't have to use separate program to patch in ida.\nSimple select/highlight in ida-view where you wanna patch, then in Edit(menu)>>patch byte\nThen after you are done patching what you need, Edit(menu>>apply patches to input file.\nI usually keep the backup ( you get a option for that)\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Storm Shadow",
            "time": "Oct 23, 2016 at 12:30",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Kra",
                    "text": "<span class=\"comment-copy\">Great, that works perfectly. IDA then complains both DB and input file has changed but well .. who cares :) Thank you.</span>",
                    "time": null
                }
            ]
        }
    ]
}