{
    "title": "How do I call a statically imported function from a Dll? call dword ptr ds <> not working",
    "link": "https://reverseengineering.stackexchange.com/questions/13834/how-do-i-call-a-statically-imported-function-from-a-dll-call-dword-ptr-ds-no",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <em>\n   Disclaimer: I am relatively new to this whole RE thing. So I successfully crammed some instructions into the end of an existing DLL and redirected a call.\n  </em>\n </p>\n <p>\n  Now I actually want to do things with a function argument before calling the original code and try to\n  <code>\n   OutputDebugStringA\n  </code>\n  it.\n </p>\n <p>\n  <code>\n   OutputDebugStringA\n  </code>\n  is statically imported by my Dll, so I try to do the following:\n </p>\n <pre><code>call dword ptr ds:[<&OutputDebugStringA>]\n</code></pre>\n <p>\n  This is an instruction I copy from a usage in the DLL itself.\n </p>\n <p>\n  So this works and is successfully called. But, when I patch the Dll with this instruction, on the next run the address is invalid which leads to an Access Violation and crash. (See red line in picture)\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/d97fB.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/d97fB.png\"/>\n  </a>\n </p>\n <p>\n  Why is that so? Shouldn't the IAT entry of the function be always at the same place, relative to where the Dll was loaded?\n </p>\n <p>\n  And how do I fix it?\n </p>\n <p>\n  Do I need complicated hacks to find the base address of my module?\n </p>\n <p>\n  Or is there some sort of relative far call instruction I am stupidly not aware of?\n </p>\n <p>\n  Thank you for your help.\n </p>\n <hr/>\n <p>\n  I think I got it now.\nSo I can't be sure that the IAT is always at the same address, not even relative to the ds segment (which makes it kinda useless in my opinion).\n </p>\n <p>\n  I can however be sure that the IAT address is always a fixed relative amount away from the code I want to run.\n </p>\n <p>\n  So I googled PIC techniques under x86 and ended up with this code that seems to work fine so far.\n </p>\n <pre><code>push ebp\nmov ebp,esp\npush eax\npush ecx\npush edx\npush dword ptr ss:[ebp+C]\ncall <rcp-be-name.tmplbl>\npop ebx   ;@tmplbl\nlea eax,dword ptr ds:[ebx+80F] ;the relative offset\ncall dword ptr ds:[eax-5] ;dunno why 5\npop edx\npop ecx\npop eax\npush dword ptr ss:[ebp+C] ;the original arguments\npush dword ptr ss:[ebp+8] ;  ...\ncall rcp-be-name.644A97D0 ;the original function\nadd esp,8\npop ebp\nret\n</code></pre>\n <p>\n  Thanks a lot!\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "1k",
    "tags": [
        "dll",
        "pe",
        "function-hooking",
        "iat",
        "call"
    ],
    "user": "Carraway",
    "time": "Apr 2, 2017 at 10:07",
    "comments": [
        {
            "user": "Martin",
            "text": "<html><body><span class=\"comment-copy\">\n <a href=\"https://en.wikipedia.org/wiki/Address_space_layout_randomization\" rel=\"nofollow noreferrer\">\n  DLLs are not always loaded at the same address\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Carraway",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks I guess, but I know that. So is the import address fixed in the original DLL call via the relocation table?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It appears you've already guessed what the actual issue is - your call instruction is using direct addressing and not relative addressing. This means that when a DLL changes it's location between executions you're still trying to execute the same absolute value, resulting in different types of errors depending on the content of the actual content in that address.\n </p>\n <p>\n  Specifically to your question -\n  <code>\n   0xFF 15\n  </code>\n  is an absolute, near, 4 byte immediate call.\n  <code>\n   0xFF\n  </code>\n  is used for absolute calls, while\n  <code>\n   0x8E\n  </code>\n  is used for relative calls (as you can see in your image, at the yellow highlighted line).\n </p>\n <p>\n  Replacing the single byte\n  <code>\n   0xFF\n  </code>\n  will turn the instruction to a relative instruction, meaning the call will be to\n  <code>\n   $+5e01d0e4\n  </code>\n  instead of to\n  <code>\n   0x5e01d0e4\n  </code>\n  . The dollar sign (\n  <code>\n   $\n  </code>\n  ) is a conventional representation of \"the address of the next instruction\".\n </p>\n <p>\n  Because how the x86 CPU (and many other CPUs) works, it is easier to first advance to the next instruction, and only then carry out any\n  <code>\n   EIP\n  </code>\n  modifying operations, thus having relative operations modify the\n  <code>\n   EIP\n  </code>\n  values of the\n  <em>\n   following\n  </em>\n  instruction.\n </p>\n <p>\n  Replacing the four last bytes with any signed integer will make the call instruction add that number (thus negative numbers are used to call a smaller address value) to the address of the next instruction. For example, the byte code\n  <code>\n   FF 15 EA FF FF FF\n  </code>\n  will be translated to a six byte long instruction\n  <code>\n   call $-6\n  </code>\n  , creating a\n  <code>\n   call\n  </code>\n  that calls itself, eventually faulting on a stack overflow.\n </p>\n <p>\n  A method simpler than manually editing instruction byte code could be using olly's assemble command with a\n  <code>\n   $\n  </code>\n  sign to indicate a relative instruction.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "NirIzr",
            "time": "Oct 29, 2016 at 22:04",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Carraway",
                    "text": "<span class=\"comment-copy\">So if I understand you correctly, I can't be sure that the IAT is always at the same address, not even relative to the ds segment (which makes it kinda useless in my opinion).  I can however be sure that the IAT address is always a fixed relative amount away from the code I want to run.  So how do I load this value then?  I can make a call 0x&lt;theadress&gt;, but that doesnt work because the IAT entry only contains the</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">The IAT is at a position relative to the start of the loaded image. This is not useless, this is precisely what makes it relocatable code easy by using relative addressing. I don't follow what you're still stuck on, please edit your question of you need more info (or explain clearly here)</span>",
                    "time": null
                },
                {
                    "user": "Carraway",
                    "text": "<span class=\"comment-copy\">sorry about that comment, i hit enter on accident. Edited the original post, everything seems to be working now.</span>",
                    "time": null
                }
            ]
        }
    ]
}