{
    "title": "How do I determine code coverage when fuzzing",
    "link": "https://reverseengineering.stackexchange.com/questions/1405/how-do-i-determine-code-coverage-when-fuzzing",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Let's say I'd like to begin fuzzing Acme Corp's PDF Reader.  I'd like to try to follow what Miller\n  <a href=\"http://fuzzinginfo.files.wordpress.com/2012/05/cmiller-csw-2010.pdf\">\n   did\n  </a>\n  by downloading a bunch of benign PDFs and mutate them.\n </p>\n <p>\n  Miller began by reducing his corpus of PDF samples to a minimum by pruning samples that had similar code coverage.\n </p>\n <p>\n  How is that specific step done?  That is, how did he determine what was a similar code coverage?\n </p>\n <p>\n  I can imagine a tool that traces execution and records JMP/CALLs to get an execution graph, and I suppose you could diff those graphs.  But what about JIT code?  Wouldn't those graphs be very different since the JIT would likely be in different locations in memory?\n </p>\n</div>\n</body></html>",
    "votes": "12",
    "answers": 2,
    "views": "863",
    "tags": [
        "tools",
        "fuzzing"
    ],
    "user": "mrduclaw",
    "time": "Mar 31, 2013 at 1:10",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Not sure how it fares against application with JIT compiled code, but peach has a\n  <a href=\"http://peachfuzzer.com/v3/minset.html\">\n   minset\n  </a>\n  utility to make a minimal set of files with highest code coverage:\n </p>\n <blockquote>\n  <p>\n   This tool will run each sample file through a target program and determine code coverage. It will then find the least number of files needed to cover the most code. This will be the minimum set of files that should be used when fuzzing.\n  </p>\n </blockquote>\n <p>\n  But as far as I can see it uses the method you proposed, monitoring hits of all basic blocks of the application. It uses a pintool to do this.\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "0xea",
            "time": "Mar 30, 2013 at 20:49",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Although it is heavily coupled with GCC, the\n  <code>\n   gcov\n  </code>\n  project is popular as a Linux code coverage tool.  It however requires compiling your program with the\n  <code>\n   -fprofile-arcs -ftest-coverage\n  </code>\n  flags, which may not be an option if targeting closed source software.  More information may be found here:\n  <a href=\"http://gcc.gnu.org/onlinedocs/gcc/Gcov.html\">\n   http://gcc.gnu.org/onlinedocs/gcc/Gcov.html\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "mncoppola",
            "time": "Mar 30, 2013 at 20:17",
            "is_accepted": false,
            "comments": [
                {
                    "user": "mrduclaw",
                    "text": "<span class=\"comment-copy\">This is a great suggestion, but I was hoping on suggestions for closed-source software.</span>",
                    "time": null
                }
            ]
        }
    ]
}