{
    "title": "Is there a way to improve disassembler speed?",
    "link": "https://reverseengineering.stackexchange.com/questions/14053/is-there-a-way-to-improve-disassembler-speed",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am currently disassembling quite a large file >100MB. And I was wondering what factors reduce the amount of time needed to disassemble a large file completely.\n </p>\n <ul>\n  <li>\n   <p>\n    Is it a higher core count?\n   </p>\n  </li>\n  <li>\n   <p>\n    Increased CPU frequency?\n   </p>\n  </li>\n  <li>\n   <p>\n    More RAM?\n   </p>\n  </li>\n  <li>\n   <p>\n    Faster IO reads and writes |SSD|M.2|?\n   </p>\n  </li>\n </ul>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "5k",
    "tags": [
        "ida",
        "disassembly"
    ],
    "user": "user36278",
    "time": "Nov 27, 2016 at 7:05",
    "comments": [
        {
            "user": "w s",
            "text": "<html><body><span class=\"comment-copy\">\n Which tool are you using for disassembly ?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user36278",
            "text": "<html><body><span class=\"comment-copy\">\n The tool I'm currently using is IDA v5 Free\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "<html><body><span class=\"comment-copy\">\n Perhaps you should\n <a href=\"https://reverseengineering.stackexchange.com/posts/14053/edit\">\n  edit\n </a>\n that into your question – unless you are willing to switch to a faster tool.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "<html><body><span class=\"comment-copy\">\n I must ask this: are you\n <i>\n  sure\n </i>\n that your single 100MB is all code? The last time I saw something approaching that – an 80MB .exe file –, after some trivial checking turned out to be a mere unpacker of 0.5MB, and the rest was an entire folder of PKZIP compressed files.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user36278",
            "text": "<html><body><span class=\"comment-copy\">\n @RadLexus  The program is about 80MB of code.The dissembled file is about 2.5 - 3.5 GB. As for the tools I used, I was not really concerned about the specifics, I just wanted to know what factors influence the speed of disassembly, which I believe yaspr answered beautifully.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  First, there are many algorithms used to disassemble a binary stream. The two most used ones are :\n  <em>\n   linear sweep\n  </em>\n  and\n  <em>\n   recursive traversal\n  </em>\n  (sometimes a hybrid), which present different performance and precision/reliability issues (how much code isn't disassembled properly : bad opcode, data interpreted as code, ...).\n  \n\n  So before you tackle implementation related performance issues you should check the computational complexity of the disassembler you're using.\n </p>\n <p>\n  Second, more RAM and faster I/O is - almost - always a performance enhancer. If you are disassembling a +100MB binary file, you'll need all the help you can from the hardware. Therefore, having a fast SSD could reduce the I/O overhead experienced with a traditional HDD. For RAM, the larger the size the better, but keep in mind that the differences in performance between DDR, DDR2, DDR3, ECC, ... are quite substantial.\n </p>\n <p>\n  Now with regard to the CPU core count and frequency's effects on disassembly performance, it is pretty hard to evaluate. Why? Well, you must ask yourself the following set of questions :\n </p>\n <ol>\n  <li>\n   Does the disassembler you're using implement a parallel disassembly algorithm ?\n  </li>\n  <li>\n   If yes, how does the performance of the disassembler relate/scale with the core count ? If no, then one core will suffice.\n  </li>\n </ol>\n <p>\n  FYI, a high core frequency (each core can have a frequency domain of its own separate from his neighbor's) could lead to disastrous performance if RAM is too slow. In the industry we usually settle for a core frequency of at most 1.8x the frequency of RAM. Otherwise, some serious performance bottlenecks (bandwidth, memory access latency, ...) start to tighten up and choke the running stream of instructions.\n </p>\n <p>\n  From what I know, IDA doesn't perform any parallel disassembly - I might be wrong, always check. Therefore, the first two points you cited in your question don't really matter.\n </p>\n <p>\n  The simplest way to answer your question would be to say that : the complexity of the disassembly algorithm and the way the implementation takes advantage of the underlying hardware are the key factors for performance.\n </p>\n <p>\n  Edit :\n </p>\n <p>\n  <strong>\n   [Bonus]\n  </strong>\n </p>\n <p>\n  If you wish to program a parallel disassembler you can do so this way :\n </p>\n <ol>\n  <li>\n   Choose a disassembler library (Udis86 for example)\n  </li>\n  <li>\n   Extract the sections and add them to a hashtab which contains a boolean variable - for each section - referring to its state (disassembled\n   <strong>\n    '1'\n   </strong>\n   , not disassembled\n   <strong>\n    '0'\n   </strong>\n   )\n  </li>\n  <li>\n   Write a\n   <em>\n    threadable\n   </em>\n   function which task is to pick a section in the hashtab and disassemble it (you'll have to manage the sections order, ...). Once the task is done, update the state (you'll have to use a lock : a mutex) and pick another one if there are any left.\n  </li>\n </ol>\n <p>\n  This might look easy to do, but in fact it is a bit challenging for that it depends on the flexibility of the disassembly library. Honestly, +100MB binaries are quite rare and commercial/available tools aren't usually designed to handle that much code/data optimally.\n </p>\n <p>\n  If you need any additional/more technical details let me know, I'll be glad to develop some points.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "yaspr",
            "time": "Nov 30, 2016 at 9:21",
            "is_accepted": true,
            "comments": []
        }
    ]
}