{
    "title": "Reverse engineer LMTools server status enquiry",
    "link": "https://reverseengineering.stackexchange.com/questions/14161/reverse-engineer-lmtools-server-status-enquiry",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  We are using FlexLM/Flexera/LMTOOLS (not sure which is the correct) as a licens manager for our Autodesk products. I don't know what version the server is, but I have a fairly old client version, LMTOOLS v11.10.0.0. In this you can perform an enquiry and get a somewhat obscure text back as result which tells you what licenses are beeing used/checked out and by who.\n </p>\n <p>\n  I'm trying to programmatically do the same server status enquiry, and capture the response and use some regexp to figure out who is using specific licenses from our license pool.\n </p>\n <p>\n  I've tried to use Wireshark and Fiddler to sniff the network traffic and figure out how the client is talking to the server, but with no success.\n </p>\n <p>\n  So my question: is it even possible to make the same request in my own program (C#), and where can I learn more about it?\n </p>\n <p>\n  Thanks!\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "412",
    "tags": [
        "networking"
    ],
    "user": "mottosson",
    "time": "Dec 13, 2016 at 18:47",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This is possible using the APIs available in the FlexNet Publisher SDK. I suggest you to consult the SDK documentation and contact Flexera support in case of problems.\n </p>\n <p>\n  In theory you could also observe the traffic between the client and the license server and deduce the packet format (this is known as \"\n  <a href=\"https://www.samba.org/ftp/tridge/misc/french_cafe.txt\" rel=\"nofollow noreferrer\">\n   French Café technique\n  </a>\n  \" and was used to develop the Samba project), but this can be a pretty complex and long task.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "Dec 14, 2016 at 11:21",
            "is_accepted": true,
            "comments": []
        }
    ]
}