{
    "title": "How to reattach tabs in IDA?",
    "link": "https://reverseengineering.stackexchange.com/questions/14196/how-to-reattach-tabs-in-ida",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I feel dumb for needing to ask, but I've been annoyed by this several times in the past and have yet to come across the answer.\n </p>\n <p>\n  Sometimes, when rearranging tabs in IDA Pro, I accidentally detach the tab from the main window, leaving it floating in its own window. The problem is that I have no idea how to reattach it, so generally when that happens I have to close it and reopen that view in the main window, which isn't the best solution.\n </p>\n <p>\n  In other programs that do the whole \"a tab can be detached as its own window\" thing, generally there's something that appears on the main window to signal that's where you need to drag it to to reattach it. Browsers do a slightly different thing in that you just drag the tab back to the tab bar. Neither of those work in IDA, and I can't find anything in the menu.\n </p>\n</div>\n</body></html>",
    "votes": "35",
    "answers": 1,
    "views": "10k",
    "tags": [
        "ida"
    ],
    "user": "Kevin",
    "time": "Dec 18, 2016 at 21:53",
    "comments": [
        {
            "user": "byxor",
            "text": "<html><body><span class=\"comment-copy\">\n Like many things in IDA, this was unnecessarily difficult. Thanks for asking.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "LUser",
            "text": "<html><body><span class=\"comment-copy\">\n I feel dumb that I had to look this up again...))\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Well, I managed to figure it out. If you click on the small gray bar just below the titlebar, you can drag it back to the main window. If you hover over the gray bar, it will tell you as much, but the fact that it's just below the titlebar (which is what you'd normally click to drag the window around), it's easy to miss.\n </p>\n <p>\n  Edit:\nIf you want to reset all tabs to their locations. Just click Window -> reset desktop. This is current at least in version 7.2 .\n </p>\n</div>\n</body></html>",
            "votes": "49",
            "user": "LUser",
            "time": "Aug 23, 2019 at 17:27",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Alexey Esaulenko",
                    "text": "<span class=\"comment-copy\">Question is still actual (and IDA's gui still ugly...). Thanks, that 'small gray bar' is really hard to find.</span>",
                    "time": null
                }
            ]
        }
    ]
}