{
    "title": "IDA Strange exception before code is executed",
    "link": "https://reverseengineering.stackexchange.com/questions/14268/ida-strange-exception-before-code-is-executed",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to reverse a PE executable (challenge tutorial). I am putting a breakpoint on the first instruction of the program, at the entry point. There is nothing executed before.\n </p>\n <p>\n  I get a software breakpoint exception when I run the program. I think this is a debugger detection system. But I do not know where is the code that throws this exception, because I have not reach my program entry point.\n </p>\n <p>\n  The exception throws from\n  <code>\n   ntdll.dll\n  </code>\n  I want to understand how can code from\n  <code>\n   ntdll.dll\n  </code>\n  can be executed BEFORE the entry point of my binary\n </p>\n <p>\n  Thanks\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 2,
    "views": "4k",
    "tags": [
        "ida",
        "pe"
    ],
    "user": "Bob5421",
    "time": "Dec 28, 2016 at 23:25",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  One thing that runs before the entrypoint is\n  <a href=\"http://www.hexblog.com/?p=9\" rel=\"noreferrer\">\n   TLS callbacks\n  </a>\n  , so check if your binary has them.\n </p>\n</div>\n</body></html>",
            "votes": "6",
            "user": "Igor Skochinsky",
            "time": "Dec 28, 2016 at 21:39",
            "is_accepted": true,
            "comments": [
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">To add to Igor's answer if your binary loads custom DLLs then their initialization code is run before you reach entry point of binary</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  no offense intended but this question demonstrates some basic lack of understanding of how windows loads user-mode processes, how how user-mode code and executables are built.\n </p>\n <p>\n  I'll list a few missing pieces:\n </p>\n <ol>\n  <li>\n   As Igor mentioned, TLS callbacks are often called before the entry point is executed and are used to setup tasks before any code is executed (global object constructors is one example). TLS callbacks are occasionally used by the compiler for certain tasks as well as in a set of anti-debugging techniques.\n  </li>\n  <li>\n   When a usermode process starts, its first executed instruction is NOT the executable's entry point. There's a decent amount of loader code executed in the context of the created process (initializing the default heap, setting up parts of the TEB and PEB, etc).\n  </li>\n  <li>\n   Normally, an executable's entry point is not your\n   <code>\n    int main(int argc, char* argv[])\n   </code>\n   . The compiler has a wrapper function that is where the PE's entrypoint points to, and main is only called by it.\n  </li>\n </ol>\n <p>\n  I would suggest you read the\n  <a href=\"https://msdn.microsoft.com/en-us/library/ms809762.aspx\" rel=\"nofollow noreferrer\">\n   Peering Inside the PE\n  </a>\n  , as it describes those processes really in-depth.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "NirIzr",
            "time": "Dec 28, 2016 at 23:25",
            "is_accepted": false,
            "comments": []
        }
    ]
}