{
    "title": "Does pintool work with virtual/symbolic CPU",
    "link": "https://reverseengineering.stackexchange.com/questions/14312/does-pintool-work-with-virtual-symbolic-cpu",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am working on debugging tools detection.\n </p>\n <p>\n  What i am looking for is a tool than can log EACH cpu instruction which is run by CPU.\n </p>\n <p>\n  I am looking for Dynamic Symbolic Execution tools. The code is not executed by a kind of \"software\" cpu, so it is easy to put breakpoints, dump memory or pause process.\n </p>\n <p>\n  I have found some information on pintools (intel), but i am wondering how it works for tracing binary programs. Does it work with a symbolic CPU ? Or is it a sort of debugger which interacts with kernel and real process ? If so, i think there is a way to detect pintool trace for a malware ?\n </p>\n <p>\n  Thanks\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "431",
    "tags": [
        "pintool"
    ],
    "user": "Bob5421",
    "time": "Aug 31, 2017 at 21:57",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   I am looking for Dynamic Symbolic Execution tools\n  </p>\n </blockquote>\n <p>\n  Probably nitpicking, but as your question is about PIN, this tool falls under the DBI (Dynamic Binary Instrumentation) tool category, it has nothing to do with symbolic execution.\n </p>\n <blockquote>\n  <p>\n   Does it work with a symbolic CPU ?\n  </p>\n </blockquote>\n <p>\n  No, you need a binary to be instrumented, be it a PE (Windows) or ELF (linux).\n </p>\n <blockquote>\n  <p>\n   Or is it a sort of debugger which interacts with kernel and real process ?\n  </p>\n </blockquote>\n <p>\n  PIN has two modes of operation:\n </p>\n <ul>\n  <li>\n   <p>\n    JIT mode: the code from the binary (that is being instrumented) is JITed on the fly by the PIN engine, which allows you to put your \"hooks\" everywhere you need to.\n   </p>\n  </li>\n  <li>\n   <p>\n    Probe mode: the code is executed \"as is\" but you can still put some hooks only at some places (using \"trampolines\" to redirect the code from the binary to your own places). This is a more limited mode compared to the JIT mode.\n   </p>\n  </li>\n </ul>\n <p>\n  Note that PIN is user-mode only (it doesn't deal with the kernel side of the operating system).\n </p>\n <blockquote>\n  <p>\n   If so, i think there is a way to detect pintool trace for a malware ?\n  </p>\n </blockquote>\n <p>\n  It's pretty easy to detect that your application is currently instrumented by PIN. It has never meant to be undetectable. The pin engine inject your pintool (where you code your instrumentation and analysis routines) into the process address space and either JIT the assembly code on the fly or puts hooks / trampolines into the code, so it's easily detectable.\nThe simplest way to detect PIN being just checking in the process module list if the pin engine is loaded.\n </p>\n <p>\n  If you want to detect PIN, just check this presentation from Recon:\n  <a href=\"https://recon.cx/2012/schedule/attachments/42_FalconRiva_2012.pdf\" rel=\"nofollow noreferrer\">\n   Dynamic Binary Instrumentation Frameworks: I know you're there spying on me\n  </a>\n  .\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Neitsa",
            "time": "Jan 3, 2017 at 5:08",
            "is_accepted": false,
            "comments": []
        }
    ]
}