{
    "title": "Change of offset in instruction?",
    "link": "https://reverseengineering.stackexchange.com/questions/14377/change-of-offset-in-instruction",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am learning assembly and injections at the moment. Therefore I wrote a little program which simply prints out a hardcoded string. If I attach ollydbg to that I can inspect the executable I recognized that the offset in \"PUSH OFFSET 00ABC154\", which is my string I want to print, changes sometimes when I run the application multiple times.\n </p>\n <p>\n  Is it because my string stands in the data segment and the data segment isn't located every time at the same offset from the data segment? Or why does my offset change?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "444",
    "tags": [
        "disassembly",
        "assembly",
        "x86"
    ],
    "user": "user7353965",
    "time": "Jan 12, 2017 at 11:26",
    "comments": [
        {
            "user": "Sigtran",
            "text": "<html><body><span class=\"comment-copy\">\n Probably ASLR..?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user7353965",
            "text": "<html><body><span class=\"comment-copy\">\n but why does the function I call with this parameter has the same offset every time then?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It is due to ASLR like Sigtran said. As for your following question, it is the function's PLT that remains the same every time (I'm assuming you are talking about library function such as printf). The actual function address is resolved dynamically during the function's first invocation. The reason that the printf function's PLT remains the same is because it is in the text segment and the text segment is not randomized by ASLR.\n </p>\n <p>\n  P.S. I would have added this as comment to your question, but I don't have enough reputation :(\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "yellowbyte",
            "time": "Jan 13, 2017 at 10:09",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user7353965",
                    "text": "<span class=\"comment-copy\">Thank you for your answer :) And sorry for the late reply. May you answer me one more question please? What is about the offset of the operation \"CALL DWORD\". Does the offset of the call instruction change too or does it stay the same?</span>",
                    "time": null
                },
                {
                    "user": "yellowbyte",
                    "text": "<span class=\"comment-copy\">It stays the same since the offset is to a function and the function is in the .text section, which is not randomized by ASLR.</span>",
                    "time": null
                }
            ]
        }
    ]
}