{
    "title": "Draw circuit of a multilayer PCB",
    "link": "https://reverseengineering.stackexchange.com/questions/1440/draw-circuit-of-a-multilayer-pcb",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have found a multilayer PCB of which I need to draw the circuit. At first, I tried to find the circuit on the internet using part numbers, but I did not get any result. The PCB is from a very old alarm installation.\n </p>\n <p>\n  Are there any tools or techniques I can use to get to know the structure of the layers I can't see?\n </p>\n</div>\n</body></html>",
    "votes": "10",
    "answers": 1,
    "views": "1k",
    "tags": [
        "tools",
        "pcb"
    ],
    "user": null,
    "time": "Apr 1, 2013 at 13:14",
    "comments": [
        {
            "user": "Dougall",
            "text": "<html><body><span class=\"comment-copy\">\n How big is the PCB? Do you know how many layers there are? I would try continuity-testing combined with a bit of intelligent prediction, but that's probably infeasible on a larger board.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user187",
            "text": "<html><body><span class=\"comment-copy\">\n Only 8x12cm, probably three or four layers. I thought about a continuity test, but there might be a neater solution.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There are\n  <a href=\"http://www.pcbreverseengineering.com/\" rel=\"nofollow\">\n   comprehensive tools\n  </a>\n  that can do precisely this. Part of the software that comes with them allows you to place part numbers between pads and have the circuit diagram automatically generated for you. Unfortunately, they're likely to set you back a fair bit of cash.\n </p>\n <p>\n  An alternative is to use corrosives and sharp implements to manually split the layers, but that's difficult and prone to mistakes. If you've got a number of boards you can destroy in the process, this is probably the cheapest option.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Polynomial",
            "time": "Apr 2, 2013 at 7:40",
            "is_accepted": true,
            "comments": []
        }
    ]
}