{
    "title": "sandbox for analyzing network traffic",
    "link": "https://reverseengineering.stackexchange.com/questions/14504/sandbox-for-analyzing-network-traffic",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am in search of looking an open source sandbox that has the following features: \n- route my network traffic to the sandbox for analysis\n- perform analysis on network traffic to detect malicious activities or generate intelligence from traffic\nwhat I am mostly interested is to route netflow data if possible!\nI have checked cuckoo sandbox but it only has the ability to submit samples! I could not find a way that I can route my network traffic to cuckoo.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 2,
    "views": "1k",
    "tags": [
        "malware",
        "sandbox"
    ],
    "user": "user2942756",
    "time": "Jan 26, 2017 at 15:45",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you are analyzing ELF binaries, then the\n  <a href=\"https://github.com/detuxsandbox/detux/\" rel=\"nofollow noreferrer\">\n   open source\n  </a>\n  online sandbox\n  <a href=\"http://detux.org/\" rel=\"nofollow noreferrer\">\n   detux\n  </a>\n  may prove useful:\n </p>\n <blockquote>\n  <p>\n   Detux is a sandbox developed to do traffic analysis of the Linux malwares and capture the IOCs by doing so.\n  </p>\n </blockquote>\n <p>\n  Detux logs network data including IP addresses the program sends signals to, DNS queries, URLs accessed and TCP raw streams:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/f2Yg9.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"Example detux screenshot\" src=\"https://i.sstatic.net/f2Yg9.png\"/>\n  </a>\n </p>\n <p>\n  If you are performing analysis of Windows PE binaries then\n  <a href=\"https://sourceforge.net/projects/fakenet/\" rel=\"nofollow noreferrer\">\n   FakeNet\n  </a>\n  may be of interest to you:\n </p>\n <blockquote>\n  <p>\n   FakeNet is [a] Windows network simulation tool designed for malware analysis. It redirects all traffic leaving a machine to the localhost (including hard-coded IP traffic and DNS traffic) and implements several protocols to ensure that malicious code continues to execute and can be observed by an analyst.\n  </p>\n  <p>\n   The tool supports DNS, HTTP, and SSL protocols and provides a python extension interface for implementing new or custom protocols. It also the capability to listen for traffic to any port as well as create packet capture on the localhost.\n  </p>\n  <p>\n   Right now the tool only supports WinXP Service Pack 3. The tool runs fine on Windows Vista/7 although certain features will be automatically disabled.\n  </p>\n </blockquote>\n <p>\n  Note that FakeNet is not a sandbox but is employed when analyzing binaries on an isolated system.\n </p>\n <p>\n  If neither of these tools are what you are looking for, here is a long list of online scanners and sandboxes:\n  <a href=\"https://github.com/rshipp/awesome-malware-analysis#online-scanners-and-sandboxes\" rel=\"nofollow noreferrer\">\n   https://github.com/rshipp/awesome-malware-analysis#online-scanners-and-sandboxes\n  </a>\n  and here is Lenny Zeltser's list of free automated malware analysis sandboxes and services:\n  <a href=\"https://zeltser.com/automated-malware-analysis/\" rel=\"nofollow noreferrer\">\n   https://zeltser.com/automated-malware-analysis/\n  </a>\n </p>\n <p>\n  If there is no tool that meets your requirements you can always create your own analysis lab. Books that will provide guidance for such an endeavor include \"Practical Malware Analysis\" by Honig and Sikorski (creators of FakeNet) and \"Malware Analyst's Cookbook\" by Ligh and Adair.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Give a try to\n  <a href=\"https://www.sandboxie.com/index.php?HomeUse\" rel=\"nofollow noreferrer\">\n   Sandboxie\n  </a>\n  . It is feature-packed, comes with an interesting licensing model which\n  <a href=\"https://www.sandboxie.com/index.php?FAQ_Licensing\" rel=\"nofollow noreferrer\">\n   does not require\n  </a>\n  you to immediately shell out your hard earned bucks.\n </p>\n <blockquote>\n  <p>\n   Sandboxie is shareware software. The free version is missing a few\n  features which are available in the paid version. After 30 days of\n  use, the free version displays reminders to upgrade to the paid\n  version, but remains functional. For personal use, you are encouraged,\n  but not required, to upgrade to the paid version. \n  For non-personal use (including commercial, educational, governmental, and not-for-profit use), Sandboxie must be properly\n  licensed. See Commercial Licensing.\n  </p>\n </blockquote>\n</div>\n</body></html>",
            "votes": "0",
            "user": "sherlock",
            "time": "Jan 26, 2017 at 17:55",
            "is_accepted": false,
            "comments": []
        }
    ]
}