{
    "title": "How to bypass this old windows application's free disk space check?",
    "link": "https://reverseengineering.stackexchange.com/questions/14549/how-to-bypass-this-old-windows-applications-free-disk-space-check",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This windows application checks the available disk space when an attempt is made to enable a feature.\n </p>\n <p>\n  The error message can be translated into \"You need 2145461018 more bytes to load this tileset.\n </p>\n <p>\n  Choosing other tilesets might even yield a message claiming that a negative amount of bytes is needed. This could indicate a buffer overflow. Notice the window title \"Error space on disk\".\n </p>\n <p>\n  I would like to disable that memory check using the simplest method possible, but I am willing to disassemble it despite having next to zero knowledge which winapi calls are using to check the free disk space. I am grateful for any hint!\n </p>\n <p>\n  I already tried the compatibility options on the shortcut properties, which didn't help.\n </p>\n <p>\n  The error can also be reproduced in a vm guest with windows.\n </p>\n <p>\n  PE Explorer shows this is a WIN32 GUI app with a subsystem version 3.10\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/owmTL.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"application screenshot from vm\" src=\"https://i.sstatic.net/owmTL.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "108",
    "tags": [
        "windows",
        "winapi"
    ],
    "user": "wieselchen",
    "time": "Feb 1, 2017 at 22:22",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Apparently creating a ramdisk was enough to fool the application. I used the tool ImDisk and mounted a 50MB disk on which I installed the application.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "wieselchen",
            "time": "Feb 1, 2017 at 22:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">It's a common problem with modern disk drives that the multiplication of the various registers overflows the result and appears to be too small.</span>",
                    "time": null
                }
            ]
        }
    ]
}