{
    "title": "Getting started with reversing device network traffic",
    "link": "https://reverseengineering.stackexchange.com/questions/14611/getting-started-with-reversing-device-network-traffic",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am interested in starting to decode and understand some proprietary network traffic, sent from apps on various devices, such as my TV, game consoles, phones etc.\n </p>\n <p>\n  Most of the things I want to look at, seems to be using UDP to send proprietary protocol traffic.\n </p>\n <p>\n  I've spent some time in Wireshark analyzing traffic, and now the next stage is to attempt modifying messages and looking at results. This is where I have run into trouble.\n </p>\n <p>\n  I attempted to use my Windows laptop as a MitM, bridging my 2 Ethernet connections (one to device and one to router). However, it seemed I was completely unable to spoof traffic from the device. Since UDP is very spoof able, I was not sure what is going wrong.\n </p>\n <p>\n  What is the best way to do this, and is there a framework/toolkit in place to help facilitate this type of research?\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "472",
    "tags": [
        "networking"
    ],
    "user": "Ryan",
    "time": "Feb 10, 2017 at 0:35",
    "comments": [
        {
            "user": "Eli K",
            "text": "<html><body><span class=\"comment-copy\">\n could you please add details regarding this network structure: connections, what's wifi and what is ethernet, firewalls and such? this will help understand the problem. In addition there usually isn't a generic solution for this type of thing, since the proprietary protocol might include defences which you need to overcome (like signing the mac address for example). It would help if you add information regarding your specific protocol.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  As shown\n  <a href=\"https://stackoverflow.com/questions/6112913/how-to-recalculate-ip-checksum-with-scapy\">\n   here\n  </a>\n  you can use Scapy to capture and/or spoof packets, while you are doing that make sure you compute checksums right. You can use Wireshark to check headers. Most convenient way is capturing incoming traffic and changing data & checksum value.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Kerim Can Kalıpcıoğlu",
            "time": "Dec 5, 2020 at 5:20",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Ryan",
                    "text": "<span class=\"comment-copy\">While attempting to mitm packets between device and internet, my router seemed to be rejecting spoofed udp packets. Does scapy help facilitate the spoofing aspect? Can you \"pause\" traffic, change packets and then release it, similar to tamperdata for firefox?</span>",
                    "time": null
                },
                {
                    "user": "Kerim Can Kalıpcıoğlu",
                    "text": "<span class=\"comment-copy\">Is your problem about duplicate packets like <a href=\"http://stackoverflow.com/questions/10033285/how-to-change-a-packet-data-with-scapy\">here</a>?</span>",
                    "time": null
                },
                {
                    "user": "Ryan",
                    "text": "<span class=\"comment-copy\">No, definitely not an issue with duplicate packets. I have two different internet connections, so I can test devices talking to each other over the internet and attempt to intercept. The 'target' device never sees traffic that I spoof from the source, ports are open, all should be good. I am wondering if it was something to do with UPnP.</span>",
                    "time": null
                },
                {
                    "user": "Kerim Can Kalıpcıoğlu",
                    "text": "<span class=\"comment-copy\">Maybe your packets drop before leaving your device, because of ethernet stack or something? Can you check with Wireshark?</span>",
                    "time": null
                },
                {
                    "user": "Ryan",
                    "text": "<span class=\"comment-copy\">@de61 I am using an ISP supplied router otherwise I would love to have it on the router to check. I see it going out on my mitm laptop with wireshark, but it never seems to reach the router and certainly not the target</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You can modify packets with scapy ,create custom python code using\n  <a href=\"http://www.secdev.org/projects/scapy/doc/usage.html\" rel=\"nofollow noreferrer\">\n   scapy\n  </a>\n  module to send custom packet.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Saif",
            "time": "Feb 10, 2017 at 7:52",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ryan",
                    "text": "<span class=\"comment-copy\">Is that a framework in place that can intercept and replace packets? When spoofing from the laptop, the router did not seem to accept the spoofed packets as coming from the device, not sure how to fix that?</span>",
                    "time": null
                }
            ]
        }
    ]
}