{
    "title": "Do I have sufficient information to determine a checksum algorithm?",
    "link": "https://reverseengineering.stackexchange.com/questions/14668/do-i-have-sufficient-information-to-determine-a-checksum-algorithm",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  What I would like to know is whether or not I have sufficient information to determine a particular checksum algorithm being used.\n </p>\n <p>\n  In my case I have a very large stream of data with many frames of data and their respective checksums. Here is what I know:\n </p>\n <ol>\n  <li>\n   The data-field (of which the checksum is being computed) for each frame in the stream.\n  </li>\n  <li>\n   The checksum of each packet.\n  </li>\n </ol>\n <p>\n  <em>\n   Is this a sufficient amount of information to determine a checksum algorithm?\n  </em>\n  I also have many samples so I could try out a particular checksum algorithm on all the samples to see whether/not the algorithm will work in each case.\n </p>\n <p>\n  Here is more information that may clarify things:\n </p>\n <ol>\n  <li>\n   The length of the data appears to be 2 bytes.\n  </li>\n  <li>\n   The length of the checksum appears to be 4 bytes.\n  </li>\n </ol>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "151",
    "tags": [
        "crc",
        "communication"
    ],
    "user": "Snoop",
    "time": "Feb 16, 2017 at 15:19",
    "comments": [
        {
            "user": "w s",
            "text": "<html><body><span class=\"comment-copy\">\n What is the length of the checksum ? What is the length of the data ? How many different data samples do you have ? Can you post some of these samples ?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Snoop",
            "text": "<html><body><span class=\"comment-copy\">\n @ws Let me answer those questions, in my question. Sorry for not providing that information sooner, and thanks for letting me know.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "w s",
            "text": "<html><body><span class=\"comment-copy\">\n The fact that the length of checksum is less then length of data looks very strange from architectural point of view (in this case you don't need checksum, it's enough to repeat the data). Are you sure that you know all input components of the checksum ?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Snoop",
            "text": "<html><body><span class=\"comment-copy\">\n @ws The answer to your question is technically no, and that it may actually be more than 2, but I thought that the other parameters were just start-of-frame and end-of-frame sequences surrounding the actual data-field. Does that make sense?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  In most cases - yes, you probably have enough information to determine the algorithm, especially if the checksum algorithm is standard(just try to compute all well-known 32 bit checksums on some data samples and see if it fits).\n </p>\n <p>\n  However there are some assumptions in this claim:\n </p>\n <ul>\n  <li>\n   You have many pairs with different data and its checksum\n  </li>\n  <li>\n   You really know all the components of the data on which the checksum is computed and their respective order\n  </li>\n  <li>\n   This is really checksum and not something else\n  </li>\n </ul>\n <p>\n  In this case I'd recommend to reverse engineer the software that computes or checks the checksum: if checksum is not standard it is very much easier.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "w s",
            "time": "Feb 16, 2017 at 15:37",
            "is_accepted": true,
            "comments": []
        }
    ]
}