{
    "title": "Patching a variable's type in an executable file",
    "link": "https://reverseengineering.stackexchange.com/questions/14661/patching-a-variables-type-in-an-executable-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Let's say i have a program.In this program i have a variable named\n  <strong>\n   PacketSize\n  </strong>\n  of type\n  <strong>\n   Short\n  </strong>\n  .I want to change the variable's type to\n  <strong>\n   Int\n  </strong>\n  .\n </p>\n <p>\n  Now if i am able to locate this variable's location in the memory while running the program , how can i use this to accomplish my aim or is it done by another way?\n </p>\n <p>\n  Edit :\n </p>\n <p>\n  *The application is a client.\n </p>\n <p>\n  *The variable is for the tcp packet's length which is sent in the packet header by the server to the client.\n </p>\n <p>\n  *I would guess that it's either a part of a structure (Maybe PacketHeader) or a stack one.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 0,
    "views": "118",
    "tags": [
        "c++",
        "pe"
    ],
    "user": "user3810737",
    "time": "Feb 17, 2017 at 13:40",
    "comments": [
        {
            "user": "Kerim Can Kalıpcıoğlu",
            "text": "<html><body><span class=\"comment-copy\">\n First figure out how can compiler store that variable which related with initialization, usage inside/outside of functions, your host system and even it can be differ because some optimizations.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Rup",
            "text": "<html><body><span class=\"comment-copy\">\n If it's a single global variable then it's going to be a lot easier than if it's a member of a structure or allocated on a stack, because you can just move all references to it to another area of memory that has space. But you'll then need to rewrite all commands that reference it to use the new data size, and that's reasonably likely to mean you'll need more space for the instructions. This will be significant work.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Nordwald",
            "text": "<html><body><span class=\"comment-copy\">\n There is no such thing as variable types in assembler, only fields of different (word-) sizes. Changing that means changing any instruction referring to this field and fixing alignment (stack / global). Its most likely not worth the effort.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "<html><body><span class=\"comment-copy\">\n If you did not give up yet, editing your question to supply some more information: Where is the variable located? stack, heap, part of a structure? Where is this variable accessed? How many times is it used? Can you provide code snippet with one or two variable usage examples?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user3810737",
            "text": "<html><body><span class=\"comment-copy\">\n I do not have the source code so little do i know but i will edit my question with all i can guess.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}