{
    "title": "Creating FLIRT Signature Files for new CPU",
    "link": "https://reverseengineering.stackexchange.com/questions/14670/creating-flirt-signature-files-for-new-cpu",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have writen a new processor module for M-CORE CPU, now i want to generate FLIRT Signature Files for this cpu. \nthe problème is that FLIRT tools like pelf.exe dose not recognize the CPU type.\n </p>\n <p>\n  What can i do in this case ?\n </p>\n <pre><code> pelf lib/libz.a libz.pat\nFatal [lib/libz.a] (adler32.c.obj): Unknown processor type 39\n</code></pre>\n <p>\n  <strong>\n   Update\n  </strong>\n  I found a plugin called ida2pat that can generate . Pat file from ida.\nI can generate Sig file from .pat files But i can not use them . when i load a file in ida pro with my new CPU module and try to load the signiture the signiture is empty (I guess that ida is filtring signutures with cpu type )\n </p>\n <p>\n  How to tell Sigmake about the CPU type . the sigmake tool has - p option that normally sets the cpu type but i am not able to use it correctly . ida has the same command line switch - p that can be used like this - pmipsel (cpu is mipsel ) . But in sigmake it gives \" ill processor id \" error. \ni tried using my cpu id defined in the cpu module but ida dose not show the sig file\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "901",
    "tags": [
        "ida",
        "flirt-signatures"
    ],
    "user": "Steavebba",
    "time": "Feb 23, 2017 at 12:24",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  IDAPython - you can automate almost everything in IDA with IDAPython or IDC.\nThe hard part is that it's not very well explained. There are a few things that can help:\n </p>\n <ul>\n  <li>\n   All menu actions can be linked to IDC funtion via the IDA configuration files found in the cfg directory inside the IDA installation path (3 files starting with ida)\n  </li>\n  <li>\n   Read inside the source files. They're fairly well documented.\n  </li>\n  <li>\n   Read the IDA Pro book second edition\n  </li>\n </ul>\n <p>\n  Apart from that you might even be able to do it without the IDA GUI:\n  <a href=\"http://www.hexblog.com/?p=128\" rel=\"nofollow noreferrer\">\n   http://www.hexblog.com/?p=128\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Eli K",
            "time": "Feb 18, 2017 at 20:33",
            "is_accepted": false,
            "comments": []
        }
    ]
}