{
    "title": "Is it possible to debug an ELF file with a Windows-based disassembler?",
    "link": "https://reverseengineering.stackexchange.com/questions/14794/is-it-possible-to-debug-an-elf-file-with-a-windows-based-disassembler",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <strong>\n   Problem :\n  </strong>\n  How can I debug an ELF file in MS Windows? is it possible?\n </p>\n <p>\n  <strong>\n   Scenario :\n  </strong>\n </p>\n <p>\n  I have an ELF file compiled to work on hardware with VXWorks 5.5 OS and SH4 CPU. IDA68 is able to disassemble the file and correctly detects SH4 instructions although looks like IDA is unable to debug it with its debugger(the debugger icon is grey), and without the ability to debug the assembly it is almost impossible to understand.\n </p>\n <p>\n  Am I missing something here?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "15k",
    "tags": [
        "ida",
        "windows",
        "debugging",
        "elf"
    ],
    "user": "Iman Rosstin",
    "time": "Mar 3, 2017 at 13:24",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n what do you mean by \"trace the assembly\"? debug?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Iman Rosstin",
            "text": "<html><body><span class=\"comment-copy\">\n @IgorSkochinsky I mean IDA debugger is disabled while working with ELF files, It can not trace the assembly code that is just created out of elf file. (Edited the question to make it clear)\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Iman Rosstin",
            "text": "<html><body><span class=\"comment-copy\">\n @IgorSkochinsky yes Igor, I meant debug.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "julian",
            "text": "<html><body><span class=\"comment-copy\">\n @Zich\n <a href=\"https://www.hex-rays.com/products/ida/debugger/index.shtml\" rel=\"nofollow noreferrer\">\n  IDA allows for cross-platform debugging by using remote debugging servers\n </a>\n . You will not be able to load an ELF binary into memory on your local Windows machine since it does not conform to the PE format\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "julian",
            "text": "<html><body><span class=\"comment-copy\">\n @Zich\n <a href=\"https://people.debian.org/~aurel32/qemu/sh4/\" rel=\"nofollow noreferrer\">\n  Debian Sid sh4 image for QEMU\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You cannot run ELF files on Windows because the system offers a completely different architecture and API for programs to use. For example, the system calls in windows are different from the system calls in Linux (those which your elf will try to call). Also, if Windows could understand and try to load the ELF, your file will try to link to system libraries which do not exist under windows (.so files instead of windows dlls).\n </p>\n <p>\n  Another reason that the files will not run under windows is that the binary format is different and Windows will not be able to understand how to run the ELF file.\n </p>\n <p>\n  There are ways in which you can run Linux software under windows but they require emulation (Virtual machines, Bash on Ubuntu on Windows etc.)\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "lightnet",
            "time": "Mar 2, 2017 at 21:13",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Iman Rosstin",
                    "text": "<span class=\"comment-copy\">I already know that I can not run ELF files under Windows. I am looking forward to trace/debug it using IDA and since the vxworks is an open system which is used in embeded systems, it is far from mind if it has something other than POSIX compatible that windows can not resolve, I expect IDA  to interpret the interupts and other exceptions to windows however a register watch is enough I believe!</span>",
                    "time": null
                },
                {
                    "user": "lightnet",
                    "text": "<span class=\"comment-copy\">The only way to trace or debug the program is to run it. The options suggested above may be what you're looking for (using remote connection to a debug server).</span>",
                    "time": null
                },
                {
                    "user": "Iman Rosstin",
                    "text": "<span class=\"comment-copy\">I am writing down registers on a paper and update each manually by running instructions one by one in my mind. Do I have a vxworks in my mind? Ofcourse not! I just need a register watch which is what tracing mean in embeded systems I guess.</span>",
                    "time": null
                },
                {
                    "user": "Kerim Can Kalıpcıoğlu",
                    "text": "<span class=\"comment-copy\">I think Bash on Windows run real Linux executables with Windows Subsystem for Linux. Another way can be decompiling with IDA and compiling with Subsystem for UNIX-based Applications (only server-class) in Windows again. It seem impossible, it is not widely used BSD or Linux executable.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  ELF files can be debugged using IDA debugger if you have the same CPU and OS that were used to build them, installed locally or have them in a remote machine.\n </p>\n <p>\n  In case you don't, you're still able to debug the file but only if the compiler have debugging data in\n  <a href=\"https://en.m.wikipedia.org/wiki/DWARF\" rel=\"nofollow noreferrer\">\n   DWARF\n  </a>\n  standard included in the file.\n </p>\n <p>\n  Another option that SVS suggest me, is to set up an emulator with OS and Arctitecture you need trace the file over there which is a good practical way I believe.\n </p>\n <p>\n  Not all ELF files have DWARF debugging data. Particularly, those that are not suppose to be reverse engineered.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Iman Rosstin",
            "time": "Mar 15, 2017 at 13:24",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">\"if the debugger is grey it means the ELF file which is being disassembled does not contain debugging data in DWARF format\" &lt;- wrong</span>",
                    "time": null
                },
                {
                    "user": "julian",
                    "text": "<span class=\"comment-copy\"><a href=\"http://eli.thegreenplace.net/2011/01/23/how-debuggers-work-part-1\" rel=\"nofollow noreferrer\">how debuggers work</a></span>",
                    "time": null
                },
                {
                    "user": "Iman Rosstin",
                    "text": "<span class=\"comment-copy\">@IgorSkochinsky edited, but I still think grey means no DWARF in my case. do you know any other reason that makes it grey(please just in my case)? Cause I need to debug the file very bad!</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">The button is grey if there is no debugger module available for the specific file format/processor combination. Lack of DWARF info does not prevent debugging in IDA.</span>",
                    "time": null
                }
            ]
        }
    ]
}