{
    "title": "How to crack windowed crackmes?",
    "link": "https://reverseengineering.stackexchange.com/questions/14816/how-to-crack-windowed-crackmes",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am starting with reverse engineering/cracking with advanced knowledge about programming and functioning of the operating system and I saw a whole series of lena151 Lenas Reversing for Newbies but I have a problem I do not know how I should properly begin cracking windowed crackmes without using call stack and finding text strings. For example I have ollydbg and Pulsar Crackme (Level 0) (\n  <a href=\"https://uloz.to/!CsZzoI6kT9zF/crackme-exe\" rel=\"nofollow noreferrer\">\n   https://uloz.to/!CsZzoI6kT9zF/crackme-exe\n  </a>\n  ) I have already cracked, and several other, (key is  PuL-sAr-001) but I crack him only because I accidentally found badboy/goodboy but it can not crack it using another method (in more complicated crackmes it is big problem). Is there any tutorial where this is explained ? And what method you use which may also be used in the analysis viruses ?\n </p>\n</div>\n</body></html>",
    "votes": "-1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ollydbg",
        "crackme"
    ],
    "user": "Marek",
    "time": "Mar 3, 2017 at 20:26",
    "comments": [
        {
            "user": "the_endian",
            "text": "<html><body><span class=\"comment-copy\">\n Why don't you want to use text strings? You should use whatever you have at your disposal. Use IDA Pro and disassemble the code as well. If you can't because it's packed, use PEiD or another packer identifier, then unpack the program first...\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There are many ways to go about changing the behavior of programs. For example, if you have a program that checks for the date and time in order to decide if the product is expired, you could: a. change the system date and time to temporarily \"crack\" the program or b. patch the system call that checks for the date and time to return an acceptable value.\n </p>\n <p>\n  You could also patch the kernel (which is probably unsuitable for a check like this, as it will affect the whole system) or simply find the check in the executable and change the code to jump it , or just remove it...\n </p>\n <p>\n  What you're doing is trying to reverse engineer an application and change it to do what you want. This requires knowledge in general and specific areas, dependening on what kind of program you're trying to reverse engineer.\n </p>\n <p>\n  Here's a few a practical leads on how you could achieve what you're trying to do:\n </p>\n <ol>\n  <li>\n   Use a tool like Regshot to compare changes in the registry\n  </li>\n  <li>\n   Use a tool like Program monitor from SystemInternals to find out what the program is doing\n  </li>\n  <li>\n   Place breakpoints on all suspect system calls\n  </li>\n  <li>\n   With complex applications, once you find a starting point you may need to reverse engineer the assembly code to understand what it's doing\n  </li>\n  <li>\n   You can use Radare2/ IDA to statically analyze (or actively debug) the program and rename methods until you reach an understanding of what must be done to achieve your goal.\n  </li>\n </ol>\n <p>\n  If you're interested in learning how to reverse engineer applications there are many books on this subject that you can look for and read.\n </p>\n <p>\n  Here's a list of (some of the) things you'd need to know:\n </p>\n <ol>\n  <li>\n   Understand the OS you're working in\n  </li>\n  <li>\n   Knowledge of (several) programming languages\n  </li>\n  <li>\n   Understand the PE/ELF file formats (or any other format you'd want to reverse engineer)\n  </li>\n  <li>\n   Understanding Assembly language\n  </li>\n </ol>\n <p>\n  Needless to say, reverse engineering may be illegal in your location, or on specific products (see EULA), so make sure that you're not doing anything that you are not allowed to do.\n </p>\n <p>\n  Hope this helps\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "lightnet",
            "time": "Mar 4, 2017 at 8:52",
            "is_accepted": true,
            "comments": [
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">I'm not sure I understand how this answer specifically addresses the OP's question about windows programs.</span>",
                    "time": null
                },
                {
                    "user": "lightnet",
                    "text": "<span class=\"comment-copy\">the part about practical leads is where I wrote a few specific examples on how one could try to achieve what the OP was asking. The truth is that it's not that simple, you need to reverse engineer the software to be able to do what he wants to do. When you're solving a simple crackme you can often avoid a lot of the necessary things you may need to understand in order to find the \"crack\". When you're working on something complicated you have to understand the software using static analysis, strings, debugging and reading the assembly, system-call hooking, registry etc...</span>",
                    "time": null
                }
            ]
        }
    ]
}