{
    "title": "Elf binary manipulation tool on ARM",
    "link": "https://reverseengineering.stackexchange.com/questions/14810/elf-binary-manipulation-tool-on-arm",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Do you know any free tool for binary manipulation elf file on ARM, something like ERESI elfsh for Intel?\n </p>\n <p>\n  Purpose - adding instructions into existing binary elf file.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "724",
    "tags": [
        "arm",
        "elf",
        "binary"
    ],
    "user": "Ryszard Grzesica",
    "time": "Mar 3, 2017 at 14:29",
    "comments": [
        {
            "user": "julian",
            "text": "<html><body><span class=\"comment-copy\">\n Are you interested in static modification specifically? Many tools provide dynamic / runtime modification capabilies for ARM binaries\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ryszard Grzesica",
            "text": "<html><body><span class=\"comment-copy\">\n Yes, correct. I am interested in static modification - most of issues which I fix are not easily reproducible and/or require hours of running platform (any kind of stability issues). The only way (which I am using now) is to mix preloading with instruction changes, sometimes I have luck - several debug/logging instructions which I can exchange and call some @plt function which I preload then. Of course such an approach has limited use.. I presume that static injector would have serious limitations too (or even does not exist from this reason). Thank you for your time.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "julian",
            "text": "<html><body><span class=\"comment-copy\">\n By preloading do you mean using LD_PRELOAD to perform dynamic library injection?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ryszard Grzesica",
            "text": "<html><body><span class=\"comment-copy\">\n Yes. Context is that I have closed platform where apps are \"ours\", middleware is closed (but luckily with symbols), lower layers of userland are closed without symbols and logging (which I managed to enable, but mostly I am doomed to already implemented routines), kernel is open. This is Android but targeted stack is aside of native Android mechanisms. This is context of current project but there are also different projects where, lets say, mapping of closed and open source differs but final goal is to reverse to fix something (or find excuses or proof leting to redirect issue).\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "julian",
            "text": "<html><body><span class=\"comment-copy\">\n Thank you for providing these details. Unfortunately I do not have a static binary manipulation solution for you right now, but I did find a dynamic instrumentation tool for android called\n <a href=\"https://github.com/crmulliner/adbi\" rel=\"nofollow noreferrer\">\n  adbi\n </a>\n that uses library injection. It is not a static modification tool but it may make your job easier. If I find something like ERESI that has support for ARM ELF binaries I will let you know.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}