{
    "title": "IDA - Some issues regarding function's/data/code recognition",
    "link": "https://reverseengineering.stackexchange.com/questions/14835/ida-some-issues-regarding-functions-data-code-recognition",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have to write an\n  <code>\n   IDAPython\n  </code>\n  script and I came across many false positives in IDA's function/code/data recognition.\n </p>\n <p>\n  <strong>\n   Case 1 - Invalid function's end (rpcrt4.dll):\n  </strong>\n </p>\n <p>\n  In some DLLs (especially in rpcrt4.dll) IDA recognize indirect/dereference calls as function's end and then misidentifies the next instructions (IDA's\n  <code>\n   no-return\n  </code>\n  kernel analysis flag is of course disabled so it is not the problem).\n </p>\n <p>\n  Example (the unknown data is a valid\n  <code>\n   jmp\n  </code>\n  instruction):\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/3LrFm.png\" rel=\"noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/3LrFm.png\"/>\n  </a>\n </p>\n <p>\n  <strong>\n   Case 2 - Data in\n   <code>\n    .text\n   </code>\n   section is identified as code (ExplorerFrame.dll):\n  </strong>\n </p>\n <p>\n  Most of Microsoft's DLLs are compiled with data at the beginning of the\n  <code>\n   .text\n  </code>\n  section and IDA successfully identifies it as data. However, sometimes IDA fail to treat these\n  <code>\n   heads\n  </code>\n  as data and treats them like code (my guess is that it has something to do with the misidentified\n  <code>\n   ret\n  </code>\n  instruction).\n </p>\n <p>\n  Example:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/LVEvs.png\" rel=\"noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/LVEvs.png\"/>\n  </a>\n </p>\n <p>\n  <strong>\n   Case 3 - code\n   <em>\n    inside\n   </em>\n   a function is identified as\n   <em>\n    data\n   </em>\n   (mimeTools.dll)\n  </strong>\n  :\n </p>\n <p>\n  This case is a little bit weird because I don't see any reason to make this mistake. As you can clearly see IDA identifies code as data\n  <strong>\n   inside\n  </strong>\n  the function (the misidentified code is a lea instruction).\n </p>\n <p>\n  Example:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/wOWCL.png\" rel=\"noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/wOWCL.png\"/>\n  </a>\n </p>\n <p>\n  <strong>\n   Case 4 - mixed misidentified code (igc32.dll):\n  </strong>\n </p>\n <p>\n  No need to elaborate, in the following example it should be all code but it gets identified as data:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/lE62S.png\" rel=\"noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/lE62S.png\"/>\n  </a>\n </p>\n <p>\n  And another example:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/FWEwn.png\" rel=\"noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/FWEwn.png\"/>\n  </a>\n </p>\n <p>\n  So obviously my question is: did anyone experience one of these problem's before and know a possible fix to some of these problems? I need a solution that don't involve human interaction and can be applied using an IDAPython script.\n </p>\n <p>\n  Thanks in advance.\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 2,
    "views": "3k",
    "tags": [
        "ida",
        "disassembly",
        "debugging",
        "idapython",
        "python"
    ],
    "user": "Aviv",
    "time": "Mar 6, 2017 at 19:11",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Disassembling an executable is\n  <em>\n   hard\n  </em>\n  . It is especially hard for machines to detect edge cases and similar nuances about small portions of code.\n </p>\n <p>\n  This is something IDA (and any other complete disassembler) puts a lot of effort into, but based on design decisions and heuristics used in different disassemblers, results vary. IDA has seen a consistent improvement in addressing such as similar issues throughout version updates.\n </p>\n <p>\n  It is however unrealistic to find and properly address all such cases, so these issues are prominent and are usually addresses manually or in a semi-manual manner. I bet there are plenty of plugins and scripts similar to\n  <a href=\"https://github.com/nihilus/IDA_Extrapass\" rel=\"nofollow noreferrer\">\n   Extrapass\n  </a>\n  but perhaps better maintained. You're also encouraged to create one yourself, that addresses the issues you encounter.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "NirIzr",
            "time": "Mar 6, 2017 at 19:28",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Nordwald",
                    "text": "<span class=\"comment-copy\">Following up on this, IDA does a very good job very quickly. If time is not of the essence, you can use a disassembling-technique following all available paths (most likely based on an IR). It is not anywhere near performant, but the distinction between code and data as well as the resolving of indirect branches are a plus.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">@nordwald AFAIK this tends to be too aggressive and mistake data as code and vice-versa. Nevertheless that's a valid point so +1</span>",
                    "time": null
                },
                {
                    "user": "Aviv",
                    "text": "<span class=\"comment-copy\">Hi Nirlzr, I'm sorry but your answer is pointless. I know that disassembling an executable is hard, otherwise I wouldn't ask that question. My intent is to write a script that improve the recognition, I know that I won't be able to get 100% success.My question's purpose was to ask the fellows around if they experienced these issues and have an answer for some of them - that's why I asked \"did anyone experience one of these problem's before and know a possible fix to some of these problems\".</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Yes, and my answer precisely addressed your question, clarifying that <i>Yes, everyone encounters this</i> and <i>Possible fix is to write scripts for specific issues</i>. I'm aware this is not the best answer you could've hoped for, but it is what it is. Any future participants are obviously welcome to share specifics, however I suspect those would be scarce. I was answering under the impression some answer is better than non.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've had similar problems. I can offer an easy fix that does a partial job (it was good enough for my needs at the time).\n </p>\n <p>\n  A fairly simple fix to implement using IDAPython is applying the following logic:\n </p>\n <ol>\n  <li>\n   iterate over all addresses\n  </li>\n  <li>\n   if addresses contains data and has a code xref pointing to it -> convert to code\n  </li>\n  <li>\n   retry defining functions adjacent to the correction you just made\n  </li>\n  <li>\n   if addresses contains code and has a data xref\npointing to it -> convert to data\n  </li>\n </ol>\n <p>\n  Keep in mind this is a general guideline to what you need to implement. The actual implementation requires some fiddling.\nThis doesn't solve everything but it solves many of the problems.\nIt helped me sort through a very troublesome IDB.\n </p>\n <p>\n  Hope this is what you were looking for.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Eli K",
            "time": "Mar 11, 2017 at 2:38",
            "is_accepted": false,
            "comments": []
        }
    ]
}