{
    "title": "Why are symbols with local binding present in the symbol table of my ELF files?",
    "link": "https://reverseengineering.stackexchange.com/questions/14895/why-are-symbols-with-local-binding-present-in-the-symbol-table-of-my-elf-files",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I found out that there are symbols with\n  <code>\n   binding=LOCAL\n  </code>\n  and\n  <code>\n   visibility=HIDDEN\n  </code>\n  in the symbol table (\n  <code>\n   .symtab\n  </code>\n  ) of ELF executables/libraries. What are they needed for? They are not involved in the relocation process nor can be invoked externally. Are they included in the symbol table for exception handling?\n </p>\n</div>\n</body></html>",
    "votes": "6",
    "answers": 1,
    "views": "5k",
    "tags": [
        "linux",
        "elf"
    ],
    "user": "user19496",
    "time": "Mar 14, 2017 at 21:15",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n This is not exactly an RE question...\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <h3>\n  Symbol Binding and Symbol Visibility\n </h3>\n <blockquote>\n  <p>\n   What are they needed for?\n  </p>\n </blockquote>\n <p>\n  There must be a way for the\n  <a href=\"https://docs.oracle.com/cd/E23824_01/html/819-0690/chapter2-88783.html\" rel=\"noreferrer\">\n   link editor\n  </a>\n  (\n  <code>\n   ld\n  </code>\n  ) to determine the scope of a symbol during link-time. In other words, symbol binding allows the link editor to differentiate between symbols visible only within a particular file being linked (local scope) vs. symbols that can be referenced from within functions located in other files (global scope).\n </p>\n <p>\n  Symbol visibility attributes (default, protected, hidden or internal) have special meaning for the\n  <a href=\"http://man7.org/linux/man-pages/man8/ld.so.8.html\" rel=\"noreferrer\">\n   runtime- (dynamic) linker (\n   <code>\n    ld-linux.so.*\n   </code>\n   )\n  </a>\n  , telling it which symbols in the symbol table are used by the executable internally vs. which symbols may be used by other executables dynamically linked to it at program runtime.\n </p>\n <p>\n  From\n  <a href=\"https://www.technovelty.org/code/why-symbol-visibility-is-good.html\" rel=\"noreferrer\">\n   Why symbol visibility is good\n  </a>\n  :\n </p>\n <blockquote>\n  <p>\n   ELF has two related concepts for managing symbols in your programs.\n  The first concept is the symbol\n   <strong>\n    binding\n   </strong>\n   .\n   <em>\n    Global\n   </em>\n   binding means the\n  symbol is visible outside the file being built;\n   <em>\n    local\n   </em>\n   binding is the\n  opposite and keeps the symbol local only (static) and weak is like\n  global, but suggests that the symbol can be overridden.\n  </p>\n  <p>\n   This is all well and good, but starts breaking down when you want to load many different modules and keep strict API's (such as, say, dynamic libraries!).\n  </p>\n  <p>\n   Binding attributes are useful for the linker putting together object files; but aren't a complete solution.\n  </p>\n  <p>\n   To combat this, ELF provides for visibility attributes. Symbols can be default, protected, hidden or internal. Using these attributes, we can flag extra information for the dynamic loader so it can know which symbols are for public consumption, and which are for internal use only.\n  </p>\n  <p>\n   The most logical way to use this is to make all symbols by default hidden with\n   <code>\n    -fvisibility=hidden\n   </code>\n   and then \"punch holes in the wall\" for those symbols you want visible.\n  </p>\n </blockquote>\n <h3>\n  Symbols and Relocation\n </h3>\n <blockquote>\n  <p>\n   They are not involved in the relocation process\n  </p>\n </blockquote>\n <p>\n  This is false.\n </p>\n <p>\n  From the\n  <a href=\"http://refspecs.linux-foundation.org/elf/gabi41.pdf\" rel=\"noreferrer\">\n   System V ABI Edition 4.1 (generic), Chapter 4: Object Files, Relocation\n  </a>\n  :\n </p>\n <blockquote>\n  <p>\n   Relocation is the process of connecting symbolic references with\n  symbolic definitions. For example, when a program calls a function,\n  the associated call instruction must transfer control to the proper\n  destination address at execution.\n  </p>\n </blockquote>\n <p>\n  From the\n  <a href=\"https://docs.oracle.com/cd/E23824_01/html/819-0690/chapter2-90421.html\" rel=\"noreferrer\">\n   Oracle Linker and Libraries Guide, Part I: Using the Link-Editor and Runtime Linker, Section 2: Link Editor Symbol Processing\n  </a>\n  :\n </p>\n <blockquote>\n  <p>\n   During input file processing, all local symbols from the input\n  relocatable objects are passed through to the output file image. All\n  global symbols from the input relocatable objects, together with\n  globals symbols from shared object dependencies, are accumulated\n  internally within the link-editor.\n  </p>\n </blockquote>\n <h3>\n  Symbols and Program Runtime\n </h3>\n <blockquote>\n  <p>\n   nor can they be invoked externally\n  </p>\n </blockquote>\n <p>\n  Symbols are never invoked during program runtime. During runtime the instruction pointer in the CPU jumps to the memory addresses in virtual memory of instructions located at offsets calculated by the link-editor (relocation). If symbols were relevant during runtime the symbol table could not be removed (stripped) from executable binaries.\n </p>\n</div>\n</body></html>",
            "votes": "9",
            "user": "julian",
            "time": "Mar 14, 2017 at 21:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}