{
    "title": "Access violation when reading [OLLYDEBUG]",
    "link": "https://reverseengineering.stackexchange.com/questions/14926/access-violation-when-reading-ollydebug",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Any time I try to crack a program I get this error in olly:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/oGmYG.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/oGmYG.png\"/>\n  </a>\n </p>\n <p>\n  What causes this error? How can I fix this?\nIf anyone has suggestion or advice that would be great. I already tried pressing F9 but that doesn't help\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "8k",
    "tags": [
        "ollydbg",
        "debugging",
        "debuggers",
        "exception"
    ],
    "user": "cupid67",
    "time": "Mar 17, 2017 at 13:38",
    "comments": [
        {
            "user": "Nordwald",
            "text": "<html><body><span class=\"comment-copy\">\n Did you try passing the exception to the programm? e.g. Shift+ [F7], [F8], [F9]. The debugger is the first to be able to handle exceptions.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <em>\n   TL;DR:\n  </em>\n  Without understanding what's causing the access violation, it is hard to tell how best to address it. You will need to investigate the exception handler and the cause first.\n </p>\n <p>\n  This status line means an Access Violation exception occurred and ollydbg caught that exception. It is not necessarily an error and could be part of normal behavior of the program. It is now up to you to decide how olly should handle that exception, but first lets discuss what can cause this exception.\n </p>\n <p>\n  Technically, this exception means the program tried accessing an invalid address. It could be that the address is not allocated or that the CPU tried executing code at an address whose permissions prevent execution, write to an address that can't be written to, etc.  Generally, an\n  <em>\n   access violation\n  </em>\n  exception occurs when an attempt to access an address failed for one reason or another.\n </p>\n <p>\n  Now that we answered what\n  <em>\n   is\n  </em>\n  an access violation exception, let's discuss\n  <em>\n   why\n  </em>\n  it happens. An access violation usually happens when a bug is encountered, due to a programming error that made the CPU execute the wrong instructions or using the wrong data. However, security developers often use tricks related to access violation exceptions for their advantage, complicating the reverse engineering process or making the program harder to debug and modify.\n </p>\n <p>\n  Examples of the more common tricks include:\n </p>\n <ol>\n  <li>\n   Measuring the time between an exception being triggered until it's handled and normal execution is resumed. When in a debugger, the debugger will suspend the program, making that time difference significantly larger.\n  </li>\n  <li>\n   Execute critical program parts within an exception handler which is slightly harder to debug, find and investigate.\n  </li>\n  <li>\n   Trigger bugs in the debugger itself, making slight changes in behavior that could be critical to the program's execution.\n  </li>\n  <li>\n   Increase the burden on the reverse engineer and complicate the dynamic reverse engineering process.\n  </li>\n  <li>\n   Fail the program violently after an anti-debugging trick detected the program is being debugged.\n  </li>\n  <li>\n   Normal operation and certain OS tricks might involve legitimately triggering (and handling) access violation exceptions.\n  </li>\n </ol>\n <p>\n  Depending on why the exception was triggered, what is the exception handler code and what surrounds the exception triggering code, the way to handle that exception differs.\n </p>\n <p>\n  For example:\n </p>\n <ol>\n  <li>\n   If the exception triggering coded is surrounded with timing checks, you would want to add it to ollydbg's ignored exceptions so the debugger won't pause on those exceptions in future executions. Do that by pressing\n   <kbd>\n    alt\n   </kbd>\n   +\n   <kbd>\n    o\n   </kbd>\n   and selecting the \"Exceptions\" item under \"Debugging\".\n  </li>\n  <li>\n   To understand if the exception handler has a crucial part in the program's behavior, you would probably want to hit\n   <kbd>\n    Shift\n   </kbd>\n   +\n   <kbd>\n    F7\n   </kbd>\n   to step into the exception handling code and reverse engineer it.\n  </li>\n  <li>\n   If the exception handler is only part of the program's normal operation, it might also be peacefully ignored by adding to ollydbg's ignored exceptions list or using\n   <kbd>\n    shift\n   </kbd>\n   +\n   <kbd>\n    F7\n   </kbd>\n   ,\n   <kbd>\n    F8\n   </kbd>\n   or\n   <kbd>\n    F9\n   </kbd>\n   to respectively step into, step over or run through the exception handler.\n  </li>\n  <li>\n   If the access violation was triggered intentionally to terminate the program, you might be able to safely ignore it (\n   <kbd>\n    shift\n   </kbd>\n   +\n   <kbd>\n    F9\n   </kbd>\n   ) and carry on with the rest of the program.\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "3",
            "user": "NirIzr",
            "time": "Mar 17, 2017 at 14:26",
            "is_accepted": false,
            "comments": []
        }
    ]
}