{
    "title": "Reversing variable origin (pointer chain) in IDA. Stuck on RUNTIME_FUNCTION XREF",
    "link": "https://reverseengineering.stackexchange.com/questions/14958/reversing-variable-origin-pointer-chain-in-ida-stuck-on-runtime-function-xref",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  So I have been exploring reverse engineering for the past few months and currently I am reversing a dumped executable which seems to be fully intact\n </p>\n <p>\n  I have stumbled upon something I can't seem to grasp/understand. When I reverse upwards to find out where some variable in a function originated from, I most of them time end up at\n  <code>\n   RUNTIME_FUNCTION\n  </code>\n  xrefs. I get stuck here since I can't go up any further.\n </p>\n <p>\n  My end goal is to find out the whole pointer chain from a static address to the target variable used in some function. I start searching upwards from a certain instruction and follow a certain variable, but unfortunately I get to the\n  <code>\n   RUNTIME_FUNCTION\n  </code>\n  references when I am about 3 levels deep.\n </p>\n <p>\n  I've read that runtime functions have something to do with SEH. But I couldn't find any constructed information about this RUNTIME_FUNCTION in IDA. Shouldn't some variable always lead to some static address inside the .data section? Does someone know what is happening here?\n </p>\n <p>\n  In this image you can see that when I want to figure out what references/uses this function I only get those RUNTIME_FUNCTION's:\n  <a href=\"https://i.sstatic.net/QSKQ6.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/QSKQ6.png\"/>\n  </a>\n </p>\n <p>\n  How would you normally go around this issue to get back on track and reverse further/beyond the RUNTIME_FUNCTION?\n </p>\n <p>\n  Executable segments:\n  <a href=\"https://i.sstatic.net/MZcEa.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/MZcEa.png\"/>\n  </a>\n </p>\n <p>\n  Any help is appreciated, thanks!\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "3k",
    "tags": [
        "ida",
        "windows"
    ],
    "user": "Steffen Brem",
    "time": "Mar 20, 2017 at 16:30",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <a href=\"http://www.osronline.com/article.cfm?article=469\" rel=\"nofollow noreferrer\">\n   <code>\n    RUNTIME_FUNCTION\n   </code>\n   is a system structure\n  </a>\n  added by the compiler for all functions in a  proper win64 executable. It is only used by the OS when processing exceptions, so it has no relation to your game's variables. You should ignore those xrefs and look elsewhere.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Igor Skochinsky",
            "time": "Mar 21, 2017 at 9:28",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   Shouldn't some variable always lead to some static address inside the\n  .data section?\n  </p>\n </blockquote>\n <p>\n  There is no concept of a variable on assembly level. We got bit-sized\nfields in registers and memory.\n </p>\n <p>\n  By convention, compilers designate the .data section for global and static variables. Everything inside a function is mostly handled on the stack.\n </p>\n <blockquote>\n  <p>\n   How would you normally go around this issue to get back on track and\n  reverse further/beyond the RUNTIME_FUNCTION?\n  </p>\n </blockquote>\n <p>\n  Please understand that IDA does not do data flow analysis for you, but it finds cross-references. So this is not the source of the data, but something referencing to it.\n </p>\n <p>\n  What you want to do is to trace the dataflow back to its origins. Data-flow analysis looks somewhat like this:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/yB1lr.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/yB1lr.png\"/>\n  </a>\n </p>\n <p>\n  What you should do is use your knowledge about the calling convention to know how data is passed between functions. If you can get any more specific with your question, I'm sure you will get less general answers.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Nordwald",
            "time": "Mar 21, 2017 at 8:21",
            "is_accepted": false,
            "comments": []
        }
    ]
}