{
    "title": "How to run and reconstruct a packed DLL in IDA Pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/15031/how-to-run-and-reconstruct-a-packed-dll-in-ida-pro",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a packed DLL. It has an entry point. If I call LoadLibrary it gets unpacked with the entry point code. Then I can attach a debugger to the .exe that called LoadLibrary and see the unpacked dll dissasembly in my debugger.\n </p>\n <p>\n  I know IDA has a \"universal unpacker\" plugin, as well as a \"reconstruct\" option. But I have the .dll open in IDA. A .dll can't be executed, so I can't seemingly use these tools.\n </p>\n <p>\n  I have a memdump of the unpacked .dll, but I had trouble importing it manually in IDA. That doesn't seem like a promising route.\n </p>\n <p>\n  Maybe I can create a custom console application that will load the .dll using LoadLibrary and then somehow call IDA PRO on that running instance?\n </p>\n <p>\n  The .dll is so packed there are no exports table at all. I presume there are memory addresses that are given to the .dll user - and that's how the calling works. I've working on figuring out those addresses.\n </p>\n <p>\n  Any help appreciated!\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "3k",
    "tags": [
        "dll",
        "unpacking",
        "deobfuscation",
        "packers"
    ],
    "user": "Edza",
    "time": "Mar 27, 2017 at 20:30",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   I have a memdump of the unpacked .dll, but I had trouble importing it manually in IDA. That doesn't seem like a promising route.\n  </p>\n </blockquote>\n <p>\n  This is exactly the way to go. Given the right offset, this should work like charm. If you have any problems here, consider asking another question about it.\n </p>\n <blockquote>\n  <p>\n   Maybe I can create a custom console application that will load the .dll using LoadLibrary and then somehow call IDA PRO on that running instance?\n  </p>\n </blockquote>\n <p>\n  Yes. You should be able to use a program which only consists of a LoadLibrary call. LoadLibrary should map the library to your process space and execute its WinMain Function (which I presume is in charge of unpacking). If the unpacking functionality is not included in the .dll itself, you should really reconsider using a memory dump.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Nordwald",
            "time": "Mar 28, 2017 at 5:18",
            "is_accepted": true,
            "comments": []
        }
    ]
}