{
    "title": "How to identify unknown chip",
    "link": "https://reverseengineering.stackexchange.com/questions/15056/how-to-identify-unknown-chip",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to play with the internals of a toy and the controller for that toy uses a chip that I have been unable to find any information on. The chip in question is this:\n  <a href=\"https://i.sstatic.net/NNRVa.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/NNRVa.jpg\"/>\n  </a>\n </p>\n <p>\n  The company is clearly visible, but I can't seem to find anything about them. Given the ambiguity in the font, i've tried googling \"Aveo\", \"Nveo\", \"Aueo\" and \"Nueo\" all to no results. I've tried googling the AV2881 chip identification only to find that there is a very specific type of wall paper that has that label.\n </p>\n <p>\n  The chip is clearly a processor/controller of some type and what i'm ultimately trying to figure out here is how can i find the instruction set it uses (usually these things, even if a custom chip, use a known core instead of a custom instruction set) and how i can extract the firmware. In this particular case, i believe that the firmware is not necessarily on chip but on the 8M EEPROM that is next to the chip.\n </p>\n <p>\n  Hardware hacking is not my strong suit, but it anyone has some pointers about how i can identify this chip, i'd be most grateful.\n </p>\n <p>\n  UPDATE:\n per the request below, here is a larger picture of the controller board:\n  <a href=\"https://i.sstatic.net/YFaJw.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/YFaJw.jpg\"/>\n  </a>\n  The toy in question is the NERF Terrascout. I wasnt sure if it was cool to call out the product in a post which is why i was being a bit cagey about it above.\n </p>\n <p>\n  greg.\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "893",
    "tags": [
        "hardware"
    ],
    "user": "tjac",
    "time": "Mar 31, 2017 at 16:34",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n did you dump the eeprom? any strings in it?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "tjac",
            "text": "<html><body><span class=\"comment-copy\">\n not yet. waiting for a reader to come in for that. and unfortunately the manufacturer didnt bother to add a method for firmware upgrades so no way to get it from them directly. :)\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<html><body><span class=\"comment-copy\">\n Aveo technology corp\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "tjac",
            "text": "<html><body><span class=\"comment-copy\">\n @blabb that pointed me in the right direction. Thank you! Aveo's website (aveotek.com.cn) doesnt seem to be functional anymore, but archive.org's last sampling of the page from 2014 shows a link for an AV288 which matches what i'd expect for this (\n <a href=\"http://web.archive.org/web/20110504082416/http://www.aveotek.com.cn/288.htm\" rel=\"nofollow noreferrer\">\n  web.archive.org/web/20110504082416/http://www.aveotek.com.cn/…\n </a>\n ) Sadly, no datasheet. I'm also suspecting that the \"1\" is an \"I\" so the chip is the Aveo AV288i. The spec page makes me think this is going to be a 8051 core. Wish i could find the full datasheet for this though.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "tjac",
            "text": "<html><body><span class=\"comment-copy\">\n @blabb yes it is a tank drone with a nerf gun strapped to the top of it with a camera above the barrel. It seems aveotek.com.cn is dead. Any ideas where to find datasheets on their products? The board has a design date of 2016, so presumably there is somewhere these datasheets exist. Any ideas where because google is failing me. Also blabb can you put your answer below so i can mark this question answered and give credit where credit is due?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Aveo is aveo technolgy corp  some software related to usb uvc camera seens ti be available here.\n </p>\n <p>\n  <a href=\"http://aveo.drivers.informer.com/\" rel=\"nofollow noreferrer\">\n   http://aveo.drivers.informer.com/\n  </a>\n  not sure if the links are geniune appears to be collated compilation\n </p>\n <p>\n  Please make sure you download and inspect in a relatively safe environment\n </p>\n <p>\n  There are some datasheets of different model seems to available here.\n </p>\n <p>\n  <a href=\"http://www.datasheetspdf.com/PDF/AV316H/769502/5\" rel=\"nofollow noreferrer\">\n   http://www.datasheetspdf.com/PDF/AV316H/769502/5\n  </a>\n </p>\n <p>\n  Webarchive knows about av288 and says it is 8051\n </p>\n <p>\n  <a href=\"https://web-beta.archive.org/web/20150503120144/http://www.aveotek.com:80/288.htm\" rel=\"nofollow noreferrer\">\n   https://web-beta.archive.org/web/20150503120144/http://www.aveotek.com:80/288.htm\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "blabb",
            "time": "Apr 1, 2017 at 10:34",
            "is_accepted": true,
            "comments": []
        }
    ]
}