{
    "title": "Is it feasible to try write mips unicode shellcode",
    "link": "https://reverseengineering.stackexchange.com/questions/15220/is-it-feasible-to-try-write-mips-unicode-shellcode",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am doing a bit off research on exploiting mips embedded applications and I am in a situation where I am able to trigger a buffer overflow, effectively being able redirect execution to any location in memory. There are restrictions however; the memory address I return to and any shellcode I use has to be UTF-8 compatible. This is because the payload has to be stored in an ID3 tag (metadata of an mp3 file).\n </p>\n <p>\n  Since this is mips, I have not come across any encoders that can support creating UTF-8 or alphanumeric shellcode. I am now wondering if this is the case because writing an encoder or shellcode for this architecture is not feasible?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "257",
    "tags": [
        "mips",
        "shellcode"
    ],
    "user": "Masande",
    "time": "Apr 26, 2017 at 6:29",
    "comments": [
        {
            "user": "NirIzr",
            "text": "<html><body><span class=\"comment-copy\">\n Why not encode (most) of the shellcode in other parts of the mp3 file? say exploit using the ID3 tab but jump to data in the mp3 media stream?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Masande",
            "text": "<html><body><span class=\"comment-copy\">\n In my case, only the metadata of the file is parsed and by the time the vulnerability is triggered the file is closed. However, I haven't explored if there are parts of the mp3 file that are in memory at the time the vulnerability is triggered which I could use that do not have UTF-8 restriction. Thanks for the hint.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}