{
    "title": "How to reverse Engineer a game character position on a map",
    "link": "https://reverseengineering.stackexchange.com/questions/15252/how-to-reverse-engineer-a-game-character-position-on-a-map",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to reverse engineer an online game (Dota 2) to get some more info and build a personal assistant with friendlier/ advanced info about my character. First I'm trying to find out the player location on the map. I thought of trying to read and profile the client.exe to find where in the memory it stores the character location, but I truly don't know where to start.\n </p>\n <p>\n  I can run it with OllyDbg and start looking for changing values as the character moves, but since many other values in the game also change, it would take me days to find out which is it. So I figured maybe there is a better way. How to get started with this?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 2,
    "views": "984",
    "tags": [
        "ollydbg"
    ],
    "user": "sigmaxf",
    "time": "Apr 30, 2017 at 1:00",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <a href=\"http://www.cheatengine.org/\" rel=\"nofollow noreferrer\">\n   Cheat Engine\n  </a>\n  is usually the tool of choice for those kind of tasks. It lets you scan memory of a process in multiple stages and rule out the dozens of fitting memory addresses using several scans and value matches.\n </p>\n <p>\n  Cheat Engine is a great tool for identification of memory structures and is heavily used in the first steps of creating game cheats and trainers. It is quite intuitive to use and you should definitely check it out.\n </p>\n <p>\n  I can write more about it but it'll be easier to just download it and try for yourself.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Apr 30, 2017 at 9:11",
            "is_accepted": true,
            "comments": [
                {
                    "user": "sigmaxf",
                    "text": "<span class=\"comment-copy\">Wow, cheat engine is still alive. I remember using this back in the day to make Diablo 1 gold. Thanks man. I'll fiddle with it see what I can find.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Most easiest way is to search something like a ladder to climb on. Everytime you are going up or down, search for in- or decreased float value. This will give you the y-coordinate in the end. That offset taken, add 4 bytes to get z- and substract 4 bytes to get x-coordinate. Using ReClass you can even try to find the base object for your and other players.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "hendrik",
            "time": "Dec 31, 2017 at 18:13",
            "is_accepted": false,
            "comments": []
        }
    ]
}