{
    "title": "DPFMate Keychain tool",
    "link": "https://reverseengineering.stackexchange.com/questions/15308/dpfmate-keychain-tool",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Got this Digital Keychain Photo viewer thingy. Comes with the DPFMate.exe software, which does not run under Windows 10. So far I've confirmed, that it runs perfectly on what they avertise - Windows XP. But no-one has that nowadays, so windows >7 would be great to get working. Have tried compatibility mode, to no success.\n </p>\n <p>\n  Does anyone know where or how DPFMate places the images on the keychain, so I could possibly write my own program to do the move? I've heard it's some special protocol aswell... Or happens to have a version that runs on newer systems?\n </p>\n <p>\n  Program available here:\n  <a href=\"https://www.dropbox.com/sh/qym0okbfrndl8cx/AAADqBjp_i5PyJ8yyAo_YVWDa?dl=0\" rel=\"nofollow noreferrer\">\n   https://www.dropbox.com/sh/qym0okbfrndl8cx/AAADqBjp_i5PyJ8yyAo_YVWDa?dl=0\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "3k",
    "tags": [
        "file-format",
        "protocol"
    ],
    "user": "Rando Hinn",
    "time": "May 10, 2017 at 18:26",
    "comments": [
        {
            "user": "user15338",
            "text": "<html><body><span class=\"comment-copy\">\n Have you tried running the program in compatibility mode?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Rando Hinn",
            "text": "<html><body><span class=\"comment-copy\">\n Yup, had no success whatsoever @JacobPersi\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Shift",
            "text": "<html><body><span class=\"comment-copy\">\n Can you provide the binary or an API log of what exactly happens when you try to execute the DPFMate program? I tried looking for the application but since I do not own any Digital Keychain hardware I wasn't able to get this software. A good starting point would be to attach the program to this thread.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Rando Hinn",
            "text": "<html><body><span class=\"comment-copy\">\n Will do! When I execute on 10, it just crashes immediately with a fatal. No log generated.Edited OP with software link\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "lobster",
            "text": "<html><body><span class=\"comment-copy\">\n i have posted a response to this on\n <a href=\"https://stackoverflow.com/questions/43642086/keychain-viewers-what-does-dpfmate-do\">\n  stackoverflow\n </a>\n for you and anyone interested that found this trought google. and if you find a way to make the software work without the file compression that would be nice too since the compression creates a lot of artefacts.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Digital Keychain Photo viewer thingies are sensitive. For DPFMate:\n </p>\n <ol>\n  <li>\n   You need to use the cable that came with the thingy.\n  </li>\n  <li>\n   The thingy has to be in \"UPDATE\" mode.\n  </li>\n  <li>\n   It needs to be fully charged before use (about two hours from memory)\n  </li>\n </ol>\n <p>\n  I have used Kaiser Baas and one other (no name). They both came with built in software; they both work with Windows 10. Interchanging Cables is a problem; particularly with Kaiser Baas which seems only to work with the cable that it came with.\n </p>\n <p>\n  The software allows you to add, sync and delete images (JPG and BMP).\n </p>\n <p>\n  I can send you the DPFMate software via email attachment.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "0xC0000022L",
            "time": "Jul 10, 2018 at 8:11",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I just found my photo thing again. If you download oracle virtualbox and set up a winxp guest you can use the DPFMate software. Just preload your photos on the VM and attach the USB photo frame USB device to the VM.\n </p>\n <p>\n  Note; my antivirus says that DPFMate is a trojan virus, you may have issues with your antivirus disabling the usb. If despite this warning, you still want to go ahead, you can also set up your XP guest to discard changes when you reboot. You can just delete the virtual disk when you are done too. Also disable the network on the VM, trojans allow remote access.\n </p>\n <p>\n  However, unless you know what you are doing and accept the risks, don't disable your antivirus! :)\n </p>\n <p>\n  Another idea, if anyone wants to test this, is a winPE or bartPE environment. Make a XP PE CD and boot from that.. (basically a lite windows environment that boots from cd, so it's readonly! Unplug your HDD.) Let us know if it works!\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "DerBen",
            "time": "May 2, 2020 at 16:14",
            "is_accepted": false,
            "comments": []
        }
    ]
}