{
    "title": "How to debug ServiceMain function of a service?",
    "link": "https://reverseengineering.stackexchange.com/questions/15310/how-to-debug-servicemain-function-of-a-service",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a malware which is checking for keyboard type and locale information.\n </p>\n <p>\n  After that, it creates a service with BinaryPathName as malware's exe address. After creating a service, malware starts it \nand call\n  <code>\n   StartServiceCtrlDispatcher\n  </code>\n  and kinda stucks there. No further code is evaluated after that.\n </p>\n <p>\n  I have done all this analysis in OllyDbg and ImmDbg.\n </p>\n <p>\n  I want to debug a ServiceMain Function of the service installed by this malware.\n </p>\n <p>\n  After googling a lot, I have found\n  <a href=\"https://support.microsoft.com/en-us/help/824344/how-to-debug-windows-services\" rel=\"nofollow noreferrer\" title=\"this\">\n   this\n  </a>\n  article. I tried performing the 2nd method \"Configure a service to start with the WinDbg debugger attached\" but somehow my VM froze.\n </p>\n <p>\n  So my question (in general), How can I debug ServiceMain function of any service?\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 3,
    "views": "2k",
    "tags": [
        "windows",
        "ollydbg",
        "windbg",
        "winapi"
    ],
    "user": "Priyank Chheda",
    "time": "Jun 8, 2018 at 2:54",
    "comments": [
        {
            "user": "Lieven Keersmaekers",
            "text": "<html><body><span class=\"comment-copy\">\n Did you make the service interactive?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Priyank Chheda",
            "text": "<html><body><span class=\"comment-copy\">\n Yes. By ticking\"Allow service to interact with desktop\" in service properties > Log on tab.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <em>\n   This answer ignores the case of shared services, since that is more elaborate and OP did not mention that specifically.\n  </em>\n </p>\n <p>\n  Services are usually normal processes like any other process, however they are executed by the operating system and not the creating/starting process, which may be a cause for some confusion.\n </p>\n <h2>\n  How to debug services?\n </h2>\n <p>\n  Like any other process, you can either attach to it after its running most (read: all decent) debuggers support attaching (and putting protected process services aside) can be attached to.\nIf you fear you'd miss some crucial part of the execution before you get to attach you could use tools that let you debug spawned processes. Ollydbg supports that as well as x64. And Rohitab's API Monitor has decent capabilities when it comes to detecting and attaching to new processes.\n </p>\n <h2>\n  but why execution stopped after calling\n  <code>\n   StartServiceCtrlDispatcher\n  </code>\n  ?\n </h2>\n <p>\n  However, when dealing with most malware samples it'll be good enough to just create the process yourself and skip any service related functions.\n </p>\n <p>\n  It seems that your specific issue is with the execution of the\n  <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms686324(v=vs.85).aspx\" rel=\"nofollow noreferrer\">\n   <code>\n    StartServiceCtrlDispatcher\n   </code>\n  </a>\n  function, which is the function called\n  <em>\n   by the service entry point\n  </em>\n  in order to register connect back to the service manager. That connection to the service manager is how the service reports it has be successfully load and functional, how it gets commands to shutdown, restart etc.\n </p>\n <p>\n  <code>\n   StartServiceCtrlDispatcher\n  </code>\n  has a single parameter which is the\n  <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms686001(v=vs.85).aspx\" rel=\"nofollow noreferrer\">\n   <code>\n    SERVICE_TABLE_ENTRY\n   </code>\n  </a>\n  structure. It has two members, the second of which is of type\n  <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms685138(v=vs.85).aspx\" rel=\"nofollow noreferrer\">\n   <code>\n    LPSERVICE_MAIN_FUNCTION\n   </code>\n  </a>\n  and called\n  <code>\n   lpServiceProc\n  </code>\n  . That parameter is actually a function pointer to the\n  <code>\n   ServiceMain\n  </code>\n  function. Pick it up, parse the structure and you'll get to where execution will be given back to the service in order to continue execution!\n </p>\n <h2>\n  VM, why you no run?!\n </h2>\n <p>\n  Well, unfortunately you did not provide enough details to diagnose that one.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "NirIzr",
            "time": "Jun 8, 2018 at 3:03",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I prefer to use HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\Debugger see more\n  <a href=\"https://blogs.msdn.microsoft.com/greggm/2005/02/21/inside-image-file-execution-options-debugging/\" rel=\"nofollow noreferrer\">\n   here\n  </a>\n  .\nTo specify the debugger process, which starts as soon as the service process does. So that I'm able to set up the breakpoints at the very beginning.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Anton Kukoba",
            "time": "Sep 6, 2018 at 8:24",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Others have already described elegant ways of doing this, so I'll post a dirty (but very versatile) trick:\n </p>\n <p>\n  Open the binary in a hex editor and replace the first two bytes of the function you want to debug with EB FE (a jump to itself). Run the binary normally (e.g. start the service) and once the process starts consuming 100% CPU (well, 100% of one core), attach the debugger, put a break point at your little infinite loop, hit run, patch in the original bytes and you're ready to debug.\n </p>\n <p>\n  It's really ugly and quite impractical, but it will work with everything from DLLs to drivers.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "user2347953",
            "time": "Sep 10, 2018 at 20:47",
            "is_accepted": false,
            "comments": []
        }
    ]
}