{
    "title": "Aside from Assembly, should I learn C or C++?",
    "link": "https://reverseengineering.stackexchange.com/questions/15412/aside-from-assembly-should-i-learn-c-or-c",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  With Malware/Virus analysis being heavily dependant on one's ability to read the the Assembly Code generated by the Disassembler... being familiar with the Assembly Language is naturally the most important pre-requisite when it comes to this field.\n </p>\n <p>\n  But, aside from Assembly, should I know C or C++ as well?\n  \n\n  If so, how important is C or C++ in relations to this field? and for what reason? And which should I tackle first?  Which is more important and more directly related to Malware/Virus analysis?\n </p>\n <p>\n  Are most Malware/Viruses these days writtein in ASM? C? C++? or Java?\n </p>\n</div>\n</body></html>",
    "votes": "-2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "malware",
        "c++",
        "c"
    ],
    "user": "FormosaTBM",
    "time": "May 23, 2017 at 17:34",
    "comments": [
        {
            "user": "julian",
            "text": "<html><body><span class=\"comment-copy\">\n Possible duplicate of\n <a href=\"https://reverseengineering.stackexchange.com/questions/3261/is-learning-assembly-enough-to-become-a-malware-analyst\">\n  Is learning assembly enough to become a malware analyst?\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I don't think you should make such a binary distinction between C and C++ as valuable knowledge for a reverse engineer.\n </p>\n <p>\n  First, should you learn C? In my opinion, it's almost mandatory, it's the language the closest to assembly with just higher abstraction to get a better grasp at the big picture. Most of the things you'll reverse are derived from C, and this will be an invaluable help to understand most of the usual construct patterns.\n </p>\n <p>\n  Then, should you learn C++? It's a more nuanced question and really boils down to what you are going to reverse. If most of your targets are C++ based, once again it would be of great help. If you're expecting to reverse none-C++ stuff most of the time, it might be somewhat inefficient.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "user2823000",
            "time": "May 23, 2017 at 21:09",
            "is_accepted": false,
            "comments": []
        }
    ]
}