{
    "title": "How to locate dynamic instructions?",
    "link": "https://reverseengineering.stackexchange.com/questions/15427/how-to-locate-dynamic-instructions",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to make a game hack and there are a few instructions I need to get the addresses of to\n  <code>\n   nop\n  </code>\n  out. However, when looking at the instructions in Cheat Engine, they do not have a static offset from any modules (DLL's or base exe). I have no idea how I would locate dynamic instructions. Any help would be very nice.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 3,
    "views": "1k",
    "tags": [
        "disassembly",
        "assembly",
        "dll",
        "dynamic-linking",
        "offset"
    ],
    "user": "Guy Rodgers",
    "time": "May 26, 2017 at 17:30",
    "comments": [
        {
            "user": "PhoeniX",
            "text": "<html><body><span class=\"comment-copy\">\n do you have any examples?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Being an avid Cheat Engine user and game-hacker, I can walk you through a specific example that should give you solid clarity.\n </p>\n <p>\n  First, we'll use this arbitrary bit of code to work with:\n </p>\n <pre><code>7A1A7A162 - 55                    - push rbp\n7A1A7A163 - 00 6E 00              - add [rsi+00],ch\n7A1A7A166 - 69 00 74000000        - imul eax,[rax],00000074 { 116 }\n7A1A7A16C - 00 00                 - add [rax],al\n7A1A7A16E - 00 00                 - add [rax],al\n7A1A7A170 - EB C3                 - jmp 7A1A7A135\n7A1A7A172 - C3                    - ret \n</code></pre>\n <p>\n  Let's say the two bytes you want to nop are\n  <code>\n   EB C3\n  </code>\n  , but\n  <code>\n   7A1A7A170\n  </code>\n  isn't a static address. What you now want to do is construct a\n  <strong>\n   <em>\n    unique\n   </em>\n  </strong>\n  byte signature that you can then scan for. What you're betting on here is that while the memory addresses might change, the instructions stay the same. This gives you something consistent to scan for. Ultimately, you want only one result from the scan so that you don't end up finding--and then modifying--a false positive.\n </p>\n <p>\n  In Cheat Engine, everything related to signature scanning is referred to as AOB (Array of Byte) scanning. It's essentially one in the same. Let's build what we hope is a unique AOB using the bytes from the example routine above:\n </p>\n <pre><code>55 00 6E 00 69 00 74 00 00 00 00 00 00 00 EB C3 C3\n</code></pre>\n <p>\n  Now what you could do in Cheat Engine is select \"Array of byte\" from the\n  <em>\n   Value Type\n  </em>\n  drop-down box, then make sure the\n  <em>\n   Writeable\n  </em>\n  checkbox has the solid black square selection (that is, not just a check mark and not empty) which means CE will scan both read/write memory, and finally, paste those bytes into the search box and search.\n </p>\n <p>\n  If you only have one result, then you're good to go. Your scan would return the first memory address (no matter what it is), and you could then base your injection on an offset from that result, which would be\n  <code>\n   0x0E\n  </code>\n  . Cheat Engine (or whatever you use to scan for that byte pattern) finds the result starting in memory address\n  <code>\n   7A1A7A162\n  </code>\n  , then from there, your bytes are +\n  <code>\n   0x0E\n  </code>\n  away at address\n  <code>\n   7A1A7A170\n  </code>\n  .\n </p>\n <p>\n  If you have multiple results, then what you need to start doing is adding bytes onto the beginning or end of your signature. Using our example, this would mean starting to incorporate bytes from instructions prior to\n  <code>\n   7A1A7A162\n  </code>\n  and/or after\n  <code>\n   7A1A7A172\n  </code>\n  .\n </p>\n <p>\n  Yes, you can sometimes end up with massive AOBs -- especially in cases where you're dealing with anti-cheat software that duplicates certain blocks of code to throw pattern scanning off. In these cases, you can try finding an array of bytes nearby that have nothing to do with the bytes you want to modify, and then base your injection on an offset from the results of that scan.\n </p>\n <p>\n  For instance, maybe there's a unique byte signature from\n  <code>\n   7A1A70000\n  </code>\n  to\n  <code>\n   7A1A7001C\n  </code>\n  , which you then reference the resulting scan (which would be\n  <code>\n   7A1A70000\n  </code>\n  ) + an offset of\n  <code>\n   A170\n  </code>\n  to land you at\n  <code>\n   7A1A7A170\n  </code>\n  . That sometimes doesn't work, either, such as when a game's instructions are compiled at run time (this is common with Java-based games--Minecraft being one such game; look into\n  <a href=\"https://en.wikipedia.org/wiki/Just-in-time_compilation\" rel=\"nofollow noreferrer\">\n   JIT compilation\n  </a>\n  ), but it's a good example to show you how to get around a common anti-pattern scan technique.\n </p>\n <p>\n  Feel free to ask if you need additional clarity on the this, but the ultimate goal is to find a unique byte signature that you can scan for, then base your injection on that. This allows you to work independently of memory addresses. =)\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "dsasmblr",
            "time": "Jul 25, 2017 at 20:05",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You could use signature scanning if they don't have symbols.\n </p>\n <p>\n  <a href=\"https://wiki.alliedmods.net/Signature_Scanning\" rel=\"nofollow noreferrer\">\n   Signature scanning\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "exploiter",
            "time": "May 26, 2017 at 11:25",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If this code is used in any way by your program, this location has to be stored somewhere to be used by the \"static\" part of your binary. So usually what you want to do is to find a chain of pointers going to your target code. You can find such a chain either by reversing the binary or blindly memory-greping addresses starting from your target.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "user2823000",
            "time": "May 26, 2017 at 15:56",
            "is_accepted": false,
            "comments": []
        }
    ]
}