{
    "title": "Is it possible to extract / read a variable out of a running .exe file?",
    "link": "https://reverseengineering.stackexchange.com/questions/15500/is-it-possible-to-extract-read-a-variable-out-of-a-running-exe-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am completely new to Windows programming so please excuse any naivety on my part when asking this question. I'll briefly describe my situation and then hopefully you'll be able to answer my question.\n </p>\n <p>\n  I have a small executable file that was written in Delphi and packed with Aspack 2.12.\n </p>\n <p>\n  When the file runs there is a variable called Total which gets incremented. When the file exits a .dat file gets updated with the new Total value.\n </p>\n <p>\n  I can program something to 'read' the Total from the .dat file (just by using php or one of the languages I'm familiar with). However, I would like to read the Total value in \"real time\" when the executable is running (I don't need to 'write' to the Total value - just read it).\n </p>\n <p>\n  I wondered if there was any way of writing an application that would \"reach in\" to a running executable and read a variable out of it?\n </p>\n <p>\n  I remember back in the Spectrum days you could \"peek\" and \"poke\" memory. Is something like this feasible?\n </p>\n <p>\n  I wondered if this is even possible and, if so, how could I go about doing this?\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "5k",
    "tags": [
        "windows",
        "executable",
        "exe"
    ],
    "user": "John T",
    "time": "Jun 7, 2017 at 9:07",
    "comments": [
        {
            "user": "John T",
            "text": "<html><body><span class=\"comment-copy\">\n @DominikAntal wow! That was lightning fast!!! :-) Thanks I'll Google it now. Any idea how I would know where in memory to read? And also would that memory address change every time the computer was started and the exe run? (thanks for the edit about CheatEngine - my work server blocks this but I'll look at this when I finish work :-))\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "John T",
            "text": "<html><body><span class=\"comment-copy\">\n Yep, will do that @DominikAntal thanks again. I take it that once I've identified an area with CheatEngine it's simply a case of writing some code in C++ to \"ReadProcessMemory\" in that location and read the variable I want?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Dominik Antal",
            "text": "<html><body><span class=\"comment-copy\">\n If your variable is static, it is possible that the same memory address you found via CE will work between application restarts. If its not static, you might be able to reach it via a pointer and offsets. Or via byte pattern scanning. All of these should be covered on this site..\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Look into\n  <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms680553(v=vs.85).aspx\" rel=\"nofollow noreferrer\">\n   ReadProcessMemory\n  </a>\n  WinAPI, alternatively\n  <a href=\"http://www.cheatengine.org/\" rel=\"nofollow noreferrer\">\n   CheatEngine\n  </a>\n  is a tool that can do all kinds of memory related operations for you (search, modify, freeze, debug, etc.).\n </p>\n <p>\n  You could also search on Github for some other memory \"hacking\" projects in a language that you are familiar with.\n </p>\n <p>\n  Cheat engine can find the exact memory address in the memory of the value you are looking for. You might be able to use some pointers to get the location of your value on each run, so you do not have to use CheatEngine each time to find the address. I recommend you go trough the tutorial which comes with Cheat Engine, so you get a better understanding of pointers :)\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Dominik Antal",
            "time": "Jun 7, 2017 at 9:16",
            "is_accepted": true,
            "comments": [
                {
                    "user": "John T",
                    "text": "<span class=\"comment-copy\">I would like the process to ultimately be automated (i.e. I run the target .exe and then run some software I've written and then the value is read real-time into a text-file or whatever). Is that what the 'pointers' you mention allow me to do?? So that whenever I run the exe my software will automatically be able to still find the correct variable and read it out?</span>",
                    "time": null
                },
                {
                    "user": "Dominik Antal",
                    "text": "<span class=\"comment-copy\">Yes, that is what I meant. You have to determine if pointers are required for this at all, if you find your value at the same memory location in Cheat Engine after restarting your application, no pointers are needed. If the memory location changes, you will need to find a pointer (and offset(s)) to that value. I think the CE tutorial covers this subject as well! Alternatively you could try byte pattern matching as well but that is the third option.</span>",
                    "time": null
                }
            ]
        }
    ]
}