{
    "title": "VBA code detection in MS office documents",
    "link": "https://reverseengineering.stackexchange.com/questions/15639/vba-code-detection-in-ms-office-documents",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  So, lately I've been working on a project involving malware which gets spread via MS Office documents and, among other things, I need to detect the VBA code in appropriate document streams.\n </p>\n <p>\n  I've read most parts of the\n  <a href=\"https://msdn.microsoft.com/en-us/library/office/cc313094(v=office.12).aspx\" rel=\"nofollow noreferrer\">\n   Office VBA File Format Structure\n  </a>\n  , from which it seems to me that the correct way of detecting the beginning of the compressed code is by parsing the\n  <code>\n   dir\n  </code>\n  stream which contains the\n  <code>\n   PROJECTMODULES Record\n  </code>\n  and which contains the\n  <code>\n   MODULEOFFSET Record\n  </code>\n  whose element\n  <code>\n   TextOffset\n  </code>\n  contains the actual offset to the compressed source code inside the appropriate\n  <code>\n   ModuleStream\n  </code>\n  . I've also found a project\n  <a href=\"https://github.com/unixfreak0037/officeparser\" rel=\"nofollow noreferrer\">\n   officeparser\n  </a>\n  which performs the VBA code detection in the following way, but according to the project site on Github, there hasn't been any work on the project in the last few years.\n </p>\n <p>\n  However, I've also found two other projects that deal with the same problem in a different way and which are more up to date. The projects are\n  <a href=\"https://github.com/DidierStevens/DidierStevensSuite/blob/master/oledump.py\" rel=\"nofollow noreferrer\">\n   oledump\n  </a>\n  and\n  <a href=\"https://github.com/decalage2/oletools/tree/master/oletools\" rel=\"nofollow noreferrer\">\n   oletools\n  </a>\n  and the way they detect the beginning of the compressed VBA code inside a stream is by searching for the pattern\n  <code>\n   \\x00Attribut\n  </code>\n  and then positioning 3 bytes back from that position. I haven't found any official documentation on this method so what I would like to know is if this method is some heuristic way of searching for the compressed code or am I missing some parts of the documentation?\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "259",
    "tags": [
        "malware",
        "file-format",
        "vba"
    ],
    "user": "ubnix",
    "time": "Jun 23, 2017 at 8:00",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  That part of the code you referred to is for manually parsing malformed ole only if the documented(?) method didnt work.\n </p>\n <p>\n  Not sure if office will open it correctly or provide a repair option (M$ is very liberal with its own specifications), but you may still want to know VBA is there even if it doesnt work 'as is'.\n </p>\n <p>\n  There is of course no official documentation on how the 'malformed' ole should look like :)\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Sigtran",
            "time": "Jun 23, 2017 at 8:58",
            "is_accepted": true,
            "comments": [
                {
                    "user": "ubnix",
                    "text": "<span class=\"comment-copy\">Yes, you are right, the oletools have both methods supported. I completely missed that part where the author uses the documented approach. The oledump project, however, only uses the heuristic one. I've implemented both methods in my project so guess that is the way to go. Thanks for the help.</span>",
                    "time": null
                },
                {
                    "user": "Sigtran",
                    "text": "<span class=\"comment-copy\">glad it helped :)</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You should note that the code exists in up to 3 compiled states within the file, with the compressed source code being the source of last resort.\n </p>\n <p>\n  The VBA engine will prefer the code in execode format (where the file and the current VBA environment are a match), and\n  <em>\n   then\n  </em>\n  the p-code (where the file and VBA environment can match more loosely) and only then the compressed source code.\n </p>\n <p>\n  It is possible for the p-code to be different to the compressed source code, and where the environment doesn't differ, the source code will be ignored.\n </p>\n <p>\n  When you open a file containing VBA, the VBE usually decodes the p-code into the source that you see in the visual basic editor.\n </p>\n <p>\n  A malicious actor can embed source-code that looks benign, but the p-code is malicious.\n </p>\n <p>\n  See this the\n  <a href=\"https://github.com/bontchev/pcodedmp\" rel=\"nofollow noreferrer\">\n   pcodedmp\n  </a>\n  project that leverages\n  <a href=\"https://github.com/decalage2/oletools/tree/master/oletools\" rel=\"nofollow noreferrer\">\n   OLETools\n  </a>\n  , and attempts to decode the p-code.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "ThunderFrame",
            "time": "Jun 28, 2017 at 0:27",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ubnix",
                    "text": "<span class=\"comment-copy\">Great answer! I wasn't aware of this at all. Do you maybe know of any good papers/sites where I could read more about this? Also, if you know of any hashes or have samples showing the 2 different states I haven't covered, I would be very grateful</span>",
                    "time": null
                },
                {
                    "user": "ThunderFrame",
                    "text": "<span class=\"comment-copy\">In addition to the README.md on the pcodedmp project, there's an <a href=\"https://www.virusbulletin.com/uploads/pdf/magazine/2005/200501.pdf\" rel=\"nofollow noreferrer\">article from 2005</a> by the same author. Evidently more detail is available from MS if you sign an NDA. With just a hex editor, it is possible to find and edit a string literal (change the characters, not the length) in the p-code section of a file, and then open the file in VBE, and you'll see the p-code version of the string literal appears in the code-pane, and not the source-code's string-literal.</span>",
                    "time": null
                }
            ]
        }
    ]
}