{
    "title": "What makes CDMs such as Widevine hard to reverse engineer?",
    "link": "https://reverseengineering.stackexchange.com/questions/15671/what-makes-cdms-such-as-widevine-hard-to-reverse-engineer",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  According to\n  <a href=\"https://storage.googleapis.com/wvdocs/Widevine_DRM_Architecture_Overview.pdf\" rel=\"noreferrer\">\n   this PDF\n  </a>\n  , Widevine has three security levels. The least secure one, and the one used by Chrome on desktops is level 3 in which all decryption is done outside of a Trusted Execution Environment.\n </p>\n <p>\n  But in that case, what stops someone from opening the Widevine Chrome plugin in IDA and following the video data until they get to whatever function that decrypts it and then write their own implementation of Widevine that just saves the output to a file instead of rendering it?\n </p>\n <p>\n  The PDF does say that \"appropriate measures may be taken to protect the cryptographic information and decrypted content on host operating system,\" but things like video games also use various protection systems, but these still get cracked with some effort.\n </p>\n <p>\n  So, why hasn't Widevine been cracked yet?\n </p>\n</div>\n</body></html>",
    "votes": "12",
    "answers": 1,
    "views": "6k",
    "tags": [
        "ida",
        "disassembly"
    ],
    "user": "abcd",
    "time": "Jun 26, 2017 at 6:02",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n what is \"CDM\"? did you look at the implementation and where it takes the keys from?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm guessing that the reason that Widevine hasn't been cracked yet (or at least not that I know of), is that there are much easier solutions out there for bypassing CDM restrictions than cracking Widevine itself.\n </p>\n <p>\n  For instance, you mentioned Chrome's Level 3 Security (no TEE hardware support required). It is well known that the browser itself can be modified to violate any content restrictions that may exist.\n </p>\n <blockquote>\n  <p>\n   \"Chrome has long been an open-source project and developers have been able to create their own versions of the browser that, for example, may use a different CDM or include modified CDM rendering paths,\" the spokesman wrote WIRED in an email.\n  </p>\n  <p>\n   <a href=\"https://www.wired.com/2016/06/bug-chrome-makes-easy-pirate-movies/\" rel=\"nofollow noreferrer\">\n    https://www.wired.com/2016/06/bug-chrome-makes-easy-pirate-movies/\n   </a>\n  </p>\n </blockquote>\n <p>\n  It is possible to start with Chrome's open source project, Chromium, and modify the rendering pipeline to redirect video content to other sinks besides the screen. I assume this is how many pirating tools have been developed as well.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Ryan Hunt",
            "time": "Feb 27, 2018 at 0:59",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ryan Kozak",
                    "text": "<span class=\"comment-copy\">Chromium doesn't include the Widevine Content Decryption Module. This module is closed source, and included with the main stream Google Chrome distribution. So, it's not quite that easy. <a href=\"https://unix.stackexchange.com/questions/172364/netflix-works-on-chrome-but-not-chromium#172366\">Better post describing stuff</a></span>",
                    "time": null
                },
                {
                    "user": "Ryan Hunt",
                    "text": "<span class=\"comment-copy\">That is correct, although it is not difficult to build Chromium from source with the Widevine Content Decryption Module included.  <a href=\"http://www.linuxfromscratch.org/blfs/view/cvs/xsoft/chromium.html\" rel=\"nofollow noreferrer\">linuxfromscratch.org/blfs/view/cvs/xsoft/chromium.html</a></span>",
                    "time": null
                }
            ]
        }
    ]
}