{
    "title": "IDA Proximity viewer not finding obvious paths?",
    "link": "https://reverseengineering.stackexchange.com/questions/1572/ida-proximity-viewer-not-finding-obvious-paths",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Using IDA 6.2 (and also with IDA 6.4), I'm trying out the Proximity viewer to find the path between 2 functions as described at the\n  <a href=\"http://www.hexblog.com/?p=468\" rel=\"nofollow noreferrer\">\n   hexblog post here\n  </a>\n  .\n </p>\n <p>\n  Using the\n  <code>\n   Xrefs From/To\n  </code>\n  (old option) it shows the clear path:\n  <code>\n   AllocateVolume\n  </code>\n  ->\n  <code>\n   VolumeSortCmp\n  </code>\n  ->\n  <code>\n   CompareVolumeComponents\n  </code>\n  as shown in the screenshot below\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/jLcRr.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"\" src=\"https://i.sstatic.net/h6BPH.png\" title=\"Hosted by imgur.com\"/>\n  </a>\n </p>\n <p>\n  Apart from the\n  <code>\n   add name\n  </code>\n  and\n  <code>\n   hide childs\n  </code>\n  options not existing in the context menu (as described in the blog) of the proximity browser as seen in the screenshot below\n  <a href=\"https://i.sstatic.net/eNVEB.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"\" src=\"https://i.sstatic.net/lpErR.png\" title=\"Hosted by imgur.com\"/>\n  </a>\n  the\n  <code>\n   find path\n  </code>\n  menu does list\n  <code>\n   CompareVolumeComponents\n  </code>\n  in the dialog that opens (so it has some knowledge of what is reachable).\n  <a href=\"https://i.sstatic.net/KGSOm.jpg\" rel=\"nofollow noreferrer\">\n  </a>\n </p>\n <p>\n  However when I press search I expected a nice clean graph (as again shown in the blog and added as reference below) showing only the the 3 relevant nodes, but instead nothing seems to change to the proximity browser layout as I still see 30 something nodes.\n </p>\n <p>\n  <strong>\n   Hexblog condensed\n   <code>\n    Find path\n   </code>\n   example result\n  </strong>\n  <img alt=\"hexblog condensed example result\" src=\"https://i.sstatic.net/2CeHx.png\"/>\n </p>\n <p>\n  <strong>\n   My result\n  </strong>\n  <img alt=\"enter image description here\" src=\"https://i.sstatic.net/WZO0I.png\"/>\n </p>\n <p>\n  Is the proximity viewer malfunctioning or are my expectations off? Or am i doing something wrong here?\n </p>\n</div>\n</body></html>",
    "votes": "6",
    "answers": 2,
    "views": "2k",
    "tags": [
        "ida"
    ],
    "user": "ixje",
    "time": "Apr 5, 2013 at 6:52",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I think that the problem is a misunderstanding of how the Proximity Viewer works. It will not clear out all the other nodes in the graph when finding a path: it simply finds a path and adds the required nodes to the graph. If you want to view only the nodes between AllocateVolume and CompareVolumeComponents, do the following:\n </p>\n <ol>\n  <li>\n   Navigate to AllocateVolume and press '-'.\n  </li>\n  <li>\n   Right click on the center node AllocateVolume and select \"Collapse  children\", then, \"Collapse parents\" as well.\n  </li>\n  <li>\n   Then, right click outside this node in the proximity view and select \"Add name\".\n  </li>\n  <li>\n   Find \"CompareVolumeComponents\" and add it.\n  </li>\n  <li>\n   After this step, right click on the AllocateVolume node, select \"Find Path\" and select the only other available node.\n  </li>\n </ol>\n <p>\n  If everything goes OK, you will have a graph with only the functions required to display a path from AllocateVolume to CompareVolumeComponents. If it does not, there may be some problem with the current code of the Proximity Viewer (in that case, please contact support at Hex-Rays for a fix). Also, you may want to take a look to the \"callgraph\" plugin in the SDK: the algorithm to find paths is pretty much the same and you may get an idea about why it isn't working.\n </p>\n <p>\n  As a side note, a little explanation of how the PV works: The algorithm does not consider a path only calls/jmps as (Q)WinGraph32 does (IIRC) but also consider a path when there are data references. If a function A references, in any way, function B, then the proximity viewer will show that reference (with a gray edge instead of a blue edge). BTW, I'm the guy who wrote it.\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "joxeankoret",
            "time": "Apr 5, 2013 at 8:36",
            "is_accepted": true,
            "comments": [
                {
                    "user": "ixje",
                    "text": "<span class=\"comment-copy\">thanks that explanation did the trick (like f.e. clicking outside the node for <code>add name</code>). I guess I need to experiment a bit more because I honestly thought I tried all the hiding options without success.  On a side node are you aware of any options dialog such that we can configure to find n-paths or all paths? As right now it finds just 1, not all. See <a href=\"http://i.imgur.com/2JQVckX.png\" rel=\"nofollow noreferrer\">single path</a> &amp; <a href=\"http://i.imgur.com/mvJ2HEe.png\" rel=\"nofollow noreferrer\">With manual help all paths</a> Otherwise I'll try hex-rays support.</span>",
                    "time": null
                },
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">@justsome Not yet. This is something that was discussed in Hex-Rays but, at least in the current public versions, is not implemented.</span>",
                    "time": null
                },
                {
                    "user": "Flip",
                    "text": "<span class=\"comment-copy\">Can't find \"Add name\" in IDA 6.8, tried clicking on the node, next to the node, on the icons, on the text. When is this suppose to show up?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  What your screenshot shows is not the proximity browser. It's the old Wingraph32 stuff that came already with the 5.x versions of IDA. See the attached picture for how the real thing looks:\n </p>\n <p>\n  <img alt=\"Proximity browser\" src=\"https://i.sstatic.net/RUipB.png\"/>\n  (direct\n  <a href=\"https://i.sstatic.net/RUipB.png\" rel=\"nofollow noreferrer\">\n   link to full size image\n  </a>\n  )\n </p>\n <p>\n  You can find it under\n  <code>\n   View\n  </code>\n  ->\n  <code>\n   Open subviews\n  </code>\n  ->\n  <code>\n   Proximity browser\n  </code>\n </p>\n <p>\n  Keep in mind that if you still use 6.2, there'll likely be a Qt version (\n  <code>\n   idaq.exe\n  </code>\n  ) and the old Windows GUI version (\n  <code>\n   idag.exe\n  </code>\n  ). You'll want the former for the proximity browser to work.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "0xC0000022L",
            "time": "Apr 4, 2013 at 19:40",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ixje",
                    "text": "<span class=\"comment-copy\">I know this is the Wingraph32, the title of the window in the screenshot also says so. That screenshot was also referring to the text above the screenshot (\"Xref to/from\"). I was trying to point out that the old Wingraph32 has a \"clear path\" while the new proximity browser (of which I did not add a screenshot) has a worse and more cluttered path.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@justsome: okay, this wasn't all too obvious from your question. Maybe you could add a screenshot and point out the parts that appear \"cluttered\" to you. The thing is that you can expand and nodes, zoom in and out around nodes. In this case please clarify your question and I'll try to answer it better.</span>",
                    "time": null
                },
                {
                    "user": "ixje",
                    "text": "<span class=\"comment-copy\">I've added all the pictures and rephrased some text to hopefully finally make my question unambiguous :-) I've also now tried it with IDA 6.4 to rule out the cause being an old version.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@justsome: I see one of the former Hex-Rays employees has answered your question better already. With the screenshots it was more obvious what you wanted.</span>",
                    "time": null
                },
                {
                    "user": "ixje",
                    "text": "<span class=\"comment-copy\">I intended to put screenshots like this in but time pressure forced me to only add one. Still thanks for the effort! -edit- for some reason I can't seem to start my comment with @0xC0000022L, it gets removed automatically..</span>",
                    "time": null
                }
            ]
        }
    ]
}