{
    "title": "Are reverse engineering and decompilation the same?",
    "link": "https://reverseengineering.stackexchange.com/questions/1596/are-reverse-engineering-and-decompilation-the-same",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Is reverse engineering an application the same as decompiling it?\n </p>\n <p>\n  What is the core difference between reverse engineering an application and decompiling an application.\n </p>\n</div>\n</body></html>",
    "votes": "5",
    "answers": 3,
    "views": "6k",
    "tags": [
        "decompilation"
    ],
    "user": "BlueBerry - Vignesh4303",
    "time": "Apr 5, 2013 at 14:23",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Decompilation is just one method of reverse engineering.\n </p>\n <p>\n  From the\n  <a class=\"post-tag\" href=\"/questions/tagged/decompilation\" rel=\"tag\" title=\"show questions tagged 'decompilation'\">\n   decompilation\n  </a>\n  description:\n </p>\n <blockquote>\n  <p>\n   Decompiling is the process of analyzing an executable or object code binary and outputting source code in a programming language such as C. The process involves translating a file from a low level of abstraction to a higher level of abstraction.\n  </p>\n  <p>\n   Decompilation is usually carried out using a decompiler.\n  </p>\n </blockquote>\n <hr/>\n <p>\n  From\n  <a href=\"http://en.wikipedia.org/wiki/Reverse_engineering\" rel=\"noreferrer\">\n   Wikipedia's article on reverse engineering\n  </a>\n  :\n </p>\n <blockquote>\n  <p>\n   Reverse engineering is the process of discovering the technological principles of a device, object, or system through analysis of its structure, function, and operation.\n  </p>\n </blockquote>\n <hr/>\n <p>\n  Software can be reverse engineered and decompiled. A lot of other things (such as hardware, door locks) can be reverse engineered but not decompiled, because their software/firmware is written in low level languages without a higher-level representation, or, more radically, they don't\n  <em>\n   have\n  </em>\n  any firmware in the first place.\n </p>\n</div>\n</body></html>",
            "votes": "11",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Reverse engineer is more general: you want to understand, in your own terms, what a binary does. E.g. this could lead to a description of what it does, maybe with a simulation of what (part of it) does. Decompile is to produce source code that (when compiled) gives you back the \"same\" binary, which is a much harder task in general.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Henno Brandsma",
            "time": "Apr 5, 2013 at 11:25",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Reverse Engineering is a broader term, of which, decompilation is simply one--albeit powerful--tool.  Decompilation is a form of static analysis which is investigating a program by not running it.  Don't forget that reverse engineering can also mean taking apart the device that's running a program.\n  <a href=\"http://arxiv.org/abs/0901.3482\" rel=\"nofollow\">\n   Some of my favorite exploits have dealt with using the property of some kinds of memories to continue holding values after the machine has been shut off.\n  </a>\n </p>\n <p>\n  A small, non-exhaustive list of techniques for reverse engineering:\n </p>\n <p>\n  <strong>\n   Static Analysis Techniques\n  </strong>\n </p>\n <p>\n  String analysis -->  Using a program like \"strings\" to discover any readable text in the binary.  On non-packed files, this can often tip you off as to what platform the binary was compiled in.  If the binary was compiled with symbols, you can even get access to variable names that the author had used, which can help in subsequent analysis.\n </p>\n <p>\n  Decompilation  -->  Cruder techniques might include unix tools like objdump, cracking open the binary in a hex editor, etc.\n </p>\n <p>\n  <strong>\n   Dynamic Analysis\n  </strong>\n </p>\n <p>\n  Fuzz Testing -->  Throwing multiple kinds of (possibly) invalid data to see how the application responds\n </p>\n <p>\n  Debugging  -->  Coupled with Fuzz testing above will let you see how the application is actually working on the level of registers && assembly.  (If using GDB or ollydbg.)\n </p>\n <p>\n  \"Eavesdropping\" on circuits or radiation emitted by a device-->  It's exotic, but\n  <a href=\"http://en.wikipedia.org/wiki/Van_Eck_phreaking\" rel=\"nofollow\">\n   it's real.\n  </a>\n </p>\n <p>\n  <strong>\n   Summary\n  </strong>\n  So decompilation is just one tool in the much broader kit of \"reverse engineering.\"\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "avgvstvs",
            "time": "Mar 10, 2014 at 13:56",
            "is_accepted": false,
            "comments": []
        }
    ]
}