{
    "title": "How can I view the dynamic symbol table of a running process?",
    "link": "https://reverseengineering.stackexchange.com/questions/16036/how-can-i-view-the-dynamic-symbol-table-of-a-running-process",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  For any dynamic executable on Linux there is a dynamic linker that stores the current symbol bindings somewhere. So when a new library is loaded it knows whether to bind the symbol or not.\n </p>\n <p>\n  For example when two shared objects contain the same symbol, the first one loaded will bind the symbol and subsequent loads won't rebind the symbol.\n </p>\n <p>\n  So this means there should be a register somewhere in memory that stores the current bindings. How can I access it? What format does it have? How portable is it (what's the chance my program that lists the symbols will work on other computers)?\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "linux",
        "symbols"
    ],
    "user": "Calmarius",
    "time": "Aug 8, 2017 at 13:32",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The structure holding the list of loaded shared objects is called\n  <a href=\"https://github.com/lattera/glibc/blob/master/include/link.h\" rel=\"nofollow noreferrer\">\n   <code>\n    link_map\n   </code>\n  </a>\n  and is stored inside the dynamic linker (rtld or ld.so, depending on the platform).\n </p>\n <p>\n  AFAIK there is no official standard for it but the most common implementation (glibc) uses the\n  <code>\n   GOT[1]\n  </code>\n  entry to store a pointer to the link map and the PLT stubs passes it to the dynamic symbol resolver (by jumping to the address in\n  <code>\n   GOT[2]\n  </code>\n  ).\n </p>\n <p>\n  Here's a great article giving the overview of all this as well as more references to other places:\n </p>\n <p>\n  <a href=\"http://s.eresi-project.org/inc/articles/elf-rtld.txt\" rel=\"nofollow noreferrer\">\n   http://s.eresi-project.org/inc/articles/elf-rtld.txt\n  </a>\n </p>\n <p>\n  I would recommend you installing symbols+sources for glibc and stepping through the dynamic calls in gdb to see how they're resolved, or even just reading the source code \"offline\".\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Aug 9, 2017 at 8:17",
            "is_accepted": false,
            "comments": []
        }
    ]
}