{
    "title": "Modified dll works as original without debugger attached",
    "link": "https://reverseengineering.stackexchange.com/questions/16133/modified-dll-works-as-original-without-debugger-attached",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to make some changes to .Net dll (note: dll is mixed mode module) used by an exe, ProtectionID detected nothing, so I happily jumped into dnSpy and made changes.\n </p>\n <p>\n  I ran executable with dnSpy debugger and everything was working as expected. However when I saved module and tried to run executable, it worked as if no changes were made.\n </p>\n <p>\n  I double checked, but module saved correctly, and x64dbg shows that it is loaded on runtime. So how is this possible?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "390",
    "tags": [
        ".net"
    ],
    "user": "K. Kowalczyk",
    "time": "Aug 18, 2017 at 18:42",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n are you sure your changes were actually saved? compare the saved file against the original\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "K. Kowalczyk",
            "text": "<html><body><span class=\"comment-copy\">\n yeah, changes were saved, saved file is also ~30% bigger, but so far all files I saved with dnSpy were 10-30% bigger. I even opened modified dll in Reflector instead, changes are there. they just don't seem to affect execution if I don't use dnSpy debugger.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n I think we need a bit more info. What arę the changes you've made? Are they for sure executed always? Are you sure that the dll is loaded from where you put the new one - check ProcessMonitor log.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "K. Kowalczyk",
            "text": "<html><body><span class=\"comment-copy\">\n @PawełŁukasik Huh I think I found a reason, it appears to use native images. I'm not sure if I can generate modified native image without source, especially if it's mixed-mode module.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "mrexodia",
            "text": "<html><body><span class=\"comment-copy\">\n Did you check the GAC?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Found the reason and I feel quite retarded now since it was so obvious. It was NativeImage being loaded and removing all generated images actually made my changes load. Thanks @PawełŁukasik for pointing me in right direction.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "K. Kowalczyk",
            "time": "Aug 19, 2017 at 13:08",
            "is_accepted": true,
            "comments": []
        }
    ]
}