{
    "title": "I Need to force windows to the front So I can dump Hasp Dongle on program that runs at boot",
    "link": "https://reverseengineering.stackexchange.com/questions/16202/i-need-to-force-windows-to-the-front-so-i-can-dump-hasp-dongle-on-program-that-r",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to dump a hasp dongle on a popular arcade machine. I can only get a portion with the game not running. If I ctrl alt del while game is already running I get a memory crash. What is the best way to proceed? Is there a way to get my dumper or even a cmd window forced to the front? Arcade game uses windows XP sp3.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 2,
    "views": "172",
    "tags": [
        "windows"
    ],
    "user": "roger",
    "time": "Aug 28, 2017 at 14:04",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n can you boot from a cd/usb flash?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n what about Ctrl-Shift-Esc?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "roger",
            "text": "<html><body><span class=\"comment-copy\">\n I can boot from hirens boot cd and edit registry. I can even start programs from the registry, but they sit underneath. I need to enter my hasp key and change a drop down then click dump to get my dongles mem dump. (can terminate program while it counts down to start using task manager, but I need dump while its running. when it starts it fills screen) Is there a syntax perhaps to force dumper on top via registry? Ctrl-Shift-Esc is a no go as well.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "roger",
            "text": "<html><body><span class=\"comment-copy\">\n Anyone? If i can just get to my window I can do what I need to do.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you are able to run an application, this\n  <a href=\"http://owl-black.net/479-how-to-change-z-order-of-a-window\" rel=\"nofollow noreferrer\">\n   C# example will get you started\n  </a>\n  . It will allow you to change the z-order of the application automatically, by calling\n  <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms633545(v=vs.85).aspx\" rel=\"nofollow noreferrer\">\n   SetWindowPos\n  </a>\n  with HWND_BOTTOM as the parameter.\n </p>\n <p>\n  This will send the topmost window to the bottom of the z-order and you should be able to place new windows above it.\n </p>\n <p>\n  You need to identify the window handle of the topmost application (if you know the title of the application window, you can use\n  <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms633499(v=vs.85).aspx\" rel=\"nofollow noreferrer\">\n   FindWindow\n  </a>\n  ), or you can find the window handle by using\n  <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms633497(v=vs.85).aspx\" rel=\"nofollow noreferrer\">\n   EnumWindows\n  </a>\n  and\n  <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms633517(v=vs.85).aspx\" rel=\"nofollow noreferrer\">\n   GetWindowModuleFileName\n  </a>\n </p>\n <p>\n  This will require you to be able to execute an application on startup. However since you said you are able to edit the registry you could put this executable on the system and set it to run at user logon, shortly after the launch of the application you are interested in.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Mick",
            "time": "Aug 28, 2017 at 17:13",
            "is_accepted": false,
            "comments": [
                {
                    "user": "roger",
                    "text": "<span class=\"comment-copy\">I am not sure how I would run any of this to find the window name, is there a good program that can run in the background and catch the info, and send to a log file?</span>",
                    "time": null
                },
                {
                    "user": "Mick",
                    "text": "<span class=\"comment-copy\">Use <code>EnumWindows</code> and <code>GetWindowModuleFileName</code> to (1) retrieve every Window visible on screen, and then pass that window handle to <code>GetWindowModuleFileName</code> to get the path to its executable. Then compare it to the known path to the executable you are expecting. If you have a match, then you know you have the correct Window handle. Then you can pass it to SetWindowsPos with HWND_BOTTOM parameter. You'll have to modify the linked C# example (or write your own application) to accomplish this.</span>",
                    "time": null
                },
                {
                    "user": "roger",
                    "text": "<span class=\"comment-copy\">ok thx, I will download visual studio and give it a go</span>",
                    "time": null
                },
                {
                    "user": "roger",
                    "text": "<span class=\"comment-copy\">I am thinking it will probably crash just like when I ctrl alt del and it looses the focus. Not sure what will prevent that. There is an entry in its registry ForegroundLock Timeout with a hex value of 30d40 might that be of any help?</span>",
                    "time": null
                },
                {
                    "user": "roger",
                    "text": "<span class=\"comment-copy\">Yeah the window method did not work, it simply crashed the game again. I have no issue disabling the game. I was able to dump the dongle key by stoping the game. Problem is I am only getting a partial dump. The stuff thats in the memory that I need is comming up all zero's.. The particular dumper that is working for me is GUI only as far as I can tell. I looked for command line options but did not find any. That would be too easy lol. I will check out this Autoit. If its capable of selecting drop down menus, entering text fields (for keys) and hitting the dump button that would be nice</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This is more of a\n  <a href=\"https://superuser.com/\">\n   SuperUser\n  </a>\n  question, but if you can boot from CD and edit the registry the following options come to mind:\n </p>\n <ul>\n  <li>\n   <p>\n    boot into a WinPE environment, hopefully it will be enough to run the dumper\n   </p>\n  </li>\n  <li>\n   <p>\n    Find where the game is started and disable it; this should allow you to run the dumper unimpeded\n   </p>\n  </li>\n  <li>\n   <p>\n    figure out if the dumper has commandline options for automatic dumping and use them to dump without the UI\n   </p>\n  </li>\n  <li>\n   <p>\n    use something like AutoIt to manipulate Dumper's UI to perform its work.\n   </p>\n  </li>\n </ul>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Aug 28, 2017 at 20:25",
            "is_accepted": false,
            "comments": [
                {
                    "user": "roger",
                    "text": "<span class=\"comment-copy\">Yeah the window method did not work, it simply crashed the game again with a memory address could not be written error. I have no issue disabling the game. I was able to dump the dongle key by stoping the game. Problem is I am only getting a partial dump. The stuff thats in the memory that I need is comming up all zero's...</span>",
                    "time": null
                },
                {
                    "user": "roger",
                    "text": "<span class=\"comment-copy\">Also, I cannot install anything on the machine directly, It will simply delete it apon reboot, or will fail to install. I can put programs on via another computer, and run them through the registry. Any dumping I do has to be done via a flash drive, or it will not be there</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">sounds like you need support from the dumper's author, I don't see how we can help here. It all seems to have very little to do with RE itself anyway.</span>",
                    "time": null
                }
            ]
        }
    ]
}