{
    "title": "Knowledge about CPU hardware",
    "link": "https://reverseengineering.stackexchange.com/questions/16296/knowledge-about-cpu-hardware",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Recently, I have taken the computer organization course that explains in the logic gate level how a CPU works and etc...\n </p>\n <p>\n  Up until now I have been treating the CPU as a black box that runs assembly instructions, even when I was learning in my free time about cracking, and doing exploits, and reverse engineering in general.\n </p>\n <p>\n  But that got me wondering, in the security field, how much research is being done using or combining CPU bugs, like software bugs, and using it to run code remotely or do other stuff.\n </p>\n <p>\n  Do reverse engineers, who try to find computer exploits, gain an advantage if they know the internal implementation of the CPU? Down to the logic gate level of course, not just the high level components.\n </p>\n</div>\n</body></html>",
    "votes": "23",
    "answers": 4,
    "views": "4k",
    "tags": [
        "disassembly",
        "assembly",
        "hardware",
        "exploit"
    ],
    "user": "user4906231",
    "time": "Sep 8, 2017 at 12:21",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  To extend the answer of perror:\n </p>\n <p>\n  Perhaps you should take a look into a recently published whitepaper named\n  <strong>\n   Breaking the x86 ISA\n  </strong>\n  , by Christopher Domas. It was published on blackhat17 and describes an approach for digging into x86 chips and extracting hidden machine instructions.\n </p>\n <blockquote>\n  <p>\n   <strong>\n    Title:\n   </strong>\n  </p>\n  <p>\n   <em>\n    Breaking the x86 ISA\n   </em>\n  </p>\n  <p>\n   <strong>\n    Abstract:\n   </strong>\n  </p>\n  <p>\n   A processor is not a trusted black box for running code; on the\ncontrary, modern x86 chips are packed full of secret instructions and\nhardware bugs. In this paper, we demonstrate how page fault analysis\nand some creative processor fuzzing can be used to exhaustively search\nthe x86 instruction set and uncover the secrets buried in a chipset.\nThe approach has revealed critical x86 hardware glitches, previously\nunknown machine instructions, ubiquitous software bugs, and flaws in\nenterprise hypervisors.\n  </p>\n  <p>\n   <strong>\n    Author:\n   </strong>\n   Christopher Domas\n  </p>\n  <p>\n   <a href=\"https://www.blackhat.com/docs/us-17/thursday/us-17-Domas-Breaking-The-x86-Instruction-Set-wp.pdf\" rel=\"noreferrer\">\n    https://www.blackhat.com/docs/us-17/thursday/us-17-Domas-Breaking-The-x86-Instruction-Set-wp.pdf\n   </a>\n  </p>\n  <p>\n   <strong>\n    Related Resources:\n   </strong>\n  </p>\n  <ul>\n   <li>\n    <a href=\"https://github.com/xoreaxeaxeax/sandsifter\" rel=\"noreferrer\">\n     https://github.com/xoreaxeaxeax/sandsifter\n    </a>\n   </li>\n  </ul>\n </blockquote>\n <p>\n  Somehow related microcode-internals from academia:\n </p>\n <blockquote>\n  <p>\n   <strong>\n    Title:\n   </strong>\n  </p>\n  <p>\n   <em>\n    Reverse Engineering x86 Processor Microcode\n   </em>\n  </p>\n  <p>\n   <strong>\n    Abstract:\n   </strong>\n   Microcode is an abstraction layer on top of the physical\ncomponents of a CPU and present in most generalpurpose\nCPUs today. In addition to facilitate complex and\nvast instruction sets, it also provides an update mechanism\nthat allows CPUs to be patched in-place without requiring\nany special hardware. While it is well-known that CPUs\nare regularly updated with this mechanism, very little is\nknown about its inner workings given that microcode and\nthe update mechanism are proprietary and have not been\nthroughly analyzed yet.\nIn this paper, we reverse engineer the microcode semantics\nand inner workings of its update mechanism of conventional\nCOTS CPUs on the example of AMD’s K8 and\nK10 microarchitectures. Furthermore, we demonstrate\nhow to develop custom microcode updates. We describe\nthe microcode semantics and additionally present a set of\nmicroprograms that demonstrate the possibilities offered\nby this technology. To this end, our microprograms range\nfrom CPU-assisted instrumentation to microcoded Trojans\nthat can even be reached from within a web browser\nand enable remote code execution and cryptographic implementation\nattacks.\n  </p>\n  <p>\n   <strong>\n    Author:\n   </strong>\n   Philipp Koppe, Benjamin Kollenda, Marc Fyrbiak, Christian Kison, Robert Gawlik, Christof Paar, and Thorsten Holz\n  </p>\n  <p>\n   <a href=\"http://syssec.rub.de/media/emma/veroeffentlichungen/2017/08/16/usenix17-microcode.pdf\" rel=\"noreferrer\">\n    http://syssec.rub.de/media/emma/veroeffentlichungen/2017/08/16/usenix17-microcode.pdf\n   </a>\n  </p>\n  <p>\n   <strong>\n    Related Work/Reads\n   </strong>\n   :\n  </p>\n  <ul>\n   <li>\n    <p>\n     <a href=\"http://inertiawar.com/microcode/\" rel=\"noreferrer\">\n      http://inertiawar.com/microcode/\n     </a>\n    </p>\n   </li>\n   <li>\n    <p>\n     <a href=\"https://argp.github.io/2017/09/14/re-x86-microcode/\" rel=\"noreferrer\">\n      https://argp.github.io/2017/09/14/re-x86-microcode/\n     </a>\n    </p>\n   </li>\n  </ul>\n </blockquote>\n <p>\n  EDIT: I added the reference mentioned by Dan.\n </p>\n <blockquote>\n  <p>\n   <strong>\n    Title:\n   </strong>\n  </p>\n  <p>\n   Page Fault Liberation Army or Gained in Translation: a history of creative x86 virtual memory uses\n  </p>\n  <p>\n   <strong>\n    Abstract:\n   </strong>\n  </p>\n  <p>\n   x86 processors contain a surprising amount of built-in memory translation logic, which is driven by various data tables with intricate entry formats, and can produce various kinds of traps and other interesting computational effects. These features are mostly relics of earlier, more civilized times, when Jedi Knights tried to protect the Old Republic OSes with segmentation, supervisor bits, and hardware task support, but were defeated by processor de-optimizations and performance concerns and left unused by both Windows and UNIX systems – and explored only by hackers. For the rest of the world, an x86 PC was a \"von Neumann architecture\" with most of its strangeness unused.\n  </p>\n  <p>\n   <strong>\n    Author:\n   </strong>\n   Julian Bangert and Sergey Bratus\n  </p>\n  <p>\n   <a href=\"https://media.ccc.de/v/29c3-5265-en-page_fault_liberation_army_h264\" rel=\"noreferrer\">\n    https://media.ccc.de/v/29c3-5265-en-page_fault_liberation_army_h264\n   </a>\n  </p>\n </blockquote>\n <p>\n  EDIT: I added the recently published\n  <strong>\n   spectre\n  </strong>\n  or\n  <strong>\n   meltdown\n  </strong>\n  attack, which exploits critical vulnerabilities in modern processors.\n </p>\n <blockquote>\n  <p>\n   <strong>\n    Title:\n   </strong>\n  </p>\n  <p>\n   Meltdown and Spectre: Bugs in modern computers leak passwords and sensitive data\n  </p>\n  <p>\n   <strong>\n    TLDR:\n   </strong>\n  </p>\n  <p>\n   Meltdown and Spectre exploit critical vulnerabilities in modern processors. These hardware bugs allow programs to steal data which is currently processed on the computer. While programs are typically not permitted to read data from other programs, a malicious program can exploit Meltdown and Spectre to get hold of secrets stored in the memory of other running programs. This might include your passwords stored in a password manager or browser, your personal photos, emails, instant messages and even business-critical documents.\n  </p>\n  <p>\n   <strong>\n    Paper:\n   </strong>\n  </p>\n  <p>\n   <a href=\"https://meltdownattack.com/meltdown.pdf\" rel=\"noreferrer\">\n    https://meltdownattack.com/meltdown.pdf\n   </a>\n  </p>\n  <p>\n   <a href=\"https://spectreattack.com/spectre.pdf\" rel=\"noreferrer\">\n    https://spectreattack.com/spectre.pdf\n   </a>\n  </p>\n  <p>\n   <strong>\n    Related Resources:\n   </strong>\n  </p>\n  <ul>\n   <li>\n    <p>\n     <a href=\"https://googleprojectzero.blogspot.de/2018/01/reading-privileged-memory-with-side.html?m=1\" rel=\"noreferrer\">\n      https://googleprojectzero.blogspot.de/2018/01/reading-privileged-memory-with-side.html?m=1\n     </a>\n    </p>\n   </li>\n   <li>\n    <p>\n     <a href=\"http://pythonsweetness.tumblr.com/post/169166980422/the-mysterious-case-of-the-linux-page-table\" rel=\"noreferrer\">\n      http://pythonsweetness.tumblr.com/post/169166980422/the-mysterious-case-of-the-linux-page-table\n     </a>\n    </p>\n   </li>\n   <li>\n    <p>\n     <a href=\"https://lkml.org/lkml/2017/12/27/2\" rel=\"noreferrer\">\n      https://lkml.org/lkml/2017/12/27/2\n     </a>\n    </p>\n   </li>\n   <li>\n    <p>\n     <a href=\"https://gruss.cc/files/kaiser.pdf\" rel=\"noreferrer\">\n      https://gruss.cc/files/kaiser.pdf\n     </a>\n    </p>\n   </li>\n   <li>\n    <p>\n     <a href=\"https://lwn.net/Articles/741878/\" rel=\"noreferrer\">\n      https://lwn.net/Articles/741878/\n     </a>\n    </p>\n   </li>\n   <li>\n    <p>\n     <a href=\"https://lwn.net/Articles/738975/\" rel=\"noreferrer\">\n      https://lwn.net/Articles/738975/\n     </a>\n    </p>\n   </li>\n  </ul>\n </blockquote>\n</div>\n</body></html>",
            "votes": "25",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Dan Mills",
                    "text": "<span class=\"comment-copy\">And then there was this from a couple of years back: <a href=\"https://media.ccc.de/v/29c3-5265-en-page_fault_liberation_army_h264\" rel=\"nofollow noreferrer\">media.ccc.de/v/29c3-5265-en-page_fault_liberation_army_h264</a> Seems the page fault mechanisms interaction with the MMU on X86 is actually Turing complete.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  In fact, the CPU are much more checked and verified than programs. It is very unlikely to find a (significant) bug in a CPU. Even though it happens from time to time.\n </p>\n <p>\n  Therefore, it is much more interesting to look at software bugs (because they are more likely) than hardware bugs.\n </p>\n <p>\n  Yet, you have a few occurrences of hardware bugs that led to disclosure of some \"secrets\". The most famous one being probably the one from the Bell company (the 2600Hz bug).\n </p>\n <p>\n  Basically, this bug was coming from the fact that they were two types of signals transmitted between the phone booth and the telecommunication central. The\n  <em>\n   command signals\n  </em>\n  and the\n  <em>\n   voice signals\n  </em>\n  :\n </p>\n <ul>\n  <li>\n   <p>\n    <strong>\n     Command signals\n    </strong>\n    : They were used to send commands such as the destination of the phone call (phone number), the start/end of the communication, the amount of coins payed, and so on.\n   </p>\n  </li>\n  <li>\n   <p>\n    <strong>\n     Voice signals\n    </strong>\n    : They were used to encode the audio signal of the phone communication.\n   </p>\n  </li>\n </ul>\n <p>\n  All these signals were encoded into an electrical signals and sent from the phone booth to the central. The problem was coming from the fact that the encoding module from the\n  <em>\n   voice signals\n  </em>\n  was not strictly bounded to usual human voice frequencies. One could produce an unusual sound in the phone and get an encoding that would be understood as a\n  <em>\n   command signal\n  </em>\n  by the central.\n </p>\n <p>\n  In fact, one hacker did realize that if you produced a sound of 2600Hz, the audio encoding of this signal was corresponding to a\n  <em>\n   command signal\n  </em>\n  of a long-distance call (it was as if you inserted a coin of 25 cents in the phone booth). And, by an extraordinary coincidence, at this time a brand of cereals (for kids' breakfast), called \"\n  <em>\n   Cap'n Crunch\n  </em>\n  \", was offering to his customers a whistle that was producing a sound of this exact same frequency.\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/PpRq3.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/PpRq3.jpg\"/>\n  </a>\n </p>\n <p>\n  At this time, these cereal boxes became very popular and the phone company did loose a bit of money. :-)\n </p>\n</div>\n</body></html>",
            "votes": "9",
            "user": "perror",
            "time": "Sep 8, 2017 at 17:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "David",
                    "text": "<span class=\"comment-copy\">Although you may not (easily) find an actual implementation error in a modern CPU there is lots to be gained in the security field by understanding the many complex interactions between system parts, corners of the instruction set and newer implementations like TPM.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Modern microprocessors are quite complex, but probably can be represented in fewer lines of code than an OS plus libs, etc. (Although one would be coded in Verilog and the other in C.) Nonetheless, the complexity is so great that having source code wouldn't be of much benefit.\n </p>\n <p>\n  If we focus on instruction execution (vs peripheral functions like memory management), functionality is quite well defined, and therefore easy to verify. Moreover, the cost of a mistake is quite high--you can't simply push out a patch like you can in software. Therefore, designs are simulated for days before being taped out, and there are even formal methods to prove that every part of the chip has been exercised.\n </p>\n <p>\n  However, the amount of state held by a CPU is astronomical. A bug where the CPU jumped to the wrong instruction all the time would be quickly found. The reality is that there could be a rare sequence of events--perhaps not even easily reproducible given the stochastic nature of out-of-order processors--that leads to misbehavior. Such bugs would also be hard to exploit.\n </p>\n <p>\n  There are indeed bugs found after tape out. Most processors have an errata sheet, and few designs go to production on A0 (one full tape out, no metal fixes) silicon. But, I mostly see bugs or design gaps in peripheral functions. For an example list of bugs, search for something like \"Skylake errata.\"\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Joseph Byrne",
            "time": "Sep 9, 2017 at 1:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Bob",
                    "text": "<span class=\"comment-copy\"><i>&gt; you can't simply push out a patch like you can in software</i> — Not so true anymore; many higher-level CPU bugs can be (and often are) fixed with microcode updates applied either via the OS or via motherboard firmware updates. Especially the OS updates are not much different from any other OS/driver update.</span>",
                    "time": null
                },
                {
                    "user": "tonysdg",
                    "text": "<span class=\"comment-copy\"><i>microcode updates applied either via the OS</i> ... which ironically opens up even more opportunities for security problems.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  As a very specific example, I'm sure you could take the recently acknowledged SKL150 erratum and build an exploit on top of it that could tunnel through verification systems, JIT-compiled langauges, etc, since it breaks the basic assumption that the processor behaves as designed.\n </p>\n <p>\n  The \"symptom\" of SKL150 as reported was crashing, but that's only because the affected value was a pointer which became invalid, but you could equally use all the the regular techniques to exploit it instead. Of course, this is probably at the 9 out of 10 difficulty level.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "BeeOnRope",
            "time": "Sep 9, 2017 at 23:24",
            "is_accepted": false,
            "comments": []
        }
    ]
}