{
    "title": "STL map and map entry structures for IDA/HexRays",
    "link": "https://reverseengineering.stackexchange.com/questions/16486/stl-map-and-map-entry-structures-for-ida-hexrays",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have several binaries (Visual Studio 2005, amd64/x86_64) that I need a portion of each reversed in order to better understand the reasons for their malfunction in certain edge cases (they are long since unmaintained, there is nowhere to get support by now).\n </p>\n <p>\n  These binaries do not make use of 3rd party libraries, only VC++ runtime and Win32 API and hence make heavy use of STL containers.\n </p>\n <p>\n  It was quite easy to create general-purpose IDA\n  <code>\n   struct\n  </code>\n  definitions for things like\n  <code>\n   std::vector\n  </code>\n  or\n  <code>\n   std::string\n  </code>\n  . However, these binaries do have plenty of\n  <code>\n   std::map\n  </code>\n  usages, and well, the way msvc generates assembly for\n  <code>\n   std::map\n  </code>\n  s is particularly annoying.\n </p>\n <p>\n  Namely, the whole binary is stuffed with countless methods to allocate map entries (one method per\n  <code>\n   map<k, v>\n  </code>\n  ), the entries all have different sizes, with the entry structure having the same few fields at the beginning and the end and a variable sized middle part. All the methods that are used on a particular map (e.g.\n  <code>\n   find\n  </code>\n  ) are thus then generated with regards to these entry types, so it is a huge pain to manage this.\n </p>\n <p>\n  I can infer the underlying logic in many cases where a map is being accessed, but I still would prefer to have a struct/many structs for better readability, preferably not needing to\n  <em>\n   manually\n  </em>\n  define literally all of the different structs.\n </p>\n <p>\n  If someone could share their own experience/findings related to reversing a large amount of\n  <code>\n   std::map\n  </code>\n  s efficiently, that would be great.\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 0,
    "views": "2k",
    "tags": [
        "ida",
        "c++",
        "hexrays",
        "msvc"
    ],
    "user": "Tadas S",
    "time": "Oct 5, 2017 at 18:28",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n welcome to the horrors of template-based programming! :)\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Tadas S",
            "text": "<html><body><span class=\"comment-copy\">\n Somehow, I expected there might be no better option. Still, one can hope :). Noticed that I somehow forgot to add compiler info. - that's fixed now.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ray",
            "text": "<html><body><span class=\"comment-copy\">\n Related:\n <a href=\"https://reverseengineering.stackexchange.com/questions/3889/find-the-c-stl-functions-in-a-binary\" title=\"find the c stl functions in a binary\">\n  reverseengineering.stackexchange.com/questions/3889/…\n </a>\n And yeah, I don't know any automagics here to help you too. I always write code using the STL methods that come in question, compile it with the exact same toolchain as the original executable, hope they didnt use whole program optimizations, and compare both. It's tiresome, repetitive, and unthankful work, but if some code really breaks your mind, the only way to help you out of the dire situations.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}