{
    "title": "Getting the correct memory address for a specific value",
    "link": "https://reverseengineering.stackexchange.com/questions/16668/getting-the-correct-memory-address-for-a-specific-value",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I was watching this series of videos and I noticed that his memory addresses were not changing every time he restarted the game and/or olly. In addition, his comments seemed to stick around and he was able to easily find where he had been working previously.\n  <a href=\"https://www.youtube.com/watch?v=BHYjxsDROn4&t=8s\" rel=\"nofollow noreferrer\">\n   https://www.youtube.com/watch?v=BHYjxsDROn4&t=8s\n  </a>\n </p>\n <p>\n  I am also trying to grab specific memory addresses and write a basic program that allows me to change them by writing to them externally, but every time I try to do it the memory address changes. I realize that memory is dynamic and this is supposed to happen, but I don't understand why it was not happening to him. Is it just because it is an older video and that's how it used to work, or am I missing something. In addition, in order to do it now I assume I need to somehow get the offset from the base address. Every video I watch about doing this refers to finding an offset for a pointer. Do only pointers maintain a static offset? If so, how do I find this in ollydbg?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "5k",
    "tags": [
        "ollydbg",
        "c++"
    ],
    "user": "3asssains",
    "time": "Oct 30, 2017 at 21:15",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Your your post contains multiple questions, I recommend separating them, and providing more details to them. My answer will be vague for this reason.\n </p>\n <p>\n  About the unchanging memory addresses, I assume what you are looking for is\n  <a href=\"https://en.wikipedia.org/wiki/Address_space_layout_randomization\" rel=\"nofollow noreferrer\">\n   ASLR\n  </a>\n  . Read\n  <a href=\"https://blogs.msdn.microsoft.com/winsdk/2009/11/30/how-to-disable-address-space-layout-randomization-aslr/\" rel=\"nofollow noreferrer\">\n   this\n  </a>\n  and\n  <a href=\"http://icompile.eladkarako.com/disable-aslr/\" rel=\"nofollow noreferrer\">\n   this\n  </a>\n  on the subject. As far as I know, you could use\n  <a href=\"https://support.microsoft.com/en-us/help/2458544/the-enhanced-mitigation-experience-toolkit\" rel=\"nofollow noreferrer\">\n   EMET\n  </a>\n  or patch the executable directly to disable ASLR, thus the addresses wont change.\n </p>\n <p>\n  Alternatively, you could use\n  <a href=\"https://reverseengineering.stackexchange.com/questions/4625/how-to-find-functions-in-games/4630#4630\">\n   other techniques\n  </a>\n  to find your address, even if its changing.\n </p>\n <p>\n  As for offsets, they are usually added to a static address, to it to access the objects field/property. The specific addresses and offsets obviously depends on what you are trying to do, and should be acquired from your executable, by observing it in a debugger.\n </p>\n <p>\n  For example:\n </p>\n <ul>\n  <li>\n   <p>\n    Lets assume that you found that the game has a\n    <code>\n     player\n    </code>\n    object in the memory (the location might change on every run).\n   </p>\n  </li>\n  <li>\n   <p>\n    Lets say that you found a static pointer an instance of the\n    <code>\n     player\n    </code>\n    object called \"pPlayer\", at this memory address:\n    <code>\n     0xAB1234\n    </code>\n    .\n   </p>\n  </li>\n  <li>\n   <p>\n    Lets also say that you know (because you reverse engineered the objects structure) that the\n    <code>\n     player\n    </code>\n    objects has a field containing the health points of your in-game character, stored as an integer, at the\n    <code>\n     0x16\n    </code>\n    offset.\n   </p>\n  </li>\n  <li>\n   <p>\n    By adding the found offset to the\n    <code>\n     player\n    </code>\n    object address (base address of the object), you will get the memory address containing the character's \ncurrent HP. And you could read it like this externally in your program or Cheat Engine:\n    <strong>\n     [[0xAB1234]+0x16]\n    </strong>\n    . In pseudo code it means that:\n   </p>\n   <p>\n    <code>\n     AddressOfPlayerObject = memory.Read(0xAB1234)\n    </code>\n   </p>\n   <p>\n    <code>\n     AddressOfHP = AddressOfPlayerObject + 0x16\n    </code>\n   </p>\n   <p>\n    <code>\n     PlayerHP = memory.Read(AddressOfHP)\n    </code>\n   </p>\n  </li>\n </ul>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Dominik Antal",
            "time": "Oct 31, 2017 at 13:18",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Dominik Antal",
                    "text": "<span class=\"comment-copy\">By the way, there are a lot of ready to use libraries for manipulating process memory on Windows. Just search \"memory hacking library\" on Google, or Github.  They will provide functions like ReadInt32, ReadString, etc... so you dont have to directly deal with Windows's ReadProcessMemory API.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The reason his memory addresses weren't changing\n  <em>\n   in that scenario\n  </em>\n  is because the game is 32-bit and loaded into memory conventionally per\n  <strong>\n   <a href=\"https://blogs.msdn.microsoft.com/oldnewthing/20141003-00/?p=43923\" rel=\"nofollow noreferrer\">\n    this\n   </a>\n  </strong>\n  and\n  <strong>\n   <a href=\"https://msdn.microsoft.com/en-us/library/ms809762.aspx\" rel=\"nofollow noreferrer\">\n    this\n   </a>\n  </strong>\n  (do a CTRL + F for 0x400000 and read the paragraph the first 2 results are located in).\n </p>\n <p>\n  You may also see addresses referenced by a symbol name, like ac_client.exe+5B2C0, where ac_client.exe references a base of 0x400000 plus the offset 0x5B2C0.\n </p>\n <p>\n  As for what you're trying to accomplish in C++, there are Windows functions you can use to identify a process and then acquire its base address. Then you can base offsets off that. If your addresses are changing every time you start the game, then as Dominik suggested, ASLR may be what you're dealing with. Or an anti-cheat/obfuscation implementation like Denuvo. Or a game utilizing something like JVM which can change addresses\n  <em>\n   and\n  </em>\n  sub-routine instructions with each restart.\n </p>\n <p>\n  Your options are commonly to reference a symbol name, find a base address + offset to reference, or identify a byte signature (aka \"array of bytes\") you can scan for--of which you then acquire an address to use either in and of itself, or as a reference point to base an offset from.\n </p>\n <p>\n  There's a lot more to all of this, but I\n  <em>\n   highly\n  </em>\n  recommend you pick up the book\n  <strong>\n   \"\n   <a href=\"https://www.nostarch.com/gamehacking\" rel=\"nofollow noreferrer\">\n    Game Hacking\n   </a>\n   \"\n  </strong>\n  . For what you're looking to do, it will impart quite a bit of wisdom to you that you'd otherwise spend hours upon hours trying to piece together via posts and videos. It also provides code snippets you need for things like acquiring the PID of a running process, etc.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "dsasmblr",
            "time": "Oct 31, 2017 at 15:44",
            "is_accepted": false,
            "comments": [
                {
                    "user": "3asssains",
                    "text": "<span class=\"comment-copy\">Thank you! I actually already bought that book and am currently reading through it!</span>",
                    "time": null
                }
            ]
        }
    ]
}