{
    "title": "What sources do you use for gaining information/intelligence about hardware products?",
    "link": "https://reverseengineering.stackexchange.com/questions/1681/what-sources-do-you-use-for-gaining-information-intelligence-about-hardware-prod",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  When reverse engineering consumer hardware products, it can often be helpful to gain as much information as possible outside of the device itself, including:\n </p>\n <ul>\n  <li>\n   Service manuals\n  </li>\n  <li>\n   Installation/User manuals\n  </li>\n  <li>\n   Circuit diagrams/block diagrams\n  </li>\n  <li>\n   Description of operation\n  </li>\n  <li>\n   Firmware images\n  </li>\n  <li>\n   Any PC-based utilities\n  </li>\n  <li>\n   Internal photographs\n  </li>\n </ul>\n <p>\n  I have found the following sources useful:\n </p>\n <ul>\n  <li>\n   The manufacturer's site, including using google site search to find \"hidden\" documents\n  </li>\n  <li>\n   Using specific google searches, e.g. limiting to PDF files and \"engineers code\"\n  </li>\n  <li>\n   Using google searches to find open directories (\"Parent directory\" finds these) containing manuals and other documentation\n  </li>\n  <li>\n   Using the\n   <a href=\"http://transition.fcc.gov/oet/ea/fccid/\">\n    FCC database\n   </a>\n   to find test results.\n  </li>\n  <li>\n   Finding any relevant patents\n  </li>\n </ul>\n <p>\n  Are there any other useful sources for finding out such information?\n </p>\n</div>\n</body></html>",
    "votes": "12",
    "answers": 2,
    "views": "660",
    "tags": [
        "hardware"
    ],
    "user": "Cybergibbons",
    "time": "Apr 9, 2013 at 12:14",
    "comments": [
        {
            "user": "Cybergibbons",
            "text": "<html><body><span class=\"comment-copy\">\n This might be a bit vague. I thought I would try it and see what the community thought.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "<html><body><span class=\"comment-copy\">\n You could separate the question and the answer into two parts. Its perfectly alright to answer your own quesion. See the\n <a href=\"https://reverseengineering.stackexchange.com/tour\">\n  FAQ\n </a>\n if you dont believe me :)\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n @Cybergibbons: rephrasing my question: is this only about\n <b>\n  electronic\n </b>\n hardware? A car is a \"consumer hardware products\", so is a bike or a microwave oven.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Cybergibbons",
            "text": "<html><body><span class=\"comment-copy\">\n No, it can be any hardware. The examples I have given only extend to electromechanical hardware though, nothing without any electronics. A lock or safe would be an example of something without electronics.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Not applicable to every device, but always worth checking if the company used any open source software in the design and look at the code provided.  Even if most of the device is proprietary, the open source code might have useful pointers towards basic hardware functionality or implementation details.\n </p>\n <p>\n  An example might be a manufacturer that has customized u-boot to function with their board and included a memory map of flash in the source.\n </p>\n <p>\n  On the google searches front, some chip manufacturers use a very predictable document number format that can be searched for, or use certain phrases that are very uncommon elsewhere, such as \"proprietary and confidential\" on all processor datasheets.\n </p>\n <p>\n  Finally, if a company is particularly stingy with technical details about their device, I expand my search to their business partners.  For example, a processor manufacturer identified that their products were used in Company X's products in marketing materials, even when no literature directly from Company X mentioned anything about what chip or architecture they were using.\n </p>\n</div>\n</body></html>",
            "votes": "6",
            "user": "nopnopgoose",
            "time": "Apr 9, 2013 at 14:05",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Cybergibbons",
                    "text": "<span class=\"comment-copy\">I like this answer. On the side of open source, I have found some companies are sneaky. HID Global use open source software, but charge over $100 to provide the software on a CD in the post. I am not sure of the legality of that.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@Cybergibbons: ask the FSF or the <a href=\"http://www.softwarefreedom.org/\" rel=\"nofollow noreferrer\">SFLC</a> for assistance. Also depends on the license, though. I for one have been trying for over a year to get Zyxel to provide the GPL'd sources to my router's firmware. Only last month I finally got a response.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Personally my experience is pretty much limited to attempts to reverse engineer electronic hardware, so I'll limit my answer to that area as well. What I've found useful is\n </p>\n <ul>\n  <li>\n   manufacturers aren't exactly the likeliest to provide too much useful information, but it's always worth to peak into manuals or check out their websites.\n  </li>\n  <li>\n   check on the web, but especially on Youtube and repair sites such as\n   <a href=\"http://www.ifixit.com/\" rel=\"nofollow noreferrer\">\n    ifixit.com\n   </a>\n   for instructions on how to non-destructively open a device. This usually goes already a long way in gathering additional intelligence about the device.\n  </li>\n  <li>\n   assuming you have firmware-upgradeable hardware (TV, router, etc.), you should check out the\n   <a href=\"http://code.google.com/p/firmware-mod-kit/\" rel=\"nofollow noreferrer\">\n    <code>\n     firmware-mod-kit\n    </code>\n   </a>\n   and the related\n   <a href=\"http://code.google.com/p/binwalk/\" rel=\"nofollow noreferrer\">\n    <code>\n     binwalk\n    </code>\n   </a>\n   to see what information you can retrieve from the firmware images.\n  </li>\n  <li>\n   even if you don't have a firmware, but the device you are accessing has some kind of network connectivity, you could set up a gateway with DHCP (I prefer Linux/Ubuntu for these cases) and check the ARP cache (command\n   <code>\n    arp\n   </code>\n   ) which will tell you the MAC address (can often be matched with the one printed on packaging or the device itself) and thereby find the IPv4 address handed out to it. From there on\n   <code>\n    nmap\n   </code>\n   ,\n   <code>\n    netcat\n   </code>\n   ,\n   <code>\n    telnet\n   </code>\n   and\n   <code>\n    tcpdump\n   </code>\n   /\n   <code>\n    libpcap\n   </code>\n   are your best friends. If it's wireless you can provide an access point that logs stuff and sniffs traffic and such.\n  </li>\n  <li>\n   if your device plugs into a port such as USB and you have a protocol analyzer (expensive stuff) things can get easier. But sometimes results aren't clear or you simply have no more than an oscilloscope to investigate the protocol.\n   <strong>\n    Beware\n   </strong>\n   of bus types such as PCMCIA and Thunderbolt where the device itself has access to your computer's memory and other resources. If the device is malicious it could spy on you or do other weird stuff. Or am I just too paranoid? After all you said consumer hardware :)\n   <ul>\n    <li>\n     on that note, a \"simple USB mouse\" could also pose as USB keyboard to the computer and perhaps USB storage and the keyboard would do fancy things like enter commands and execute stuff from the storage. So\n     <em>\n      never ever plug\n     </em>\n     a USB key you find into one of your devices unless you have a special test machine for the purpose.\n    </li>\n   </ul>\n  </li>\n  <li>\n   older hardware often comes with actual layouts for the PCBs etc, but rarely with an actual bill of materials. Still, it gives you some further clues. Older TV sets and those from reputable manufacturers tend to come with very detailed diagrams of their electronics where I come from.\n  </li>\n  <li>\n   once you manage to open it up the first thing you'll need in most cases is a magnifying glass ;)\n   <ul>\n    <li>\n     having that you can figure out whether there is a serial UART or\n     <a href=\"https://en.wikipedia.org/wiki/JTAG\" rel=\"nofollow noreferrer\">\n      JTAG\n     </a>\n     (contacts labeled TDI, TDO, TCK, TMS, TRST are easy to spot) or other kind of \"breakout\" possibility. JTAG isn't too useful if you don't know enough about the hardware to safely use boundary scan (voltage etc, you could actually fry your hardware before you get to see results).\n    </li>\n    <li>\n     labels on the chips/processors usually help a lot and then checking over at your local hobbyist website for tinkering with electronic devices.\n    </li>\n   </ul>\n  </li>\n </ul>\n <p>\n  That's it from me. My two cents. I'm sure there are a whole lot of things that I haven't considered in my own searches, so I'm looking forward to other answers.\n </p>\n <hr/>\n <p>\n  Yes, using search operators can work to your advantage, such as\n  <code>\n   inurl\n  </code>\n  ,\n  <code>\n   intitle\n  </code>\n  ,\n  <code>\n   filetype\n  </code>\n  and\n  <code>\n   site\n  </code>\n  on Google (e.g.\n  <code>\n   search terms intitle:index inurl:ftp\n  </code>\n  ). Unfortunately there doesn't seem to be a standard for search operators and especially meta search engines are very weak on that front, but also Google's competitors, which is sad. There is also one caveat with search operators on Google. You can read about it\n  <a href=\"https://webapps.stackexchange.com/questions/41458\">\n   in this question over on webapps.SE\n  </a>\n  .\n </p>\n</div>\n</body></html>",
            "votes": "6",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:57",
            "is_accepted": false,
            "comments": []
        }
    ]
}