{
    "title": "Using cheat engine to activate a modified version of a lua script",
    "link": "https://reverseengineering.stackexchange.com/questions/16910/using-cheat-engine-to-activate-a-modified-version-of-a-lua-script",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to hack a game. I'm a bit of a white hat hacker - only for this specific game, and only because I enjoy it. There has recently been a spate of players getting away with much more than they should in game by (if the grapevine is to be believed) injecting lua scripts into the loaded game in cheat engine.\n </p>\n <p>\n  I use cheat engine sometimes, I know how to find a value, change it, lock it, find out what writes to it, etc. I wasn't aware that a user can call an external lua file and have it run as if it had been called by the game in question (the copy of the file I've managed to beg/borrow/steal calls function from the game). I am way out of my depth here, I'm not even 100% sure this is seriously what's been going on. Can anyone shed some light on whether or not this is possible (even a feeling of likelihood would help) and more importantly if it is possible, how I can go about replicating it.\n </p>\n <p>\n  I don't want to mention the game specifically as (although it has a small user base) I don't want to give others tips on how to hack it!). That being said, I realise I haven't given much info,\n  <strong>\n   so please tell me what would be helpful to include!\n  </strong>\n </p>\n <p>\n  P.S. I have no idea how to tag this - suggestions welcome!\n </p>\n</div>\n</body></html>",
    "votes": "-1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "injection"
    ],
    "user": "FraserOfSmeg",
    "time": "Dec 5, 2017 at 1:58",
    "comments": [
        {
            "user": "FraserOfSmeg",
            "text": "<html><body><span class=\"comment-copy\">\n To the downvoter: could you please advise on how to improve the question!\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Unfortunately, as a beginner, there's a LOT for you to learn where this topic is concerned. It's not that it's particularly outside of your grasp to understand, but rather that it's going to take quite a bit of time.\n </p>\n <p>\n  Without seeing the file or knowing the game, there are any number of solutions that could be happening. So instead of playing guesswork there, I recommend you start by learning how to use Lua in the context of Cheat Engine.\n  <a href=\"http://dsasmblr.com/introduction-to-lua-using-cheat-engine-beginner-to-basic-script-writer/\" rel=\"nofollow noreferrer\">\n   I wrote a beginner's tutorial\n  </a>\n  sometime back that should help you quite a bit.\n </p>\n <p>\n  After that, I recommend watching\n  <a href=\"https://www.youtube.com/watch?v=NY1RZgq_oDc\" rel=\"nofollow noreferrer\">\n   this video\n  </a>\n  , followed by\n  <a href=\"https://www.youtube.com/watch?v=s303GEZfhYs\" rel=\"nofollow noreferrer\">\n   this video\n  </a>\n  --both of which use Lua to solve steps 1-7 of the tutorial that comes bundled with Cheat Engine.\n </p>\n <p>\n  Finally,\n  <a href=\"https://github.com/flarn2006/SA2CheatTable\" rel=\"nofollow noreferrer\">\n   here is an example\n  </a>\n  of an insanely in-depth CE Lua script. Crack it open and take a look at that puppy; it's amazing. Ultimately, you can get as basic (simple scripting) or as complex (designing a full, standalone trainer) as you want with Lua in CE. You have the power of Lua in its entirety, as well as CE's custom Lua functions (and any others you'd like to bring in from other Lua libraries).\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "dsasmblr",
            "time": "Dec 5, 2017 at 18:50",
            "is_accepted": true,
            "comments": [
                {
                    "user": "FraserOfSmeg",
                    "text": "<span class=\"comment-copy\">Thanks for the informative answer. Could you provide a link/explain how one can call a function from the scripts the game usually uses. For example, send_action_to_server is a call that I would like to make, and it's used in the game's script... how can I call that from a lua script of my own?</span>",
                    "time": null
                },
                {
                    "user": "dsasmblr",
                    "text": "<span class=\"comment-copy\">There's really not a simple answer for that based on your current skills, because knowing the function name is only part of the battle. How many arguments should be passed through it, and what should those arguments be? If you can figure that out, then look into using CE's createThread() function. Other considerations: Is there a parent or child function (think encryption) that does something with the result of the function you're interested in--and if so, is any of it data/values expected to be in a memory address or register that won't be in place by you running said function out of scope?</span>",
                    "time": null
                },
                {
                    "user": "dsasmblr",
                    "text": "<span class=\"comment-copy\">Also, consider this: <a href=\"http://forum.cheatengine.org/viewtopic.php?t=605733\" rel=\"nofollow noreferrer\">forum.cheatengine.org/viewtopic.php?t=605733</a></span>",
                    "time": null
                }
            ]
        }
    ]
}