{
    "title": "ARM system crashes after changing stack address",
    "link": "https://reverseengineering.stackexchange.com/questions/16931/arm-system-crashes-after-changing-stack-address",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  -- Edit with latest update on the problem, it is not solved yet :( --\n </p>\n <p>\n  While playing with an ARM embedded Linux system (Version 3.8.13), out of curiosity, I created a small \"debug\" kernel module.\n </p>\n <p>\n  This \"debug\" module branches a specific flow in another kernel module to a function in this \"debug\" module, which executes some logic and then resumes execution peacefully.\n </p>\n <p>\n  To avoid clutter of the stack area, the first executed logic is changing SP to point at an empty area inside the \"debug\" module\n  <strong>\n   <em>\n    code\n   </em>\n  </strong>\n  section.\n </p>\n <p>\n  The system crashes couple of seconds after executing\n  <code>\n   mov sp, r2\n  </code>\n  , and entering an infinite loop. (\n  <code>\n   r2\n  </code>\n  holds the address to the empty area).\n </p>\n <p>\n  Note that the crash happens before the \"debug\" module executes any stack-related opcode (or actually any other opcode, for that matter).\n </p>\n <h3>\n  So I conducted the following checks:\n </h3>\n <ul>\n  <li>\n   Made sure the address is 4-byte aligned\n  </li>\n  <li>\n   Changed area to write-able, and big enough to hold a full context switch that is saved on the stack (about 0x300 bytes)\n  </li>\n  <li>\n   Changing\n   <code>\n    sp\n   </code>\n   value by small amounts (+-0x100) - did not crash the system\n  </li>\n  <li>\n   Changing\n   <code>\n    sp\n   </code>\n   to some arbitrary value - crashed the system.\n  </li>\n  <li>\n   <strong>\n    Changing\n    <code>\n     sp\n    </code>\n    momentarily and then immediately restoring its value does not crash the system\n   </strong>\n  </li>\n  <li>\n   <strong>\n    <em>\n     Changing\n     <code>\n      sp\n     </code>\n     momentarily, executing an STMFD operation and then immediately restoring\n     <code>\n      sp\n     </code>\n     's value does not crash the system!\n    </em>\n   </strong>\n  </li>\n </ul>\n <p>\n  <s>\n   From the last test, it's pretty clear that when a context-switch happens, some values are being saved on the stack. If it points to that free area, the system crashes\n  </s>\n </p>\n <p>\n  It seems that there isn't any problem with using stack operations on the free area, but yet when some context-switch happens, the system crashes.\n </p>\n <h3>\n  Feasible ideas\n </h3>\n <ul>\n  <li>\n   Is there a constraint on possible values of the\n   <code>\n    sp\n   </code>\n   register? (Kernel configuration, perhaps? Specific bits of the address?)\n  </li>\n  <li>\n   The code section has some sort of protection against being used as a stack\n   <strong>\n    when used outside of the current module\n   </strong>\n   ?\n  </li>\n  <li>\n   Context-switch requires more than 0x300 bytes of space?\n  </li>\n </ul>\n <p>\n  Thanks!\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "194",
    "tags": [
        "debugging",
        "linux",
        "arm",
        "stack"
    ],
    "user": "Tals",
    "time": "Dec 12, 2017 at 8:29",
    "comments": [
        {
            "user": "xvk3",
            "text": "<html><body><span class=\"comment-copy\">\n You say \"The system crashes right after executing mov sp, r2\". Yet you are able to \"momentarily\" change sp.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Tals",
            "text": "<html><body><span class=\"comment-copy\">\n Yes, what I meant that executing\n <code>\n  mov sp, r2\n </code>\n and then entering a loop crashes the system after couple of seconds, where executing\n <code>\n  mov r3, sp\n </code>\n ,\n <code>\n  mov sp, r2\n </code>\n and then\n <code>\n  mov sp, r3\n </code>\n does not crash the system at all. I added a clarification in my post.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "xvk3",
            "text": "<html><body><span class=\"comment-copy\">\n Are there equal numbers of push-pop / call-ret pairs in the loop? Is the stack pointer preserved between each loop iteration?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Tals",
            "text": "<html><body><span class=\"comment-copy\">\n Said loop is just a branch to the same address of the loop. Like I mentioned in the post - there aren't any stack-related opcodes executed after any of my tests.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you are setting the stack pointer to a point in the code section, most likely that page does not have write access permission enabled so when the processor starts to write on the stack you immediately generate a permission data abort fault.\n </p>\n <p>\n  You need to set the stack pointer to a valid page in memory which has read/write permissions set instead of read-only. Take a look at the memory access control section under the virtual memory system architecture chapter for the ARM architecture reference manual.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "cimarron",
            "time": "Dec 7, 2017 at 20:33",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Tals",
                    "text": "<span class=\"comment-copy\">That sounded like a possibility so I set the SP to that empty spcae, pushed two values and then immediately restored its value. <b><i>The system did not crash</i></b>. This means that the code page is writable and stack operations are working.</span>",
                    "time": null
                },
                {
                    "user": "cimarron",
                    "text": "<span class=\"comment-copy\">Can you post the kernel panic you are getting?</span>",
                    "time": null
                },
                {
                    "user": "Tals",
                    "text": "<span class=\"comment-copy\">In this specific embedded system the panics are written to a specific file. For some reason nothing is written on these crashes...Best guess is that since SP has been changed, whatever tries to dump the kernel panic message tries to access data from it, fails, and crashes itself.</span>",
                    "time": null
                }
            ]
        }
    ]
}