{
    "title": "Is it possible to (core-dump) recover a video in memory of the player (VLC) started without a debugger?",
    "link": "https://reverseengineering.stackexchange.com/questions/17147/is-it-possible-to-core-dump-recover-a-video-in-memory-of-the-player-vlc-star",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Essentially, I'm wondering how difficult or possible it would be to do a core-dump on an already running process that was started without a debugger.\n </p>\n <p>\n  I have a video that I opened in VLC (and is still running in VLC). I accidentally, however, deleted the original file but to my surprise, was still able to scroll back and forth on in VLC (making me think it's still in memory).\n </p>\n <p>\n  Would it somehow be possible to do a core dump of the running process from it's PID and somehow piece together the data? Would that likely involve me following pointers through data-structures that I would need to sift through VLC's source code for?\n </p>\n <p>\n  I'm running OSX right now (so BSD). I think you could do a core-dump on processes with\n  <code>\n   gdb\n  </code>\n  if it was started alongside the debugger, but I'm not sure about trying to do it with processes already running (as I'm sure the OS would also not like that).\n </p>\n <p>\n  Any ideas?\n </p>\n <p>\n  I would add the tag \"core-dump\" but I don't have enough points.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "120",
    "tags": [
        "memory"
    ],
    "user": "Alexander Kleinhans",
    "time": "Jan 8, 2018 at 7:31",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n @blabb try it on OS X\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<html><body><span class=\"comment-copy\">\n @igor since you recommend to try osx illl assume it is possible to delete files in use in osx so deleting my earlier cimment\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Well since your VLC is still running the easiest to recover your file will be fire up \"View\" -> \"Advanced controls\" and re-record the entire file. You should find a vlc-record-... somewhere in your homefolder.\n </p>\n <p>\n  To answer your question, you can attach to a running process with\n  <code>\n   attach <pid>\n  </code>\n  in a gdb shell without argument(s).\n </p>\n <p>\n  Use\n  <code>\n   detach\n  </code>\n  to return execution to vlc.\n </p>\n <p>\n  memory can be dumped with\n  <code>\n   dump binary memory result.bin start-addr end-addr\n  </code>\n  (see\n  <a href=\"http://sourceware.org/gdb/onlinedocs/gdb/Dump_002fRestore-Files.html\" rel=\"nofollow noreferrer\">\n   http://sourceware.org/gdb/onlinedocs/gdb/Dump_002fRestore-Files.html\n  </a>\n  ) but it's highly unlikely your entire file will be in memory, it probably still works because the file descriptor is still open.\n </p>\n <p>\n  As a small disclaimer, you probably only got 1 shot at this. As soon as the file descriptor is closed (this will probably happen when VLC reaches end of file and gets into 'stopped' state or if the gdb does something unintended) your file will be lost - so you might want to try those steps first on a new / different file, preferably on a different Mac.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "NrY",
            "time": "Jan 8, 2018 at 22:50",
            "is_accepted": false,
            "comments": []
        }
    ]
}