{
    "title": "Time/Money needed for R&D vs. reverse engineering [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/17308/time-money-needed-for-rd-vs-reverse-engineering",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <div>\n  <aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n   <div class=\"d-flex fd-column fw-nowrap\">\n    <div class=\"d-flex fw-nowrap\">\n     <div class=\"flex--item wmn0 fl1 lh-lg\">\n      <div class=\"flex--item fl1 lh-lg\">\n       <div>\n        <b>\n         Closed\n        </b>\n        . This question needs to be more\n        <a href=\"/help/closed-questions\">\n         focused\n        </a>\n        . It is not currently accepting answers.\n       </div>\n      </div>\n     </div>\n    </div>\n   </div>\n   <hr class=\"my12 outline-none baw0 bb bc-blue-400\"/>\n   <div class=\"fw-nowrap fc-black-500\">\n    <div class=\"d-flex fd-column lh-md\">\n     <div class=\"mb0 d-flex\">\n      <div class=\"flex--item mr8\">\n       <svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\">\n        <path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\">\n        </path>\n       </svg>\n      </div>\n      <p>\n       <b>\n        Want to improve this question?\n       </b>\n       Update the question so it focuses on one problem only by\n       <a href=\"/posts/17308/edit\">\n        editing this post\n       </a>\n       .\n      </p>\n     </div>\n     <div class=\"mb0 mt6 d-flex\">\n      <p class=\"ml24 pl2\">\n       Closed\n       <span class=\"relativetime\" title=\"2018-02-01 13:10:28Z\">\n        7 years ago\n       </span>\n       .\n      </p>\n     </div>\n     <div class=\"ml24 pl2\">\n     </div>\n    </div>\n   </div>\n   <div class=\"mt24 d-flex gsx gs8\">\n    <a class=\"s-btn s-btn__outlined flex--item js-post-notice-edit-post\" href=\"/posts/17308/edit\">\n     Improve this question\n    </a>\n   </div>\n  </aside>\n </div>\n <p>\n  Is it possible to estimate how much more time it takes and how much more it costs when you work on a Research and Development (R&D) project compared to a reverse-engineering project?\n </p>\n <p>\n  For example, I see Apple or Samsung make a new smartphone, then after some months there are Chinese fake copies of them at the market. These copies are so good that that maybe you cannot tell if they're fake or original!\n </p>\n <p>\n  Or there are many Chinese products that are copied from an original product. They have been reverse-engineered.\n </p>\n <p>\n  I would like to know, can we estimate the difference? For example, \"R&D is 10 times more expensive and longer than reverse engineering\".\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "250",
    "tags": [
        "compare"
    ],
    "user": "user8663682",
    "time": "7 years ago",
    "comments": [
        {
            "user": "Chris",
            "text": "<html><body><span class=\"comment-copy\">\n I've understood the number to be .75. That is, the cost of a Rev&D is 75% the cost of an original R&D effort. Meaning it is a 25% discount. It is important to note that there are specialized Rev-Engineers.  Throwing standard engineers at a Rev. Eng. problems has the potential for hidden costs: it can degrade innovative culture & capability, as the decision and trade-off priorities for Rev&D are fundamentally different than forward R&D.  This is similar to the difference in priorities between regular engineering and science.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am not convinced that mobile phones are a good example here, since the similarities are mostly superficial - i.e., they try to mimic the design, but not the hardware in a way that allows to use the original OS (especially in the case of iOS).\n </p>\n <p>\n  However, software compatibility has been a driver for some large-scale reverse engineering efforts in the past. One intriguing example is the former east block semiconductor industry. In the 1980s, semiconductor experts from the GDR reverse engineered several common ICs, including the Zilog Z80 processor, in order to produce identical copies such as the\n  <a href=\"https://en.wikipedia.org/wiki/U880\" rel=\"nofollow noreferrer\">\n   U880 processor\n  </a>\n  . This was done by grinding down the various layers of an original Z80 chip, shooting micro photographs and recreating the layout of the various silicon and metal layers based on the photos. A related story I am unable to confirm claims that the GDR engineers even were able to fix some bugs in the original Z80 silicon that way.\n </p>\n <p>\n  There were also clones of DEC machines (PDP11, VAX) and IBM S/370 mainframes. Genuine east block computers with a unique design were more rare; one example is the\n  <a href=\"https://en.wikipedia.org/wiki/P8000\" rel=\"nofollow noreferrer\">\n   Z8000-based P8000 Unix system\n  </a>\n  .\n </p>\n <p>\n  The reasons for this were obviously manyfold. On the one hand, due to COCOM export restrictions, there was no official way to obtain \"high tech\" \nproducts in the Warsaw block. A more important reason for copying existing designs, I think, was the availability of large repositories of software (CP/M for the Z80).\n </p>\n <p>\n  While the cost of creating this Z80 clone might be hard to determine nowadays, the time frame is rather well known. The U880 was available in 1980, about four years after the original Z80 came to market. Zilog was founded in 1974 and brought the Z80 to market in July 1976. So, I would assume that in the worst case, the reverse engineering effort took at most about twice the time of the original development (this is assuming the work in the GDR had started right after the availability of the Z80).\n </p>\n <p>\n  It would certainly be interesting to trace the history of this reverse engineering effort; however, information on this seems to be hard to find.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": null,
            "time": "Jan 27, 2018 at 14:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}