{
    "title": "Where Is device specific information kept on smart devices",
    "link": "https://reverseengineering.stackexchange.com/questions/17317/where-is-device-specific-information-kept-on-smart-devices",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am doing a project for school on Emulation of device using its firmware. Using firmadyne, I can start up the smart device unfortunately because it is not a real device, information fields like Serial number, MAC address, and other device specific information is not present.  I have a shell, and I can look around a physical exemplar of the device but I can't find any place where that is stored. I am limited on what I can do (via busybox)\n </p>\n <p>\n  Where is the device specific information of smart devices usually kept?  I am assuming it is burned-in somewhere?\n </p>\n <p>\n  Thanks\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "83",
    "tags": [
        "binary-analysis",
        "firmware",
        "emulation"
    ],
    "user": "Lexicon",
    "time": "Jan 28, 2018 at 19:36",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  These information pieces are generally stored in the NVRAM (Non-Volatile RAM), which is stored in one of the flash partition. To emulate a device successfully, you generally have to fill up the NVRAM with valid settings.\n </p>\n <p>\n  Firmadyne contains an\n  <a href=\"https://github.com/firmadyne/libnvram\" rel=\"nofollow noreferrer\">\n   NVRAM emulation\n  </a>\n  and you can find more information about the problem itself in this\n  <a href=\"http://www.devttys0.com/2012/03/emulating-nvram-in-qemu/\" rel=\"nofollow noreferrer\">\n   blog post\n  </a>\n  .\n </p>\n <p>\n  If I remember well, the NVRAM emulation could log out the requested settings, and you have to specify these values in the NVRAM storage directory.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "ebux",
            "time": "Jan 29, 2018 at 9:28",
            "is_accepted": true,
            "comments": []
        }
    ]
}