{
    "title": "How to modify strings and funtions reference detection in IDA pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/17735/how-to-modify-strings-and-funtions-reference-detection-in-ida-pro",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have loaded a binary file into IDA which is for Motorola 6800 series.\n </p>\n <ul>\n  <li>\n   <p>\n    The strings are referenced like this:\n    <code>\n     pea     ($2017A99).l\n    </code>\n    .\nThe actual address of the referenced string in above command is\n    <code>\n     0x017A99\n    </code>\n    .\n   </p>\n  </li>\n  <li>\n   <p>\n    Functions are called like this:\n   </p>\n   <pre><code>lea     ($200CA4C).l,a3\njsr     (a3)\n</code></pre>\n   <p>\n    or like this:\n   </p>\n   <pre><code>jsr     $200CA4C\n</code></pre>\n   <p>\n    where in both cases, the actual address of the function is\n    <code>\n     0x0CA4C\n    </code>\n    .\n   </p>\n   <p>\n    IDA pro didn't detect any of those and didn't add anything to xrefs or other reference lists.\n    \n\n   </p>\n  </li>\n </ul>\n <p>\n  Now my question is how can I modify string reference and function call detection process of IDA so they can be detected ?\n </p>\n <p>\n  Regards.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "901",
    "tags": [
        "ida",
        "idapython"
    ],
    "user": "Gholi GholiZade",
    "time": "Mar 20, 2018 at 19:22",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I might be wrong, but it sounds to me like you loaded the binary file at the wrong imagebase. It sounds like you loaded it at the default base address of 0x0, whereas the base address really ought to be 0x2000000. Load the file into IDA again from scratch and try putting 0x2000000 in the \"Loading offset\" box on the initial \"Load a new file\" dialog box.\n </p>\n <p>\n  As for why I think that: based on your examples, e.g. the second one:\n </p>\n <pre><code>jsr     $200CA4C\n</code></pre>\n <p>\n  You're claiming the real address is 0x0CA4C, a difference of 0x2000000 from what's displayed. Your first example also differs by 0x2000000. So I'm guessing those instructions have hard-coded addresses in them, with all of them just above 0x2000000. That tells me the binary probably expects to be loaded at that address, which is why I'm advising you to try loading it at that address and see what happens.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Rolf Rolles",
            "time": "Mar 19, 2018 at 21:02",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Gholi GholiZade",
                    "text": "<span class=\"comment-copy\">Hi, thanks for your reply, I have edited the first question so it contains my answers to your suggestion.</span>",
                    "time": null
                },
                {
                    "user": "Rolf Rolles",
                    "text": "<span class=\"comment-copy\">Your question is now completely different. As written, my original response is no longer appropriate for what you are asking currently, even if it mostly solved your original problem. You should have asked a new question instead of drastically editing your existing one.</span>",
                    "time": null
                },
                {
                    "user": "Gholi GholiZade",
                    "text": "<span class=\"comment-copy\">Hi again, I undid the changes on the first question, and will create a new question. Thanks for your help.</span>",
                    "time": null
                }
            ]
        }
    ]
}