{
    "title": "USB Dongle Traffic Monitoring",
    "link": "https://reverseengineering.stackexchange.com/questions/1786/usb-dongle-traffic-monitoring",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  How can I monitor a usb dongle's traffic? I would like to see how a program and its usb dongle talk to each other, if it is possible replay this traffic?\n </p>\n <p>\n  Since I am new to this type of thing, any tutorial or tool suggestion is welcome.\n </p>\n</div>\n</body></html>",
    "votes": "17",
    "answers": 4,
    "views": "8k",
    "tags": [
        "tools",
        "executable",
        "usb",
        "dongle"
    ],
    "user": "Atilla Ozgur",
    "time": "Nov 22, 2018 at 8:55",
    "comments": [
        {
            "user": "amccormack",
            "text": "<html><body><span class=\"comment-copy\">\n Are you asking for a specific operating system (Windows, Linux, etc)? If so, you should add that platform as a tag.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "RobotHumans",
            "text": "<html><body><span class=\"comment-copy\">\n I don't think this merits a full-on answer, but Wireshark also supports snooping USB on the linux side, just for reference.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It depends on what your budget is like. The best USB analyzers are hardware devices with good protocol dissectors. If you have a huge budget you can go with the various solutions from LeCroy such as the\n  <a href=\"http://teledynelecroy.com/protocolanalyzer/protocoloverview.aspx?seriesid=164&capid=103&mid=511\">\n   LeCroy Voyager M3i\n  </a>\n  . If you have a decent size budget and you only need USB 2.0, I would go for the\n  <a href=\"http://www.ellisys.com/products/usbex200/index.php\">\n   Ellisys USB Explorer 200\n  </a>\n  . If you want to replay and change packets you can take a look at the\n  <a href=\"http://www.ellisys.com/products/usbex260/\">\n   Ellisys USB Explorer 260\n  </a>\n  as I don't think the 200 is capable of replay. If you need USB 3.0 I would go with the\n  <a href=\"http://www.ellisys.com/products/usbex280/index.php\">\n   Ellisys USB Explorer 280\n  </a>\n  . On the budget hardware side you have the\n  <a href=\"http://www.totalphase.com/products/beagle/usb480/\">\n   Beagle 480\n  </a>\n  and even more budget the\n  <a href=\"http://www.totalphase.com/products/beagle_usb12/\">\n   Beagle 12\n  </a>\n  .\n </p>\n <p>\n  If you're on a budget you can go with a software solution such as\n  <a href=\"http://www.everstrike.com/usb-monitor/\">\n   USBSpy\n  </a>\n  ,\n  <a href=\"http://www.usblyzer.com/\">\n   USBLyzer\n  </a>\n  ,\n  <a href=\"http://www.bustrace.com/\">\n   BusTrace\n  </a>\n  or\n  <a href=\"http://sourceforge.net/projects/usbsnoop/\">\n   USBSnoop\n  </a>\n  .\n </p>\n <p>\n  There's also the more DIY solution which involves running the process you want to monitor in a virtual machine such as VirtualBox and then routing the traffic which goes through the USB ports to your own dissector. You can use\n  <a href=\"http://wiki.wireshark.org/CaptureSetup/USB\">\n   Wireshark as a dissector\n  </a>\n  for VM USB traffic.\n </p>\n <p>\n  Personally I would go with the Ellisys Explorer 200 or 260. Either one presents a good compromise between price and quality depending on your needs.\n </p>\n</div>\n</body></html>",
            "votes": "17",
            "user": "Peter Andersson",
            "time": "Apr 15, 2013 at 18:57",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Cybergibbons",
                    "text": "<span class=\"comment-copy\">What are the downsides of the software solutions?</span>",
                    "time": null
                },
                {
                    "user": "Peter Andersson",
                    "text": "<span class=\"comment-copy\">IMO the main weakness of a software solution is the inability of it to tap a connection where you don't control one party, perhaps both the host and the client are embedded systems. If you run a pure driver without a VM what you see is not guaranteed to be the data actually being sent, for instance invalid transactions can get dropped. With a VM this is not an issue. With hardware you know that what you're looking at is what's actually being sent. This can also be bad since you may want your data to be sequential and proper the way the software sent it, not how it was actually transmitted.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  In addition to Peter Andersson's list of tools, you may also want to consider\n  <a href=\"http://www.sysnucleus.com/\">\n   USBTrace\n  </a>\n  and\n  <a href=\"http://www.perisoft.net/bushound/index.htm\">\n   Bus Hound\n  </a>\n  .\n </p>\n</div>\n</body></html>",
            "votes": "9",
            "user": "Jason Geffner",
            "time": "Apr 15, 2013 at 19:04",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Tho maybe not directly what you are looking for I'd just like to add one item to Peter Andersson's thorough answer. Travis Goodspeed's\n  <a href=\"http://travisgoodspeed.blogspot.com/2012/07/emulating-usb-devices-with-python.html\">\n   facedancer\n  </a>\n  (\n  <a href=\"http://goodfet.sourceforge.net/hardware/facedancer11/\">\n   some more recent info\n  </a>\n  ). Its design is also\n  <a href=\"http://goodfet.sourceforge.net/hardware/facedancer11/\">\n   open source\n  </a>\n  .\n </p>\n <blockquote>\n  <p>\n   Facedancer Board, a tool for implementing USB devices in host-side Python using the GoodFET framework. Access to the USB chip is extremely low-level, so protocols may be mis-implemented in all sorts of creative ways. This allows a clever neighbor to quickly find and exploit USB driver vulnerabilities from the comfort of a modern workstation, only later porting such exploits to run standalone.\n  </p>\n </blockquote>\n <p>\n  It can be used for sniffing too.\n  <strike>\n   I couldn't immediately find a link to buy one\n  </strike>\n  Pre assembled boards are not yet available, but you can buy the circuit boards\n  <a href=\"http://goodfet.sourceforge.net/orders/\">\n   here\n  </a>\n  , also Travis is, as he likes to say, a good neighbor and gives them away at conferences. Anyway, it should be pretty cheap option if you can assemble it yourself.\n </p>\n</div>\n</body></html>",
            "votes": "7",
            "user": "0xea",
            "time": "Apr 15, 2013 at 20:43",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Elmue",
                    "text": "<span class=\"comment-copy\">&gt; \"It can be used for sniffing too.\" This is wrong. The FaceDancer can NOT sniff USB packets sent between a host and a device. What the FaceDancer can sniff is only firmware that is uploaded from a host to a USB device. Listen that MP3 here: <a href=\"http://risky.biz/facedancer\" rel=\"nofollow noreferrer\">risky.biz/facedancer</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you aren't afraid to get your hands dirty, on Windows you could always write a filter driver on top of or below the device object for the dongle. The\n  <a href=\"http://msdn.microsoft.com/en-us/library/windows/hardware/ff548294.aspx\" rel=\"nofollow\">\n   <code>\n    IoAttachDevice()\n   </code>\n  </a>\n  function and the three other functions starting with that name are your friend. The advantage of that is to have a complete in-software solution for the problem without the expenses involved with hardware sniffers. You'll notice that this is actually what the USBpcap project does in\n  <a href=\"https://github.com/desowin/usbpcap/blob/master/USBPcapDriver/USBPcapFilterManager.c\" rel=\"nofollow\">\n   <code>\n    USBPcapFilterManager.c\n   </code>\n  </a>\n  . So if you are merely writing this for research, this would be a good starting point, unless the GPL is too restrictive for you.\n </p>\n <p>\n  There is a potential downside with in-software solutions. A filter driver will only see what the other drivers want it to see. Keep in mind that in Windows kernel mode all drivers have the same privileges. Even attaching to the root hub may not always yield meaningful results. So if one driver decides to do funny things such as stealing entry points (\n  <a href=\"http://msdn.microsoft.com/en-us/library/windows/hardware/ff550710.aspx\" rel=\"nofollow\">\n   IRP major function codes\n  </a>\n  ) to proactively counter filtering or debugging of any kind, it becomes an arms race. Otherwise it will be the cheapest solution you can get, given you only need this to work on a particular OS.\n </p>\n <p>\n  However, if I was you I'd first sniff the user mode traffic between the library (hook\n  <code>\n   DeviceIoControl\n  </code>\n  ,\n  <code>\n   ReadFile\n  </code>\n  ,\n  <code>\n   WriteFile\n  </code>\n  et al, or their native counterparts) and the driver or the library and the application that requires the dongle. Of course if the dongle poses as a HID device you'd have to look for the respective IOCTLs and decode them or hook the HID functions directly. This is the method I was using to investigate the traffic sent between a sports watch with USB connectivity and my box. I based it on\n  <a href=\"https://github.com/OpenRCE/paimei\" rel=\"nofollow\">\n   PaiMai\n  </a>\n  and\n  <a href=\"https://github.com/OpenRCE/pydbg\" rel=\"nofollow\">\n   pydbg\n  </a>\n  , because the application wasn't guarding against being debugged. If yours does, you may have to cheat a little to \"convince\" the application to play nicely\n  <a href=\"http://newgre.net/idastealth\" rel=\"nofollow\">\n   IDAStealth provided a few good pointers\n  </a>\n  (link is dead as of May 2016) how to go about.\n </p>\n</div>\n</body></html>",
            "votes": "7",
            "user": "0xC0000022L",
            "time": "May 31, 2016 at 8:10",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Elmue",
                    "text": "<span class=\"comment-copy\">&gt; \"Write a filter driver.\"  Supposed you have experience in writing drivers an much spare time!</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@Elmue writing a filter driver isn't quite as difficult anymore as it used to be. Windows 10 even abolished legacy file system filters, for example; in favor of the simpler mini-FSFD. Similar things can be said about other filter driver types. But yeah, kernel mode development on Windows is quite different, even though managers typically don't understand or care about the distinction and why it matters. Stability issues typically ensue as a consequence.</span>",
                    "time": null
                }
            ]
        }
    ]
}