{
    "title": "Stripped elf executable with ~3000 unnamed functions",
    "link": "https://reverseengineering.stackexchange.com/questions/18115/stripped-elf-executable-with-3000-unnamed-functions",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Reversing a malware sample and have identified the elf as stripped which seems to be why none of the functions are explicitly named. Also, there are no specified imports listed for some reason. Does not appear to be obfuscated though I could be wrong. The strings are not obfuscated so I have been trying to get my hands dirty in basic analysis by looking up where the strings correspond in disassembly. No doubt I will have to find a way to easily identify these thousands of functions which appear just as numerals rather than explicit names. Any suggestions?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "673",
    "tags": [
        "disassembly"
    ],
    "user": "bumchux",
    "time": "Apr 26, 2018 at 18:44",
    "comments": [
        {
            "user": "julian",
            "text": "<html><body><span class=\"comment-copy\">\n Is the binary packed with UPX or some variant thereof? How do you know it is malware? What is the SHA1-sum of the binary? Where did you get it from? Is the binary statically linked or dynamically linked? Is there a section header table present? What is the target architecture of the binary? No symbol table means no function names.\n <a href=\"https://syssec.mistakenot.net/papers/eurosp-2017.pdf\" rel=\"nofollow noreferrer\">\n  syssec.mistakenot.net/papers/eurosp-2017.pdf\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n which disassembler are you using?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "bumchux",
            "text": "<html><body><span class=\"comment-copy\">\n Using radare2, it's a 32 bit elf of mirai from virusshare for arm. Pretty sure it's statically linked\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Although many ELF files have a symbol table, it is not required for executing a program by the OS. In particular, statically-linked programs embed all necessary library code inside, making the binary completely independent from any external libraries and able to run stand-alone.\n </p>\n <p>\n  So you can start by identifying library functions. There are many ways to do it, here's a few suggestuions:\n </p>\n <ul>\n  <li>\n   <p>\n    If you know/can guess the compiler and the version used to compile the binary, you can try to match the libraries shipped with the compiler against the binary. GCC often leaves its version string in the binaries (sometimes even stripped ones), for example:\n   </p>\n   <p>\n    <code>\n     GCC: (Sourcery G++ Lite 2010.09-58) 4.5.1\n    </code>\n    \n\n    <code>\n     GCC: (GNU) 4.8\n    </code>\n   </p>\n  </li>\n  <li>\n   <p>\n    you can try looking for strings which identify library source files, function names or other messages which are unique enough to identify the function, e.g.:\n   </p>\n   <p>\n    <code>\n     __get_myaddress: ioctl (get interface configuration)\n    </code>\n    \n\n    <code>\n     RPC: (unknown error code)\n    </code>\n   </p>\n  </li>\n </ul>\n <p>\n  If all else fails or the binary does not use a standard library, you can always fall back to tracking the use of syscalls.\n </p>\n <p>\n  The binary has to interact with the OS somehow. This is done using so-called\n  <em>\n   syscalls\n  </em>\n  (system calls) - special instructions which invoke OS services. On x86_64, this is done with the\n  <code>\n   syscall\n  </code>\n  instruction, on\n  <code>\n   i386\n  </code>\n  Linux using\n  <code>\n   int 0x80\n  </code>\n  , while on ARM Linux, the\n  <code>\n   SVC\n  </code>\n  (supervisor call) instruction is used. ARM system calls on EABI systems use numbers\n  <a href=\"https://w3challs.com/syscalls/?arch=arm_strong\" rel=\"nofollow noreferrer\">\n   starting from\n   <code>\n    0x900000\n   </code>\n  </a>\n  which are stored in\n  <code>\n   r7\n  </code>\n  before invoking the\n  <code>\n   SVC\n  </code>\n  instruction. So, for example, you can search for\n  <code>\n   0x900004\n  </code>\n  to find the\n  <code>\n   write\n  </code>\n  syscalls which are likely to be used in output functions.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "May 3, 2018 at 12:48",
            "is_accepted": true,
            "comments": []
        }
    ]
}