{
    "title": "How to reverse engineer mobile app image?",
    "link": "https://reverseengineering.stackexchange.com/questions/18199/how-to-reverse-engineer-mobile-app-image",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <strong>\n   Scenario\n  </strong>\n </p>\n <p>\n  On my phone I have an app. When I login into the app and goto my profile there is an profile picture of me. I want to that picture because I need it. Simple way is just goto an local shop an take an picture but the cool way would be to get that image from the app.\n </p>\n <p>\n  <strong>\n   Question\n  </strong>\n </p>\n <p>\n  How can I get the image from the app on my mobile?\n </p>\n <p>\n  How I think it could be done:\n </p>\n <p>\n  Use wireshark listen to the mobile traffic from the app and somehow try to get the image. Is this the right way or are there better ones?\n </p>\n <p>\n  <strong>\n   Information\n  </strong>\n </p>\n <p>\n  Android 8.1.1\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "859",
    "tags": [
        "android",
        "wireshark"
    ],
    "user": "Timon Post",
    "time": "May 7, 2018 at 7:54",
    "comments": [
        {
            "user": "Pepernoot",
            "text": "<html><body><span class=\"comment-copy\">\n Why not just make a print screen?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Timon Post",
            "text": "<html><body><span class=\"comment-copy\">\n Because the image size is to small and the image is put in an round shape, I need a bigger rectangle version.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Biswapriyo",
            "text": "<html><body><span class=\"comment-copy\">\n You can use this\n <a href=\"https://play.google.com/store/apps/details?id=app.greyshirts.sslcapture&hl=en\" rel=\"nofollow noreferrer\">\n  Packet Capture App\n </a>\n or add\n <code>\n  view-source\n </code>\n before the URL of that page and find the direct link of that picture in HTML.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Timon Post",
            "text": "<html><body><span class=\"comment-copy\">\n I managed to get to the url, I found encoded test. I have to figure out how to decode it. Maybe decompiling the app is an option. Thanks.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Timon Post",
            "text": "<html><body><span class=\"comment-copy\">\n I managed to get my image. The only thing I had to do was creating an script to get the response of that page whits where raw bytes and than convert that to an image. Thanks for the help @Biswapriyo\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Wireshark will be ok, if the traffic is not encrypted. Otherwise you'll have to setup a proxy which will do sniffering of SSL traffic. Also the picture may be sent encoded in some application specific way, so you wouldn't be able to just save it as JPG.\n </p>\n <p>\n  The most thorough way is to decompile the application and find how exactly it gets the picture from the server.\n </p>\n <p>\n  If your device is rooted you may try to search the /mnt/sdcard/Android/data/ for folder where the application stores its temporary data. Most likely your profile picture is cached. But it may be stored as BLOB in some database file. So, there are a lot of possibilities...\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Anton Kukoba",
            "time": "May 7, 2018 at 13:30",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Timon Post",
                    "text": "<span class=\"comment-copy\">Rooting my phone is not an option for me. I first have to see if the app uses SSL. Also decompiling is an good option to look at thanks for the help.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  To get an image from an mobile app you first want to know if it is stored on your device or if it is loaded when you log in to your account. In my case it was an profile picture witch will be loaded when you login into your app. In that case you can do the following:\n </p>\n <ol>\n  <li>\n   The first thing to do is Download and install\n   <a href=\"https://play.google.com/store/apps/details?id=app.greyshirts.sslcapture&hl=en\" rel=\"nofollow noreferrer\">\n    Packet Capture\n   </a>\n   . This app can be used to sniff the network traffic of any app you want.\n  </li>\n  <li>\n   Open the\n   <code>\n    Packet Capture\n   </code>\n   app and click on the `GreenArrow/triangle, select the wanted app you want to listen to. (The first time you have to create a certificate, but this is very easy, just follow the instructions on the screen)\n  </li>\n  <li>\n   If a red stop button appears on the top it means that packet capture is now listening to all the data that the app uses.\n  </li>\n  <li>\n   Open the app you want to listen to and go to the page where the image will be loaded. Now you can stop\n   <code>\n    Packet Capture\n   </code>\n   by clicking on the red stop button\n  </li>\n  <li>\n   When you have stopped the listening you now see in a list a new row appearing with the total captures the app\n   <code>\n    Packet Capture\n   </code>\n   has done. These are the network requests and responses that the app has done. Click on a row and all the captures will be shown.\n  </li>\n  <li>\n   You have to search all the captures and check the json response and see if you see any link from the image page. When you have found the link, then copy and save it for later.\n  </li>\n </ol>\n <p>\n  Now you have the image link it depends on the current situation what you want to do.\n </p>\n <ol>\n  <li>\n   The link can be to an HTML document with the foto. Then you can simply save the image.\n  </li>\n  <li>\n   The link can be from an api witch returns some binary data.\n  </li>\n </ol>\n <p>\n  In my case it was an API call. Before I created a script to make that API call I wanted to check the source code of the app and see if there are any descriptions or decoding needs to be done. The following steps are not necessary, but if there is some encryption is encoding you can do the following.\n </p>\n <ol>\n  <li>\n   <p>\n    Get the APK file from the app and save it to your phone, this can be done with\n    <a href=\"https://play.google.com/store/apps/details?id=com.ext.ui&hl=nl\" rel=\"nofollow noreferrer\">\n     this app\n    </a>\n   </p>\n  </li>\n  <li>\n   <p>\n    Convert the APK to the Java source code, this can be done with this\n    <a href=\"http://www.javadecompilers.com/apk\" rel=\"nofollow noreferrer\">\n     Site\n    </a>\n    . Download the source code and install an editor for it.\n   </p>\n  </li>\n  <li>\n   Now you have the source code find the code where the image will be loaded from the API or just an HTTP call. And just find any clues on decryption decoding or autoriensation that the app uses. You have to figure this out because every situation can be diffrent. In my sittation the app did not had any autherisation for the API and the data returend whas not encrypted. I just searched for the code where the my profile picture was stored form there I searched to all refrences and found the place where the profile picture was loaded from an API call.\n  </li>\n </ol>\n <p>\n  Now I know where I can get my image from I can create an C# program to get the bytes from the API and convert that to an image.\n </p>\n <pre><code>// Create a request for the URL.   \nWebRequest request = WebRequest.Create(\n            \"weburl/to/the/api\");\n\n// Get the response.  \nWebResponse response = request.GetResponse();\n\n// Get the stream containing content returned by the server.  \nStream dataStream = response.GetResponseStream();\n\nvar bitmap = Bitmap.FromStream(dataStream);\n\nresponse.Close();\n\nbitmap.Save(\"mypicture.png\");\n</code></pre>\n <p>\n  If your device is rooted you may try to search the /mnt/sdcard/Android/data/ for folder where the application stores its temporary data. Most likely your profile picture is cached. But it may be stored as BLOB in some database file. Actualy you don't always need root access to access the cache of an app. Go to the folder: /mnt/sdcard/Android/data//Cache. If this folder is not located it can be that the app has made the cache invisible in this case you need to root you phone.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Timon Post",
            "time": "May 9, 2018 at 6:42",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Biswapriyo",
                    "text": "<span class=\"comment-copy\">Does SDcard require root access? In my Redmi 5A it can be browsed normal folder.</span>",
                    "time": null
                },
                {
                    "user": "Timon Post",
                    "text": "<span class=\"comment-copy\">maybe, actualy you do not need always root access to access the cache of an app. Go to the folder: /mnt/sdcard/Android/data/&lt;App&gt;/Cache. If this folder is not located it can be that the app has made the cache invisible in this case you need to root you phone.</span>",
                    "time": null
                }
            ]
        }
    ]
}