{
    "title": "How can I generate the recovery password on a legacy system (Original company is out of business) running on my local machine?",
    "link": "https://reverseengineering.stackexchange.com/questions/18288/how-can-i-generate-the-recovery-password-on-a-legacy-system-original-company-is",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm attempting to use a legacy systems recovery feature that typically required calling/faxing a company that is no longer around.\n </p>\n <p>\n  Basically, the system was designed to go into a recovery mode and it provided a 4 character code that was provided over phone/fax to the software company and they would provide you with what looks like a HEX code to gain access to the system.\n </p>\n <p>\n  I've been playing around with my limited knowledge on the subject for a little while now and have made zero progress. The system does run on a local server so maybe there are some decompilers or other processes that can be recommended? (Tomcat Based Webserver)\n </p>\n <p>\n  The Username is Administrator, below are 4 records from previous resets. Looks like MD4  or MD5 Hash to me.\n </p>\n <blockquote>\n  <p>\n   Recover Code - Recovery Password\n  </p>\n  <p>\n   C969 - CF45FE53C10C541D831BB00A88C2497E\n  </p>\n  <p>\n   H924 - 4A90846DBA0DC78EFEC6FAB389D4DD97\n  </p>\n  <p>\n   B939 - D960D76B1BA23E1AC872A289CB1DD15D\n  </p>\n  <p>\n   I996 - 0DF5117F8731CE4C4C65D383C77BD97E\n  </p>\n </blockquote>\n <p>\n  The other details:\n </p>\n <p>\n  Windows XP \"Server\"\n </p>\n <p>\n  Full file system administrative access\n </p>\n <p>\n  URL\n  <a href=\"http://localhost/recoverymode=true\" rel=\"nofollow noreferrer\">\n   http://localhost/recoverymode=true\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "150",
    "tags": [
        "encryption",
        "java",
        "encodings",
        "strings"
    ],
    "user": "Landmine",
    "time": "May 17, 2018 at 21:40",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n what does the system consist of? Is it a generic PC or a special box? Do you have access to the files? What specifically is the server running? try to describe it in more detail.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Landmine",
            "text": "<html><body><span class=\"comment-copy\">\n It is running on a Windows XP machine and I do have fulled access to the system. It is a web interface to some utilities (Lights, heating and air) at an old building.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n is the UI web-based? what do the URLs look like? did you try finding the files handling the requests on the server? try adding more details to the question (use the edit link)\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Landmine",
            "text": "<html><body><span class=\"comment-copy\">\n I have looked for files on the server and other files. I think at this point the one way to get into it is find the original developer if he/she is still around or using the posted data to reverse engineer the code making with some trial and error.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Patrick Mevzek",
            "text": "<html><body><span class=\"comment-copy\">\n It would be useful to give more information about the company, even if it does not exist, as well as the specific system.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There's not much information to go on, but I would probably try to proceed like this:\n </p>\n <ol>\n  <li>\n   Figure out how the web server is running (e.g. what is the server process?) and where are the pages and any additional code handling user input (servlets?)\n  </li>\n  <li>\n   <p>\n    Analyze the code and try to find where the recovery mode is triggered and how the code is checked. If it's Java, there are numerous decompilers available.\n   </p>\n  </li>\n  <li>\n   <p>\n    Alternatively, you can analyze how the system interacts with the hardware and develop your own system that does what you need. However, this can be difficult if it's currently in non-working state.\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "May 19, 2018 at 18:09",
            "is_accepted": false,
            "comments": []
        }
    ]
}