{
    "title": "Confused about the value of edx and eax registers used at function entry",
    "link": "https://reverseengineering.stackexchange.com/questions/18300/confused-about-the-value-of-edx-and-eax-registers-used-at-function-entry",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am currently using IDA to disassemble a keygen. In the first few lines of a specific function before the\n  <code>\n   eax\n  </code>\n  and\n  <code>\n   edx\n  </code>\n  registers are given a value, their contents are moved to stack variables\n  <code>\n   var_40\n  </code>\n  and\n  <code>\n   var_44\n  </code>\n  .\n </p>\n <p>\n  Here's said function's initial assembly listing:\n </p>\n <pre><code>var_44= dword ptr -44h\nvar_40= dword ptr -40h\n\npush    ebp\nmov     ebp, esp\nadd     esp, 0FFFFFFA8h\npush    esi\npush    edi\nmov     [ebp+var_44], edx\nmov     [ebp+var_40], eax\n</code></pre>\n <p>\n  I would like to know what are the values of\n  <code>\n   EAX\n  </code>\n  and\n  <code>\n   EDX\n  </code>\n  .\n </p>\n <p>\n  Do they default to 0 since they weren't previously used and this is just an initialization of the local variable?\nThere are other stack variables that IDA declared, I only mentioned\n  <code>\n   var_40\n  </code>\n  and\n  <code>\n   var_44\n  </code>\n  since they are the ones I had trouble understanding.\n </p>\n <p>\n  Any help would be greatly appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "3k",
    "tags": [
        "ida",
        "register",
        "calling-conventions"
    ],
    "user": "aatate98",
    "time": "Jun 16, 2018 at 23:24",
    "comments": [
        {
            "user": "Johann Aydinbas",
            "text": "<html><body><span class=\"comment-copy\">\n What calling convention is this function? Are\n <code>\n  var_44\n </code>\n and\n <code>\n  var_40\n </code>\n used?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "aatate98",
            "text": "<html><body><span class=\"comment-copy\">\n yes they are used but to initialize ecx register later. Thats the only other occurence i could find with them\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Johann Aydinbas",
            "text": "<html><body><span class=\"comment-copy\">\n If this is a Delphi program, then it fits the Borland calling convention (first three arguments in eax, edx, ecx, rest on the stack). That means those two are just regular arguments to the function.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n You are giving us too little info to answer this question. It basically depends on ABI. Might be just zeroing/init, might be something else. Is it main method? Other?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <em>\n   TL;DR: The registers are used to pass arguments between the calling function to the callee. In order to understand their values you'll need to look at code prior to it being called.\n  </em>\n </p>\n <p>\n  Since you've mentioned the data stored from the registers is then used to initialize another register before a call, this is a case of data passed between functions using registers.\n </p>\n <p>\n  This may slightly look like saving registers for them to be restored prior to retuning back to the caller, however according to OP the values are\n  <em>\n   not\n  </em>\n  copied back from the stack (\n  <code>\n   var_44\n  </code>\n  ,\n  <code>\n   var_40\n  </code>\n  ) near the functions return. Additionally,\n  <code>\n   eax\n  </code>\n  is nearly never a preserved register so this is unlikely to be the case.\n </p>\n <h2>\n  What are calling conventions\n </h2>\n <p>\n  Calling convention is how arguments are passed between caller and callee functions. Wether arguments are stored on the stack, in registers or anyplace else by the caller function prior to calling the callee function, in order for the callee function to read them.\n </p>\n <p>\n  Once we know what calling conventions are, a question raises as to who defined what available calling conventions are available as well as picks the calling convention to use between functions. Obviously, if a caller and callee assume a different calling convention code will break and we'll likely to get a segfault.\n </p>\n <p>\n  Although this question may seem trivial in cases where the same compiler builds both the callee and caller, compiling different binaries by different compilers may complicate things.\n </p>\n <p>\n  You may want to read more about\n  <a href=\"https://en.wikipedia.org/wiki/Calling_convention\" rel=\"nofollow noreferrer\">\n   calling conventions\n  </a>\n  used by the compiler/architecture you're reverse engineering.\n </p>\n <h2>\n  fastcall calling conventions\n </h2>\n <p>\n  There are quite a few\n  <a href=\"https://en.wikipedia.org/wiki/X86_calling_conventions\" rel=\"nofollow noreferrer\">\n   x86 calling conventions\n  </a>\n  with several resembling each other but used by different compilers but x64 calling conventions are more standardized.\n </p>\n <p>\n  Originally, calling conventions heavily relied on the stack and all parameters were passed through it, however for performance reasons register usage became more frequent as it avoids the extra memory writes. Since not all data can be stored using registers (and other reasons) these are mixed calling conventions.\n </p>\n <p>\n  These mixed calling conventions are commonly called \"fastcall\" due to being faster by avoiding the unneeded stack writes. There are several x86 fast calling conventions, depending on compiler used. Although there are several calling conventions take make usage of the\n  <code>\n   eax\n  </code>\n  and\n  <code>\n   edx\n  </code>\n  , but the important thing to note here is\n  <strong>\n   that they're used for the values previously set by the calling function\n  </strong>\n  .\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Check what the values of edx and eax are prior to the function call. Since these registers aren’t cleared prior to being moved into the variables their existing values are probably just used and transferred into the local variables.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Chuck",
            "time": "May 17, 2018 at 10:22",
            "is_accepted": false,
            "comments": []
        }
    ]
}