{
    "title": "How to simplify C++ standard template library in IDA?",
    "link": "https://reverseengineering.stackexchange.com/questions/18463/how-to-simplify-c-standard-template-library-in-ida",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've a X64 DLL file which uses C++ standard library heavily. I've loaded the PDB symbol file in IDA and all the subroutines names\n  <code>\n   sub_xxyz\n  </code>\n  changes to\n  <code>\n   std::xyz\n  </code>\n  , which is as expected. But there are many subroutines, for example one name is like\n  <code>\n   std::basic_string<char,std::char_traits<char>,std::allocator<char>>::basic_string<char,std::char_traits<char>,std::allocator<char>>(void *Dst, _BYTE *a2, __int64 a3)\n  </code>\n  . Too long, isn't it ;)\n </p>\n <p>\n  Under the hood, all these subroutines mainly do some memory manipulation with\n  <code>\n   malloc()\n  </code>\n  ,\n  <code>\n   memcpy()\n  </code>\n  ,\n  <code>\n   memmove()\n  </code>\n  etc. Hence my question, Can I simplify those subroutines in IDA by any means?\n </p>\n</div>\n</body></html>",
    "votes": "5",
    "answers": 1,
    "views": "6k",
    "tags": [
        "ida",
        "disassembly",
        "c++"
    ],
    "user": "Biswapriyo",
    "time": "Jun 5, 2018 at 19:19",
    "comments": [
        {
            "user": "Sprite",
            "text": "<html><body><span class=\"comment-copy\">\n This plugin may be helpful to you.\n <a href=\"https://github.com/zyantific/REtypedef\" rel=\"nofollow noreferrer\">\n  github.com/zyantific/REtypedef\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Although this function name is indeed quite long, there's no easy way to simplify it nor is it too difficult to understand once you gain decent C++ development experience, using std especially. The TLDR answer is that this is a constructor for a\n  <a href=\"http://www.cplusplus.com/reference/string/string/\" rel=\"nofollow noreferrer\">\n   <code>\n    std::string\n   </code>\n  </a>\n  object (specifically this looks like the\n  <a href=\"http://www.cplusplus.com/reference/string/string/string/\" rel=\"nofollow noreferrer\">\n   substring(3) constructor\n  </a>\n  , but I'm not 100% sure).\n </p>\n <p>\n  If you visit the\n  <a href=\"http://www.cplusplus.com/reference/string/string/\" rel=\"nofollow noreferrer\">\n   <code>\n    std::string\n   </code>\n   reference page\n  </a>\n  , you'll see this is the definition for\n  <code>\n   std::string\n  </code>\n  :\n </p>\n <pre><code>typedef std::basic_string<char> string; \n</code></pre>\n <p>\n  The\n  <code>\n   std::string\n  </code>\n  class is being defined using the\n  <code>\n   std::basic_string\n  </code>\n  class template, which has three template parameters:\n </p>\n <ol>\n  <li>\n   the character type used for the string object.\n  </li>\n  <li>\n   an object to control some string traits.\n  </li>\n  <li>\n   The allocator used to actually allocate the string buffers for the class.\n  </li>\n </ol>\n <p>\n  In the\n  <code>\n   std::string\n  </code>\n  case, however, only the first template parameter is provided - the other two are the default ones defined based on the first template parameter (char), and although they can be replaced with different or more complex traits or allocators, this isn't the case for the\n  <code>\n   std::string\n  </code>\n  class.\n </p>\n <p>\n  Although the typedef string is pretty simple and straightforward thanks to the default templates parameters being unspecified, when the object is built and actually defined by the compiler the full definition is used, which adds a lot of boilerplate definitions.\n </p>\n <p>\n  If we split it up to it's parts, we'll see\n  <code>\n   std::basic_string\n  </code>\n  is being used and three template parameters are specified. As mentioned for the\n  <code>\n   std::string\n  </code>\n  , the second (\n  <code>\n   std::char_traits<char>\n  </code>\n  ) and third (\n  <code>\n   std::allocator<char>\n  </code>\n  ) are derived by the first and are both templates by themselves, receiving the same template parameter\n  <code>\n   std::basic_string\n  </code>\n  got (\n  <code>\n   char\n  </code>\n  ).\n </p>\n <p>\n  After the class definition, the two colons indicate a definition of an object under the class namespace:\n </p>\n <pre><code>::basic_string<char,std::char_traits<char>,std::allocator<char>>(void *Dst, _BYTE *a2, __int64 a3)\n</code></pre>\n <p>\n  We can easily see this is a function that has the same name as the class itself, which is the known way to define a constructor.\n </p>\n <p>\n  Lastly, as with every function we have the parameters this function accepts inside the parentheses:\n </p>\n <pre><code>void *Dst, _BYTE *a2, __int64 a3\n</code></pre>\n <p>\n  To simplify the full definition back to\n  <code>\n   std::basic_string<char>\n  </code>\n  , one would need to hold the default template parameters for all std template classes, and strip the ones that are recognized as the default ones. Although this is not a very difficult task, it seems a little redundant to me. You are obviously encouraged to either develop such a plugin yourself or suggest the feature improvement to the IDA development team.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "NirIzr",
            "time": "Jun 5, 2018 at 21:42",
            "is_accepted": true,
            "comments": [
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">@Biswapriyo The last paragraph discusses the task of actually simplifying those names but as mentioned I personally find it redundant.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@Nirlzr: may be a worthwhile endeavor parsing the for <code>typedef</code> occurrences that are specializations of the standard containers and use an IDAPython script or plugin to make the names more readable. But yeah, it looks kind of like a tedious task. It'd probably require some proper C++ parser like <code>libclang</code> in the first place.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">@0xC0000022L Not sure about the c++ parsing, because these function names are not really free strings but compiler-mangled names. There are slight variations between compilers (which IDA already support, obviously) but basically I think it is structured enough for you to not need a actual C++ parsing, at least on the plugin's side. I believe you could also scrape some DBs or websites to get the default values without doing any c++ parsing either. YMMV and I didn't go into details because I don't thing anybody should be wasting their time on that, tbh.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">@Biswapriyo I also went into details in here for anyone that is not familiar with the std and has trouble reading the function names. Goal was not to explain that one name you provided but show how std/template names are built and how they should be interpreted by the unfamiliar reader.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@NirIzr: I was referring to the part where one sifts through the STL headers, looking for <code>typedef</code> instances that look akin to <code>typedef basic_string&lt;wchar_t&gt; wstring</code> for any number of container classes. Because that's where the short names come from (<code>std::string</code>, <code>std::wstring</code> etc) and where the defaults will be known (provided you can parse C++). With libclang it's really a lot easier than it used to be (e.g. trying to parse the XML AST output from GCC).</span>",
                    "time": null
                }
            ]
        }
    ]
}