{
    "title": "Getting R6034 error message when starting IDA Pro",
    "link": "https://reverseengineering.stackexchange.com/questions/18565/getting-r6034-error-message-when-starting-ida-pro",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have installed Anaconda on Windows to replace standalone Python installation that was used by the IDA Pro. I have confirmed that all relevant environment variables and register keys were set to point to the Anaconda instead of c:\\python27-x64. However after that IDA Pro failed to load my plugins (complaining that it can't find certain libraries). What helped to resolved this problem was deleting python27.dll from c:\\Windows\\System32.\n </p>\n <p>\n  After deleting python27.dll, IDA Pro was able to load IDAPython plugins, they in turn were able to find libraries located in Anaconda directory and everything seemed to be working fine with the built-in Python console. However it started to give me R6034 error message each time I am launching IDA Pro, saying \"An application has made an attempt to load the C runtime library incorrectly\".\n </p>\n <p>\n  Currently I don't see any side effects of getting this error message except that I was unable to install QT console (\n  <a href=\"https://github.com/james91b/ida_ipython\" rel=\"nofollow noreferrer\">\n   https://github.com/james91b/ida_ipython\n  </a>\n  ) following the procedure outlined there, which makes me think that the error message may be somehow preventing me from installing it.\n </p>\n <p>\n  Copying python27.dll from Anaconda folder into c:\\Windows\\System32 doesn't help to remove the error message. What can be done to resolve it?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "607",
    "tags": [
        "ida",
        "idapython",
        "ida-plugin"
    ],
    "user": "pigeek",
    "time": "Jun 20, 2018 at 0:12",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n not RE, but see\n <a href=\"https://stackoverflow.com/a/14680947\">\n  stackoverflow.com/a/14680947\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}