{
    "title": "How do I add functionality to an existing binary executable?",
    "link": "https://reverseengineering.stackexchange.com/questions/185/how-do-i-add-functionality-to-an-existing-binary-executable",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I want to add some functionality to an existing binary file. The binary file was created using\n  <code>\n   gcc\n  </code>\n  .\n </p>\n <ul>\n  <li>\n   Do I need to decompile the binary first, even though I sufficiently understand the functioning of the program ?\n  </li>\n  <li>\n   How should I go about adding the necessary code ?\n  </li>\n  <li>\n   Do I need any tools to be able to do this ?\n  </li>\n </ul>\n</div>\n</body></html>",
    "votes": "48",
    "answers": 8,
    "views": "34k",
    "tags": [
        "linux",
        "c",
        "executable",
        "hll-mapping"
    ],
    "user": "asheeshr",
    "time": "Apr 5, 2013 at 13:25",
    "comments": [
        {
            "user": "Remko",
            "text": "<html><body><span class=\"comment-copy\">\n for what platform eg windows, linux?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "sw.",
            "text": "<html><body><span class=\"comment-copy\">\n What is the functionality that you want to add? because depending on that there are different approaches. For example for automating a GUI you use a different technique that for example changing a database engine.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ciro Santilli OurBigBook.com",
            "text": "<html><body><span class=\"comment-copy\">\n <a href=\"http://stackoverflow.com/questions/4309771/disassembling-modifying-and-then-reassembling-a-linux-executable\" title=\"disassembling modifying and then reassembling a linux executable\">\n  stackoverflow.com/questions/4309771/…\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There are several broad ways in which you could do this.\n </p>\n <ol>\n  <li>\n   <p>\n    Dynamic instrumentation\n   </p>\n   <p>\n    Tools such as\n    <a href=\"http://software.intel.com/en-us/articles/pin-a-dynamic-binary-instrumentation-tool\">\n     PIN\n    </a>\n    ,\n    <a href=\"http://valgrind.org/\">\n     Valgrind\n    </a>\n    , or\n    <a href=\"http://www.dynamorio.org/\">\n     DynamoRIO\n    </a>\n    allow you to dynamically change the behavior of a program.  For instance, you can add calls to new functions at particular addresses, intercept library calls and change them, and much more.\n   </p>\n   <p>\n    The downside is that dynamic instrumentation often has high overhead.\n   </p>\n  </li>\n  <li>\n   <p>\n    Static instrumentation\n   </p>\n   <p>\n    You can also try to statically modify the program to add the desired behavior.  One challenge is that you often need to muck around with the executable file format.  Some tools, such as\n    <code>\n     elfsh\n    </code>\n    from the\n    <a href=\"http://www.eresi-project.org/\">\n     ERESI\n    </a>\n    project exist for this, but I have found them buggy and difficult to use.\n   </p>\n   <p>\n    Another strategy for static instrumentation is to \"recompile\".  You can do this by decompiling the program, modifying the source code, and recompiling.  In theory, you could also use a tool like\n    <a href=\"http://bap.ece.cmu.edu\">\n     BAP\n    </a>\n    to lift the program to IL, modify it, and then re-compile it using LLVM.  However, the current version is probably not mature enough for this.\n   </p>\n  </li>\n  <li>\n   <p>\n    Dynamic loading\n   </p>\n   <p>\n    You can use\n    <code>\n     LD_PRELOAD\n    </code>\n    to override functions that are going to be dynamically linked.  This is a nice option when you want to change the behavior of a library function.  Naturally, it does not work on statically linked binaries, or for static functions.\n   </p>\n  </li>\n  <li>\n   <p>\n    Binary patching\n   </p>\n   <p>\n    You can often make simple changes to a binary using a hex-editor.  For instance, if there is a function call or branch you would like to skip, you can often replace it with\n    <code>\n     nop\n    </code>\n    instructions.  If you need to add a large amount of new code, you will probably need to use something like\n    <code>\n     elfsh\n    </code>\n    from the\n    <a href=\"http://www.eresi-project.org/\">\n     ERESI\n    </a>\n    project to help you resize the binary.\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "39",
            "user": "Ed McMan",
            "time": "Mar 23, 2013 at 15:47",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Very often, you can change the behavior of a program by carefully hooking into it. Whether you can add the functionality you want this way depends on how the program is constructed. It helps if the program comes in the form of one main executable plus several libraries.\n </p>\n <p>\n  You can hook into any call that the program makes to shared libraries by linking your own library in first, with\n  <code>\n   LD_PRELOAD\n  </code>\n  . Write a library that defines a function\n  <code>\n   foo\n  </code>\n  , and set the environment variable\n  <code>\n   LD_PRELOAD\n  </code>\n  to the path to your compiled (\n  <code>\n   .so\n  </code>\n  ) library when you start the program: then the program will call your\n  <code>\n   foo\n  </code>\n  instead of the one it intends. You can call the original\n  <code>\n   foo\n  </code>\n  function from your replacement by obtaining a pointer to it with\n  <code>\n   dlsym()\n  </code>\n  .\n </p>\n <p>\n  Here are a few examples and tutorials:\n </p>\n <ul>\n  <li>\n   <a href=\"http://www.technovelty.org/c/using-ld_preload-to-override-a-function.html\">\n    Using LD_PRELOAD to override a function\n   </a>\n   — a minimal source code example\n  </li>\n  <li>\n   <a href=\"http://www.linuxjournal.com/article/7795\">\n    Modifying a Dynamic Library Without Changing the Source Code\n   </a>\n  </li>\n  <li>\n   <a href=\"http://fluxius.handgrep.se/2011/10/31/the-magic-of-ld_preload-for-userland-rootkits/\">\n    The magic of LD_PRELOAD for Userland Rootkits\n   </a>\n  </li>\n  <li>\n   <a href=\"https://nf.nci.org.au/training/talks/lca2009.pdf\">\n    Fun with LD_PRELOAD\n   </a>\n   (a long and detailed presentation)\n  </li>\n </ul>\n <p>\n  Some examples of programs that use\n  <code>\n   LD_PRELOAD\n  </code>\n  :\n </p>\n <ul>\n  <li>\n   <a href=\"https://github.com/fakechroot/fakechroot\">\n    fakechroot\n   </a>\n   ,\n   <a href=\"http://plasticfs.sourceforge.net/\">\n    PlasticFS\n   </a>\n   — rewrite the file names used by the program\n  </li>\n  <li>\n   <a href=\"http://perens.com/FreeSoftware/ElectricFence/\">\n    Electric Fence\n   </a>\n   ,\n   <a href=\"http://valgrind.org/\">\n    Valgrind\n   </a>\n   — detect bad heap usage by overriding\n   <code>\n    malloc\n   </code>\n  </li>\n  <li>\n   <a href=\"http://freecode.com/projects/libshape\">\n    Libshape\n   </a>\n   — limit the network bandwidth\n  </li>\n  <li>\n   <a href=\"http://kde-apps.org/content/show.php?content=36077\">\n    KGtk\n   </a>\n   — use KDE dialog boxes in a Gtk program\n  </li>\n </ul>\n <p>\n  The limitation of\n  <code>\n   LD_PRELOAD\n  </code>\n  is that you can only intercept function calls that are resolved at runtime (dynamic linking). If you want to intercept an internal call, you'll have to resort to heavier-weight techniques (modifying the executable on-disk, or in-memory with\n  <code>\n   ptrace\n  </code>\n  ).\n </p>\n</div>\n</body></html>",
            "votes": "18",
            "user": "Gilles 'SO- stop being evil'",
            "time": "Mar 23, 2013 at 14:53",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   I want to add some functionality to an existing binary file.\n  </p>\n </blockquote>\n <p>\n  So in general these four bigger Questions apply to modifying an Executeable:\n </p>\n <p>\n  <strong>\n   The first basic Question posed:\n  </strong>\n  Is the Program wary of Code Modifications (Self-Checking, Anti-Debug-Tricks, Copy protection, ...)?\n </p>\n <p>\n  If so:\n </p>\n <ol>\n  <li>\n   Is it even possible to remove/circumevent these protections (e.g. unpacking, if it is packed) easily\n  </li>\n  <li>\n   Is it worth the time to do so?\n  </li>\n </ol>\n <p>\n  <strong>\n   The second Question is:\n  </strong>\n  \n\n  Can you find out, which Compiler/Language was used to produce the executeable?\n </p>\n <p>\n  More Details are better, but most basic constructs (\n  <code>\n   if\n  </code>\n  and other control-structures) should map quite similarly over a variety of compilers.\n </p>\n <p>\n  This is related to a previous\n  <a href=\"https://reverseengineering.stackexchange.com/questions/11/what-hints-in-machine-code-can-point-me-to-the-compiler-which-was-used-to-genera/\" title=\"reverseengineering.stackexchange.com -- Detecting the used Compiler via hints in Machine Code & does this Help?\">\n   Question on the RE-Stackexchange\n  </a>\n  .\n </p>\n <p>\n  <strong>\n   The third Question is:\n  </strong>\n  \n\n  How is the user interface implemented (CLI, Win32-Window Controls, Custom, ...)?\n </p>\n <p>\n  If this is known:\n  \n\n  Can you figure out the mapping of common HLL-Constructs (Menues, Dropdown-Menues, Checkboxes, ...) in conjunction with the used Compiler/Language that you want to modify?\n </p>\n <p>\n  <strong>\n   The fourth and biggest Question is:\n  </strong>\n  \n\n  How can you create the desired functionality in the Program?\n </p>\n <p>\n  In essence this can require quite a bit of reverse engineering, to find out how to best hook into the program without upsetting it.\n </p>\n <p>\n  Central Point: How can you utilize existing internal API's to reach your Goal, without breaking Stuff (like CRTL+Z, Versioning, Recovery features)?\n  <ul>\n   <li>\n    existing Datastructures (and how are they related?)\n   </li>\n   <li>\n    existing Functions (Parameters, Parameter-Format, ...)\n    <ul>\n     <li>\n      What does it do?\n     </li>\n     <li>\n      What else can it do?\n     </li>\n     <li>\n      What does it REALLY do?\n     </li>\n     <li>\n      ...\n     </li>\n    </ul>\n   </li>\n   <li>\n    existing Processes (= How the program goes about internally, stepwise to implement similar features)\n    <ul>\n     <li>\n      What functions are called, in which order?\n     </li>\n     <li>\n      Which Data-Structures are utilized?\n     </li>\n    </ul>\n   </li>\n   <li>\n    Where is the Meat of the feature/program (the data, e.g. the main painting area, and how does it relate internally?)\n   </li>\n   <li>\n    Stuff to look out for (if it concerns the desired feature):\n    <ul>\n     <li>\n      Journaling\n     </li>\n     <li>\n      Recovery Features\n     </li>\n     <li>\n      Versioning\n     </li>\n    </ul>\n   </li>\n   <li>\n    How is Metadata handled (e.g. Shutter speed, f-Stops, ...), that is related to the desired Feature.\n   </li>\n  </ul>\n </p>\n <p>\n  <b>\n   Example projects:\n  </b>\n </p>\n <ul>\n  <li>\n   Building a new kind of painting tool into a graphics program (without plugin-API).\n  </li>\n  <li>\n   Extending the plugin-API of a program.\n  </li>\n  <li>\n   Building a plugin-API into a program without one.\n  </li>\n  <li>\n   Adding a new save/export-format for files (if there is no way to convert the output-format into a desired format, or if crucial information is missing in the exported files).\n  </li>\n  <li>\n   Adding a new import-format (if there is no way to convert the input-format into a importable-format or if some information is not correctly imported).\n  </li>\n  <li>\n   Extending Mspaint with a colour search-and-replace tool (within a selection, or in the whole picture)\n  </li>\n  <li>\n   Adding Proxy Support/Basic Proxy-Authentication to a Program.\n  </li>\n  <li>\n   Adding (new) Command line switches to a program that expose new/existing Features.\n  </li>\n  <li>\n   Adding a API for Remote Procedure-Calls to Manage the Operations of the Programm externally.\n  </li>\n  <li>\n   Adding Scripting-Support to automate often repeated Operations (If there is no plugin-/scripting-API to begin with) or support batch processing.\n  </li>\n </ul>\n <p>\n  <strong>\n   Regarding wrapped Code & Decompilers:\n  </strong>\n  \n\n  I will not talk about wrapped Code in other Languages that is packaged with a VM / an Interpreter (Py2Exe, Java 2 Exe, ...), or uses an installed one (JVM, C#). There are pretty good Decompilers for some of those cases. After a successful decompilation it pretty much boils down to defeating the Code Obfuscation (if there is one).\n </p>\n <p>\n  <strong>\n   Regarding C/C++-Decompilers:\n  </strong>\n  \n\n  I cannot talk about C/C++-Decompilers, though it would boil down to best-effort HLL-Remapping (for stuff the Decompiler did not get) and Code-Deobfuscation (if it was compiled without Symbols) provided there is no further Protection in the Executeable.\n </p>\n <p>\n  <strong>\n   Reccommendation regarding HLL-mapping:\n  </strong>\n  \n\n  In essence a big part of this Question concerns \"HLL mapping\" (High level language mapping (in machine code)) of and the modification of these constructs in the corresponding machine code.\n </p>\n <p>\n  I found an excellent downloadable starting course, that uses \"IDA Free\", on this Topic\n  <a href=\"http://binary-auditing.com/\" rel=\"nofollow noreferrer\" title=\"Free IDA Pro Binary Auditing Training Material for University Lectures\">\n   here\n  </a>\n  (binary-auditing.com).\n </p>\n</div>\n</body></html>",
            "votes": "7",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  (Slightly outdated, but as that wasn't mentioned previously in this thread)\n </p>\n <p>\n  Long ago, I spend months extending a software with only the binary.\n </p>\n <ul>\n  <li>\n   I used IDA for analysis and SoftICE for live debugging. Decompiling is not required if you can understand the target at opcode/bytecode level.\n  </li>\n  <li>\n   <p>\n    Then, because it was an x86 PE binary, I used Tasm and Iczelion's\n    <strong>\n     Code Snippet Creator\n    </strong>\n    : It's not a famous tool anymore, but it allowed to use Tasm transparently and re-inject code, with PE transformations, etc...\n   </p>\n   <p>\n    It added code at EntryPoint, so I did my own patches manually, then jumped to original EntryPoint.\n   </p>\n  </li>\n </ul>\n <p>\n  A bit old-school now - I'd probably inject a DLL these days - but it certainly worked.\n </p>\n <p>\n  And at least, it gives you full control via ASM, while keeping maintainability via automated patching.\n </p>\n</div>\n</body></html>",
            "votes": "7",
            "user": "Ange",
            "time": "Mar 26, 2013 at 10:45",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You do not need to decompile the binary. If you understand what changes you want to make, and those changes can be made by only modifying the binary file or its dependencies, then you can just make those modifications on disk or in memory.\n </p>\n <p>\n  You have a few choices on how to effect the modification itself.\n </p>\n <p>\n  You could use LD_PRELOAD to have the linker load a shared object before the binary runs. Then you don't need to modify the binary on disk at all. This is kind of what valgrind does, it loads as a shared object but then begins dynamic binary instrumentation.\n </p>\n <p>\n  You could use\n  <a href=\"http://valgrind.org/info/tools.html\" rel=\"nofollow\">\n   valgrind\n  </a>\n  . Valgrind would allow you to dynamically re-write the program and modify its behavior arbitrarily. Valgrind is a dynamic binary instrumentation program that allows its tools to edit the program while it executes. If you just want to change program behavior this might work, but valgrind also incurs a global slowdown and if you wanted to patch and redistribute a program, it probably is not ideal.\n </p>\n <p>\n  You could also use tools like\n  <a href=\"http://www.eresi-project.org/\" rel=\"nofollow\">\n   elfsh/eresi\n  </a>\n  to insert new code into the program. Those tools should take care of the act of injecting your code with relation to stuff like the ELF program header. There is a concept of \"ELF infector\" that you could google for, where your injected code becomes the new program entry point, does something, then jumps to the old program entry point.\n </p>\n</div>\n</body></html>",
            "votes": "6",
            "user": "Lizz",
            "time": "Apr 6, 2013 at 17:43",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <h1>\n  Doing that on Windows\n </h1>\n <p>\n  Although this question focuses on Linux, where personally I would go with the easy\n  <code>\n   LD_PRELOAD\n  </code>\n  method as outlined in other answers, Windows knows a similar mechanism that in fact has been abused in the more recent past (also see alternative approaches below). I used that method to \"crack\" one dongle system.\n </p>\n <p>\n  Enter ...\n </p>\n <h2>\n  DLL placement (aka preloading, aka hijacking) attacks\n </h2>\n <p>\n  The name has been given to the method fairly recently when it turned out that placing DLLs on remote shares and then navigating to shares in, say a media player, would result in the media player loading the remote DLL instead of a local version. This is by design. Changing it now would break hundreds if not thousands of applications.\n </p>\n <p>\n  This has been addressed by Microsoft\n  <a href=\"https://docs.microsoft.com/en-us/windows/win32/dlls/dynamic-link-library-search-order\" rel=\"nofollow noreferrer\">\n   in certain ways\n  </a>\n  , although the only real solution is proper implementation on the application side. But then, many developers haven't even grasped NT security even though we have to deal with it ever since Windows 2000 became the first consumer OS based on the NT platform.\n </p>\n <h3>\n  What does it have to do with your described goal?\n </h3>\n <p>\n  Adding functionality doesn't necessarily imply that you patch the executable on-disk. You can also do it in memory.\n </p>\n <h3>\n  How can you leverage it?\n </h3>\n <p>\n  Whenever an application uses a DLL, and you can tell the load order with\n  <a href=\"https://www.dependencywalker.com/\" rel=\"nofollow noreferrer\">\n   Dependency Walker\n  </a>\n  or under a debugger, you can pick one of the DLLs it imports and replace that (in its current location) or placing another DLL in a path that precedes the existing DLL in the load order.\n </p>\n <p>\n  An alternative method is to change the name of the imported DLLs. In rare cases (well known DLLs, for example) this is the only viable method to load an alternative DLL and may still fail for certain special cases.\n </p>\n <h3>\n  Limitations\n </h3>\n <p>\n  If the used DLL exists in the first location in the DLL search order, you'll literally have to replace the file on disk, unless you rename the import as briefly mentioned above.\n </p>\n <h3>\n  Implementations\n </h3>\n <p>\n  A manual approach can be used for DLLs with only few exported symbols. The easiest would be to create a module definition file from the the DLL and from that create a DLL with only function forwarders. This way your placed DLL would get loaded already and would simply pass through the calls.\n </p>\n <p>\n  However, this approach will fail with exported variables (as opposed to functions).\n </p>\n <p>\n  Here's a simple Python script based on\n  <a href=\"https://github.com/erocarrera/pefile\" rel=\"nofollow noreferrer\">\n   <code>\n    pefile\n   </code>\n  </a>\n  which I wrote for\n  <a href=\"https://stackoverflow.com/a/15117763/476371\">\n   another answer over at StackOverflow\n  </a>\n  :\n </p>\n <pre><code>import os\nimport sys\nimport re\n\ndef main(pename):\n    from pefile import PE\n    print \"Parsing %s\" % pename\n    pe = PE(pename)\n    modname = os.path.basename(pename)\n    libname = re.sub(r\"(?i)^.*?([^\\\\/]+)\\.(?:dll|exe|sys|ocx)$\", r\"\\1.lib\", modname)\n    defname = libname.replace(\".lib\", \".def\")\n    print \"Writing module definition file %s for %s\" % (defname, modname)\n    f = open(defname, \"w\") # want it to throw, no sophisticated error handling here\n    f.write(\"LIBRARY %s\n\n\" % modname)\n    f.write(\"EXPORTS\n\")\n    numexp = 0\n    for exp in pe.DIRECTORY_ENTRY_EXPORT.symbols:\n        if exp.name:\n            numexp += 1\n            f.write(\"\\t%s\n\" % exp.name)\n    print \"Wrote %s with %d exports\" % (defname, numexp)\n    print \"\n\nUse this to create the export lib:\n\\tlib /def:%s /out:%s\" % (defname, libname)\n\nif __name__ == '__main__':\n    if len(sys.argv) != 2:\n        sys.stderr.write(\"ERROR:\n\\tSyntax: fakelib <dllfile>\n\")\n        sys.exit(1)\n    sys.exit(main(sys.argv[1]))\n</code></pre>\n <p>\n  You could adjust it to create\n  <a href=\"https://devblogs.microsoft.com/oldnewthing/20060719-24/?p=30473\" rel=\"nofollow noreferrer\">\n   function forwarders\n  </a>\n  instead of a simple module definition with exported names.\n </p>\n <p>\n  So this way you can shuttle your code into the target application and go from there.\n </p>\n <h2>\n  Alternative approaches\n </h2>\n <p>\n  Instrumentation and hooking have been mentioned already.\n  <a href=\"https://www.microsoft.com/en-us/research/project/detours/?from=http://research.microsoft.com/en-us/projects/detours/\" rel=\"nofollow noreferrer\">\n   Detours\n  </a>\n  is an often mentioned example of hooking with an inconvenient EULA for most practical purposes. Refer to the existing answers for this kind of approach.\n </p>\n <p>\n  You can also use the\n  <a href=\"https://docs.microsoft.com/en-US/windows/win32/dlls/secure-boot-and-appinit-dlls\" rel=\"nofollow noreferrer\">\n   <code>\n    AppInit_DLL\n   </code>\n  </a>\n  registry value to inject a DLL early on. Or you could write a little launcher with a debugger loop and use\n  <a href=\"https://docs.microsoft.com/en-us/previous-versions/visualstudio/visual-studio-2010/a329t4ed%28v=vs.100%29\" rel=\"nofollow noreferrer\">\n   <code>\n    Image File Execution Options\n   </code>\n  </a>\n  to have your target launch your debugger first. A debugger can also influence the DLL loading or simply intercept - conveniently - calls at the boundary between executable and DLLs.\n </p>\n <p>\n  Trivia: this (\n  <code>\n   Image File Execution Options\n  </code>\n  ) is how Process Explorer replaces Task Manager when you choose the option inside Process Explorer.\n </p>\n <hr/>\n <p>\n  You'll notice how you can sort these approaches into the categories\n  <a href=\"https://reverseengineering.stackexchange.com/a/192/245\">\n   Ed McMan mentioned in his answer\n  </a>\n  already. However, I'll leave that as an exercise to the reader :)\n </p>\n</div>\n</body></html>",
            "votes": "6",
            "user": "Glorfindel",
            "time": "Jul 20, 2022 at 8:43",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I did this with Notepad.exe on Windows. I wanted to add one top-menu item to open calc.exe just for fun (I know your question is tagged Linux and gcc compiler, but the idea is probably the same).\n </p>\n <p>\n  So I used\n  <a href=\"http://www.angusj.com/resourcehacker/\" rel=\"nofollow\">\n   Resource Hacker\n  </a>\n  tool to add Calc menu and opened notepad.exe on\n  <a href=\"http://debugger.immunityinc.com/\" rel=\"nofollow\">\n   Immunity Debugger\n  </a>\n  looking for some space in the code where I could put my\n  <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/ms687393%28v=vs.85%29.aspx\" rel=\"nofollow\">\n   WinExec\n  </a>\n  shellcode. Initially I didn't change the executable, I had to look at the program in memory to find some space where I could paste my assembly instructions without crashing notepad.\n </p>\n <p>\n  Once I found enough space (changing original code by eliminating some not required assembly instructions or even optimizing them) I opened notepad.exe on\n  <a href=\"http://www.chmaas.handshake.de/delphi/freeware/xvi32/xvi32.htm\" rel=\"nofollow\">\n   XVI Hex Editor\n  </a>\n  and searched for the opcodes that was running on Immunity. I mean, the debugger was running some opcodes right? I just searched for a sequence of opcodes to be sure I was at the right piece of the software that I wanted to change and pacthed it with my shellcode (now this is not assembly code but the \"compiled\" assembly - machine code)\n </p>\n <p>\n  Again: I know your question is tagged Linux and gcc compiler, but maybe someone could point out some tools in Linux to achieve the same I did on Windows. The idea is probably the same.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "jyz",
            "time": "Mar 23, 2013 at 15:43",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  \"ptrace()\" was casually mentioned by Giles.   But I think it deserved a whole section by itself.   \"ptrace()\" is a system call API provided by OS (Linux and all UNIX have it, and so do Windows) to exert debug control over another process.   When you used PTRACE_ATTACH (as part of ptrace()) to attach to another process, the kernel will pause the CPU running that process completely, allowing you to make changes to ANY part of the process: CPU, any registers, any part of that process memory etc.   That is how dynamic inline hooking work.    (ptrace() attach, modify binary in-memory, and then ptrace() unattached).   As far as I know, all dynamic modification of another process has to use ptrace() - as that is the only mechanism provided by kernel to guarantee integrity via system call at this point.\n </p>\n <p>\n  But recently similar API like utrace() is popping up, and so\ninline hooking is also theoretically possible:\n </p>\n <p>\n  <a href=\"http://landley.net/kdocs/ols/2007/ols2007v1-pages-215-224.pdf\" rel=\"nofollow noreferrer\">\n   http://landley.net/kdocs/ols/2007/ols2007v1-pages-215-224.pdf\n  </a>\n </p>\n <p>\n  For kernel hooking, there are many methods:   syscall, interrupt, and inline hooking.   This is for interrupt hooking:\n </p>\n <p>\n  <a href=\"http://mammon.github.io/Text/linux_hooker.txt\" rel=\"nofollow noreferrer\">\n   http://mammon.github.io/Text/linux_hooker.txt\n  </a>\n </p>\n <p>\n  When the CPU is in STOP mode, basically you can do anything you like to the CPU/memory space/register - just make sure you restore back to its original state before returning to the original address where it stopped.\n </p>\n <p>\n  And if you use library inject technique, you can implement any functionalities - calling remote libraries, remote shell etc:\n </p>\n <p>\n  <a href=\"https://attack.mitre.org/techniques/T1055/001/\" rel=\"nofollow noreferrer\">\n   https://attack.mitre.org/techniques/T1055/001/\n  </a>\n </p>\n <p>\n  <a href=\"https://stackoverflow.com/questions/24355344/inject-shared-library-into-a-process\">\n   https://stackoverflow.com/questions/24355344/inject-shared-library-into-a-process\n  </a>\n </p>\n <p>\n  <a href=\"https://backtrace.io/blog/backtrace/elf-shared-library-injection-forensics/\" rel=\"nofollow noreferrer\">\n   https://backtrace.io/blog/backtrace/elf-shared-library-injection-forensics/\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Peter Teoh",
            "time": "Dec 12, 2020 at 6:05",
            "is_accepted": false,
            "comments": []
        }
    ]
}