{
    "title": "Find out where the string comes from (in Browser)",
    "link": "https://reverseengineering.stackexchange.com/questions/18797/find-out-where-the-string-comes-from-in-browser",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  i.e. on a page, I see that after i.e. 5 seconds of page load, there appears a message:\n </p>\n <pre><code>Hello Akubatula, you are wonderful.\n</code></pre>\n <p>\n  Lets say, i want to find out, from where does the word\n  <code>\n   wonderful\n  </code>\n  comes from. It is not in source, I can't find it in  sources (\n  <code>\n   Inspect>Sources>CTRL+SHIFT+S\n  </code>\n  )...\n </p>\n <p>\n  How can i find from which script/event it is loaded?\nI know a bit about breakpoints, but i was unable to find that moment/script, which triggers that event. Is that possible to breakpoint or search by that string?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "86",
    "tags": [
        "debugging",
        "websites"
    ],
    "user": "T.Todua",
    "time": "Jul 14, 2018 at 15:49",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Sounds like it could be data coming from the server via an AJAX call, where they perhaps have a service that fetches a message (at random?) from within an array of messages like that. If it is, then assuming you're in Chrome:\n </p>\n <ol>\n  <li>\n   Click the\n   <code>\n    Network\n   </code>\n   tab.\n  </li>\n  <li>\n   Click the\n   <code>\n    XHR\n   </code>\n   button. If you do not see it, then you'll need to click the\n   <code>\n    Filter\n   </code>\n   icon first.\n  </li>\n  <li>\n   Make sure the\n   <code>\n    Record\n   </code>\n   icon is on (red).\n  </li>\n  <li>\n   Refresh the page and then wait for that message to appear on the page. If it doesn't, then if you don't mind logging back in and everything, you may need to click the\n   <code>\n    Application\n   </code>\n   tab, then\n   <code>\n    Clear storage\n   </code>\n   , then the\n   <code>\n    Clear site data\n   </code>\n   button (which will effectively make it as though you're visiting the site for the very first time from your device/browser, though this won't do much if they remotely track that behavior).\n  </li>\n  <li>\n   Just before, you should have seen new activity in your Network window.\n  </li>\n  <li>\n   If so, click on the XHR names of interest, then in the right-hand pane (of which you may need to stretch DevTools out farther to see), look in the\n   <code>\n    Preview\n   </code>\n   and/or\n   <code>\n    Response\n   </code>\n   tabs and see if you see your text there, perhaps as a JSON key/value pair (i.e.,\n   <code>\n    {\"msg\":\"Here is your message\"}\n   </code>\n   ).\n  </li>\n  <li>\n   If so, then you can click the\n   <code>\n    Headers\n   </code>\n   tab to get more information on the API call, then go about looking for information related to the data therein, residing in the client-side source files.\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "1",
            "user": "dsasmblr",
            "time": "Jul 14, 2018 at 18:18",
            "is_accepted": true,
            "comments": []
        }
    ]
}