{
    "title": "File Decryption Problems",
    "link": "https://reverseengineering.stackexchange.com/questions/18941/file-decryption-problems",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  over the past year, I provided an English patch to a community of thousands of players of a game I love and which is not available in English (just Chinese and Korean).\n </p>\n <p>\n  Sadly, besides me, other people created cheat tools for the game forcing and the developers to react by encrypting the files of the client.\nEven tho I am happy they make an effort to prevent cheating, I am sad I can no longer provide the community with my English patch.\n </p>\n <p>\n  I spent the last few days trying to crack the files to be able to understand how I can decrypt them, replace the Chinese with my English content, and then encrypt it again.\n </p>\n <p>\n  However I was not lucky with this, the files are super weird.\n </p>\n <p>\n  we have tried to identify the structure and came up with\n </p>\n <pre><code>key (8byte) + filesize (4byte) + junk (0-6byte) + data\n</code></pre>\n <p>\n  but we are not sure about the junk part\n </p>\n <p>\n  Here's an\n  <a href=\"https://cdn.discordapp.com/attachments/473414300971696142/473781792982171649/AccountProxy.txt\" rel=\"nofollow noreferrer\">\n   encrypted new version\n  </a>\n  and a\n  <a href=\"https://cdn.discordapp.com/attachments/473414300971696142/473781898817175552/AccountProxy.txt\" rel=\"nofollow noreferrer\">\n   decrypted old version\n  </a>\n  of the same file.\nI picked this file as it seems to not have changed between encrypted and decrypted version.\n </p>\n <p>\n  Does anyone have any tips/pointers for me?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "117",
    "tags": [
        "file-format",
        "decryption",
        "xor"
    ],
    "user": "Gardosen",
    "time": "Jul 31, 2018 at 17:47",
    "comments": [
        {
            "user": "sudhackar",
            "text": "<html><body><span class=\"comment-copy\">\n Are you sure about the files you attached? The sizes don't correlate by the pattern you mentioned.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Gardosen",
            "text": "<html><body><span class=\"comment-copy\">\n that's what i meant, it looks weird.  we have tried some bruteforce xor encryption keys and on another file we were able to decrypt the first part which gave us   autoImport(\"TestEffe  the rest was still scrambled  we are kinda lost on this :/ i am abit worried i have to close the english patch project\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "sudhackar",
            "text": "<html><body><span class=\"comment-copy\">\n The normal file is larger in size than the encrypted version.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Gardosen",
            "text": "<html><body><span class=\"comment-copy\">\n yes, one of our team noticed that it seems that there was a conversion happening which changed all CRLF at the end of each line to LF. maybe this is what you see.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user22970",
            "text": "<html><body><span class=\"comment-copy\">\n mind sharing the name of the game? tried working with those files only but thinking about it, the \"autoImport\" could be coincidental. you can get any result by xoring a given string with the appropriate \"key\"\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}