{
    "title": "What does \"Process exited cleanly (number)\" mean?",
    "link": "https://reverseengineering.stackexchange.com/questions/19093/what-does-process-exited-cleanly-number-mean",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to bypass the security that checks if a file is modified on an android app and will crash without error if modified. It have around 10 fake crashes. I have bypassed some of them in smali and libs but it still keep crashing and Zygote returns different numbers like 2, 4, 15, 25, etc. There is no explanation or details about \"Process exited cleanly\"\n </p>\n <p>\n  Can anyone explain what that \"Process exited cleanly\" means and what c++ codes could be used to fake crash than getpid+kill, exit, abort?\n </p>\n <p>\n  Here is what it says in logcat:\n </p>\n <pre><code>08-18 23:02:10.751 I/ActivityManager(412): Process com.xxx.xxx (pid 17716) has died\n08-18 23:02:10.768 I/Zygote  (160): Process 17716 exited cleanly (15)\n</code></pre>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "890",
    "tags": [
        "c++",
        "android"
    ],
    "user": "0xabc",
    "time": "Aug 18, 2018 at 21:11",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Exited cleanly means that the process was not terminated by a signal, but called the exit system call. This happens usually due to a call to exit, _exit or returning from main. The number in parenthesis is the\n  <em>\n   exit code\n  </em>\n  , which is the parameter passed to exit or the value returned from main.\n </p>\n <p>\n  If you are lucky, the number is unique to the check that failed. If you are unlucky, there is code to terminate the process on tampering which directly calls the exit system call without setting the register used for the exit code, so the number is mostly \"random junk\".\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Michael Karcher",
            "time": "Aug 24, 2018 at 17:34",
            "is_accepted": true,
            "comments": []
        }
    ]
}