{
    "title": "Missing kernel32.dll in import table",
    "link": "https://reverseengineering.stackexchange.com/questions/19096/missing-kernel32-dll-in-import-table",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have very basic application which is console app dispaying message box. \nIn Visual Studio I change following options:\n </p>\n <pre><code>- C/C++ -> SecurityCheck -> Disable Security Check (/GS-)\n- Linker -> Advanced -> Entry Point -> main\n- Linker -> Input -> -> Ignore All Default Libraries -> Yes (/NODEFAULTLIB)\n</code></pre>\n <p>\n  to remove from .exe all dependenies like vcruntime140.dll, api-ms-win-crt-locale.dll, etc.\n </p>\n <p>\n  Now, I have only one dependency in import table, which is user32.dll (required by messagebox).\n </p>\n <p>\n  Why kernel32.dll is missing?\nI thought that kernel32.dll is required for all .exe applications.\n </p>\n <p>\n  Even the kernel32.dll is missing, the app runs correctly.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "735",
    "tags": [
        "windows",
        "winapi"
    ],
    "user": "bielu000",
    "time": "Aug 19, 2018 at 10:09",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you are not using any APIs from kernel32 it will not be added to the import table, simple as that. You were misinformed about kernel32 being required for all applications. It is even possible to have an application without import table.\n </p>\n <p>\n  With regards to the vcruntime140 etc, you can just target Windows XP and use the /MP option to get rid of those. The api-ms*.dll are Windows Vista+ ways of importing things like kernel32.dll with shims, so if you don’t care about XP support those are not an issue.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "mrexodia",
            "time": "Aug 19, 2018 at 13:50",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Michael Karcher",
                    "text": "<span class=\"comment-copy\">While it is true that kernel32 is not required in the import table, it is quite likely that it is still loaded into user space of all applications for the \"console\" or \"windows\" subsystem. It definitely is loaded by user32. So the statement that kernel32 is mapped in (at least nearly) each windows process still holds.</span>",
                    "time": null
                },
                {
                    "user": "mrexodia",
                    "text": "<span class=\"comment-copy\">The statement “I thought kernel32.dll is required for all .exe applications.” is what I addressed in my answer. I just explained that there is nothing special about kernel32.dll, it’s just a DLL like any other. There is also no magic related to the subsystem of the application. Nobody was stating that kernel32 isn’t loaded in most processes, I just explained the facts.</span>",
                    "time": null
                },
                {
                    "user": "Michael Karcher",
                    "text": "<span class=\"comment-copy\">I did not mean to claim a problem or inaccuracy in your answer. The intent of my comment was to show the original poster, that the statement \"kernel32 is required\" might still be true if you look at it from the context of which DLLs are mapped, which is important e.g. in exploitation.</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">all processes will have kernel32 (and ntdll) loaded on Windows Vista and later.  Windows XP and earlier had a bug where kernel32 could be omitted and then the process would crash on start because of a circular dependency.</span>",
                    "time": null
                },
                {
                    "user": "mrexodia",
                    "text": "<span class=\"comment-copy\">You are correct. Today I created an executable without an import table and on Windows 8.1 the following DLLs are loaded when starting the executable under a debugger. x86 (wow64): apphelp.dll, kernel32.dll, kernelbase.dll, ntdll.dll. For x64: kernel32.dll, kernelbase.dll, ntdll.dll</span>",
                    "time": null
                }
            ]
        }
    ]
}