{
    "title": "Do all class instances have a relative address/offset and can i make a copy of any class pointer?",
    "link": "https://reverseengineering.stackexchange.com/questions/19139/do-all-class-instances-have-a-relative-address-offset-and-can-i-make-a-copy-of-a",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm familiar with finding a player base pointer as-well as other values in games, and finding offsets and such.\nAnd I have applied that to some of my own code in the past.\n </p>\n <p>\n  But does this practice apply to instances of any class?\n </p>\n <p>\n  Here's an example program.\n </p>\n <pre><code>using namespace std;\n\nclass A {\npublic:\n    int i = 0;\n    virtual void doThing() {\n        i++;\n        cout << i << endl;\n    }\n\n};\n\nint main()\n{\n    A* a = new A();\n    while (1)\n    {\n        a->doThing();\n        Sleep(6000);\n    }\n    system(\"pause\");\n    return 0;\n}\n</code></pre>\n <p>\n  I used Cheat engine to find the address of the variable\n  <code>\n   i\n  </code>\n  in\n  <code>\n   A::doThing\n  </code>\n  . Then I used the option to find what writes to that address. From there I found what appeared to be an offset, did a pointer scan and found that\n  <code>\n   example.exe+0x001A2EC\n  </code>\n  was a static pointer and the value held by\n  <code>\n   i\n  </code>\n  was at offset\n  <code>\n   0x4\n  </code>\n  .\n </p>\n <p>\n  Would\n  <code>\n   example.exe+0x001A2EC\n  </code>\n  be considered the pointer to the instance of class\n  <code>\n   A\n  </code>\n  ?\n </p>\n <p>\n  What I'm trying to do is basically make a copy of the target program's pointer to the instance of class\n  <code>\n   A\n  </code>\n  , then access it's V-Table in my own code which is to be injected into the process.\n </p>\n <p>\n  This is how I was trying to achieve this.\n </p>\n <pre><code>DWORD Base = (DWORD)GetModuleHandle(0);\nA* a = (A*)(Base + 0x1A2EC);\nvoid** vtable = *(void***)a;\n</code></pre>\n <p>\n  If there's something wrong with my understanding or methodology please do point out what i am doing wrong, or suggest some other way which I can get a copy of the pointer.\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "330",
    "tags": [
        "decompilation",
        "c++",
        "offset",
        "vtables",
        "cheat-engine"
    ],
    "user": "Michael Strobel",
    "time": "Aug 23, 2018 at 3:12",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'll start with a few minor corrections and clarifications, just to make sure we're using the right terms and exact definitions.\n </p>\n <blockquote>\n  <p>\n   I used Cheat engine to find the address of the variable\n   <code>\n    i\n   </code>\n   in\n   <code>\n    A::doThing\n   </code>\n  </p>\n </blockquote>\n <p>\n  First of all,\n  <code>\n   i\n  </code>\n  is not a variable of method\n  <code>\n   A::doThing\n  </code>\n  . It is a\n  <em>\n   member\n  </em>\n  of the\n  <code>\n   A\n  </code>\n  class.\n </p>\n <blockquote>\n  <p>\n   Then I used the option to find what writes to that address\n  </p>\n </blockquote>\n <p>\n  Doing this gives you the address of method\n  <code>\n   A::doThing\n  </code>\n  is located. Specifically, the address at which\n  <code>\n   A::i\n  </code>\n  is modified within that method.\n </p>\n <blockquote>\n  <p>\n   from there I found what appeared to be an offset, did a pointer scan\n  </p>\n </blockquote>\n <p>\n  I would assume you found the offset of\n  <code>\n   A\n  </code>\n  at which\n  <code>\n   i\n  </code>\n  is located, but I'm not 100% I understand what you mean by \"did a pointer scan\". I assume you subtracted the offset of\n  <code>\n   i\n  </code>\n  from the address found at the first stage (\"I used Cheat engine to find the address of the variable\n  <code>\n   i\n  </code>\n  \") to get the address of the object itself, then searched for pointers to that address.\n </p>\n <blockquote>\n  <p>\n   Would \"example.exe\"+0001A2EC be considered the pointer to the instance of A class?\n  </p>\n </blockquote>\n <p>\n  To be more accurate,\n  <code>\n   example.exe+0x001A2EC\n  </code>\n  would be an address of a variable of type\n  <code>\n   A *\n  </code>\n  (or pointer to an\n  <code>\n   A\n  </code>\n  instance), and it's value will be the value returned by\n  <code>\n   new A();\n  </code>\n  , i.e. an instance of class\n  <code>\n   A\n  </code>\n  , as you expect. Reading it's value will point you to where that instance of\n  <code>\n   A\n  </code>\n  is currently in memory.\n </p>\n <p>\n  <strong>\n   However\n  </strong>\n  several assumptions you have may change between releases or even for different compiled versions of the same code base.\n </p>\n <p>\n  The most obvious one in your example code, is the fact you're using the\n  <strong>\n   exetuable's image base\n  </strong>\n  to access the\n  <strong>\n   main thread's stack\n  </strong>\n  . This is likely to break depending on how/where the stack is allocated for your process, and is likely to be unreliable even if executed several times in succession, depending on OS and configuration.\n </p>\n <p>\n  Even if you somehow address that, there are multiple other potential complications and slight changes that could make your life harder. To name a few:\n </p>\n <ol>\n  <li>\n   Even if you were using the process's stack offset instead of the image base, the offset in memory where the\n   <code>\n    A\n   </code>\n   pointer variable,\n   <code>\n    a\n   </code>\n   , is located is likely to change.\n   <em>\n    even just between different executions of an identical binary\n   </em>\n   . For example, in your case\n   <code>\n    a\n   </code>\n   is stored on the stack, and if the function defining\n   <code>\n    a\n   </code>\n   could be called in several different flows, the\n   <em>\n    stack depth\n   </em>\n   at which the stack frame of the function creating\n   <code>\n    a\n   </code>\n   may differ. if a function\n   <code>\n    a_creator\n   </code>\n   may be called in either one of two flows\n   <code>\n    main/a_creator\n   </code>\n   and\n   <code>\n    main/game_load/a_creator\n   </code>\n   depending on circumstances (e.g. if you're loading a save), the offset at which\n   <code>\n    a_craetor\n   </code>\n   's stack frame will start will be different.\n  </li>\n  <li>\n   The offset at which\n   <code>\n    i\n   </code>\n   is located in the\n   <code>\n    A\n   </code>\n   class's internal structure, may be changed because new members were added in the code. Although normally maintain the order members are defined at, optimizations may shift them around for better alignment. Different padding configuration settings may also change the location a member is actually at.\n  </li>\n  <li>\n   Different optimization configurations may even completely eliminate the variable\n   <code>\n    a\n   </code>\n   , only storing it in a non-volatile register. This is very likely in the example implementation you provided, for example.\n  </li>\n  <li>\n   A new version of the program can easily create move variables and make code changes so locations will be completely off.\n  </li>\n  <li>\n   Inheritance and casting of\n   <code>\n    a\n   </code>\n   could lead you to different VTables than the ones you were looking for, as well as other complications.\n  </li>\n </ol>\n <p>\n  I hope this did not discourage you from pursuing your goal, but encouraged you to gain a better understanding of the internals and intricate world of dynamic patching.\n </p>\n <p>\n  As a side note I'll include a warning about anti-cheat detection tools in a lot of games could make these endeavors quite expensive (account bans, etc).\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "NirIzr",
            "time": "Aug 23, 2018 at 3:10",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Michael Strobel",
                    "text": "<span class=\"comment-copy\">Is there some other way to get the pointer to the A instance? Maybe by signature scanning?  Also, i don't quite understand how this differs from finding a static pointer to a player class in games as I've done before.  (Just to clarify also i don't intend on getting accounts banned anytime soon, anything I've done with games has just been for the purpose of learning, and done using insecure servers.)</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Static variables (pointers or not) reside in a fixed location relative to the executable's image base. the stack does not. As for suggestions for a better solution, I think you should start another question and describe your specific scenario (instead of an example program), although most of it will probably be derived from what I said here.</span>",
                    "time": null
                }
            ]
        }
    ]
}