{
    "title": "Is there any way to access assembly-csharp from installed apk? (unity game, gamedata)",
    "link": "https://reverseengineering.stackexchange.com/questions/19169/is-there-any-way-to-access-assembly-csharp-from-installed-apk-unity-game-game",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm playing a Japanese Unity game on my phone. I've translated everything that exist in the apk to English but the game downloads new content once you run the apk for the first time. Is there any way to access/extract the assembly-csharp from the data the game install on the phone? It's hidden within all the \"12371asdhasudhdasd.dat\" files. I can extract everything withing those files but the assembly file is a no go, just says it can't be found. It's no problem getting the file from the apk but since the game download new data once I run the installed app, it's gone.\n </p>\n <p>\n  I know people don't like it when you reverse the code and I'm sorry for asking, it's just that I like this game and they won't release an English version of it. I'm only doing this for my own purpose, not to release a mod or anything.\n </p>\n <p>\n  If I'm breaking any rules by asking this, you could just answer yes or no on the question and I'll keep digging if it's a yes.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "1k",
    "tags": [
        "apk"
    ],
    "user": "Yzo Pyzo",
    "time": "Nov 22, 2018 at 7:19",
    "comments": [
        {
            "user": "Biswapriyo",
            "text": "<html><body><span class=\"comment-copy\">\n Why did you think that's C#? Did you check the code in that APK file to find how it decrypts that .dat file. Use Apktool/dex2jar to reverse it.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Yzo Pyzo",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks for the reply. No I didnt, this is not my scene, i learn by doing so im gonna do some more digging to figure this out.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}