{
    "title": "Extract firmware images from COTS embedded devices",
    "link": "https://reverseengineering.stackexchange.com/questions/19457/extract-firmware-images-from-cots-embedded-devices",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am on the hook to collect some of legacy firmware images from real-world embedded devices. Before digging into it, I am trying to confirm some high-level points.\n </p>\n <p>\n  Is it in general possible to gather firmware images from legacy embedded devices? I can come up with some hurdles here:\n </p>\n <ol>\n  <li>\n   I am aware that many embedded devices disable the debug port.\n  </li>\n  <li>\n   embedded system have the so-called \"Code Readout Protection\" mechanism to prevent users from downloading the firmware\n  </li>\n </ol>\n <p>\n  However, I am also  aware the following facts:\n </p>\n <ol>\n  <li>\n   <p>\n    Firmware could be extracted from embedded devices by abusing busybox, for instance its\n    <code>\n     wget\n    </code>\n    command. Something like:\n    <a href=\"https://reverseengineering.stackexchange.com/questions/13402/limited-busybox-shell\">\n     Limited BusyBox shell\n    </a>\n   </p>\n  </li>\n  <li>\n   <p>\n    The \"code readout protection\" could be bypassed, so as the \"debug port\" issue.\n   </p>\n  </li>\n </ol>\n <p>\n  So I am wondering if someone can really picture the landscape here, is it generally considered easy or not to extract legacy firmwares from embedded devices? What is the common procedure and best practice? Thanks.\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "debugging",
        "firmware",
        "exploit",
        "embedded"
    ],
    "user": "lllllllllllll",
    "time": "Oct 1, 2018 at 20:44",
    "comments": [
        {
            "user": "julian",
            "text": "<html><body><span class=\"comment-copy\">\n The scope of this question is far too broad.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n @lllllllllllll: I strongly suggest you edit your question to be a little better scoped. This will maybe even prompt NirIzr to give an even better answer, even though the one he gave is already as comprehensive as it gets, given the detail you provide. So unless you find someone who has worked on the exact target you're trying to reverse, this will be as good as it gets without more details provided by you.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "<html><body><span class=\"comment-copy\">\n Although I agree this is a\n <i>\n  very\n </i>\n general question, I do think it may be useful for future readers. I'm not sure OPs intention was to get an answer for a single specific device.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n @NirIzr no worries, wasn't going to close or delete it. And I agree it's going to be useful for future internauts.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <em>\n   As this question is quite general, it'll be difficult to provide a very technical answer.\n  </em>\n </p>\n <p>\n  You've asked quite a few questions here, so please let me start with a general overview and then proceed to answer all of your specific questions.\n </p>\n <h2>\n  General overview\n </h2>\n <p>\n  The difficulty of pulling firmware images from an embedded device really depends on the firmware device itself, and the access you have to that firmware device.\n </p>\n <p>\n  I would say there are a few different alternatives depending on your actual goal (just getting as many firmwares as possible verses getting firmwares for specific devices you're in possession of or interested in, for example). I'll list the general options in ascending difficulty:\n </p>\n <h3>\n  Getting a firmware image/update online\n </h3>\n <p>\n  Since a lot of devices support some kind of firmware update mechanisms, firmware images are often made available by the manufacturer either via a manual web page download for manual update or via a web service that will serve over-the-air updates. Although those updates may sometimes be encrypted, in most cases they are just signed - because the actual threat landscape is\n  <em>\n   modifying\n  </em>\n  a firmware and not\n  <em>\n   reading\n  </em>\n  it.\n </p>\n <p>\n  As the format of a firmware update may be more complex to understand than a raw\n  <code>\n   dd\n  </code>\n  dump, for example, you'll need to spend extra efforts in understanding the format, extracting the firmware asset(s) from the firmware update file and optionally implementing some firmware-loading logic to get the in-memory image / addressing available. Tools like\n  <a href=\"https://github.com/ReFirmLabs/binwalk\" rel=\"nofollow noreferrer\">\n   binwalk\n  </a>\n  are a decent starting point.\n </p>\n <p>\n  If firmware is only available over-the-air, you'll also need to spend time understanding the over-the-air protocol and any server side limitations on serving assets. A server may refuse offering an old version you're particularly interested in or require some kind of a per-device identification/authentication.\n </p>\n <h3>\n  Using an application info-leak vulnerability\n </h3>\n <p>\n  The simplest example that comes to mind is\n  <a href=\"https://www.netsparker.com/blog/web-security/information-disclosure-issues-attacks/\" rel=\"nofollow noreferrer\">\n   information disclosure vulnerabilities in web applications\n  </a>\n  that often exist on many embedded devices, however there may be other relevant targets. Unlike\n  <em>\n   native\n  </em>\n  information disclosure vulnerabilities where often pointers, addresses and memory data may be leaked, web information disclosure vulnerabilities often expose files and stored data. This may either allow you to pull other relevant information (for example, probing for hardware devices/interfaces) or even access to the firmware if it is either stored on the same storage or mounted (all the time or when an update runs).\n </p>\n <h3>\n  Reading a firmware by software when shell access is available\n </h3>\n <p>\n  Shell or root access may be available to you without looking at the firmware because of a known vulnerability or one that is easy enough to discover without actually reading any code. A device may also offer some kind of terminal access for debugging purposes. Instead of a full-blown terminal, one can have the ability to just execute a single shell command using command injections, for example.\n </p>\n <p>\n  Once you have access, this is mostly a matter of probing for any available assets and recovering whatever you can.\n </p>\n <h3>\n  Reading a firmware by hardware when physical access if available\n </h3>\n <p>\n  As this can often be the most challenging way of extracting firmware images, you may occasionally be lucky to the point that this approach can be as easy as pulling a SD card and plugging it into a computer. This isn't often the case, though. Since this specific topic is quite huge and you seem to be looking for an overview, I will not dive deep into the specifics.\n </p>\n <p>\n  When physical access to a device is available and any debug ports, uarts, or serial ports are available, you may often find them very useful for extracting details about the firmware. Some of those features may also be available through an ethernet port. These debugging interfaces often provide raw access to different components, such as the storage or controlling the boot sequence.\n </p>\n <p>\n  Although sometimes identifying such a port can be easy thanks to exposed unconnected pinheads and existing pin label printouts depicted below:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/hkWEK.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"pinheads\" src=\"https://i.sstatic.net/hkWEKs.png\"/>\n  </a>\n  <a href=\"https://i.sstatic.net/2CT1Q.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"pin labels\" src=\"https://i.sstatic.net/2CT1Qs.jpg\"/>\n  </a>\n </p>\n <p>\n  <em>\n   Unmounted pinheads on the left, pin labels on the right. Click to enlarge\n  </em>\n </p>\n <p>\n  The different debug ports could also be harder to recognize when no labels are printed and there are no pinheads connected. A walk-through example for identifying both exposed and hidden debug ports is available\n  <a href=\"http://jcjc-dev.com/2016/04/08/reversing-huawei-router-1-find-uart/\" rel=\"nofollow noreferrer\">\n   here\n  </a>\n  .\n </p>\n <p>\n  When debug ports are insufficient, the next step further is directly reading the firmware from the storage chip. This often includes either taking it out of the board and using your own electronic circuit to read memory out of the chip or hooking to the chip while it's still connected to the original board but either passively listening to data as it's read by the device or issuing your own read instructions. You'll first need to identify the circle components and their purpose, and manufacturer datasheets. This will obviously also require dedicated hardware. Generic boards exist for that purpose (some specifically for firmware extraction and hardware reverse engineering like\n  <a href=\"http://goodfet.sourceforge.net/\" rel=\"nofollow noreferrer\">\n   GoodFET\n  </a>\n  and\n  <a href=\"https://en.wikipedia.org/wiki/Bus_Pirate\" rel=\"nofollow noreferrer\">\n   BusPirate\n  </a>\n  ) and you can also get some development equipment from chip manufacturers that use proprietary\n  <a href=\"https://en.wikipedia.org/wiki/In-system_programming\" rel=\"nofollow noreferrer\">\n   In Circuit Serial Programming\n  </a>\n  , if they'll be willing to sell those to you.\n </p>\n <p>\n  You can go even as far as reading the data directly from the chip using electrical and optical analysis of the chips' die layers, but that seems unlikely for your case.\n </p>\n <h2>\n  Answering your specific questions\n </h2>\n <blockquote>\n  <p>\n   Is it in general possible to gather firmware images from legacy embedded devices?\n  </p>\n </blockquote>\n <p>\n  As mentioned earlier, this greatly depends on the specific device and how protected it may be. It tends to be doable for most cheap devices but as a device becomes more expensive you can assume it'll be more complex and indirectly incur more difficulties.\n </p>\n <p>\n  It is also important to note that excluding the really expensive and/or often targeted devices (smartphones is a good example of those), most difficulties will not come from a manufacturer actively trying to make firmware extraction harder, but will more often come from design decisions and product choices and just happen to impact the difficulty of extracting a firmware image.\n </p>\n <blockquote>\n  <ol>\n   <li>\n    I am aware that many embedded devices disable the debug port\n   </li>\n  </ol>\n </blockquote>\n <p>\n  Although this can sometimes be the case for either increased security or to reduce costs, removing a debug port completely makes repairs and QA more difficulties. Often, although the debug port may to be included a convenient pinout may be laid out for easy access, either heads for easy access or without as seen in the following picture:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/OZkrr.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"output pins without a head soldiered on them\" src=\"https://i.sstatic.net/OZkrrm.jpg\"/>\n  </a>\n </p>\n <p>\n  <em>\n   Picture taken from\n   <a href=\"http://jcjc-dev.com/2016/04/08/reversing-huawei-router-1-find-uart/\" rel=\"nofollow noreferrer\">\n    this\n   </a>\n   step by step hardware reverse engineering tutorial\n  </em>\n </p>\n <blockquote>\n  <ol start=\"2\">\n   <li>\n    embedded system have the so-called \"Code Readout Protection\" mechanism to prevent users from downloading the firmware\n   </li>\n  </ol>\n </blockquote>\n <p>\n  The cheaper devices will generally not bother with code readout protection, and there are some ways to bypass it although those tend to be relatively difficult and specific. One such method is to remove the storage chip and interact with it directly to extract the firmware image, as I previously mentioned in\n  <em>\n   Reading a firmware by hardware when physical access if available\n  </em>\n  .\n </p>\n <blockquote>\n  <ol>\n   <li>\n    Firmware could be extracted from embedded devices by abusing busybox, for instance its\n    <code>\n     wget\n    </code>\n    command. Something like:\n    <a href=\"https://reverseengineering.stackexchange.com/questions/13402/limited-busybox-shell\">\n     Limited BusyBox shell\n    </a>\n   </li>\n  </ol>\n </blockquote>\n <p>\n  This approach is an example of what I've discussed under\n  <em>\n   Reading a firmware by software when shell access is available\n  </em>\n  above. In the example you linked,\n  <code>\n   wget\n  </code>\n  is used to exfiltrate the data after you get it, but there's no limit to the creativity of that (one can even go as far as use available LEDs to encode binary data).\n </p>\n <blockquote>\n  <ol start=\"2\">\n   <li>\n    The \"code readout protection\" could be bypassed, so as the \"debug port\" issue\n   </li>\n  </ol>\n </blockquote>\n <p>\n  Yes, through slightly more advanced hardware reverse engineering tools and abilities it is possible to extract software from chips that have readout protection, use a device port although it isn't mounted, avoid the need of a debug port, using the chip's datasheet to recognize how to properly read the data out,\n  <em>\n   snarfing\n  </em>\n  it while it's being read by the existing circuit, etc...\n </p>\n <blockquote>\n  <p>\n   is it generally considered easy or not to extract legacy firmwares from embedded devices? What is the common procedure and best practice?\n  </p>\n </blockquote>\n <p>\n  As shown by this post, and repeated several times, this can be relatively easy or relatively difficult, depending on specific case. Common procedures also vary heavily.\n </p>\n <h2>\n  Further reading\n </h2>\n <p>\n  The topic of hardware reverse engineering is big an wide, and it is hard to cover it all in an SO post. You should spend more time reading, watching talks and following walkthroughs to gain more knowledge on the subject. Here are a few resources:\n </p>\n <ol>\n  <li>\n   A survey of\n   <a href=\"https://www.iacr.org/archive/ches2009/57470361/57470361.pdf\" rel=\"nofollow noreferrer\">\n    The State-of-the-Art in IC Reverse Engineering\n   </a>\n  </li>\n  <li>\n   <a href=\"https://www.youtube.com/watch?v=YCbpppOSBGE\" rel=\"nofollow noreferrer\">\n    Keep your tentacles off my bus\n   </a>\n   and\n   <a href=\"https://www.youtube.com/results?search_query=Dmitry%20Nedospasov\" rel=\"nofollow noreferrer\">\n    other talks\n   </a>\n   by\n   <a href=\"https://twitter.com/nedos?lang=en\" rel=\"nofollow noreferrer\">\n    Dmitry Nedospasov\n   </a>\n   .\n  </li>\n  <li>\n   This hardcore example of\n   <a href=\"http://travisgoodspeed.blogspot.com/2011/03/practical-mc13224-firmware-extraction.html\" rel=\"nofollow noreferrer\">\n    firmware extraction by decapping\n   </a>\n   by\n   <a href=\"https://twitter.com/travisgoodspeed\" rel=\"nofollow noreferrer\">\n    Travis Goodspeed\n   </a>\n   .\n  </li>\n  <li>\n   <a href=\"http://jcjc-dev.com/2016/04/08/reversing-huawei-router-1-find-uart/\" rel=\"nofollow noreferrer\">\n    This\n   </a>\n   introductory level, five part hardware/firmware reverse engineering walkthrough.\n  </li>\n  <li>\n   A\n   <a href=\"https://www.youtube.com/watch?v=GX8-K4TssjY\" rel=\"nofollow noreferrer\">\n    presentation\n   </a>\n   about practical extraction using a Null dereference bug.\n  </li>\n </ol>\n <p>\n  and many other resources available online.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "lllllllllllll",
                    "text": "<span class=\"comment-copy\">Fantastic answer! I appreciate it a lot. I will read your answer in details and leave more comments later. Take care!</span>",
                    "time": null
                },
                {
                    "user": "lllllllllllll",
                    "text": "<span class=\"comment-copy\">Thanks again for your detailed information. Just another (quick?) question, I am always assuming that firmware (over-the-air) update is a rare case, which can only be handled by experts. Hence many firmware images that can be extracted  from the real-world device is a bit \"out-dated\". To get the newest firmware, you probably have to crawl online. Does that make sense to you?</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Yes. For a lot of the devices that don't have over the air updates users will have to update manually.</span>",
                    "time": null
                },
                {
                    "user": "lllllllllllll",
                    "text": "<span class=\"comment-copy\">Yes, I see. But on the other hand users probably need some advanced skills to update, or they basically do not have the motivation to do that. So I guess the argument holds to see that \"many firmware in real-world embedded devices\" are kinda outdated. So we will need to go for their web page to get the newest version.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Yep. Definitely. Users don't bother doing all that</span>",
                    "time": null
                }
            ]
        }
    ]
}