{
    "title": "How to execute a specific shellcode with a non executable stack without using format string? (without ASLR and stack cookie)",
    "link": "https://reverseengineering.stackexchange.com/questions/19615/how-to-execute-a-specific-shellcode-with-a-non-executable-stack-without-using-fo",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  First off we don't have ASLR and stack cookie, and assume we can't create our own files on this system\n </p>\n <p>\n  So I'm trying to execute a shellcode in this code, this is what i have done so far:\n </p>\n <p>\n  i have managed to overwrite the buffer and set the return address of function foo to function critical, but my problem is how to run a specific shellcode here? the execv will run the bin/sh but i can't replace the first argument with a shellcode and it won't work and I'm not sure if its even possible to run a shellcode with execv, and when i pass a shellcode to sh it doesn't work.\n </p>\n <p>\n  also i know the return to libc exploit but still don't know how to execute a shellcode with system()? is it even possible to pass a shellcode to it? or maybe i can use another function to just pass a shellcode to it?\n </p>\n <p>\n  And i assume we can run our own shellcode if we created our own shellcode file and replaced the sh path, but we don't have access to create files, we have to do it with this code only.\n </p>\n <pre><code>#include <stdio.h>\n#include <stdlib.h>\n#include <string.h>\n#include <unistd.h>\n\nint bar(char *arg, char *out)\n    {\n      strcpy(out, arg);\n      return 0;\n    }\n\n    int foo(char *arg)\n    {\n      char buffer1[100]=\"Test program.\n\";\n      char buffer2[100];\n      bar(arg, buffer2);\n      printf(\"%s\",buffer1);\n      return 0;\n    }\n\n    void critical()\n    {\n      char *msg[]={\"/bin/sh\",NULL};\n      execv(msg[0],msg);\n    }\n\n    int main(int argc, char *argv[])\n    {\n      if (argc != 2)\n      {\n        fprintf(stderr, \"prog_vuln2: argc != 2\n\");\n        exit(EXIT_FAILURE);\n      }\n      foo(argv[1]);\n      return 0;\n    }\n</code></pre>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 2,
    "views": "1k",
    "tags": [
        "buffer-overflow",
        "stack",
        "shellcode"
    ],
    "user": "Richard Jones",
    "time": "Oct 13, 2018 at 17:36",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  First thing that comes to mind when you have non-executable stack is\n  <a href=\"https://en.wikipedia.org/wiki/Return-oriented_programming\" rel=\"nofollow noreferrer\">\n   Return-oriented programming\n  </a>\n  which, as the name implies, uses return to execute a code you want.\n  \n\n  When using ROP, you will want to use the program's executable and dlls (or .so files for linux) and rely as little as you can on system dlls as they change with the OS version.\n  \n\n  The idea is that you find a bunch of sequences of instrucitons. each one called a\n  <code>\n   gadget\n  </code>\n  . A gadget can set a register value by\n  <code>\n   pop\n  </code>\n  ing a value from the stack,\n  <code>\n   mov\n  </code>\n  ing a value or adding/subtracting a register, followed by\n  <code>\n   ret\n  </code>\n  (which means you can usually find them at the end of functions), causing them to return to the next value on the stack (where the return address is expected to be), creating a\n  <code>\n   ROP Chain\n  </code>\n  .\n </p>\n <p>\n  A simple example is when you want to execute a command using\n  <code>\n   system\n  </code>\n  .\n  \n\n  you can (on a 64 bit OS) jump to a pop-return where the first value on the stack is your buffer address and the second value is the address of\n  <code>\n   system\n  </code>\n  , causing system to be called with your buffer as an argument in the correct register (rdi for linux, ecx for windows).\n  \n\n  On a 32 bit os, the overflow is somewhat simpler. All you need is to oerride the return address to\n  <code>\n   system\n  </code>\n  and override the 4 bytes after it to be the address of you buffer. That will execute\n  <code>\n   system\n  </code>\n  with your buffer as the first parameter.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You are correct that you can't pass your shellcode to execv(), but that's not the idea.  What you require is to change the return address from the call to foo() to point to critical(), so that execv() receives the path \"/bin/sh\" as the parameter.  Normally, your shellcode would be the contents of critical() itself, and the return address would point to the buffer that holds the critical() function.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "peter ferrie",
            "time": "Oct 20, 2018 at 22:32",
            "is_accepted": false,
            "comments": []
        }
    ]
}