{
    "title": "API for LockState Wireless Internet Thermostat",
    "link": "https://reverseengineering.stackexchange.com/questions/1984/api-for-lockstate-wireless-internet-thermostat",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I want to develop a web-based API in Rails for some\n  <a href=\"http://rads.stackoverflow.com/amzn/click/B0071IWJ62\" rel=\"nofollow\">\n   LockState wifi programmable thermostats\n  </a>\n  , so that other different application can control these thermostats. But I'm cannot find any resource about how these thermostats are accessible from the Internet and how to connect to these thermostats. Is there any documentation available? If not, how would I find how to interact with the thermostats?\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "431",
    "tags": [
        "interoperability",
        "api",
        "embedded"
    ],
    "user": "rony36",
    "time": "May 2, 2013 at 12:25",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n So you want to reverse engineer the API that is apparently used by some proprietary application? Do you have the proprietary application? Do you have one of the thermostats?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Till",
            "text": "<html><body><span class=\"comment-copy\">\n Given that you could answer @0xC0000022L's question with a\n <code>\n  yes\n </code>\n , the next step would be using a traffic sniffer (e.g. wireshark) or logging proxy (e.g. Charles) for gathering information on the control requests and their answers.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "rony36",
            "text": "<html><body><span class=\"comment-copy\">\n yes, I have one.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Okay, so far your question is a bit meager on the informational side, but it's intriguing. Let me\n  <em>\n   start\n  </em>\n  an attempt to answer it. I'll not be able to answer it, lacking the device in question.\n </p>\n <h1>\n  Methodology\n </h1>\n <p>\n  Here's what I would do.\n </p>\n <ol>\n  <li>\n   Pose as a WiFi access point (AP). Most WiFi cards will allow you to do this, if the software side allows for it as well. If the existing access point is something like a Linux-based access point, you don't need anything else.\n  </li>\n  <li>\n   Once you\n   <em>\n    are\n   </em>\n   the AP sniff the traffic that goes through the interface using Wireshark,\n   <code>\n    tcpdump\n   </code>\n   or similar tools.\n   <ol>\n    <li>\n     Figure out the protocol used\n     <ul>\n      <li>\n       if it's a plain text protocol you are only left with decoding the meaning of the sent data\n      </li>\n      <li>\n       if it is encrypted\n       <ol>\n        <li>\n         see whether you can use a man-in-the-middle attack to read the data stream\n        </li>\n        <li>\n         try to find out the version of the server software. Usually embedded software is lagging behind a bit, so if you find it is vulnerable, you may be able to get a (\n         <code>\n          root\n         </code>\n         ) shell.\n        </li>\n        <li>\n         try to find firmware updates for the device and see whether tools like\n         <code>\n          binwalk\n         </code>\n         and\n         <a href=\"http://code.google.com/p/firmware-mod-kit/\" rel=\"nofollow noreferrer\">\n          <code>\n           firmware-mod-kit\n          </code>\n         </a>\n         can make sense of them. Being able to unpack the firmware updates will give you a lot of information about the device and what's running on the current version, even if the versions may differ.\n        </li>\n       </ol>\n      </li>\n      <li>\n       if you find out that particular certificates are allowed and they are based based on a weak hash algorithm (\n       <a href=\"http://en.wikipedia.org/wiki/MD5\" rel=\"nofollow noreferrer\">\n        MD5\n       </a>\n       ) or if it happens to be an\n       <a href=\"http://lists.debian.org/debian-security-announce/2008/msg00152.html\" rel=\"nofollow noreferrer\">\n        SSH key created on Debian while it was vulnerable\n       </a>\n       . In the former case you may be able to forge a certificate and in the latter you will be able to brute-force an otherwise secure SSH connection\n      </li>\n     </ul>\n    </li>\n   </ol>\n  </li>\n  <li>\n   Failing all of the above and being able (financially) to sacrifice one of the devices, I'd take it apart and try to find whether I can get a serial console or whether\n   <a href=\"https://reverseengineering.stackexchange.com/q/1374/245\">\n    JTAG\n   </a>\n   pins/contacts are available. If I was able to find out more about the used chips, I'd give boundary scanning a try.\n  </li>\n </ol>\n <p>\n  The further down you were reading the more hurdles to take and the harder the approach. Now, perhaps you edit more details into your question if this partial answer gets you started.\n </p>\n</div>\n</body></html>",
            "votes": "6",
            "user": "3 revs, 2 users 90%0xC0000022L",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Till",
                    "text": "<span class=\"comment-copy\">great answer - I would never have thought about possible SSH usage etc. not to mention on how to tackle that. Still my guess (and it really is just a guess!) is that the traffic/API will be plain HTTP based, JSON formatted REST stuff.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@Till: likely indeed. But without further input from the OP we won't be able to give anything but an outline of a generic approach as I did. Oh well :)</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This thermostat looks identical to the Radio Thermostat CT-50. That device has an open JSON API which you can read on their website.\n  <a href=\"http://radiothermostat.com\" rel=\"nofollow\">\n   http://radiothermostat.com\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Joe Zydeco",
            "time": "Jun 27, 2013 at 20:04",
            "is_accepted": false,
            "comments": [
                {
                    "user": "asheeshr",
                    "text": "<span class=\"comment-copy\">Please add some of the relevant information into the answer itself. <i>Link only</i> posts are not considered answers.</span>",
                    "time": null
                }
            ]
        }
    ]
}