{
    "title": "How to convert Unexplored data in IDA Pro to code？",
    "link": "https://reverseengineering.stackexchange.com/questions/19873/how-to-convert-unexplored-data-in-ida-pro-to-code",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am analyzing a malware, it has a lot of confusing methods, I wrote an idc script to remove confusion, use the MakeCode() function to convert some Unexplored data into code, but there are still some that can't be converted when you manually convert When some Unexplored data, it will pop up a window to prompt you whether to convert, so I need a method to force the conversion of Unexplored data to code. Does anyone know which api script language can implement such a function? I used FindUnexplored to find Unexplored data.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "4k",
    "tags": [
        "ida",
        "binary-analysis",
        "malware",
        "pe",
        "idc"
    ],
    "user": "ATree",
    "time": "Nov 12, 2018 at 9:02",
    "comments": [
        {
            "user": "Bastiflew",
            "text": "<html><body><span class=\"comment-copy\">\n Did you find a solution ? I have the same issue.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Using\n  <code>\n   MakeCode\n  </code>\n  function with idc or idaPython is completely OK, this function is exactly what you need.\nHowever (especially when analyzing malware) you can encounter the following problems:\n </p>\n <ul>\n  <li>\n   It may be encrypted (like AES or other encryption algorithm) or transformed (like xored with some pattern)  code. Obviously, it can not be disassembled as is.\n  </li>\n  <li>\n   It may be obfuscated code with garbage bytes inside (something like\n   <code>\n    jmp $+6;garbage byte;code to jump to\n   </code>\n   ). In general IDA should handle it, but if you starting your conversion from incorrect byte it will be garbage. This problem can be found in architectures with non-constant instruction length, such as x86 or x64.\n  </li>\n  <li>\n   It may be just data.  Not all unexplored bytes are the code.\n  </li>\n  <li>\n   It may be some exotic variant of instruction that IDA disassembler can not handle.While theoretically possible, it is highly unlikely.\n  </li>\n </ul>\n</div>\n</body></html>",
            "votes": "3",
            "user": "w s",
            "time": "Nov 12, 2018 at 12:31",
            "is_accepted": false,
            "comments": []
        }
    ]
}