{
    "title": "Reconstructing Unity APK",
    "link": "https://reverseengineering.stackexchange.com/questions/19880/reconstructing-unity-apk",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Note: I am only doing this for educational purposes with no intent to redistribute\n </p>\n <p>\n  I have decompiled an APK built with Unity successfully (Somewhat).\nUsing an array of programs, I managed to extract all the games assets and the scripts, though I am trying to re-construct it in unity to debug. I imported all the original scenes, and how they were set up (including all the attached scripts required) though I am receiving anywhere from 200-999+ errors in the console before I even run.\n </p>\n <p>\n  Some of these issues are from invalid characters (Decompiler-Generated fields) within scripts, which can easily be resolved by renaming them to a friendlier format, however, I sat here for a good hour resolving these errors, when I completed the last shown error, i hit play, and it generated another few hundred errors.\n </p>\n <p>\n  Why would it be that, if I was able to extract the scripts successfully (seemingly zero obfuscation), that, when imported into unity, I am thrown so many errors? Why is this not a 1:1 translatable process? Or is this problem based upon too many variables to be determined based off my question?\n </p>\n <p>\n  Programs used:\n </p>\n <ul>\n  <li>\n   dnSPY\n  </li>\n  <li>\n   UtinyRipper\n  </li>\n </ul>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "7k",
    "tags": [
        "debugging",
        "apk"
    ],
    "user": "Stephan Saunders",
    "time": "Nov 12, 2018 at 19:59",
    "comments": [
        {
            "user": "Faizan Khan",
            "text": "<html><body><span class=\"comment-copy\">\n You can use a Tool specifically designed for Reverse Engineering Unity built APKs (and a few other Platforms) named \"DevX\". You can find further detail on their website:\n <a href=\"https://devxdevelopment.com/\" rel=\"nofollow noreferrer\">\n  devxdevelopment.com\n </a>\n P.S: I don't work at DevX nor associated with them in any way.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Reconstructing a Unity project from binaries is often not possible because/when:\n </p>\n <ul>\n  <li>\n   the project was reconstructed in different version of Unity\n  </li>\n  <li>\n   the reconstructed project uses different backend\n  </li>\n  <li>\n   there were postprocesses applied that changed assets and scripts in a way that is not compatible with Unity\n  </li>\n  <li>\n   bigger Unity projects sometimes use customized version of Editor or the engine\n  </li>\n </ul>\n <p>\n  Also the reversing tools are not bug free.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "MazeGen",
            "time": "Dec 7, 2018 at 22:34",
            "is_accepted": false,
            "comments": []
        }
    ]
}