{
    "title": "Patching an app that updates frequently",
    "link": "https://reverseengineering.stackexchange.com/questions/20034/patching-an-app-that-updates-frequently",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Hello i am working with an app coded in c# which updates very often usually within 2-3 days or sometimes every 12 hours\nThe updates are really needed for the app to work\nSo i was wondering what can i use to patch the functions i want automatically\nBeen using dnspy for now but it is a big hassle doing the same thing every day\nI am looking for suggestions, probabily dll injection or else\nThanks\n </p>\n <p>\n  Also the app uses an encrypted connection to comunicate with server, is it possible to create an app to hook/sniff the data in real time as i have the decryption key?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "295",
    "tags": [
        "patching",
        "patch-reversing",
        "c#"
    ],
    "user": "Hashim Roja",
    "time": "Dec 2, 2018 at 16:08",
    "comments": [
        {
            "user": "Hashim Roja",
            "text": "<html><body><span class=\"comment-copy\">\n bump.. anybody?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Hashim Roja",
            "text": "<html><body><span class=\"comment-copy\">\n i have decompiled it, every decompiler i have used is unable to give full correct code however i am able to edit the strings i want, i was wondering if there was a way like monitoring the process/exe and once the md5 changes automatically patch the code(functions i want changed/added). Also what about using another exe file to inject another dll into the process and the dll handles the override functions. Im just speaking out in the dust and looking for ideas or examples. About traffic the exe file listenes to a specific ip:port, probabily using httplistener class will catch the data received?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ferrybig",
            "text": "<html><body><span class=\"comment-copy\">\n How does the app update? Can you modify the launcher so it runs your patch utility after updating? Changing strings in the final jar should be as easy as find & replace on the executable\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}