{
    "title": "Meaning of cmp byte ptr [EBP-9], 0",
    "link": "https://reverseengineering.stackexchange.com/questions/20285/meaning-of-cmp-byte-ptr-ebp-9-0",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Looking to find the meaning of this statement. From what I understand its comparing 0 with value of EBP register - 9, but I don't understand what the\n  <code>\n   byte ptr\n  </code>\n  does.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "7k",
    "tags": [
        "assembly"
    ],
    "user": "John Brazley",
    "time": "Jan 6, 2019 at 20:36",
    "comments": [
        {
            "user": "wisk",
            "text": "<html><body><span class=\"comment-copy\">\n You need to provide more information about the code. It could be anything. I suggest you to see how this part of memory is initialized.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Hi an welcome to RE.SE. You may want to brush up on assembly. Your question is rather trivial and a look into Intel documentation will give you all the information you need.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Let's break this down.\n </p>\n <p>\n  First, we have the mnemonic:\n  <code>\n   cmp\n  </code>\n </p>\n <p>\n  As you state, it performs a compare, though in truth it performs a subtraction (first operand minus the second) without storing the result, but still setting flags.\n </p>\n <p>\n  Next, we have the first operand:\n  <code>\n   byte ptr [EBP-9]\n  </code>\n </p>\n <p>\n  This itself needs to be broken down.\n  <code>\n   EBP-9\n  </code>\n  is simple math, take the value of the EBP register and subtract nine from it.  The square brackets mean to then take that result and treat it like an address to a location in memory.  The\n  <code>\n   byte ptr\n  </code>\n  tells you how large of a value to grab from that memory location, in this case a single byte.  If it were a\n  <code>\n   word ptr\n  </code>\n  , then you would dereference two bytes (in little-endian byte-order, since this is Intel architecture I think).\n </p>\n <p>\n  And the second operand is a straightforward immediate value:\n  <code>\n   0\n  </code>\n </p>\n <p>\n  So, all together, that instruction is saying to compare zero with the single byte at address pointed to by\n  <code>\n   EBP-9\n  </code>\n  .\n </p>\n <p>\n  If your next question is \"why\", then you'll need to look at the other instructions before and maybe after that for context of where EBP is getting its value from (often, though not always, as a base pointer for the current function's stack frame).  Sometimes you can tell from just looking at the the disassembly, sometimes it's easier to run it in a debugger and set a breakpoint on or before the instructions you want to inspect.\n </p>\n</div>\n</body></html>",
            "votes": "11",
            "user": "0xC0000022L",
            "time": "Jan 6, 2019 at 20:38",
            "is_accepted": false,
            "comments": []
        }
    ]
}