{
    "title": "UE Megaboom serial protocol",
    "link": "https://reverseengineering.stackexchange.com/questions/20293/ue-megaboom-serial-protocol",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I recently got a UE Megaboom Bluetooth speaker. Apart from various audio profiles, I noticed the speaker also exposes a Serial Port BT profile. I suspect this is the channel the app uses to control the speaker’s advanced features.\n </p>\n <p>\n  I have tried to connect to the port using a terminal app, using various baud rates and sending it\n  <code>\n   ?<CR><LF>\n  </code>\n  and\n  <code>\n   AT?<CR><LF>\n  </code>\n  , respectively—to no avail. The speaker will not return a single bit of data.\n </p>\n <p>\n  A web search on the most common terms did not return any useful information on the protocol used.\n </p>\n <p>\n  Is there any information out there on the protocol used by the Megaboom? Or does anyone know of any attempts at decoding it?\n </p>\n <hr/>\n <p>\n  I now have some captured traffic from the official app. BTW, if another device is holding the serial port connection, the app will not recognize the speaker, corroborating my suspicion that SPP is the control channel.\n </p>\n <p>\n  In two captures I see that initially the app sends\n  <code>\n   02 00 06\n  </code>\n  (hex) over the SPP connection, to which the speaker responds with\n  <code>\n   <CR><NUL><BEL>MEGABOOM\n  </code>\n  (three control characters followed by the product name as a string).\n </p>\n <p>\n  When I connect to the speaker’s SPP and send these three characters (using moserial, sending input as hex), the speaker does not respond at all. Any ideas?\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "352",
    "tags": [
        "serial-communication",
        "protocol",
        "bluetooth"
    ],
    "user": "user149408",
    "time": "Jan 11, 2019 at 0:24",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n do you have an app or something that\n <i>\n  can\n </i>\n communicate with it over Bluetooth?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user149408",
            "text": "<html><body><span class=\"comment-copy\">\n @IgorSkochinsky There is an Android app for it, but it is proprietary and I don’t want to run it on my phone. At the most I could run it in an Android VM on my PC, but I would need the VM to establish a BT connection and capture the serial traffic.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Hi and welcome to RE.SE. I think Igor was trying to ascertain if there is some code out there that uses said protocol. And since you confirmed there is, it's probably a good idea to perform some static RCE on it. With static RCE you need not run the target anywhere (neither your phone nor a VM), but it has its limitations. Still, it would give a first clue as to whether that target is a worthwhile one in terms of RCE efforts.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If the device doesn’t respond to unsolicited traffic, it probably needs some specific commands to return results. You could try bruteforcing it by sending random data but it’s a chancy business.\n </p>\n <p>\n  A more likely approach is to sniff the traffic from the official app or at least try to analyze it statically.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "Jan 8, 2019 at 15:15",
            "is_accepted": false,
            "comments": []
        }
    ]
}