{
    "title": "How to dump firmware from car head-unit (VW Radio)",
    "link": "https://reverseengineering.stackexchange.com/questions/20295/how-to-dump-firmware-from-car-head-unit-vw-radio",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a VW Radio which has the possibility to upgrade software via USB. Unfortunately I am not able to find any updates, nor any information regarding the current Software version on the whole internet. So I decided to try to dump the files directly from the unit. My question is how can I perform the dump without physically removing the EEPROM from the board. Is there any possibility to access something through the USB port?\n </p>\n <p>\n  Its market name is RCD 320 on european Market and RCN 210 on Asian market. I do not know what is inside of the unit - as far as I have seen searching the internet, some VW units are using ARM processors and Linux 3.0.5, but this is everything I know so far, as there is no information about these units (neither regarding the SW, nor the HW).\n </p>\n <p>\n  Any guidance would be appreciated as I am a new in this domain, but I have some electronic skills and also programming skills.\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "firmware",
        "operating-systems",
        "dump"
    ],
    "user": "Andrei Bucur",
    "time": "Jan 9, 2019 at 11:14",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Hi and welcome to RE.SE. I am myself analyzing a software for the entertainment system of my car. First of all you should widen your scope.\n <a href=\"https://en.wikipedia.org/wiki/Volkswagen_Group\" rel=\"nofollow noreferrer\">\n  VW Group\n </a>\n owns a number of brands. It seems worthwhile to me to look at SEAT and Škoda who offer similar car models as the VW brand and are thus likely based on the same \"platform\". There's a chance you will be more successful in finding information under a different brand name. In my case I also found a lot of information in forums about my car brand. Last but not least: befriend a car dealer ;)\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n (cont.) Seriously, there's a chance that a car dealer (with repair shop) will be willing to give you whatever firmware update package they use in the form of a file/archive. So\n <i>\n  that\n </i>\n would be an excellent starting point for an RCE effort. Also, it's likely that the firmware is in some NAND or even on a microSD. In case of a microSD you could simply dump the contents. In general opening it up will typically reveal text on the PCB and on the components soldered onto it. These may give you further clues as to the creator or how to tackle dumping the firmware on your own.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n On another note: for PSA there are \"cheat codes\" you can enter in the head unit, which trigger the firmware to be dumped on a FAT32-formatted USB key. There's also a variation that only dumps some configuration files. Also, a port scan could help, in case your unit allows to connect to a WiFi.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It is a bit of a chicken and egg issue here. While it\n  <em>\n   may\n  </em>\n  be possible that there is some custom USB command to dump the firmware, you’re unlikely to discover it by chance without analyzing actually running firmware.\n </p>\n <p>\n  About the only possibility I can think of is DFU (Device Firmware Update) which is a semi-standard protocol for updating firmware of USB devices. If there is a known process for putting the device into update mode, you can try using\n  <a href=\"http://dfu-util.sourceforge.net\" rel=\"nofollow noreferrer\">\n   dfu-util\n  </a>\n  to see if it can communicate with the device.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Jan 8, 2019 at 13:58",
            "is_accepted": false,
            "comments": []
        }
    ]
}