{
    "title": "Extracting the contents of an unknown archive file format",
    "link": "https://reverseengineering.stackexchange.com/questions/20436/extracting-the-contents-of-an-unknown-archive-file-format",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I need some help and advice here.\nI am privately learning on how to reverse engineer\nour teachers custom file archive\nfile that have other files stored inside of them. \nfor school project.\n </p>\n <p>\n  But, I am kinda lost on where I need to start with the file.\nWhat do I look for in the file after loading it into ida-pro\nTo, be able to create my own self extracting Tool for my project.\n </p>\n <p>\n  The File format is .crackme that has been compressed with files inside of it\nfrom our teacher at school but when I double click on the file it says the file is \"archive either unknown format or damaged\".\n </p>\n <p>\n  So, yeah the file extension he gave us is not any known on the web \nhe created his own extension for us to crack it and make an extractor tool\nto get all the data from the archive his extension name is \".crackme\" \nso yeah.\n </p>\n <p>\n  Any Advice, here any help to is much appreciated by me.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "7k",
    "tags": [
        "file-format",
        "decompress",
        "binary-diagnosis"
    ],
    "user": "markkk",
    "time": "Jan 22, 2019 at 11:28",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n maybe attach the file so that people can look what's inside?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "<html><body><span class=\"comment-copy\">\n @PawełŁukasik That could just be me, but I tend to prefer generic answers, rather than \"here's your solution\" type of answers that providing specific files in a question may lead/encourage.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Hi and welcome to RE.SE. I'm confused based on the info you give. So assuming it's an archive (data file) why do you want to load it into IDA at all? What does the Unix\n <code>\n  file\n </code>\n command state ... did you try the usual\n <a href=\"https://reverseengineering.stackexchange.com/questions/tagged/firmware\">\n  firmware\n </a>\n analysis tools? Do you have access to any program that handles (reads\n <i>\n  or\n </i>\n writes) the format, which you could reverse engineer to learn more about the format?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I hope you'll find your experience in RE.SE enjoyable and educating :)\nReverse engineering is often studied as a hobby, so you're in good company!\n </p>\n <p>\n  IDA pro is a disassembler, which is focused on reverse engineering / reading assembly/machine code. that is - the code actually executed by the CPU. Since it appears you were only given a\n  <em>\n   format\n  </em>\n  file, without any executable code to manipulate / process the file, IDA will prove less useful.\n </p>\n <p>\n  Instead, the only tool you should require for such a task, assuming the format is indeed proprietary, is a hex-editor / reader.\n  <a href=\"https://www.sweetscape.com/010editor/\" rel=\"noreferrer\">\n   010 Editor\n  </a>\n  is a great one, and it has a trial version.\n </p>\n <p>\n  To eliminate the possibility of a known format, try running a couple file identification tools such as the linux\n  <code>\n   file\n  </code>\n  command,\n  <a href=\"http://mark0.net/soft-trid-e.html\" rel=\"noreferrer\">\n   TrID\n  </a>\n  ,\n  <a href=\"https://github.com/ReFirmLabs/binwalk\" rel=\"noreferrer\">\n   binwalk\n  </a>\n  , etc. These will try to identify common file formats (binwalk is specifically focused on archive formats), which if provide any insights should point you in the right direction.\n </p>\n <p>\n  To reverse engineer a file format solely based on a single file content, you'll need to map out the the file's apparent structure and you don't have a lot to go with. Excluding textual and very simply file formats, this should be kinda difficult without any additional resources (more files, a program that handles the format in any way, etc).\n </p>\n <p>\n  Here's a list of pointers/tips, although you'll probably find more information available online:\n </p>\n <ol>\n  <li>\n   As most files begin with a header, you should begin with mapping what are the different members of the header structure.\n  </li>\n  <li>\n   Things that are magic values, strings, offsets and sizes are quite easy to recognize. Most decent hex editors will show different representations of every few bytes, so it'll be easy to recognize.\n  </li>\n  <li>\n   Start by dividing the bytes to different members, before you try to understand their meaning. For example, given the following hex stream:\n   <code>\n    00 05 00 00 00 01 BE F1 CA D7\n   </code>\n   it is easy to notice the members are a word (2 bytes), a dword (4 bytes) and another dword. It is also likely that the first two are integers while the third is either a magic value or a CRC.\n  </li>\n  <li>\n   If the file has any recurring delimiter values, those should also be easily identifiable (although less likely to be present in an active file format).\n  </li>\n  <li>\n   If you manage to recognize any other file headers (probably using their own magic values), those are good leads to figuring out where the actual file content is placed. This will also mean the archive file does not compress the contained files, linux's tar, for example, can do that. Alternatively, if you encounter long streams of smooth or random looking binary streams those can be the actual compressed data. I tend to believe your teacher did not invent he's own compression algorithm, so there you'll need to find similarities to other compression algorithms, perhaps running those streams under TrID and file again could help.\n  </li>\n  <li>\n   Common looking patterns, for example, may be a useful way to uncover recurring structures (for which you'll have more than one reference point, yay!). For example, if you recognize every file-name string is followed by a sequence of bytes with a similar structure, those are probably two instances of the same structure.\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "5",
            "user": "NirIzr",
            "time": "Jan 22, 2019 at 11:32",
            "is_accepted": true,
            "comments": [
                {
                    "user": "dsasmblr",
                    "text": "<span class=\"comment-copy\">To add to Nirlzr's excellent answer, there are a couple of great communities dedicated to reversing file formats which could perhaps help serve you tremendously. They are XeNTaX and ZenHAX, respectively. Just Google those names and their forums will pop up. Each site has tutorials that discuss reverse engineering file formats, so if you really want to learn how to do this stuff, check those out. Finally, the main guy behind XeNTaX has a YouTube channel where he shows you how to reverse various file types: <a href=\"https://www.youtube.com/watch?v=ysh35jP_iBk&amp;list=PLP26ZYnLb5EVqqBHDgltL6oGrVNJ2kS2f\" rel=\"nofollow noreferrer\">youtube.com/…</a></span>",
                    "time": null
                },
                {
                    "user": "markkk",
                    "text": "<span class=\"comment-copy\">Thanks so so so much for all of the help I got from each of you really this is an incredible site and a awesome community. Anything I can do to help you all out on your questions feel free to ask I will try my best again thank you very much, strongly appreciated.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">@dsasmblr, great addition! markkk, you're welcome!</span>",
                    "time": null
                },
                {
                    "user": "markkk",
                    "text": "<span class=\"comment-copy\">Is, there a version of Bin-walk for windows versions of Ida-pro if not is there an alternative to Bin-walk for windows that focuses on archives. @NirIzr #NirIzr</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Many archive formats contain headers. gzip headers for instance begin with\n  <code>\n   1f 8b\n  </code>\n  . Use a hex-editor to check for known magic numbers in the header first.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Robert",
            "time": "Jan 22, 2019 at 5:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}