{
    "title": "Re-run autoanalysis in Hopper?",
    "link": "https://reverseengineering.stackexchange.com/questions/2054/re-run-autoanalysis-in-hopper",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have loaded a raw binary (ARM firmware image) into Hopper, and manually marked the entry point as code. But now I'd like to have Hopper do auto-analysis (recursive traversal) starting from that code region, and I can't figure out how to get it to do that (the way it would if I'd loaded a standard PE or elf binary). I can use \"Disassemble whole segment\", but that seems to do a linear sweep of the entire (30M) binary, which results in a lot of garbage.\n </p>\n <p>\n  Is there any way to do this?\n </p>\n</div>\n</body></html>",
    "votes": "11",
    "answers": 1,
    "views": "1k",
    "tags": [
        "tools",
        "disassembly",
        "hopper"
    ],
    "user": "Brendan Dolan-Gavitt",
    "time": "May 17, 2013 at 18:46",
    "comments": [
        {
            "user": "Brendan Dolan-Gavitt",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks for the input, but IDA isn't mentioned anywhere in my question. Recursive disassembly is clearly something Hopper is capable of, I'm just asking how to trigger it. Do you have some source or reference that says that it can't be done?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "joxeankoret",
            "text": "<html><body><span class=\"comment-copy\">\n I tried with the latest demo version with an ELF binary: pressing C to make code doesn't make code for all the jumps and calls. Pressing 'P' creates a procedure for the function at cursor but doesn't do anything for the functions referenced from that function. So, while recursive disassembly is supported by Hopper it fails to do so properly in current versions.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "David Hoelzer",
            "text": "<html><body><span class=\"comment-copy\">\n I haven't run into this with Hopper, but I do use IDA far more. Does the Scripts -> Mark All Procedures make any difference for you?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You can mark your entrypoint as\n  <em>\n   unexplored\n  </em>\n  (U) and then mark it as\n  <em>\n   code\n  </em>\n  (C) your segment: Hopper will re-analyse it, as code.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "jvoisin",
            "time": "Oct 26, 2013 at 18:07",
            "is_accepted": false,
            "comments": []
        }
    ]
}