{
    "title": "Does a Motorola SREC file give me any additional information over a binary ROM image?",
    "link": "https://reverseengineering.stackexchange.com/questions/2056/does-a-motorola-srec-file-give-me-any-additional-information-over-a-binary-rom-i",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  When working with embedded systems, it is often easiest to use a downloadable firmware file rather than recover the firmware from the device.\n </p>\n <p>\n  Mostly these are ROM images in the form of a .bin file. Sometimes, they are Motorola SREC files (often called .s19 files or .mot files).\n </p>\n <p>\n  These are easily converted into bin files using many available tools. The SREC files tend to only contain records where there is actually data/code and the gaps are filled with padding values during conversion. Padding tends to be 0x00 or 0xFF.\n </p>\n <p>\n  This can gives us a hint about the data segment of the image - it allows us to tell if the memory has been initialised with 0x00/0xFF intentionally by the compiler/assembler, or if it is just padding. Sometimes this can make identifying data structures easier.\n </p>\n <p>\n  Is there anything else an SREC file can leak?\n </p>\n</div>\n</body></html>",
    "votes": "8",
    "answers": 2,
    "views": "2k",
    "tags": [
        "firmware",
        "embedded"
    ],
    "user": "Cybergibbons",
    "time": "May 19, 2013 at 6:10",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Correct me if I'm wrong, but since SREC is an ASCII representation of the binary data, wouldn't the corresponding binary file also \"leak\" sections of data that are padded with 0x00/0xFF?\n </p>\n <p>\n  With that said, yes, I think that in some cases SREC could expose useful information about the firmware that you wouldn't otherwise get with a binary image, assuming the vendor makes proper use of SREC's record types. Each line of text in an SREC file starts with a record code (S0, S1, S2, etc). Some example record types from\n  <a href=\"http://en.wikipedia.org/wiki/SREC_%28file_format%29#Format\" rel=\"noreferrer\">\n   Wikipedia's\n  </a>\n  SREC page:\n </p>\n <blockquote>\n  <p>\n   The S0 record data sequence contains vendor specific data rather than\n  program data. String with file name and possibly version info.\n  </p>\n  <p>\n   Data sequence, depending on size of address needed. A 16-bit/64K\n  system uses S1, 24-bit address uses S2 and full 32-bit uses S3.\n  </p>\n  <p>\n   The address field of the S7, S8, or S9 records may contain a starting\n  address for the program.\n  </p>\n </blockquote>\n <p>\n  Clearly, an SREC file provides information about the data in each record - information which normally would not be contained in a binary file. If you see an S7/8/9 record for example, you can probably assume that the firmware's entry point is located there. Likewise, the use of S2 vs S3 can tell you if the data contains 24 bit addresses or 32 bit addresses.\n </p>\n <p>\n  How common it is to use these different SREC record types in practice though, I couldn't say. A vendor could probably just mark everything with the same record type (S1 for example), which wouldn't really give you any more information about the data than a binary file would.\n </p>\n</div>\n</body></html>",
            "votes": "7",
            "user": "devttys0",
            "time": "May 19, 2013 at 12:22",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Cybergibbons",
                    "text": "<span class=\"comment-copy\">Thanks. SREC files often seem to only contain the bare minimum required - so if there is a row of FFFFFFFF, something in the compiler has put it in there. It's often not much to go on though.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Usually you only get addresses and raw bytes, but some tools/compilers may use custom record types or add extra information. For example, Tasking VX toolchain for Tricore uses an S0 record for identification:\n </p>\n <blockquote>\n  <p>\n   <strong>\n    S0-record\n   </strong>\n  </p>\n  <pre><code>'S' '0' <length_byte> <2 bytes 0> <comment> <checksum_byte>\n</code></pre>\n  <p>\n   A linker generated S-record file starts with a S0 record with the\n  following contents:\n  </p>\n  <p>\n   length_byte : 0x6\n   \n\n   comment : ltc (TriCore linker)\n   \n\n   checksum : 0xB6\n  </p>\n  <pre><code>        l t c\nS00600006C7463B6\n</code></pre>\n  <p>\n   The S0 record is a comment record and does not contain relevant\n  information for program execution.\n  </p>\n </blockquote>\n</div>\n</body></html>",
            "votes": "6",
            "user": "Igor Skochinsky",
            "time": "Dec 7, 2017 at 15:44",
            "is_accepted": false,
            "comments": []
        }
    ]
}