{
    "title": "How to 'hack' the chat box in an online game",
    "link": "https://reverseengineering.stackexchange.com/questions/20625/how-to-hack-the-chat-box-in-an-online-game",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  First and foremost, this is really just a UI hack, nothing that would give you an unfair advantage over an opponent.\n </p>\n <p>\n  I play an online game that is predominately played by Spanish speaking players. I've got a really simple lookup type program that swaps out Spanish words for English so I work out what they are saying, so I can communicate with my teammates. I currently do this by typing whatever I understand from the game window into another window I have open (my program), it's cumbersome and messy and I'd like to just have this done automatically, ideally in the UI of the game.\n </p>\n <p>\n  Is there a solid plan I can use to go about finding out how to do this. I've tried to find memory addresses of the text, but this seems to change every execution and doesn't even maintain messages as more messages are received.\n </p>\n <p>\n  Any help or advice would be great; also any questions please feel free to ask, I'm not sure what information is appropriate to share.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "1k",
    "tags": [
        "game-hacking"
    ],
    "user": "FraserOfSmeg",
    "time": "Feb 15, 2019 at 22:20",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Yeah, there are multiple ways that this can be accomplished, depending on the type of game.\n </p>\n <p>\n  If the network packets of the game aren't encrypted you could probably sniff the traffic for the \"chat message\" network.\n </p>\n <p>\n  You could do a graphics library injection and replace the chat message routine with yours. I would imagine it would be similar to the process you would follow for developing a wall hack (chams)... First figure out what graphics library the game is using. Then determine which function routine is being used for writing the text. Hooking your own graphics calls is probably the approach that I would take considering graphics library API is pretty well documented.\n </p>\n <p>\n  Which game is it?\n </p>\n <p>\n  Another thing you could probably do is just use a text parser to read the chat box with python or whatever language.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "codecustard",
            "time": "Feb 15, 2019 at 23:47",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  One approach is to use DLL Injection. You would have to identify the functions that prints chat, then you can install a hook and make it process a different text.\n </p>\n <p>\n  Here's an example of this:\n  <a href=\"https://github.com/ur0/DotATranslator\" rel=\"nofollow noreferrer\">\n   https://github.com/ur0/DotATranslator\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Daniel Sloof",
            "time": "Feb 16, 2019 at 14:53",
            "is_accepted": false,
            "comments": []
        }
    ]
}