{
    "title": "Dumping flash from a running Cortex-M",
    "link": "https://reverseengineering.stackexchange.com/questions/20765/dumping-flash-from-a-running-cortex-m",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a working device with a STM32F405ZGT6 in it. I want to dump the software it runs.\n </p>\n <p>\n  As far as I can tell, there's no external flash on the device, so it must be running off of the internal flash.\n </p>\n <p>\n  I've identified the SWD pins on the package and the designers helpfully left tiny attachment points to them.\n </p>\n <p>\n  As someone who's never done this on the hardware side, now what? What hardware do I need to attach to this core? What software? (I keep reading about openocd - is there something better?) How hard of a journey am I starting here?\n </p>\n <p>\n  Any help would be greatly appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "412",
    "tags": [
        "arm"
    ],
    "user": "Delyan",
    "time": "Mar 3, 2019 at 22:13",
    "comments": [
        {
            "user": "domen",
            "text": "<html><body><span class=\"comment-copy\">\n SWD/JTAG dongle + openocd. It might not work, if fuse bits are programmed to prevent this.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Delyan",
            "text": "<html><body><span class=\"comment-copy\">\n I'm reading the datasheet for the chip and I'm struggling to answer this question - can the flash dump protection be in place if the device supports over the air updates? As far as I understand, the protection works by disallowing data reads from the flash and only allowing instruction-fetch reads. Can you even implement OTA in a system like this?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "domen",
            "text": "<html><body><span class=\"comment-copy\">\n Restrictions are normally for debug interfaces, not for reading from flash when executing (as you said, instructions and data must be fetched from there) and not for programming from code (IAP).\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}