{
    "title": "Identifying a toner chip and its communication protocol to re-program it",
    "link": "https://reverseengineering.stackexchange.com/questions/20780/identifying-a-toner-chip-and-its-communication-protocol-to-re-program-it",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I need help identifying a chip and how to reset it from a new Brother's toner cartridge TN227 and TN223. This comes from the new Brother HL-L3230CDW laser printer.\n </p>\n <p>\n  There is currently no information on how to reverse engineer these chips to reset them, so I decided to investigate further, however I'm currently stuck.\n </p>\n <p>\n  Here are some pictures of the starter TN223 chip that my printer came with:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/Y9LyP.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"Pads of chip with numbers I added\" src=\"https://i.sstatic.net/Y9LyP.png\"/>\n  </a>\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/8j7Km.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"Back of Chip\" src=\"https://i.sstatic.net/8j7Km.jpg\"/>\n  </a>\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/I5yI9.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"Light shining through chip\" src=\"https://i.sstatic.net/I5yI9.jpg\"/>\n  </a>\n </p>\n <p>\n  The pictures are shown as following:\n </p>\n <ul>\n  <li>\n   Pads of chip with numbers I added\n  </li>\n  <li>\n   Back of Chip\n  </li>\n  <li>\n   Light shining through chip\n  </li>\n </ul>\n <p>\n  I then opened the printer to determine which pins go to what. I first used a multi-meter to determine that pads 2,3,4 are shorted to each other on each chip for each color C, Y, M, BK. I then found pad 2 was shorted to the printer frame, so I assumed that was ground. Then I looked at the wiring color. It's matched as the following:\n </p>\n <ul>\n  <li>\n   1: purple, 2: white, 3: black, 4: red\n  </li>\n </ul>\n <p>\n  When I attempted to measure any voltages from any of the pads during power-on, I was unable to measure anything.\n </p>\n <p>\n  I then connected a logic analyzer to the printer with the chip attached to see if I could figure out what protocol it was using. Assuming white is GND, Here's a sample of the Sigrok Pulseview  received:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/teNVF.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"sample data assuming pad 2 is ground\" src=\"https://i.sstatic.net/teNVF.png\"/>\n  </a>\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/J1teS.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"zoomed in on start of data\" src=\"https://i.sstatic.net/J1teS.png\"/>\n  </a>\n </p>\n <p>\n  I ran the test twice and attached the Sigrok file results\n  <a href=\"https://drive.google.com/file/d/1LRBKmhKruzNNKLFl359ab0C8VVCKJCxc/view?usp=sharing\" rel=\"nofollow noreferrer\">\n   here\n  </a>\n  and\n  <a href=\"https://drive.google.com/file/d/1aRRibu_b7KzSSxnMR3Ef6y35k-U_M7-N/view?usp=sharing\" rel=\"nofollow noreferrer\">\n   here\n  </a>\n  .\n </p>\n <p>\n  These can be opened in Pulseview (free program) for a graphical representation of the data\n </p>\n <p>\n  It appears that the data is only sending when pad 4 goes high, I assume this is VCC. I then measured the voltage from pad 4 when communication occurs using an arduino and measured 3.3V. I now assume the chip is using 3.3V logic.\n </p>\n <p>\n  I still don't know if the pad 2 is GND since pad 3 is black which usually indicated ground, however as previously stated pad 2 is shorted to the frame of the printer.\nI then attempted to connect pad 3 as GND to my logic analyzer and connect pad 2 as not ground, however something strange occurred, and the printer no longer accepted the cartridge I was messing around with. Going back to pad 2 as ground, and it started working again. I'm now assuming pad 2 is ground.\n </p>\n <p>\n  When investigating the data further, there seems to be a little difference between two runs. I simply turned the printer on and recorded data then immediately turned it off then back on to get my second run, however the data seemed to change slightly. To ensure it wasn't due to sampling error, I increased the sampling to 20 MHz, which includes about 20 samples per clock cycle which should be sufficient to measure the wave forms consistently.\nWhen measuring the clock rate, I found it to be between 432-457Khz.\n </p>\n <p>\n  One idea I currently have is to analyze the data and find the ASCII text \"brother\" since each chip is required to have a manufacturing name and because the cartridges I have are from brother. More info can be found in\n  <a href=\"http://update.brother.co.jp/pbj/pdf/en/Brother_White_Paper_Genuine_Authentication_Inkjet_EN.pdf\" rel=\"nofollow noreferrer\">\n   Brothers white paper\n  </a>\n  .\n </p>\n <p>\n  I'm not sure the best approach to analyze the binary data, since I can't identify the communication protocol, and I'm concerned that it might be encrypted. After searching patents to see if I could find more info on the chip, this was all I could find:\n  <a href=\"http://www.freepatentsonline.com/y2013/0070279.html\" rel=\"nofollow noreferrer\">\n   http://www.freepatentsonline.com/y2013/0070279.html\n  </a>\n  This suggests that the chip may be using crypto to hide info on the chip. If so, would it possible to crack it?\n </p>\n <p>\n  I tried analyzing the data as if it were I2C, but this doesn't seem right, Also I'm pretty sure it's not SPI. I do know there's a clock involved, so I know it has to be synchronous, but any help would be appreciated!\n </p>\n</div>\n</body></html>",
    "votes": "10",
    "answers": 1,
    "views": "5k",
    "tags": [
        "hardware",
        "serial-communication",
        "cryptanalysis"
    ],
    "user": "benjinne",
    "time": "Dec 6, 2021 at 19:14",
    "comments": [
        {
            "user": "Avery3R",
            "text": "<html><body><span class=\"comment-copy\">\n I'm guessing it's I2C and D3 is SCL, D1 SDA, and D4 VCC\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "benjinne",
            "text": "<html><body><span class=\"comment-copy\">\n The issue I have with I2C is that my data line is normally low as compared to normal  I2C which is normally high, also I can't identify a start condition since both the clock and data line go high at the same time. I added an image showing the start of the data above.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Akos Fazekas",
            "text": "<html><body><span class=\"comment-copy\">\n Do you have any update? Thanks, Akos\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "benjinne",
            "text": "<html><body><span class=\"comment-copy\">\n No, haven't messed with the printer since I posted this. Let me know if you find anything @AkosFazekas. Thanks\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "pythonpython",
            "text": "<html><body><span class=\"comment-copy\">\n Can you post the binary messages as a hex dump?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you have a Brother printer you can use these instructions I found on Amazon on how to reset your cartridge chip, it worked for me.\n </p>\n <p>\n  \"I was able to reset my toner cartridges for this model by using the process that I found by doing some googling for a \"better way to reset brother\" toner cartridges.\n </p>\n <p>\n  Summarized, open the inside cover where the toner cartridges are located.\nNext, press the back and X buttons simultaneously.\nThen, press the back button again. This should bring up the toner reset menu.\n </p>\n <p>\n  I had to try a number of times...I think I wasn't pressing exactly at the same time on those two buttons OR they intentionally build it so you have to do it multiple times to make it work. In any case, it is now reset. Happy Camper.\"\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Tim Do Brava",
            "time": "Dec 27, 2019 at 3:42",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Brian Michalk",
                    "text": "<span class=\"comment-copy\">The latest firmware, MAIN:1.35, SUB1:1.14, SUB5:1.00 will not allow me to reset the toner cartridges.</span>",
                    "time": null
                }
            ]
        }
    ]
}