{
    "title": "decompiled android application with only one class [DexProtector]",
    "link": "https://reverseengineering.stackexchange.com/questions/20942/decompiled-android-application-with-only-one-class-dexprotector",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to reverse engineering an android app and it's mostly for an experiment but I have a problem that I can't find a solution or even what is the problem.\n </p>\n <p>\n  I decompiled an app with JADX-gui and the whole app only have a single class named\n </p>\n <p>\n  <code>\n   public class ProtectedMyApplication extends Application\n  </code>\n </p>\n <p>\n  and its a really large file and my IDE can't open it well but on this class file there is a byte[] with almost 2000 lines of bytes I can't find any other classes but in the manifest file I can see the other classes\n </p>\n <p>\n  my questions are :\nwhat is this method? and how can I study it? and is there a way to see the original smali or java code?\n </p>\n <p>\n  <strong>\n   UPDATE:\n  </strong>\n </p>\n <p>\n  app is using Dexprotecter I think and I watched the changing files and when I start the app there is two folders that will be modify one of them is the encrypted code (a .dat file with a .dex file) and there is another folder named app_outdex and I think this is the decrypted code but I can't catch the file app will remove it immediately is there any way to catch the file? I'm really so dumb in the Linux\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "1k",
    "tags": [
        "android",
        "java"
    ],
    "user": "Amin",
    "time": "Mar 25, 2019 at 21:41",
    "comments": [
        {
            "user": "Chris Stratton",
            "text": "<html><body><span class=\"comment-copy\">\n It's been obfuscated specifically to frustrate you, maybe even in a way tuned to make decompilers produce garbage.  If you really want to study this, you'll probably need to look at the smali code and not try to turn it back into Java, at least not until you can find meaningful patterns.   Typically what is most accessible to analysis is interaction with the system libraries, which can't distorted too much without measured more extreme than usually taken.  What goal are you trying to accomplish, anyway?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Amin",
            "text": "<html><body><span class=\"comment-copy\">\n @ChrisStratton hi I find the method its Dexguard Decrypting the bytes in runtime and I just want to find the way app connects to API\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "PhoeniX",
            "text": "<html><body><span class=\"comment-copy\">\n Can you elaborate on what exactly you want to study? May be don't really need to de-obfuscate the file.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Amin",
            "text": "<html><body><span class=\"comment-copy\">\n @PhoeniX hi I'm trying to see the API requests and the API calls is encrypted and i can't see it with MITM\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "PhoeniX",
            "text": "<html><body><span class=\"comment-copy\">\n @Amit, use Frida to hook unlink/remove API call to backup the file that is being removed.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}