{
    "title": "Best python framework/library for constructing the call-graph from binary?",
    "link": "https://reverseengineering.stackexchange.com/questions/21106/best-python-framework-library-for-constructing-the-call-graph-from-binary",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  So i have written a python tool using capstone that disassembles the code section of a ELF binary using capstone.\n </p>\n <p>\n  now i want to also create and show the call-graph of this binary in a dot format, I tried googling but couldn't find how to do this with capstone or if its possible with it or not, i also heard about some other frameworks like radare2 and such but I'm still not sure which framework is good for this purpose\n </p>\n <p>\n  so what do you guys suggest? how can i make the call-graph by using some framework in my own code? ( i don't want a tool for this, i already know there are tools/programs for this out there, and i dont want to copy their code for this i want to write my own)\n </p>\n <p>\n  is it even possible with static analysis, meaning just by reading the file? considering some function calls might be indirect? ( i only need to do this using call and ret instructions)\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "401",
    "tags": [
        "binary-analysis",
        "python",
        "binary",
        "call-graph"
    ],
    "user": "John P",
    "time": "Apr 10, 2019 at 13:11",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  My suggestion is that you generate a graphviz (\n  <a href=\"https://graphviz.org/\" rel=\"nofollow noreferrer\">\n   https://graphviz.org/\n  </a>\n  ) file with all the nodes and all the information that you want and then with the command dot you paint the graph. However, if you want to make it on realtime or on a fancy UI I will suggest you use networkx (\n  <a href=\"https://networkx.github.io/\" rel=\"nofollow noreferrer\">\n   https://networkx.github.io/\n  </a>\n  )\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "camp0",
            "time": "Apr 10, 2019 at 15:59",
            "is_accepted": true,
            "comments": []
        }
    ]
}