{
    "title": "How to find the index of static ilbrary functions in the PLT of the binary?",
    "link": "https://reverseengineering.stackexchange.com/questions/21163/how-to-find-the-index-of-static-ilbrary-functions-in-the-plt-of-the-binary",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  So right now I'm trying to resolve function calls and their names in my reversing tool\n </p>\n <p>\n  the problem I'm having is that library functions such as printf and fwrite and such do not have a corresponding address in symbol table unlike functions inside the actual program which do contain a virtual address in the symbol table and therefore i can resolve their name when they are called statically\n </p>\n <p>\n  basically i want to resolve the name of functions even static library functions like printf just like how readelf does (i tried readelf and indeed it does resolve the name of printf even tho it says the address value of printf inside symbol table is 0 unlike other functions so not sure how does it realize the offset of printf inside plt)\n </p>\n <p>\n  so i have these questions :\n </p>\n <ol>\n  <li>\n   <p>\n    how to find the index or address of printf in the PLT so i can resolve its name when i see a \"Call address\"\n   </p>\n  </li>\n  <li>\n   <p>\n    why doesn't the symbol table contain the virtual address of these functions unlike functions inside the code? considering these are static libraries and are statically linked in that program, shouldn't they have a fixed address just like other functions?\n   </p>\n  </li>\n  <li>\n   <p>\n    the program is only a printf function inside main and only included stdio.h, now my understanding is that i included the stdio.h statically considering i included it in the beginning and didnt use any specific option while compiling. so why is it going into PLT instead of .text section and having a static address? i thought when i include a library in the beginning it basically copy and pastes it into my .text section?\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "372",
    "tags": [
        "binary-analysis",
        "x86",
        "c",
        "elf",
        "binary"
    ],
    "user": "Max",
    "time": "Apr 16, 2019 at 10:55",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   how to find the index or address of printf in the PLT so i can resolve its name when i see a \"Call address\"\n  </p>\n </blockquote>\n <p>\n  When a function is present in\n  <code>\n   PLT\n  </code>\n  (Procedure Linkage Table) section, that means its address isn't known at compilation time and has to be resolved by dynamic linker at the runtime. However, just to know that a certain function is called at some point in the program you may use a tool like\n  <a href=\"https://en.wikipedia.org/wiki/Objdump\" rel=\"nofollow noreferrer\">\n   objdump\n  </a>\n  , which will show you the function name followed by\n  <code>\n   @plt\n  </code>\n  like so:\n </p>\n <pre><code>call   720 <printf@plt>\n</code></pre>\n <blockquote>\n  <p>\n   why doesn't the symbol table contain the virtual address of these functions unlike functions inside the code? considering these are static libraries and are statically linked in that program, shouldn't they have a fixed address just like other functions?\n  </p>\n </blockquote>\n <p>\n  Because they\n  <strong>\n   are not\n  </strong>\n  statically linked (see first sentence of the answer for the first question). They don't have fixed addresses, since these will be resolved during the runtime.\n </p>\n <blockquote>\n  <p>\n   so why is it going into PLT instead of .text section and having a static address? i thought when i include a library in the beginning it basically copy and pastes it into my .text section?\n  </p>\n </blockquote>\n <p>\n  It would be the waste of space if every executable contained copy of the same library. The\n  <code>\n   .h\n  </code>\n  files are included and they often contain\n  <strong>\n   just the declarations\n  </strong>\n  . So you don't include compiled definitions of functions declared in\n  <code>\n   .h\n  </code>\n  - just the prototypes. The\n  <strong>\n   linker\n  </strong>\n  is responsible for linking the program with the libraries used in it. They still may be linked either statically or dynamically and since dynamic linking avoids copying entire libraries' code into every single executable, it's often used instead of static one.\n </p>\n <p>\n  See\n  <a href=\"https://stackoverflow.com/questions/7096152/c-difference-between-linking-library-and-adding-include-directories\">\n   this question\n  </a>\n  for further reference.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "bart1e",
            "time": "Jun 8, 2019 at 15:13",
            "is_accepted": true,
            "comments": []
        }
    ]
}