{
    "title": "Output address path during .exe execution",
    "link": "https://reverseengineering.stackexchange.com/questions/21273/output-address-path-during-exe-execution",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have an obfuscated software. I'm a beginner in this area, so I don't find where a patch would be useful for what I want to do.\n </p>\n <p>\n  It turns out that I have an idea of how I could find out in which addresses I need to search: the software behaves differently if I add some lines in its config files.\n </p>\n <p>\n  So, I'd like to output a text file which contains all the addresses the RIP was set to.\n </p>\n <p>\n  Then I'll be able to diff the files and have an idea of when the execution flow diverged...\n </p>\n <p>\n  However, in order to do that I need to use Windows and not Linux because this software doesn't work well with Wine.\n </p>\n <p>\n  How could I do, to create such a script, on Windows?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "62",
    "tags": [
        "windows",
        "deobfuscation",
        "patching"
    ],
    "user": "Drarig29",
    "time": "May 4, 2019 at 14:04",
    "comments": [
        {
            "user": "Rup",
            "text": "<html><body><span class=\"comment-copy\">\n That log would be huge. I suspect your only options would be to run it in an emulator, and modify that to output registers as it went, or find a debugger that you can modify (gdb?) to keep single stepping execution and logging as it goes.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "sudhackar",
            "text": "<html><body><span class=\"comment-copy\">\n Use a coverage engine like dynamorio's drrun to calculate basic blocks covered for each file. Then use something like\n <a href=\"https://github.com/gaasedelen/lighthouse\" rel=\"nofollow noreferrer\">\n  lighthouse\n </a>\n to visualise instructions covered in both files.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Drarig29",
            "text": "<html><body><span class=\"comment-copy\">\n I might have found the solution\n <a href=\"https://gist.github.com/thlorenz/72ead62cd09bec40d8d2\" rel=\"nofollow noreferrer\">\n  here\n </a>\n . But I still need to try it...!\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Johann Aydinbas",
            "text": "<html><body><span class=\"comment-copy\">\n That sounds like a classic use case for PIN, the dynamic instrumentation tool from Intel. The solution you linked might do the same but I'd assume it to be orders of magnitude slower because it's effectively single stepping. This is a typical use case for PIN though, creating a run trace and then diffing. I don't have a tutorial handy though.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}