{
    "title": "Reverse engineer Apple T2/SSD driver for linux",
    "link": "https://reverseengineering.stackexchange.com/questions/21455/reverse-engineer-apple-t2-ssd-driver-for-linux",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I wasn't exactly sure if this is the right place, as opposed to thinkdifferent or stackoverflow but I figure this might be a good place to start. I have a Macbook Pro 2018 15-inch laptop and want to to run linux. Unfortunately, Apple has moved some driver functions of the SSD or SSD controller to the T2 chip so currently no version of linux is able to \"see\" the SSD, and thus Linux can't be\n  <strong>\n   installed\n  </strong>\n  on these machines, although you can theoretically run it off an external drive.\n </p>\n <p>\n  Since MacOS is a darwin-BSD fork, I wanted to know if anyone had opinions on whether to start with the MacOS driver or the driver for Windows 10, since Apple allows/enables Windows 10 via bootcamp. I've turned off all the security options and disabled csrutil.\n </p>\n <p>\n  This github thread seems willing, and slowly making progress:\n  <a href=\"https://github.com/Dunedan/mbp-2016-linux/issues/71\" rel=\"nofollow noreferrer\">\n   https://github.com/Dunedan/mbp-2016-linux/issues/71\n  </a>\n </p>\n <p>\n  It is possible to install Linux on this model's predecessor, which is nearly identical, with the major difference being the T2 chip:\n  <a href=\"https://foolcontrol.org/?p=2952\" rel=\"nofollow noreferrer\">\n   https://foolcontrol.org/?p=2952\n  </a>\n </p>\n <p>\n  I'm willing to risk bricking my machine to get a working driver out there, but I've never written any kind of hardware driver, much less try to reverse-engineer one! Any guidance on where to start or which tools to use to capture IO?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "750",
    "tags": [
        "driver"
    ],
    "user": "SciGuy",
    "time": "Jul 1, 2019 at 15:22",
    "comments": [],
    "answers_data": []
}