{
    "title": "Which countries allow reverse engineering for one of their licences when it permits unlimited software copying, & doesn't forbid reverse engineering?",
    "link": "https://reverseengineering.stackexchange.com/questions/21568/which-countries-allow-reverse-engineering-for-one-of-their-licences-when-it-perm",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I was under the impression that reverse engineering can mainly be legally prohibited in two ways: via copyright law forbidding the making of copies; and via an end-user licence agreement (EULA) specifically prohibiting reverse engineering.\n </p>\n <p>\n  I've come across a software licence that permits unlimited software copying (under certain conditions) & doesn't explicitly prohibit reverse engineering. I'm based in the UK, and thought that if UK law governed the agreement, that I would then be able to reverse engineer the software (under the certain conditions).\n </p>\n <p>\n  It just so happens that Californian law governs the licence so I'm slightly unsure as to whether I can legally reverse engineer the software.\n </p>\n <p>\n  Anyone have any answers on the overall question of this post?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "659",
    "tags": [
        "law"
    ],
    "user": null,
    "time": "Jun 27, 2019 at 17:54",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n My suggestion, go see a lawyer. However, beware that even a single lawyer may offer several opinions ;)\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user28854",
            "text": "<html><body><span class=\"comment-copy\">\n It's not really a big enough deal to go to see a lawyer. Also, a general answer to this question is useful for a number of problems, including the problems of others.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n The tricky part here is that you'll hardly find a lawyer who is also a reverse engineer (here or elsewhere). A possible way would be to ask over on\n <a href=\"https://law.stackexchange.com\">\n  law.SE\n </a>\n . But similar questions have been asked here via\n <a href=\"https://reverseengineering.stackexchange.com/questions/tagged/law\">\n  law\n </a>\n and they typically end in opinion-based answers.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user28854",
            "text": "<html><body><span class=\"comment-copy\">\n @0xC0000022L -> I've already asked the question on the law SE. I don't mind opinion-based answers. They help give an idea on what the correct course of action should be. Even if you get professional legal counsel, the counsel can end-up being wrong although I suppose legal insurance can help mitigate the damage in such situations.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You should check the\n  <a href=\"https://www.eff.org/issues/coders/reverse-engineering-faq\" rel=\"nofollow noreferrer\">\n   EFF's FAQ on RE\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Remko",
            "time": "Nov 26, 2019 at 11:58",
            "is_accepted": false,
            "comments": []
        }
    ]
}