{
    "title": "Dump the value of register into file",
    "link": "https://reverseengineering.stackexchange.com/questions/21628/dump-the-value-of-register-into-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've reverse engineering little game on windows 32bit.\n </p>\n <p>\n  I found a string in executable which was interesting for me (it is a board game and this string represents the fact that somebody made a move on the board).\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/c7G8k.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"Interesting memory address\" src=\"https://i.sstatic.net/c7G8k.png\"/>\n  </a>\n </p>\n <p>\n  You can see that in the string is moved into\n  <code>\n   eax\n  </code>\n  . But more interesting part here is instruction before that\n </p>\n <pre><code>mov ebx,eax\n</code></pre>\n <p>\n  Here\n  <code>\n   ebx\n  </code>\n  will contain the coordinate of a move which player made. This is what I'm interested about. I want to dump this coordinate into a file. So what I want to do is to modify assembly(in my case this code is in dll) and just write that data(which is in\n  <code>\n   ebx\n  </code>\n  ) into a file.\n </p>\n <p>\n  I've done a little research but could not found anything useful. All I found is how to patch an executable like make a slightest modifications into assembly which is pretty simple. I was even wondering if there is any tool that could help me achieve this(like shift assembly code to make enough space for me to write some code in it).\n </p>\n <p>\n  One idea that I have is to write a shellcode which dumps data, then add that shellcode at the end of some section, find my string into .txt section, edit the code to jump to my shellcode and then back to original state. But that would be pretty hard because I'm not really experienced in writing shellcode.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "99",
    "tags": [
        "windows",
        "assembly",
        "x86",
        "c++"
    ],
    "user": "Ojs",
    "time": "Jul 8, 2019 at 15:57",
    "comments": [
        {
            "user": "bart1e",
            "text": "<html><body><span class=\"comment-copy\">\n What about setting a breakpoint there and reading\n <code>\n  ebx\n </code>\n value?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ojs",
            "text": "<html><body><span class=\"comment-copy\">\n I want to launch application normally without a debugger and I want it to dump the data.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "bart1e",
            "text": "<html><body><span class=\"comment-copy\">\n Are you able to upload the executable?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "bart1e",
            "text": "<html><body><span class=\"comment-copy\">\n You may try Cheat Engine. It enables you to write scripts that could dump the data you want, but if you want the DLL to do this for you, patching will be the only option.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xec",
            "text": "<html><body><span class=\"comment-copy\">\n @Ojs Binary Ninja (incl. the demo version) has a shellcode compiler. You can use that to write a short C snippet to do what you want and it would emit the corresponding assembly instructions.\n <a href=\"https://scc.binary.ninja/\" rel=\"nofollow noreferrer\">\n  scc.binary.ninja\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}