{
    "title": "How to virtualize part of a code like VMProtect does?",
    "link": "https://reverseengineering.stackexchange.com/questions/21709/how-to-virtualize-part-of-a-code-like-vmprotect-does",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am a new student in the field of cybersecurity.\n </p>\n <p>\n  I would like to learn more about how virtualization used by software such as\n  <a href=\"https://oreans.com/codevirtualizer.php\" rel=\"nofollow noreferrer\">\n   CodeVirtualizer\n  </a>\n  and\n  <a href=\"https://vmpsoft.com/support/user-manual/introduction/what-is-vmprotect/\" rel=\"nofollow noreferrer\">\n   VMProtect\n  </a>\n  works, and ideally to be able to virtualize part of my code in VB.NET. However, I do not understand how they operate, and I find it hard to find resources about it. So, I ask myself the following questions:\n </p>\n <ul>\n  <li>\n   What functions do these programs use to achieve this virtualization? How do this work, step by step? Obviously, these are private software, so the source code is not given. The virtualization of a part of a code is difficult for me to conceive. It's obviously not about system virtualization like VMware or VirtualBox, but a part of a code. Is the environment changed?\n  </li>\n  <li>\n   From this last observation, where are the virtualized files stored?\nIf my virtualized program wants to write to disk, will the data be\nwritten to a virtualized disk?\n  </li>\n </ul>\n <p>\n  It may be difficult to answer every detail of each of my questions; I imagine that the domain is complex. Nevertheless, if some elements of answers could be brought, it would help me a lot to better understand :)\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 0,
    "views": "842",
    "tags": [
        "anti-debugging",
        "virtualizers",
        "vmprotect",
        "vms"
    ],
    "user": "Corentin Mar",
    "time": "Jul 18, 2019 at 21:32",
    "comments": [
        {
            "user": "R4444",
            "text": "<html><body><span class=\"comment-copy\">\n The code virtualizer website you mentioned explains everything in details, also check out this github repo for more info -\n <a href=\"https://github.com/ScalletaZ/phantasm-x86-virtualizer\" rel=\"nofollow noreferrer\">\n  github.com/ScalletaZ/phantasm-x86-virtualizer\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "MazeGen",
            "text": "<html><body><span class=\"comment-copy\">\n There is the most trivial \"VM\" you could start with. It actually interprets few x86 instructions. The difference from \"real\" virtualizer is that a virtualizer transforms the x86 instructions to a bytecode.\n <a href=\"https://github.com/Barebit/trivial-vm\" rel=\"nofollow noreferrer\">\n  github.com/Barebit/trivial-vm\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}