{
    "title": "What is an \"mpi register base\"?",
    "link": "https://reverseengineering.stackexchange.com/questions/21721/what-is-an-mpi-register-base",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  For the past few months, I have been using my spare time reverse engineering a set top box that will not be named. I am trying to run a media server or use it as a debian desktop. It is rocking a Broadcom BCM7410, which has little to no documentation as it was custom made for the company that builds the device. Right now I have found the serial header and have been communicating with it, it has CFE installed on it, but I can not abort the startup due to the integrated watchdog. Recently, via a datasheet for a similar chip in the same family,I was able to follow the traces on the bottom of the board, and find a very well hidden EJTAG solder points in a 14 pin formation (mentioned in the Linux MIPS wiki:\n  <a href=\"https://www.linux-mips.org/wiki/JTAG\" rel=\"noreferrer\">\n   https://www.linux-mips.org/wiki/JTAG\n  </a>\n  ). I found a\n  <a href=\"https://github.com/zoobab/zjtag\" rel=\"noreferrer\">\n   piece of software\n  </a>\n  that is compatible with a JTAG programmer I picked up designed to de-brick routers. It does seem to support the BCM7401, again which is in the same family, but the software will reject any chip that is not defined in the software, I was looking to add my device, but it requires something known as a \"mpi register base\". I could only think of it as meaning the Message Passing Interface\n  <strong>\n   base register\n  </strong>\n  , but I can't find any information on it. My question is, what does it mean and where/how can I find it? Thanks!\n </p>\n <p>\n  Link to required information in code:\n  <a href=\"https://github.com/zoobab/zjtag/blob/master/zjtag.c#L285\" rel=\"noreferrer\">\n   https://github.com/zoobab/zjtag/blob/master/zjtag.c#L285\n  </a>\n </p>\n <p>\n  Link to device list:\n  <a href=\"https://github.com/zoobab/zjtag/blob/master/zjtag.c#L304\" rel=\"noreferrer\">\n   https://github.com/zoobab/zjtag/blob/master/zjtag.c#L304\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "5",
    "answers": 1,
    "views": "247",
    "tags": [
        "serial-communication",
        "mips",
        "jtag"
    ],
    "user": "Rulon Rock",
    "time": "Jul 20, 2019 at 15:44",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I would suggest just duplicating the BCM7401 definition, quite possibly it will just work. If not, try the other values in the table.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Igor Skochinsky",
            "time": "Jul 20, 2019 at 16:41",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Rulon Rock",
                    "text": "<span class=\"comment-copy\">I will give that a shot once the programmer comes in, I lost my last one :/ . Other devices have values of zero but what worries me is there is a family of chips that has different values for each product. I truly don't know what it does, and frankly, I have been a little lazy and haven't checked out the 3000+ lines of code to see what is does.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">It seems value of 0 triggers auto detection so you could try that as well</span>",
                    "time": null
                },
                {
                    "user": "Rulon Rock",
                    "text": "<span class=\"comment-copy\">Good to know, once I get that programmer I will try that first. I'll accept the answer once I confirm it working.</span>",
                    "time": null
                }
            ]
        }
    ]
}