{
    "title": "Recreated LZMA differs from the original after 332 bytes",
    "link": "https://reverseengineering.stackexchange.com/questions/21728/recreated-lzma-differs-from-the-original-after-332-bytes",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Recently I decompressed an LZMA file from a VxWorks filesystem which was recognized and decompressed by the LZMA SDK with parameters\n  <code>\n   lc = lp = 0, pb = 2\n  </code>\n  and dictionary size 8MB. When I recompressed it (without modification, using the same tools and parameters) the first 332 bytes of the output were identical to that of the the original compressed data, but starting from the 333rd byte I didn't find any nontrivial match.\n </p>\n <p>\n  I could use any information regarding what the first 332 bytes could represent, why they are identical in both files while the rest are not, what parameters are most likely to be the culprit in this case or why my LZMA SDK would recreate a changed file when I used the same parameters for compression and decompression. What I want is to recreate the original LZMA exactly as it is, because I'm concerned that the firmware I got the original LZMA from might not recognize the recreated LZMA when I flash it back.\n </p>\n <p>\n  Some information that may help:\n </p>\n <ul>\n  <li>\n   I was able to decompress the new output to get the same file decompressed from the original\n  </li>\n  <li>\n   The recreated LZMA is one byte smaller than the original\n  </li>\n  <li>\n   The decompressed file (call it\n   <code>\n    decomp\n   </code>\n   ) contains some wide characters and vim recognizes its file format as\n   <code>\n    dos\n   </code>\n   . I compiled the LZMA tools for linux.\n   <code>\n    file decomp\n   </code>\n   outputs:\n   <code>\n    decomp: C source, ISO-8859 text, with CRLF line terminators\n   </code>\n  </li>\n </ul>\n <p>\n  Let me know of any other relevant info that I should include.\n </p>\n <p>\n  Thanks.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "148",
    "tags": [
        "decompress"
    ],
    "user": "Awais Chishti",
    "time": "Jul 21, 2019 at 10:47",
    "comments": [],
    "answers_data": []
}