{
    "title": "How to find arrays of objects (entities, enemies) in a game I'm reversing with Cheat Engine?",
    "link": "https://reverseengineering.stackexchange.com/questions/2176/how-to-find-arrays-of-objects-entities-enemies-in-a-game-im-reversing-with-c",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am reversing a game using Cheat Engine and OllyDBG, through this memory addresses within an FPS game  are read and monitored, these addresses will contain the coordinates(xyz) of enemies.\n </p>\n <p>\n  My Objective is to find an address or a pattern that will allow me to loop through up to 32 enemies in order to read all their coordinates, in order to do this I have been attempting to find a pattern between each of their addresses with no luck. I have been able to collect 3 different enemy addresses, this information is useful but searching through 32 addresses is a task which requires more effort than I believe is necessary.\n </p>\n <p>\n  As stated I have access to the first 3 enemy addresses and if from that information it is possible to trace back to the base either through Cheat Engine or other reverse engineering software the process would be appreciated.\n </p>\n <p>\n  Ultimately my question is, is there a way to detect a pointer array in memory from one of its addresses, for example if if I have 3 enemy coordinates can I somehow trace the memory location back to an address that accesses all 32 enemy addresses whether it is by using cheat engine or another reversing tool.\n </p>\n</div>\n</body></html>",
    "votes": "12",
    "answers": 2,
    "views": "17k",
    "tags": [
        "disassembly",
        "ollydbg",
        "debugging",
        "debuggers",
        "struct"
    ],
    "user": "Daniel Filipe",
    "time": "Oct 30, 2016 at 6:12",
    "comments": [
        {
            "user": "NirIzr",
            "text": "<html><body><span class=\"comment-copy\">\n Can you specify what you already know about the structures? Simple coordinate arrays? Complex datatypes? Do you know the language used?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <em>\n   (OP didn't specify if he knows how structures are laid out. Looks like he assumes they aren't complex. I'll answer a more general question to avoid locality issues by assuming the structures are somewhat complex)\n  </em>\n </p>\n <p>\n  Few ways to find the other structures come to mind:\n </p>\n <h2>\n  Scanning memory for signatures\n </h2>\n <p>\n  Once you have a few examples of the structures, maybe the easiest way to find the other structure instances is to find matching constants in all three structures. Some values may be constant, represent properties that apply to all the enemy entities in a more high-level class inherited.\n </p>\n <h3>\n  Pros:\n </h3>\n <ul>\n  <li>\n   This is easy to implement, can be done this Cheat Engine.\n  </li>\n  <li>\n   in the general case it should survive program restarts, you won't need to find the three structures every time you run the game.\n  </li>\n </ul>\n <h3>\n  Cons:\n </h3>\n <ul>\n  <li>\n   not so robust. stuff might change between versions, data you think is constant may actually change in some cases you haven't looked at.\n  </li>\n </ul>\n <h2>\n  Pointer searching\n </h2>\n <p>\n  There might be a pointer to each entity somewhere. you can just as easily search the memory for the addresses of the structures you found, and detect the array/structure that holds all of the entities. you could also walk trough arrays you find in the structures themselves, you might be looking at a linked list.\n </p>\n <h3>\n  Pros:\n </h3>\n <ul>\n  <li>\n   easy to implement.\n  </li>\n  <li>\n   will be a bit more robust than the previous method.\n  </li>\n </ul>\n <h3>\n  Cons:\n </h3>\n <ul>\n  <li>\n   you will still need to somehow find the first entities.\n  </li>\n </ul>\n <h2>\n  Finding the Constructor/constructor-like function\n </h2>\n <p>\n  Either Object Oriented language like C++ or ObjC, or a procedural language like C, there must be a function that initiates the structure. usually it's easy to find - the first function called after the object is allocated, pretty distinctive assembly - mostly initialization code.\n </p>\n <p>\n  If we're talking about OO code, finding the virtual function table or a similar construct will let you easily find the construction functions, walk trough inheritance and find at least a portion of the manipulating functions.\n </p>\n <p>\n  After you get the Constructors you can easily get all the allocations, and see where pointers are being kept.\n </p>\n <h3>\n  Pros:\n </h3>\n <ul>\n  <li>\n   quite robust\n  </li>\n  <li>\n   better understanding of how entities are saved in memory.\n  </li>\n </ul>\n <h3>\n  Cons:\n </h3>\n <ul>\n  <li>\n   Static RE. usually harder to do (Get a good dis-assembler)\n  </li>\n </ul>\n <h2>\n  Reversing the structure\n </h2>\n <p>\n  This one requires a bit more reversing work, but will let you find the best ways to search for the entities. Using Cheat Engine and IDA, manually map the structure, the elements/members, the functions that manipulate the structure.\n </p>\n <p>\n  If there're any pointers involved, follow them and reverse other structures you encounter.\n </p>\n <h3>\n  Pros:\n </h3>\n <ul>\n  <li>\n   Robust\n  </li>\n  <li>\n   The right way to do what you want. Really understand what's going on. facilitate future abilities/features.\n  </li>\n </ul>\n <h3>\n  Cons:\n </h3>\n <ul>\n  <li>\n   more work, and harder to do. A lot of RE.\n  </li>\n </ul>\n <h2>\n  Note\n </h2>\n <p>\n  for at-least some of the methods I mentioned finding the pointers to all entities while analyzing the program might only be the first step. You can search for references to the list itself and get a better way to automatically find the entities on each program restart. This eliminates some of the Cons.\n </p>\n</div>\n</body></html>",
            "votes": "19",
            "user": "NirIzr",
            "time": "Sep 12, 2016 at 23:02",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  First Find the address you are looking for. Then cycle this:\n </p>\n <ol>\n  <li>\n   Find the base (the beginning of the record).\n  </li>\n  <li>\n   Dissect the memory around this to recognize array or linked list.\n  </li>\n  <li>\n   Search the memory for pointer to that base.\n  </li>\n </ol>\n <p>\n  <strong>\n   Example\n  </strong>\n  :\n </p>\n <p>\n  Scan for parameter finding the address\n  <code>\n   30000032\n  </code>\n  .\n </p>\n <p>\n  Find out the base of this record is\n  <code>\n   30000000\n  </code>\n  .\n </p>\n <p>\n  Checking memory - nothing fancy around.\n </p>\n <p>\n  Finding pointer to the base at\n  <code>\n   20000004\n  </code>\n  .\n </p>\n <p>\n  Find out the base of the record is\n  <code>\n   20000000\n  </code>\n  .\n </p>\n <p>\n  Checking memory - still nothing...\n </p>\n <p>\n  Finding pointer to the base at\n  <code>\n   10000008\n  </code>\n  .\n </p>\n <p>\n  Finding out the base is\n  <code>\n   10000000\n  </code>\n  .\n </p>\n <p>\n  Checking memory - all pointers to objects I am looking for are 12 bytes away from each other. (Obviously this is some sort of collection.)\n </p>\n <p>\n  Last memory scan for pointer to make sure I am not wrong at\n  <code>\n   0000040\n  </code>\n  .\n </p>\n <p>\n  Find pointer to that collection, and right after it: count of the objects in the collection.\n </p>\n <p>\n  Restart the game/computer few times to find a consistent pointer to that address.\n </p>\n <p>\n  Reward myself with a beer for the good work.\n </p>\n <p>\n  <strong>\n   How to find the base\n  </strong>\n  : I like to use the \"pointer scan\", and check the last offset. The smallest from the most commonly found, is usually the correct one.\n </p>\n <p>\n  Sometimes, I am trying to find a record, at the beginning of allocated memory, and in this case I am sure something is base.\n </p>\n <p>\n  Another trick is to find two one after another in memory, determine their \"max size\", and this means the base must be no further than this number back in the memory.\n </p>\n <p>\n  <strong>\n   How to recognize collections\n  </strong>\n  : Most of them are EXTREMELY organized, with specific offset, or have pointers to same type of objects.\n </p>\n <p>\n  Like if you have:\n </p>\n <pre><code>Pointer to Player 1 data,\n4 Bytes\n4 Bytes\nPointer to Player 2 data,\n4 Bytes\n4 Bytes\nPointer to Player 3 data\n</code></pre>\n <p>\n  It should ring a bell.\n </p>\n <p>\n  Keep in mind that such alignment may randomly happen in the source, so try to search for: Player 3 data, Player 3 data +/- 4, Player 3 data +/- 8.\n </p>\n <p>\n  Anyway, if you find something like this, you are most likely really close.\n </p>\n <p>\n  This works for me, hope it works for you guys too.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "dsasmblr",
            "time": "Sep 10, 2018 at 13:30",
            "is_accepted": false,
            "comments": []
        }
    ]
}