{
    "title": "How to debug using OpenWatcom's debugger?",
    "link": "https://reverseengineering.stackexchange.com/questions/2185/how-to-debug-using-openwatcoms-debugger",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <a href=\"http://www.openwatcom.org\" rel=\"nofollow\">\n   OpenWatcom's\n  </a>\n  debugger just executes the binary instead of single-stepping through it, when I attempt the following steps:\n </p>\n <ol>\n  <li>\n   <code>\n    File->Open\n   </code>\n   , select executable\n  </li>\n  <li>\n   <code>\n    Run->Trace Into\n   </code>\n  </li>\n </ol>\n <p>\n  This attempt\n  <a href=\"http://chat.stackexchange.com/transcript/message/9732918#9732918\">\n   is on Windows XP\n  </a>\n  .\n </p>\n <p>\n  How do I single step through a program using OpenWatcom's debugger?\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "windows",
        "debuggers"
    ],
    "user": "heinrich5991",
    "time": "Jun 12, 2013 at 7:18",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Okay, Windows XP, OpenWatcom. I am using OpenWatcom 1.9. When trying to reproduce your problem, I used\n  <code>\n   calc.exe\n  </code>\n  from Windows XP for which there are no Watcom debug symbols available (only the PDB format from Microsoft, which Watcom doesn't support\n  <em>\n   at all\n  </em>\n  ).\n </p>\n <p>\n  When dismissing the open dialog from your first step, we get the assembly view like this. I am returning from that call (\n  <code>\n   Run -> Until Return\n  </code>\n  ) a few times and realize that the call stack shows I am still in the loader phase.\n </p>\n <p>\n  <img alt=\"enter image description here\" src=\"https://i.sstatic.net/LjloV.png\"/>\n </p>\n <p>\n  The most logical thing to do now would be to break at either\n  <code>\n   kernel32!BaseThreadInitThunk\n  </code>\n  which is basically\n  <em>\n   the\n  </em>\n  entry point for any Win32 thread, including the very first in a process, but isn't exported (and, remember, we have no symbols). For a writeup on the startup process, see\n  <a href=\"http://abdelrahmanogail.wordpress.com/2010/11/05/thread-basics/\" rel=\"nofollow noreferrer\">\n   here\n  </a>\n  or the \"Windows Internals\" book. The next possible candidate would be\n  <code>\n   ntdll!RtlUserThreadStart\n  </code>\n  which also isn't exported and therefore unavailable.\n </p>\n <p>\n  So, assuming you really have no modern debugger (WinDbg, cdb, let alone IDA, Hopper and friends) available, and don't want to use\n  <a href=\"http://live.sysinternals.com/livekd.exe\" rel=\"nofollow noreferrer\">\n   <code>\n    livekd.exe\n   </code>\n   from SysInternals\n  </a>\n  (which however requires a recent\n  <code>\n   dbghelp.dll\n  </code>\n  ) the only method that seems to be reasonable is to load your target executable into an editor (\n  <a href=\"http://www.ntcore.com/exsuite.php\" rel=\"nofollow noreferrer\">\n   CFF Explorer comes to mind\n  </a>\n  ) and put an\n  <code>\n   int3\n  </code>\n  (\n  <code>\n   cc\n  </code>\n  ) instruction at the entry point or simply move the entry point elsewhere. In my case I chose to overwrite the\n  <code>\n   push 70h\n  </code>\n  (\n  <code>\n   6A 70\n  </code>\n  ) with\n  <code>\n   int3; nop\n  </code>\n  (\n  <code>\n   CC 90\n  </code>\n  ). That enabled me to break at the beginning of the program (not considering TLS callbacks or anything like that, though).\n </p>\n <p>\n  Another less intrusive method is to use the above mentioned CFF Explorer or really any suitable tool to give you the VA of the entry point. Since we're talking about Windows XP we need not worry about ASLR or anything like that.\n </p>\n <p>\n  <img alt=\"enter image description here\" src=\"https://i.sstatic.net/Z8YPK.png\"/>\n </p>\n <p>\n  The entry point in our case is at RVA\n  <code>\n   0x12475\n  </code>\n  , which the Address Converter translates to:\n </p>\n <p>\n  <img alt=\"enter image description here\" src=\"https://i.sstatic.net/Henkx.png\"/>\n </p>\n <p>\n  VA\n  <code>\n   0x1012475\n  </code>\n  . Sweet. Now we can try to let OpenWatcom stop at this address. Setting a bpx at this address (\n  <code>\n   Break -> View All -> Rightclick -> New\n  </code>\n  , enter address) and then pressing\n  <kbd>\n   F5\n  </kbd>\n  (for \"Go\") to skip the startup phase for the process gets us straight to the entry point.\n </p>\n <p>\n  <img alt=\"enter image description here\" src=\"https://i.sstatic.net/ZFfzH.png\"/>\n </p>\n <p>\n  From there we can use\n  <kbd>\n   F8\n  </kbd>\n  for further single-stepping. And I'm sure similar to the experience we shared during the startup phase, any little thing that changed since the debugger was last adjusted to a more recent OS will trip you (or rather the OW debugger) up. Short of switching debuggers, you might want to make heavy use of\n  <code>\n   Break -> On Debug Message\n  </code>\n  , but even that seemed of little use when I tried it.\n </p>\n <h1>\n  Conclusion\n </h1>\n <p>\n  It's possible, but heck it's tedious and it may fall short of your needs at any point.\n </p>\n <p>\n  Quite frankly, some debuggers are better left alone when no source is available (assembly debugging). Admittedly I am not as familiar with the Watcom debugger as with GDB or WinDbg, but I've used it in the past and found it pure horror\n  <em>\n   with\n  </em>\n  symbols. That impression will likely only get worse\n  <em>\n   without\n  </em>\n  symbols. I find myself confirmed in that sense from looking into the issue you were experiencing.\n </p>\n <h2>\n  20th century debugging\n </h2>\n <p>\n  OpenWatcom, while still being \"developed\" is old. Its roots are in the old Sybase product Watcom, which had a broad following. Problem is, that this product existed even before Windows 2000. So I don't think you can expect a lot from it, as most people these days are using compilers and debuggers with better support. Be it WinDbg or be it GDB if you happen to use MinGW or something like that.\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "0xC0000022L",
            "time": "Jun 4, 2013 at 1:58",
            "is_accepted": true,
            "comments": []
        }
    ]
}