{
    "title": "PowerPC TOC and SDA",
    "link": "https://reverseengineering.stackexchange.com/questions/21944/powerpc-toc-and-sda",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to understand the concepts of the\n  <code>\n   TOC\n  </code>\n  and\n  <code>\n   SDA\n  </code>\n  in\n  <code>\n   PowerPC\n  </code>\n  .\n </p>\n <p>\n  From what I understand, they are basically pointers to tables of global values, when\n  <code>\n   TOC\n  </code>\n  is stored in\n  <code>\n   r2\n  </code>\n  , and\n  <code>\n   SDA\n  </code>\n  in\n  <code>\n   r13\n  </code>\n  .\n </p>\n <p>\n  But what are the difference between them? I compiled a simple ppc project, and I see that only\n  <code>\n   r2\n  </code>\n  is used, but\n  <code>\n   r13\n  </code>\n  isn't. Is it something that supposed to be said explicitly to use\n  <code>\n   SDA\n  </code>\n  ?\n </p>\n <p>\n  Moreover, I see that all my global strings aren't actually accessed through\n  <code>\n   r2\n  </code>\n  at all. It looks like the only use of\n  <code>\n   r2\n  </code>\n  in my code is just to access stack variables. Does it make sense?\n </p>\n <p>\n  In addition, Where are they supposed to be initialized? I didn't find in my code any place that\n  <code>\n   r2\n  </code>\n  is initialized, only used.\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "disassembly",
        "register",
        "powerpc"
    ],
    "user": "macro_controller",
    "time": "Aug 21, 2019 at 9:28",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  First, a bit of background on why these registers are needed. PPC is a RISC-like ISA, in that all instructions are of the same size (32 bits) and there is limited space for immediate values (usually 16 bits at most) that you would use for things like addresses. So how do you address more that 16 bits?\n </p>\n <p>\n  One option is to build addresses by 16-bit slices, e.g. something like:\n </p>\n <pre><code> lis     r4,msg@ha     # load top 16 bits of &msg\n addi    r4,r4,msg@l   # add bottom 16 bits\n</code></pre>\n <p>\n  Another is to use PIC (position-independent code) to address things relative to current address:\n </p>\n <pre><code>  bcl 20, 4*cr7+so, loc_picbase #branch and link to next location \nloc_picbase:\n  mflr      r31 # load link register (lr) into r31. It will be equal to loc_picbase\n  addis     r2, r31, (_NXArgc - loc_picbase)@ha\n  stw       r28, (_NXArgc - loc_picbase)@l(r2)\n  <and so on>\n</code></pre>\n <p>\n  However, using either of these requires multiple instructions per data access and is not always feasible (e.g. first variant would require patching instructions if binary needs to be relocated which can't be done when running read-only code). So on some platforms they came up with the concept of TOC (Table of Contents), which is a fixed register having the same value for the whole module and from which all data is addressed using an offset. The register\n  <code>\n   r2\n  </code>\n  was reserved for this purpose and AFAIK is supposed to be set by the OS loader. Since offsets in PPC instructions are limited to 16 bits (-32768 to +32767), you can address about 64K of data around\n  <code>\n   r2\n  </code>\n  (which is usually placed in the middle of the data area for maximum coverage). If the module needs more data, offsets bigger than 16 bits are constructed in several steps, or multiple TOCs may be used (in this case different functions may use different TOCs).\n </p>\n <p>\n  In PPC64 ABI, the latter is achieved by so-called\n  <em>\n   function descriptors\n  </em>\n  which is pairs of pointers where one is the address of the function's code and the other is the TOC value expected by the function. Any time a function is called, the TOC is loaded from the descriptor before jumping to the function's code (unless the compiler knows that the target function uses the same TOC value, in which case the TOC reload can be skipped).\n </p>\n <p>\n  In embedded environment, there is usually no OS but a monolithic firmware, and this concept is applied to the whole firmware by using register\n  <code>\n   r13\n  </code>\n  for SDA (Small Data Area) and, if necessary,\n  <code>\n   r2\n  </code>\n  for an additional data region (SDA2 -Small Data Area 2). A so-called Zero data area (ZDA) may be also used for data placed near the address 0 (using special addressing modes from register\n  <code>\n   r0\n  </code>\n  ).\n </p>\n <p>\n  Some compilers (notably Green Hills) support additional data pointers (\n  <code>\n   r14\n  </code>\n  ,\n  <code>\n   r15\n  </code>\n  etc.).\n </p>\n <p>\n  In embedded environment, the data registers (\n  <code>\n   r2\n  </code>\n  ,\n  <code>\n   r13\n  </code>\n  etc.) should be initialized in the startup code, shortly after reset, as the rest of the firmware usually expects them to have proper values.\n </p>\n <p>\n  P.S. usage of\n  <code>\n   r2\n  </code>\n  depends on the environment. It's quite possible that the target environment you're compiling for does not use TOC so you don't see it used (stack pointer on PowerPC is\n  <code>\n   r1\n  </code>\n  , not\n  <code>\n   r2\n  </code>\n  ).\n </p>\n <p>\n  Some references:\n </p>\n <ul>\n  <li>\n   <a href=\"https://www.ibm.com/developerworks/library/l-ppc/index.html\" rel=\"noreferrer\">\n    Introduction to assembly on the PowerPC (IBM)\n   </a>\n  </li>\n  <li>\n   <a href=\"http://devpit.org/wiki/Debugging_PowerPC_ELF_Binaries\" rel=\"noreferrer\">\n    Debugging PowerPC ELF Binaries (Devpit)\n   </a>\n  </li>\n  <li>\n   <a href=\"http://refspecs.linux-foundation.org/elf/elfspec_ppc.pdf\" rel=\"noreferrer\">\n    System V Application Binary Interface PowerPC™ Processor Supplement\n   </a>\n  </li>\n  <li>\n   <a href=\"https://www.nxp.com/assets/documents/data/en/application-notes/PPCEABI.pdf\" rel=\"noreferrer\">\n    PowerPC Embedded Application Binary Interface\n   </a>\n  </li>\n  <li>\n   <a href=\"https://refspecs.linuxfoundation.org/ELF/ppc64/PPC-elf64abi.pdf\" rel=\"noreferrer\">\n    64-bit PowerPC ELF Application Binary Interface Supplement\n   </a>\n  </li>\n </ul>\n</div>\n</body></html>",
            "votes": "7",
            "user": "Igor Skochinsky",
            "time": "Aug 22, 2019 at 19:03",
            "is_accepted": true,
            "comments": []
        }
    ]
}