{
    "title": "How to hide a process from all the methods of getting the list of processes?",
    "link": "https://reverseengineering.stackexchange.com/questions/22062/how-to-hide-a-process-from-all-the-methods-of-getting-the-list-of-processes",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  So it seems that there are a lot of ways of getting the process list, although I'm not sure whether in the low level do they acquire them from same place or not\n </p>\n <p>\n  so these are the ways i know :\n </p>\n <ol>\n  <li>\n   <p>\n    QuerySystemInformation (Zw or Nt)\n   </p>\n  </li>\n  <li>\n   <p>\n    some place in the TEB which is pointed by FS register\n   </p>\n  </li>\n  <li>\n   <p>\n    CreateToolhelp32Snapshot\n   </p>\n  </li>\n </ol>\n <p>\n  and i guess there are   more ways too\n </p>\n <p>\n  so my questions are :\n </p>\n <ol>\n  <li>\n   <p>\n    do these methods use the same structure/linked list in the virtual memory of the process or they might use different methods?\n   </p>\n  </li>\n  <li>\n   <p>\n    If i hook the ZwQuerySystemInformation, will this stop the process from getting the list of processes? if not, then how can i be sure that a process cannot get the list? which functions should i hook or modify?\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "437",
    "tags": [
        "windows",
        "x86",
        "malware",
        "x64dbg",
        "x86-64"
    ],
    "user": "OneAndOnly",
    "time": "Sep 6, 2019 at 14:33",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <ol>\n  <li>\n   <p>\n    Pretty much, they will all eventually read the PEPROCESS object directory.\n   </p>\n  </li>\n  <li>\n   <p>\n    Maybe not, depends on what you're trying to hide from. If it's just some basic usermode process iteration then you're probably fine. There's quite a few ways to iterate the process object directory though, such as ZwGetNextProcess.\n   </p>\n  </li>\n </ol>\n <p>\n  Your best bet would probably be ObRegisterCallbacks if you want to block access to your process, but it still won't be enough depending on privilege level and how they're iterated.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Pickle Rick",
            "time": "Sep 19, 2019 at 8:12",
            "is_accepted": true,
            "comments": []
        }
    ]
}