{
    "title": "Alternative APIs to hook instead of messagebox for message pop ups?",
    "link": "https://reverseengineering.stackexchange.com/questions/22347/alternative-apis-to-hook-instead-of-messagebox-for-message-pop-ups",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  So i am reversing an app that pops up a message at some point, but its not doing this using messagebox\n </p>\n <p>\n  i also tried to pause and then run to user code but didn't work, so what are some of the other ways to trace back to where this \"message box\" was generated?  sorry if this is a newbee question\n </p>\n <p>\n  i watched a lot of youtube videos but regarding this issue the only solution i found was pausing and going to user code but that doesn't work, for some reason sometimes the pause just doesn't even work (if anyone knows why please let me know) and sometimes when it does, and i go to user code its just gibberish code, nothing that caused the box ( i think maybe this is because multi threading, since when i check the threads there are like 12 threads running!, tried going to main thread and some of the non suspended ones and repeating this didnt work )\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "134",
    "tags": [
        "windows",
        "x86",
        "patching",
        "crackme"
    ],
    "user": "Mery Ted",
    "time": "Oct 19, 2019 at 15:14",
    "comments": [
        {
            "user": "blabb",
            "text": "<html><body><span class=\"comment-copy\">\n The Message Box may be a a Custom Window /Dialog  use a spy utility /debuggers list of windows to ascertain  the window type\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Hi, this is a rather \"coarse\" description of the problem. You should give us some more here. There are no static or delayed imports of (user32) functions in question? There are no static or delayed imports of functions that can be used to dynamically load DLLs and fetch function pointers (e.g.\n <code>\n  LoadLibrary\n </code>\n )? Is the executable packed or not? Does it have at least one import from user32 (if so, this would make it easy to use the TEB to find an exported function by hash)?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "peter ferrie",
            "text": "<html><body><span class=\"comment-copy\">\n MessageBox also has multiple variants - MessageBox, MessageBoxEx, MessageBoxIndirect, MessageBoxTimeout, all with 'A' and 'W' types.  There are also DialogBox options, as blabb notes.  It could be any of these, or even none.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Mery Ted",
            "text": "<html><body><span class=\"comment-copy\">\n @0xC0000022L yes it has many imports from user32, and its not packed, no dynamic loading either, it just pops up a message just like message box but its not that, i hooked all the functions starting with messagebox but still no luck\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Mery Ted",
            "text": "<html><body><span class=\"comment-copy\">\n @peterferrie i set bp on all the intermodule calls that started with messagebox or dialogbox and still no luck! no hit!!\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}