{
    "title": "CSR DFU File Format",
    "link": "https://reverseengineering.stackexchange.com/questions/22435/csr-dfu-file-format",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to reverse engineer the firmware for my JBL Flip 3 speaker. I have obtained a DFU file for the device online but am unsure as to how much of the firmware is included. My first question would be, normally do DFU files include the full device firmware or just a portion of it and the device knows how to update the specific portion?\n </p>\n <p>\n  Assuming for now that the file contains the full firmware, does anyone know anything about firmware images for CSR Bluetooth SOC's? I know that the speaker is using a CSR SOC because the DFU starts with\n  <code>\n   CSR-dfu2\n  </code>\n  .\n </p>\n <p>\n  Opening the DFU file in Audacity and playing it, we can see that it contains all the sound effects the speaker plays as well as some sections of static that I assume are code:\n  <a href=\"https://i.sstatic.net/3VIpZ.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"firmware in Audacity\" src=\"https://i.sstatic.net/3VIpZ.png\"/>\n  </a>\n </p>\n <p>\n  I am fairly confident that these sections are code/data because they contains strings like\n  <code>\n   tts/0.raw\n  </code>\n  and\n  <code>\n   tts/1.raw\n  </code>\n  . However, there is a null byte in between each character of the strings which suggests that they are UTF-16 strings. Does anyone know of an embedded filesystem that uses UTF-16 filenames?\n </p>\n <p>\n  Unfortunately\n  <code>\n   binwalk\n  </code>\n  does not provide any useful information. However, I found what I believe to be the full JBL Flip\n  <strong>\n   4\n  </strong>\n  firmware image image and\n  <code>\n   binwalk\n  </code>\n  reveals several sections:\n </p>\n <pre><code>0             0x0             CSR (XAP2) DFU firmware update header\n1380          0x564           CSR Bluecore firmware segment\n1931310       0x1D782E        YAFFS filesystem, big endian\n</code></pre>\n <p>\n  Does anyone have any experience with CSR or JBL firmware and could provide guidance or a suggestion of how to extract code from the DFU? Thank you.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 3,
    "views": "2k",
    "tags": [
        "firmware",
        "binwalk",
        "bluetooth"
    ],
    "user": "genghiskhan",
    "time": "Oct 31, 2019 at 19:29",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This is a BlueCore02 Device Firmware Upgrade File. I could not find a specification, but the\n  <a href=\"http://read.pudn.com/downloads330/sourcecode/embedded/1450690/AN093.pdf\" rel=\"noreferrer\">\n   BlueCore01 specification\n  </a>\n  contains more or less the same fields (with a few differences)\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "Johannes Mittendorfer",
            "time": "Dec 31, 2019 at 8:42",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Johannes Mittendorfer",
                    "text": "<span class=\"comment-copy\">If anyone can give a hint where to find the second version of the specification: I would really appreciate it.</span>",
                    "time": null
                },
                {
                    "user": "genghiskhan",
                    "text": "<span class=\"comment-copy\">What a life saver! I'll let you know if I find the BlueCore02 specs.</span>",
                    "time": null
                },
                {
                    "user": "genghiskhan",
                    "text": "<span class=\"comment-copy\">I've found the following URL on web archive: <a href=\"https://web.archive.org/web/20041022135603/http://www.csrsupport.com/index.php?path=91\" rel=\"nofollow noreferrer\">web.archive.org/web/20041022135603/http://www.csrsupport.com/…</a> that looks like it has more recent BlueCore DFU specs however it requires a CSR login. I'm not sure if it'd even work if someone had a valid email/password but it'd be worth a shot.</span>",
                    "time": null
                },
                {
                    "user": "Johannes Mittendorfer",
                    "text": "<span class=\"comment-copy\">I tried but wasn't successful. Looks like it is not available any more...</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've found this project\n  <a href=\"https://github.com/lorf/csr-spi-ftdi\" rel=\"nofollow noreferrer\">\n   https://github.com/lorf/csr-spi-ftdi\n  </a>\n  , along with info:\n </p>\n <blockquote>\n  <p>\n   BlueCore 2 chips (such as BC212015) are not supported in BlueSuite 2.4 and above\n  </p>\n </blockquote>\n <p>\n  what means they are intentionally try to enforce developers to use more high level tools .\nAbove github tool should help you identify exact chip without disassembling physical device. I've checked the one above and found here:\n  <a href=\"https://www.chipfind.net/datasheet/csr/bc212015.htm\" rel=\"nofollow noreferrer\">\n   https://www.chipfind.net/datasheet/csr/bc212015.htm\n  </a>\n  The datasheet gives some meaningful info - it describes Bluecore2 virtual machine, and also mentions CSR’s BlueLab, Casira and MicroSira development kits which may be good direction for documentation search:\n </p>\n <blockquote>\n  <p>\n   This version of the stack firmware requires no host processor. All\nsoftware layers, including application software, run on the internal\nRISC processor in a protected user software execution environment\nknown as a Virtual Machine (VM).\n  </p>\n </blockquote>\n <blockquote>\n  <p>\n   The user may write custom application\ncode to run on the BlueCore VM using BlueLabTM software development\nkit (SDK) supplied with the BlueLab and Casira development kits,\navailable separately from CSR. This code will then execute alongside\nthe main BlueCore firmware. The user is able to make calls to the\nBlueCore firmware for various operations.\n  </p>\n </blockquote>\n <blockquote>\n  <p>\n   The execution environment is\nstructured so the user application does not adversely affect the main\nsoftware routines, thus ensuring that the Bluetooth stack software\ncomponent does not need re-qualification when the application is\nchanged. Using the VM and the BlueLab SDK the user is able to develop\napplications such as a cordless headset or other profiles without the\nrequirement of a host controller. BlueLab is supplied with example\ncode including a full implementation of the headset profile.\n  </p>\n </blockquote>\n <p>\n  It looks like it will be hard do reverse code without understanding the architecture first:\n </p>\n <blockquote>\n  <p>\n   Virtual Machine (VM). The firmware provides the VM environment in which to run >application-specific\ncode. Although the VM is mainly used with BlueLab and “RFCOMM builds” >>(alternative firmware builds\nproviding L2CAP, SDP and RFCOMM), the VM can be used with this build to perform >simple tasks such\nas flashing LED’s via the chip’s PIO port.\n  </p>\n </blockquote>\n <p>\n  Also it mentions VM Application software is stored on external flash so depending what you are looking for that may be worth checking.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "nusch",
            "time": "Dec 10, 2020 at 23:37",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've written an\n  <em>\n   010 Editor\n  </em>\n  parser for the CSR DFU file format, available\n  <a href=\"https://github.com/ramikg/csr-dfu-parser\" rel=\"nofollow noreferrer\">\n   here\n  </a>\n  . Hopefully it will be of help.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "ramikg",
            "time": "Aug 11, 2023 at 10:16",
            "is_accepted": false,
            "comments": []
        }
    ]
}