{
    "title": "Why doesn't alloca_probe follow x64 calling convention?",
    "link": "https://reverseengineering.stackexchange.com/questions/22476/why-doesnt-alloca-probe-follow-x64-calling-convention",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I was practising reverse engineering on some Windows x64 applications when I came across this function:\n </p>\n <pre><code>call alloca_probe\n</code></pre>\n <p>\n  This\n  <em>\n   alloca_probe\n  </em>\n  function has some strange implementation:\n </p>\n <ol>\n  <li>\n   EAX is used as a function argument (for the allocation size)\n  </li>\n  <li>\n   The prolog saves current state of R10 and R11 even though they are considered volatile registers by convention.\n  </li>\n </ol>\n <p>\n  As I can recall, the x64 calling convention by Microsoft indicates:\n </p>\n <ul>\n  <li>\n   RCX, RDX, R8, and R9 should be used as the first 4 function arguments.\n  </li>\n  <li>\n   RAX, RCX, RDX, R8, R9, R10, R11 are all volatile registers.\n  </li>\n </ul>\n <p>\n  <em>\n   alloca_probe\n  </em>\n  function clearly doesn't follow this convention...\n </p>\n <p>\n  <strong>\n   My question is:\n  </strong>\n </p>\n <p>\n  Why doesn't this function follow the convention, and how does the compiler know how to use these type of functions (e.g using EAX as first argument)?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "455",
    "tags": [
        "ida",
        "assembly",
        "calling-conventions"
    ],
    "user": "YAYAdest",
    "time": "Nov 7, 2019 at 3:51",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This is not a standard function but a compiler helper, used by the compiler to perform some necessary housekeeping (allocate extra stack space) so it doesn’t have to follow the ABI for “normal” functions.\n </p>\n <p>\n  Because it is called in the prolog of the parent function while the user code has not started executing yet, special care needs to be taken.\n </p>\n <p>\n  EAX use likely comes from the x86 version which has similar constraints and could not use stack arguments. In theory any register could have been used but\n  <code>\n   mov eax, imm\n  </code>\n  has a short encoding which saves space in the prolog. \nThe normally volatile registers need to be saved because they need to be preserved by the function’s prolog we’re executing and if they get trashed there may be all kinds of wrong results.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Nov 7, 2019 at 7:55",
            "is_accepted": true,
            "comments": [
                {
                    "user": "YAYAdest",
                    "text": "<span class=\"comment-copy\">Thanks! Is this compiler helper actually an intrinsic function? If so, aren't those functions suppose to be inlined?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">Intrinsics are pseudo functions which map to processor instructions. This one is different as it’s inserted by the compiler and not by programmer.</span>",
                    "time": null
                }
            ]
        }
    ]
}