{
    "title": "Best way to protect source code of .exe program running on Python?",
    "link": "https://reverseengineering.stackexchange.com/questions/22648/best-way-to-protect-source-code-of-exe-program-running-on-python",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am developing proprietary software that would be distributed in a form of .exe file. In order to use it, users will have to authenticate with their whitelist credentials (username + password).\n </p>\n <p>\n  The issue I have encountered is that in the industry I am selling on, there are a lot of \"hackers\" who will try to decompile your executable file, get the source code and distribute it for free to other people.\n </p>\n <p>\n  To combat these reverse-engineering attempts, I have tried to both obfuscate my code and use various compilers, but so far to no success.\n </p>\n <p>\n  <strong>\n   What I have tried:\n  </strong>\n </p>\n <ul>\n  <li>\n   Use\n   <code>\n    py2exe\n   </code>\n   compiler: \"hackers\" managed to decompile executable in an hour.\n  </li>\n  <li>\n   Use\n   <code>\n    pyinstaller\n   </code>\n   compiler: same as with\n   <code>\n    py2exe\n   </code>\n   .\n  </li>\n  <li>\n   Use\n   <code>\n    pyminifier\n   </code>\n   to obfuscate the code: \"hackers\" managed to deobfuscate the code.\n  </li>\n  <li>\n   Use\n   <code>\n    Oxyry Python Obfuscator\n   </code>\n   : same as with\n   <code>\n    pyminifier\n   </code>\n   .\n  </li>\n </ul>\n <p>\n  Those who managed to decompile and deobfuscate my program explained that the open-source nature of those 4 tools means that their algorithms are well-known and there are solutions out there made to reverse-engineer programs that use these open-source compilers and obfuscators.\n </p>\n <p>\n  <strong>\n   What I didn't try yet:\n  </strong>\n </p>\n <ul>\n  <li>\n   Using\n   <code>\n    Pyarmor\n   </code>\n   to obfuscate my code. I've heard it is good, but it costs 50$, so I want to be sure that it is the best obfuscation tool out there before purchasing the license.\n  </li>\n  <li>\n   Using\n   <code>\n    Cython\n   </code>\n   library to create a C-wrapper for my program, making it compiled in C instead of Python. Since C binaries are much harder to read, it will make the program significantly harder to decompile. However, I have never programmed in C, and I want to know if there are better ways to compile my source Python code, without the need to learn C.\n  </li>\n  <li>\n   Using\n   <code>\n    VMProtect\n   </code>\n   ,\n   <code>\n    Enigma Protector\n   </code>\n   or\n   <code>\n    Themida/Code Virtualizer\n   </code>\n   . Each tool costs over 150$, so before purchasing them, I want to know if that would be the best way to solve my problem.\n  </li>\n </ul>\n <p>\n  <strong>\n   What I am not going to try:\n  </strong>\n </p>\n <ul>\n  <li>\n   Completely rewrite my whole program in a language other than Python. I am not strong in other languages, plus the program itself consists of over 5,000 lines of code, so I can't just completely rewrite it for the sole purpose of making it harder to decompile.\n  </li>\n  <li>\n   Making program open-source: This is a for-profit software, so I am not going to release the proprietary code, thank you for understanding.\n  </li>\n  <li>\n   Making the program a web-app: Since my program directly interacts with files on the user's PC, I can't make it web-based, it has to be on the user's PC.\n  </li>\n </ul>\n <p>\n  Please also consider that if \"hacker\" will be able to disable the whitelist system without even accessing the source code, he will be able to distribute it to other users with no limitation. Therefore, I am looking for a way that will not only make it extremely hard to decompile the program, but also make it almost impossible to meddle with bytecode/binaries and turn off certain parts of the program's code.\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "12k",
    "tags": [
        "decompilation",
        "c",
        "python",
        "obfuscation",
        "executable"
    ],
    "user": "TimesAndPlaces",
    "time": "Nov 30, 2019 at 22:46",
    "comments": [
        {
            "user": "Akram Mo",
            "text": "<html><body><span class=\"comment-copy\">\n I would like to know what was the decision you took about protecting your python application. Did you manage to do it? Did you use Cython or any VM protected software ?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "TimesAndPlaces",
            "text": "<html><body><span class=\"comment-copy\">\n @AkramMo Yes, it was a combination of 2. At first transfer .py into cython executable, and then pass it through VM obfuscator.  Not sure if it is uncrackable, but more than enough to keep amateurs away.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There are ways to make a Python program hard to reverse engineer. Its' possible but you need to fiddle with the\n  <a href=\"https://github.com/python/cpython\" rel=\"noreferrer\">\n   Python source code\n  </a>\n  (which is written in C) and compile a special build for your purpose.\n </p>\n <p>\n  The way Python works is fully documented and open-source. For instance, consider the pyc file format. Much of the code which deals with reading/writing pyc's can be found in\n  <a href=\"https://github.com/python/cpython/blob/master/Python/marshal.c\" rel=\"noreferrer\">\n   marshal.c\n  </a>\n  If you modify the code and reorder the sequence in which the objects are read/written you can easily throw off decompilers. To further strengthen the protection, you can encrypt the bytecode which will be decrypted only at run-time.\n </p>\n <p>\n  Another technique commonly used is opcode remapping. The set of bytecode instructions in Python can be found in\n  <a href=\"https://github.com/python/cpython/blob/master/Include/opcode.h\" rel=\"noreferrer\">\n   opcode.h\n  </a>\n  .\n </p>\n <p>\n  Consider these two instructions\n </p>\n <pre><code>#define DUP_TOP_TWO               5\n\n#define BINARY_TRUE_DIVIDE       27\n</code></pre>\n <p>\n  You can interchange the opcodes for these instructions. As a result the bytecode will only be understood by your custom Python build.\n </p>\n <p>\n  The earlier versions of Dropbox were developed in Python and they used some of the above techniques to harden their code but as is the case with any DRM system, it was eventually reverse engineered and analyzed. There's a\n  <a href=\"https://github.com/kholia/dedrop/blob/master/paper/resources/Reversing%20obfuscated%20python%20applications%20-%20Breaking%20the%20Dropbox%20client%20on%20Windows.pdf\" rel=\"noreferrer\">\n   write-up of this process\n  </a>\n  which you can study for further reference. (Disclaimer: I'm the author of the write-up but not the owner of the GitHub repo).\n </p>\n</div>\n</body></html>",
            "votes": "8",
            "user": "0xec",
            "time": "Dec 1, 2019 at 22:21",
            "is_accepted": false,
            "comments": []
        }
    ]
}