{
    "title": "Are there existing automated approaches to reverse engineering the data types in a binary data stream?",
    "link": "https://reverseengineering.stackexchange.com/questions/22658/are-there-existing-automated-approaches-to-reverse-engineering-the-data-types-in",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Consider a stream of data packets of a known and consistent size, i.e.,\n  <em>\n   N\n  </em>\n  bytes per packet.\n  <strong>\n   Are there existing tools that automatically detect (or estimate) the various data types present and their arrangement in the packet?\n  </strong>\n  My goal is to convert the data stream into a handful of time-series data signals by\n </p>\n <ol>\n  <li>\n   deducing the arrangement and types of the data in the stream and\n  </li>\n  <li>\n   extracting each variable into its own signal array.\n  </li>\n </ol>\n <p>\n  For example, the packet might consist of:\n </p>\n <pre><code>[double double int32 single int8 int8 int8 int8]\n</code></pre>\n <p>\n  but all I know is that the packet is 28 bytes long.\nLet's assume that the only possible data types in the stream are:\n  <code>\n   double\n  </code>\n  ,\n  <code>\n   single\n  </code>\n  ,\n  <code>\n   int32\n  </code>\n  ,\n  <code>\n   int16\n  </code>\n  , or\n  <code>\n   uint8\n  </code>\n  .\n(I don't particularly care if I can disambiguate between\n  <code>\n   char\n  </code>\n  ,\n  <code>\n   int8\n  </code>\n  , or\n  <code>\n   uint8\n  </code>\n  .)\nLet's also assume everything is stored in bytes (no single bit flags or anything).\n </p>\n <h3>\n  Some ideas\n </h3>\n <p>\n  Basically what I've tried so far is to exhaustively try every possible combination and arrangement of data types and then apply some heuristics to eliminate possibilities.\nFor example, I'll cast each set of 8 bytes as a double, shifting over 1 byte at a time, and then compute the variance of the resulting signal.\nIf the variance of the signal is >1e100, then we can probably safely say we've misidentified the type.\nThe problems that this approach runs into are that:\n </p>\n <ol>\n  <li>\n   the heuristics are hard coded and not dependent on the data\n  </li>\n  <li>\n   the algorithm can easily mis-classify things, e.g., it can't necessarily differentiate between an\n   <code>\n    int32\n   </code>\n   and a pair of\n   <code>\n    int16\n   </code>\n   .\n  </li>\n </ol>\n <p>\n  I'm also aware of these two related questions:\n  <a href=\"https://stackoverflow.com/questions/1026066/how-to-analyze-binary-file\">\n   How to analyze binary file?\n  </a>\n  and\n  <a href=\"https://stackoverflow.com/questions/492751/tools-to-help-reverse-engineer-binary-file-formats\">\n   Tools to help reverse engineer binary file formats\n  </a>\n  ,\nbut these answers seem to only give manual tools that require the user to then play around with the data and make some guesses about its configuration.\nSo, my question is particularly interested in automatic approaches or tools for this job.\n </p>\n <p>\n  This seems related to\n  <a href=\"https://reverseengineering.stackexchange.com/q/18451/30361\">\n   this question\n  </a>\n  and\n  <a href=\"https://reverseengineering.stackexchange.com/a/18457/30361\">\n   its answer\n  </a>\n  , but the methods mentioned there seem to be aimed at a more general task of inferring the communication protocol, and not necessarily(?) the datatypes of the packet's payload, so I'm not sure how suitable these programs are to the task I've described.\n </p>\n</div>\n</body></html>",
    "votes": "6",
    "answers": 1,
    "views": "466",
    "tags": [
        "binary-analysis",
        "file-format"
    ],
    "user": "J. Tylka",
    "time": "Dec 3, 2019 at 4:17",
    "comments": [
        {
            "user": "pythonpython",
            "text": "<html><body><span class=\"comment-copy\">\n I'm working on this. Please post more specifics. If you have a capture of the packets that would be helpful (the more the better).\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  IMO there is not much to add to the linked answer (even though it's focused on network protocols, your task sounds pretty similar).\n </p>\n <p>\n  One more thing you can try is to look at papers\n  <a href=\"https://scholar.google.com/scholar?q=netzob\" rel=\"nofollow noreferrer\">\n   citing the mentioned tools\n  </a>\n  to find more/related approaches or tools.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Igor Skochinsky",
            "time": "Dec 2, 2019 at 21:04",
            "is_accepted": false,
            "comments": []
        }
    ]
}