{
    "title": "C# - Identical block of code, but IL instructions changed after update. How do I modify the more convoluted update?",
    "link": "https://reverseengineering.stackexchange.com/questions/22681/c-identical-block-of-code-but-il-instructions-changed-after-update-how-do-i",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Background info - For the game 7 Days To Die, there is a C# wrapper that implements the Harmony API, which allows us to intercept the game's function calls, as well as changing the IL instructions themselves.\n </p>\n <p>\n  I originally used the Transpiler functionality to remove a condition that's used in two checks. Which was easy enough, as I just needed to remove three instructions. Here's a screenshot showing them:\n </p>\n <p>\n  <img alt=\"\" src=\"https://i.sstatic.net/r5Wmj.png\"/>\n </p>\n <p>\n  On the left is the old code, which was easy enough to modify. I just needed to remove the instructions at indexes\n  <strong>\n   79\n  </strong>\n  ,\n  <strong>\n   80\n  </strong>\n  , and\n  <strong>\n   81\n  </strong>\n  . Which changes the C# code from:\n </p>\n <pre><code>this.cmds[1].enabled = (_world.IsEditor() && flag);\n</code></pre>\n <p>\n  To:\n </p>\n <pre><code>this.cmds[1].enabled = (flag);\n</code></pre>\n <p>\n  Which worked perfectly. However, the DLL was changed in an update. The C# code is the exact same, but the IL instructions differ at this very last condition check. And I can't quite wrap my head around it.\n </p>\n <p>\n  The original was easy enough.\n  <code>\n   IL 79\n  </code>\n  prepares something for the next function call,\n  <code>\n   IL 80\n  </code>\n  makes the call, and\n  <code>\n   IL 81\n  </code>\n  jumps past the next couple of instructions if it returns false. In ASM, the three instructions would basically be\n  <code>\n   pop\n  </code>\n  (call class' function via a pointer),\n  <code>\n   cmp\n  </code>\n  (check the boolean result), and\n  <code>\n   jz\n  </code>\n  (jump if false).\n </p>\n <p>\n  But the updated IL instructions on the right don't make any sense to me. There's no branch, there's no jump. How do I work with that to remove the\n  <code>\n   _world.IsEditor()\n  </code>\n  condition?\n </p>\n <p>\n  Edit:\n  <a href=\"https://pastebin.com/XEncgdet\" rel=\"nofollow noreferrer\">\n   Pastebin of the C# function\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "218",
    "tags": [
        "c#"
    ],
    "user": "FiftyTifty",
    "time": "Dec 7, 2019 at 18:05",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It looks like that previous code had an optimization done, so that if the left-hand side value was evaluated as\n  <code>\n   false\n  </code>\n  the right one was not evaluated at all in the\n  <code>\n   &&\n  </code>\n  operation as it would never result in\n  <code>\n   true\n  </code>\n  anyway and\n  <code>\n   false\n  </code>\n  can be used directly.\n </p>\n <p>\n  Currently there's no such code but you can clearly see the\n  <code>\n   and\n  </code>\n  being done, preceded by\n  <code>\n   ldloc.0\n  </code>\n  . There's a missing code from the beginning of this function but if local variable at index 0 is your\n  <code>\n   flag\n  </code>\n  you can remove those two instructions (so lines 81 and 82). From the code it looks like on the stack there should already by also a\n  <code>\n   1\n  </code>\n  so that the instruction that stores the value with\n  <code>\n   stfld\n  </code>\n  will work. If not you could add a\n  <code>\n   ldc.i4.1\n  </code>\n  instead of those two that you removed.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Paweł Łukasik",
            "time": "Dec 7, 2019 at 18:34",
            "is_accepted": true,
            "comments": [
                {
                    "user": "FiftyTifty",
                    "text": "<span class=\"comment-copy\">Your solution worked, thanks a bunch for that. Now I'm trying to wrap my head around it, but it is a bit too abstract for me. I get that <code>flag</code> was put onto the top of the stack as <code>1</code>, which is the same as <code>true</code>, earlier in the function. But at the end of the code, which is the part to be changed, there's several other instructions pushing to the stack as well, but no popping from the stack. Do the instructions just take the variable from the top of the stack, basically as an automatic <code>push</code> before that instruction is processed?</span>",
                    "time": null
                },
                {
                    "user": "Paweł Łukasik",
                    "text": "<span class=\"comment-copy\">yes, IL is stack-based so each instruction takes what it needs from stack and push back the results on top.</span>",
                    "time": null
                }
            ]
        }
    ]
}