{
    "title": "Hacking old gym equipment",
    "link": "https://reverseengineering.stackexchange.com/questions/22774/hacking-old-gym-equipment",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Anyone reversed ifit?\n </p>\n <p>\n  I just picked up a discounted NordicTrack Elite 11.0 Elliptical on Ebay, I want to hack it.\n </p>\n <p>\n  I would like to extract performance data and it would be great if I could control the elliptical to increase/decrease the intensity?\n </p>\n <p>\n  I can see the elliptical has an ifit port, I think this takes an ifit module which adds wifi to the elliptical, I think this might tie me to the ifit subscription app though which is bad, anyone hacked this or know anything about it, maybe the PCB fingers (the module connects to) are just a serial communications port?\n </p>\n <p>\n  Maybe I can use bluetooth (might just be for heart rate), or even USB (might just be for phone charging), where do I even start?\n </p>\n <p>\n  Ideally if I could hack something together without having to buy anything proprietary or be locked into monthly subscriptions then that would be fab, it doesn't need to be fancy.\n </p>\n <p>\n  FWIW I'm pretty handy with computers and I can solder, I also have access to an oscilloscope, open to suggestions on a logic analyser I could buy, if that will help?\n </p>\n <p>\n  This looks interesting:\n </p>\n <p>\n  <a href=\"https://github.com/dawsontoth/zwifit\" rel=\"nofollow noreferrer\">\n   https://github.com/dawsontoth/zwifit\n  </a>\n  <a href=\"https://github.com/jamesdotcuff/iFitController\" rel=\"nofollow noreferrer\">\n   https://github.com/jamesdotcuff/iFitController\n  </a>\n </p>\n <p>\n  Also it looks like some people just remove the head unit and replace it with a SBC like RPi (and display) wired into the sensors, I probably don't want to go that far.\n </p>\n <p>\n  I could buy the ifit module, they're going for around A$250 on ebay, would that be the best place to start?\n </p>\n <p>\n  The optimal result is I can get data from the elliptical, into one of these \"games\" where you can race up the side of a mountain.\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "7k",
    "tags": [
        "hardware"
    ],
    "user": "Richard Thornton",
    "time": "Dec 24, 2019 at 20:35",
    "comments": [
        {
            "user": "Yeroc",
            "text": "<html><body><span class=\"comment-copy\">\n I'm curious whether you made any progress on this at all.  I have a similar Proform-branded treadmill which accepts an iFit Wifi Module (which i don't have).  It looks like the edge connector has relatively few conductors so ought to be relatively easy to reverse engineer or control...\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'd try to approach this from a pure software perspective. Since handheld devices can connect to iFit exercise equipment with the iFit app I'd develop an app which talks the same iFit protocol. I'm actually planning to add iFit support to my own mobile application sometimes in the future. I'm looking at the\n  <a href=\"https://github.com/dawsontoth/zwifit\" rel=\"nofollow noreferrer\">\n   https://github.com/dawsontoth/zwifit\n  </a>\n  repository and I think it could be possible to decipher the protocol from that source.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Csaba Toth",
            "time": "May 3, 2021 at 16:52",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Csaba Toth",
                    "text": "<span class=\"comment-copy\">The iFitController repository is now <a href=\"https://github.com/belden/iFitController\" rel=\"nofollow noreferrer\">github.com/belden/iFitController</a></span>",
                    "time": null
                },
                {
                    "user": "Csaba Toth",
                    "text": "<span class=\"comment-copy\">Others are looking for solution as well: <a href=\"https://stackoverflow.com/questions/56944424/is-the-api-for-exercise-machines-like-nordictrack-ifit-open-can-i-write-an-ap\" title=\"is the api for exercise machines like nordictrack ifit open can i write an ap\">stackoverflow.com/questions/56944424/…</a></span>",
                    "time": null
                }
            ]
        }
    ]
}