{
    "title": "Bin patching Arm7tdmi CRC32?",
    "link": "https://reverseengineering.stackexchange.com/questions/22804/bin-patching-arm7tdmi-crc32",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Ok so I am total noob here. I wanted to play with the bin from an instrument cluster I work on a lot. I was able to pull the bin off the MCU with a J-link. If I erase the chip and flash it with a bin from it or another cluster it works but if I change anything in the bin it won't work.. Don't worry I am not messing with the Odo value thats stored on an EEprom and easy to change lol.\n </p>\n <p>\n  Learned a little about bin patching via youtube/google and ran the bin through binwalk. doing  that binwalk says\n </p>\n <blockquote>\n  <p>\n   Decimal: 211720  HEX:0x33b08 Description: crc32.\n  </p>\n </blockquote>\n <p>\n  I'm guessing this CRC not matching is making it fail to boot. If I look at the bin with HxD I don't see anything that matches what Binwalk is saying but I am probably looking at it wrong. Where do I find the CRC in this bin from what address is this crc checking because if I use HxD or online CRC generators It doesnt match anything in the bin also...\n </p>\n <p>\n  I am sure I am not describing this all correctly I am still learning and climbing mt. stupid.\n </p>\n <p>\n  All I want to do is change some of the error messages to say something funny. I am just doing this for the novelty and to learn something new.\n </p>\n <p>\n  Linked Github with the bin,\n  <a href=\"https://github.com/garnerm91/07-14-GM-cluster-BINs\" rel=\"nofollow noreferrer\">\n   Github link\n  </a>\n </p>\n <p>\n  BTW all edits I make are one for one changes so I am not shifting anything around in the bin. The attached is unedited and works.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "85",
    "tags": [
        "arm",
        "crc",
        "binary-editing"
    ],
    "user": "Matt",
    "time": "Dec 26, 2019 at 11:15",
    "comments": [
        {
            "user": "Matt",
            "text": "<html><body><span class=\"comment-copy\">\n So I think it sitting at\n <code>\n  00012010 08 3B 03\n </code>\n now I am just not sure what section of the file it made for. If you make one for the whole file you get\n <code>\n  98BFF3C6\n </code>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}