{
    "title": "What does entropy mean and how can it be used? [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/22808/what-does-entropy-mean-and-how-can-it-be-used",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <div>\n  <aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n   <div class=\"d-flex fd-column fw-nowrap\">\n    <div class=\"d-flex fw-nowrap\">\n     <div class=\"flex--item wmn0 fl1 lh-lg\">\n      <div class=\"flex--item fl1 lh-lg\">\n       <div>\n        <b>\n         This question already has answers here\n        </b>\n        :\n       </div>\n      </div>\n     </div>\n    </div>\n    <div class=\"flex--item mb0 mt4\">\n     <a dir=\"ltr\" href=\"/questions/21555/what-is-an-entropy-graph\">\n      What is an entropy graph\n     </a>\n     <span class=\"question-originals-answer-count\">\n      (5 answers)\n     </span>\n    </div>\n    <div class=\"flex--item mb0 mt8\">\n     Closed\n     <span class=\"relativetime\" title=\"2019-12-24 14:01:28Z\">\n      5 years ago\n     </span>\n     .\n    </div>\n   </div>\n  </aside>\n </div>\n <p>\n  I'm playing around with\n  <code>\n   binwalk -E\n  </code>\n  and am just looking at some entropy graphs as I try to reverse engineer some CTF binaries. I kinda understand the use of data/information entropy in cryptography (it's often used to help determine what cipher/encryption is used) but I haven't read or heard anything about entropy in analysis of program.\n </p>\n <p>\n  What does entropy really mean in reverse engineering? What does it say about a program? How can it be used?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "444",
    "tags": [
        "entropy"
    ],
    "user": "ChocolateOverflow",
    "time": "5 years ago",
    "comments": [
        {
            "user": "bart1e",
            "text": "<html><body><span class=\"comment-copy\">\n Please see\n <a href=\"https://reverseengineering.stackexchange.com/questions/21555/what-is-an-entropy-graph\">\n  this question\n </a>\n . I think it contains the information you are looking for.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Entropy is a measurement of the appearance of \"randomness\" of bytes. For example, if you were to take the entropy of the text content of this post, and then take the entropy of a SHA-512 hash or RSA ciphertext, you will see a dramatic increase in the hash and RSA ciphertext over the plaintext content of this post. There are known entropy levels for plaintext English, for instance.\n </p>\n <p>\n  <strong>\n   How it can be used in reverse engineering\n  </strong>\n </p>\n <p>\n  One useful function of entropy is to determine areas of ciphertext or other encryption outputs in a program. A concrete example would be to take a \"packed\" or compressed malware sample, and compare the entropy levels to a non-packed or non-compressed program. The packed malware sample will have entropy levels that are much higher. One useful application of this would be to simply write a script which batch-scans files and takes entropy readings, in order to identify files that have large areas of packed/compressed/encrypted data. These files will have higher entropy readings. A malware analyst will sometimes take an entropy reading of a file in an initial cursory analysis to determine if the file is packed or not.\n </p>\n <p>\n  Switching gears, if you wanted to pack or compress data in your own program, you could write your packing code, then compare the entropy of the output data with the entropy of the uncompressed data to see how much \"randomness\" you've introduced.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "the_endian",
            "time": "Dec 23, 2019 at 7:45",
            "is_accepted": false,
            "comments": []
        }
    ]
}