{
    "title": "Samsung A520F usb type-c uart debug mode",
    "link": "https://reverseengineering.stackexchange.com/questions/22986/samsung-a520f-usb-type-c-uart-debug-mode",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to create UART cable for A520F phone with USB type-c. Seems,\n  <a href=\"https://forum.xda-developers.com/galaxy-s8+/how-to/hardware-uart-cable-time-t3607499\" rel=\"nofollow noreferrer\">\n   there is no UART debug modes S8+ either\n  </a>\n  .  On Samsung phones with micro USB one may access UART JIG mode with  619K resistor, connected to micro USB ID pin.\n </p>\n <p>\n  How I test:\n </p>\n <p>\n  I can dump MUIC registers. I have raw usb type c plug(mounted on board with solder pads), with cable soldered, which maps usb type c pins on breadboard. So I assemble test scheme and analyze MUIC registers and MUIC linux kernel module log output upon attachment.\n </p>\n <p>\n  What I currently find:\n </p>\n <ul>\n  <li>\n   The receptacle is managed by s2mu004 kernel module. Module is capable to manage non type-c receptacles (see CONFIG_MUIC_S2MU004_NON_USB_C_TYPE option)\n  </li>\n  <li>\n   Receptacle has non standard pinout: B12 (considering, A row facing top, B row facing bottom side of the phone) pin is not connected to the ground.\n  </li>\n  <li>\n   Device can detect water in usb receptacle, by measuring resistance between B12 pin.\n  </li>\n  <li>\n   Device can detect plug attach, with ALL pins unconnected, including GND and VBUS pins. How?\n  </li>\n  <li>\n   Attaching 619K resistor to B12 pin results in ADC_JIG_UART_ON value in ADC register, during water detection sequence.\n  </li>\n  <li>\n   Attaching 619K resistor to one of CC pins result in no device connected.\n  </li>\n  <li>\n   Enter UART mode by attaching resistors should be possible in NON type-c mode. (file s2mu004-muic.c ,\n   <a href=\"https://github.com/LineageOS/android_kernel_samsung_universal7880/blob/lineage-16.0/drivers/muic/s2mu004-muic.c#L2854\" rel=\"nofollow noreferrer\">\n    lines 2835,2797\n   </a>\n   )\n  </li>\n  <li>\n   Device has no USB type-c debug accessory mode(tried both with rd/rd and rp/rp resistors on CC pins) - rd/rd results in OTG mode.\n  </li>\n </ul>\n <p>\n  What else can I try?\nIf you were this device developer, how would you hide UART debug mode from users?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "1k",
    "tags": [
        "hardware",
        "usb"
    ],
    "user": "Dzmitry Sankouski",
    "time": "Jan 26, 2020 at 13:42",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n Does it have a headphone jack? AFAIK some phones have UART connected to it.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Dzmitry Sankouski",
            "text": "<html><body><span class=\"comment-copy\">\n Yes, it has headphone jack, but I believe, that uart mode is multiplexed with usb type c port, because UART Jig is mentioned in usb attach/detach handling routine.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}