{
    "title": "Ghidra analyzing hardcoded indirect jumps",
    "link": "https://reverseengineering.stackexchange.com/questions/22985/ghidra-analyzing-hardcoded-indirect-jumps",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm currently analyzing a function that has a lot of indirect jumps looking like the following.\n </p>\n <p>\n  LEA R10,[0x142000000]\n </p>\n <p>\n  (some instructions that dont change R10)\n </p>\n <p>\n  JMP R10\n </p>\n <p>\n  The Ghidra decompiler just treats the indirect jump as a call and doesnt give any meaningful output. How do I go ahead and analyze a function like that? I guess ideally I would just like to change the JMP R10 instruction to JMP 0x142000000 in this example, however if I cant just do that since the opcode is larger and other jumps would no longer align.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 3,
    "views": "4k",
    "tags": [
        "decompilation",
        "ghidra"
    ],
    "user": "legendff",
    "time": "Jan 13, 2020 at 15:20",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n \"and doesn't give any meaningful output\" can you show what it actually produces in such case?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "legendff",
            "text": "<html><body><span class=\"comment-copy\">\n @PawełŁukasik For the example it looks something like this void function(void) {                     /* WARNING: Treating indirect jump as call */   (*(code *)0x142000000)();   return; } if I go to the address it jumps it also only shows the same thing in the decompiler, so I think it realizes that its all 1 function\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You can potentially change this to what you're looking for by using the \"Modify Instruction Flow...\" menu item when right clicking the jump instruction.\n </p>\n <p>\n  In ghidra, press F1 and search for \"Modify Instruction Flow\" for a full description\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "mumbel",
            "time": "Jan 18, 2020 at 20:15",
            "is_accepted": true,
            "comments": [
                {
                    "user": "legendff",
                    "text": "<span class=\"comment-copy\">Thank you, I'm only getting the option to modify instruction flow on the jump instructions, but it does seem todo what Im looking for.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It looks like your program reads a function pointer from a global memory location, and then executing it. I can guess that the jump target isn't known at compile-time, but only on runtime.\n </p>\n <p>\n  <code>\n   *(code *)0x142000000)();\n  </code>\n </p>\n <p>\n  Means go to address\n  <code>\n   0x142000000\n  </code>\n  , and treat its value as a function pointer, and call it. \nYou can try to look for write references to\n  <code>\n   0x142000000\n  </code>\n  in your binary, trying to find which function pointer is written to that memory location.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "macro_controller",
            "time": "Jan 14, 2020 at 11:38",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Its been a couple months since this was asked, but there is also another option. If you can manually calculate the jumps then its possible to specify these into Ghidra to override its default behaviour.\n </p>\n <p>\n  There is a script called\n  <code>\n   SwitchOverride\n  </code>\n  , which can be found in the script manager window. Below is the documentation from the script:\n </p>\n <blockquote>\n  <p>\n   This script allows the user to manually   specify the destinations of an indirect jump (switch)  to the decompiler, if it   can't figure out the destinations itself or does so incorrectly.  To use, create a selection that contains:  the (one) instruction performing the indirect jump to override  other instructions whose addresses are interpreted as destinations of the switch  then run this script\n  </p>\n </blockquote>\n</div>\n</body></html>",
            "votes": "2",
            "user": "kazza",
            "time": "Jun 4, 2020 at 19:29",
            "is_accepted": false,
            "comments": []
        }
    ]
}