{
    "title": "How to capture specific data packets sent in an online game?",
    "link": "https://reverseengineering.stackexchange.com/questions/23023/how-to-capture-specific-data-packets-sent-in-an-online-game",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am playing an online MMORPG game, based on player versus player idea. In this game, characters have skills. I want to capture the sent packet, when a specific skill is pressed on keyboard or etc. Basically, I want to analyze byte flow after a specific event. Which tools can I utilize to achieve this?\n </p>\n <p>\n  I tried Wireshark, but as there are lots of packets are being sent in an arbitrary instance, I couldn't observe which one was sent on my specific event.\n </p>\n <p>\n  p.s. As an additional info, the game has illegal bot softwares. I want to understand how they developed the bot.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "3k",
    "tags": [
        "debugging",
        "networking",
        "game-hacking"
    ],
    "user": "Erdem Tuna",
    "time": "Jan 16, 2020 at 20:40",
    "comments": [
        {
            "user": "MindLerp",
            "text": "<html><body><span class=\"comment-copy\">\n mmh, in the past i achieved this hooking some kernel functions, you can do it on user mode too, logically i knew the packet packing algorithm of game (ida reversed), and i had checked the packet pattern for specific event, personally i never used wireshark, but this isn't that easy as you think... gl.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n The common tools are IMHO Wireshark + your brain. Yes it will require quite some time to understand what is going on on network level. Therefore as a good start you should enter an area where you are completely alone (no other players or AI controlled NPCs) and do some actions. Note the time and try to find something in the data stream that is different at those specific times.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "multithr3at3d",
            "text": "<html><body><span class=\"comment-copy\">\n Make sure you are filtering to the correct port so you don't get lots of irrelevant traffic.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}