{
    "title": "How to “unprotect” malicious workbook without knowing password",
    "link": "https://reverseengineering.stackexchange.com/questions/23091/how-to-unprotect-malicious-workbook-without-knowing-password",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Right now I'm looking at an office document (most likely rtf based on it exploiting equation editor) that opens just fine when you double click it, but on further examination in a hex editor and in entropy analysis is technically encrypted, even without a password. It seems as thought the workbook is protected, and I'm not sure how to access the cleartext version of the document\n </p>\n <p>\n  I need to know which vulnerability the document targets to determine coverage, but I don't know how to remove it.\n </p>\n <p>\n  How do I remove the \"protection\" from the workbook so I can save it without knowing the password? Trying password crackers \"works\" but it seems to corrupt the file such that I can't save it as cleartext to examine it's internals.\n </p>\n <p>\n  I should mention that this is an .xlsx file.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "100",
    "tags": [
        "malware",
        "file-format",
        "encryption",
        "exploit"
    ],
    "user": "solumnant",
    "time": "Jan 24, 2020 at 16:57",
    "comments": [
        {
            "user": "Ian Cook",
            "text": "<html><body><span class=\"comment-copy\">\n XLSX files are compressed (zip format) so I would expect high entropy.  Have you tried renaming the file with a zip extension and unzipping to see the contents ?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "solumnant",
            "text": "<html><body><span class=\"comment-copy\">\n The internals aren't the same as an ordinary workbook: I have [6]DataSpaces, EncryptedPackage, and EncryptionInfo at the top level of the zip file. DataSpaces doesn't have anything of note in it either.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "solumnant",
            "text": "<html><body><span class=\"comment-copy\">\n I've started in on the password using John the Ripper, but it's been two hours now on an 8 core machine.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If I get your question right\n  <a href=\"https://www.onlinehashcrack.com/\" rel=\"nofollow noreferrer\">\n   This\n  </a>\n  link can help you to get the password of office files.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "KingAmir",
            "time": "Jan 25, 2020 at 7:44",
            "is_accepted": false,
            "comments": [
                {
                    "user": "solumnant",
                    "text": "<span class=\"comment-copy\">I need to do this locally: I can't submit files to third party sites.</span>",
                    "time": null
                }
            ]
        }
    ]
}