{
    "title": "What is the header 'X-Goog-Spatula'?",
    "link": "https://reverseengineering.stackexchange.com/questions/23216/what-is-the-header-x-goog-spatula",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am blackboxing an android app to write an API for it. Many of the HTTP requests sent include a mysterious header with the name\n  <code>\n   X-Goog-Spatula\n  </code>\n  .\n  <strong>\n   If I do not include this structure, the request is not successful due to 'being unauthenticated'\n  </strong>\n  , however I can find\n  <em>\n   no\n  </em>\n  information on the internet as to what it is or what it does, and I feel uncomfortable about adding the existing values I've recorded so far to the public client API, because I do not want to ship an API that could either expire in the future, or accidentally expose secrets that I shouldn't. Likewise for the same reason I won't be including actual data here (Unless anyone here can provide good arguments as to why it\n  <em>\n   should\n  </em>\n  be included).\n </p>\n <p>\n  Inspection of the structure so far as concluded that it is a base64-encoded protobuf structure, which contains several mystery values, that are as-yet unknown. An outline of the structure is:\n </p>\n <pre><code>{\n  \"string\": {\n    <name of app>,\n    <20 byte base64-encoded string>\n  },\n  \"string\": {\n    <32 byte string>,\n  },\n  \"variant\": <9 byte number>,\n  \"variant\": <9 byte number>,\n  \"string\": {\n    <89 byte string>\n  }\n}\n</code></pre>\n <p>\n  As I stated earlier, I can find\n  <strong>\n   no references on the internet to it\n  </strong>\n  , aside from these (all on\n  <a href=\"https://github.com/search?l=HTML&q=spatula+goog&type=Code\" rel=\"nofollow noreferrer\">\n   Github\n  </a>\n  ):\n </p>\n <ul>\n  <li>\n   <p>\n    <a href=\"https://github.com/googleapis/google-api-go-client/blob/7f2cf9d6ec65884391850645915bc3752fc61db2/servicecontrol/v1/servicecontrol-gen.go#L764\" rel=\"nofollow noreferrer\">\n     This\n    </a>\n    reference to it in google client code in Go.\n   </p>\n  </li>\n  <li>\n   <p>\n    A reference in the\n    <code>\n     Request\n    </code>\n    headers section of people's logged HTTP interactions.\n   </p>\n  </li>\n </ul>\n <p>\n  <strong>\n   Does anyone have any documentation on this, an idea of what it is, or alternatively, what can I do to find out what it is?\n  </strong>\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 0,
    "views": "698",
    "tags": [
        "android",
        "unpacking",
        "deobfuscation",
        "networking"
    ],
    "user": "Alexandria",
    "time": "Feb 7, 2020 at 23:53",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n I have seen some references to this header in the Google Services for Android (e.g. available in the\n <a href=\"https://opengapps.org\" rel=\"nofollow noreferrer\">\n  OpenGApps\n </a>\n pico package) in detail in the GMSCore. Internally it is some times called a \"key-less authentication header\".\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "i336_",
            "text": "<html><body><span class=\"comment-copy\">\n While in what I suspect was a near-identical situation to yours a little while ago (re app black-boxing) I crashed into this header. I reached the conclusion that its purpose is in distinguishing \"real\" Android devices from emulators, and presumably then fingerprinting real devices well enough that \"rogue\" fingerprints can be reliably exiled to Siberia.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "i336_",
            "text": "<html><body><span class=\"comment-copy\">\n One of the reasons I gave up was the suspicion that the code generating the key is likely similar to the JavaScript-based interstitial pages you sometimes see generated by certain popular CDNs - such JS code is largely script-generated and has an entire team behind keeping it highly entropic. Couple Java, a\n <i>\n  very\n </i>\n good obfuscation team and probably an even bigger security team and... well, my interest was in making an API too, and these considerations  kind of scared me off. (+1 for social psych engineering.) Poke me if you like (see profile) and I can share the small amount of progress I made\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}