{
    "title": "Approaches to detect (compressed) audio in firmware",
    "link": "https://reverseengineering.stackexchange.com/questions/23231/approaches-to-detect-compressed-audio-in-firmware",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Edit:\n  <strong>\n   The audio data is on a separate IC\n  </strong>\n </p>\n <hr/>\n <p>\n  There are a few seconds of audio in a toy\n  <s>\n   's 128 kB firmware\n  </s>\n  - somewhere...\n </p>\n <p>\n  Here is a downsampled look at the bits (white = 1):\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/HhEdk.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/HhEdk.png\"/>\n  </a>\n </p>\n <p>\n  My beginner's attempts to analyse the disassembly in order to find the audio data blocks have not been successful so far. There appear to be sections that are visually different, although it's not something very obvious. Trying the different raw audio import options in Audacity only results in \"noise\".\n </p>\n <p>\n  I am assuming a (simple?) compression scheme is in use, so maybe RLE, DPCM or even ADPCM.\n </p>\n <p>\n  My guess is that the areas that do not show the byte boundary (LSB/MSB set = white) as clearly (=higher bit frequency?) are worth a closer look.\n </p>\n <p>\n  I am going to try to gather information about the audio resolution and rate by analysing the audio output, to help get an estimate of what I am looking for.\n </p>\n <p>\n  A few ideas on how to proceed:\n </p>\n <p>\n  Finding data (as opposed to code) from program analysis:\n </p>\n <ul>\n  <li>\n   use analysers showing data sections (= no instructions, not reached in program flow) - which? what limitations apply?\n  </li>\n  <li>\n   find\n   <code>\n    const\n   </code>\n   data (not copied to RAM at initialisation)\n  </li>\n </ul>\n <p>\n  Finding audio data directly by:\n </p>\n <ul>\n  <li>\n   properties of audio data (AC signal)\n  </li>\n  <li>\n   compare with samples of data patterns in simple audio compression\n  </li>\n </ul>\n <p>\n  Working with a debugger:\n </p>\n <ul>\n  <li>\n   it might be possible to set a data change / register write breakpoint for the peripheral that is likely to generate the audio output (Timer/PWM/DAC/DMA) and work backwards from there\n  </li>\n </ul>\n <p>\n  But all of these require a lot of legwork and more background knowledge than I currently have, so the outlook is rather limited..\n </p>\n <p>\n  What other approaches to finding data in firmware should I consider?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "130",
    "tags": [
        "firmware",
        "firmware-analysis"
    ],
    "user": "handle",
    "time": "Feb 20, 2020 at 19:35",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n As long as you don't know the format finding it requires a lot of luck. If possible I would check the chip executing the code regarding the supported audio formats.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Rup",
            "text": "<html><body><span class=\"comment-copy\">\n I'd guess\n <a href=\"https://en.wikipedia.org/wiki/%CE%9C-law_algorithm\" rel=\"nofollow noreferrer\">\n  mu law\n </a>\n 8KHz mono, since that's fairly common in telephony (and a good step up from linear 8-bit PCM if you've got a 12+ bit DAC), and it doesn't feel worth going overboard with anything complex for only a few seconds of audio. Here's\n <a href=\"https://github.com/FFmpeg/FFmpeg/blob/0e9c01fd87ae6cc5ba3474810eaa3c58499615ce/libavcodec/pcm_tablegen.h#L61\" rel=\"nofollow noreferrer\">\n  the widely used (I think) Sun decode code\n </a>\n : search for bytes 0F and F0 near lots of shift instructions, and you might get lucky.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "nneonneo",
            "text": "<html><body><span class=\"comment-copy\">\n If it's a simple enough compression scheme (ADPCM, uLaw, etc.), playing it as if it's PCM will sometimes actually work. You'll get something that's noisy as heck but the underlying audio (e.g. voice, music) will be audible under the noise. This lets you determine at least two things: the bitrate/sample rate of the audio, and where in the file the audio is. (I realize you've tried this - but maybe try listening very carefully to the noise!)\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "handle",
            "text": "<html><body><span class=\"comment-copy\">\n I've used Audacity to convert a recording of the desired audio into a few different formats (with compression) to have something as a reference. Indeed, with some formats, the original audio can be recognized when playing back the raw data. Meanwhile, I have found out the audio actually comes from another IC... Must have been the cheapest option.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}