{
    "title": "How can I have a breakpoint once a value changes in DnSpy?",
    "link": "https://reverseengineering.stackexchange.com/questions/23255/how-can-i-have-a-breakpoint-once-a-value-changes-in-dnspy",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to track a certain value in a game to analyze the cause of a crash (basically, it goes to null at one point and I would like to know what exactly puts that to null as it causes issues later on). I am relatively a beginner in C# reversing as well as using DnSpy, but I couldn't find an exact way to do so leading me to believe either the feature isn't possible or if it is, I am unaware of it.\n </p>\n <p>\n  My goal is to be informed of where exactly it puts it to null with preferably a stacktrace. The best I was able to do was to breakpoint a bunch and hope for the best, but I quickly realised this is very inefficient and there has to be a better way to do this.\n </p>\n <p>\n  If it isn't possible in DnSpy itself, can I use other tools to accomplish the same thing?\n </p>\n <p>\n  If it helps, it's a Unity game which I replaced its mono dll so the DnSpy debugger works, but it can only put breakpoints in the code, not break whenever something changes at all. I can see the value in the watcher, but that's not enough.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "2k",
    "tags": [
        "c#"
    ],
    "user": "aldelaro5",
    "time": "Feb 15, 2020 at 4:41",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n what is this thing that gets\n <code>\n  null\n </code>\n ? Field, a property?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n The answer is \"Data breakpoint\" in a regular dot.net debugger - see\n <a href=\"https://stackoverflow.com/a/55486743/150978\">\n  stackoverflow.com/a/55486743/150978\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n it says that it only track properties, so it looks like it doesn't give that much benefits over a normal breakpoint. Also does Unity support .net core 3?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "aldelaro5",
            "text": "<html><body><span class=\"comment-copy\">\n it is a structure field, not a property.  As for using a regular debugger, unfortunately this would require complete decompilation of the code dll which has many intricacies that makes this difficult so the best way to track it would some a breakpoint triggered on change with the dnspy debugger.  I also forgot to mention this set to null happens in one frame making it difficult to spot what is causing it.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n @aldelaro5 with a field that's difficult and probably dnSpy doesn't have such functionality. One could try with WinDbg and HW breakpoint but with all the GC going on might not work\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}