{
    "title": "Gui disabled program functionality",
    "link": "https://reverseengineering.stackexchange.com/questions/23412/gui-disabled-program-functionality",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Right now I'm performing analysis of a GUI based application and I'm trying to determine all of it's available functionality.\n </p>\n <p>\n  Right now there's one button remaining labeled \"Encrypt\", which is greyed out. Based on the context, it would seem as though this button is responsible not for encrypting communication, but rather for packing the output of the program, using another program. I would like to confirm this directly though.\n </p>\n <p>\n  My issue is that I don't know how to locate the code that this button would trigger on the backend, or how to find what makes it available or unavailable in the GUI. Where can I find the logic responsible for determining what is available in the GUI, and where can I find what buttons are connected to which functionality using static analysis?\n </p>\n <p>\n  Edit: I've since run through the loading of the GUI using process monitor and I wasn't able to find any meaningful file query missing, which might shoot down the idea that the \"encrypt\" button is responsible for packing the payloads.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "251",
    "tags": [
        "ida",
        "binary-analysis",
        "tools"
    ],
    "user": "solumnant",
    "time": "Mar 10, 2020 at 21:19",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n If you don't want to write your own program just to issue\n <code>\n  EnableWindow\n </code>\n you can use an obscure old tool called\n <a href=\"https://duckduckgo.com/html?q=eda_preview270\" rel=\"nofollow noreferrer\">\n  eda_preview270\n </a>\n . Provided these are\n <i>\n  actual\n </i>\n windows (a Chrome app usually has one window and does the drawing by itself) you should be able to point to the button and enable it by toggling the respective checkbox.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The button is greyed out, or \"disabled\". This is most likely done by one of two ways:\n </p>\n <ol>\n  <li>\n   Creating the button as initially disabled, by passing the\n   <code>\n    WS_DISABLED\n   </code>\n   flag as\n   <code>\n    dwStyle\n   </code>\n   parameter to\n   <code>\n    CreateWindow\n   </code>\n   /\n   <code>\n    CreateWindowEx\n   </code>\n   API.\n  </li>\n </ol>\n <p>\n  You can set a breakpoint on this function and reset the dwStyle param. Zero will do.\n </p>\n <ol start=\"2\">\n  <li>\n   Disabling the button by calling the\n   <code>\n    EnableWindow\n   </code>\n   API with\n   <code>\n    bEnable = FALSE\n   </code>\n   .\n  </li>\n </ol>\n <p>\n  You can set a breakpoint on this function and set\n  <code>\n   bEnable\n  </code>\n  to TRUE (non-zero)\n </p>\n <p>\n  This will make the button enabled so you can click on it. It does not guarantee that it will be functional.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Yotamz",
            "time": "Mar 21, 2020 at 22:18",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  A few things you could do is go through the strings and see what kind of program it could possibly be loading inside of the software you are reversing. This\n  <em>\n   could\n  </em>\n  give some leads as to if your hypothesis is true.\n </p>\n <p>\n  Another thing you can do is see if it's a module being loaded. Breakpoint on entry when you run the software in a live debugger and see what DLL's and other modules are being loaded into the program. This could also deliver some leads.\n </p>\n <p>\n  You mentioned that it's greyed out so I'm not certain if you are able to press the button or not, but if you can, try pressing it and then stepping through the program. Perhaps the code was setup in a way that it won't load the module unless the button gets pressed. Then see what changes occur inside of the program with the button being pressed, and without the button being pressed. This could also give some possible leads on if your idea is true or not.\n </p>\n <p>\n  Good luck.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Graham",
            "time": "Mar 10, 2020 at 23:03",
            "is_accepted": false,
            "comments": []
        }
    ]
}