{
    "title": "What is the algorithm used in Recursive Traversal disassembly?",
    "link": "https://reverseengineering.stackexchange.com/questions/2347/what-is-the-algorithm-used-in-recursive-traversal-disassembly",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Disassembling binary code is a quite difficult topic, but for now only two (naive) algorithms seems to be broadly used in the tools.\n </p>\n <ul>\n  <li>\n   <strong>\n    Linear Sweep\n   </strong>\n   : A basic algorithm taking all the section marked as\n   <em>\n    code\n   </em>\n   and disassembling it by reading the instructions one after each other.\n  </li>\n  <li>\n   <strong>\n    Recursive Traversal\n   </strong>\n   : Refine the linear sweep by remembering when (and where) a\n   <code>\n    call\n   </code>\n   has been taken and returning to the last\n   <code>\n    call\n   </code>\n   when encountering a\n   <code>\n    ret\n   </code>\n   .\n  </li>\n </ul>\n <p>\n  Yet, the description of these algorithms are quite vague. In real-life tools, they have been a bit refined to improve the accuracy of the disassembling.\n </p>\n <p>\n  For example,\n  <code>\n   objdump\n  </code>\n  perform a linear sweep but will start from all the symbols (and not only the beginning of the sections marked as\n  <code>\n   code\n  </code>\n  .\n </p>\n <p>\n  So, can somebody give a more realistic description of the recursive traversal algorithm (\n  <em>\n   e.g.\n  </em>\n  as it is coded in IDAPro) ?\n </p>\n</div>\n</body></html>",
    "votes": "13",
    "answers": 2,
    "views": "9k",
    "tags": [
        "disassemblers"
    ],
    "user": "perror",
    "time": "Jun 26, 2013 at 15:34",
    "comments": [
        {
            "user": "debray",
            "text": "<html><body><span class=\"comment-copy\">\n IIRC in recursive traversal the disassembler tries to follow all control transfer instructions -- i.e., identify and continue disassembly at the various possible control flow targets of the instruction -- not just\n <code>\n  call\n </code>\n instructions.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "viv",
            "text": "<html><body><span class=\"comment-copy\">\n <a href=\"http://lida.sourceforge.net\" rel=\"nofollow noreferrer\">\n  Lida\n </a>\n which is based on Bastard's\n <a href=\"http://bastard.sourceforge.net/libdisasm.html\" rel=\"nofollow noreferrer\">\n  libdisasm\n </a>\n ,\n <a href=\"http://code.google.com/p/distorm/\" rel=\"nofollow noreferrer\">\n  diStorm3\n </a>\n and\n <a href=\"http://www.beaengine.org\" rel=\"nofollow noreferrer\">\n  beaengine\n </a>\n are some open source disassembly engines that use recursive disassembly.Also a paper:\n <a href=\"http://dl.acm.org/citation.cfm?id=948149\" rel=\"nofollow noreferrer\">\n  Obfuscation of executable code to improve resistance to static disassembly\n </a>\n by Cullen and Saumya gives a rough algorithm for recursive sweep disassembly.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have decided to post my answer not to overthrow Igor's answer, but to have an addition to it. I was not comfortable with editing his post either. I am pretty new to the forum and not sure how it is taken by other members.\n </p>\n <p>\n  There is a little theory I have recently learned, which I would like to share. Anyways, what I have taken in about IDA Pro from\n  <a href=\"http://nostarch.com/idapro.htm\">\n   The IDA Pro Book\n  </a>\n  (Part I, Section 1) is that it uses\n  <strong>\n   <code>\n    Recursive Descent Disassembly\n   </code>\n  </strong>\n  , which is based on the concept of control flow. The key element to this approach is the analysis of each instruction in order to determine if it is referenced from any other location. Each instruction is classified according to how it interacts with EIP. There are several main classifications:\n </p>\n <ol>\n  <li>\n   <strong>\n    Sequential Flow Instuctions\n   </strong>\n   . Those are instruction that pass execution to the next instruction to follow such as\n   <code>\n    add\n   </code>\n   ,\n   <code>\n    mov\n   </code>\n   ,\n   <code>\n    push\n   </code>\n   ,\n   <code>\n    pop\n   </code>\n   , etc. Those instructions are disassembled with\n   <strong>\n    linear sweep\n   </strong>\n  </li>\n  <li>\n   <strong>\n    Conditional Branching Instructions\n   </strong>\n   . Those are\n   <em>\n    True/False\n   </em>\n   conditional instructions such as\n   <code>\n    je\n   </code>\n   and such. Conditional instructions only offer 2 possible branches of execution. If condition is\n   <em>\n    False\n   </em>\n   and jump is not taken disassembler proceeds with\n   <strong>\n    linear sweep\n   </strong>\n   , and adds jump target instruction to a list of deferred code to be disassembled at later time using\n   <strong>\n    recursive descent algorithm\n   </strong>\n  </li>\n  <li>\n   <strong>\n    Unconditional Branching Instructions\n   </strong>\n   . Those instruction can cause particular problems for recursive descent disassemblers in case the jump target is calculated at runtime. Unconditional branches do not follow linear flow. If possible, disassembler will attempt to add the target of the unconditional jump for further analysis. If target is not determined, there is going to be no disassembly for the particular branch.\n  </li>\n  <li>\n   <strong>\n    Function Call Instructions\n   </strong>\n   . Call instructions are mostly treated as Unconditional Branching Instructions with expectation that execution would return to the instruction following the call as soon as function completes. The target address address of the call instruction is queued for deferred disassembly, and the instruction following the call is processed as linear sweep. However, it is not always possible to determine target of the call (e.g.\n   <code>\n    call eax\n   </code>\n   ).\n  </li>\n  <li>\n   <strong>\n    Return Instructions\n   </strong>\n   Return instructions do not offer any information to disassembler about what to execute next. Disassemblers cannot pop the return address from the top of the stack. All of that brings disassembler to stop. At this point disassembler turns to the saved list of deferred targets to follow next. That is exactly why it is called\n   <strong>\n    <em>\n     recursive\n    </em>\n   </strong>\n   .\n  </li>\n </ol>\n <p>\n  To summarize, I would like to quote\n  <a href=\"http://nostarch.com/idapro.htm\">\n   The IDA Pro Book\n  </a>\n  :\n </p>\n <blockquote>\n  <p>\n   One of the principle advantages of the recursive descent algorithm is its superior ability to distinguish code from data. As a control flow-based algorithm, it is much less likely to incorrectly disassemble data values as code. The main disadvantage of recursive descent is the inability to follow indirect code paths, such as jumps or calls, which utilize tables of pointers to look up a target address. However, with the addition of some heuristics to identify pointers to code, recursive descent disassemblers can provide very complete code coverage and excellent recognition of code versus data.\n  </p>\n </blockquote>\n</div>\n</body></html>",
            "votes": "12",
            "user": "PSS",
            "time": "Jun 26, 2013 at 20:36",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Here's a\n  <em>\n   very\n  </em>\n  simplified overview of how IDA does it:\n </p>\n <ol>\n  <li>\n   add to the analysis queue all known entrypoints, or addresses specified by the user\n  </li>\n  <li>\n   while queue not empty, pop the next address\n  </li>\n  <li>\n   ask processor module to disassemble the instruction\n  </li>\n  <li>\n   ask processor module to analyze the instruction\n  </li>\n  <li>\n   processor module adds code cross-references to all possible targets\n   \n\n   in the simplest case, it's the next instruction\n   \n\n   for conditional jumps and calls, it's the next instruction and the target\n   \n\n   for indirect jumps - unknown, unless it's a recognized switch pattern\n  </li>\n  <li>\n   put not-yet analyzed targets of all those cross-references into the queue\n  </li>\n  <li>\n   go to step 2\n  </li>\n </ol>\n <p>\n  Of course, in reality things are more complex. To start with, there's not a single queue but several. From the SDK's\n  <code>\n   auto.hpp\n  </code>\n  :\n </p>\n <pre><code>//\n//      This file contains functions that work with the autoanalyzer\n//      queue. The autoanalyzer works when IDA is not busy processing\n//      the user keystrokes.\n//      The autoanalyzer has several queues. Each queue has its priority.\n//      A queue contains addresses or address ranges.\n//      The addresses are kept sorted by their values.\n//      The analyzer will process all addresses from the first queue, then\n//      switch to the second queue and so on.\n//      There are no limitations on the size of the queues.\n//      The analyzer stops when all queues are empty.\n//\n//      Also this file contains functions that deal with the IDA status\n//      indicator and the autoanalysis indicator.\n//      You may use these functions to change the indicator value.\n//\n\n// Names and priorities of the analyzer queues\n\ntypedef int atype_t;\nconst atype_t           // priority,  description\n  AU_NONE = 00,         //    placeholder, not used\n  AU_UNK  = 10,         //  0 convert to unexplored\n  AU_CODE = 20,         //  1 convert to instruction\n  AU_WEAK = 25,         //  2 convert to instruction (ida decision)\n  AU_PROC = 30,         //  3 convert to procedure start\n  AU_TAIL = 35,         //  4 add a procedure tail\n  AU_TRSP = 38,         //  5 trace stack pointer (not used yet)\n  AU_USED = 40,         //  6 reanalyze\n  AU_TYPE = 50,         //  7 apply type information\n  AU_LIBF = 60,         //  8 apply signature to address\n  AU_LBF2 = 70,         //  9 the same, second pass\n  AU_LBF3 = 80,         // 10 the same, third pass\n  AU_CHLB = 90,         // 11 load signature file (file name is kept separately)\n  AU_FINAL=200;         // 12 final pass\n</code></pre>\n</div>\n</body></html>",
            "votes": "12",
            "user": "Igor Skochinsky",
            "time": "Jun 26, 2013 at 17:00",
            "is_accepted": false,
            "comments": [
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">Am I wrong if I say that you are using a work-list approach of the algorithm. Like in data-flow analysis ? (It is quite nice indeed)</span>",
                    "time": null
                }
            ]
        }
    ]
}