{
    "title": "How to decode a .plr file",
    "link": "https://reverseengineering.stackexchange.com/questions/24651/how-to-decode-a-plr-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a .plr file that contains all of the player information for the game Terarria.\nI would like to decode it to have a look at what data is stored on this file so that I can play around with making edits.\n </p>\n <p>\n  Opening the file in a text editor, it appears as such:\n  <a href=\"https://pastebin.com/x19Triv1\" rel=\"nofollow noreferrer\">\n   https://pastebin.com/x19Triv1\n  </a>\n </p>\n <p>\n  I had hoped that converting this file to binary and then converting the binary to text would work, but it just converts it back into garbage characters.\nHere is the binary:\n  <a href=\"https://pastebin.com/uX2p5kGr\" rel=\"nofollow noreferrer\">\n   https://pastebin.com/uX2p5kGr\n  </a>\n </p>\n <p>\n  Any ideas on how to go about decoding this file will be appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "-1",
    "answers": 1,
    "views": "400",
    "tags": [
        "file-format",
        "decompile"
    ],
    "user": "VirgilCane",
    "time": "Apr 8, 2020 at 8:11",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  One approach is to make changes to the player in the game, and export the data again. Compare what has changed in the .plr to what was changed in game. Repeat until you've figured most everything out.\n </p>\n <p>\n  There are likely some automated tools out there to help with this, or it could be scripted. I know there are some mobile apps for rooted devices that help see what's changed in memory when values in the game change.\n </p>\n <p>\n  Since you may be dealing with non-printable characters, you'll want to use a hex editor to view the file. Depending on the hex editor, you may be able to view a proper diff between files.\n </p>\n <p>\n  It may be tedious, but look for common data types. For example, let's say there's a game that stores how much money you currently have. You would dump the configuration before and after making a big purchase. I would then look for perhaps a 4 or 8 byte value (int) that has changed. Or maybe it's a 32-bit float. Definitely have your favorite number conversion tool available.\n </p>\n <p>\n  While there's some trial and error involved, the right assumptions can help get you there.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "multithr3at3d",
            "time": "Apr 9, 2020 at 14:36",
            "is_accepted": false,
            "comments": [
                {
                    "user": "VirgilCane",
                    "text": "<span class=\"comment-copy\">If the .plr file is encoded so that only garbage characters are displayed when it is opened in a text editor, how can I notice a change? Even if I convert the file to binary, combing it for changes would be more than laborious.</span>",
                    "time": null
                },
                {
                    "user": "multithr3at3d",
                    "text": "<span class=\"comment-copy\">@VirgilCane I updated the answer with some suggestions</span>",
                    "time": null
                }
            ]
        }
    ]
}