{
    "title": "Get string from function and pass it to another program",
    "link": "https://reverseengineering.stackexchange.com/questions/24682/get-string-from-function-and-pass-it-to-another-program",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I want to make a small tool that analyzes text from console in online game and I'm stuck at reading a string from a function and sending it to another program. I managed to find function that takes string as argument and calls function responsible for showing it in game and it looks something like this:\n </p>\n <pre><code>void Game::processTextMessage(Otc::MessageMode mode, const std::string& text)\n{\n    g_lua.callGlobalField(\"g_game\", \"onTextMessage\", mode, text);\n}\n</code></pre>\n <p>\n  Also, using Cheat Engine and x96dgb i found address of this function:\n  <a href=\"https://i.sstatic.net/8XCSc.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"asm code\" src=\"https://i.sstatic.net/8XCSc.png\"/>\n  </a>\n </p>\n <p>\n  String I need to capture is \"Czerw pozostawia po sobie: 3 robaki\". \nI tried .dll injection but I don't know how to hook to that function.\nAlso I found something similar to what I want to do:\n  <a href=\"https://github.com/ur0/DotATranslator/blob/master/Injectee/dllmain.cpp\" rel=\"nofollow noreferrer\">\n   https://github.com/ur0/DotATranslator/blob/master/Injectee/dllmain.cpp\n  </a>\n  but I don't know what to change to make it work. What steps should I take?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "120",
    "tags": [
        "strings",
        "dll-injection",
        "game-hacking"
    ],
    "user": "Dasmitian",
    "time": "Apr 11, 2020 at 0:55",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Assuming you're trying to intercept function calls and manipulate / get the input to that function, you are going to need to hook it first.\n </p>\n <p>\n  I'd recommend reading about function hooking (there's a plenty of information out there regarding this subject).\n </p>\n <p>\n  Its basic idea is rather simple, given the start address of function to be hooked\n  <code>\n   func01\n  </code>\n  you override the first five bytes (of course you have to save them) with a\n  <code>\n   JMP\n  </code>\n  instruction that will lead to your own fake\n  <code>\n   func01\n  </code>\n  function that in it you'd do as you pleased with the argument, and when you're done, you call to the the original function (and here's the catch, you want to call a stub that will execute the first five bytes you were overriding and then jumps back to the original function's address plus five\n  <code>\n   <func01_addr + 5>\n  </code>\n </p>\n <p>\n  If that's allowed (sorry if its not), there's a nice and easy-to-use hooking library called Mhook (but I'd first suggest getting some sense about the idea).\n </p>\n <p>\n  good luck\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "stylo",
            "time": "Apr 11, 2020 at 6:51",
            "is_accepted": false,
            "comments": []
        }
    ]
}