{
    "title": "Trace back regularly used .data variable in IDA",
    "link": "https://reverseengineering.stackexchange.com/questions/24699/trace-back-regularly-used-data-variable-in-ida",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am reversing Cryptex.exe 1.0 from Eldad.\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/3hjS9.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/3hjS9.png\"/>\n  </a>\n </p>\n <p>\n  There is unknown-data buffer address stored in edx which gets used as parameter for CryptHashData, which will hash 20 Bytes from there. Now I want to find which function actually writes this buffer (edx stores 0019F578 at this point of debugging)\nI don't get smart with [esp+C], because esp should be the last push exc, and counting from there it should be push 0?\n </p>\n <p>\n  What I want to try is setting a breakpoint on .data 0019F578 without break (since it gets used alot by the program in general) and tracing all functions called till the breakpoint ds:CryptHashData. But that doesn't work in IDA. IDA will not recognize other breakpoints with break after I set up this.\nI'm glad to learn new methods about tracing, since it's very important to know.\n  <a href=\"https://i.sstatic.net/MC445.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/MC445.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "225",
    "tags": [
        "breakpoint",
        "tracing"
    ],
    "user": "killertoge",
    "time": "Apr 13, 2020 at 20:14",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Firstly, let's understand what goes into\n  <em>\n   edx\n  </em>\n  .\n  <em>\n   edx\n  </em>\n  contains the first argument passed to this function which is a pointer the data that we want to compute its MD5 hash. Looking at images, stack frame of the current function is like:\n </p>\n <pre><code>esp + 0x0 --> | local_var_8 |\nesp + 0x4 --> | local_var_4 |\nesp + 0x8 --> | return_addr |\nesp + 0xC --> |    arg_0    |\n</code></pre>\n <p>\n  At the beginning of the function,\n  <em>\n   sub esp, 8\n  </em>\n  reserves 8 bytes on the stack for two local variables. Then you have the return address and arguments coming afterward. All those pushes that are used to pass arguments to\n  <em>\n   CryptCreateHash\n  </em>\n  will be poped back by that function before it returns to the current function, so the previous position of the stack will be preserved.\n </p>\n <p>\n  I believe true reverse engineering consists of understanding the code, not blind trace. Instead of tracing a value on the stack, it is better to look for the caller of this function, understand who has called this function and wherein the code is this function called, and then what is the parameter sent to this function.\n </p>\n <p>\n  Answering the second part of your question, you can customize breakpoints in IDA using some Python skills. You can create a conditional breakpoint for example and disable the break action as you have done. Whenever you hit this breakpoint, you can log the content of\n  <em>\n   eip\n  </em>\n  to find which instruction or wherein the code is this data accessed. If it is before this function, just log the data in, if it is after, you can enable break action again.\n </p>\n <p>\n  For that you need to consider some matters:\n </p>\n <ol>\n  <li>\n   You have to practice IDA python APIs. e.g. for getting a register content you have to call GetRegValue.\n   <a href=\"https://www.hex-rays.com/products/ida/debugger/scriptable/\" rel=\"nofollow noreferrer\">\n    This\n   </a>\n   will help you to begin.\n   <a href=\"https://www.hex-rays.com/products/ida/support/idapython_docs/\" rel=\"nofollow noreferrer\">\n    Here\n   </a>\n   also you can find the list of all IDA python APIs.\n  </li>\n  <li>\n   If you set a breakpoint on a data that is passed to a lot of windows APIs such as crypt APIs, you will hit this breakpoint within a lot of library codes. Always look at the address space and if you are not inside your main program, skip them to avoid reversing library functions that are irrelevant to your main program.\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Cih2001",
            "time": "Apr 14, 2020 at 10:24",
            "is_accepted": true,
            "comments": [
                {
                    "user": "killertoge",
                    "text": "<span class=\"comment-copy\">I was not familiar without the ebp variant. And regarding to you its the calling convention right? That would make sense, and I could also find this in the caller function anyways. If I want to find caller I only see cryptex.exe(current function), kernel32.dll ntdll.dll ntdll.dll in the Call Stack. I thought I would see another crypex.exe to see the caller but don't. Thank you for your help!</span>",
                    "time": null
                }
            ]
        }
    ]
}