{
    "title": "IDA and Ghidra Reversing",
    "link": "https://reverseengineering.stackexchange.com/questions/24691/ida-and-ghidra-reversing",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have several questions about IDA and Ghidra (for MIPS and ARM):\n </p>\n <ol>\n  <li>\n   <p>\n    Is there any option to load an executable file with all its libraries? \nFor example, I want to enter inside a function which its implementation is in a library, and not to open a new instance of IDA or add the library in a new tab inside Ghidra\n   </p>\n  </li>\n  <li>\n   <p>\n    Is there any good tutorial on reversing c++ for MIPS/ARM?\n   </p>\n  </li>\n  <li>\n   <p>\n    Are there any plugin you recommend for Ghidra or IDA for MIPS/ARM ? all that I see is for x86  (not plugin for analyzing malware, plugins for analyzing firmware)\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "c++",
        "ghidra",
        "ida-plugin"
    ],
    "user": "Logan",
    "time": "Apr 17, 2020 at 22:44",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I can only properly answer your first question:\n </p>\n <p>\n  I think this is fundamentally impossible to achieve with IDA, but in Ghidra it works and is fairly easy to use (though a bit hard to find)\n </p>\n <p>\n  If your \"firmware\" is a filesystem that you can unpack, you can automatically load the libraries by:\n </p>\n <ol>\n  <li>\n   Opening the regular\n   <code>\n    Import File...\n   </code>\n   dialog\n  </li>\n  <li>\n   Clicking\n   <code>\n    Options\n   </code>\n   inside that dialog\n  </li>\n  <li>\n   Tick\n   <code>\n    Load External Libraries\n   </code>\n  </li>\n  <li>\n   [Optional] Click\n   <code>\n    Edit Paths\n   </code>\n   to select the paths that will be searched for your libraries\n  </li>\n  <li>\n   Confirm all the dialogs with\n   <code>\n    Ok\n   </code>\n   .\n  </li>\n </ol>\n <p>\n  Ghidra will now import your binary and all libraries needed by it. They will automatically be linked, which means that your imports in your main binary are resolved and you can jump to the library code via the GUI when looking at an external function call in your main binary.\n </p>\n <p>\n  I am not sure if this violates your \"not to open a new instance of IDA or add the library in a new tab inside Ghidra\" requirement, because this will open a new tab, in your Codebrowser's\n  <code>\n   Listing\n  </code>\n  window.\n </p>\n</div>\n</body></html>",
            "votes": "6",
            "user": "Florian Magin",
            "time": "Apr 12, 2020 at 14:52",
            "is_accepted": false,
            "comments": [
                {
                    "user": "multithr3at3d",
                    "text": "<span class=\"comment-copy\">Can this be done after a binary is imported?</span>",
                    "time": null
                },
                {
                    "user": "Logan",
                    "text": "<span class=\"comment-copy\">I have tried what you say and from some reason it load additional libraries but not all what my binary needs.( i gave the ghidra a path to directory contains all libs from firmware)</span>",
                    "time": null
                },
                {
                    "user": "Florian Magin",
                    "text": "<span class=\"comment-copy\">@multithr3at3d I don't think you can do it that easily, but you can definitely add them manually via <code>Windows -&gt; External Programs</code> and then run the <code>FixupELFExternalSymbolsScript</code> Script. With some scripting it shouldn't be that hard to automate searching for the library names in some path, adding the found ones, linking them like the <code>External Programs</code> window and then running <code>FixupELFExternalSymbolsScript</code></span>",
                    "time": null
                },
                {
                    "user": "Florian Magin",
                    "text": "<span class=\"comment-copy\">@Daniel Dan Not sure what the issue is with that. Does it work if you add them manually and run the <code>FixupELFExternalSymbolsScript</code>?</span>",
                    "time": null
                },
                {
                    "user": "Logan",
                    "text": "<span class=\"comment-copy\">@FlorianMagin . If i try to add them manually i get the following error: \"IllegalArgumentException - name is invalid:  java.lang.IllegalArgumentException: name is invalid:\" . Do you have ideas ?</span>",
                    "time": null
                }
            ]
        }
    ]
}