{
    "title": "Where and how is variable entanglement obfuscation used?",
    "link": "https://reverseengineering.stackexchange.com/questions/2489/where-and-how-is-variable-entanglement-obfuscation-used",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I don't know the exact name of this obfuscation, so I call it\n  <strong>\n   variable entanglement\n  </strong>\n  for now.\n </p>\n <p>\n  I already saw this principle in a few binaries but I never found a complete description of what was possible and what was not.\n </p>\n <p>\n  The idea is to confuse the reverser by mixing two values together and performing the operations on the mixed values. Once all operations have been performed, one can recompose the results by some simple operations. For example, a naive example could be:\n </p>\n <pre><code>int foo (int a, int b) {\n  long long x = 0;\n  // Initial entanglement\n  x = (a << 32) | b;\n\n  // Performing operations on both variables\n  x += (12 << 32) & 72;\n  ...\n\n  // Final desentanglement\n  a = (int) (x >> 32);\n  b = (int) (((int) -1) & x);\n} \n</code></pre>\n <p>\n  Of course, here, we mix everything in one variable (and I did not take care of\n  <em>\n   details\n  </em>\n  such as the overflows). But, you can imagine way more complex initial entanglement where you re-split everything in two variables (or more),\n  <em>\n   e.g.\n  </em>\n  by xoring them together.\n </p>\n <p>\n  Operations such as addition, multiplication, ... have to be redefined for this new format, so it can mislead the reverser.\n </p>\n <p>\n  My question now, does anyone know about different such schema of variable entanglement (the one I gave is really basic) ? And, maybe, can give pointers or publication about it ?\n </p>\n</div>\n</body></html>",
    "votes": "8",
    "answers": 1,
    "views": "367",
    "tags": [
        "obfuscation",
        "whitebox-crypto"
    ],
    "user": "perror",
    "time": "Jul 18, 2013 at 1:03",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Is this actual source or is this something a decompiler spat out (or you created based on disassembly)?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "newgre",
            "text": "<html><body><span class=\"comment-copy\">\n X is uninitialized. Shouldn't it be | b instead of & b? Also, long is not necessarily double the size of int. Why not post a working example? That might make it easier to give a meaningful answer to your question.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "perror",
            "text": "<html><body><span class=\"comment-copy\">\n In fact, this is pure\n <i>\n  junk\n </i>\n . It is just here to illustrate the idea. It won't even compile. I have some examples in assembly (x86+SSE), but they are not really explicit and easy to understand.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "perror",
            "text": "<html><body><span class=\"comment-copy\">\n @newgre: Thanks noticing all these errors (sorry to not have fixed this at first, I was busy doing something else...).\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Antimony",
            "text": "<html><body><span class=\"comment-copy\">\n I don't know about publications that explore this technique specifically, but JBCO does a weak form of this (\n <a href=\"http://www.sable.mcgill.ca/publications/papers/2007-1/batchelder-cc2007.pdf\" rel=\"nofollow noreferrer\">\n  sable.mcgill.ca/publications/papers/2007-1/…\n </a>\n ).\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm not sure whether this is along the lines you're looking for (and quite possibly you've already figured out all of this and more), but here's a crude formalization and then some implementation thoughts.  Conceptually, this tries to separate what it\n  <em>\n   means\n  </em>\n  to entangle several values from how entangled values are\n  <em>\n   represented\n  </em>\n  .\n </p>\n <h3>\n  Formalization\n </h3>\n <p>\n  Conceptually, entangled values can be thought of as\n  <em>\n   aggregates\n  </em>\n  where the different components retain their values, don't interfere with each other, and can be independently extracted.  A convenient way to think of such aggregates is as\n  <em>\n   n\n  </em>\n  -tuples of values; for simplicity I assume\n  <em>\n   n\n  </em>\n  = 2 here.  Also, I assume that we have operations to construct tuples from a collection of values, and to extract the component values from a tuple.\n </p>\n <p>\n  We now need to be able to carry out operations on tuples.\nFor this, for each operation\n  <strong>\n   op\n  </strong>\n  in the original program we now have 2 versions:\n  <strong>\n   op1\n  </strong>\n  , which operates on the first component of a 2-tuple, and\n  <strong>\n   op2\n  </strong>\n  , which operates on the second component:\n </p>\n <blockquote>\n  <a1,b1>\n  <b>\n   op1\n  </b>\n  <a2,b2> = if (b1 == b2) then <(a1\n  <b>\n   op\n  </b>\n  a2), b1> else undefined\n  \n\n  <a1,b1>\n  <b>\n   op2\n  </b>\n  <a2,b2> = if (a1 == a2) then <a1, (b1\n  <b>\n   op\n  </b>\n  b2)> else undefined\n  \n\n </blockquote>\n <p>\n  Finally (and this is where the obfuscation comes in), we need a way to encode tuples as values and decode values into tuples.  If the set of values is S, then we need two functions\n  <strong>\n   enc\n  </strong>\n  and\n  <strong>\n   dec\n  </strong>\n  that must be inverses of each other:\n </p>\n <blockquote>\n  <b>\n   enc\n  </b>\n  : S x S --> S  (encode pairs of values as a single entangled value)\n  \n\n  <b>\n   dec\n  </b>\n  : S --> S x S  (decode an entangled value into its components)\n  \n\n  <p>\n   <b>\n    enc\n   </b>\n   (\n   <b>\n    dec\n   </b>\n   (x)) = x   for all x\n   \n\n   <b>\n    dec\n   </b>\n   (\n   <b>\n    enc\n   </b>\n   (x)) = x   for all x\n  </p>\n </blockquote>\n <p>\n  Examples:\n </p>\n <ul>\n  <li>\n   <p>\n    <strong>\n     enc\n    </strong>\n    takes a pair  of 16-bit values and embeds them into a 32-bit value w such that x occupies the low 16 bits of w and y occupies the high 16 bits of w;\n    <strong>\n     dec\n    </strong>\n    takes a 32-bit value and decodes them into a pair  where x is the low 16 bits and y is the high 16 bits.\n   </p>\n  </li>\n  <li>\n   <p>\n    <strong>\n     enc\n    </strong>\n    takes a pair <x,y> of 16 bit values and embeds them into a 32-bit word w such that x occupies the even-numbered bit positions of w and y occupies the odd-numbered bit positions of w (i.e., their bits are interlaced);\n    <strong>\n     dec\n    </strong>\n    takes a 32-bit value w and decodes them into a pair <x,y> such that x consists of the even-numbered bits of w and y consists of the odd-numbered bits of w.\n   </p>\n  </li>\n </ul>\n <h3>\n  Implementation considerations\n </h3>\n <p>\n  From an implementation perspective, we'd like to be able to perform operations directly on encoded representations of values.  For this, corresponding to each of the operations\n  <strong>\n   op1\n  </strong>\n  and\n  <strong>\n   op2\n  </strong>\n  above, we need to define \"encoded\" versions\n  <b>\n   op1*\n  </b>\n  and\n  <b>\n   op2*\n  </b>\n  that must satisfy the following soundness criterion:\n </p>\n <blockquote>\n  <p>\n   for all x1, x2, and y: x1\n   <b>\n    op1*\n   </b>\n   x2 = y  IFF\n   <b>\n    enc\n   </b>\n   (\n   <b>\n    dec\n   </b>\n   (x1)\n   <b>\n    op1\n   </b>\n   <b>\n    dec\n   </b>\n   (x2) ) = y\n  </p>\n </blockquote>\n <p>\n  and similarly for\n  <b>\n   op2*\n  </b>\n  .\n </p>\n <p>\n  A lot of details are omitted (mostly easy enough to work out), and this basic approach could be prettified in various ways, but I don't know whether this is along the lines you were asking for and also whether maybe this is pretty straightforward and you've already worked it all out for yourself.  Anyway, I hope this is useful.\n </p>\n <hr/>\n <p>\n  From @perror's comment (below) it seems clear that the formalization above is not powerful enough to capture the obfuscation he has in mind (though it might be possible to get a little mileage from generalizing the encoding/decoding functions\n  <strong>\n   enc\n  </strong>\n  and\n  <strong>\n   dec\n  </strong>\n  ).\n </p>\n <p>\n  I had forgotten about this paper, which discusses a transformation that seems relevant (see Sec. 6.1, \"Split variables\"):\n </p>\n <blockquote>\n  <p>\n   Christian Collberg, Clark Thomborson, and Douglas Low. Breaking Abstractions and Unstructuring Data Structures.\n   <em>\n    IEEE International Conference on Computer Languages\n   </em>\n   (ICCL'98), May 1998. (\n   <a href=\"http://www.cs.arizona.edu/~collberg/content/research/papers/collberg98breaking.pdf\" rel=\"nofollow\">\n    link\n   </a>\n   )\n  </p>\n </blockquote>\n</div>\n</body></html>",
            "votes": "8",
            "user": "debray",
            "time": "Jul 18, 2013 at 13:41",
            "is_accepted": true,
            "comments": [
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">I think you perfectly defined the basic operators and formalized the context of it. But, the example I gave was probably too naive and, thus, a bit misleading. To give maybe a better example, what if you have <code>x=a^b</code> and <code>y=a^(~b)</code> and try to apply some operations on <code>a</code> and <code>b</code> through operations on <code>x</code> and <code>y</code>. In this schema, the word <i>entanglement</i> is a bit more obvious I guess. I will try to dig a bit this schema and propose a full example. Finally, it is totally unrelated but are you Saumya Debray ? (I read several of his papers and I am a big fan! :))</span>",
                    "time": null
                },
                {
                    "user": "debray",
                    "text": "<span class=\"comment-copy\">I think I understand the subtleties of the obfuscation a little better now -- thanks!  I'll need to go think about that some more.  (On an unrelated note, my first name is indeed Saumya. :-)</span>",
                    "time": null
                },
                {
                    "user": "debray",
                    "text": "<span class=\"comment-copy\">@perror : the formalization I gave doesn't seem powerful enough to capture what you have in mind.  But meanwhile I remembered a paper by Collberg et al. that describes a transformation that may be relevant: please see the edited response above.</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">Yes, this is exactly what I was looking for ! Thanks ! So, it is called \"<i>split variables</i>\".</span>",
                    "time": null
                }
            ]
        }
    ]
}