{
    "title": "What to do with a text file of disassembly code and binaries?",
    "link": "https://reverseengineering.stackexchange.com/questions/24929/what-to-do-with-a-text-file-of-disassembly-code-and-binaries",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am fairly new to software reverse engineering and I'd like to know how proceed with analyzing a   program if I have a text file of disassembly code and a bin file of binary data. I understand assembly language. But, is there a better way than just going through the text file, instruction by instruction, trying to figure out what the program is doing?  I don't have IDA Pro but I have Ghidra. Would I use Ghidra somehow? Or would I just use a debugger like x64dbg?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "318",
    "tags": [
        "disassembly",
        "assembly",
        "binary-analysis",
        "disassemblers"
    ],
    "user": "DylanG1991",
    "time": "May 5, 2020 at 23:30",
    "comments": [
        {
            "user": "Yotamz",
            "text": "<html><body><span class=\"comment-copy\">\n Can you tell what created this file? or what is its format?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Hi and welcome to RE.SE. Typically tools like IDA or Ghidra would use a sort of database which cross-references contents from the binary in the disassembly. So in a sense by having a textual respresentation here and a binary there you have lost those cross-references and \"dumbed down\" the disassembly. So I'd suggest you start over and use the tool (e.g. Ghidra) for the purpose it was created for. If you\n <i>\n  just\n </i>\n want a \"dumbed down\" disassembly,\n <code>\n  objdump\n </code>\n can do that for you.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "DylanG1991",
            "text": "<html><body><span class=\"comment-copy\">\n So I guess I should mention that the text file contains disassembly code for an obfuscation algorithm and the bin file contains obfuscated binary data. What I'm trying to do is analyze the obfuscation algorithm used and try and \"de-obfuscate\" it.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}