{
    "title": "Extracting strings from Go binaries",
    "link": "https://reverseengineering.stackexchange.com/questions/24999/extracting-strings-from-go-binaries",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Is there an easy way to extract all of the strings from Go binaries that will work cross architecture?\n </p>\n <p>\n  The problem with Go is that strings are stored without a null terminator, so you can't use the \"strings\" command plainly.\n </p>\n <p>\n  I found two solutions so far -\n </p>\n <ul>\n  <li>\n   <p>\n    <a href=\"https://github.com/CarveSystems/gostringsr2\" rel=\"nofollow noreferrer\">\n     gostringsr2\n    </a>\n    - Extracts strings using references to the string section (by using radare2). But this method doesn't work 100% and screws up some strings because there are indirect references, etc...,\n   </p>\n  </li>\n  <li>\n   <p>\n    <a href=\"https://github.com/strazzere/golang_loader_assist/blob/master/golang_loader_assist.py\" rel=\"nofollow noreferrer\">\n     golang_loader_assist\n    </a>\n    - Extracts strings by searching for\n    <code>\n     lea\n    </code>\n    /\n    <code>\n     mov\n    </code>\n    instruction to the string section. But this method only works for x86 architectures.\n   </p>\n  </li>\n </ul>\n <p>\n  Is there a more generic and correct way to extract the strings from Go compiled binaries?\n </p>\n</div>\n</body></html>",
    "votes": "13",
    "answers": 1,
    "views": "3k",
    "tags": [
        "disassembly",
        "binary-analysis",
        "elf",
        "strings",
        "go"
    ],
    "user": "Drxxd",
    "time": "Jun 19, 2023 at 23:31",
    "comments": [
        {
            "user": "hippietrail",
            "text": "<html><body><span class=\"comment-copy\">\n What is Go's native text encoding? For 7-bit ASCII look for runs of bytes >= space and < DEL. For 8-bit extensions to ASCII look for runs of bytes >= space. For UTF-8 there are specific bit patterns to look for in the various bytes of each multibyte character. For UTF-16 you need heuristics. ASCII-compatible runs have interleaves 0 bytes and bytes >= space. Unpaired surrogates are a flag that it's unlikely to be UTF-16 after all. In all cases the fidelity is lower than finding null-terminated strings.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Drxxd",
            "text": "<html><body><span class=\"comment-copy\">\n @hippietrail I think that the native encoding is ASCII, but the problem is that GO saves it strings without null terminator.. So you can find only one huge blob of strings and I want to extract those strings \"as is\" one by one\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "hippietrail",
            "text": "<html><body><span class=\"comment-copy\">\n <a href=\"https://medium.com/rungo/string-data-type-in-go-8af2b639478\" rel=\"nofollow noreferrer\">\n  According to this\n </a>\n , GO uses UTF-8 for strings. If you don't want to have to split up the blobs yourself and strings are not terminated then it seems there is no \"easy way\" until somebody knowing all the architectures writes a unified tool using principles like the tools you mention use. In the meantime you might be able to analyse your binary with Ghidra. Ada Pro can surely do something too. But those are more heavyweight than you seem to be looking for and won't always find every string.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "diff",
            "text": "<html><body><span class=\"comment-copy\">\n You referenced the project\n <code>\n  golang_loader_assist\n </code>\n and it only supporting x86. If you'd like to submit a PR for updating\n <code>\n  is_string_load()\n </code>\n for non-x86 patterns used by golang I'll gladly accept and apply them.  AFAIK, there is no \"easy\" way to do this, which is why I resorted to this method. The calls for strings are preempted by the length, which is important since there is no null byte afterwards.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "ismael_akez",
            "text": "<html><body><span class=\"comment-copy\">\n You have to make a reference with other versions of golang since the opcodes might be different in every version. golang_loader_assist uses those opcodes as a pattern to search for strings.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I just read a good article on the challenges with Go binaries:\n  <a href=\"https://cujo.com/reverse-engineering-go-binaries-with-ghidra/\" rel=\"nofollow noreferrer\">\n   https://cujo.com/reverse-engineering-go-binaries-with-ghidra/\n  </a>\n </p>\n <p>\n  I think this could be classed as a \"cross-architecture solution\" seeing as Ghidra runs under a JVM.\n </p>\n <p>\n  The Ghidra plugins they developed seem to work well. I ran the static and dynamic scripts against the Go binary they used in their Hacktivity2020 conference preso with good results:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/JhsZy.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/JhsZy.png\"/>\n  </a>\n </p>\n <p>\n  I guess malware may be less amenable to analysis, but this is probably a good start.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Mega Tonnage",
            "time": "Jul 18, 2022 at 0:00",
            "is_accepted": false,
            "comments": []
        }
    ]
}