{
    "title": "GDB exited when running library",
    "link": "https://reverseengineering.stackexchange.com/questions/25172/gdb-exited-when-running-library",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm new with gdb and I have spent hours looking for direction but I can't find any.\nI need to analyze an executable to find how this program process the arguments and where the output came from. I have it running on my system, got it working correctly to print some encoded string.\nAfter some days trying gdb, I figure that I need to trace the data inside every function, but I can't pass this function __libc_init where the program alwas exited with code 0235. The last process says\n  <code>\n   __libc_init () from /system/lib/libc.so\n  </code>\n  so i think it's doing something with this external library libc.so. How could I continue the debug process when I hit this type of process? I can't find any reference to understand this.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "70",
    "tags": [
        "gdb",
        "elf",
        "libc"
    ],
    "user": "Sarah Audina",
    "time": "May 31, 2020 at 9:34",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you cannot step inside that function, you’re probably missing debug symbols for the library (check with\n  <code>\n   info shared\n  </code>\n  ). You can try to either install symbols (usually in a package named\n  <code>\n   libc-dbg\n  </code>\n  or similar), or debug on assembly level by using\n  <code>\n   si\n  </code>\n  (step instruction) command.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Igor Skochinsky",
            "time": "Jun 3, 2020 at 19:42",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Sarah Audina",
                    "text": "<span class=\"comment-copy\">this is new for me, i thought that the external library debug symbol not required in this process. for the code itself, i have make sure that the debug symbol is available. i think i'm not interested with the external library's process, so i want to skip to when this library call is finish, and check for output and other values. is it possible?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">If you want to know why it’s exiting in that function, you’ll have to go inside.</span>",
                    "time": null
                },
                {
                    "user": "Sarah Audina",
                    "text": "<span class=\"comment-copy\">ooh so that's how it is. i think gdb is too advanced for now. gonna try analyze the strace and objdump output now before going back here and try your advice. thankyou!</span>",
                    "time": null
                }
            ]
        }
    ]
}