{
    "title": "Reversing Patches (Binary Diffing)",
    "link": "https://reverseengineering.stackexchange.com/questions/2529/reversing-patches-binary-diffing",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Does any of you know of a recent tool to bindiff using ImmunityDebugger?\nI know about BinDiff by Zynamics and PatchDiff for IDA. But I really want a tool like this in ImmDBG. I also know about Radare's bindiffer and the feature in\n  <code>\n   mona.py\n  </code>\n  (but this is more with memory regions).\n </p>\n <p>\n  Now I use a HexEditor and diff using this. Then I'll lookup the offset + base address using Immunity. This is not really feasible any more as I've recently started reversing bigger patches.\n </p>\n <p>\n  (Just to be a complete reference, for Firmware Updates I use Binwalk. And you should too :))\n </p>\n</div>\n</body></html>",
    "votes": "8",
    "answers": 1,
    "views": "1k",
    "tags": [
        "immunity-debugger",
        "patch-reversing",
        "bin-diffing"
    ],
    "user": "Stolas",
    "time": "Sep 30, 2016 at 21:58",
    "comments": [
        {
            "user": "joxeankoret",
            "text": "<html><body><span class=\"comment-copy\">\n I think Immunity Debugger lacks many features available in IDA API being used by both PatchDiff and Zynamics BinDiff. Anyway, you may want to modify PatchDiff to see if it can be accomplished (it's open source).\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "PSS",
            "text": "<html><body><span class=\"comment-copy\">\n What exactly are you trying to achieve? Highlight difference in hex view?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Stolas",
            "text": "<html><body><span class=\"comment-copy\">\n Well I doubt Immunity lacks the features. As how hard can it be to diff? =)  And I want make my diffing patches more productive, for vulnerability research sake.  Now I diff using the hex editor, Find the offset in ImmDbg and find what opcodes have changed. If I can combine the tools into one I'll give it a go.  About the PatchDiff being open source. I might try to write some Imm Plugin myself to get PatchDiffing to the level I want. (but I rather reverse than write code)\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "joxeankoret",
            "text": "<html><body><span class=\"comment-copy\">\n It lacks features, it's for sure: Do you have the prototype of all functions in the binary? How does it find functions in the binary? Does it consider that a function can be partitioned in various small chunks? How are the basic blocks managed? Does a non conditional jump break the code? How good is it finding switch structures? Really, it lacks many information. As for \"how hard can it be to diff\", may be Rolf Rolles is interested in asking that question.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Rolf Rolles",
            "text": "<html><body><span class=\"comment-copy\">\n Stolas, you seem to be unclear on what binary diffing is or how it works.  When we say \"binary diffing\" in the context of BinDiff, DarunGrim, PatchDiff, etc., we are specifically NOT talking about a diff involving the raw bytes of the executable, or using 'diff' on the raw disassembly.  These tools create a graphical disassembled representation of the two binaries, and then compare that.  As such, the quality of the diff tool depends upon the disassembler.  This is why the commentors keep mentioning IDA, and why I keep furrowing my brow at your suggestion of using a hex editor, Meld, or diff.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The answer lays within the comments, read Binary Diffing by Nicolas A. Economou (CoreImpact) 2009 to see why.\n </p>\n <p>\n  Good Binary Diffing is in fact a way harder subject that does a lot more than compare bytes or bits.\n </p>\n <p>\n  Making a Binary Diff with objdump and meld is really not the way to go. Read the CoreImpact document and it will show some of the issues with binary diffing.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Stolas",
            "time": "Sep 6, 2013 at 21:49",
            "is_accepted": true,
            "comments": []
        }
    ]
}