{
    "title": "How to force the loading of a DLL in Windows XP at a particular address",
    "link": "https://reverseengineering.stackexchange.com/questions/2536/how-to-force-the-loading-of-a-dll-in-windows-xp-at-a-particular-address",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I need to run a debugger on an application and analyze its startup, however the main DLL gets loaded at different addresses every time, which makes my job much harder. How can I disable ASLR completely, or at least force one DLL to be loaded at a particular, always constant address?\n </p>\n</div>\n</body></html>",
    "votes": "8",
    "answers": 3,
    "views": "2k",
    "tags": [
        "windows",
        "dll"
    ],
    "user": "f428329",
    "time": "Jul 26, 2013 at 14:38",
    "comments": [
        {
            "user": "0xdabbad00",
            "text": "<html><body><span class=\"comment-copy\">\n Duplicate post of\n <a href=\"http://stackoverflow.com/questions/9560993/how-do-you-disable-aslr-address-space-layout-randomization-on-windows-7-x64\" title=\"how do you disable aslr address space layout randomization on windows 7 x64\">\n  stackoverflow.com/questions/9560993/…\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I believe on XP if you strip the relocation table from the DLL (Or null out the relocation tables RVA and size in the data directory), then the Windows loader will try to load the DLL at its preferred base address (The ImageBase in the Optional Header) as it can no longer be relocated.\n </p>\n <p>\n  So long as the memory at the preferred base address is available this should work. Later versions of Windows may prevent this depending on loader options AFAIK.\n </p>\n <p>\n  A handy tool to edit PE files is the freely available\n  <a href=\"http://www.ntcore.com/exsuite.php\">\n   CFF Explorer\n  </a>\n  .\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "QAZ",
            "time": "Jul 26, 2013 at 14:42",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ditmar Wendt",
                    "text": "<span class=\"comment-copy\">CFF Explorer is the best, agreed.</span>",
                    "time": null
                },
                {
                    "user": "cubuspl42",
                    "text": "<span class=\"comment-copy\">You say \"if you strip the relocation table [...] then the Windows loader will try to load the DLL at its preferred base address\". So where does it try to load it otherwise? Isn't it the point, that Windows loads a DLL at its preferred base address, <i>unless</i> its taken? I'm talking about non-ASLR case.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  To actually\n  <em>\n   force\n  </em>\n  a DLL to load at a particular address without making structural changes to it first, you need to allocate all of the rest of available memory first, and of course, ensure that the target location isn't in use already.\nTo disable ASLR for any given file, you have to set the IMAGE_FILE_RELOCS_STRIPPED flag in the Characteristics field of the COFF header.  Removing the relocation table won't do it, if the file opted into ASLR.  Windows will still move it around, it just won't relocate any of the data.\nAs far as I know, you can't turn off ASLR globally.\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "peter ferrie",
            "time": "Jul 26, 2013 at 21:52",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  What the other posters are talking about are general methods for making a DLL always load at a particular address.\n </p>\n <p>\n  For what you want to do --\n  <em>\n   which is ensure that the absolute addresses are always relevant, vs module + offset\n  </em>\n  -- is straightforward to do.\n </p>\n <p>\n  If you can load the binary on a Windows XP system, it is completely unaware of ASLR.\n </p>\n <p>\n  Alternately, you can completely disable ASLR, which will ensure that modules will always be loaded at their preferred address.  This setting is controlled via\n  <code>\n   HKLM\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Memory Management\\MoveImages\n  </code>\n  .\n </p>\n <p>\n  However, if the preferred address is unavailable, Windows will load it somewhere else.  If you run into this issue, I recommend modifying the preferred base address manually.  A good hex editor will allow you to do this.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "perror",
            "time": "Apr 22, 2014 at 12:27",
            "is_accepted": false,
            "comments": []
        }
    ]
}