{
    "title": "How can you dump the unpacked version of a packed library/plugin from memory on macOS?",
    "link": "https://reverseengineering.stackexchange.com/questions/25360/how-can-you-dump-the-unpacked-version-of-a-packed-library-plugin-from-memory-on",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm dealing with a custom-upx packed library that I'm trying to unpack. System is macOS.\n </p>\n <p>\n  Given it's a library/plugin, it doesn't have a standalone entrypoint. I ran it through a disassembler but wasn't able to find obvious hints where the OEP might be. On top of that, it also uses anti-debugging measurements through ptrace to make it even harder.\n </p>\n <p>\n  Next I wrote my own loader for it including callbacks it wants, and managed to get it to load, then used lldb save-core to dump the entire memory (of my loader+lib) into a 3GB-ish file.\n </p>\n <p>\n  Here is where I am stuck: Memory analysis and forensics doesn't look like its popular on mac with most tools outdated and no longer working. I don't know how to approach this going forward and if it's even possible to restore the unpacked variant from this dump.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "251",
    "tags": [
        "memory-dump",
        "upx"
    ],
    "user": "memboi3",
    "time": "Jun 21, 2020 at 3:16",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Basically you need to find the Mach-O header of the module in memory and dump the segments referred by it.\n </p>\n <p>\n  Here’s a tool which is not specifically for macOS, but should not be too difficult to modify since it already has the code to handle the Mach-O format:\n </p>\n <p>\n  <a href=\"https://github.com/stefanesser/dumpdecrypted\" rel=\"nofollow noreferrer\">\n   https://github.com/stefanesser/dumpdecrypted\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Jun 21, 2020 at 10:56",
            "is_accepted": false,
            "comments": []
        }
    ]
}