{
    "title": "Can I reverse engineer a DLL file and add SEH or some error handing codes to it?",
    "link": "https://reverseengineering.stackexchange.com/questions/25458/can-i-reverse-engineer-a-dll-file-and-add-seh-or-some-error-handing-codes-to-it",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am using some DLL files in my Java application using JNI library.\n </p>\n <p>\n  The dlls are not written by me and I do not have access to their source codes. They are so buggy and throw lots of exceptions. Needless to say that they are making my java application unstable since unhandled exceptions in native side crash the java application.\n </p>\n <p>\n  I was thinking to reverse engineer the dll files and add some\n  <code>\n   try\n  </code>\n  and\n  <code>\n   catch\n  </code>\n  clause there or maybe just find the culprit line and add some prevention there.\n </p>\n <p>\n  The exceptions are mainly due to dereferencing a null pointer which I believe I can fix them by a couple of instructions (\n  <code>\n   cmp\n  </code>\n  and\n  <code>\n   jmp\n  </code>\n  )\n </p>\n <p>\n  So what I am trying to ask are as follow:\n </p>\n <ol>\n  <li>\n   Is it practically doable?\n  </li>\n  <li>\n   Is IDA the right tool to do so?\n  </li>\n </ol>\n <p>\n  Edit :\nAnother solution that I am guessing could fix the problem is to write a new native class and wrap all native functions that i am using in the new functions with error handling. But I have a lot of native functions and this solution could be tedious and cumbersome. So, still, reverse engineering DLLs is my number one solution. Comments are really welcome. Please share your views.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "283",
    "tags": [
        "ida",
        "dll",
        "patch-reversing",
        "seh"
    ],
    "user": "Iman Rosstin",
    "time": "Jul 9, 2020 at 14:37",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Actually what you want could easily be done by writing your own DLL, simply making sure that the respective functions follow the same calling conventions and have the same prototypes (which can be deduced from the Java side of things) use\n <i>\n  that\n </i>\n own DLL and make that load the third-party DLL and pass all calls through - but guarded. However, be warned that this will merely hide the problems, not fix them (neither would your desired solution, though).\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n The number of native functions correlates obviously with the details of your JNI interface. And that alone should make it relatively straightforward to come up with all necessary prototypes to wrap. No reverse engineering in the stricter sense required. If you want to patch the other DLL in-memory, that's also possible and\n <i>\n  that\n </i>\n would of course require some RCE ... or at least debugging at assembly level.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Iman Rosstin",
            "text": "<html><body><span class=\"comment-copy\">\n @0xC0000022L Thanks, I think I should go with writing a new wrapper dll. And I am going to take a look at RCE, as I don’t know what it is :)\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}