{
    "title": "Identifying the nature and contents of a file",
    "link": "https://reverseengineering.stackexchange.com/questions/25592/identifying-the-nature-and-contents-of-a-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  As a preface,\n  <strong>\n   I do not have any experience in reverse engineering\n  </strong>\n  . I am an application developer, so this field is way out of my area of expertise. My end goal is to create a web page out of this information but this is the first hurdle I faced: getting the required data in the first place.\n </p>\n <p>\n  I am currently trying to identify the nature of a file that I have suspicions might be encrypted and/or compressed (I'm still trying to learn the tell-tales of a file being encrypted/compressed). Since this is way above what I can do at the moment, it would be great if someone can help out or at least provide some guidance.\n </p>\n <p>\n  This is an example file (do let me know if you'd like some more examples):\n </p>\n <p>\n  <a href=\"https://drive.google.com/file/d/1vwt4G55E-TaGvuWM86L6S-7Sbd2o0gOp/view?usp=sharing\" rel=\"nofollow noreferrer\">\n   https://drive.google.com/file/d/1vwt4G55E-TaGvuWM86L6S-7Sbd2o0gOp/view?usp=sharing\n  </a>\n </p>\n <p>\n  So far, here's what I know and attempted:\n </p>\n <ul>\n  <li>\n   File is most likely a JSON or CSV (not 100% sure, but all the other unencrypted metadata files are JSON/CSV format)\n  </li>\n  <li>\n   File has a lot of repeated sets of binary\n   <code>\n    ef\n   </code>\n   <code>\n    bf\n   </code>\n   <code>\n    bd\n   </code>\n   , which I'm assuming are just paddings or an attempt to obfuscate?\n  </li>\n  <li>\n   Most of the corresponding hexes do not really translate to a readable set of standard encodings such as UTF-8\n  </li>\n </ul>\n <p>\n  Any help/guidance would be appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "1k",
    "tags": [
        "binary-analysis",
        "file-format"
    ],
    "user": "unnamed-pizza",
    "time": "Aug 2, 2020 at 11:30",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n Where is the file coming from? Do you have software which reads or writes it?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Bill B",
            "text": "<html><body><span class=\"comment-copy\">\n Note that 0xefbfbd is the UTF-8 \"Replacement Character\".  So the repeated character could be an intentional part of the format (some kind of delimiter or tag?), or it could be evidence of some kind of error or data corruption. See\n <a href=\"https://en.wikipedia.org/wiki/Specials_(Unicode_block)#Replacement_character\" rel=\"nofollow noreferrer\">\n  en.wikipedia.org/wiki/…\n </a>\n for more info.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  When given an unknown file there are several things you can do:\n </p>\n <ol>\n  <li>\n   <p>\n    Identify if the file is a binary format (raw bytes) or a text format. Any hex/text editor should be enough for that purpose.\n   </p>\n  </li>\n  <li>\n   <p>\n    If the file is Binary - it could have text strings inside, which could help understand the nature of the file.  In your case, no text strings appear in the file.\n   </p>\n  </li>\n  <li>\n   <p>\n    Some binary files have \"magic values\" - identifiers that help to understand which file format it is. for example - the 4 first bytes in\n    <code>\n     ELF\n    </code>\n    file format will be always\n    <code>\n     .ELF\n    </code>\n    . In your case, the file starts with\n    <code>\n     CE A3 EF BF\n    </code>\n    which doesn't correspond to any known format.\n   </p>\n  </li>\n  <li>\n   <p>\n    Next step will be to use binary tools like\n    <a href=\"https://github.com/ReFirmLabs/binwalk\" rel=\"nofollow noreferrer\">\n     binwalk\n    </a>\n    to identify any compressed/internal files/objects. In this case, it yields nothing.\n   </p>\n  </li>\n  <li>\n   <p>\n    Next step will be to calculate the entropy of the file. It could be done by\n    <code>\n     binwalk -E <file>\n    </code>\n    . in this case, it yields 0.52 - the higher the entropy it, the higher chances the file is encrypted/obfuscated. Here, it looks like the entropy is not high, meaning the file is not encrypted/obfuscated.\n   </p>\n  </li>\n </ol>\n <p>\n  So overall it looks like it's just a custom binary file format. In order to continue investigating, you need to understand which program is using the file - and in what purpose, and continue with a reverse engineering process, usually based on static disassembler like\n  <code>\n   IDA PRO\n  </code>\n  or the free\n  <code>\n   Ghidra\n  </code>\n  .\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "macro_controller",
            "time": "Aug 2, 2020 at 12:31",
            "is_accepted": false,
            "comments": [
                {
                    "user": "unnamed-pizza",
                    "text": "<span class=\"comment-copy\">Thank you very much for the detailed answer! I'm quite relieved it's not either compressed or encrypted based on what you mentioned. For now I'll try to find where the entrypoint is for reading all these files and update this thread accordingly.</span>",
                    "time": null
                }
            ]
        }
    ]
}