{
    "title": "cheap BGA x-ray machine?",
    "link": "https://reverseengineering.stackexchange.com/questions/25602/cheap-bga-x-ray-machine",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I want to look under a BGA chip and map JTAG pins to traces where I can attach a JTAGulator. Is there some version of a BGA x-ray that isn't thousands of $'s?\n </p>\n <p>\n  Here's a picture of the BGA's. Would it be easier to build a breakout connector to insert between this and main board?\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/dDocy.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/dDocy.jpg\"/>\n  </a>\n </p>\n <p>\n  If I desoldered them, maybe I could stick them in a socket and read them directly?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "100",
    "tags": [
        "jtag"
    ],
    "user": "batflaps",
    "time": "Aug 6, 2020 at 18:50",
    "comments": [
        {
            "user": "multithr3at3d",
            "text": "<html><body><span class=\"comment-copy\">\n Desolder the chip. It's only expensive if you mess it up.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "batflaps",
            "text": "<html><body><span class=\"comment-copy\">\n I used to do a lot of swapping BGA's, what is a good hot air station nowadays for this?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "multithr3at3d",
            "text": "<html><body><span class=\"comment-copy\">\n Not sure what type of chips those are; I didn't find anything searching but it's likely I misread the numbers. I'm guessing RAM since there's two of them? But I could be wrong. If they were eMMC, there are sockets you can buy to read them, or breakout the pins manually to a dummy card. Not sure, there are some fairly cheap kits online that seem alright.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "batflaps",
            "text": "<html><body><span class=\"comment-copy\">\n The PCB stencil says Flash Board. The top number is 3000P0ZBQ0, the second row number is A5537314 and row 3 is Z5532077A. I couldn't find an exact datasheet, though I found one \"sorta\" similar for a NumonyxTM StrataFlash Embedded Memory (P30), don't know if Intel would collaborate with them? I was thinking about an infrared oven to pull them, vs. a hot air station.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}