{
    "title": "Is there a technique that would allow me to make an OPEN SOURCE driver legally in Europe",
    "link": "https://reverseengineering.stackexchange.com/questions/25661/is-there-a-technique-that-would-allow-me-to-make-an-open-source-driver-legally-i",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The driver provided by the phone manufacturer doesn't expose both of my front cameras to third party apps and doesn't allow any third party app to record 4K video, so I think that interoperability is an acceptable reason to do so. But it is said that one is not allowed to publish the source code, then.\n </p>\n <p>\n  Does a reverse engineering technique exist, that would allow me to make an OPEN SOURCE driver for built-in phone cameras legally in Europe?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "74",
    "tags": [
        "law",
        "interoperability"
    ],
    "user": "Martin",
    "time": "Aug 12, 2020 at 8:15",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Hi and welcome to RE.SE. You'll hardly find a lawyer here. I suppose both reverse engineers and lawyers alike have too much to do to dabble in the other domain. It'd be like winning the lottery for some lawyer to dabble in RCE\n <i>\n  and\n </i>\n be literate in law\n <i>\n  and\n </i>\n be literate in law of the jurisdiction you're asking about\n <i>\n  and\n </i>\n hang out here. That said: to my knowledge you have a lot of leeway when it comes to RCE and interop within the EU. However, interop precludes creation of a functional clone of your target. In any case you should consult a lawyer for your specific jurisdiction 😉\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Martin",
            "text": "<html><body><span class=\"comment-copy\">\n Thank you for info.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n It's not a driver, but consider the\n <i>\n  old\n </i>\n .doc file format (or also .xls), i.e. not the XML-based ones. These were reverse-engineered (\n <a href=\"https://en.wikipedia.org/wiki/Clean_room_design\" rel=\"nofollow noreferrer\">\n  clean room RCE\n </a>\n , though) and there is evidently no issue that LibreOffice, OpenOffice and other programs providing the ability to read/write those formats are FLOSS. Although - and again IANAL - this is circumstantial, it\n <i>\n  suggests\n </i>\n that what you want to do is allowed. The Noveau drivers for Linux would be another such example.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "peter ferrie",
            "text": "<html><body><span class=\"comment-copy\">\n I’m voting to close this question because it's a legal question, not a reverse-engineering question.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}