{
    "title": "Compare ELF files using Ghidra+Bindiff based on dwarf debug info",
    "link": "https://reverseengineering.stackexchange.com/questions/25803/compare-elf-files-using-ghidrabindiff-based-on-dwarf-debug-info",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  So this is a question not strictly about reverse engineering, but since there are many people using Ghidra and Bindiff here I'll try asking anyway.\n </p>\n <p>\n  I have an embedded ARM cortex-M C++ project and I want to compare the generated ELF file for two different compilers.\n </p>\n <p>\n  I used these instructions for exported data from Ghidra to Bindiff:\n  <a href=\"https://reverseengineering.stackexchange.com/a/24636/34300\">\n   https://reverseengineering.stackexchange.com/a/24636/34300\n  </a>\n </p>\n <p>\n  I built the ELF files with debuginfo. I was hoping that Ghidra and Bindiff would use the debuginfo for identifying functions, but it looks like that's not the case. For roughly 100 out of 700 functions the tools were not able to match the old and new functions.\n </p>\n <p>\n  I did some experiments on my own where I wrote some simple implementations for strcat and strcpy and then switched names, but then Ghidra and Bindiff was able to see that the assembly has changed, i.e. it did not just try to match functions based on the content. So it's not the case that Ghidra + Bindiff always ignores the function names.\n  <a href=\"https://i.sstatic.net/CihTC.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/CihTC.png\"/>\n  </a>\n </p>\n <p>\n  Is what I'm seeing the expected behavior? That Bindiff does uses its own heuristics rather than trusting the debuginfo when finding functions for comparisons?\n </p>\n <p>\n  If so: Is there a way to force Ghidra and Bindiff to trust the dwarf information when finding functions?\n </p>\n <hr/>\n <p>\n  <strong>\n   Update\n  </strong>\n  : The Bindiff manual lists a number of algorithms that are used for function matching. There is a configuration files .bindiff/bindiff.xml where you can modify the confidence levels between 0.0 and 1.0.\nIt looks like name hash matching is what I want and that I probably want to lower confidence in the other algorithms.\n </p>\n <p>\n  Though I guess just looking at each function in isolation is kind of naive given that compilers can change their inline choices between releases:\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "563",
    "tags": [
        "ghidra",
        "bin-diffing",
        "tool-bindiff"
    ],
    "user": "Daniel Näslund",
    "time": "Sep 3, 2020 at 6:43",
    "comments": [],
    "answers_data": []
}