{
    "title": "are address for instructions specified during compilation?",
    "link": "https://reverseengineering.stackexchange.com/questions/25811/are-address-for-instructions-specified-during-compilation",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  when following certain youtube tutorials, the address in memory for the instructions are same in my machine and the youtuber's machine. How is that possible? Are instructions provided with memory address during compilation? If so then, there are only limited numbers of memory addresses in a machine, if 2 compiled programs are given the same address, what happens then?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "42",
    "tags": [
        "disassembly",
        "debugging"
    ],
    "user": "Kanuor",
    "time": "Sep 4, 2020 at 10:46",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  That's how the concept of virtual address space works. Every process has their own address space which can be addressed. Thanks to this you can't directly read from/write to memory of another process.\n </p>\n <p>\n  You can specify the address where the process base module will be mapped into process memory during compilation/linking process, for example for MSVC linker it is /BASE command. Usually if ASLR (Address Space Layout Randomization) is disabled, the base address is 0x400000 for 32 bit images and 0x140000000 for 64 bit images.\n </p>\n <p>\n  When you, for example, want to read a value at particular address in your process, kernel maps address from the virtual address space into a physical address (for example, to the address where the value is physically onto your RAM stick). Thanks to this two independent processes can have different values at the same address (in their own address spaces).\n </p>\n <p>\n  For example if you evaluate\n  <code>\n   *(int*)(0x600000)\n  </code>\n  in program A it can return\n  <code>\n   5\n  </code>\n  , but the same operation can return\n  <code>\n   6\n  </code>\n  in program B .\n </p>\n <blockquote>\n  <p>\n   The virtual address space for a process is the set of virtual memory addresses that it can use. The address space for each process is private and cannot be accessed by other processes unless it is shared.\n  </p>\n  <p>\n   A virtual address does not represent the actual physical location of\nan object in memory; instead, the system maintains a page table for\neach process, which is an internal data structure used to translate\nvirtual addresses into their corresponding physical addresses. Each\ntime a thread references an address, the system translates the virtual\naddress to a physical address.\n  </p>\n </blockquote>\n <p>\n  Source:\n  <a href=\"https://docs.microsoft.com/en-us/windows/win32/memory/virtual-address-space\" rel=\"nofollow noreferrer\">\n   https://docs.microsoft.com/en-us/windows/win32/memory/virtual-address-space\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "morsisko",
            "time": "Sep 4, 2020 at 13:53",
            "is_accepted": true,
            "comments": [
                {
                    "user": "ghellquist",
                    "text": "<span class=\"comment-copy\">Good answer. Nitpicking as to original question: adress is usually assigned at linking time which can be different from compiling time.</span>",
                    "time": null
                }
            ]
        }
    ]
}