{
    "title": "Decypher hw key generation process",
    "link": "https://reverseengineering.stackexchange.com/questions/25810/decypher-hw-key-generation-process",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This one is kinda tricky question, as it sounds a bit shady, I am well aware of that. Let me first explain the situation. I have this special software designed to read paired industrial sensors from afar. It's paid software coming with those sensors. It contains key-response activation process, where the key generated is a string based on hw and response another string delivered by the maker. What happened here is that I activated it in the office, while my laptop was in a dock, so it runs nicely there. But when I run it again without a dock, new ID is computed and sw asks for a new response. Connect back to the dock, runs nicely again. Thing is, I do not need to run it in the office, obviously. So I usually run it in the office first, disconnecting laptop from the dock afterwards, which way I can use it on the go. But when I am in the field and need to restart the computer or I simply forget to run it in the office first, I lose access to the sw. Manufacturer do not have any direct customer support, it's supposed to be provided through selling channels/partners but they are mostly salesmen and only technical support comes for sensors, not the reading software activation. They were kinda confused with the issue, maybe not even fully understand it and said I need to buy a whole solution again. That's a bit absurd request, sorry. Should I really replace hundreds of sensors to make the reading sw running on un-docked laptop??\n </p>\n <p>\n  The software is a bit old and frankly quite shitty. The key seems to be computed from either physical screen resolution or NIC mac address, didn't pinpoint which one exactly but how it depends on the dock one of those seems probable. So, what I basically need is to help to understand the generation process and build a keygen for that. A bit of thin ice, hopefully I do not break any forum rules here. Would someone have any recommendations where to start..?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "32",
    "tags": [
        "disassembly"
    ],
    "user": "Ren",
    "time": "Sep 4, 2020 at 7:58",
    "comments": [
        {
            "user": "morsisko",
            "text": "<html><body><span class=\"comment-copy\">\n Maybe do some entry level keygenme challenges\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ren",
            "text": "<html><body><span class=\"comment-copy\">\n Interesting. Will check that out, thanks.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}