{
    "title": "Change the behavior of any running process",
    "link": "https://reverseengineering.stackexchange.com/questions/26115/change-the-behavior-of-any-running-process",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Would it be possible to develop a program that decompiles the instructions of a running process, for example into a C-like language, and allows them to be modified and then injected into the process itself, changing its behavior?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "152",
    "tags": [
        "decompiler"
    ],
    "user": "Axeryon",
    "time": "Oct 14, 2020 at 17:46",
    "comments": [
        {
            "user": "morsisko",
            "text": "<html><body><span class=\"comment-copy\">\n Yes, but what is the point since you can modify assembler instructions directly, with much much less effort?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Axeryon",
            "text": "<html><body><span class=\"comment-copy\">\n Wouldn't C or C++ be more comfortable and readable than Assembly?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "morsisko",
            "text": "<html><body><span class=\"comment-copy\">\n Don't think so. Something as perfect C or C++ decompiler doesn't exist. They are often more confusing than assembly, and sometimes just wrong.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Axeryon",
            "text": "<html><body><span class=\"comment-copy\">\n Would such a decompiler be technically impossible or just very difficult to develop?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n @Axeryon The main problem of decompilers is that the generated assembler code can be very different depending on which compiler (and what compile options) was used to generate it. Writing a decompiler for one specific compiler with one specific set of options is difficult. However you have hundred of compilers that can generate e.g. x86 binary code with thousands of options that can be applied. You can see that writing a general decompiler that is generating compilable and correct code is more than a life-time job.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}