{
    "title": "How do I find the function that draws a window on android?",
    "link": "https://reverseengineering.stackexchange.com/questions/26125/how-do-i-find-the-function-that-draws-a-window-on-android",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have an application that recently disabled support for one of the features I used for legal reasons. Looking at the decompressed file size and count of the new version compared to the old version shows that they are nearly identical, so I guess the feature was only disabled and not removed. I want to override the lock. The window I mentioned in the title is shown before that feature and covers it. I want to figure out what controls that window. Where should I even start?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "83",
    "tags": [
        "android",
        "apk"
    ],
    "user": "adamski234",
    "time": "Oct 16, 2020 at 19:28",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n You can use apktool and/or Jadx to decompiled the app and search for the message string. You will get an identifier that is used in the code which then can be searched further in the app.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "adamski234",
            "text": "<html><body><span class=\"comment-copy\">\n I ran the apk through jadx, saved it to a directory and\n <code>\n  grep\n </code>\n ped it for parts of the string. I found nothing. I'll try looking for text in images next\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n If you just save the sources and use grep apktool is better than Jadx as Jadx often fails to decompile certain methods. apktool however is more complete when it comes to decompilation and even if you don't understand the generated Smali code you know at least in which class and method it is used.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "adamski234",
            "text": "<html><body><span class=\"comment-copy\">\n I tried. The text in the window is not anywhere in the sources\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}