{
    "title": "Does the operating system you use matter?",
    "link": "https://reverseengineering.stackexchange.com/questions/26150/does-the-operating-system-you-use-matter",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  people recommend windows for reverse engineering, I don't want to install windows as a virtual machine because they are laggy and I already have windows 10 as host, is it possible to use linux vm that already has tools installed instead.\n </p>\n <p>\n  can i still download a windows malware and do reverse engineer it in linux vm.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "655",
    "tags": [
        "windows",
        "linux",
        "malware",
        "operating-systems"
    ],
    "user": "Arthur",
    "time": "Oct 22, 2020 at 9:59",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It all depend of what you plan to reverse and how.\n </p>\n <p>\n  For purely static analysis, your operating system don't really matter, since there are great tools for both Windows and Linux systems(and nowadays you can even run Linux tools in the Windows linux subsystem, or use wine to emulate Windows utils on a Linux native system).\n </p>\n <p>\n  But if you have to run what your are reversing, and do some dynamic/behavioral analysis, you must have a setup that allows you to do so.\n </p>\n <p>\n  You added the #malware tag in your post, for this specific case, you need a virtual environment for obvious reasons.\n </p>\n <p>\n  No matter what is your 'main' operating system, I advise you to build a Linux AND a Windows virtual machine. You can snapshot them in a clean state, working on them as you want, drop your tools, break everything, infect them, undo and start again.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Guillaume",
            "time": "Oct 22, 2020 at 12:31",
            "is_accepted": true,
            "comments": []
        }
    ]
}