{
    "title": "Question about unpacking",
    "link": "https://reverseengineering.stackexchange.com/questions/26238/question-about-unpacking",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  thank for reading, i'm a beginner trying to learn Malware Analysis and Reverse Engineering, at the moment I readed the book \"Learning Malware Analysis\", I fully understand it, but there is just one section that i can't grasp, Unpacking, I tried to manually unpack UPX without success even if I watched tutorial and did the exact same thing (Breakpoint on the famous jump and then dump with scylla and rebuild IAT, but nothing).\nI don't understand how detect the instructions that unpack the executable, can someone give me the right resources to start learning unpacking? I already have tutorials like \"unpacking xxxx\" but I would prefere something more general, concepts that I need to know, I hope you understand my question, tell me if I said something wrong, thank you.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 2,
    "views": "308",
    "tags": [
        "unpacking"
    ],
    "user": "Fitz",
    "time": "Nov 4, 2020 at 13:09",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Manually unpacking is an art that takes lots of practice, but you're starting off right by working on the most simple examples. You need to have a solid understanding of the tools involved in the process and the PE file format. There are quite a few resources out there, but I've had great success spinning up folks with [yates] old docs on PE files, and Lena's tutorials (the unpacking specific things) Lena's tuts are old, but for understanding some core concepts they're still pretty relevant (x86 isn't completely dead just yet). If you want to go forward with more, there are quite a few unpackme's out for different targets too. You should be able to follow along with relative ease using x64dbg instead of olly for those tutorials as well.\n </p>\n <p>\n  So for starters, I'd suggest snagging\n  <a href=\"https://forum.tuts4you.com/files/file/1307-lenas-reversing-for-newbies/\" rel=\"nofollow noreferrer\">\n   Lena's tuts\n  </a>\n  . If you're use to the toolset you probably can jump right in with Part 20 & 21, part 21 has a UPX unpackme, but part 20 teaches some other core concepts.\n </p>\n <p>\n  Familiarize yourself with the PE file format, I really liked [yates] info on\n  <a href=\"https://web.archive.org/web/20180305002212/http://www.reverse-engineering.info/PE_Information/PE_Notes.pdf\" rel=\"nofollow noreferrer\">\n   PE files\n  </a>\n  also his\n  <a href=\"https://web.archive.org/web/20180305002416/http://www.reverse-engineering.info/PE_Information/Understanding_ImportTables.pdf\" rel=\"nofollow noreferrer\">\n   Understanding Import tables\n  </a>\n  article is also a great read. Finally, his\n  <a href=\"http://www.reteam.org/papers/e54.pdf\" rel=\"nofollow noreferrer\">\n   Program Flow\n  </a>\n  paper ties a lot of that info together well, with some really solid and simple x86/win32 asm code examples to show you how to write your own tools.\n </p>\n <p>\n  Also a decent resource on PE things is\n  <a href=\"http://index-of.es/Windows/pe/CBM_1_2_2006_Goppit_PE_Format_Reverse_Engineer_View.pdf\" rel=\"nofollow noreferrer\">\n   Goppit's Code Breaker\n  </a>\n  article. It's rather in depth, but covers about any question you could have.\n </p>\n <p>\n  That should be enough to get you started down the right path, knowing your tools and knowing what docs to read is definitely half the battle. Good luck, you can do it. archive.org and is your friend if you can't find some of the files linked in those tuts.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "dgrif",
            "time": "Nov 5, 2020 at 1:24",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Fitz",
                    "text": "<span class=\"comment-copy\">Thank you very much!</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  learn the basics of how packers works; I haven't read the book that you mentioned, but it should discuss it;\n </p>\n <p>\n  Detect whether it uses custom packer or known (commercial) packer:\n </p>\n <ol>\n  <li>\n   there is known sections; UPX0\n  </li>\n  <li>\n   tools like Detect It Easy will identify it;\n  </li>\n  <li>\n   if that was not the case, it's mostly custom packer;\n  </li>\n </ol>\n <p>\n  Unpacking known packers:\n </p>\n <ol>\n  <li>\n   usually there is pushad/popad combination that lead to OEP.\n  </li>\n  <li>\n   there is far jump; meaning that sample will jump from one section to another, or similar thing. jump target usually has no actual meaning unless sample reach that address. (actual instructions will be written there). push \"address\" ret; jump \"register\"; jump \"address\"\n  </li>\n  <li>\n   you will duckduckgo it and find some forums that talk about this particular packer.\n  </li>\n </ol>\n <p>\n  if these are the case, follow:\n  <a href=\"https://www.virusbulletin.com/virusbulletin/2012/04/quick-reference-manual-unpacking\" rel=\"nofollow noreferrer\">\n   https://www.virusbulletin.com/virusbulletin/2012/04/quick-reference-manual-unpacking\n  </a>\n </p>\n <p>\n  Unpacking Custom Packers:\n </p>\n <ol>\n  <li>\n   trace it's API Calls either with DBI or inline hooking; there are tools out there that do it for you. find the point that the malware starts it's actual malicious activity; put breakpoint on corresponding APIs and dump the payload.\nI usually put breakpoint on VirtualAlloc, VirtualProtect, CreateProcessInternalW, WriteProcessMemory depending on sample.\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "0",
            "user": "script kiddie",
            "time": "Nov 4, 2020 at 20:10",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Fitz",
                    "text": "<span class=\"comment-copy\">Thank you very much!</span>",
                    "time": null
                }
            ]
        }
    ]
}