{
    "title": "Windows: Is it possible to mix FastIoDispatch with the registration of IOCTLs?",
    "link": "https://reverseengineering.stackexchange.com/questions/26341/windows-is-it-possible-to-mix-fastiodispatch-with-the-registration-of-ioctls",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am reverse engineering a Windows device driver. My main previous experience was with drivers I had written before, or toy drivers from tutorials.\n </p>\n <p>\n  I started reversing the driver by searching for IOCTL handlers. However, in the initial driver entry the Driver Object struct lines up such that the function that appears to contain IOCTLs aligns with the \"FasIODispatch\" member. I am on the fence as to whether this is a mistake on my part, or whether it makes sense to define IOCTLs in a Fast I/O dispatch table.\n </p>\n <p>\n  Here is what I mean:\n  <a href=\"https://i.sstatic.net/UEZfn.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"Driver Object Offsets\" src=\"https://i.sstatic.net/UEZfn.png\"/>\n  </a>\n </p>\n <p>\n  Now deep nested within that function, there are many comments directly describing the contents as IOCTL handling code.\n </p>\n <p>\n  For instance note the following debug string in the driver:\n  <a href=\"https://i.sstatic.net/3IfUs.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"Debug Strings\" src=\"https://i.sstatic.net/3IfUs.png\"/>\n  </a>\n </p>\n <p>\n  Now, the help here is to help me understand whether this is:\na) Me misinterpreting the driver object struct offsets such that a MAJOR_FUNCTION is missed and place of FastIoDispatch\nb) A sensible interpretation where a fastIo Dispatch table includes definitions of IO Controls.\n </p>\n <p>\n  I am leaning towards B, but I do not have the experience with FastIO file driver development to know what a fastio file driver dispatch table would look like. The reason I am concerned I have something wrong is that all of the data I have seen so far makes it seem like one would IRP handling structures and FastIO separately. Mixing the two would seem to me as if it were against the point of using FastIO, but who knows what driver developers do in practice.\n </p>\n <p>\n  Please let me know if there's anything else I can do to help device this. Note this is a 3rd party device driver I am RE'ing in my spare time. I'm not sure what the policy is here, but I'm not sure I should post the name if you want to RE it yourself.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "126",
    "tags": [
        "windows",
        "driver"
    ],
    "user": "MrSynAckSter",
    "time": "Nov 20, 2020 at 6:24",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n From the context you provide it's not even clear that\n <code>\n  rsp\n </code>\n points to a\n <code>\n  DRIVER_OBJECT\n </code>\n where do you take that from? Who applied the knowledge that this should be an offset into a\n <code>\n  DRIVER_OBJECT\n </code>\n ?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<html><body><span class=\"comment-copy\">\n There is something misleading driverunload will take a function pointer an address of function not eax.  You probably do not have the correct analysis\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "MrSynAckSter",
            "text": "<html><body><span class=\"comment-copy\">\n I'll go back and edit the post to show my reasoning for why this is the driver object. With regards to driverunlooad, the offset gets changed later on in the driver if I recall correctly.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n It’s very unlikely that RSP points to a DRIVER_OBJECT struct, you’re confusing something. Compile a sample driver with PDB and load it into IDA to see how it should work.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "MrSynAckSter",
            "text": "<html><body><span class=\"comment-copy\">\n In my sample driver that I compiled (basically the one from Pavel Yousifivich's \"Windows Kernel Programming) it ends up being an offset like mov     [rcx+(DRIVER_OBJECT.MajorFunction+70h)], rax - I haven't seen any offsets of general purpose registers like RCX in the vicinity of driver entry. Any ideas of how else it might look?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}