{
    "title": "Is it possible to somehow derive the decryption key for iOS app binaries?",
    "link": "https://reverseengineering.stackexchange.com/questions/26375/is-it-possible-to-somehow-derive-the-decryption-key-for-ios-app-binaries",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  While disassembling an IPA downloaded directly from the App Store CDN, I noticed that the binary had an unusually large entropy. Looking this occurrence up confirmed my suspicion that it was encrypted, and that they were decrypted at launch time— which suggests that the decryption key is somewhere on the device. Why wouldn’t it be possible to obtain this key using a jailbroken device? Am I overlooking something critical? Thanks!\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "132",
    "tags": [
        "disassembly",
        "encryption",
        "ios"
    ],
    "user": "Angelo DeLuca",
    "time": "Nov 25, 2020 at 20:28",
    "comments": [
        {
            "user": "morsisko",
            "text": "<html><body><span class=\"comment-copy\">\n You can dump the decrypted program from the phone memory if your device is jailbroken. The key might be stored on some secure module and thus is unreachable directly from software.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Angelo DeLuca",
            "text": "<html><body><span class=\"comment-copy\">\n @morsisko Software on the operating system (say some daemon, for example) must receive a signal when the user opens an application. This software would then, presumably, decrypt the binaries of the requested app package. I suppose the question would be whether the decryption key is obtained from this external module or whether decryption itself occurs on said external module.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "morsisko",
            "text": "<html><body><span class=\"comment-copy\">\n The key is not exposed to software. If that would be the case the key would be released to the public long time ago.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}