{
    "title": "IDA - Rename Address/Function: Says name exists already but it does not show up anywhere",
    "link": "https://reverseengineering.stackexchange.com/questions/26423/ida-rename-address-function-says-name-exists-already-but-it-does-not-show-up",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to rename a function address in IDA (free) and it says that the name I picked already exists in the database (Error Code: 8727B0) ... but the provided name does not show in the functions window (filtered to check) or the names window (Shift+F4). The name is valid it's just \"my_func\" without quotes.\n </p>\n <p>\n  Is this normal behavior to say a name exists but does not? Is there a way to manually edit the IDA database file(s) to fix this issue. It should not be reporting invalid errors.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "284",
    "tags": [
        "ida",
        "address"
    ],
    "user": "David",
    "time": "Dec 3, 2020 at 8:47",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The namespace in IDA database includes not only names in disassembly but also structs and enums, so check there too\n </p>\n <p>\n  Additionally, not all names are included in the name list (you can uncheck “include in name list” on rename). However, jumping to it using  G shortcut should work.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Dec 3, 2020 at 22:57",
            "is_accepted": false,
            "comments": [
                {
                    "user": "David",
                    "text": "<span class=\"comment-copy\">Yeah, I am not sure why it would not let me rename the address as the name I wanted did not exist any where else in the assembly. I should note that I when I loaded the IDA db back-up (i.e. prior to attempting the rename) it did print some error messages in the output saying \"my_func does not have a back reference\" but I had no idea what that meant and didn't see or think anything of it. I am not sure what the issue was but I just redid my disassembly in a separate file and kept the old IDA db as a \"failed version\".</span>",
                    "time": null
                }
            ]
        }
    ]
}