{
    "title": "Where to get started with reverse engineering a usb video device on Windows?",
    "link": "https://reverseengineering.stackexchange.com/questions/26439/where-to-get-started-with-reverse-engineering-a-usb-video-device-on-windows",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a piece of proprietary hardware that I'm trying to reverse engineer and write a cross-platform open-source driver for. This device has an IR camera on it, and it seems to be using the UVC protocol. On linux, de device is exposed as a /dev/video0 camera, and although it doesn't show up in any webcam-based application, I can use OpenCV to pull frames from it.\n </p>\n <p>\n  On Windows, it is a bit more obfuscated. The camera doesn't show up in any application, and only the devices' Windows-only proprietary driver can interface with it. In Device Manager the device shows up under 'Imaging devices' and it uses the\n  <code>\n   ksthunk.sys\n  </code>\n  and\n  <code>\n   usbvideo.sys\n  </code>\n  drivers.\n </p>\n <p>\n  I've tried everything I could think of to pull frames off of the camera, but every attempt failed. First of all, I've tried connecting to it with OpenCV, but i couldn't find the right device id. I've even tried brute-forcing the device id by trying to connect to every possible number within a huge interval, but no luck.\n </p>\n <p>\n  I've also tried using some low-level uvc debugging tools from the Windows SDK (GraphEdit and KsStudio) but none of them could connect to the camera.\n </p>\n <p>\n  One thing I did notice is that actual webcams have registry keys\n  <code>\n   FilterData\n  </code>\n  and\n  <code>\n   MSCameraFlags\n  </code>\n  in\n  <code>\n   HKLM\\CurrentControlSet\\Control\\DeviceClasses\\{e5323777-f976-4f5b-9b55-b94699c46e44}\\##?#USB#VID_045E&PID_0766&MI_00#6&1d047af0&0&0000#{e5323777-f976-4f5b-9b55-b94699c46e44}\\#global\\Device Parameters\n  </code>\n  , while this device doesn't. The value\n  <code>\n   FilterData\n  </code>\n  seems to contain values regarding resolution and image compression, so the lack of this key in my device's registry might have something to do with windows not seeing it as a webcam.\n </p>\n <p>\n  Obviously the device's developers did something to make sure the camera doesn't show up as a regular webcam, because it is not meant to be used as such.\n </p>\n <p>\n  My ultimate goal is to be able to use the IR camera from OpenCV in my own software, but I have no idea how to get started with proper reverse engineering of the device.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "1k",
    "tags": [
        "windows",
        "linux",
        "usb"
    ],
    "user": "L치z치r Zsolt",
    "time": "Dec 4, 2020 at 12:51",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  First, try to identify the components of the device. If it's cheap, buy a second one and crack it open.\n </p>\n <p>\n  Look for specifications and find similar devices which have the same specs. It's not like this device is the only one on the planet with that imaging sensor. That may help you find a compatible driver or spec from which to start your implementation.\n </p>\n <p>\n  Sounds like the device isn't presenting itself as a camera. There's nothing that says a USB camera has to declare itself to be one. My USB keyboard could claim to not be a USB keyboard.\n </p>\n <p>\n  Can you write a virtual webcam driver which acts as a proxy? Setup fake/ approximate registry entries and proxy data directly to the device?\n </p>\n <p>\n  How about just creating a registry entry approximate to what it should be? You likely know the parameters from OpenCV.\n </p>\n <p>\n  I take it from your post, you need to use this device on windows?\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "pythonpython",
            "time": "Dec 4, 2020 at 17:10",
            "is_accepted": false,
            "comments": [
                {
                    "user": "L치z치r Zsolt",
                    "text": "<span class=\"comment-copy\">The official driver is windows only, but I'm trying to make my own driver cross-platform.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <ol>\n  <li>\n   First I would find the h/w device ID from device manager. i.e. USB\\VID_045E&PID_0766. In some cases you can find existing open source drivers for closely matching device IDs and make them work with minimal modifications.\n  </li>\n </ol>\n <ol start=\"2\">\n  <li>\n   Is the application actually installing 3rd party drivers, the two drivers you mention ksthunk.sys and usbvideo.sys are Microsoft drivers built into Windows.\n  </li>\n </ol>\n <p>\n  Drivers using USBVIDEO.sys follow the specifications laid out here:\n </p>\n <p>\n  <a href=\"https://docs.microsoft.com/en-us/windows-hardware/drivers/stream/usb-video-class-driver-overview\" rel=\"nofollow noreferrer\">\n   https://docs.microsoft.com/en-us/windows-hardware/drivers/stream/usb-video-class-driver-overview\n  </a>\n </p>\n <p>\n  The tool\n  <a href=\"https://docs.microsoft.com/en-us/windows-hardware/drivers/stream/avstream-testing-and-debugging\" rel=\"nofollow noreferrer\">\n   USBView\n  </a>\n  which is part of the Windows Driver Kit can extract more info about the USB device.\n </p>\n <ol start=\"3\">\n  <li>\n   <p>\n    USB tracing can assist workout more details around the communication, using a tool such as\n    <a href=\"https://wiki.wireshark.org/CaptureSetup/USB\" rel=\"nofollow noreferrer\">\n     WireShark\n    </a>\n   </p>\n  </li>\n  <li>\n   <p>\n    An analysis of the setup program for the driver can work out further information. This is a fairly complex topic though but some methods could include:\n   </p>\n  </li>\n </ol>\n <p>\n  a) Use a tool to monitor driver installation such as ProcMon (\n  <a href=\"http://live.sysinternals.com/ProcMon.exe\" rel=\"nofollow noreferrer\">\n   http://live.sysinternals.com/ProcMon.exe\n  </a>\n  ) Generally this works best if driver & application is not installed, you start monitoring then run install program and connect device during trace.\n </p>\n <p>\n  b) Static analyze the installer using tools such as\n  <a href=\"https://github.com/Bioruebe/UniExtract2\" rel=\"nofollow noreferrer\">\n   UniExtract\n  </a>\n  ,\n  <a href=\"https://docs.microsoft.com/en-us/windows/win32/msi/orca-exe\" rel=\"nofollow noreferrer\">\n   Orca\n  </a>\n  (if MSI), then analyse the executable contents with reverse engineering tools such as\n  <a href=\"https://ghidra-sre.org/\" rel=\"nofollow noreferrer\">\n   Ghidra\n  </a>\n  or\n  <a href=\"https://www.hex-rays.com/products/ida/\" rel=\"nofollow noreferrer\">\n   IDA Pro\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "chentiangemalc",
            "time": "Jan 4, 2021 at 0:06",
            "is_accepted": false,
            "comments": []
        }
    ]
}