{
    "title": "Methods to alert inappropriate use of JS code",
    "link": "https://reverseengineering.stackexchange.com/questions/26537/methods-to-alert-inappropriate-use-of-js-code",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Let's say we have a JS code library that is not for sale, just internal. Of course, anyone who can access the website will be able to download that and reuse it.\n </p>\n <p>\n  To avoid others to reuse that library, the first thing to do is obfuscate it, but what about the alternative methods to warn the owner about the inappropriate use of that library?\n </p>\n <p>\n  This JS code is behind a login website, so it's not possible to just use it adding a:\n </p>\n <pre><code><script src=\"https://original.web.site/script/library.js\"></script>\n</code></pre>\n <p>\n  (it will give a 404 error)\n </p>\n <p>\n  So it must be downloaded and installed in a new website. In this case, I think that it's possible to just add a\n  <code>\n   <img src=\"http://link.to.owner.site/pixel.jpg\" />\n  </code>\n  that alerts the owner about the inappropriate use of the library (note the use of\n  <code>\n   http\n  </code>\n  protocol that shows the referer link).\n </p>\n <p>\n  To find and block this kind of warnings, my first idea is to test the library in localhost and check if it is accessing to external URLs (Developer Tools in Google Chrome provide this functionality).\n </p>\n <p>\n  My question is: Is there any similar method to warn the owner about inappropriate uses of the library? How to effectively find this kind of warnings and get rid of them?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "41",
    "tags": [
        "obfuscation",
        "javascript"
    ],
    "user": "Ivan",
    "time": "Dec 14, 2020 at 10:39",
    "comments": [
        {
            "user": "pythonpython",
            "text": "<html><body><span class=\"comment-copy\">\n What does the library do?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ivan",
            "text": "<html><body><span class=\"comment-copy\">\n It's something similar to numpy in python. Works with big numbers, matrix, statistics, etc. But, does it matters @pythonpython ?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}