{
    "title": "Find out decrypted body of Polymorphic malware",
    "link": "https://reverseengineering.stackexchange.com/questions/2654/find-out-decrypted-body-of-polymorphic-malware",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I want to decrypt a polymorphic malware. In polymorphic malware there must be a decryption routine which will decrypt virus code and then execute it. I want to get this pair of encrypted code and its decrypted version and do some processing on it. For this I took this polymorphic malware from offensive computing website.\n </p>\n <p>\n  <a href=\"http://oc.gtisc.gatech.edu:8080/search.cgi?search=bolzano\" rel=\"nofollow\">\n   http://oc.gtisc.gatech.edu:8080/search.cgi?search=bolzano\n  </a>\n  MD5:    6eb5fdc7a80cb6b551b7aee3242ea9e4\nSHA1:   8f9a97ef3388bc21367f245715d1e930c7dd81c0\nSHA256:     0613e465dc0473c210c6e905ce938eaf6adcea800b116d0651f22c782ffb1cdb\nOCID:   1663401483\nOriginal Filename:  Virus.Win32.Bolzano.3628\n </p>\n <p>\n  This virus can be executed in windows NT. So I created vm for windows NT 4.0 SP6. And loaded virus in Ollydbg 1.10. I directly executed executable there. After few seconds virus terminated with exit code 5B. Does this means that when I executed virus , it is decrpyted by decryption routine and executed ? What are ways I can find decryption routine in that virus so that I can understand the exact position of decrypted virus. If I understood that I can put break point after decryption routine and recover the pair.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "586",
    "tags": [
        "disassembly",
        "malware",
        "assembly",
        "ollydbg",
        "anti-debugging"
    ],
    "user": "user1744108",
    "time": "Aug 17, 2013 at 22:14",
    "comments": [
        {
            "user": "user1744108",
            "text": "<html><body><span class=\"comment-copy\">\n I submitted this sample of ThreatAnalyser sandox here\n <a href=\"http://www.threattracksecurity.com/resources/sandbox-malware-analysis.aspx\" rel=\"nofollow noreferrer\">\n  threattracksecurity.com/resources/sandbox-malware-analysis.aspx\n </a>\n . In report, it is written that this virus checks for debugger. But how can I see in code that it is checking for debugger and how it behaves in case of debugger. I am not sure whether report I got is correct or not. In executable there is call to GetTickCount API and I read that this API is used to check for debugger. But how can I confirm whether GetTickCount API used in code is for debugger or for some other purpose.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Antimony",
            "text": "<html><body><span class=\"comment-copy\">\n You don't have to use a debugger. You could jump instrument the VM to dump all memory written by the target process.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "PhoeniX",
            "text": "<html><body><span class=\"comment-copy\">\n Can you please post the link to the ThreatAnalyser report?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<html><body><span class=\"comment-copy\">\n you seem to create several posts on the same topic why not follow up in one question that makes it easier for you and makes it a good reference for future users as well don't you think\n <a href=\"http://reverseengineering.stackexchange.com/questions/2476/how-to-obtain-decrypted-virus-body-of-bolzano-virus-using-ollydbg-1-10-debugging/2485#2485\" title=\"how to obtain decrypted virus body of bolzano virus using ollydbg 1 10 debugging\">\n  reverseengineering.stackexchange.com/questions/2476/…\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user1744108",
            "text": "<html><body><span class=\"comment-copy\">\n @Antimony: I did not get what you want to say, could you please elaborate in detail ?                          ph0sec: They sent me PDF file, in report it is written that \"virus could not load\" , so I think it is crashing on ThreatAnalyser.                                         blabb: Sure that makes sense. I think this question is more related, so I think I should remove last topic\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  From analysis of the following report on\n  <a href=\"https://malwr.com/analysis/OGE4OWVmM2E2Y2FmNGNlMmFkM2M2YTdmNmM1MmE4MzY/\" rel=\"nofollow\">\n   malwr.com\n  </a>\n  , it looks like the malware has crashed on there system, which could indicate that it also has crashed at yours.\n </p>\n <ol>\n  <li>\n   Regarding\n   <strong>\n    GetTickCount API\n   </strong>\n   , you should check that the call to it is done from the body of the malware and not from the pre-loading environment of console executable. If you find near\n   <strong>\n    GetTickCount API\n   </strong>\n   also APIs for parsing command line parameters, than it's a false alarm.\n  </li>\n  <li>\n   As to the finding the OEP (Original Entry Point) I'd suggest to put BP on VirtualAlloc/VirtualAllocEx - as in general, but does not have to, encrypted malware will need extra space to decrypt itself. In that particular case I saw the usage of\n   <strong>\n    NtCreateSection\n   </strong>\n   which you also should monitor.\n   <ol>\n    <li>\n     After loading the malware in Debugger, try to search for dynamic control transfer, like jumps/calls to value stored in register/de-referenced memory.\n    </li>\n    <li>\n     Also put BPs on APIs responsible for memory de-allocation (VirtualFree) so you could dump the buffer before its gone.\n    </li>\n   </ol>\n  </li>\n </ol>\n <p>\n  And for the end, do not immediately rush to a debugger, try to run the malware and look what it does by using\n  <strong>\n   ProcMon\n  </strong>\n  for example.\n </p>\n <p>\n  <strong>\n   UPDATE:\n  </strong>\n  \n\n  Advise before you dive into dealing with real malware:\n </p>\n <ol>\n  <li>\n   Write very simple program.\n  </li>\n  <li>\n   Download UPX compressor - its open source, as there are a lot of malwares that use it too :)\n  </li>\n  <li>\n   Compress your program with UPX\n  </li>\n  <li>\n   Now, try manually decompress your program from the compressed one.\n  </li>\n </ol>\n <p>\n  Have fun!\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "PhoeniX",
            "time": "Aug 18, 2013 at 7:35",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user1744108",
                    "text": "<span class=\"comment-copy\">I am new to malware analysis. Could you suggest me any simple polymormphic malware which I can use at initial stage and find its encrypted/decrypted pair. I put break point on VirtualAlloc/VirtualAllocEx but it seems virus is not coming here and don't stop its execution. Also regarding tool ProcMon, this tool can be run on windows XP and higher version, but virus which I am using is exectable on windows NT. So I can not use this tool.</span>",
                    "time": null
                },
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">Why is it so important for you to run malwares on Windows NT?</span>",
                    "time": null
                },
                {
                    "user": "user1744108",
                    "text": "<span class=\"comment-copy\">because I read about this malware from here <a href=\"http://spth.virii.lu/29a4/29A-4.505.txt\" rel=\"nofollow noreferrer\">spth.virii.lu/29a4/29A-4.505.txt</a>, and at the start it is checking for OS. if it is not windows NT or windows 9X it is giving access violation and terminates. Also on symantec web site it is mentioned that it affects windows NT, windows9x. I am more happy to use windows 7 but then which polymoprhic malware I should choose ?</span>",
                    "time": null
                },
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">I can suggest <a href=\"http://contagiodump.blogspot.com/2011/09/sept-21-greedy-shylock-financial.html\" rel=\"nofollow noreferrer\">Shylock</a> malware family for you to practice, versions from 2011 - 2012, but I can not point you to actual link for a malware. Try to look on the Net for it.</span>",
                    "time": null
                }
            ]
        }
    ]
}