{
    "title": "Debugging ARM binary with IDA Pro and Qemu",
    "link": "https://reverseengineering.stackexchange.com/questions/2655/debugging-arm-binary-with-ida-pro-and-qemu",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am debugging an ARM binary using IDA Pro by connecting to QEMU (remote gdb debugging).\n </p>\n <p>\n  In gdb configuration, I am selecting\n  <code>\n   ARM_versatilepb\n  </code>\n  as the device.\n </p>\n <p>\n  Now, I am able to successfully debug the ARM binary. However, I am unable to execute the syscalls like\n  <code>\n   fork()\n  </code>\n  ,\n  <code>\n   socket()\n  </code>\n  and so on in the binary.\n </p>\n <p>\n  I think the reason for this is that I am using a bare metal config of QEMU. So, how do I modify this configuration to have a full Linux system running on QEMU so that I can execute syscalls as well?\n </p>\n <p>\n  There is another device name, ARM_Linux in the\n  <code>\n   gdb_arch.cfg\n  </code>\n  file of IDA Pro which has the\n  <code>\n   arm_root.img\n  </code>\n  parameter passed in the command line.\n </p>\n <p>\n  I selected this device but even then, unable to execute the syscalls.\n </p>\n <p>\n  The bare metal configuration I am using at present is detailed\n  <a href=\"http://www.hexblog.com/?p=111\" rel=\"nofollow\">\n   here\n  </a>\n  .\n </p>\n</div>\n</body></html>",
    "votes": "6",
    "answers": 1,
    "views": "5k",
    "tags": [
        "ida"
    ],
    "user": "Neon Flash",
    "time": "Aug 19, 2013 at 12:18",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n For Qemu and ARM I'm not aware of such a thing, but there is such a mechanism to supply mock functions for Bochs-Debugging. Look inside\n <code>\n  plugins/bochs\n </code>\n for more information. Igor is probably best suited to answer this. Perhaps no one ever asked for this feature?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It sounds like you are trying to emulate an ARM ELF binary by running it directly in qemu-system-arm, in which case the reason that syscalls don't work is that there is no Linux kernel to handle these syscalls.\n </p>\n <p>\n  What you are probably looking for is qemu-arm, which runs the ARM binary as a normal ELF, translating ARM syscalls to your underlying Intel kernel. The qemu-arm emulator has a built-in GDB server that IDA can connect to.\n </p>\n <p>\n  Alternatively, you can get an ARM Linux system (such as Debian, or maybe there's a raspi release designed to run in Qemu?) running in qemu-system-arm, at which point you can just copy your ELF binary to the Qemu VM and run it there. You can then attach IDA to the running process using GDB server or the Linux ARM debugging stub included with IDA.\n </p>\n</div>\n</body></html>",
            "votes": "7",
            "user": "devttys0",
            "time": "Aug 19, 2013 at 11:31",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xea",
                    "text": "<span class=\"comment-copy\">here's a prepackaged raspbian qemu image ready to run <a href=\"http://sourceforge.net/projects/rpiqemuwindows/\" rel=\"nofollow noreferrer\">sourceforge.net/projects/rpiqemuwindows</a></span>",
                    "time": null
                }
            ]
        }
    ]
}