{
    "title": "Recover data from old HDD (word files mostly)",
    "link": "https://reverseengineering.stackexchange.com/questions/26584/recover-data-from-old-hdd-word-files-mostly",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to help my mother recover some of her work from an old HDD, but I am facing multiple problems.\n </p>\n <p>\n  Firstly, I do not know the best way I could interface the old HDD with my laptop (or a newer PC).\n </p>\n <p>\n  Even if I get that figured out, I'm unsure as to what tools I should use. I read that radare2 was written to recover data from disks, and I'm thinking that the word files still have their \"magic numbers\", and maybe I could use that tool, but I have no idea how to start.\n </p>\n <p>\n  I omitted the hard disk specifics because I don't think they matter that much, I'll modify the post just in case. (I didn't know a better place to post - sorry)\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "121",
    "tags": [
        "hardware"
    ],
    "user": "Daniel Wagner",
    "time": "Dec 19, 2020 at 4:42",
    "comments": [
        {
            "user": "pythonpython",
            "text": "<html><body><span class=\"comment-copy\">\n Has the drive been damaged/formatted? Is it physically in working order? Was it a Windows Machine?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n This doesn’t seem to be directly related to RE. Might be better to ask on SuperUser or, if the drive is over 10 years old, on RetroComputing.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Daniel Wagner",
            "text": "<html><body><span class=\"comment-copy\">\n The drive hasn't been formatted, although it might be damaged (unused for 10+ years..) - it's a 4GB hard drive.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Daniel Wagner",
            "text": "<html><body><span class=\"comment-copy\">\n The running operating system on it was Windows XP.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Hmm, there are commercial offerings for this. As the answer already states, if you are risk averse and the data is precious enough you may want to make use of one of the services where you send the HDD to the service offering it. Usually the way this works is that they will assess how much they will charge you and only if you agree, they'll do it and charge for it. Typically the initial costs are merely for shipping to the service and back.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Depending on your tolerance for risk there are a number of things you can do.\n </p>\n <p>\n  <a href=\"https://rads.stackoverflow.com/amzn/click/com/B000VS4HDM\" rel=\"nofollow noreferrer\">\n   You will need some sort of an adapter for the hard drive, I'm assuming it's IDE, so IDE to USB.\n  </a>\n </p>\n <p>\n  Once you have the adapter you have some choices.\n </p>\n <p>\n  The least risky path is to use something to\n  <a href=\"https://medium.com/@sebnemK/usb-drive-forensic-analysis-with-kali-linux-57d0ef475c9b\" rel=\"nofollow noreferrer\">\n   create a disk image of the drive\n  </a>\n  , ideally bit by bit. This will copy the data off the drive into a file from which you can attempt to recover the data using all manner of tools. For example\n  <a href=\"https://www.techrepublic.com/article/how-to-access-a-system-image-and-restore-individual-files-using-windows-10s-native-vhd-support/\" rel=\"nofollow noreferrer\">\n   mount the image on win10\n  </a>\n  or using\n  <a href=\"https://www.kalilinux.in/2019/09/foremost-kali-linux-recover-deleted-files.html\" rel=\"nofollow noreferrer\">\n   foremost on kali\n  </a>\n  .\n </p>\n <p>\n  The more risky path is to plug the drive into the IDE to USB adapter and then plug it into your laptop. That may work and you may be able to pull the files up and copy them off.\n </p>\n <p>\n  I'd create the image (ISO), and then try mounting the image on windows 10 to see what shows up.\n </p>\n <p>\n  Or just plug it in via USB on a windows machine. If you have no reason to believe the drive is damaged, then KISS.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "pythonpython",
            "time": "Dec 22, 2020 at 1:29",
            "is_accepted": false,
            "comments": []
        }
    ]
}