{
    "title": "Link decompiled C code to Assembly (retdec decompiled object into C code, but with many errors, i found the kill switch which i need to edit)",
    "link": "https://reverseengineering.stackexchange.com/questions/26642/link-decompiled-c-code-to-assembly-retdec-decompiled-object-into-c-code-but-wi",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am using retdec to decompile a piece of software. It has a \"kill switch\" to detect if it's being run in an untrusted environment, in the decompiled code it just a simple\n </p>\n <pre><code>if (env_untrusted() == 1)\n   abort()\n</code></pre>\n <p>\n  so i'd like to remove that statement, thing is, the decompiled C code has\n  <em>\n   many\n  </em>\n  compilation errors. Is it possible to see what assembly corresponds to that function, and then change that assemlby to \"return 0\"?\n </p>\n <p>\n  also, using objdump i can generate assembly, but not in a usable format, is there a way how i can make it print in a usable format so that i can compile that assembly?\n </p>\n <p>\n  so in summary:\ni have decompiled an executable file using retdec into a C file. in that C file i found a function that i'd like to edit, but i cant compile the C file, so i need to find that function in the assembly, how can i do that?\n </p>\n <p>\n  and as a by producct: how can i make objdump only print out assembly\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "228",
    "tags": [
        "disassembly",
        "assembly",
        "c",
        "objdump"
    ],
    "user": "user35360",
    "time": "Dec 28, 2020 at 10:11",
    "comments": [
        {
            "user": "user35360",
            "text": "<html><body><span class=\"comment-copy\">\n so, i found the answer: the objdump assembly always gives the nmemory location before the actual intruction. retdec gives the memory range per instruction. in the objdum p generated assembly just search for the memory range and done\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "multithr3at3d",
            "text": "<html><body><span class=\"comment-copy\">\n Go ahead and answer your own question then, and mark as accepted.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Assuming, that executable is not packed, and if you got to the killswitch already, just select some asm commands and look for them in debugger. then you can change necessary bytes with NOP.  No recompilation would be necessary at all.\n </p>\n <p>\n  Recompilation, even if successful, will make executable not exactly the same as original code.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Zurab",
            "time": "Dec 28, 2020 at 15:10",
            "is_accepted": true,
            "comments": []
        }
    ]
}