{
    "title": "How devices such as smart Wi-Fi power plugs and Wi-Fi ip cameras connect to a private Wi-Fi network?",
    "link": "https://reverseengineering.stackexchange.com/questions/26729/how-devices-such-as-smart-wi-fi-power-plugs-and-wi-fi-ip-cameras-connect-to-a-pr",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  How devices such as smart Wi-Fi  power plugs and  Wi-Fi ip cameras connect to a private Wi-Fi network ?\n </p>\n <p>\n  The usual steps are the following :\n </p>\n <ol>\n  <li>\n   <p>\n    You buy the device\n   </p>\n  </li>\n  <li>\n   <p>\n    You install the maker application on your\nsmartphone\n   </p>\n  </li>\n  <li>\n   <p>\n    You discover the device trough the application\n   </p>\n  </li>\n  <li>\n   <p>\n    You set up your private Wi-Fi password network on the device trough the\napplication\n   </p>\n  </li>\n  <li>\n   <p>\n    The device reboot\n   </p>\n  </li>\n  <li>\n   <p>\n    Then the device appears on your\nprivate network.\n   </p>\n  </li>\n </ol>\n <p>\n  What are the technologies/protocol behind that steps ?\n </p>\n <p>\n  Let's say that in 10 years the maker application will not exists anymore. How I will be able to connect my device to my network ?  What about password security during step 4?\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "219",
    "tags": [
        "hardware"
    ],
    "user": "Erwan",
    "time": "Jan 8, 2021 at 12:33",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Typically the Wifi password is sent in plain text obfuscated from app the adapter using Wifi. The app sends broadcast packets into the encrypted network and the smart WiFi power plug scans the networks for encrypted broadcasts (it can not read). The password is usually transmitted bit-for-bit e.g. using the packet length of the encrypted broadcast packets as data (the packet length can be determined even if you can not decrypt the Wifi payload). Decompiling the Android app should show you the exact way that us used to transmit the password.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Simply make sure to purchase equipment that allows you to be flashed with firmware you can control, such as\n <a href=\"https://tasmota.github.io/docs/\" rel=\"nofollow noreferrer\">\n  Tasmota\n </a>\n . If you make this a conscious decision, you are \"voting with your wallet\".\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There are many ways this can be done, only really limited by capabilities of smartphones, but here are a few common examples:\n </p>\n <ol>\n  <li>\n   <strong>\n    Access point:\n   </strong>\n   the device broadcasts its own WiFi access point. The device's WiFi settings are configured using normal protocols (commonly HTTP) via the mobile app or manually through a web browser. Ideally, HTTPS would be used, but using WPA2 or later with an unpredictable, device-unique passphrase is also usually sufficient.\n  </li>\n  <li>\n   <strong>\n    Bluetooth/BLE:\n   </strong>\n   Using one of several possible pairing mechanisms, the phone finds and pairs with the device, followed by pushing configurations. Generally, Bluetooth will use encryption, but there are insecure ways to pair or transfer data.\n  </li>\n  <li>\n   <strong>\n    Others:\n   </strong>\n   WiFi configuration data can be transferred over almost anything, such as light flashes, NFC, unaudiable noises, etc. Encryption seems unlikely in most cases.\n  </li>\n </ol>\n</div>\n</body></html>",
            "votes": "0",
            "user": "multithr3at3d",
            "time": "Jan 11, 2021 at 22:30",
            "is_accepted": false,
            "comments": [
                {
                    "user": "masterX244",
                    "text": "<span class=\"comment-copy\">for REers: First method occassionally contains a entrance into the device, too if the script/program handling the configuration request is buggy.</span>",
                    "time": null
                }
            ]
        }
    ]
}