{
    "title": "Adding an export entry into dll file",
    "link": "https://reverseengineering.stackexchange.com/questions/26748/adding-an-export-entry-into-dll-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There is an dll file which i need to edit, Using PE Explorer option, Export Viewer i can see a long list of items and i suppose each entry is called \"Export Function\". Using notepad++ i can  access those items but since is a binary file any edit to it would lead to a crash. I have no knowledge in reverse engineering but i need to add several items into export table of this dll in order to remove the current limitation that i am stuck with. as i understand i must use a hex editor and first edit something called \"ExportDirectory.NumberOfFunctions\" which i am unable to find. Probably because i am looking in the wrong direction.\n </p>\n <p>\n  I understand there is no easy way to do this, so i am open to learning if is not possible to do this using any tools.\n </p>\n <p>\n  Regards\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "402",
    "tags": [
        "dll"
    ],
    "user": "wekos",
    "time": "Jan 11, 2021 at 13:05",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n How would adding exports remove the limitation?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "wekos",
            "text": "<html><body><span class=\"comment-copy\">\n I have a game that comes with a folder containing all item files in it, the only way to add a new item is to remove current items by changing the content of any file in there. adding a new item file with a new name wont work since it seems is hard coded, i traced this to the dll file which contains all of item files name along with several code functions which i guess are used by game engine. i figure if i add more export functions i can bypass the limitation.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Remko",
            "text": "<html><body><span class=\"comment-copy\">\n Does this answer your question?\n <a href=\"https://reverseengineering.stackexchange.com/questions/21000/permanently-load-a-dll-to-an-executable\">\n  Permanently load a DLL to an executable\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "wekos",
            "text": "<html><body><span class=\"comment-copy\">\n This was indeed helpful, since this software allows me to edit export table. However the question deals with importing rather than exporting. I have played around with software and by editing number of function,number of names,address of function and address of names and oridinals i was able to add another entry but whenever i add the name it becomes n/a after saving, like this:\"0x0250  0x0052F2BA n/a\" so new address stays but name is gone, so i must be doing something wrong regarding giving values. i increased all of names mentioned above by 4 except the last one.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n I don't think it's a proper duplicate, albeit certainly related.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}