{
    "title": ".dll file pull source from compiled study?",
    "link": "https://reverseengineering.stackexchange.com/questions/26773/dll-file-pull-source-from-compiled-study",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Forgive me, I’m new, and not a programmer, but I am needing to see if this is possible.\n </p>\n <p>\n  I have a study in my trading platform I had built a long time ago, lost the original, but have the compiled\n  <code>\n   .dll\n  </code>\n  file.\n </p>\n <p>\n  Is there anyway to go about extracting the code, so I can update my study?\n </p>\n <hr/>\n <p>\n  It’s a\n  <code>\n   .dll\n  </code>\n  file that’s compiled, as a study.  Basically in my program, I load the\n  <code>\n   .dll\n  </code>\n  , and it loads the study to do what the code it programmed to do.\n </p>\n <p>\n  Basically, I have a stock chart, with a custom\n  <code>\n   .dll\n  </code>\n  to plot lines at certain levels etc., the platform supports .dll compiled studies (like a plugin to do something within a program) they do this, so traders can write custom strategies/stuff for their own trading.\n </p>\n <p>\n  The guy I hired a long time ago to code this study, is now gone, so I don’t have the source code to update the study with new stuff, just the compiled\n  <code>\n   .dll\n  </code>\n  .\n </p>\n <p>\n  Thanks in advance for your help, I will appreciate it!\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "119",
    "tags": [
        "windows"
    ],
    "user": "Heyugly",
    "time": "Oct 29, 2021 at 7:31",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n What’s “a study”? Assume we know nothing about trading platforms.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Do you remember the programming language and compiler you used? For a dll there is the chance that it was created by a .Net language and in this case you could use a .Net decompiler for recovering large parts of the code.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Yes, it is possible to recover the source of a DLL.\n </p>\n <p>\n  For that, you need to find out which language is used in its development. Keep in mind that some languages like in the case of\n  <code>\n   .NET\n  </code>\n  use\n  <code>\n   IL\n  </code>\n  (a type of bytecode) that can facilitate when retrieving the source code, just as if it was developed in\n  <code>\n   VS\n  </code>\n  ,\n  <code>\n   GCC\n  </code>\n  , or — simplifying — a language that works with the operating system's API is relatively easy for an experienced programmer to retrieve the source for you.\n </p>\n <p>\n  Another factor to consider is the use of virtualized codes or protections that can hinder the reverse process by less experienced people, to help in your studies I recommend books like\n  <strong>\n   Practical Reverse Engineering\n  </strong>\n  , it will give you the basic concepts to start and understand the concepts necessary for a good analysis, as well as it will also present tools that will assist in your learning, this is the safest and most guided way for you to study.\n </p>\n</div>\n</body></html>",
            "votes": "-1",
            "user": "MarianD",
            "time": "Aug 2, 2021 at 11:11",
            "is_accepted": false,
            "comments": []
        }
    ]
}