{
    "title": "With ghidra/x64dbg sync, how to display dynamic values in ghidra's decompile window?",
    "link": "https://reverseengineering.stackexchange.com/questions/26787/with-ghidra-x64dbg-sync-how-to-display-dynamic-values-in-ghidras-decompile-win",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm reversing a program and a library without debugging symbols. I'm using x64dbg to break at specific regions and observe what is happening at runtime, and annotate the decompile version in ghidra.\n </p>\n <p>\n  I'm using\n  <a href=\"https://github.com/bootleg/ret-sync\" rel=\"nofollow noreferrer\">\n   ret-sync\n  </a>\n  to synchronize horizon between x64dbg and ghidra. However, it's often addresses and not values that are directly visible in x64dbg, and only the horizon is sync in ghidra, from x64dbg as the program goes on.\n </p>\n <p>\n  I would like to:\n </p>\n <ol>\n  <li>\n   <p>\n    see the variables values in ghidra's decompile window: as the program goes and all the values that were allocated between two datetimes in the execution; how can I do this ? For instance when a pointer change of address I would like to follow the \"content\" directly, not \"caring/focusing first\" about/on the address.\n   </p>\n  </li>\n  <li>\n   <p>\n    in the case of arrays and struct, from the address, how can I have all the values displayed, as if I was debugging from Visual Studio for instance ? (\n    <a href=\"https://devblogs.microsoft.com/visualstudio/customize-object-displays-in-the-visual-studio-debugger-your-way/\" rel=\"nofollow noreferrer\">\n     example\n    </a>\n    )\n   </p>\n  </li>\n  <li>\n   <p>\n    how can I label back the renamed variables in ghidra back in x64dbg ?\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "4k",
    "tags": [
        "debugging",
        "ghidra",
        "x64dbg"
    ],
    "user": "Soleil",
    "time": "Jan 18, 2021 at 17:03",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It sounds like you are looking for proper debugger integration in Ghidra. This has recently been published to the GitHub repository in the\n  <a href=\"https://github.com/NationalSecurityAgency/ghidra/tree/debugger\" rel=\"nofollow noreferrer\">\n   <code>\n    debugger\n   </code>\n   branch\n  </a>\n  . There is also a\n  <a href=\"https://wrongbaud.github.io/posts/ghidra-debugger/\" rel=\"nofollow noreferrer\">\n   good blogpost\n  </a>\n  showcasing it.\n </p>\n <p>\n  Sadly there does not seem to be a\n  <code>\n   x64dbg\n  </code>\n  backend yet, but I would expect that this will appear as either an official backend or a community plugin at some point in the near future.\nConcerning your specific questions and whether they are supported or will likely be supported via this debugger feature in the future:\n </p>\n <blockquote>\n  <p>\n   see the variables values in ghidra's decompile window\n  </p>\n </blockquote>\n <p>\n  I think showing them directly in the decompile window is currently not supported. But showing a list of variables of the current function, globals and maybe specific addresses definitely seems like something that will be supported at some point, or can be written with reasonable effort.\n </p>\n <blockquote>\n  <p>\n   in the case of arrays and struct, from the address, how can I have all the values displayed, as if I was debugging from Visual Studio for instance ?\n  </p>\n </blockquote>\n <p>\n  I am not quite sure what you mean here because I never used debugging with Visual Studio myself. But this seems like a more specific case of the first question to me and will either be supported at some point, or something that can be scripted for a specific purpose easily enough.\n </p>\n <blockquote>\n  <p>\n   how can I label back the renamed variables in ghidra back in x64dbg ?\n  </p>\n </blockquote>\n <p>\n  This might be out of scope for a debugger plugin and would require support on the\n  <code>\n   x64dbg\n  </code>\n  side. The\n  <code>\n   x64dbg\n  </code>\n  plugin would need some functionality to receive variable names from Ghidra and apply them. Most likely possible in general, but I do not know if the Debugger Protocol which Ghidra uses supports this notion.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Florian Magin",
            "time": "Jan 18, 2021 at 10:18",
            "is_accepted": true,
            "comments": []
        }
    ]
}