{
    "title": "Dump Headunit Software",
    "link": "https://reverseengineering.stackexchange.com/questions/26865/dump-headunit-software",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am a computer engineering senior and have a few quick questions i couldn't find any hits about online. I know just enough to get myself into trouble.\n </p>\n <p>\n  Note: I have no specialized tools just a DMM and a raspberry pi. I have experience writing ARM instructions and reverse engineering software. I will most likely wait until i have better tools to attempt this. Just wondering about the approach at the moment.\n </p>\n <p>\n  Backstory: I bought a newer car to replace my 25 year old car. Long story short: the OE headunit has issues and it is very difficult to go aftermarket on this newer car. This got me thinking about what could be done with the stock headunit hardware. I have found datasheets for each IC. I see it has JTAG pins for debugging, serial for talking to a controller on the video board, and a USB connection for flashing firmware updates / uploading image files to flash memory (likely in video board).\n </p>\n <p>\n  Specifics:\n </p>\n <ul>\n  <li>\n   Renesas SH7267 series microcontroller (no internal flash)\n  </li>\n  <li>\n   NXP SAF7741HV DSP\n  </li>\n  <li>\n   Micron M25P16 flash (SPI)\n  </li>\n  <li>\n   Renesas R32C CAN / HID + 1MB flash internal\n  </li>\n </ul>\n <p>\n  Objective: To access data so i can convert it to assembly and examine / modify it. The modifications at minimum would be to change some values for sound shaping via DSP. At maximum it would be UI elements to add a customize-EQ option.\n </p>\n <p>\n  Questions:\n </p>\n <ol>\n  <li>\n   <p>\n    What is the best attack vector for something like this?\n   </p>\n  </li>\n  <li>\n   <p>\n    Will the Micron SPI accessible flash be where the entirety of data is stored? If not, where is most common?\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "260",
    "tags": [
        "firmware",
        "flash",
        "jtag",
        "spi",
        "risc"
    ],
    "user": "DaCoder",
    "time": "Jan 25, 2021 at 13:42",
    "comments": [
        {
            "user": "Remko",
            "text": "<html><body><span class=\"comment-copy\">\n Most headunits have a (hidden) serial port so you could look for TX,RX,GND. Some units eg VW MIB have telnet and/or ssh access via certain USB to ethernet dongles. What kind of unit are you dealing with?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n May also help to mention the make of the car.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Dumping the flash is probably the quickest way to start. You can then inspect the dump for any code, images, or data tables. If that fails you may have to dump the internal flash of the chips or try JTAG but first try the simplest thing, it may well be enough.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Jan 26, 2021 at 8:24",
            "is_accepted": false,
            "comments": [
                {
                    "user": "DaCoder",
                    "text": "<span class=\"comment-copy\">So basically follow a work flow of \"easiest / most convenient first\"? Seems reasonable enough. I've read that JTAG could be disabled for counter-reverse-engineering reasons. I'll get a SPI 8-pin reader/programmer ordered. Thanks!</span>",
                    "time": null
                }
            ]
        }
    ]
}