{
    "title": "Need help learning to extract and modify PS1 ISO files",
    "link": "https://reverseengineering.stackexchange.com/questions/26873/need-help-learning-to-extract-and-modify-ps1-iso-files",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I was wanting to make a randomizer for a playstation game, Parasite Eve 2.\n </p>\n <p>\n  I've spent a ton of time trying to figure this out just googling around and eventually wound up here.\nDoes anyone have an idea of a good starting point for me to just begin learning how to do that? I'm not sure how to extract files or modify them on the ISO. I'm not trying to change models or anything like that. Just swap around some internal IDs like putting a gun where a coke can is supposed to be.\n </p>\n <p>\n  Honestly, I'm not even really sure what to ask for help doing. I've been doing a lot of work in cheat engine and hex editing stuff but that only takes you so far.\nI posted this same question to the reverse engineering reddit, but it mentioned posting here as well so I did.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "2k",
    "tags": [
        "file-format"
    ],
    "user": "NecroCorey",
    "time": "Jan 26, 2021 at 4:52",
    "comments": [
        {
            "user": "wisk",
            "text": "<html><body><span class=\"comment-copy\">\n If your ISO is a \"real\" .iso (\n <code>\n  ISO 9660 CD-ROM filesystem data\n </code>\n ), you can simply mount it on Windows or use 7zip to extract it. The executable should be\n <code>\n  SLUS_<id>.<n>\n </code>\n , you can double check it in\n <code>\n  SYSTEM.CNF\n </code>\n (text file). I'm not sure about repacking it, but I believe some emulators support booting from a folder. Otherwise, any CD-writer should do the trick.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "NecroCorey",
            "text": "<html><body><span class=\"comment-copy\">\n Hey thanks for the reply. It's a bin and cue file, though if I mount the .cue I can \"explore\" the files on the image and see various files in formats I'm not familiar with. There is a SLUS_10.42 file though, which is the ID for the game so you're definitely right about that.  I have the real games though so I can see about trying to rip them myself in ISO format.  In regards to repacking it, I know lots of people have made programs to do this or just edit the image itself, so I can always try to ask them in a more personal way to see if they would be willing to help with that part.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "NecroCorey",
            "text": "<html><body><span class=\"comment-copy\">\n Oh if it helps, here is an image of the folder view.\n <a href=\"https://cdn.discordapp.com/attachments/638384367848259606/803652079372992512/unknown.png\" rel=\"nofollow noreferrer\">\n  cdn.discordapp.com/attachments/638384367848259606/…\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "wisk",
            "text": "<html><body><span class=\"comment-copy\">\n Repacking the ISO should be too hard, and I believe some emulators won't mind emulate it from a extracted folder. I suggest you should disassemble SLUS_10.42 and reverse engineer it, using a built-in cheat feature from an emulator, you will figure out how to achieve your randomizer. :)\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}