{
    "title": "Inbound network queries not appearing in developer tools of browser",
    "link": "https://reverseengineering.stackexchange.com/questions/26895/inbound-network-queries-not-appearing-in-developer-tools-of-browser",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  When trying to understand the behavior of web apps, I find myself stumbling against the fact that some network messages do not appear on the network tab of the web developer tool of the browser. For example, on the web app of whatsapp (\n  <a href=\"https://web.whatsapp.com/\" rel=\"nofollow noreferrer\">\n   https://web.whatsapp.com/\n  </a>\n  ) sending or receiving a message will not leave a line on the network tab.\n </p>\n <p>\n  Here's what I tried to do:\n </p>\n <ol>\n  <li>\n   Try other browsers. I tried firefox, chrome, safari, they all show the same issue\n  </li>\n  <li>\n   Try network sniffing tools. I got lost because there are so many connections I didn't know which one to monitor\n  </li>\n  <li>\n   Try to read through the html code and see which javascript code was creating a connection and receving info. I got lost as well because when reading html and javascript, there are so many lines of code, undocumented, that my brain can not process this in a reasonable amount of time.\n  </li>\n  <li>\n   Noticed there was a service worker. I thought maybe the requests back and forth to the server would be made by the service worker. It did not appear to be the case, and it seemed anyway that service worker requests should appear in the network tab.\n  </li>\n </ol>\n <p>\n  Any explanation or pointer much appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "165",
    "tags": [
        "networking",
        "websites",
        "macos"
    ],
    "user": "DevShark",
    "time": "Jan 28, 2021 at 14:05",
    "comments": [
        {
            "user": "Rok Tavčar",
            "text": "<html><body><span class=\"comment-copy\">\n Are you monitoring network activity in correct iframe? If you arent sure then switch between all of them them in developer tools.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "DevShark",
            "text": "<html><body><span class=\"comment-copy\">\n Hi Rok, the networking tool shows the same thing, regardless of which iframe is selected. Just to be sure, I selected all of them, but the same problem persisted.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Network sniffing tools such as Wireshark are your best bet. That will let you see all the traffic going across a network interface. You can use Statistics > Conversations to help narrow in on the specific network traffic you are interested in. If you post a PCAP, we can help.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "pythonpython",
            "time": "Jan 29, 2021 at 5:48",
            "is_accepted": false,
            "comments": []
        }
    ]
}