{
    "title": "Need starter-help on reverse-engineering a game algorithm",
    "link": "https://reverseengineering.stackexchange.com/questions/26917/need-starter-help-on-reverse-engineering-a-game-algorithm",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've got a dataset of about 1700 attacks in this game. A subset of the data is provided\n  <a href=\"https://pastebin.com/h2ipU90p\" rel=\"nofollow noreferrer\">\n   here\n  </a>\n  . It consists of 9 columns:\n </p>\n <div class=\"s-table-container\">\n  <table class=\"s-table\">\n   <thead>\n    <tr>\n     <th>\n      modifier\n     </th>\n     <th>\n      Astr\n     </th>\n     <th>\n      Aspd\n     </th>\n     <th>\n      Adex\n     </th>\n     <th>\n      Adef\n     </th>\n     <th>\n      Dstr\n     </th>\n     <th>\n      Dspd\n     </th>\n     <th>\n      Ddex\n     </th>\n     <th>\n      Ddef\n     </th>\n    </tr>\n   </thead>\n  </table>\n </div>\n <p>\n  The modifier is in a range of 1 to 3 depending on the ratio between the attackers-stats (\n  <code>\n   Astr\n  </code>\n  ,\n  <code>\n   Aspd\n  </code>\n  ,\n  <code>\n   Adex\n  </code>\n  ,\n  <code>\n   Adef\n  </code>\n  ) and the defenders stats.\n </p>\n <p>\n  This sounds like a simple regression, but there is a layer of obscurenment where the player's stats are reduced depending on how balanced they are.\n </p>\n <p>\n  So we have a \"score\" which is less than the sum if the stats are unbalanced - like having wayy more strength than defense.\n </p>\n <p>\n  I've tried countless different ways to make this adjustment in Excel, but I'm unable to find a good match. Secondly, the values are bound to be rounded, sometimes up and sometimes down. We don't know. The rounding can be on the sum, the score, the resulting ratio and so on.\n </p>\n <p>\n  This is the best result from messing around in Excel:\n  <code>\n   Score = SUM - STDEV\n  </code>\n  . This provides a decent fit,  but it kinda breaks down in the most extreme cases (1 stat that is multiple orders of magnitude greater or smaller than the rest.\n </p>\n <p>\n  I'm looking for any ideas or pointers in which direction I can look to solve this? In my head, this is something to throw through a neural network, but I've got no experience with that. I prefer to work with Python if this is a direction I should look.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "283",
    "tags": [
        "python"
    ],
    "user": "Mixy",
    "time": "Dec 25, 2022 at 9:35",
    "comments": [
        {
            "user": "morsisko",
            "text": "<html><body><span class=\"comment-copy\">\n Are those values generated on client-side?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "pythonpython",
            "text": "<html><body><span class=\"comment-copy\">\n Provide all the data. And more if you can get it.   For the columns, are there bounds on the values?   What is the game written in?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Mixy",
            "text": "<html><body><span class=\"comment-copy\">\n @morsisko: No these are generated server-side  pythonpython: Full dataset provided\n <a href=\"https://pastebin.com/HUcrkryV\" rel=\"nofollow noreferrer\">\n  here\n </a>\n - What do you mean bounds on the values? They are stats for each player and range from 1 to multiple billions in the game. Theres a new effect on the modifier around 1.5B which is why I've filtered out any value > 500M in the dataset. Unfortunately I don't know the language which is used.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "pythonpython",
            "text": "<html><body><span class=\"comment-copy\">\n Are you able to create characters in the game? What happens when an attacker has a constant value for their attributes? 1 or 0 for example? Can you generate data by speccing players?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "SSpoke",
            "text": "<html><body><span class=\"comment-copy\">\n Yes if you can adjust the stats 1 by 1 slowly you can narrow down the equation by sight alone.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  So here's a step toward the answer. First,  look for things which have the same modifier but have different values. Then look for things which have as few different values as possible. That will help simplify the problem:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/hqrGZ.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"example\" src=\"https://i.sstatic.net/hqrGZ.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "pythonpython",
            "time": "Jan 31, 2021 at 23:53",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Mixy",
                    "text": "<span class=\"comment-copy\">Thanks for the tip. To answer the questions you posed in a comment under the OP: Full dataset provided <a href=\"https://pastebin.com/HUcrkryV\" rel=\"nofollow noreferrer\">here</a> - What do you mean bounds on the values? They are stats for each player and range from 1 to multiple billions in the game. Theres a new effect on the modifier around 1.5B which is why I've filtered out any value &gt; 500M in the dataset. Unfortunately I don't know the language which is used.</span>",
                    "time": null
                },
                {
                    "user": "pythonpython",
                    "text": "<span class=\"comment-copy\">The bounds on the value would be the highest and lowest for each column.</span>",
                    "time": null
                },
                {
                    "user": "Mixy",
                    "text": "<span class=\"comment-copy\">1 is lowest. There is no upper bounds. Stats are whole integers. No I'm not able to create new characters as I'm limited to the account I have. In reality the dataset I have has been generated by \"spectating\" others users. It's hard getting data this way</span>",
                    "time": null
                },
                {
                    "user": "pythonpython",
                    "text": "<span class=\"comment-copy\">What is your goal? Given some stats to predict the modifier?</span>",
                    "time": null
                },
                {
                    "user": "pythonpython",
                    "text": "<span class=\"comment-copy\">This is really a machine learning problem not reverse engineering.</span>",
                    "time": null
                }
            ]
        }
    ]
}