{
    "title": "Packers Material for learn how to unpack software",
    "link": "https://reverseengineering.stackexchange.com/questions/26997/packers-material-for-learn-how-to-unpack-software",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I would like to known where i can found guides to learn how to unpack packers like Themida, Armadillo, VMProtect, etc. I was searching challenges and guides but i could not found for packers, only other types of challenges. I have to learn how unpack that type of software, i'm new in this world of RE but i need to learn this. Thanks in advance.\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "495",
    "tags": [
        "packers"
    ],
    "user": "Pablo Diaz",
    "time": "Feb 11, 2021 at 18:13",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you are just starting out learn Assembly and Study C, and don't try to learn how to \"unpack\" commercial protectors (They are commercial for a reason), even if you want to insist on the error easily you will find scripts to do all the work for you, but I ask you, will you learn something new or just say that you know how to unpack with someone else's scripts? focus on the base, I recommend that you read\n  <strong>\n   <a href=\"https://beginners.re/main.html\" rel=\"nofollow noreferrer\">\n    beginners RE\n   </a>\n  </strong>\n  , if you want an excellent book read\n  <strong>\n   Practical Reverse Engineering: X86, X64, ARM, Windows Kernel\n  </strong>\n  (\n  <strong>\n   ISBN: 9781118787250\n  </strong>\n  ), these books will teach you the necessary basics, after finishing your reading you will be able to unpack simple protections, and with a focus you will learn the tricks of commercial protectors and how to get rid of them and differentiate code virtualization, good studies.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Happy",
            "time": "Feb 11, 2021 at 18:23",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Happy",
                    "text": "<span class=\"comment-copy\">if you want to insist on this error, here is an unpack tutorial for vmprotect, but remember what I said: <a href=\"https://youtu.be/aoa89Khfgr0\" rel=\"nofollow noreferrer\">youtu.be/aoa89Khfgr0</a></span>",
                    "time": null
                },
                {
                    "user": "Pablo Diaz",
                    "text": "<span class=\"comment-copy\">Thank you for your answer, it was really helpful. We start with the study (it was a group research) because we understand that the most important thing it is to know the bases of RE.</span>",
                    "time": null
                }
            ]
        }
    ]
}