{
    "title": "Best way from high level software developer to malware analyst",
    "link": "https://reverseengineering.stackexchange.com/questions/27025/best-way-from-high-level-software-developer-to-malware-analyst",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am a software developer with commercial experience in Python and mainly Scala working on high level programming, e.g. REST APIs, and only personal/university projects experience in C++.\n </p>\n <p>\n  I would like to work as a reverse engineer and I am very passionate about low level software. Do you believe working as a C++ developer would help in the transition to malware analyst? would it be worth it in order to achieve my goal, also considering the not increasing salary when changing job in such an horizontal way?\n </p>\n <p>\n  I would really appreciate your help given my level of confusion on how to approach this career change\n </p>\n <p>\n  Thanks in advance !!\n </p>\n <p>\n  Giulia\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "134",
    "tags": [
        "malware",
        "career-advice"
    ],
    "user": "Giulia Ippoliti",
    "time": "Feb 16, 2021 at 12:57",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n I think it's really opinion-based. For some it might help, for some it might not.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Happy",
            "text": "<html><body><span class=\"comment-copy\">\n If you like it, it seems like a golden opportunity, go there and good luck, it will be a great experience for you, success, respondendo, yes developing in C ++ help but you will have to study other basic concepts of RE, I left some cool materials in an answer:\n <a href=\"https://reverseengineering.stackexchange.com/questions/26997/packers-material-for-learn-how-to-unpack-software/26998#26998\" title=\"packers material for learn how to unpack software\">\n  reverseengineering.stackexchange.com/questions/26997/…\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Giulia Ippoliti",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks for your comments! It is really helpful to hear multiple opinions. At the moment I work with Scala which runs on the JVM and my current role is taking me to become more and more expert on Scala, but as you know I want to move to malware RE. So from here I wonder what is the relevance of my experience...would it be equally useful for RE purposes to be a proficient software dev in a language other the C++? Thanks again for your help!\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}