{
    "title": "Reverse engineer decryption of cookie",
    "link": "https://reverseengineering.stackexchange.com/questions/27097/reverse-engineer-decryption-of-cookie",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <h1>\n  TL; DR\n </h1>\n <p>\n  Is there any way you might suggest decrypting this cookie? It was saved under the name\n  <em>\n   mail\n  </em>\n  , so I suspect it encrypts an email address:\n </p>\n <p>\n  <code>\n   4520382156EFC790B5B54696C4E175B5695F03D2D59C33858A62D6CDA18B7AB2\n  </code>\n </p>\n <p>\n  <strong>\n   Edit:\n  </strong>\n  Here is another one using another account:\n </p>\n <p>\n  <code>\n   BFE069DB7B7FDED51A7F81DF8CE3CAD8FB8B14D70BE3FA32F26C4A2136170CD6\n  </code>\n </p>\n <h2>\n  Motivation\n </h2>\n <p>\n  When using a web portal, I noticed the same cookie is generated for my username every single time (i.e., it does not appear to be random). My concern is that there are several API endpoints with private info that can be accessed anonymously just using said string in the URL.\nI suspect the string is a kind of user identifier, but I am not sure if it is generated using the values from my email address, or randomly based on time of creation.\n </p>\n <h2>\n  More details\n </h2>\n <p>\n  I can't go into specifics as I don't want this flaw to be exposed, compromising my info and getting me into trouble. However I know the portal is hosted on\n  <strong>\n   Microsoft IIS Server\n  </strong>\n  and built using the\n  <strong>\n   ASP.NET\n  </strong>\n  framework. I also suspect the implementation is rudimentary, so they probably aren't doing anything more sophisticated.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "645",
    "tags": [
        "decryption",
        "websites"
    ],
    "user": "edvilme",
    "time": "Feb 24, 2021 at 20:24",
    "comments": [
        {
            "user": "morsisko",
            "text": "<html><body><span class=\"comment-copy\">\n Might be possible might be not, it's not possible to tell using information you provided. If the length is const no matter how long is your mail it's probably hasing function and you can't recover data from it.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Remko",
            "text": "<html><body><span class=\"comment-copy\">\n Looks like a hash, length matches a sha256 hash...\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n As the data is hex encoded I would also assume it is a hash value. Encrypted values are often larger and therefore more often base64 encoded as it is more efficient. Reconstructing a hash is very complicated as you don't know what additional data is included in the hash.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <h1>\n  Findings\n </h1>\n <p>\n  After some digging around in GitHub (turns out several of the portal component's source code is worryingly on GitHub, although I had to decompile it), I discovered that the string is generated using the\n  <strong>\n   AES Rijndael Algorithm\n  </strong>\n  .\n </p>\n <p>\n  I was able to succesfully generate the second string using an arbitrary key like\n  <code>\n   \"#lk$.346hopHXIsd\"\n  </code>\n  (changed for security reasons). I was unable to do the same for the first one. I suspect a different key is used as both emails correspond to two different kinds of users. I will draft a program that will brute force several keys until it finds a match. Will report back in case this helps (or entertains) anyone.\n </p>\n <p>\n  <strong>\n   Edit:\n  </strong>\n </p>\n <p>\n  I found a GitHub repo that did several requests to the server, so figured it might have some answers. After browsing through the code, and decompiling a source file (conveniently named Authentication), I extracted the key.\n </p>\n <p>\n  <strong>\n   Edit 2:\n  </strong>\n </p>\n <p>\n  The key matched one of the cyphered strings. However, as @Robert points out, it is virtually impossible to brute force the algorithm. I will try other methods. I leave this thread open to suggestions and in case it is of help to anyone :D\n </p>\n <p>\n  <strong>\n   Edit 3:\n  </strong>\n  Solved.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "edvilme",
            "time": "Mar 23, 2021 at 23:33",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Robert",
                    "text": "<span class=\"comment-copy\">Good luck, unless the AES key generator respectively password generator is not totally broken a brute-force attack may require a few dozen up to a few hundred years.</span>",
                    "time": null
                },
                {
                    "user": "edvilme",
                    "text": "<span class=\"comment-copy\">LOL, yup. Got excited when it worked and I assumed it would be pretty straightforward then. I then realized the millions of combinations needed and how the algorithm is designed to prevent such brute force attacks. Will try to search for similar code online to test my luck. Thanks for the answer :D</span>",
                    "time": null
                }
            ]
        }
    ]
}