{
    "title": "Ghidra : iOS Application : Mach-O binary -> Symbol files of dylib or framework are not generated",
    "link": "https://reverseengineering.stackexchange.com/questions/27148/ghidra-ios-application-mach-o-binary-symbol-files-of-dylib-or-framework-a",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm performing my first reverse on a Mach-O file binary through Ghidra. My problem is that Ghidra doesn't create symbol files of the dylib/frameworks that are loaded in the project. It is really problematic because I want to trace the calls through these libraries. (ARM64v8-a, iOS 13.6, image extracted with Cellebrite with checkra1n)\n </p>\n <p>\n  Here we can see there is no found functions below the import. All these external librairies are loaded in the project. (Some of them have been extracted from the dyld_shared_cache, therefore maybe some are not completely reconstructed. But others are intacts)\n  <a href=\"https://i.sstatic.net/3peeW.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/3peeW.png\"/>\n  </a>\n </p>\n <p>\n  If I try with a PE file, the function are detected and the symbol file is created under the config folder of Ghidra, but not with any dylib binaries :\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/PVCsQ.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/PVCsQ.png\"/>\n  </a>\n </p>\n <p>\n  I have found that Hopper succeeds to find references to these external binaries. (Free Version)\n </p>\n <p>\n  I could just find symbol files online, but until now I did not find a single one, moreover several librairies are relative to the application. (Any application of the analyzed iPhone 8 has the same problem, so I don't think it is related to the analyzed app)\n </p>\n <p>\n  Someone had this problem ?\n </p>\n <p>\n  Someone knows where to find symbol files for iOS ?\n </p>\n <p>\n  Thank you for reading.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ghidra",
        "ios",
        "mach-o",
        "libraries",
        "arm64"
    ],
    "user": "Kojud",
    "time": "Mar 4, 2021 at 3:12",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It's very likely that Ghidra doesn't know how to read the symbols from the dyld_shared_cache. You can try to use a different tool like IDA PRO, Rizin or radare2 or Cutter, etc.\n </p>\n <p>\n  But, which binary are you trying to reverse? Do you know which functions do you want to trace?\nYou can use the tool jtool, read more on\n  <a href=\"http://www.newosxbook.com/tools/jtool.html\" rel=\"nofollow noreferrer\">\n   jtool - Taking the O out of otool(1), and so much more\n  </a>\n  there is a part where he shows how to get the functions using the tool\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "BadSugar",
            "time": "Jun 23, 2021 at 15:47",
            "is_accepted": false,
            "comments": []
        }
    ]
}