{
    "title": "Attaching gdb to hidden library/process",
    "link": "https://reverseengineering.stackexchange.com/questions/2717/attaching-gdb-to-hidden-library-process",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  On OSX I'm trying to debug/attach to a framework that the application unarchives at runtime. The frame work normally resides in the /Resources folder within the application bundle as .gz file.\n </p>\n <p>\n  The problem I'm having is that framework doesn't appear to show up anywhere in the processes that I can see. Besides that I have no idea how to attach to it while it's loaded in memory to set a breakpoint so I can start debugging.\n </p>\n <p>\n  Any tips or advice on the peculiarly crafted framework would be appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "7",
    "answers": 1,
    "views": "458",
    "tags": [
        "debuggers",
        "gdb"
    ],
    "user": "Joe Habadas",
    "time": "Aug 31, 2013 at 6:10",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n You should be a little more specific. There are ways to attach to forked children. The way you write the question it's a bit too unspecific. E.g. how to give advice on something we don't know what it is?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I don't have experience of OSX, but at the least in Linux you can do this:\n </p>\n <p>\n  First, get some idea what system calls (\n  <code>\n   syscall\n  </code>\n  or\n  <code>\n   int 80h\n  </code>\n  in Linux) the library might be using, if any. You can use your favorite disassembler or code tracer for this part. If the library itself does not have any system calls, find out or deduce what system calls its child functions may be using. If you have no idea or this step gets too difficult due to the size and/or complexity of the library, you can skip this first part.\n </p>\n <p>\n  Then, start\n  <code>\n   gdb\n  </code>\n  with the program. If by now you already know which system calls to catch, then catch only those. Otherwise catch them all. The command is\n  <code>\n   catch syscall\n  </code>\n  . Then\n  <code>\n   r\n  </code>\n  to run the program.\n </p>\n <p>\n  At this point I usually do\n  <code>\n   disp/10i $pc\n  </code>\n  to see a little a bit of the code.\n </p>\n <p>\n  Once you're inside the system call, do\n  <code>\n   backtrace\n  </code>\n  to print the stack frames. Set breakpoints in all of them or only in the ones you're interested of. The instruction to use is\n  <code>\n   break\n  </code>\n  , for example\n  <code>\n   break *0xdeadbeef\n  </code>\n  . Then\n  <code>\n   continue\n  </code>\n  .\n </p>\n <p>\n  If you arrived in the desired library or function, great. If not, then\n  <code>\n   delete\n  </code>\n  the breakpoint you arrived in and then\n  <code>\n   continue\n  </code>\n  , and repeat until you arrive in the function you're interested of.\n </p>\n <p>\n  Hope this helps.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "nrz",
            "time": "Sep 1, 2013 at 8:20",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">To find out about system calls you could use <code>ktrace</code>, <code>dtrace</code> and <code>struss</code>, depending on the OSX version.</span>",
                    "time": null
                }
            ]
        }
    ]
}