{
    "title": "Is it possible to see the traffic on Virtual COM Port to reverse engineer how a device works?",
    "link": "https://reverseengineering.stackexchange.com/questions/27364/is-it-possible-to-see-the-traffic-on-virtual-com-port-to-reverse-engineer-how-a",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a USB device that when connected into the computer ends up showing up as 4 Virtual COM ports in the device manager. As far as I know, two of these are never used. One of them is seldom used and one is mostly used. This is from the perspective of the application that is used with this device. I want to see the traffic on these COM ports and find out how this device works. I have Windows 10 64-bits.\n </p>\n <p>\n  I just need to monitor the traffic and no read or write anything myself. I think this is called a \"man in the middle\" approach. How do this using software on PC?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "792",
    "tags": [
        "serial-communication",
        "sniffing"
    ],
    "user": "quantum231",
    "time": "Mar 31, 2021 at 14:08",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I haven’t used it myself but I think com0com or one of the related projects should help\n </p>\n <p>\n  <a href=\"http://com0com.sourceforge.net\" rel=\"nofollow noreferrer\">\n   http://com0com.sourceforge.net\n  </a>\n </p>\n <p>\n  In particular, hub4com sounds promising:\n </p>\n <blockquote>\n  <p>\n   The HUB for communications (hub4com) is a Windows application and is a\npart of the com0com project.\n  </p>\n  <p>\n   It allows to receive data and signals from one port, modify and send\nit to a number of ports and vice versa.\n  </p>\n  <p>\n   In conjunction with the com0com driver the hub4com allows to\n  </p>\n  <ul>\n   <li>\n    handle data and signals from a single real serial device by a number of\ndifferent applications. For example, several applications can share data\nfrom one GPS device;\n   </li>\n   <li>\n    use real serial ports of remote computer like if they exist on the local\ncomputer.\n   </li>\n  </ul>\n </blockquote>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Apr 1, 2021 at 19:59",
            "is_accepted": false,
            "comments": [
                {
                    "user": "quantum231",
                    "text": "<span class=\"comment-copy\">Where can I find out more about such programs?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@quantum231 follow the link</span>",
                    "time": null
                },
                {
                    "user": "quantum231",
                    "text": "<span class=\"comment-copy\">See an application already exists and it writes to this virtual COM port. All I need is a \"man in the middle\" to observer what is being sent either way. It does not seem like the com0com can do this because this program emulates COM ports. Am I wrong?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@quantum231 it sounds like hub4com should allow it</span>",
                    "time": null
                }
            ]
        }
    ]
}