{
    "title": "Extracting strings from binary files (.exe)",
    "link": "https://reverseengineering.stackexchange.com/questions/27480/extracting-strings-from-binary-files-exe",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This question has been asked quite a lot especially on stackoverflow, but the solutions/replies are not clear or extensive.\n </p>\n <p>\n  What I`m looking for is to build what\n  <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/strings\" rel=\"nofollow noreferrer\">\n   Strings\n  </a>\n  does from Sysinternals. My goal is to read any windows binary files and extract all the strings ASCII/UNICODE in a fast and efficient way.\n </p>\n <p>\n  At the moment I`m opening the file from disk, reading into a buffer, and then assigning that buffer into a vector and using booyer_moore search. This operation is pretty CPU expensive, especially when the file is big (a few mb) and because the code searches through \"everything\".\n </p>\n <p>\n  I've found this\n  <a href=\"https://github.com/glmcdona/strings2\" rel=\"nofollow noreferrer\">\n   https://github.com/glmcdona/strings2\n  </a>\n  but it does not support x64 due to the approach taken, and I cannot seem to find any source code for the Sysinternals tool.\n </p>\n <p>\n  Would it be possible to show me (even some pseudo code) on how to approach this matter?\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "4k",
    "tags": [
        "windows",
        "c++",
        "c",
        "winapi"
    ],
    "user": "Mecanik",
    "time": "Apr 16, 2021 at 4:43",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If all you're trying to do is replicate what the SysInternals project  does, the strings2 project you linked does that and should suit your purposes. The x86/x64 thing is only for a special extraction mode they added, which is separate from the functionality of SysInternals Strings.\n </p>\n <p>\n  On the other hand, if you do need to extract strings stored more sneakily (stack, obfuscation etc.), take a look at\n  <a href=\"https://www.fireeye.com/blog/threat-research/2016/06/automatically-extracting-obfuscated-strings.html\" rel=\"nofollow noreferrer\">\n   FLOSS\n  </a>\n  .\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "hairlessbear",
            "time": "Apr 16, 2021 at 5:40",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Mecanik",
                    "text": "<span class=\"comment-copy\">I don't really understand what's going on in that \"strings2\" project, everything is everywhere... and a ton of code for no reason. I was thinking of something much simpler, looking \"inside\" of sysinternals strings project (at least the very old one), the author makes use of _ismbcprint, IsCharAlphaNumericW and other things in just a couple of lines.</span>",
                    "time": null
                }
            ]
        }
    ]
}