{
    "title": "trying to identify this SOP14 chip",
    "link": "https://reverseengineering.stackexchange.com/questions/27494/trying-to-identify-this-sop14-chip",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to find out what is this chip I have two devices that have this chip in them one of them stopped working and the problem was from this chip(I know that because when I removed that same chip from the other working device the not working device is working again fine) but the chip marking is erased.\n  \n\n  the chip is a 14Pin chip (SOP14) with PIN7 as VSS and PIN14 as VDD\n  \n\n  so I got the oscilloscope and tested all the pins while the device is on and this is what I got.\nthe first image shows what I got from pins 1 to 6. the pins 1,3,5 as Yellow on the oscilloscope (LOW) and pins 2,4,6 as Blue (HIGH) in the oscilloscope.\n  <a href=\"https://i.sstatic.net/qK1Ju.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/qK1Ju.jpg\"/>\n  </a>\n </p>\n <p>\n  so far I though that its a hex inverter so I bought a HEF4069 and slapped it on but it doesn't work as expected (pins 1 to 6 work as the previous chip but pins 8 to 11 is diferent from the original chip).\nhere is the reading from pins 8,10 as blue in the image and pin 9,11 as yellow.\n  <a href=\"https://i.sstatic.net/dUE1l.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/dUE1l.jpg\"/>\n  </a>\n </p>\n <p>\n  but when I put HEF4069 pins 8 to 11 behave just like pins 1 to 6 and there is no square wave or saw tooth wave as in the second image.\n  \n\n  I also tried removing that chip and testing where it was connected but somehow the microcontroller doesn't send that saw tooth wave to the chip any more and the same happens when HEF4069 is connected.\n  \n\n  only when the original chip is connected that I get the second image result.\n  \n\n  so i'm stuck and don't know what to do to figure out what that chip is.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "103",
    "tags": [
        "hardware"
    ],
    "user": "Jwdsoft",
    "time": "Apr 17, 2021 at 18:45",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I found out what it is it was an\n  <a href=\"https://en.wikipedia.org/wiki/Schmitt_trigger#Inverting_Schmitt_trigger\" rel=\"nofollow noreferrer\">\n   Inverting Schmitt trigger\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "0xC0000022L",
            "time": "Apr 19, 2021 at 14:22",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Abdullah Mohamed",
                    "text": "<span class=\"comment-copy\">Can you elaborate please? I'm interested to know how did you reach to that conclusion technically.</span>",
                    "time": null
                },
                {
                    "user": "Jwdsoft",
                    "text": "<span class=\"comment-copy\">I know that its an inverter just from the oscilloscope when the input is low the output is high and vice versa so I thought its a hex inverter.tried it but didn't work after that I noticed the saw tooth have only a slight variation between two voltages and the effect is magnified in the output and inverted so that must be an inverted schmidt trigger and it was correct</span>",
                    "time": null
                },
                {
                    "user": "Abdullah Mohamed",
                    "text": "<span class=\"comment-copy\">Makes sense, thanks for sharing the insights!</span>",
                    "time": null
                }
            ]
        }
    ]
}