{
    "title": "Reverse engineer sticky notes to allow external script to open new notes",
    "link": "https://reverseengineering.stackexchange.com/questions/27522/reverse-engineer-sticky-notes-to-allow-external-script-to-open-new-notes",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  For a silly little project I wanted to do, I wanted to make it so that I could open new notes (Microsoft Sticky Notes) from an external script - preferably python. Although I'm not good at reverse engineering I thought that it shouldn't be too hard because I\n  <em>\n   thought\n  </em>\n  it was a standalone exe.\nIt was only until I couldn't launch the exe on it's own that I realised it's a UWP app which means I couldn't do my go-to debugging it in IDA.\n </p>\n <p>\n  (Just to mention now, I noticed that sticky notes always has two processes running -\n  <code>\n   ApplicationFrameHost\n  </code>\n  which I assume is the main sticky notes window and another process which I assume is the actual open sticky notes. All the methods I've tried, I've tried on both processes to be certain.)\n </p>\n <p>\n  I started by opening sticky notes in IDA and trying to use the debugger, but as mentioned, that didn't get me too far so I opened it up in Binary Ninja instead, just to explore a bit. I didn't know what to look for, so I didn't find much. However, BN did show a lot of strings except apparently they aren't used anywhere in the program. Things like:\n </p>\n <pre><code>BCreateStickyNoteViaJumplistAction - \"Jumplist\" is also in the name of the plus icon used as the button - C:\\Program Files\\WindowsApps\\Microsoft.MicrosoftStickyNotes_3.8.8.0_x64__8wekyb3d8bbwe\\Assets\\JumpListNewNote.png`\nCreateNewNote .... WithNewStickyNote\nTryGet_ViewState_IsSticky\n</code></pre>\n <p>\n  and lots of what looks like C# code. But as I mentioned, BN showed no references to these (and other) strings and as I'll mention later, the strings in x64dbg all seemed \"encoded\" so I never found a use for these anyway.\n </p>\n <p>\n  Next I think I tried out WinDBG (preview). I tried first by just attaching it to the running sticky notes process (and then launching the app using the\n  <code>\n   launch app package\n  </code>\n  ) but I wasn't able to do anything with that. It just told me the DLL's that were being loaded, including the ones missing which means I couldn't launch the exe directly, like:\n </p>\n <pre><code>C:\\Program Files\\WindowsApps\\Microsoft.NET.Native.Runtime.2.2_2.2.28604.0_x64__8wekyb3d8bbwe\\mrt100_app.dll\nC:\\Program Files\\WindowsApps\\Microsoft.NET.Native.Framework.2.2_2.2.29512.0_x64__8wekyb3d8bbwe\\SharedLibrary.dll\n</code></pre>\n <p>\n  Maybe it's possible to somehow point the exe to these DLL so I could launch it via IDA but I think it's a stretch.\n </p>\n <p>\n  I did a few other small things here and there like ollydbg and\n  <a href=\"http://www.codedebug.com/php/Products/Products_NikPEViewer_20v.php\" rel=\"nofollow noreferrer\">\n   PE Disassembler viewer\n  </a>\n  but they are not of significance.\n </p>\n <p>\n  The thing I have been trying the most is x64dbg. On my own, I didn't really get anything done; I didn't find anything related to buttons or their handler's. So I tried googling to see if someone else had tried reverse engineering a UWP and came across\n  <a href=\"https://reverseengineering.stackexchange.com/questions/17127/how-to-reverse-engineer-a-windows-10-uwp-app\">\n   this\n  </a>\n  . I gave the second answer a go, since it was quicker to do at the time. However, when you click to open a new note, no new DLL's will be loaded so I couldn't use that. I tried also breaking when a new thread is created which did cause it to stop execution when I created a new note but I don't think each new note is its own thread, I think that was just some other internal Windows thing.\n </p>\n <p>\n  The reason I didn't try the first answer is that they hook into\n  <code>\n   CreateFileW\n  </code>\n  from\n  <code>\n   KernelBase.dll\n  </code>\n  to \"redirect\" the resources accessed, since it loads a new DLL when\n  <code>\n   Restart now\n  </code>\n  is pressed, but again, in my situation, nothing new is loaded when a new note is created.\nI did also try EventHook and just using\n  <code>\n   GetProcessById\n  </code>\n  to get the sticky notes process but that doesn't really expose much.\n </p>\n <p>\n  I feel like I have what I need to do this, I just don't quite know how. If anyone could point me in the right direction I'd really appreciate it.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "382",
    "tags": [
        "ida",
        "debugging",
        "windbg",
        "x64dbg"
    ],
    "user": "DreamingInsanity",
    "time": "Jun 17, 2021 at 15:31",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am not sure what you are asking (never used sticky notes and don't have it installed )\n  \n\n  but if you want to run sticky notes from command line you can do something like this\n </p>\n <p>\n  the command below will run calculator instead of the wildcard\n  <em>\n   calc\n  </em>\n  use\n  <em>\n   stick\n  </em>\n </p>\n <pre><code>C:\\>powershell -c \"(get-startapps -name *calc*).Appid\nMicrosoft.WindowsCalculator_8wekyb3d8bbwe!App\n\nC:\\>start shell:appsfolder\\Microsoft.WindowsCalculator_8wekyb3d8bbwe!App\n</code></pre>\n <p>\n  you can obviously use this with python withsomething like\n </p>\n <pre><code>C:\\>python -c \"import os;os.system(\\\"start explorer shell:appsfolder\\Microsoft.WindowsCalculator_8wekyb3d8bbwe!App\\\")\"\n</code></pre>\n <p>\n  if you need to start a new note from a script checkout\n </p>\n <pre><code>:\\>pip show uiautomation\nName: uiautomation\nVersion: 2.0.11\nSummary: Python UIAutomation for Windows\nHome-page: https://github.com/yinkaisheng/Python-UIAutomation-for-Windows\nAuthor: yinkaisheng\nAuthor-email: yinkaisheng@live.com\nLicense: Apache 2.0\nLocation: c:\\python39\\lib\\site-packages\nRequires: comtypes\nRequired-by:\n</code></pre>\n <p>\n  with this it is a single liner the Name =\"New Note\" is taken from your comments  be aware the uwp app needs to be in foreground for this to work\ntooltip remark\n </p>\n <pre><code>:\\>python -c \"import uiautomation as auto;auto.ButtonControl(Seachdepth=1,Name =\\\"New note\\\").Click()\"\n</code></pre>\n <p>\n  a gif\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/4IrZz.gif\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/4IrZz.gif\"/>\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "blabb",
            "time": "Apr 23, 2021 at 20:55",
            "is_accepted": true,
            "comments": [
                {
                    "user": "DreamingInsanity",
                    "text": "<span class=\"comment-copy\">My bad, I should have been more clear. When you open sticky notes, there's a button in the top left with the tooltip \"New note\" when you click that button, it opens a new sticky note. My goal is to to be able to be able to find the code that handles that button click, but call it from a different script, simulating someone clicking on that button.</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">you cannot send keystrokes to a uwpapp look for uiautomation  the sdk tool inspect.exe has an action menu  it has a DoDefaultAction() or Invoke() action clicking that will normally result in actions like hitting enter on the focussed  ui element</span>",
                    "time": null
                },
                {
                    "user": "DreamingInsanity",
                    "text": "<span class=\"comment-copy\">That's actually really helpful, thank you! It might now be possible to do what I want to do.</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">I edited the answer to point to a possible readymade solution  take a look</span>",
                    "time": null
                },
                {
                    "user": "DreamingInsanity",
                    "text": "<span class=\"comment-copy\">Looks perfect for what I need, thanks!</span>",
                    "time": null
                }
            ]
        }
    ]
}