{
    "title": "Automated data tracking during runtime in IDA PRO",
    "link": "https://reverseengineering.stackexchange.com/questions/27550/automated-data-tracking-during-runtime-in-ida-pro",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  What I mean specifically is that I want to turn a certain piece of memory into a virus that will attach itself to anything that has anything to do with it. For example:\n </p>\n <pre><code>call sub_404505\n; Lets say that sub_404505 returns a 32-bit integer in EAX register\n; Here, I want to turn the EAX register into a virus\nmov [esp + 0x?? + var_14], eax\nmov some_global_offset, eax\n; Here, I want this virus to extend to some_global_offset and var_14 stack address\n; Later, if any read/write intructions has any reference to these addresses, I want IDA PRO to dump the intructions as well as the address of the intructions to output window\n; This virus will remain in place until the value is reset, for example:\nxor eax, eax\n</code></pre>\n <p>\n  Is it possible to do something like this in IDA PRO, Windows 10?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "109",
    "tags": [
        "ida"
    ],
    "user": "Sober",
    "time": "Apr 25, 2021 at 4:39",
    "comments": [
        {
            "user": "Orwellophile",
            "text": "<html><body><span class=\"comment-copy\">\n Not to be impolite, but see at least three reasons why you will not receive an answer.  We're here to reverse engineer things, not make viruses.  IDA is not a virus making tool.  You're quoting 32bit code samples.  And – not to be impolite – your question is somewhat vapid and diaphanous, and your goals appear to be somewhat dubious.  Don't misunderstand me, I wrote a 32bit virus that attached itself to .com files when I was 16, which was around 1992, I didn't release it of course.  It was just about learning TSR techniques.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Rup",
            "text": "<html><body><span class=\"comment-copy\">\n It sounds like you actually want a conditional breakpoint when a value gets modified, not a virus, although for a value in a register. Which I don’t think is easily possible, especially if you want to track the value through transfer between registers, moving on and off the stack, etc. I think you’ll have to do some of that analysis manually.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Sober",
            "text": "<html><body><span class=\"comment-copy\">\n As mentioned by @Rup, what I meant by virus here is mostly in reference to its 'contagious' property, I'm not really trying to do anything malicious. I was hoping that there'd be some way to automate the process mentioned by Rup either via native IDA PRO tools or even some idapython scripting.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}