{
    "title": "Harman Kardon firmware reverse engineering",
    "link": "https://reverseengineering.stackexchange.com/questions/27580/harman-kardon-firmware-reverse-engineering",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  First of all, I'm very new to reverse engineering, but I know about hex, binary, opcodes, et cetera.\n </p>\n <p>\n  I'm trying to reverse engineer a Harman Kardon firmware file, because I think there are some API calls hidden in the firmware that may be useful for home automation.\n </p>\n <p>\n  For some reason, binwalk only says there is a XML file in the firmware (but doesn't extract it). And there seems to be some MIPS16e instructions in it, which I don't know how to extract.\n </p>\n <p>\n  <code>\n   binwalk -AB\n  </code>\n  output:\n </p>\n <pre><code>DECIMAL       HEXADECIMAL     DESCRIPTION\n--------------------------------------------------------------------------------\n504842        0x7B40A         MIPS16e instructions, function prologue\n777848        0xBDE78         XML document, version: \"1.0\"\n</code></pre>\n <p>\n  I also checked the file for other texts (which are in it). Therefore, I think it isn't encrypted.\nThe \"XML document\" is only this:\n  <code>\n   <?xml version=\"1.0\" encoding=\"UTF-8\"?><harman><avr><common><status><name>\n  </code>\n  .\n </p>\n <p>\n  After that, only other random texts, which can be seen in the menu of the device, are showed.\n </p>\n <p>\n  I don't know if it is okay to dump the firmware here, so I won't unless someone asks for it.\n </p>\n <p>\n  How to proceed in reverse engineering this?\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "2k",
    "tags": [
        "firmware",
        "firmware-analysis",
        "binwalk"
    ],
    "user": "Lars Jansen",
    "time": "Apr 29, 2021 at 7:31",
    "comments": [
        {
            "user": "lucky thandel",
            "text": "<html><body><span class=\"comment-copy\">\n can u provide us the file?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Lars Jansen",
            "text": "<html><body><span class=\"comment-copy\">\n Here you go:\n <a href=\"https://drive.google.com/file/d/1JRncIgYMKWy5xCbeQye-P0va4NVG1Mkm/view?usp=sharing\" rel=\"nofollow noreferrer\">\n  drive.google.com/file/d/1JRncIgYMKWy5xCbeQye-P0va4NVG1Mkm/…\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Francesco",
            "text": "<html><body><span class=\"comment-copy\">\n which chip contains the firmware???\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you run\n  <code>\n   strings\n  </code>\n  on your firmware file, you can typically get a lot of helpful information. In this case, since I don't know what your device is other than a Harman Kardon \"something,\" I searched through the strings in a text editor until I found the line\n </p>\n <blockquote>\n  <p>\n   User-Agent:Harman Kardon AVR151/AVR1510\n  </p>\n </blockquote>\n <p>\n  Just to double-check the firmware does belong to the Harman Kardon AVR151/1510, I downloaded the latest release from\n  <a href=\"https://www.harmankardon.com/software.html\" rel=\"nofollow noreferrer\">\n   their website\n  </a>\n  and did a binary diff between that firmware and the firmware you linked. Strangely enough, the firmware you linked and the one on Harman Kardon's website are only different by the first byte in the file; the rest of the bytes in each file are identical.\n </p>\n <p>\n  Finding out what processor is in there can be tricky. You could take it apart and look, but you probably don't need to (and if it's under warranty, that can be a risky proposition, but then again so can modifying the firmware...) For a lot of devices, you can get internal photos by searching\n  <code>\n   FCC [device name]\n  </code>\n  because devices using the radio spectrum in the US have to go through FCC certification. The FCC page for this family of receivers provides\n  <a href=\"https://fccid.io/APIAVR1610AN/Internal-Photos/Internal-photos-1878949\" rel=\"nofollow noreferrer\">\n   internal photos\n  </a>\n  , but they're too low-res to figure out what ICs are in there. A good next step is searching\n  <code>\n   AVR151 teardown\n  </code>\n  and\n  <code>\n   AVR151 repair\n  </code>\n  since, for most devices, someone's opened it up and tried to repair it. In this case, I found a\n  <a href=\"https://www.youtube.com/watch?v=iubls0DAOIk\" rel=\"nofollow noreferrer\">\n   youtube video\n  </a>\n  of someone performing a board level repair on the AVR151 and at about 8m44s, you can see a shot of the main logic board showing all the components on it:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/pCIGd.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"screenshot from a youtube video showing the logic board from the AVR-151 with visible ICs\" src=\"https://i.sstatic.net/pCIGd.jpg\"/>\n  </a>\n </p>\n <p>\n  The STM32 on the bottom left seems to be the main programmable IC on the board, with the part number STM32F205Z6T6 (\n  <a href=\"https://www.st.com/resource/en/datasheet/stm32f205rb.pdf\" rel=\"nofollow noreferrer\">\n   pdf\n  </a>\n  ). The Analog Devices chip goes to the HDMI ports on the back panel and is an ADV7623 HDMI transceiver (you can also find a couple references to the ADV7623 in the\n  <code>\n   strings\n  </code>\n  output for the firmware file.) The ESMT chip is an SDRAM, and the CS497024 is an audio DSP. The chips on the right side that are cut off are another audio DSP and a Frontier Silicon Chorus FS1230, which looks like an SoC meant for integrated audio tuners and other devices, since it connects to an RF front-end as well as displays, non-volatile storage, networking, etc. (\n  <a href=\"https://frontiersmart.com/sites/default/files/Chorus3_PB.pdf\" rel=\"nofollow noreferrer\">\n   pdf\n  </a>\n  ). I believe it is also programmable, but beyond that data brief PDF, I can't find much information on the chip.\n </p>\n <p>\n  If you look at the datasheet for the STM32F205Z6T6, it's got 1MB of flash memory, but the firmware file you posted is 3MB, so chances are there's more than just STM32 firmware in that file. If you analyze the entropy in the posted firmware, you see a couple distinct regions of high entropy (\n  <a href=\"https://i.sstatic.net/l7Uzt.jpg\" rel=\"nofollow noreferrer\">\n   image, linked because it's very tall\n  </a>\n  )* separated by blank space represented as white blocks, so my guess is there's a region of code for the bootloader, another region for the main firmware for the STM32F205, and probably some data that could be written to non-volatile storage, firmware/configuration for the FS1230, or any number of other things, and not necessarily in that order.\n </p>\n <p>\n  If you look at the file at offset 0xFFFFF (1MB, or the size of the STM32F205 flash), you'll see there's a pretty sharp break between blank data and the start of some new data, so I'd guess that this may be where the firmware stops and the other data begins. That said, the same thing happens at offset 0x1FFFFF (2MB), so you'll have to do some further analysis. See:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/tQ2SW.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"screenshot of a hex editor showing a data break at 1MB\" src=\"https://i.sstatic.net/tQ2SW.png\"/>\n  </a>\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/tgtHX.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"screenshot of a hex editor showing a data break at 2MB\" src=\"https://i.sstatic.net/tgtHX.png\"/>\n  </a>\n </p>\n <p>\n  If you really want to dig deeper, the description in the youtube video I linked earlier claims to provide the factory service manual for the AVR151, though I'm not sure how it was obtained so I'll refrain from linking it here; likewise, with the information here, coupled with the provided firmware, I think you should have a pretty good start. I believe Igor Skochinsky is correct in saying that at least some of this provided firmware file is code for that STM32F205 (or at least, I'd be surprised if it wasn't), though I didn't go too in-depth with loading it into some toolset and playing with it any further.\n </p>\n <p>\n  My gut feeling is that most of the interesting stuff happens in that FS1230 and information on that chip is difficult to come by, so you may have a tough time deciphering  what's going on there or determining how to modify the firmware or reverse engineer it without a datasheet or reference manual. That said, there's a lot of interesting strings in the binary file and you now know quite a bit about what's inside the AVR-151, so I think you should have quite a bit to go on.\n </p>\n <p>\n  *special thanks to\n  <a href=\"https://twitter.com/scanlime\" rel=\"nofollow noreferrer\">\n   scanlime\n  </a>\n  for the technique of generating a pgm file for visualizing file entropy:\n </p>\n <blockquote>\n  <p>\n   (echo \"P5 512 4096 255\"; cat ./avr.fw) > avrfw.pgm\n  </p>\n </blockquote>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Cheibriados",
            "time": "May 8, 2021 at 22:18",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Seems to be a Cortex-M (ARM Thumb-2 code), load base 0x8000000. My guess it's some STM32 model.\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/IQkXe.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/IQkXe.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "May 7, 2021 at 14:27",
            "is_accepted": false,
            "comments": []
        }
    ]
}