{
    "title": "How can I reverse this python code (obfuscated by b64, gzip and many more)",
    "link": "https://reverseengineering.stackexchange.com/questions/27635/how-can-i-reverse-this-python-code-obfuscated-by-b64-gzip-and-many-more",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  How can I Deobfuscate this python code\n </p>\n <p>\n  <a href=\"https://gist.github.com/charindithjaindu/abd5dd2e04827e8818732664d514f4d3\" rel=\"nofollow noreferrer\">\n   Link to code\n  </a>\n </p>\n <p>\n  I tried to replace eval places by print. but it won't work and output is also obfuscated\n </p>\n <p>\n  Head of the code looks like this\n  <a href=\"https://i.sstatic.net/c8nhA.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"Head of the code looks like this\" src=\"https://i.sstatic.net/c8nhA.png\"/>\n  </a>\n </p>\n <p>\n  can anyone please help me\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "2k",
    "tags": [
        "python",
        "obfuscation"
    ],
    "user": "JC Rathnayake",
    "time": "May 7, 2021 at 13:45",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You're on the right track with replacing\n  <code>\n   exec\n  </code>\n  with\n  <code>\n   print\n  </code>\n  , you just didn't go deep enough.\n </p>\n <p>\n  The file you posted is, effectively, 7 python commands each wrapped up in a bunch of obfuscation (not including the initial import statement). If you deobfuscate each command by printing the result, the first one results in an import statement and a set of 4 more obfuscated python instructions (the rest of the lines result in junk or\n  <code>\n   pass\n  </code>\n  statements, as far as I can tell).\n </p>\n <p>\n  Now, if you do the same thing for the resulting 4 obfuscated python instructions from above, you get one more valid python instruction and 3 junk instructions. In this case, the third instruction was the one that gives valid code.\n </p>\n <p>\n  If you take this code and run it, you end up with another import statement and 3 obfuscated instructions. Repeat the process and the second instruction will spit out the (mostly) deobfuscated code.\n </p>\n <p>\n  It looks like it's meant to spam SMS messages or phone calls to Sri Lankan telephone numbers as a prank. I believe it came from\n  <a href=\"https://github.com/Sl-Sanda-Ru/Sl-Bomber\" rel=\"nofollow noreferrer\">\n   https://github.com/Sl-Sanda-Ru/Sl-Bomber\n  </a>\n  based on comments in the deobfuscated code. The commit history and some revisions to the README for the project seem to indicate that the author obfuscated the code because people were making trivial modifications and abusing it (go figure). If you want to see what it's doing, the commit history has deobfuscated versions of the older code; it doesn't look all that different from the deobfuscated code you posted.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Cheibriados",
            "time": "May 7, 2021 at 21:17",
            "is_accepted": true,
            "comments": [
                {
                    "user": "JC Rathnayake",
                    "text": "<span class=\"comment-copy\">Thank you very much for help, I'll try it. this is a challenge of my friend given to me. Your answer is really helpful.</span>",
                    "time": null
                }
            ]
        }
    ]
}