{
    "title": "How can I extract working files (in the form of graphics) from these MZP executables?",
    "link": "https://reverseengineering.stackexchange.com/questions/27699/how-can-i-extract-working-files-in-the-form-of-graphics-from-these-mzp-executa",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There's a 1999 PC/Mac game that I'm hoping to extract assets from. All game data appears to be stored in various files with the extension\n  <code>\n   .rsc\n  </code>\n  . I've been able to extract all the game's audio from the files, using tools such as Ravioli Explorer and Dragon Unpacker.\n </p>\n <p>\n  Here's where things get weird: Despite the files all ending in\n  <code>\n   .rsc\n  </code>\n  , changing the extension to\n  <code>\n   .exe\n  </code>\n  and opening it with various executable disassemblers (such as IDA) reveals that the files are in fact Pascal DOS executables  that match the New Executable (NE) Windows file format.\n </p>\n <p>\n  No idea why that's the case, and I have no idea what I can do with that information. I can't make heads or tails of the raw executable data, and I have no idea if it's even possible to extract working files from them. I know pretty much nothing about this topic, so help would be greatly appreciated.\n </p>\n <p>\n  I'll link a few of the files in question. If anyone wants to take a look at them and take a crack at it, I would be very grateful:\n  <a href=\"https://drive.google.com/file/d/1i51Bp3iPKF9xIdfsaZV4m2CRPE8p6RWs/view?usp=sharing\" rel=\"nofollow noreferrer\">\n   RR2G.zip\n  </a>\n  .\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 0,
    "views": "245",
    "tags": [
        "disassembly",
        "decompilation",
        "executable",
        "decompress",
        "game-hacking"
    ],
    "user": "lemniscate",
    "time": "Jun 9, 2021 at 4:13",
    "comments": [
        {
            "user": "Michael Karcher",
            "text": "<html><body><span class=\"comment-copy\">\n Did you already try opening the NE executables with a 16-bit resource editor?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "lemniscate",
            "text": "<html><body><span class=\"comment-copy\">\n @MichaelKarcher Yeah, eXeScope was one of the programs I was able to open the files with.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}