{
    "title": "Can I find usages of this string in my .so file? ARM",
    "link": "https://reverseengineering.stackexchange.com/questions/27945/can-i-find-usages-of-this-string-in-my-so-file-arm",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  My apologies if this question is very basic. I have found this string in my Android application Binary that was built using the flutter framework. This is a 32 bit ARM library. I found the location of a url string at \"00c88fa0\" located below. I want to find the assembly code that loads and uses this string. I used Ghidra's \"show call trees\" and \"Show references to address\" functionality, but they have been unable to help me. I assume the string is being referenced by a base address + offset calculation. Is there an easy way for me to find this section of the code? Or is it not easily possible because there are too many base + offset calculations that could arrive at my String?\n </p>\n <p>\n  Thank you.\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/Mj8ez.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"M\" src=\"https://i.sstatic.net/Mj8ez.png\"/>\n  </a>\n </p>\n <p>\n  Updated image:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/SyyXj.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/SyyXj.jpg\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 2,
    "views": "3k",
    "tags": [
        "android",
        "ghidra"
    ],
    "user": "Ebay89",
    "time": "Jul 5, 2021 at 20:35",
    "comments": [
        {
            "user": "mumbel",
            "text": "<html><body><span class=\"comment-copy\">\n Have you made sure the whole .text section has been disassembled?  If not the xref would not have been created.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ebay89",
            "text": "<html><body><span class=\"comment-copy\">\n I did another run of the autoanalyzer changing a few settings. I think it has disassembled more of the text section and added functions to the symbol tree. However, I don't see any xref links to this string. I am sure this string is used as well.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Have you looked a little\n <i>\n  before\n </i>\n the actual string? Suppose it is a counted string, you'd expect something like \"maximum\" and \"current length\" before the string (or, if there is no flat version of the counted strings, such record could\n <i>\n  point to\n </i>\n the string you have identified).\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ebay89",
            "text": "<html><body><span class=\"comment-copy\">\n I edited my post with more bytes. Actually a bit of background what I am doing is that this url was originally a https url. As part of a pen test I am conducting I wanted to intercept the traffic and needed to downgrade the connection to http instead of https. In the past I achieved this by removing the \"s\" in the url and padding the end of the string with a null byte thinking that it would terminate 1 byte early. This time the null byte gets added to the url. So long story short I do believe that this is a counted string. I wanted to find the counting code so that I could fix it and learn.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Mega Tonnage",
            "text": "<html><body><span class=\"comment-copy\">\n I'd be surprised if there were many servers not automatically redirecting http->https these days... it would be quicker to check for redirection in a browser first rather than modify the app.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  In Ghidra, it is possible to view the references to a given address in memory as shown in the picture:\n  <a href=\"https://i.sstatic.net/c9SNr.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"How to see references to a string in memory\" src=\"https://i.sstatic.net/c9SNr.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "shluvme",
            "time": "Nov 23, 2022 at 10:29",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It is best to use reFlutter or blutter to create a snapshot.\nJeb also does a reasonably good job but as of now Ghidra, Binary Ninja, and radare2 are lagging behind the challenge to create a consistently accurate snapshot.\nThis challenge is made all the more difficult by the dart language consistently being updated by Google.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "PhantomThreads",
            "time": "Jun 16, 2024 at 0:58",
            "is_accepted": false,
            "comments": []
        }
    ]
}