{
    "title": "What is unpack? how to become professional Unpacker?",
    "link": "https://reverseengineering.stackexchange.com/questions/27970/what-is-unpack-how-to-become-professional-unpacker",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I asked a lot of questions in this forum about RE and I am a beginner who is very interested in reverse engineering. (i am learning the RE with Lena151)\n </p>\n <ol>\n  <li>\n   What is unpack?\n  </li>\n  <li>\n   Which tools need to unpack a software?\n  </li>\n  <li>\n   Is there anyway for manual unpack?\n  </li>\n  <li>\n   How to unpack software that used unknown packer?\n  </li>\n  <li>\n   Is there any tutorial that learn unpacking 0-100?\n  </li>\n  <li>\n   How-to Go From Zero to Hero in Unpacking?\n  </li>\n </ol>\n <p>\n  I want to know more about unpacking, all the things that make me a professional.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "unpacking"
    ],
    "user": "Jason",
    "time": "Jul 8, 2021 at 10:16",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  That's a set of very wide questions ...\n </p>\n <p>\n  I'll try to answer as good as I can, but you are asking for something that is so broad, I'm afraid that I can't answer everything.\n </p>\n <ol>\n  <li>\n   <blockquote>\n    <p>\n     What is unpacking?\n    </p>\n   </blockquote>\n  </li>\n </ol>\n <p>\n  Unpacking is the action of removing the protections layers used by malware in order to reach its core payload. When a malware is packed, everything looks scrambles and messy, and you can't really see (from a static point of view) what the payload is doing. Try to see it like an \"armor\" around the malware, only here to slow down your analysis (and mess with AV product performing static detection). If you find a sample that is packed, you generally don't have any clue on what is the malware inside this 'protection' nor what it's doing, unless you unpack it.\n </p>\n <ol start=\"2\">\n  <li>\n   <blockquote>\n    <p>\n     Which tools need to unpack a software?\n    </p>\n   </blockquote>\n  </li>\n </ol>\n <p>\n  A simple debugger can help you unpack the majority of packers. Sometime you'll also find automated unpacker scripts for well-known packers (standalone or compatible with your debugger or even static unpacker). Sometimes the packer is open-source, and contains unpacking capabilities. You also have some online services that are able to unpack stuff for you (Thinking about unpac[.]me).\n </p>\n <ol start=\"3\">\n  <li>\n   <blockquote>\n    <p>\n     Is there anyway for manual unpack?\n    </p>\n   </blockquote>\n  </li>\n </ol>\n <p>\n  Yes. The rule is simple: if the malware is running (meaning that it is able to unpack itself at runtime and execute it's core payload), you will always have the ability to trace everything and examine its behavior. What is important is not 'can I do it manually' — the answer will only be 'yes', but 'how much time can I spend on this?' or 'is the complexity level worth my time?'.\n </p>\n <ol start=\"4\">\n  <li>\n   <blockquote>\n    <p>\n     How to unpack software that used unknown packer?\n    </p>\n   </blockquote>\n  </li>\n </ol>\n <p>\n  After a bit of experience, you'll find that common packers are designed in the same way, and are using the same techniques. You'll always find a new clever technique from time to time, but the philosophy behind it will stay the same. If you are stuck on an unknown packer, you can try to find which packer does this look's like, and where are the differences. And remember, if it runs, you can always dump the unpacked process :) You don't have to manually unpack everything.\n </p>\n <ol start=\"5\">\n  <li>\n   <blockquote>\n    <p>\n     Is there any tutorial that learn unpacking 0-100?\n    </p>\n   </blockquote>\n  </li>\n </ol>\n <p>\n  No, it would be too easy. But you can find some tutorial on how to unpack X sample. Try to reproduce them. My personal advice would be to learn how to unpack something protected with a specific packer by following along with a write-up, then search another malware that is using the same packer, and do it alone. Then repeat with another packer. After some time, you'll see that it's almost every time the same thing.\n </p>\n <ol start=\"6\">\n  <li>\n   <blockquote>\n    <p>\n     How-to Go From Zero to Hero in Unpacking?\n    </p>\n   </blockquote>\n  </li>\n </ol>\n <p>\n  Practice. Practice again and again. Start with an easy packer (open-source ones or widely used) and slowly increase the level. If you are stuck, search for some write-ups. If you are really stuck, search for something easier. You'll come back to it later.\n </p>\n <p>\n  Unpacking can be a bit frustrating and time-consuming at first, but eventually it will become almost automatic for you. You just have to try again and again. It's OK if you start with basic packed malware. It will help you to build an understanding on how it works. Then the slight variations from the standard unpacking process will become obvious.\n </p>\n <p>\n  Some resources:\n </p>\n <ul>\n  <li>\n   <a href=\"https://www.unpac.me/#/\" rel=\"nofollow noreferrer\">\n    https://www.unpac.me/#/\n   </a>\n   (automated unpacking servcie)\n  </li>\n  <li>\n   <a href=\"https://forum.tuts4you.com/files/category/67-unpacking/\" rel=\"nofollow noreferrer\">\n    https://forum.tuts4you.com/files/category/67-unpacking/\n   </a>\n   (tutorials)\n  </li>\n  <li>\n   <a href=\"https://github.com/ProIntegritate/Malware-unpacking\" rel=\"nofollow noreferrer\">\n    https://github.com/ProIntegritate/Malware-unpacking\n   </a>\n   (repo with exercices)\n  </li>\n  <li>\n   <a href=\"https://www.youtube.com/watch?v=KvOpNznu_3w&list=PL3CZ2aaB7m83eYTAVV2knNglB8I4y5QmH\" rel=\"nofollow noreferrer\">\n    https://www.youtube.com/watch?v=KvOpNznu_3w&list=PL3CZ2aaB7m83eYTAVV2knNglB8I4y5QmH\n   </a>\n   (hasherezade unpacking tutorial playlist)\n  </li>\n  <li>\n   <a href=\"https://www.youtube.com/c/OALabs/videos\" rel=\"nofollow noreferrer\">\n    https://www.youtube.com/c/OALabs/videos\n   </a>\n   (OAlabs youtube channel)\n  </li>\n  <li>\n   <a href=\"https://repo.zenk-security.com/Reversing%20.%20cracking/The%20Art%20of%20Unpacking.pdf\" rel=\"nofollow noreferrer\">\n    https://repo.zenk-security.com/Reversing%20.%20cracking/The%20Art%20of%20Unpacking.pdf\n   </a>\n   (The Art of Unpacking - some techniques and tricks)\n  </li>\n </ul>\n</div>\n</body></html>",
            "votes": "4",
            "user": "MarianD",
            "time": "Jul 9, 2021 at 17:36",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jason",
                    "text": "<span class=\"comment-copy\">Wow, Thank you very much Guillaume, You explained very clearly.</span>",
                    "time": null
                }
            ]
        }
    ]
}