{
    "title": "How to analyze dumped process?",
    "link": "https://reverseengineering.stackexchange.com/questions/28031/how-to-analyze-dumped-process",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to reverse engineer a malware which uses a\n  <code>\n   Process Hollow\n  </code>\n  technique. This malware uses an\n  <code>\n   API hashing\n  </code>\n  technique and contains some RC4 encryption algorithm references.\n </p>\n <p>\n  I already knew the entry point of the resumed thread and dumped it out but IDA failed to analyze the dumped code.\n </p>\n <p>\n  What should I do?\n </p>\n <h3 id=\"solution-we1h\">\n  <strong>\n   Solution:\n  </strong>\n </h3>\n <p>\n  After dumping the injected code I have to fix the alignment of the file. According to\n  <a href=\"https://reverseengineering.stackexchange.com/a/21932/36056\">\n   https://reverseengineering.stackexchange.com/a/21932/36056\n  </a>\n </p>\n <p>\n  In IDA, the final address is calculated by\n  <code>\n   (base << 4) + offset\n  </code>\n  so I have to set the loading segment to\n  <code>\n   0\n  </code>\n  and the loading offset to the\n  <code>\n   BaseAddr\n  </code>\n  of injected code\n </p>\n <h3 id=\"defeat-dynamic-resolving-to-lable-apis-in-ida-4lks\">\n  <strong>\n   Defeat dynamic resolving to lable APIs in IDA:\n  </strong>\n </h3>\n <p>\n  I set a bp on\n  <code>\n   GetProcAddress\n  </code>\n  to build a table of APIs and then use a tool called\n  <code>\n   apiscout\n  </code>\n  <a href=\"https://github.com/danielplohmann/apiscout\" rel=\"nofollow noreferrer\">\n   https://github.com/danielplohmann/apiscout\n  </a>\n  to dynamically resolve all APIs in IDA\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "831",
    "tags": [
        "ida",
        "injection"
    ],
    "user": "ManJaro",
    "time": "Jul 24, 2021 at 5:54",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Disclaimer: I'm going to expose my workflow when I see similar things. I'm not telling you that this is the best one or the faster, and I'm sure you have a lot of other way to deal with this. But this should give you an insight on how you can do this.\n </p>\n <p>\n  As your question is really wide and does not contain any details (malware name, hash, or what 'failed to analyse' means) my answer is too.\n </p>\n <h3 id=\"process-hollowing-nmdb\">\n  Process Hollowing\n </h3>\n <p>\n  Fire-up your favorite debugger, load your binary, and put breakpoints on\n  <em>\n   CreateProcessInternalW\n  </em>\n  ,\n  <em>\n   ZwUnmapViewOfsection\n  </em>\n  ,\n  <em>\n   WriteProcessMemory\n  </em>\n  and\n  <em>\n   ResumeThread\n  </em>\n  .\n </p>\n <p>\n  This should allow you to observe the full process-hollowing technique.\n </p>\n <ul>\n  <li>\n   <p>\n    Hit to\n    <em>\n     CreateProcessInternalW\n    </em>\n    : The process where the injection is going to occur is created by the loader. You should see that the creation flag is set to 0x4 (Suspended). If you open-up procexp or something like that, you should be able to observe the suspended process in your environment.\n   </p>\n  </li>\n  <li>\n   <p>\n    Hit to\n    <em>\n     ZwUnmapViewOfsection\n    </em>\n    : The previously created process content is wipe. This will make room for the malicious code that is going to be injected later.\n   </p>\n  </li>\n  <li>\n   <p>\n    Hit to\n    <em>\n     WriteProcessMemory\n    </em>\n    : The malicious code is injected in the empty suspended process. This can be done sections by sections, or from a big blob that contains the full PE. You may want to dump it from here, by looking at the source buffer of the\n    <em>\n     WriteProcessMemory\n    </em>\n    call.\n   </p>\n  </li>\n  <li>\n   <p>\n    Hit to\n    <em>\n     ResumeThread\n    </em>\n    : The malicious process is then ready to be resume. Your second option is to dump it there, when you are sure that the target process is ready to be launch.\n   </p>\n  </li>\n </ul>\n <p>\n  Once you have your dump, start by looking at the sections in PE-bear (or equivalent) to unmappe it. As your dump was taken from memory, the sections are not aligned as it should be on the disk.\n </p>\n <p>\n  Once you re-aligned everything, check if your IAT seems coherent. Even if it use some API hashing technique, you should at least find an entry for\n  <em>\n   LoadLibrary\n  </em>\n  and\n  <em>\n   GetProcAddress\n  </em>\n  . This will confirm that your dump is properly aligned on disk. (Additionally it should run if you execute it).\n </p>\n <p>\n  You can now import this in IDA and start the analysis.\n </p>\n <h3 id=\"api-hashing-fek2\">\n  API Hashing\n </h3>\n <p>\n  For this part, you want to reverse the hashing algorithm.\n </p>\n <p>\n  First, find the function in charge of doing so. It should be easy to spot, as it should take a DWORD as argument, and a string (or another DWORD if the DLL name is hashed too). The string being the name of the DLL where the API comes from, and the DWORD being the API hash. Small tip: you can also list the functions by their number of call. The API resolving function should be called from a huge number of different place in the code, and is usually the one with the more references.\n </p>\n <p>\n  It is not impossible that the DLL name is decoded/decrypted just before the API resolving function.\n </p>\n <p>\n  If you are not sure, open it in a debugger, and execute random instructions just after the entrypoint, until you can observe the resolving mechanism.\n </p>\n <p>\n  If the DLL name is encoded/encrypted (witch is usually the case), start by reversing the algorithm. It can also be another hashing algorithm (or even the same one that the API). generally speaking, this part is easier to deal with, and you'll face some basic strings manipulations used to recover the DLL name.\n </p>\n <p>\n  Once you understand it, write a small function that is supposed to take an encrypted/encoded DLL name, and returns the plaintext one. You can then convert it to an IDAPython script that is going to label your idb with the plaintext names.\n </p>\n <p>\n  Half of the job is done here. Now, focus on the API hashing technique. Start by checking if the hash is not a standard one (CRC or others).\nIf this is done by hand, try to see if the hashing algorithm is not vulnerable to some reverse-manipulation that could lead to the recovery of the plaintext related hash.\n </p>\n <p>\n  If the algorithm is strong enough, you will not be able to recover the API name from the hash, but you'll have to bruteforce it. Luckily for you, you already have the name of the DLL where the API is going to be import. So you know that this hash resolve to something in a pre-defined list of API.\n </p>\n <p>\n  The idea is to re-implement the hashing algorithm, take the list of API defined in the target DLL, and pass them to your algorithm. Then, match the hash with the correct API name.\n </p>\n <p>\n  Once again, you can automate this with an IDAPython script to label your idb and makes things easier for you.\n </p>\n <p>\n  You now have something a bit more readable, and you should be able to understand the general goal of this malware.\n </p>\n <h3 id=\"rc4-encryption-er6x\">\n  RC4 encryption\n </h3>\n <p>\n  This part is standard as the RC4 algorithm is well documented, not that hard to reverse, easy to spot, and very popular among malwares.\n </p>\n <p>\n  As always, try to identify your encryption function. You can search for some specific part of the algorithm (KSA, PRGA and the XOR) that have some hardcoded constants. The easy to stop one is the 'for' loop in the KSA, that should give you the following pseudo-code:\n </p>\n <pre><code>for (int i = 0; i < 0x100; i++) {\n   S[i] = i;\n   [...]\n}\n</code></pre>\n <p>\n  Every-time you see this, you can be sure that this is RC4.\n </p>\n <p>\n  Now, trace back those function to the main encryption wrapper. If this is standard, you should see two buffer being passed to the function: one for the encrypted content, and one for the key.\n </p>\n <p>\n  Once again, write a small script to decode this (plenty of libraries for RC4), and you should be able to recover the plaintext strings.\n </p>\n <p>\n  Don't forget to test your script on several encrypted strings, as the key may be different for each one.\n </p>\n <p>\n  Once you have marked up your idb with the plaintext string, you should have everything to analyze this malware.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Guillaume",
            "time": "Jul 23, 2021 at 9:33",
            "is_accepted": true,
            "comments": [
                {
                    "user": "ManJaro",
                    "text": "<span class=\"comment-copy\">Thanks for your reply. I'm trying to reverse Andromeda V2.6 (MD5:  9ea65c7a034e2fab37cf414de18aea1e ). I got <code>svchost.exe</code> injected process and successfully got the entrypoint of new thread (injected code I mean). My point is How to load this thread into ida to analyze it statically</span>",
                    "time": null
                },
                {
                    "user": "Guillaume",
                    "text": "<span class=\"comment-copy\">Take a look at the first paragraph of my answer. You basically are at the fourth dot, right before/after the <i>ResumeThread</i> call. You just have to dump this process on disk to obtain a copy of the injected process. It either one of those method: you copy the injected content when it is about to be written in memory (WriteMemory call) to a new file, or you dump the memory space of the injected process (before the <i>ResumeThread</i> call).  You then fix the alignment if it needs to, and you'll be able to load it in IDA as a regular file.</span>",
                    "time": null
                },
                {
                    "user": "Guillaume",
                    "text": "<span class=\"comment-copy\">To dump it in x64dbg: Right click on the memory map segment that contains your dump, and 'save to file'</span>",
                    "time": null
                },
                {
                    "user": "ManJaro",
                    "text": "<span class=\"comment-copy\">Thanks a lot!!!! finally it works .... I just change the EP to point directly to malicious code and IDA analyzes it successfully ....</span>",
                    "time": null
                }
            ]
        }
    ]
}