{
    "title": "Moving from Windows to Linux for Malware analysis. What should I consider?",
    "link": "https://reverseengineering.stackexchange.com/questions/2864/moving-from-windows-to-linux-for-malware-analysis-what-should-i-consider",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I currently use Windows 7 as my host machine and want to move to Fedora.\n </p>\n <p>\n  I have IDA Pro + hexrays decompiler, VMWare Workstation, Hiew, Visual Studio, Olly, and several other smaller tools that should run just fine in wine.\n </p>\n <p>\n  I know I can get the VMWare Workstation licence for linux and it would be just fine.\n </p>\n <p>\n  Does anyone have experience in IDA in both linux and windows. If so, do you see any difference in its usability (decompiler, IDAPy plugins ...)\n </p>\n <p>\n  There is no realistic replacement for Visual Studio in linux, but it would be nice if eclipse or some other IDE would compile for Windows.\n </p>\n</div>\n</body></html>",
    "votes": "10",
    "answers": 2,
    "views": "2k",
    "tags": [
        "tools",
        "development"
    ],
    "user": "Lelouch Lamperouge",
    "time": "Nov 28, 2013 at 12:51",
    "comments": [
        {
            "user": "Hi-Angel",
            "text": "<html><body><span class=\"comment-copy\">\n Unless you imply some specific plugin, the crossplatform Visual Studio replacement is QtCreator. Don't be misled by its name — you don't have to use the \"Qt\" part.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <h2>\n  Not an issue\n </h2>\n <p>\n  I myself do the same thing, however I don't have Hexrays. I can tell you it works great. I use VirtualBox however. This mainly has to do with Seamless mode, this allows me to do great things :)\n </p>\n <h2>\n  System Requirements\n </h2>\n <p>\n  However I DO recommend to use a decent system. I tried to do this with my old-laptop and it was horrid. Atleast 8GB of RAM, and VT-x is recommended.\n </p>\n <h2>\n  The wine way\n </h2>\n <p>\n  I have been using IDA Free and OllyDBG with Wine for quite a while. And I had some issues with it, things like unreadable text.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Stolas",
            "time": "Oct 1, 2013 at 19:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Lelouch Lamperouge",
                    "text": "<span class=\"comment-copy\">Seamless mode? Are you sure that's safe for malware analysis? My system is pretty good hardware-wise. I was just looking for incompatibilities. Thanks though</span>",
                    "time": null
                },
                {
                    "user": "Stolas",
                    "text": "<span class=\"comment-copy\">Well, you run on Linux. You analyse Windows samples. The odds of having a Hybrid are less than winning the lottery. And besides that it doesn't really matter, even if there is some kind of awesome memory resilient worm that on the fly detects it's operating system to determine if he has to load GetProcAddress() or if he can syscall to the kernel he is still in a VM. The seamless mode only strips the gui using the vm-tools. The only issue is with anti-debugging that detect the VM by looking for the tools driver in memory.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  For me not very comfortable to run Reversing\\analysis tools thru Wine, so there are few options to choose from:\n </p>\n <ol>\n  <li>\n   Use for windows-style programs virtual machines [VirtualBox\\Vmware]\n  </li>\n  <li>\n   Move to  Linux-based tools for same operations [for Pe\\Hex\\Static analysis]\n  </li>\n </ol>\n <p>\n  I found myself, that for most of research operations you may found tool or set of tools for Linux OS, and for few of them that not - You always have Your VM machine.\nGood luck!\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Denis Laskov",
            "time": "Oct 2, 2013 at 10:56",
            "is_accepted": false,
            "comments": []
        }
    ]
}