{
    "title": "IDA Plugin writing generic questions",
    "link": "https://reverseengineering.stackexchange.com/questions/2886/ida-plugin-writing-generic-questions",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to write a plugin for IDA PRO, mainly because I want to use the nifty graphing feature on a custom intermediate language. After the first look at the IDA plugin system, I am a little lost.\n </p>\n <p>\n  Before I dig deeper, I have some generic understanding questions, which put me at unease:\n </p>\n <ol>\n  <li>\n   <p>\n    Does the SDK enforce a struct alignment? If not, how can I receive or supply pointers to structs compatible across compilers?\n   </p>\n  </li>\n  <li>\n   <p>\n    Why do plugins export a data\n    <code>\n     strcut\n    </code>\n    (PLUGIN), and not standard exported functions? What is the advantage? Again, I would fear for alignment issues across compilers.\n   </p>\n  </li>\n  <li>\n   <p>\n    Even more surprising, at least the HexRays part of the sdk seems to offer class ABI compatibility, meaning I can derive from a supplied class definition and use the result with the SDK (virtual functions and all)! How does that work?\n   </p>\n  </li>\n  <li>\n   <p>\n    Additionally, the SDK can return pointers to classes that I am supposed to destroy with the \"delete\" keyword. Isnt that bound to end in trouble?\n   </p>\n  </li>\n </ol>\n <p>\n  All that makes me a little nervous. Does anyone know how this is done?\n </p>\n</div>\n</body></html>",
    "votes": "8",
    "answers": 1,
    "views": "468",
    "tags": [
        "ida",
        "ida-plugin"
    ],
    "user": "bernd feinman",
    "time": "Oct 6, 2013 at 5:16",
    "comments": [
        {
            "user": "Vitaly Osipov",
            "text": "<html><body><span class=\"comment-copy\">\n Just in case you haven't seen this tutorial -\n <a href=\"http://www.binarypool.com/idapluginwriting/\" rel=\"nofollow noreferrer\">\n  binarypool.com/idapluginwriting\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   1. Does the SDK enforce a struct alignment? If not, how can I receive or supply pointers to structs compatible across compilers?\n  </p>\n </blockquote>\n <p>\n  IDA SDK headers do specify their alignment. It is split between 1-byte and 4-bytes.\n </p>\n <p>\n  There are also interesting comments like this:\n </p>\n <pre><code>/*\n *      Due to the use of STL and virtual functions, some parts of this\n *      interface might be incompatible with compilers other than BCB v6.0 \n */\n</code></pre>\n <p>\n  But given the age of Borland C++ Builder 6, I am not sure they are still relevant.\n </p>\n <blockquote>\n  <p>\n   2. Why do plugins export a data struct (PLUGIN), and not standard exported functions? What is the advantage? Again, I would fear for alignment issues across compilers.\n  </p>\n </blockquote>\n <p>\n  <code>\n   plugin_t\n  </code>\n  uses 1-byte alignment. As long as you follow that, there should not be any alignment problems. I guess the struct is used just for convenience, as then the loader only needs to find and keep track of only one exported symbol instead of several.\n </p>\n <blockquote>\n  <p>\n   3. Even more surprising, at least the HexRays part of the sdk seems to offer class ABI compatibility, meaning I can derive from a supplied class definition and use the result with the SDK (virtual functions and all)! How does that work?\n  </p>\n </blockquote>\n <p>\n  HexRays lets you inspect/modify the decompiled source tree representation, and uses the\n  <a href=\"http://en.wikipedia.org/wiki/Visitor_pattern\">\n   visitor pattern\n  </a>\n  to do it.\n </p>\n <p>\n  It's much easier to pass one pointer to a class holding multiple pointers than it is to pass a ton of separate callback pointers for different operations. Also, a class lets you capture/track local state, doing that with separate callback pointers would require extra work with functors.\n </p>\n <blockquote>\n  <p>\n   4. Additionally, the SDK can return pointers to classes that I am supposed to destroy with the \"delete\" keyword. Isnt that bound to end in trouble?\n  </p>\n </blockquote>\n <p>\n  What are you worried about? The fact that you're freeing memory allocated by another module, or the fact that you are responsible for the object's lifetime?\n </p>\n <p>\n  The former should not be an issue,\n  <code>\n   pro.h\n  </code>\n  contains a\n  <code>\n   DEFINE_MEMORY_ALLOCATION_FUNCS\n  </code>\n  macro that overrides memory management for each such class so deleting it will go through IDA's memory management routines.\n </p>\n <p>\n  The latter is just something you have to live with.\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "DCoder",
            "time": "Oct 6, 2013 at 7:05",
            "is_accepted": false,
            "comments": []
        }
    ]
}