{
    "title": "I have a dos file/database that i need to extract into MS Excel or My Sql",
    "link": "https://reverseengineering.stackexchange.com/questions/29203/i-have-a-dos-file-database-that-i-need-to-extract-into-ms-excel-or-my-sql",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a dos file/database(decades old) that I need to extract into MS Excel or My SQL.\nI am using a MacBook.\n </p>\n <p>\n  The file appears to have no extension.\n </p>\n <p>\n  The file type I can see when I do \"get info\" after a right-click is, \"kind: Unix Executable File\".\n </p>\n <p>\n  when I hit the \"file\" command on my terminal, this is what I get, \"Atari 68xxx CPX file (version 4143).\"\n </p>\n <p>\n  I need to filter some data through this file/database, for example, print files with the title \"XYZ\".\n </p>\n <p>\n  Currently, I am using DOSBOX to do it. But it is manual, and I am only able to filter my files one at a time.\n </p>\n <p>\n  It would save hundreds of hours of misery if I could automate this process. I can code in java and javascript. I can also use MySQL. But I have no idea how to start on this problem.\n </p>\n <p>\n  It would be great if I could convert this dos database into excel or MySQL database. Or I could also write some java programs to do the filtering.\n </p>\n <p>\n  But I have little clue on how to approach this problem.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "306",
    "tags": [
        "assembly",
        "dos",
        "dos-exe",
        "unknown-data",
        "dos-com"
    ],
    "user": "Sushant Khanal",
    "time": "Aug 25, 2021 at 22:14",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n \"Currently, I am using DOSBOX to do it\" are you running some program under dosbox or what? This is nor clear to me what are you saying here, but you could automate the things DOSBOX runs when it starts.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Gordon Freeman",
            "text": "<html><body><span class=\"comment-copy\">\n What is the name of the exe.    - Can you share it ?    - If you can't share the bdd file (confidential data), maybe you can generate a smaller one and share it.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}