{
    "title": "Is it possible to fake being joined to a domain in Windows 10?",
    "link": "https://reverseengineering.stackexchange.com/questions/29275/is-it-possible-to-fake-being-joined-to-a-domain-in-windows-10",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm dealing with a malware sample from a pentest that will only execute properly if the system is a member of the target organization's Windows Active Directory domain.\n </p>\n <p>\n  Rather than standing up my own AD controller and fake domain every time I want to test with a different domain name, I was hoping to write a PowerShell script to fake information on the local system to look like it was joined to an arbitrary domain.\n </p>\n <p>\n  I tried editing the registry values in\n  <code>\n   HKLM:\\SYSTEM\\CurrentControlSet\\Services\\Tcpip\\Parameters\n  </code>\n  , but the system still showed as a workgroup system.\n </p>\n <p>\n  Is there any way to make Windows (and therefore Windows malware) think it's a member of a domain, without actually joining a domain?\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "1k",
    "tags": [
        "windows",
        "malware",
        "windows-10"
    ],
    "user": "Sean W.",
    "time": "Sep 11, 2021 at 7:25",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n I concur with the existing answer for the most part. However, have you considered Samba? AFAIK the Samba devs have meanwhile even been able to work with some folks at MS and AFAIK it is possible to run it as a full-fledged DC. Since you can peek into the Samba sources, it should be possible to figure out which knobs to turn in order to change the domain name\n <i>\n  after\n </i>\n initial configuration. You could even create the initial Samba AD by joining it as AD into an existing domain. AD LDS\n <i>\n  might be\n </i>\n (but I'm not 100% sure) another option.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'd say no, there are too many changes when a system is joined to an AD domain, and therefore many ways that the malware could verify the existence of the AD domain. A couple off the top of my head:\n </p>\n <ul>\n  <li>\n   running services on the client\n  </li>\n  <li>\n   DNS queries\n  </li>\n  <li>\n   services reachable on the domain controller\n  </li>\n  <li>\n   LDAP queries\n  </li>\n  <li>\n   changes to the client registry\n  </li>\n  <li>\n   timesync settings\n  </li>\n </ul>\n <p>\n  .. you get the idea. I think you would have to spend more time faking the domain membership based on what each piece of malware is looking for, than it would take to run up a DC. If you have a Windows server VM snapshotted, you could just run\n  <code>\n   dcpromo\n  </code>\n  each time, or even better, automate the whole deployment.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Mega Tonnage",
            "time": "Jun 27, 2022 at 5:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}