{
    "title": "Why address space is different for Ghidra, IDA and xDebug runtime and which one to use?",
    "link": "https://reverseengineering.stackexchange.com/questions/29332/why-address-space-is-different-for-ghidra-ida-and-xdebug-runtime-and-which-one",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have opened an executable with Ghidra, IDA and x64dbg (runtime).\n </p>\n <p>\n  It seems that the address space in IDA and x64dbg is the same, but it is different from the one I see in Ghidra.\n </p>\n <p>\n  When hooking through proxy dll, which one should be used?\n </p>\n <p>\n  Here are the address snapshots.\n </p>\n <p>\n  <strong>\n   Ghidra\n  </strong>\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/3rPzY.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/3rPzY.png\"/>\n  </a>\n </p>\n <p>\n  <strong>\n   IDA\n  </strong>\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/kwV21.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/kwV21.png\"/>\n  </a>\n </p>\n <p>\n  <strong>\n   x64dbg\n  </strong>\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/QEaPp.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/QEaPp.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ida",
        "ghidra",
        "dll-injection",
        "address"
    ],
    "user": "Irbis77",
    "time": "Sep 24, 2021 at 9:38",
    "comments": [
        {
            "user": "blabb",
            "text": "<html><body><span class=\"comment-copy\">\n you should find the base address and use relative offsets  not just ghidra ida and x64dbg each invocation of your executable will have different base due to aslr.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Irbis77",
            "text": "<html><body><span class=\"comment-copy\">\n I can see that the base address is 140000000, which corresponds to that I get in Ghidra. In IDA all addresses are based on that as well with static analysis, but as soon as I run the application in IDA under debugger, it changes the memory allocation and it changes the way it names the subroutines as well, which is a bit confusing...\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "ismael_akez",
            "text": "<html><body><span class=\"comment-copy\">\n The Ghidra might using the Relative Virtual Address instead of the adding the image base of the binary file.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<html><body><span class=\"comment-copy\">\n when disaasembling every tool out there will use the prdefined base address in header ,0x400000  x86 win, 0xyz,x64 0x8048xxx linux x86 etc. and most tools also will provide a convenience function to rebase from default base address , while  debugging the base address is defined by the system loader and will definitely be not the same as in header base address. read about aslr , relocation ,header formats of executables etc to get a grip\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Irbis77",
            "text": "<html><body><span class=\"comment-copy\">\n What was confusing for me that:  IDA starts static analysis with address references in base address space (i.e. all of them in the above example will be 140.... ), but then changes the address space AND the names of the subroutines if run with debugger and then keeps it that way, never returning to the original.  Also, it seems in many examples I came across, people never bothered with setting hooks with the offsets. Usually it seems they were happy with the addresses from the static analysis.  Will check the stuff you've mentioned. Thank you.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Fixed with the combined solution from\n  <a href=\"https://reverseengineering.stackexchange.com/questions/29389/detourattach-breaks-with-illegal-instruction-0xc000001d/29398#29398\">\n   this\n  </a>\n  and\n  <a href=\"https://reverseengineering.stackexchange.com/questions/29375/how-to-find-offset-to-a-function-address-from-the-base-address-in-decompiled-ima\">\n   this\n  </a>\n  posts.\n </p>\n</div>\n</body></html>",
            "votes": "-1",
            "user": "Irbis77",
            "time": "Oct 11, 2021 at 18:24",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Irbis77",
                    "text": "<span class=\"comment-copy\">The problem with most of the above is that it is not clear of how to get to the point, when the solution is working right. It is unlikely that even my improved understanding after studying the documentation will allow me to see clearly of why the exception is thrown with the current implementation. Because there might be reasons other than incorrect address, which cause it.</span>",
                    "time": null
                },
                {
                    "user": "Irbis77",
                    "text": "<span class=\"comment-copy\">For example, currently the above code works in a way that the proxy dll loads. I even get some of the breakpoints hit, but not for the hooked function. This is when I am using the base address definition from the code above. But if I hardcode the address to runtime address space, then it gets hit, but with access violation exception. So now, how do I debug it to confirm, whether the exception is due to the wrong address specified or it is due to some error in the code?</span>",
                    "time": null
                }
            ]
        }
    ]
}