{
    "title": "What is .pb file format?",
    "link": "https://reverseengineering.stackexchange.com/questions/29404/what-is-pb-file-format",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  TL;DR: What file format is\n  <a href=\"https://storage.mds.yandex.net/get-cid-offline/1995371/cid.full.large.ru.1.1633994274.pb.gz\" rel=\"nofollow noreferrer\">\n   this\n  </a>\n  (if it's not a private file format) and how do I parse it?\n </p>\n <hr/>\n <p>\n  Before I say anything, I want to say that I am new to reverse engineering and StackExchange.\n </p>\n <p>\n  I am trying to reverse-engineer the Yandex iOS app's call blocking function. I know how the iOS call blocking API works and I know that, in summary, the app gives the system a list of numbers and the action to do with them — there is no code ran by the app when a call comes in, and it never even gets to see incoming phone numbers. My end goal is to then write a privacy-conscious version of this for my Android phone (yes there is an Android version of the app, but it requires you to set it as the device's assistant, allowing it to see the phone's screen, notifications, calls, etc.)\n </p>\n <p>\n  I have put the app in a MITM proxy and found this URL it was downloading the phone database from:\n  <a href=\"https://storage.mds.yandex.net/get-cid-offline/1995371/cid.full.large.ru.1.1633994274.pb.gz\" rel=\"nofollow noreferrer\">\n   https://storage.mds.yandex.net/get-cid-offline/1995371/cid.full.large.ru.1.1633994274.pb.gz\n  </a>\n  After extracting, I get a\n  <code>\n   .pb\n  </code>\n  file. If I look at it in a text editor, I can see the messages for the phone numbers, like scam likely, delivery driver, company names, etc. But the actual phone numbers are encoded in a binary format.\n </p>\n <p>\n  It's not SQLite, and it's not encrypted, 010 Editor incorrectly recognizes this as a \"TensorFlow Model\" format and shows nothing.\n  <code>\n   file\n  </code>\n  command just says \"data\" (I assume unknown file format). I'm thinking it's a custom file format, but I am not sure. Can someone please explain to me how to parse this file, or even how to convert this file format into something like JSON or XML? Thank you in advance\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "297",
    "tags": [
        "file-format"
    ],
    "user": "user39240",
    "time": "Oct 29, 2021 at 7:32",
    "comments": [
        {
            "user": "ricka777",
            "text": "<html><body><span class=\"comment-copy\">\n If pb stands for phone book, is it possible that the iphone has an encoded structure for storing phone numbers it is using? can you pass the values into that? Sorry, not so strong on iphone api.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ian Cook",
            "text": "<html><body><span class=\"comment-copy\">\n The link appears to be dead.  I assume the url is transient.  You'll need to provide the file another way.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}