{
    "title": "How to derive a state diagram from existing source code",
    "link": "https://reverseengineering.stackexchange.com/questions/29418/how-to-derive-a-state-diagram-from-existing-source-code",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <strong>\n   to;dr;\n  </strong>\n  What tools or smart method can I use to derive a state (transition) overview from source code with 10 binary and three 16-bit input variables, and several output variables, both 16-bit and binary. All input variables can change with every 33ms execution of the source, which has several hidden states.\n </p>\n <p>\n  <strong>\n   Background\n  </strong>\n </p>\n <p>\n  I have been tasked to write a functional description of a 20+ year old embedded product. The source code is available, but is written in a long forgotten language, resembling basic.\n </p>\n <p>\n  The source itself is written in an extremely naïve way, with hundredst of long\n  <code>\n   if\n  </code>\n  statements, and no function calls at all. All internal variables are global.\n </p>\n <p>\n  <strong>\n   Attempts\n  </strong>\n </p>\n <p>\n  I quickly lost track of attempting to make sense of the source code, which is running in a never ending 33ms loop, and variables are used and modified anywhere in the 1000+ lines of code.\n </p>\n <p>\n  I decided to try to emulate the entire hardware, and due to the simplicity of the code, it turned out to be very simple to convert to python. I'm now able to predifine some timed changes in the input variables then execute the code for a number of simulated seconds, generating a number of output lines with the end result of each 33ms execution.\n </p>\n <p>\n  The emulated approach is working, but I need to spend a very long time to craft the timed inputs based on the generated output. I've currently identified at lease 16 major states, each treating the other inputs differently.\n </p>\n <p>\n  <strong>\n   The question\n  </strong>\n </p>\n <p>\n  How can I do this smarter, preferable automated.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "105",
    "tags": [
        "python"
    ],
    "user": "fsteff",
    "time": "Oct 15, 2021 at 4:28",
    "comments": [],
    "answers_data": []
}