{
    "title": "Is that message mean the program has an anti-debugger?",
    "link": "https://reverseengineering.stackexchange.com/questions/29663/is-that-message-mean-the-program-has-an-anti-debugger",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  When trying to debug a program using the x64dbg and in a specific step, the following problem happens:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/bS7fw.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"\" src=\"https://i.sstatic.net/bS7fw.jpg\"/>\n  </a>\n </p>\n <p>\n  Is that mean that the program has an anti-debugger?\n  \n\n  if not, why when debugging the program and in a specific step that problem happen?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "271",
    "tags": [
        "anti-debugging"
    ],
    "user": "Lion King",
    "time": "Dec 3, 2021 at 23:21",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n The message itself it's not an anti-debug measure. it's just telling you that you have a debugger attached (x64dbg) and you cannot attach another one.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Lion King",
            "text": "<html><body><span class=\"comment-copy\">\n @PawełŁukasik: Thank you, but there is no other debugger attached to that program except x64dbg (Just one debugger attach to the program).\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n Exactly, so you can't attach VS as a second debugger.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It seems that an exception happens in the program you’re debugging but is not handled by the debugger, so it escapes to the OS-wide exception handler (WER) which offers you to handle it with the visual studio debugger, but this is not possible because it’s already being debugged by x64dbg so you get this error message. You have two options:\n </p>\n <ol>\n  <li>\n   Edit x64dbg exception settings to make sure no exceptions are ignored  so you can catch it in x64dbg and debug the reason. If the program has its own exception handler, let the exception happen, step through handler and find out why it’s not being handled properly.\n  </li>\n  <li>\n   Detach x64dbg and debug the exception in Visual Studio.\n  </li>\n </ol>\n <p>\n  However, it is indeed possible that the program has some kind of anti-debugging technique which allows exception to escape to the OS instead of catching it in the debugger.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Dec 4, 2021 at 17:28",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Lion King",
                    "text": "<span class=\"comment-copy\">But the program is working well in normal mode without any problem. also, x64dbg doesn't ignore any exceptions look at this <a href=\"https://i.ibb.co/WtfrX75/2021-12-03-16-04-13-2021-12-04-22-35-11.jpg\" rel=\"nofollow noreferrer\">screenShot</a>. I think that is indeed possible that the program has some kind of anti-debugging technique as you said.</span>",
                    "time": null
                }
            ]
        }
    ]
}