{
    "title": "A tutorial or docs to unpack a custom packed PE",
    "link": "https://reverseengineering.stackexchange.com/questions/29706/a-tutorial-or-docs-to-unpack-a-custom-packed-pe",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am facing an odd situation. I have a licensed game that's doing odd actions on the system. I isolated it as I could and observed the behavior both network and so forth, and I suspect it's a custom-made malware. Till now, it wasn't discovered by any antivirus.\n </p>\n <p>\n  While trying to load it with IDA, I observed that I couldn't get it to analyze at all more than first few offsets – meaning most probably it was packaged with custom packager. I have never tried such a thing until now, and I would need a tutorial in this regard. Or some possible ways to improve my skills, or any documentation for this purpose.\n </p>\n <p>\n  I have also tried to find a loader to start my program and just dump the PE from a certain address, but unfortunately there's no such thing anymore, or I haven't found the right tool.\n </p>\n <p>\n  Thank you very kindly.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "835",
    "tags": [
        "ida",
        "disassembly",
        "assembly",
        "x64dbg"
    ],
    "user": "Jcknsz",
    "time": "Dec 12, 2021 at 10:58",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This answer covers the entire analysis process that you can perform when you want to analyse a potentially malicious sample. If you are interseted\n  <em>\n   only\n  </em>\n  in unpacking, see\n  <strong>\n   Manual unpacking\n  </strong>\n  subsection.\n </p>\n <h2>\n  Quick solution\n </h2>\n In order to determine whether your file is malicious, if you don't mind sharing your file with other parties, you could try any of the two following solutions:\n <ol>\n  <li>\n   Submit the file on\n   <a href=\"https://www.virustotal.com/gui/home/upload\" rel=\"nofollow noreferrer\">\n    VirusTotal\n   </a>\n   . If you don't want to upload your file, you can still check whether it was already scanned there by submitting only hash of the file.\n  </li>\n  <li>\n   Send the file to some antivirus company for analysis. Some antiviruses have an option in their user interface for sending files directly, but they also provide an file upload option on their website (I don't want to advertise any antivirus product here so I recommend you to send your file to the antivirus company whose product you use). This way, your file will be analysed by professionals having right tools and experience, so there is a high chance that if there is something wrong with the file, it will be detected by them.\n  </li>\n </ol>\n <p>\n  <strong>\n   Advantages:\n  </strong>\n </p>\n <ul>\n  <li>\n   you don't have to risk running potential malware on your Virtual Machine (sometimes malware can try to exploit some older versions of virtualization software and try to move to your real computer, there is also a chance you misconfigure your VM and then malware can cause some harm)\n  </li>\n  <li>\n   quick and easy, doesn't require additional knowledge\n  </li>\n </ul>\n <p>\n  <strong>\n   Disadvantages:\n  </strong>\n </p>\n <ul>\n  <li>\n   you have to submit your file to other companies\n  </li>\n  <li>\n   you have to trust antivirus vendors they analysed the file properly\n  </li>\n </ul>\n <h2>\n  Analysis and unpacking\n </h2>\n If you don't want to share your file with anybody (and it seems to be the case, since your game is licensed), you have to analyse the file yourself.\n <h4>\n  Setting the analysis lab\n </h4>\n <p>\n  First thing to do is setting the analysis lab. I will not cover the details here, since it is described in many places (try to search \"setting malware analysis lab\" for details), but I will emphasise the most important things:\n </p>\n <ul>\n  <li>\n   you want to use virtual machine of course. This will provide you safety, but it will also allow you to do snapshots and restore them if necessary.\n  </li>\n  <li>\n   you don't want to enable Internet connection for that VM. Unless you want to dive deeply into network protocols used, you won't need that. And your question is about unpacking, not about detailed analysis - I have analysed many packed samples in my life, but neither of them needed Internet connection in order to be unpacked.\n  </li>\n  <li>\n   you don't want to enable shared folder for that VM, since it is another security risk - just drag and drop the sample into VM and you should be fine.\n  </li>\n </ul>\n <h4>\n  Manual unpacking\n </h4>\n After you install all the tools you need I recommend that you make a snapshot - this will be a starting point for any future analysis (some of the tools you may use are described later on, but feel free to search for other ones and choose them yourself). Then, drag and drop your suspicious file into that VM.\n <p>\n  As the first step, you probably want to make some dynamic analysis to check whether something suspicious is done - you may use for example\n  <a href=\"https://github.com/Seabreg/Regshot\" rel=\"nofollow noreferrer\">\n   regshot\n  </a>\n  for that purpose (do the first regshot snapshot before you run the sample and the second one after your run it - then compare them to see for the changes made in the system). If the file is malicious, in many cases this step will reveal it and you won't need any further analysis. If nothing strange happens, it's time to analyse the file statically. You may follow the following steps:\n </p>\n <ol>\n  <li>\n   Try using\n   <a href=\"https://github.com/horsicq/Detect-It-Easy\" rel=\"nofollow noreferrer\">\n    Detect It Easy\n   </a>\n   and\n   <a href=\"https://www.aldeid.com/wiki/PEiD\" rel=\"nofollow noreferrer\">\n    PEiD\n   </a>\n   and see the results. If the sample is packed, there is a chance they will tell you the name of the packer. Then, you may search for unpacker in the Internet. You will rarely find one, except for easy packers, but it doesn't cost you much time, so I think, it's worth a try.\n  </li>\n  <li>\n   If your file is indeed packed (one of the tools above has told you that or the file has high entropy), open it in your favourite debugger (which is\n   <code>\n    x64dbg\n   </code>\n   judging by one of the tags you added to the question).\n  </li>\n  <li>\n   Now, there are several methods that can be used to unpack the file. I will try to describe each one of them:\n  </li>\n </ol>\n <ul>\n  <li>\n   some packers use\n   <code>\n    pushad\n   </code>\n   instruction at the beginning and corresponding\n   <code>\n    popad\n   </code>\n   instruction at the end. If that is the case, you can just set a breakpoint after\n   <code>\n    pushad\n   </code>\n   and navigate to the stack (that is, where\n   <code>\n    ESP\n   </code>\n   register points) and put a memory breakpoint at\n   <code>\n    ESP+4\n   </code>\n   . It will be triggered when\n   <code>\n    popad\n   </code>\n   instruction is executed. Then, you will probably see a\n   <code>\n    jmp\n   </code>\n   instruction nearby, possibly with destination stored in some register - it will be the entry point of the unpacked file. You may do a dump after the jump is performed and analyse your file statically from here.\n  </li>\n  <li>\n   the second option is more generic and works in many cases. It relies on the fact that packers usually use some specific API functions in order to recover the original executable: these include\n   <code>\n    LoadLibraryA\n   </code>\n   (and other\n   <code>\n    LoadLibrary\n   </code>\n   variants - see MSDN for more details) and\n   <code>\n    VirtualProtect\n   </code>\n   . You can set breakpoints on these functions and they are often triggered at the end of the packer stub. When the code returns from these functions, you can search for\n   <code>\n    jmp register\n   </code>\n   instructions nearby and if you find one, it will be likely the entry point of the unpacked file. Graph view of the function can be very helpful here (if I'm not mistaken, you can trigger it in\n   <code>\n    x64dbg\n   </code>\n   by pressing\n   <code>\n    g\n   </code>\n   ) -\n   <code>\n    jmp register\n   </code>\n   instructions will be located at the end of nodes without successors. Even if you don't find these instructions (transition to EP can be done even by\n   <code>\n    ret\n   </code>\n   or in several other ways), you can try to step over instructions manually until you find EP, since you are likely to be close to it. Snapshots come in handy here - you can do them from time to time and restore in case the execution goes too far (for example if you step over the call to the function that does an actual jump to the EP).\n  </li>\n  <li>\n   If other methods don't work, you can always run the program, let it go for some time, and then do a memory dump of it. You won't get a clean, unpacked file, but you will most likely see the strings and functions. The dump you get can be also used to locate the original EP - you can open it in\n   <code>\n    IDA\n   </code>\n   , navigate to some function that you are sure belongs to the unpacked file (and is not in a packer stub) - for instance some function\n   <code>\n    F\n   </code>\n   referencing strings appearing in your program and find cross references to it (pressing\n   <code>\n    x\n   </code>\n   ). Then navigate to some function\n   <code>\n    G\n   </code>\n   referencing\n   <code>\n    F\n   </code>\n   and do the same. You can repeat the process until you encounter function\n   <code>\n    H\n   </code>\n   which doesn't have any cross references and it is a candidate for an entry function (containing EP) in the unpacked program.\n  </li>\n </ul>\n <p>\n  For process dumping you can use\n  <code>\n   LordPE\n  </code>\n  . Possibly\n  <code>\n   x64dbg\n  </code>\n  supports dumping as well (I'm not sure, I know\n  <code>\n   OllyDbg\n  </code>\n  had such a plugin). For imports reconstruction you can use\n  <a href=\"https://github.com/NtQuery/Scylla\" rel=\"nofollow noreferrer\">\n   Scylla\n  </a>\n  .\n </p>\n <p>\n  Note that these methods work often but will not work every time - there are protectors using more sophisticated techniques than just packing and do not have unpacked file in their memory at any time of execution. Several packers also encorporate ani-debugging techniques. These things may happen in your case, since licensed game can be heavily protected.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "bart1e",
            "time": "Dec 12, 2021 at 21:02",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jcknsz",
                    "text": "<span class=\"comment-copy\">Thank you very kindly for the answer! First thing i did was the lab analysis, of course - I thought of that in the first place so we're all covered. Now, when I started to analyze the executable a bit and verify it, it seems it's not recognized by any of Detect It Easy or PEiD, so it's most probably a custom-packed and custom-encrypted(?) executable. This was the bad news for me. I used x64dbg to try to find any answers, and i dumped a section of memory in order to find a executable, but my .data, .text, .reloc are obfuscated for some reason. How do I manage that?</span>",
                    "time": null
                },
                {
                    "user": "Jcknsz",
                    "text": "<span class=\"comment-copy\">By obfuscated I mean that I do not even see them as .data, .text, so forth. I presume they are there.</span>",
                    "time": null
                },
                {
                    "user": "bart1e",
                    "text": "<span class=\"comment-copy\">Did you try second and third unpacking technique I described (breakpoint at <code>LoadLibrary</code> and dump after some time of execution? Third technique should reveal something, and if not, it may be more complicated to unpack the file.</span>",
                    "time": null
                },
                {
                    "user": "Jcknsz",
                    "text": "<span class=\"comment-copy\">I think I might have found the EntryPoint, the program mentions it starts another instance of itself but unprotected (it named it notprotected for some reason). After I found this entrypoint, what would be the best course of action?</span>",
                    "time": null
                },
                {
                    "user": "Jcknsz",
                    "text": "<span class=\"comment-copy\">I could unpack it and fix it manually, but so far I haven't seen any PE format. This sequence I discovered based on your advice is somewhat after the .rsrc, but in a unknown memory area. Would it be valid even if it would be after the .rsrc area? Does it make sense? Thank you again.</span>",
                    "time": null
                }
            ]
        }
    ]
}