{
    "title": "How do I reverse engineer structs that are put as parameters in a function",
    "link": "https://reverseengineering.stackexchange.com/questions/29794/how-do-i-reverse-engineer-structs-that-are-put-as-parameters-in-a-function",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  how do I go around figuring out where to reverse engineer a struct?\n </p>\n <p>\n  As shown in the picture below, I have this function called \"struct dynamic_array\" which I want to reverse engineer and reimplement in C#, but I can't seem to find out where to look for it inside of IDA Pro?\n </p>\n <p>\n  Highlighting it doesn't give me any options and it doesn't show up anywhere, if I could get guidance on where to find it that would be highly appreciated.\n </p>\n <p>\n  The most help I got from an experienced friend was that it's a simple implementation of\n  <code>\n   std::vector\n  </code>\n  , so now I know a little about it\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/JC4f5.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"https://i.sstatic.net/JC4f5.png\" src=\"https://i.sstatic.net/JC4f5.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "446",
    "tags": [
        "ida",
        "c++",
        "struct",
        "array"
    ],
    "user": "Oliver Vedel Rasmussen",
    "time": "Dec 30, 2021 at 9:33",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The function's name isn't\n  <code>\n   struct dynamic_array\n  </code>\n  . The function's name is\n  <code>\n   Mesh::CalculateBoneBindPoseBounds\n  </code>\n  .\n </p>\n <p>\n  The function accepts an argument of type\n  <code>\n   struct dynamic_array<...>\n  </code>\n  .\n </p>\n <p>\n  There's no function named\n  <code>\n   dynamic_array\n  </code>\n  , as it's simply as structure defined within the binary. The name does\n  <em>\n   imply\n  </em>\n  we're dealing with an\n  <code>\n   std::vector\n  </code>\n  -like object, so I'd start with assuming that's the case for now and reverse engineer the function you're interested in particularly.\n </p>\n <p>\n  If you wish to reverse engineer the structure itself and functions related to the\n  <code>\n   dynamic_array\n  </code>\n  structure, you should look for a constructor to start with.\n </p>\n <p>\n  Highlighting won't work because that isn't the function's full name but browsing through IDA's function / name list view, you may be able to locate functions named\n  <code>\n   struct dynamic_array\n  </code>\n  . Depending on implementation, functionality and compilation parameters some or most functions may be\n  <em>\n   inlined\n  </em>\n  , preventing you from finding a function definition to reverse.\n </p>\n <p>\n  In case this is C code (or C style within C++ code) functions might not be named for the object they're implementing, although this doesn't seem to be the case, as evident by the naming convention.\n </p>\n <p>\n  Regardless of whether functions are inlined or whether they're implemented as struct/class methods or bare functions, after finding the major implementation functions for the structure you should start by mapping the structure's members. Their sizes, types and meaning by reverse engineering the different functions. After most of the members are clear, naming related functions shouldn't be too difficult.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "NirIzr",
            "time": "Dec 30, 2021 at 9:33",
            "is_accepted": false,
            "comments": []
        }
    ]
}