{
    "title": "Exposing the connectors in a package on package",
    "link": "https://reverseengineering.stackexchange.com/questions/299/exposing-the-connectors-in-a-package-on-package",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  To analyze the communication protocol between two chips running unknown firmware, we eavesdrop into the communication bus between the chips. In the ideal case, this is “just” a matter of matching exposed paths on a PCB with the contacts of a logic analyzer.\n </p>\n <p>\n  What if the chips are stacked in a\n  <a href=\"http://en.wikipedia.org/wiki/Package_on_package\" rel=\"noreferrer\">\n   package on package\n  </a>\n  configuration? How can the contacts be exposed? Can the chips be separated? Does this damage the chips, or will they look as new afterwards?\n </p>\n</div>\n</body></html>",
    "votes": "5",
    "answers": 1,
    "views": "49",
    "tags": [
        "integrated-circuit",
        "communication"
    ],
    "user": "Gilles 'SO- stop being evil'",
    "time": "Mar 26, 2013 at 18:51",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <strong>\n   Non Destructive\n  </strong>\n </p>\n <p>\n  Highly unlikely to be successful unless you have intimate knowledge of how the pacakges were epoxied together. If you did go this route it might be possible to break down the glue that binds the chips together a REing effort in its own right. Once you did that it might not be possible to join them back together without machinery to align the chips under x-ray. And even then the soder balls might not be too happy about what you have done to them...\n </p>\n <p>\n  <strong>\n   Destructive\n  </strong>\n </p>\n <p>\n  Since package on package usually means the chips are epoxied together you basically have to distroy the packages to get them appart. Once you did you could look at them under microscope and RE them that way. You could possibly separate them without damaging the interconnects and test the top chip... as a black box I would imagine the bottom chip woudln't work without the top one though since it is usually RAM at least in mobile devices.\n </p>\n <p>\n  <strong>\n   Related Info\n  </strong>\n  <a href=\"http://www.smartcard.co.uk/articles/Whatthesiliconmanufacturerhasputtogetherletnomanputasunder.php\" rel=\"nofollow\">\n   Christopher Tarnovsky\n  </a>\n  and\n  <a href=\"http://www.chipworks.com\" rel=\"nofollow\">\n   http://www.chipworks.com\n  </a>\n </p>\n <p>\n  That company specializies in REing chips... and that is the sort of setup you would need to do it sucessfully. 1 million+ USD for something like an arm processor.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "cb88",
            "time": "Mar 26, 2013 at 22:15",
            "is_accepted": true,
            "comments": []
        }
    ]
}