{
    "title": "When is applying reverse engineering techniques acceptable? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/2/when-is-applying-reverse-engineering-techniques-acceptable",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <div>\n  <aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n   <div class=\"d-flex fd-column fw-nowrap\">\n    <div class=\"d-flex fw-nowrap\">\n     <div class=\"flex--item mr8\">\n      <svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\">\n       <path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\">\n       </path>\n      </svg>\n     </div>\n     <div class=\"flex--item wmn0 fl1 lh-lg\">\n      <div class=\"flex--item fl1 lh-lg\">\n       <div>\n        It's difficult to tell what is being asked here. This question is ambiguous, vague, incomplete, overly broad, or rhetorical and cannot be reasonably answered in its current form. For help clarifying this question so that it can be reopened,\n        <a href=\"/help/reopen-questions\">\n         visit the help center\n        </a>\n        .\n       </div>\n      </div>\n     </div>\n    </div>\n    <div class=\"flex--item mb0 mt8\">\n     Closed\n     <span class=\"relativetime\" title=\"2013-03-27 18:40:31Z\">\n      12 years ago\n     </span>\n     .\n    </div>\n   </div>\n  </aside>\n </div>\n <p>\n  You all know there are people out there that use reverse engineering techniques to do bad things; this ranges from being able to use paid software for free (cracker) to finding vulnerabilities that allow them to do what they want when they want without permission (hacker). Of course, there is also a good side to it; we can use this to protect software against such people, use it to learn from things.\n </p>\n <p>\n  But where does one know if he is allowed? How does one\n  <em>\n   ensure\n  </em>\n  he conforms to laws and licenses?\n </p>\n <p>\n  Software and services do not always list this in their license or come with a NDA, I don't know if the law explicitly states anything about this; so, this would leave one to often be clueless ...\n </p>\n <ol>\n  <li>\n   whether he is allowed to reverse engineer.\n  </li>\n  <li>\n   whether he may use his findings, for which goals.\n  </li>\n  <li>\n   under which conditions he may or may not publish his results.\n  </li>\n </ol>\n <p>\n  What to do when it is not stated? Does one have to explicitly ask it, or is their some rule on this?\n </p>\n <blockquote>\n  <p>\n   It is wise to just ask; though a canonical answer would benefit the majority and spare out asking.\n  </p>\n </blockquote>\n</div>\n</body></html>",
    "votes": "23",
    "answers": 4,
    "views": "4k",
    "tags": [
        "law",
        "ethics"
    ],
    "user": "Tamara Wijsman",
    "time": "12 years ago",
    "comments": [
        {
            "user": "Ken Bellows",
            "text": "<html><body><span class=\"comment-copy\">\n Did you mean \"do what they want when they want\n <i>\n  without\n </i>\n permission\"?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Tamara Wijsman",
            "text": "<html><body><span class=\"comment-copy\">\n Oops, skipped a few characters there; thanks.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Gilles 'SO- stop being evil'",
            "text": "<html><body><span class=\"comment-copy\">\n I voted to close this question as\n <i>\n  too broad\n </i>\n : there's just no way to cover all situations and locales. There have been a couple of good answers, so I'd like to salvage this question, but I can't see a good way to edit it to make it useful. If anyone has an idea, please step in.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Tamara Wijsman",
            "text": "<html><body><span class=\"comment-copy\">\n Yes, it has been asked in an attempt to help shape the community; and because it jumps on someone's mind sooner or later anyway, I think it is valuable and should be salvaged if possible. If not, we're one step closer to having defined a broad sense of what the borders of this community should be.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "<html><body><span class=\"comment-copy\">\n This is just too broad at the moment. It needs to be made more specific or needs to be reduced to cover just one of the many aspects that its trying to cover.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The answer, as in most things, is \"it depends\". Firstly, it depends on the country you are in, different countries have different rules with respect to reverse engineering.\n </p>\n <p>\n  Now in the United States reverse engineering is generally considered to be a legitimate form of discovery mainly due to the fact that it encourages innovation. There is legal precedence for reverse engineering being lawful:\n </p>\n <ul>\n  <li>\n   <a href=\"http://supreme.justia.com/cases/federal/us/416/470/\">\n    US Supreme Court - Kewanee Oil v. Bicron - 1974\n   </a>\n  </li>\n  <li>\n   <a href=\"http://supreme.justia.com/cases/federal/us/489/141/case.html\">\n    US Supreme Court - Bonito Boats. v. Thunder Craft - 1989\n   </a>\n  </li>\n </ul>\n <p>\n  Most major companies\n  <em>\n   do\n  </em>\n  buy and reverse engineer products of competitors once they are available, my source for that is myself as I worked for a cell phone company that engaged in that exact practice. Typically speaking, if you\n  <em>\n   buy\n  </em>\n  a device you're free to do whatever you want with it; trade secret law only protects the owner of the secret from others improper acquiring of that secret (you don't break into someone else' place of work and take a prototype)\n </p>\n <p>\n  The scope of a NDA is totally different. If the company\n  <em>\n   tells you\n  </em>\n  about un-patented trade secrets, you can't disclose that information. Once the company patents the secret, it's no longer a secret (you don't even have to reverse engineer at that point, the details are available from the patent office)\n </p>\n <p>\n  As there is legal precedence to allow reverse engineering, you can publish your results. It happens all the time. When a company doesn't want you doing this, they put\n  <strong>\n   layers and layers\n  </strong>\n  of security in the code to protect it. Again... the cell phone company I worked for did this with the bootloader.\n </p>\n <p>\n  ....that said, bypassing anticircumvention devices is a separate issue covered by\n  <a href=\"http://www.copyright.gov/1201/\">\n   section 1201 of the DMCA\n  </a>\n  which forbids reverse engineering if it involves circumvention of a technological protection measure.\n </p>\n <p>\n  So if you want to learn how something works, if you want to make sure you have interoperability with a product, if you want to do encryption research or security testing... go for it. If you want to reverse engineer some software to make a key gen so people don't have to buy it... I would keep that to yourself.\n </p>\n <p>\n  Hope that helps.\n </p>\n</div>\n</body></html>",
            "votes": "23",
            "user": "Mike",
            "time": "Mar 19, 2013 at 20:01",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Pacerier",
                    "text": "<span class=\"comment-copy\">Wait, so \"bypassing anticircumvention devices\" is not allowed? How does this work in theory and practice? I'm going to say that  this can't be true because there are tons of people who reverse engineer obfuscated code (think: obfuscated javascript). Also, there are stuff like <a href=\"https://github.com/apprenticeharper/DeDRM_tools/releases/tag/v6.3.4a\" rel=\"nofollow noreferrer\">DeDRM</a> (<a href=\"http://arstechnica.com/gadgets/2012/10/drm-be-damned-how-to-protect-your-amazon-e-books-from-being-deleted/\" rel=\"nofollow noreferrer\">cf.</a>) which <i>had</i> to be legal as Github hasn't been forced to take it down.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The book\n  <em>\n   <a href=\"http://www.wiley.com/WileyCDA/WileyTitle/productCd-0764574817.html\" rel=\"noreferrer\">\n    Reversing: Secrets of Reverse Engineering by Eldad Eilam\n   </a>\n  </em>\n  provides some guidance on the legality of reverse engineering within the United States. The book recommends seeking legal counsel before starting any \"high risk\" reversing project, and then gives the following sections as guidelines as high risk.\n </p>\n <h3>\n  Interoperability\n </h3>\n <p>\n  Using reverse engineering for interoperability purposes has been supported in the US judicial system.  Accolade, A California-based game developer was\n  <a href=\"http://en.wikipedia.org/wiki/Sega_v._Accolade\" rel=\"noreferrer\">\n   sued by for copyright infringement in 1991\n  </a>\n  by Sony after reverse-engineering the Sega Genesis programming interface and publishing games for the Sega Genesis.  Accolade won the court case because the Accolade games did not contain any of Sega's code and because of the public benefit resulting in the increased competition.\n </p>\n <h3>\n  Competition\n </h3>\n <p>\n  Reverse engineering may be considered illegal when used to steal code from a competing process.\n </p>\n <h3>\n  Trade Secrets and Patents\n </h3>\n <p>\n  Reverse engineering patented technology would not make sense since the patent information is already public. Trade secrets exist to protect developers in the case where a malicious employee may attempt to sell of a secret to a competitor.  A product being a trade secret does not protect its the developer in cases where a competitor reverse engineers the product as long as the product is available on the open market and was obtained legitimately.\n </p>\n <h3>\n  Digital Millennium Copyright Act\n </h3>\n <p>\n  The DMCA legally protects\n  <em>\n   copyright protection systems\n  </em>\n  from circumvention.  The DMCA does not apply to any other type of copyrighted software, and therefore many reverse engineering efforts will not be subject to rules and exceptions granted by the DMCA. The things that are explicitly prohibited under the DMCA:\n </p>\n <ul>\n  <li>\n   <strong>\n    Circumvention of copyright protection systems\n   </strong>\n  </li>\n  <li>\n   <strong>\n    Development of circumvention technologies\n   </strong>\n   . The book mentions specifically that a keygen would be a good example of a circumvention technology. But the book does not mention how tools use to create circumvention technologies (IDA Pro, for instance) are covered.\n  </li>\n </ul>\n <p>\n  However, there are exceptions in which circumvention is allowed.\n </p>\n <ul>\n  <li>\n   <strong>\n    Interoperability\n   </strong>\n   \"reversing and circumventing DRM technologies may be allowed in circumstances where such work is needed in order to interoperate with the software product in question. For example, if a program was encrypted for the purpose of copy protecting it, a software developer may decrypt the program in question if that's the only way to interoperate with it.\"\n  </li>\n  <li>\n   <strong>\n    Encryption Research\n   </strong>\n   Circumvention is allowed so long as the protection technologies interfere with the evaluation of the encryption technology\n  </li>\n  <li>\n   <strong>\n    Security Testing\n   </strong>\n   Reversing and circumvention is allowed for the purpose of \"evaluating or improving the security of a computer system\"\n  </li>\n  <li>\n   <strong>\n    Government Investigation\n   </strong>\n  </li>\n  <li>\n   <strong>\n    Regulation\n   </strong>\n   The DCMA allows for DRM technologies to be subvereted for the purposes of regulating the materials accessible to minors on the internet.\n  </li>\n  <li>\n   <strong>\n    Protection of privacy\n   </strong>\n   \"Products that collect or transmit personal information may be reversed and any protection technologies they include may be circumvented.\"\n  </li>\n </ul>\n <h3>\n  License Agreement Considerations\n </h3>\n <p>\n  With regard to the anti-reverse-engineering clauses found within software license agreements, Eilam says there is no single, authoritative answer and that it all depends on the specific circumstances of the reverse-engineering effort.\n </p>\n <p>\n  Wikipedia also has a\n  <a href=\"http://en.wikipedia.org/wiki/Reverse_engineering#Legality\" rel=\"noreferrer\">\n   section on the legality of reverse engineering\n  </a>\n  which claims that \"courts have found such contractual prohibitions to override the copyright law which expressly permits it; see\n  <a href=\"http://en.wikipedia.org/wiki/Bowers_v._Baystate_Technologies\" rel=\"noreferrer\">\n   Bowers v. Baystate Technologies\n  </a>\n  \"\n </p>\n <p>\n  It should be noted that\n  <em>\n   Bowers v. Baystate Technologies\n  </em>\n  established that license agreements can preempt fair use rights as well as expand the rights of copyright holders beyond those codified in US federal law.\n </p>\n</div>\n</body></html>",
            "votes": "16",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "WPrecht",
                    "text": "<span class=\"comment-copy\">I'd add an endorsement of Eilam's book, it was well worth the time to read.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It may also be worth considering how laws can be abused to pressure those engaged in reverse engineering to stop and withdraw their findings - the anti-circumvention provisions on the DMCA is often abused for this reason.\n </p>\n <p>\n  A great example is the factoring of the\n  <a href=\"http://spectrum.ieee.org/consumer-electronics/gadgets/for-texas-instruments-calculator-hackers-dont-add-up/0\">\n   TI-83+\n  </a>\n  signing key - the intent wasn't to enable piracy, but TI used this claim to try and stop the research.\n </p>\n <p>\n  The EFF has\n  <a href=\"https://www.eff.org/press/releases/fifteen-years-dmca-abuse\">\n   documented\n  </a>\n  a number of cases of such abuse - it's a disturbingly common tactic to stop researchers. Even in cases where you are fully within your rights, it's hard to fight an army of lawyers.\n </p>\n</div>\n</body></html>",
            "votes": "10",
            "user": "Adam Caudill",
            "time": "Mar 19, 2013 at 20:40",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you have a legal issue you consult with a lawyer. Even a lawyer will never ensure you of anything. They will provide legal advice based on precedent. If you want to explore the matter in depth you need to go to trial.\n </p>\n <p>\n  That said, and this is not legal advice, in the USA you are generally allowed to publish anything which is not covered under a agreement between you and another party stating that you will not do so and which is not\n  <a href=\"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=958099\">\n   classified information\n  </a>\n  . This is because of your first amendment rights.\n </p>\n</div>\n</body></html>",
            "votes": "7",
            "user": "Peter Andersson",
            "time": "Mar 19, 2013 at 19:39",
            "is_accepted": false,
            "comments": []
        }
    ]
}