{
    "title": "Capturing ADB commands sent by a Windows program to a phone",
    "link": "https://reverseengineering.stackexchange.com/questions/30044/capturing-adb-commands-sent-by-a-windows-program-to-a-phone",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I would like to see, what ADB commands a Windows program is sending to my Android phone, to see how its functions operate.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "511",
    "tags": [
        "android"
    ],
    "user": "aaas",
    "time": "Oct 26, 2023 at 9:47",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  ADB is a combination of three components:\n  <sup>\n   <a href=\"https://developer.android.com/studio/command-line/adb\" rel=\"nofollow noreferrer\">\n    1\n   </a>\n  </sup>\n </p>\n <blockquote>\n  <ol>\n   <li>\n    A client, which sends commands. The client runs on your development machine. You can invoke a client from a command-line terminal by\nissuing an adb command.\n   </li>\n   <li>\n    A daemon (adbd), which runs commands on a device. The daemon runs as a background process on each device.\n   </li>\n   <li>\n    A server, which manages communication between the client and the daemon. The server runs as a background process on your development\nmachine.\n   </li>\n  </ol>\n </blockquote>\n <h2>\n  Capture local TCP traffic\n </h2>\n <p>\n  So you have multiple possibilities to capture ADB traffic. The easiest way would be to capture the TCP data sent from adb client to the server. Both are running by default on your computer on your user account, so they simply communicate via localhost (as far as I know not protected in any way). That communication can therefore be sniffed using Wireshark. I am not sure if Wireshark already contains a dissector for adb client-server communication (or at least there are third party dissectors available of adb traffic) but even if not you should see the commands in plain text in the traffic and you can execute sample commands where you exactly know the command to learn how such packets do look alike.\n </p>\n <h2>\n  Capture USB traffic\n </h2>\n <p>\n  The second way would be to capture the USB traffic. How that can be done depends on the used OS, but as far as I know there should be a possibility on each of the major OS (Windows, Linux, MacOS).\n </p>\n <h2>\n  Capture used adb command-line\n </h2>\n <p>\n  A third way (if the program that sends adb command executes commands using adb client, you could monitor the created processes and their command-line. On Windows you you for example use\n  <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/procmon\" rel=\"nofollow noreferrer\">\n   Sysinternals Process Monitor\n  </a>\n  to monitor all process creation and their command-line.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Robert",
            "time": "Mar 9, 2023 at 13:13",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  In addition to the solutions that @Robert provided, one of the simplest ways to see adb logs is to use the command\n  <code>\n   adb logcat\n  </code>\n  .\n </p>\n <p>\n  Logcat is a command-line tool that dumps a log of system messages, including stack traces when the device throws an error and messages that you have written from your app with the Log class.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "h0r53",
            "time": "Jul 20, 2022 at 18:12",
            "is_accepted": false,
            "comments": []
        }
    ]
}