{
    "title": "Relationship between compiled bytes of jmp instruction and target memory address",
    "link": "https://reverseengineering.stackexchange.com/questions/30225/relationship-between-compiled-bytes-of-jmp-instruction-and-target-memory-address",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm very new to all this, so sorry if I mess up and/or am unclear. I'm working on reverse engineering assault cube, where a lot of people start, and I'm struggling to understand how this one AOB injection works. In order to make this more universal, I'll try to omit specific things about assault cube. This is all in x86 32-bit, and I'm on Windows 64-bit.\n </p>\n <p>\n  My goal is to replace 5 bytes at the address of\n  <code>\n   ac_client.exe\n  </code>\n  (base address) + 29D1F (<-00429D1F) to a jmp instruction to a function that I dynamically allocated in C++. cheat engine shows that in their AOB injection version, the bytes at that address become E9 DC622600, and they label it as jmp 00690000. Following that, at the code at address 00690000, there's another jmp instruction later to return control. these instructions bytes are E9 189DD9FF and its labeled jmp ac_client.exe+29D24 (<- 00429D22, the address of the instruction after the one it replaced). In short, I'll need to be able to inject the compiled bytes of a jump instruction to a specific memory address into memory during runtime.\n </p>\n <p>\n  So, in trying to replicate that, I have not been able to draw a link between the bytes and the addresses they represent (DC622600 : 00690000, 189DD9FF : 00429D1F). I have tried big endian, small endian, octals, hex ofc, absolute vs relative, and I can't find anything. I've also tried reassembling and dissembling all of these values / instructions with\n  <a href=\"https://defuse.ca/online-x86-assembler.htm#disassembly\" rel=\"nofollow noreferrer\">\n   https://defuse.ca/online-x86-assembler.htm#disassembly\n  </a>\n  and cannot find a link. If any of you may know what I'm doing wrong, I would hugely appreciate any help, and if you need any more info, I'm on it! Thanks a ton!\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "517",
    "tags": [
        "disassembly",
        "x86",
        "c++",
        "reassembly",
        "cheat-engine"
    ],
    "user": "owaowabeep",
    "time": "Apr 11, 2022 at 18:32",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  E9 is jump relative\n </p>\n <p>\n  it jumps to an address relative to the next instruction address\n </p>\n <p>\n  E9 is a five byte sequence 1 byte for opcode and 4 byte for calculating the relative location\n </p>\n <p>\n  assume you are at address 0x1000 the next instruction will start at 0x1005\n </p>\n <p>\n  the jump location is calculated by adding 0x1005 with the constant in the current instruction\n </p>\n <p>\n  in your case the constant is  DC622600 or 0x002662dc adding 5 makes it 0x002662E1\n </p>\n <p>\n  this is the address it will jump to which in your case happens to be 0x00690000\n </p>\n <p>\n  so current instruction address must be  0x690000-0x2662e1\n </p>\n <p>\n  which is '0x429d1f'\n </p>\n <pre><code>>>> ip = 0x429d1f\n>>> len = 5\n>>> nextaddress=ip+len\n>>> jmpconst = 0x2662dc\n>>> jmploc = nextaddress+jmpconst\n>>> print(\"%x %x %x %x %x\n\" % (ip,len,nextaddress,jmpconst,jmploc))\n429d1f 5 429d24 2662dc 690000\n</code></pre>\n</div>\n</body></html>",
            "votes": "1",
            "user": "blabb",
            "time": "Apr 15, 2022 at 3:40",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  These jumps use 4 byte little-endian offsets relative to the next instruction's address.\n </p>\n <p>\n  That's a mouthful so a walkthrough should make it easier:\n </p>\n <p>\n  Your first example is a jump from address\n  <code>\n   0x429D1F\n  </code>\n  to\n  <code>\n   0x690000\n  </code>\n  . The\n  <code>\n   jmp\n  </code>\n  instruction itself will be 5 bytes, the opcode\n  <code>\n   E9\n  </code>\n  plus a 4 byte little-endian offset. But the offset is relative to the\n  <em>\n   next\n  </em>\n  instruction's address, so it is relative to 5 bytes further.\n </p>\n <p>\n  So to calculate that offset, we calculate:\n </p>\n <pre><code>offset = destination - (source + 5)\noffset = 0x690000 - (0x429D1F + 5)\noffset = 0x2662DC\n</code></pre>\n <p>\n  If you look closely, that is almost the bytes you found -\n  <code>\n   DC622600\n  </code>\n  but not quite because of the endianness.\n  <code>\n   0x2662DC\n  </code>\n  as 4 bytes little-endian is\n  <code>\n   DC 62 26 00\n  </code>\n  which is what CheatEngine showed you.\n </p>\n <p>\n  And to add a bit - another instruction for jumps is the short jmp, opcode\n  <code>\n   EB\n  </code>\n  which only uses a 1 byte relative offset instead of 4 bytes (sometimes that's all you need and you can save space!), so there you'd calculate\n </p>\n <pre><code>offset = destination - (source + 2)\n</code></pre>\n <p>\n  So same principle, opcode plus offset relative to the next instruction's address.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Johann Aydinbas",
            "time": "Apr 15, 2022 at 1:55",
            "is_accepted": false,
            "comments": []
        }
    ]
}