{
    "title": "How to detect incorrectly named DLL?",
    "link": "https://reverseengineering.stackexchange.com/questions/30284/how-to-detect-incorrectly-named-dll",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying a simple lab on malware analysis and we were given both an .exe and .dll file.\n </p>\n <p>\n  However, I am told that the DLL will need to be renamed to something for it to work.\n </p>\n <p>\n  How do I go about detecting what name it should be?\n </p>\n <p>\n  I've tried looking at the .exe using CFF Explorer, PE Viewer and other tools to look at the imports, but I do not see any.\n </p>\n <p>\n  There are only imports to KERNEL32.dll and PSAPI.DLL but none to a custom named one, and so I am quite confused with how I am supposed to rename my dll to.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "128",
    "tags": [
        "ida",
        "static-analysis",
        "dll",
        "dynamic-analysis",
        "dll-injection"
    ],
    "user": "Iva l",
    "time": "Apr 18, 2022 at 10:58",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n DLLS don't have to be loaded by imports, they can simply be loaded using\n <code>\n  LoadLibrary\n </code>\n and\n <code>\n  GetprocAddress\n </code>\n so check the exe for such calls. So an example here:\n <a href=\"https://docs.microsoft.com/en-us/windows/win32/dlls/using-run-time-dynamic-linking\" rel=\"nofollow noreferrer\">\n  docs.microsoft.com/en-us/windows/win32/dlls/…\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "blabb",
            "text": "<html><body><span class=\"comment-copy\">\n Static or dynamic if you can run it you can enable loader snaps it should split the DLL load events and failure dbgprints\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This is a rather generic question, but I'll give it a shot.\n </p>\n <p>\n  For starters imports from DLLs can exist roughly in three forms:\n </p>\n <ul>\n  <li>\n   static imports\n  </li>\n  <li>\n   delay-load imports\n  </li>\n  <li>\n   dynamic imports\n  </li>\n </ul>\n <p>\n  Now one could argue that the delay-load and dynamic imports should be in the same group and yes, there is some truth to it. However, delay-loading uses structures in the PE file and requires some support in the linker and loader, too. So I think it can equally stand on its own.\n </p>\n <p>\n  Static imports mean that the loader will resolve the name of the DLL and then attempt to resolve each of the functions imported from that DLL\n  <em>\n   before your main thread\n  </em>\n  even gets to start.\n </p>\n <p>\n  Delay-loading puts the onus of resolving DLL name and functions on the application itself, provided the application overrides certain callbacks (see\n  <code>\n   delayimp.h\n  </code>\n  ). This allows for more graceful error handling or even for providing fallback functionality on a downlevel Windows version.\n </p>\n <p>\n  Dynamic imports typically use\n  <code>\n   LoadLibrary\n  </code>\n  and/or\n  <code>\n   LoadLibraryEx\n  </code>\n  to load the DLL in question and\n  <code>\n   GetProcAddress\n  </code>\n  to retrieve the function addresses in the loaded DLL, which can then be called subsequently.\n </p>\n <p>\n  Only the first two (static and delay-load) will show up in the PE image. To find out dynamic imports you need to reverse engineer the binary and look for calls to\n  <code>\n   LoadLibrary\n  </code>\n  and\n  <code>\n   GetProcAddress\n  </code>\n  . This can be arbitrarily hard, depending on obfuscation or protection schemes applied to the PE image. A debugger (dynamic analysis) is theoretically also an option, but not for malware. The last possibility I see is using the Bochs Debugger in IDA or something like\n  <a href=\"https://www.unicorn-engine.org/\" rel=\"nofollow noreferrer\">\n   Unicorn\n  </a>\n  or\n  <a href=\"https://qiling.io/\" rel=\"nofollow noreferrer\">\n   Qilin\n  </a>\n  . Obviously some Sandboxes could also be an option and may answer what DLLs get loaded at what point by the malware (unless the malware has sandbox detection and behaves differently inside a sandbox).\n </p>\n <hr/>\n <p>\n  Now to the incorrectly named DLL. There are two ways to look at it (at least).\n </p>\n <ol>\n  <li>\n   The DLL name could have changed\n  </li>\n  <li>\n   the .exe requires the DLL to have a particular name\n  </li>\n </ol>\n <p>\n  The first scenario can often be spotted by looking at the export table, which also sometimes contains a DLL name (\n  <code>\n   IMAGE_EXPORT_DIRECTORY::Name\n  </code>\n  ). But this isn't 100% waterproof, because this field may be NULL, as far as I know. But it's still good to know.\n </p>\n <p>\n  The second scenario means you need to find out what DLL name the .exe expects (via reverse engineering). It could be as easy as looking at the import table or delay-load imports, but you tried that already. So chances are you need a disassembler or similar tool to dig deeper.\n </p>\n <p>\n  I'd probably try a few common DLL names which are prone to\n  <em>\n   DLL placement attacks\n  </em>\n  , such as\n  <code>\n   version.dll\n  </code>\n  and\n  <code>\n   cryptsp.dll\n  </code>\n  . By looking in the object manager namespace (using WinObj etc), you can weed out the \"safe\" DLLs from those that are prone to DLL placement attack by looking in\n  <code>\n   \\KnownDlls\n  </code>\n  (and its 32-bit counterpart on a 64-bit Windows).\n </p>\n <p>\n  If these don't yield results you\n  <em>\n   have to\n  </em>\n  employ a disassembler or similar, because you're out of the \"cheaper\" options. And that's where your question isn't specific enough (e.g. there is no file sample to look at) to be of further help.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "0xC0000022L",
            "time": "Apr 19, 2022 at 8:47",
            "is_accepted": false,
            "comments": []
        }
    ]
}