{
    "title": "iOS unknown library sending ssl pinned request",
    "link": "https://reverseengineering.stackexchange.com/questions/30376/ios-unknown-library-sending-ssl-pinned-request",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Here is my problem:\n </p>\n <p>\n  I am trying to access to a ssl pinned request sent by an action I am doing on an iPhone. The action I am making sends two requests:\n </p>\n <ul>\n  <li>\n   The first one is ssl pinned, sent by a pre-installed app made by apple, that I can access with Frida simply with\n   <code>\n    frida -U --no-pause -l certSpoofer.js NAME\n   </code>\n   . So no problem, I just had to catch the certificate just before the request was sent, and I can read this request.\n  </li>\n  <li>\n   BUT, the second one is ssl-pinned, and sent by a builtin library, that my app calls. So the request is not going from my apple app, but from a library, and I don't know what this library is ...\n  </li>\n </ul>\n <p>\n  I can't find the process sending this second request. I tried:\n </p>\n <ul>\n  <li>\n   <code>\n    frida-trace -U ... MYAPP\n   </code>\n   , but it gave me only results for my first request\n  </li>\n  <li>\n   <code>\n    frida-trace -U ... -p A_PROCESS_I_THOUGHT_IT_WAS\n   </code>\n   , it might be used in the process but it is not sending the request for sure\n  </li>\n  <li>\n   grep the request domain on the iPhone to find back the file, but the file matching seems to be a sort of dictionary full of urls and str to be used by many processes, so too much results.\n  </li>\n  <li>\n   using\n   <a href=\"https://github.com/iddoeldor/frida-snippets#os-log\" rel=\"nofollow noreferrer\">\n    this script\n   </a>\n   to see the request in the logs. It works, but they are not formatted (e.g:\n  </li>\n </ul>\n <pre><code>Building URL request with URL: %@\nHeaders\n       User Agent: %@\n</code></pre>\n <p>\n  so I can't see the details of the request, and still don't know from where it is sent.\n </p>\n <ul>\n  <li>\n   Disassembling my app with Hopper Disassembler, to see where it was sending the request, but I didn't find.\n  </li>\n  <li>\n   I also tried to attach the script I am using to catch requests certificate to ALL pids of the iPhone, in the goal to intercept each request going off the phone: It ended each time very bad making my python crash (not raising exceptions, crashing), so not the best solution.\n  </li>\n </ul>\n <p>\n  Does someone knows what I could do in order to, at least, find the process sending my second \"background\" request ? Thanks a loooot\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "72",
    "tags": [
        "ios",
        "frida",
        "openssl"
    ],
    "user": "hmngwn",
    "time": "May 8, 2022 at 12:58",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n You could use some sort of proxy that simply delays the request (without actually intercepting7decrypting it). Then while the connection is running you have some time to identify the pid that causes the request. The I would try to hook it and trace socket functions.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "hmngwn",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks for your suggestion, very great idea. I just made a python program based on your idea that lists all process being opened and closed in real time. It works very very well. I will publish it when it'll be working completely.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}