{
    "title": "What techniques are there for mapping code in IDA Pro to the same code in Ghidra, or vice versa?",
    "link": "https://reverseengineering.stackexchange.com/questions/30432/what-techniques-are-there-for-mapping-code-in-ida-pro-to-the-same-code-in-ghidra",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  How can I map between code in IDA Pro and the same code in Ghidra?  I.e., I am looking at a particular piece of assembly in one, and want to find the same assembly in the other.\n </p>\n <p>\n  Based on asking others and thinking about it myself, I have come up with the following:\n </p>\n <ul>\n  <li>\n   Symbols - if they exist\n  </li>\n  <li>\n   Library references could serve as hints, if they can be identified\n  </li>\n  <li>\n   String references (i.e., both pieces of code refer to the same constant string)\n  </li>\n  <li>\n   Trying to find the same opcode sequence - is there any easy way to do this, where I could do something like cut the assembly from IDA and tell Ghidra to find the same sequence of instructions?\n  </li>\n </ul>\n <p>\n  What else is there?  Are there any automated tools for this?  If there are no symbols, what is the \"best\" way?\n </p>\n <p>\n  I am assuming that it is useful to be able to use both tools on the same target.  Perhaps I am wrong.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 2,
    "views": "474",
    "tags": [
        "ida",
        "ghidra"
    ],
    "user": "Paul",
    "time": "May 24, 2022 at 20:30",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you have the same binary then this should be straightforward. The approaches you came up with are all typical and useful for trying to correlate code from\n  <em>\n   similar\n  </em>\n  binaries and are then handled by dedicated tools/plugins (like BinDiff, Diaphora, or Ghidra's Version tracking)\n </p>\n <p>\n  If the binary has a fixed location in the address space, then both IDA and Ghidra should load them at this address and the address of the assembly code you are interested in should just be the same in IDA and Ghidra.\nIf the binary is position independent then IDA and Ghidra might load them at different addresses by default, but this can be set to the same address during the initial import. Then the addresses for each instruction or data should be the same in IDA and Ghidra.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Florian Magin",
            "time": "May 24, 2022 at 9:22",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Paul",
                    "text": "<span class=\"comment-copy\">Wow, that's all?  That sounds easy.</span>",
                    "time": null
                },
                {
                    "user": "Paul",
                    "text": "<span class=\"comment-copy\">Is there any easy analogue for <code>gdb</code>?</span>",
                    "time": null
                },
                {
                    "user": "Florian Magin",
                    "text": "<span class=\"comment-copy\">Same idea with GDB. Either there is a fixed base address that the binary has to be loaded at anyway, then the addresses should just be the same in GDB. But I don't remember how to set the base address with GDB in case of a position independent executable, so maybe the workaround to that has to be using the base address of GDB in IDA/Ghidra.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It looks like maybe this would work?\n </p>\n <p>\n  <a href=\"https://reverseengineering.stackexchange.com/questions/29375/how-to-find-offset-to-a-function-address-from-the-base-address-in-decompiled-ima\">\n   How to find offset to a function address from the base address in decompiled image (IDA or Ghidra)\n  </a>\n </p>\n <p>\n  IIUC you find the base address in each tool, and then assume that the offset should be the same in both tools.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Paul",
            "time": "May 23, 2022 at 19:22",
            "is_accepted": false,
            "comments": []
        }
    ]
}