{
    "title": "Can I get back an exe file from an .Asm formatted file disassembled with IDA?",
    "link": "https://reverseengineering.stackexchange.com/questions/30448/can-i-get-back-an-exe-file-from-an-asm-formatted-file-disassembled-with-ida",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I actually have a .asm formatted file. This file was certainly obtained by disassembling an original exe file with IDA and then save as an .asm file. Now I have this .asm and I would like to get back the original exe, that I have lost. Unfortunately I cannot upload this .asm file in IDA pro and assemble it. So my question is \"how to assemble it again to make an exe as original one ?\nThank for your help. Bye\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "430",
    "tags": [
        "ida",
        "assembly"
    ],
    "user": "roberto bruzzese",
    "time": "May 28, 2022 at 7:06",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  As far as assembling .asm file is concerned (assuming you are on windows platform) there are various assembler such a NASM,MASM,FLAT assembler etc. and various others in compilers suite such as GNU GCC Mingw.\n </p>\n <p>\n  But considering above case, as .asm file is generated by IDA, directly assembling it in any assembler program will give you large number of errors. Asm file generated by IDA is easy to understand but difficult to assemble.\n </p>\n <p>\n  However, if the size of asm file is small say 1-3Kb a little effort and knowledge of syntax specific to assembler tool will yield the result provided every instruction was disassembled successfully by IDA. But if the size of file is large then it is a difficult task.\n </p>\n <p>\n  Please also note that sometime IDA assembly can be erroneous such as\n  <code>\n   positive sp detected\n  </code>\n  in that case you have to correct/fix the stack size in assembly file manually.\n </p>\n <p>\n  Moreover, sometimes IDA cannot recognize code and it is left as data in the disassembly which will get reflected in your .asm file, this will generate error when you assemble your file.\n </p>\n <p>\n  Finally, assembling IDA generated .asm file is bad idea, it's better to go through IDA pseudo code and generate a corresponding function.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Viktor",
            "time": "May 28, 2022 at 10:02",
            "is_accepted": false,
            "comments": [
                {
                    "user": "roberto bruzzese",
                    "text": "<span class=\"comment-copy\">I attach this link that however is quite old <a href=\"https://reverseengineering.stackexchange.com/questions/3800/why-there-are-not-any-disassemblers-that-can-generate-re-assemblable-asm-code\" title=\"why there are not any disassemblers that can generate re assemblable asm code\">reverseengineering.stackexchange.com/questions/3800/…</a></span>",
                    "time": null
                },
                {
                    "user": "Viktor",
                    "text": "<span class=\"comment-copy\">Yes sir,  this link explains pretty much every aspect. Task is tedious but I think once you know what a exe is supposed to do then you can make a program for that. However again size of the exe and how complex is the task are the crux.</span>",
                    "time": null
                }
            ]
        }
    ]
}