{
    "title": "Modify, unpack, and rebuild an Android App Bundles (.aab) file",
    "link": "https://reverseengineering.stackexchange.com/questions/30481/modify-unpack-and-rebuild-an-android-app-bundles-aab-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  My developer has not provided me the source code backup for my listed app in Google Play (his PC was stolen and all codes are gone with it). I logged on to my Play Store developer's account and found the .aab file and downloaded it.\n </p>\n <p>\n  Can I give this file to any developer to update my app, or do I need the source code backup to update the app?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "android",
        "apk",
        "development"
    ],
    "user": "Arban Naco",
    "time": "Jun 9, 2022 at 7:59",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   Can I give this .aab file to any developer to update my App?\n  </p>\n </blockquote>\n <p>\n  No you can't. The Android App Bundle usually contains compiled DEX code (and optional compiled .so libraries) very similar to the final APK file(s) that are provided to the end users.\n </p>\n <p>\n  People with reverse engineer background may be able to make minor modifications by decompiling the dex code to SMALI code, but SMALI code is a bit like assembler code, difficult to read, not structured difficult to write. Making more than minor modifications this way is unrealistic. You also have to consider that developer with reverse engineering background are more expensive and every modification will take more development time as usual (expect 2-20 times more).\n </p>\n <p>\n  Alternatively a developer could try to decompile the app using Jadx to Java code and recover certain parts of the app implementation, but Jadx may not able decompile every method and class, also some methods may be decompiled in an incorrect way.\n </p>\n <p>\n  This means large parts of the app have to be reimplemented.\n </p>\n <p>\n  Next time make sure you get access the full source code and use a developer who practices standard procedures like regular backups (or at least uses a private online-space for mirroring the code, e.g. a private Github repo or something similar).\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Robert",
            "time": "Jun 7, 2022 at 8:41",
            "is_accepted": true,
            "comments": []
        }
    ]
}