{
    "title": "Gdb hardware watchpoint error on android",
    "link": "https://reverseengineering.stackexchange.com/questions/30498/gdb-hardware-watchpoint-error-on-android",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  After failing to find a solution to\n  <a href=\"https://reverseengineering.stackexchange.com/questions/30493/lldb-debugging-on-android\">\n   this\n  </a>\n  I have started using Gdb  and have encountered another error.\n </p>\n <p>\n  <code>\n   Gdb\n  </code>\n  fails to set hardware watchpoint when I'm remote debugging a rooted\n  <code>\n   arm7-a\n  </code>\n  target. It supports hardware watchpoints and breakpoints according to the Technical references manual.\n </p>\n <blockquote>\n  <p>\n   <strong>\n    Breakpoints and watchpoints\n   </strong>\n  </p>\n  <p>\n   The processor supports six breakpoints, four watchpoints, and a\nstandard Debug Communications Channel (DCC). Four of the breakpoints\nmatch only to virtual address and the other two match against either\nvirtual address or context ID, or Virtual Machine Identifier (VMID).\nAll the watchpoints can be linked to two breakpoints to enable a\nmemory request to be trapped in a given process context.\n  </p>\n </blockquote>\n <p>\n  If i set a hardware watchpoint on\n  <code>\n   gdb\n  </code>\n  then it says failed to set hardware watchpoint. But if i change the parameter using:\n </p>\n <pre><code>set can-use-hw-watchpoints 0\n</code></pre>\n <p>\n  I can set the software watchpoint successfully but it is very slow and laggy. I really dont understand why its failing. Could it be because the watchpoint is not correctly aligned?\n </p>\n <p>\n  The processor is an arm cortex-a7 and i can link the technical references manual if needed. Help would be greatly appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "193",
    "tags": [
        "debugging",
        "android",
        "arm",
        "gdb",
        "breakpoint"
    ],
    "user": "Silent",
    "time": "Jun 10, 2022 at 14:54",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Turns out this processor doesn't support hardware watchpoints or the debuggers dont have support for hardware watchpoints for my processor. After trying to set a watchpoint with\n  <code>\n   lldb\n  </code>\n  lldb reported that there are\n  <code>\n   0\n  </code>\n  available hardware watchpoints. So there is no way around this one.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Silent",
            "time": "Jun 12, 2022 at 12:40",
            "is_accepted": true,
            "comments": []
        }
    ]
}