{
    "title": "Source code for an mp3 player?",
    "link": "https://reverseengineering.stackexchange.com/questions/30492/source-code-for-an-mp3-player",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I know this title sounds a little dumb but if you would please bear with me for an explanation. I have a Valoin-made mp3 player I bought close to 3 years ago now. Via a series of interesting discoveries, I have become infatuated with this thing. It plays video (to a degree), the file manager has some oddly specific quirks, the 'home screen' looks eerily like every mp3 player 'home screen' I see on the market, and most importantly, whenever I use an SD card with the device, it offloads some weird files with a format I don't recognize.\n  <a href=\"https://reverseengineering.stackexchange.com/questions/29253/reversing-a-lib-file\">\n   In another post I read\n  </a>\n  a user mentions a similar situation. They seem to have a bunch of .LIB and .PL files added to the root of the SD card file system (FAT32?). Among these files were noticeably: M3U.LIB and EBOOK.LIB. USERPL1.PL, USERPL2.PL, and USERPL3.PL are files native only to my device, it would seem.\n </p>\n <p>\n  I would like to believe that somewhere out there exists a way to interact with the data in these files and maybe understand the weird file-manager quirks. I mentioned that the 'home screen' looks awfully generic and I believe that's for a reason. I think that a company serving as a really niche software vendor might be the common denominator here. If there exists source code that powers these little gizmos, I want to find it. No short of possibly making some phone calls, or digital snooping. If I can't find the source code, I would settle for understanding these .LIB files. If you are curious and/or have the expertise please check out my\n  <a href=\"https://github.com/mllegoman/MP3.LIB\" rel=\"nofollow noreferrer\">\n   github repo\n  </a>\n  that contains the unmodified .LIB files from my mp3 player alongside some pertinent information.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 0,
    "views": "236",
    "tags": [
        "binary-diagnosis",
        "binary-editing",
        "unknown-data"
    ],
    "user": "PixelBlurb",
    "time": "Jun 9, 2022 at 0:04",
    "comments": [
        {
            "user": "raspiduino",
            "text": "<html><body><span class=\"comment-copy\">\n I think my comment is not an answer so I will put it here. For example, if I use\n <code>\n  python -m binwalk -B PICTURE.LIB --dd=\".*\"\n </code>\n with your\n <code>\n  PICTURE.LIB\n </code>\n in your repo, it will give out many readable pictures, I don't know what the picture is about, it seems that it's some game's screenshots?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "raspiduino",
            "text": "<html><body><span class=\"comment-copy\">\n Anyway I will try putting the picture in an issue in your repo.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "raspiduino",
            "text": "<html><body><span class=\"comment-copy\">\n The same thing can be done for\n <code>\n  BOOK.LIB\n </code>\n , which also gives out many pictures, some of them are the same as the pictures from\n <code>\n  PICTURE.LIB\n </code>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "raspiduino",
            "text": "<html><body><span class=\"comment-copy\">\n Also for\n <code>\n  M3U.LIB\n </code>\n , so I think those are some frames from a video\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}