{
    "title": "How do I unpack a file protected by MPRESS?",
    "link": "https://reverseengineering.stackexchange.com/questions/30545/how-do-i-unpack-a-file-protected-by-mpress",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a file that is protected by MPRESS packer and I want to know how to unpack it on Windows. Is there a specific program for that or something else? I am new to this so every help is appreciated.\n  <a href=\"https://i.sstatic.net/egRD4.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/egRD4.jpg\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "3k",
    "tags": [
        "windows"
    ],
    "user": "LC0",
    "time": "Jun 23, 2022 at 7:46",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You can easily unpack MPRESS packed binary manually, this process can be applied to many more packers such as UPX etc. with minimal changes.\n </p>\n <p>\n  I assume you are familiar with debugger and breakpoints(bp). Since you have not provided any instruction snippets or disassembly, I will try to wrap up process in few points in abstract way, though it will be cumbersome but bear with me:\n </p>\n <ol>\n  <li>\n   Reach the entry point of your PE by setting a breakpoint, you may need to change some settings in debugging options if you initially reach system library breakpoint.\n  </li>\n  <li>\n   Now, by this time you have reached bp on entry point, Press\n   <kbd>\n    F8\n   </kbd>\n   (step over) one or two time. On CPU register window set hardware breakpoint on\n   <code>\n    esp\n   </code>\n   register value.\n  </li>\n  <li>\n   Now with hardware bp set in step 2, Press\n   <kbd>\n    F9\n   </kbd>\n   (run) and you will reach hardware breakpoint and will be shown in disassembly.\n  </li>\n  <li>\n   Now you only have to use\n   <kbd>\n    F8\n   </kbd>\n   as will have to reach the\n   <code>\n    OEP\n   </code>\n   (Original Entry Point), therefore using\n   <kbd>\n    F8\n   </kbd>\n   execute instructions step by step, you will notice a\n   <code>\n    jmp\n   </code>\n   instruction which will take you to\n   <code>\n    OEP\n   </code>\n   of your PE.\n  </li>\n  <li>\n   Use Scylla or similar program to dump the current process(your packed program) and fix the import table of the dumped process. Now you have a unpacked MPRESS Portable executable. (Please don't forget to delete invalid imports in Scylla else unpacked file will refuse to run.)\n  </li>\n </ol>\n <p>\n  I know we haven't discussed working of MPRESS and few other details but that would make answer very long and unnecessary given the fact you have not provided disassembly.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Viktor",
            "time": "Oct 3, 2022 at 9:39",
            "is_accepted": false,
            "comments": [
                {
                    "user": "LC0",
                    "text": "<span class=\"comment-copy\">Is there any other way without doing it manually?</span>",
                    "time": null
                },
                {
                    "user": "Viktor",
                    "text": "<span class=\"comment-copy\">@LCO, Sorry to say no, we don't have any other option as far as MPRESS is concerned we have to do it manually, though you can get unpackers programs for upx and some other packer. Initially I also faced same challenge but now it's not a big deal :-)</span>",
                    "time": null
                }
            ]
        }
    ]
}