{
    "title": "Help MMO Tcp Packet",
    "link": "https://reverseengineering.stackexchange.com/questions/30585/help-mmo-tcp-packet",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying re-send the packets that an MMO sends to the server just to learn more about packets. The game uses TCP.\n </p>\n <p>\n  I sent the same message in the game chat \"oi\"\nto analyze the packages sent to the server and these are some examples:\n </p>\n <pre><code>\\x80\\x00=\\x12\\x00\\x03\\x00\\x01c\\x02\\x01\\x00\\x01a\\x03\\x00\\r\\x00\\x01p\\x12\\x00\\x03\\x00\\x01c\\x08\\x00\\x03msg\\x00\\x01r\\x04\\xff\\xff\\xff\\xff\\x00\\x01p\\x12\\x00\\x02\\x00\\x03msg\\x08\\x00\\x02oi\\x00\\x01.\\x04\\xe4\\x08a>\n\n\\x80\\x00=\\x12\\x00\\x03\\x00\\x01c\\x02\\x01\\x00\\x01a\\x03\\x00\\r\\x00\\x01p\\x12\\x00\\x03\\x00\\x01c\\x08\\x00\\x03msg\\x00\\x01r\\x04\\xff\\xff\\xff\\xff\\x00\\x01p\\x12\\x00\\x02\\x00\\x03msg\\x08\\x00\\x02oi\\x00\\x01.\\x04\\x96-\\xad\\xf5\n\n\\x80\\x00=\\x12\\x00\\x03\\x00\\x01c\\x02\\x01\\x00\\x01a\\x03\\x00\\r\\x00\\x01p\\x12\\x00\\x03\\x00\\x01c\\x08\\x00\\x03msg\\x00\\x01r\\x04\\xff\\xff\\xff\\xff\\x00\\x01p\\x12\\x00\\x02\\x00\\x03msg\\x08\\x00\\x02oi\\x00\\x01.\\x04\\x98\\x01U\\x80\n\n\\x80\\x00=\\x12\\x00\\x03\\x00\\x01c\\x02\\x01\\x00\\x01a\\x03\\x00\\r\\x00\\x01p\\x12\\x00\\x03\\x00\\x01c\\x08\\x00\\x03msg\\x00\\x01r\\x04\\xff\\xff\\xff\\xff\\x00\\x01p\\x12\\x00\\x02\\x00\\x03msg\\x08\\x00\\x02oi\\x00\\x01.\\x04\\r\\xc9D\\x1f\n</code></pre>\n <p>\n  As you can see, the end of each packet is changed with each packet sent to the server. Does anyone have any idea what these values ​​at the end of each packet might mean? I want to be able to send my own packets\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 0,
    "views": "94",
    "tags": [
        "protocol",
        "game-hacking",
        "networking",
        "game"
    ],
    "user": "Rck_",
    "time": "Jul 2, 2022 at 18:29",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Could be some sort of packet counter. But the used encoding makes it pretty hard do read the actual values. A common encoding like hexadecimal or a hex-dump.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Rck_",
            "text": "<html><body><span class=\"comment-copy\">\n @Robert what would you recommend me to do?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "dingo_kinznerhook",
            "text": "<html><body><span class=\"comment-copy\">\n @Rck_ - Dump the contents of these messages again, but use entirely hexadecimal notation. If possible, separate the hex into 32-bit values. Some of the contents of your message is presented here as ASCII and some as hex, making it impossible to draw any conclusions.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}