{
    "title": "Identifying the source of encryption used by UDP packets in a PCAP file",
    "link": "https://reverseengineering.stackexchange.com/questions/30714/identifying-the-source-of-encryption-used-by-udp-packets-in-a-pcap-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <ul>\n  <li>\n   <p>\n    I have a\n    <a href=\"https://www.mediafire.com/file/fkbsc7a9t1ymotk/grfs_rpcs3_lan_windows_packet_capture_3.pcapng/file\" rel=\"nofollow noreferrer\">\n     PCAP file\n    </a>\n    (mediafire link to the file) which basically represents packet captures between 2 machines running the same game connected to each other via LAN inside RPCS3 using RPCN.\n   </p>\n  </li>\n  <li>\n   <p>\n    One of them has the inet address 192.168.0.104 and the other one is 192.168.0.100.\n   </p>\n  </li>\n  <li>\n   <p>\n    Many UDP packets are being transmitted between both which I believe is the game data.\n   </p>\n  </li>\n  <li>\n   <p>\n    If you filter the packets by \"tls\" there are 2 TLS handshakes of which I have been able to decrypt the first one using session keys.\n   </p>\n  </li>\n  <li>\n   <p>\n    It has data related to RPCS3 connection.\n   </p>\n  </li>\n  <li>\n   <p>\n    My question is that\n    <strong>\n     are the UDP packets encrypted with the keys generated in the 2nd handshake or are they using some custom encryption\n    </strong>\n    that the game itself manages in its code?\n   </p>\n  </li>\n  <li>\n   <p>\n    The second SSL handshake mostly(90% sure) represents the act of logging into the RPCN network inside RPCS3.\n   </p>\n  </li>\n  <li>\n   <p>\n    How come there are no SSL handshakes between the 2 LAN machines?\n   </p>\n  </li>\n </ul>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "200",
    "tags": [
        "encryption",
        "protocol",
        "networking",
        "wireshark",
        "packet"
    ],
    "user": "PirateApp",
    "time": "Jul 31, 2022 at 12:03",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  To your first question, you'd have to look at the code. There may be encryption, but some of the UDP packets have very small payloads, and using encryption would slow down packet processing which is the opposite of the key purpose for using UDP.. which is speed.\n </p>\n <p>\n  For your second question, the LAN game is using UDP, and TLS needs TCP. If you think about the use case.. TLS/SSL is to verify that at least one end of the connection is who it says it is. If you're on the LAN, you don't know who is who (no DNS) and you don't care.. TLS makes no sense in this case.\n </p>\n <p>\n  I think you're correct that the TLS connections are being used during user authN to the game servers. However, given that the session keys negotiated between 192.168.0.104 <--> game server are used to secure\n  <em>\n   only\n  </em>\n  communication between those 2 hosts, they would not be used between 192.168.0.104 <--> 192.168.0.100 on the LAN as they provide no value. They do not identify either host, and they slow down game performance.\n </p>\n <p>\n  This is a little wordy but I hope it helps.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Mega Tonnage",
            "time": "Jul 31, 2022 at 12:51",
            "is_accepted": true,
            "comments": [
                {
                    "user": "PirateApp",
                    "text": "<span class=\"comment-copy\">I am not SSL expert which is why I hope I am correct about this, as per the second SSL connection the handshake happens between 192...104 and some other IP address so I am guessing that only these 2 addresses would actually use session keys to encrypt data between each other. So its weird that the LAN packets are encrypted</span>",
                    "time": null
                }
            ]
        }
    ]
}