{
    "title": "Tuning motor temperature",
    "link": "https://reverseengineering.stackexchange.com/questions/30816/tuning-motor-temperature",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a DC motor, running in two modes, slow and fast. I will need to run the motor in FAST mode only. The motor is already running for 10 years. The motor experiences variable load.\nAccording to the graph in fig 1, the red line shows the Fast speed with 10 Nm force. The blue line shows a slow speed of 15 Nm. And the top line is the test run in fig 2.\n </p>\n <p>\n  The motor runs for 6 hours at FAST speed. At FAST speed, the motor temperature raises from 25 °C to 90 °C during these 6 hours with a 10 Nm force at 1.4 A current. And stays at 90 °C. With 10 Nm, the motor reaches 90 °C, which is under the temperature limit.\n </p>\n <p>\n  The motor temperature limit is 110°C before it shuts off.\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/WG87R.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/WG87R.png\"/>\n  </a>\n  Fig 1\n </p>\n <p>\n  When I increase the load on the motor to 26 Nm, the motor temperature reaches 110°C in 30 minutes, and the motor shuts off.\n </p>\n <p>\n  To solve this issue, I have to run the motor at certain times at fast and slow speeds. I put in a microcontroller to switch between these two modes. For this, I have run a test that kept the motor running for 129 minutes (2 hours and 15 minutes) by switching between fast and slow modes.\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/HxME7.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/HxME7.png\"/>\n  </a>\n  Fig 2\n </p>\n <p>\n  My goal is to keep the motor running without stopping.\n </p>\n <p>\n  As shown in Fig 2, starting in the first 25 minutes the datasheet reaches 80°C. Afterwards, I put the motor on slow speed for 40 minutes, and the temperature keeps rising to 89°C. Then I put the motor into the fast mode for 10 minutes, and so on, until the temperature reaches 110 °C and the motor shuts off.\n </p>\n <p>\n  With doing the above switching from fast to slow, the temperature goes down, and the run time increases to 129 minutes.\n </p>\n <p>\n  I can’t put a thermometer on the motor due to limitations. The only thing I can measure is the current and time.\n </p>\n <p>\n  I need to know what to do to keep the motor temperature lower than 110°C by switching between fast and slow. I am not sure for how long I should run the motor at each speed, so the overall temperature doesn’t reach 110°C and the time increases to 6 hours and more.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "36",
    "tags": [
        "assembly",
        "debugging",
        "hardware"
    ],
    "user": "Habib Anwari",
    "time": "Aug 24, 2022 at 11:19",
    "comments": [
        {
            "user": "Mega Tonnage",
            "text": "<html><body><span class=\"comment-copy\">\n The data in figure 2 doesn't seem consistent, there may be other variables at play like the ambient temperature etc. Can you run the motor\n <i>\n  only\n </i>\n on slow speed at 26Nm and graph the temperature change? Does it reach a limit lower than 110c?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n Is this really RE?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Mega Tonnage",
            "text": "<html><body><span class=\"comment-copy\">\n No.. but interesting none the less\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "dingo_kinznerhook",
            "text": "<html><body><span class=\"comment-copy\">\n I’m voting to close this question because this question is not about reverse engineering - it is about tuning a motor.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Habib Anwari",
            "text": "<html><body><span class=\"comment-copy\">\n @dingo_kinznerhook I am reverse engineering this motor, to work under such pressure system without having other essential components.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}