{
    "title": "How to set a breakpoint in android's openssl library in running android application?",
    "link": "https://reverseengineering.stackexchange.com/questions/30883/how-to-set-a-breakpoint-in-androids-openssl-library-in-running-android-applicat",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm debugging an obfuscated android application. I use Android Studio's debugger. I attach it remotely to my physical device via adb. I can set a breakpoint in the app smali code, but when I try to step into a function in an external library, the code browser stays at the caller's place (I expected it to show me the called function's disassebly smali output), but stack trace and the variables output follows the called function as expected. Why is that? Can't java debugger inform Android Studio about the instructions to which the code jumped even though they are in an external library?\n </p>\n <p>\n  Also, I know the app calls some functions\n  <code>\n   com.android.conscrypt\n  </code>\n  . Can I set a breakpoint in an external library like this one? If Android Studio can't do that, what other tools can?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "217",
    "tags": [
        "android",
        "java",
        "dalvik"
    ],
    "user": "g00dds",
    "time": "Sep 14, 2022 at 21:47",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n In the title you mentioned openssl which is a native (non-Java/dex) library. I am not sure if AS is capable of debugging arbitrary native libraries you don't have the source code. Also most native libraries come stripped, so without debugging data which makes debugging difficult. For reverse engineering Android apps that make use of native libraries I would recommend to use\n <a href=\"https://frida.re\" rel=\"nofollow noreferrer\">\n  frida.re\n </a>\n in combination with a good decompiler/disassembler like Ghidra or IDA Pro.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "g00dds",
            "text": "<html><body><span class=\"comment-copy\">\n @Robert, thank you for your recommendation, I'll take at look at it. But I'm asking about java dex libraries in general, can I set a breakpoint in the java library? Openssl is also wrapped by some java library, so I could set a breakpoint there.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Do you mean JNI / native libraries?\n </p>\n <p>\n  Android app cannot view into native libraries, but you can use frida-trace to get in between the call and return.\n </p>\n <pre><code>readelf -a -W library.so | grep nativeFunctionNameHere\n</code></pre>\n <p>\n  Note the nativeFunctionName with some other words prepended to it\n </p>\n <pre><code>frida-trace -i \"_JNIStuffblabla_nativeFunctionNameHere\" -F\n</code></pre>\n <p>\n  You will see when it's being called, and you can edit the .js file in the console output to customize/log the function calls\nHowever, to find out what the function does, you will need to use disassemblers/debuggers and try to figure it out.\n </p>\n <p>\n  If you only need to inspect OpenSSL library, just intercept like\n  <code>\n   -i \"openssl_*\"\n  </code>\n  or something, see which function is it that you want, and then log the arguments and/or return value.\n </p>\n <p>\n  If you meant\n  <code>\n   android.\n  </code>\n  libraries, you can again intercept them with frida. It's a really good tool for reverse engineering, especially for Android applications.\nBut why would you need to debug them? They're already publicly available, you should probably focus on the return value, no?\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Cagri",
            "time": "Sep 18, 2022 at 2:31",
            "is_accepted": true,
            "comments": []
        }
    ]
}