{
    "title": "Are physical databooks of any use?",
    "link": "https://reverseengineering.stackexchange.com/questions/30896/are-physical-databooks-of-any-use",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have taken over the office of an old retired electronics guy. As a result, I have a huge shelf filled with data books: Intel, Atmel, Texas Instruments... etc. My instinct is to throw these all away as I assume these are online somewhere.\n </p>\n <p>\n  Are these databooks of any use for (hardware) reverse engineering, or is this information guaranteed online somewhere?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "30",
    "tags": [
        "hardware"
    ],
    "user": "P Novak",
    "time": "Sep 19, 2022 at 16:31",
    "comments": [
        {
            "user": "dingo_kinznerhook",
            "text": "<html><body><span class=\"comment-copy\">\n This is kind of opinion-based. It really depends upon what manuals you have and what type of work you do. It's not guaranteed that you'd find any arbitrary manual online but the most common ones are available online. I keep a physical reference for the instruction set architectures that I work with the most.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "P Novak",
            "text": "<html><body><span class=\"comment-copy\">\n I should clarify. I am nearly positive that these won't be helpful in my job. I wanted to know if I could contribute to the reverse engineering community at large by keeping these books/uploading them, etc.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Rolf Rolles",
            "text": "<html><body><span class=\"comment-copy\">\n Your instinct to want to help the reverse engineering community it laudable. Maybe it makes sense to search the Internet to see which ones are online (and hence safe to get rid of), and then revisit the question?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n Send then to Internet Archive\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}