{
    "title": "Reverse-engineering a 90s CNC machine (FORTH like) firmware",
    "link": "https://reverseengineering.stackexchange.com/questions/30937/reverse-engineering-a-90s-cnc-machine-forth-like-firmware",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Here's an undertaking I'm currently in, and would absolutely love someone to assist more directly. I'll list the subjects that I would greatly appreciate more knowledge within. Know anything about one of these, then I'd most likely love your help.\n </p>\n <ul>\n  <li>\n   CNC\n   <code>\n    Computerized Numerical Control\n   </code>\n   principles\n  </li>\n  <li>\n   CAD\n   <code>\n    Computer-Aided Design\n   </code>\n   and CAM\n   <code>\n    Computer-Aided Manufacturing\n   </code>\n   processes.\n  </li>\n  <li>\n   G-Code\n   <code>\n    CNC Geometry Code\n   </code>\n   format and its\n   <a href=\"https://reprap.org/wiki/G-code\" rel=\"nofollow noreferrer\">\n    reference\n   </a>\n  </li>\n  <li>\n   HP-GL\n   <a href=\"https://en.wikipedia.org/wiki/HP-GL\" rel=\"nofollow noreferrer\">\n    <code>\n     Hewlett-Packard Graphics Language\n    </code>\n   </a>\n  </li>\n  <li>\n   FORTH\n   <a href=\"https://en.wikipedia.org/wiki/Forth_(programming_language)\" rel=\"nofollow noreferrer\">\n    <code>\n     A procedural, stack-oriented programming language\n    </code>\n   </a>\n   decompiling.\n  </li>\n  <li>\n   The specific FORTH language from MultiCam called μCito / micro-Cito / uCito\n  </li>\n  <li>\n   RS-232\n   <code>\n    Recommended Standard 232\n   </code>\n   serial communication over DE-9\n   <code>\n    D-Subminiature\n   </code>\n   cable.\n  </li>\n  <li>\n   The way a\n   <a href=\"https://en.wikipedia.org/wiki/Stepper_motor\" rel=\"nofollow noreferrer\">\n    Stepper Motor\n   </a>\n   works\n  </li>\n  <li>\n   Any Microprocessor Programming / Burning / Flashing experience. Such as ATmega328P (Arduino)\n  </li>\n  <li>\n   Any SBCs\n   <code>\n    Single-board Computer\n   </code>\n   . Such as the Raspberry PI\n  </li>\n  <li>\n   Old 90s MultiCam CNC machines. Like the one I'm on: MultiCam 44 Plus (\n   <a href=\"https://uploads.tapatalk-cdn.com/20161003/c982a5f37388cef867a28f9f2ea1265c.jpg\" rel=\"nofollow noreferrer\">\n    Similar Control Enclosure\n   </a>\n   )\n  </li>\n </ul>\n <p>\n  If one, more, or any of these fall under your interest, and you're in my ballpark 😀. I'm semi knowledgeable in all of the above, but I'm still lacking in the FORTH language and decompiling it. If you're experienced with FORTH, and know how to decompile a firmware that is built like it, please read on, cause you're exactly who I'm looking for!\n </p>\n <hr/>\n <p>\n  <strong>\n   Bit of background info and intentions:\n  </strong>\n </p>\n <p>\n  We have an old MultiCam (hereafter:\n  <code>\n   MC\n  </code>\n  ) 44 Plus CNC Router that was purchased back in the 90s to start a woodworking company. Links above show close to exactly what we have. The machine has been running great, and is mechanically solid as f***. It's electronics are really solid as well. Only trouble with it has been a flakey COM connection, and loose wires. Since CNC software has gotten WAY more advance since the 90s, there is so much available that could improve the CAD process. Since the CAM process has stayed very much \"the same\" at it's low-level computing, it seems logical to improve upon the machines firmware to integrate better interpreting functions of the CAD files. G-Code seems to be the biggest \"standard\" emerging today.\n </p>\n <p>\n  This machine reads exclusively HPGL files, but in a kind of proprietary way. It's intended that toolpaths be exported from MCs own CAD/CAM software EnRoute. The HPGL Post-processor is obfuscated to unreadable, but all exports are done with HPGL mode set to 3D (ZZ1 command). These specific HPGL commands are described in the manual that followed the machine.\n </p>\n <p>\n  Since the machine controller board (hereafter:\n  <code>\n   S960\n  </code>\n  ) is completely outdated, and impossible to find a equal one at a reasonable price, the plan is to replace it with another controller and see that it's possible to keep the machine production up and going even in the event of a complete failure of the S960. So I've ordered some other \"basic\" controller-boards from China, and looking into Mach3 and the works. But to get all the current machine specific parameters from the S960, I started to interface with it over it's RS232 COM-port. And this is where I found a very nice system/program that was controlling it. So since it's already nicely connected, I want to get deeper into this firmware and append more functionality.\n </p>\n <hr/>\n <p>\n  <strong>\n   Research and progress:\n  </strong>\n </p>\n <p>\n  I can probably not publicly share the firmware file and other executables/files. So here is what I'm currently working with:\n </p>\n <ul>\n  <li>\n   A NVRAM\n   <a href=\"https://en.wikipedia.org/wiki/Non-volatile_random-access_memory\" rel=\"nofollow noreferrer\">\n    <code>\n     Non-volatile random-access memory\n    </code>\n   </a>\n   file that is specific for our exact machine\n   <code>\n    FLRAM.UC\n   </code>\n   . It's a long list of parameters written in straight forward uCito commands. Like this:\n   <code>\n    134184961 138 16 set_sysparam 0.900000 139 32 set_sysparam 228.000000 1 set_float 150 36 set_integer\n   </code>\n   <em>\n    - This file came with the purchase of the machine.\n   </em>\n  </li>\n  <li>\n   Some software that performs basic tasks.\n   <strong>\n    COMCHK.EXE\n   </strong>\n   that performs basic RS-232 quality.\n   <strong>\n    MX.EXE\n   </strong>\n   that interfaces the low-level on the S960 such as uploading files.\n   <strong>\n    DIAG.EXE\n   </strong>\n   which I don't know yet what does. Name implies it checks basic functionality of the S960. And\n   <strong>\n    M960UPD.EXE\n   </strong>\n   that I've not tried, and kinda don't want to mess too much with, since it's what updates the firmware\n   <em>\n    - These files came with the purchase of the machine.\n   </em>\n  </li>\n  <li>\n   A binary-formatted file\n   <strong>\n    MTK328G.BIN\n   </strong>\n   which must be the current firmware. It contains many readable words that are direct words available on the terminal, thus seems to be the entire ROM that defines the uCito language. At the end of the file, it's written in plain-text uCito.\n   <em>\n    - This file came with the purchase of the machine.\n   </em>\n  </li>\n  <li>\n   A uCito-formatted file\n   <strong>\n    M23-MIST.INI\n   </strong>\n   that is purely written in plain-text uCito. It's developer commented on the top (dated 1996) with changes made to the file, and it contains the word definitions and variable definitions of many machine specific things. Such as the key functions that are run when one presses the keypad keys on the machine itself. This file is what taught me the language.\n   <em>\n    - This file came with the purchase of the machine.\n   </em>\n  </li>\n  <li>\n   The basic \"file to machine\" server application called WinDNC\n   <strong>\n    WDNC.EXE\n   </strong>\n   . It also came with the machine, and it's extremely \"simple\". It just passes along a directory of files to the machine if the machine requests it.\n  </li>\n  <li>\n   MultiCam Motion Mechanic. This is a program I found while googling the machine, and seemed to be a terminal program to interact with this specific language of machines, and it worked with ours as well. It opens a basic terminal interface, where the machine sends a prompt in return. It gives some more low-level functions such as: \"Reboot machine - Load INIT\", \"Reboot machine - Don't load INIT\", \"Reboot machine - Monitor mode\". Those all do what they say. Monitor mode acts very different, and seem to be the mode needed to perform a true firmware upgrade. It can also send a \"change language\" request to \"Go native (uCito or native)\", which switches the machine from hpgl mode, to uCito interactive mode. This interactive mode is where I learned / tested the language, and it's pretty cool how \"on the fly\" it works.\n  </li>\n </ul>\n <p>\n  I gather by now that the machine operates the following way:\n </p>\n <p>\n  It has a main controller called S960. This is the \"brain\" that parses and stores the proprietary uCito language that is basically just FORTH, with the word definitions changed from pure FORTH. The controller is directly placed beneath the breakout board. This breakout board is labeled M23, and it contains all the pins/plugs which goes to all the interfaces. It has two LED bars with labels, and they light up as the input is triggered (Like the limit switches, Pause key, E-STOP switch, Z-Surface set block, etc). Some LEDs are always lit, and thus seems to be unconnected inputs. It also has a white tactile button that restarts the controller.\n </p>\n <p>\n  From this breakout board, wires go everywhere. 1 directly to the serial of the computer. 4 to the stepper drivers (3 wire leads to each of the 4 drivers. Enable / Step / Dir). 1 to the spindle relay. 1 to a \"Mister relay\" that we've never used. 4 to the limit sensors (rigidly mounted\n  <a href=\"https://en.wikipedia.org/wiki/Inductive_sensor\" rel=\"nofollow noreferrer\">\n   induction switches\n  </a>\n  that triggers when a bolt is underneath it). 2 to the pendant (The control-panel box with keypad and a 20x2 char LCD display). 1 to it's own 5V power-supply.\n </p>\n <p>\n  The controller most likely has a kernel that starts the RS-232 (this is most likely \"monitor mode\"). With no input, it will perform the default boot. It loads the firmware file, and the firmware then loads its own INIT file, that contains more expanded operations of the machine. The INIT file ends with putting the machine into HPGL mode, thus stops echoing input on the RS-232.\n </p>\n <p>\n  The kernel can be told to not load the INIT file, just leaving the machine ready in native/uCito mode. In this mode, naturally no keys on the machines keypad itself works, and nothing is shown in the LCD display. But it interacts with uCito typed directly into the terminal. As such, I could just type out the M23_MIST.INI file in terminal, and it would do the same as if it was loaded.\n </p>\n <p>\n  I've discovered a bunch of what words do and definitions. Some examples:\n </p>\n <p>\n  <code>\n   stk\n  </code>\n  - prints the integer stack without modifying it.\n </p>\n <p>\n  <code>\n   fstk\n  </code>\n  - prints the float stack without modifying it.\n </p>\n <p>\n  <code>\n   .\n  </code>\n  - pops an integer from stack and prints it.\n  <code>\n   f.\n  </code>\n  for float stack.\n </p>\n <p>\n  <code>\n   : <word> <code> ;\n  </code>\n  - defines a word just like FORTH, but here one can \"stack\" words on top of each other. If defined again, future references will refer to it, but previous references will use the first definition.\n </p>\n <p>\n  <code>\n   set_float\n  </code>\n  - Takes an integer from the stack and uses that as a location ref in NVRAM where it stores a float it also pops from the stack.\n </p>\n <p>\n  <code>\n   get_pos?\n  </code>\n  - Takes an integer from the stack and finds that axis position (0-2 = X-Z) and puts it on the float stack.\n </p>\n <p>\n  <code>\n   umaline\n  </code>\n  - Takes 3 floats. X, Y, Z, and moves the machine to those machine absolute coordinates.\n  <code>\n   ualine\n  </code>\n  is same, but in relation to it's \"Set Home\", and\n  <code>\n   uline\n  </code>\n  is in relation to current location (Relative move).\n </p>\n <p>\n  <code>\n   wait_plot\n  </code>\n  - Will START any of the above movements queued, and waits for them to finish.\n </p>\n <p>\n  And many more...\n </p>\n <p>\n  The Motion Mechanic software also has a function to \"Send file\" and \"Store file\". The send just takes a file and \"types\" it into the terminal, but the \"store file\" has a list of locations to store into. These are numbered 1 to 20, and a special \"U\" spot for the User INIT file (The M23_MIST.INI). With some experimentation and just pure guessing, I used \"dir\" command to list the filesystem. It has numbered files, and the INIT file, and shows the available space. The \"list\" command preceded with a filenumber will print the file to terminal, thus it allowed me to capture and download the INIT file on the machine, and a SELF_TEST file that was located in #2. After doing a blunder and trying the \"format_files\" command, wiping ALL files on the filesystem, I was able to understand that position -3 was the INIT file location, and used \"-3 store\" to save the INIT file again and boot the machine, but also letting me easily edit the machines code. I found these commands by just looking trough the binary firmware file. It's mostly unreadable binary, but here and there the word definitions show up. So have to judge only on their names alone to figure out what they do. Many commands (such as ioctl and the likes) I stay away from since I might blow up the machine unless I know what they do.\n </p>\n <p>\n  <strong>\n   And THAT segways our way into why I'm posting.\n  </strong>\n </p>\n <hr/>\n <p>\n  There is a whole bunch of stuff \"going on\" in the firmware, and many more definitions of words that I don't know what does, or their parameter requirements on the stack.\n </p>\n <p>\n  I would like some assistance with decompiling this firmware so I can explore the possibilities with the current one, and thus we can develop more advance functions in the INIT file. Possibly we could create/update the firmware and flash it to the machine. Though I'm very skeptical on doing that. The machine is in production, so I'm trying to thread carefully not to brick it.\n </p>\n <p>\n  Is this something that would interest you? Want some example snippets of something? Please get in contact!\n </p>\n <p>\n  Edit: A\n  <a href=\"https://i.sstatic.net/gmobi.jpg\" rel=\"nofollow noreferrer\">\n   snippet of the start\n  </a>\n  of the firmware file\n </p>\n <p>\n  And thank you so much for reading trough my wall of text. Best wishes!\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "507",
    "tags": [
        "decompilation",
        "firmware",
        "stack"
    ],
    "user": "Sasha Carlson",
    "time": "Oct 2, 2022 at 4:32",
    "comments": [
        {
            "user": "Yahya Saffar",
            "text": "<html><body><span class=\"comment-copy\">\n I have Multicam 44 plus and got a problem with the firmware and machine not booting up again since had error uploading big size job file. I am looking for original firmware file and other executables/files that can restore the machine. thanks and best regards Yahya\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Chris Miltiadous",
            "text": "<html><body><span class=\"comment-copy\">\n I've got the same board m23 in a machine in my workshop. Struggling atm to get the correct .init files, even multicam their self no longer have them. Is there any chance you would be willing to send these over? It would save me several thousands in getting a new controller retrofitted to the machine. Thanks again\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  interesting project you've got here and you're giving a good overview - maybe too much (in comparison to most of the other questions here)\n </p>\n <p>\n  i think you need to search for (retired) poeple that got deep or better very deep knowledge about your CNC and the S960/M23 controller stuff, to get (more safe) informations about firmware upgrading etc. - details around your target\nat best: how to store and restore the complete machine state - for the case you damage something in the firmware/config/settings\n </p>\n <p>\n  do you have any idea what technology is behind x86, PowerPC or super-special, due to the age of the system?\n </p>\n <p>\n  are you maybe able to write an emulator that can run the firmware?\nmost microcontrollers or hardware of that time wasn't super complex - to have a clean room for analysis?\n </p>\n <p>\n  did you tried Ghidra, Binwalk on your firmware binary? (could work but its maybe too old)\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "llm",
            "time": "Oct 1, 2022 at 17:58",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Sasha Carlson",
                    "text": "<span class=\"comment-copy\">Thanks for your reply. Will definitely go more in towards analyzing the firmware. I have also sent some emails trying to get into contact with whoever might know more.  I have no idea what processor is running it. I might try and remove the M23 breakout board to see the labels on the processor IC. That should give way more pointers on what architecture is used. Here is a snippet of the start of the firmware file. Maybe this could tell you more? It's very seems organized into 16 byte and 8 byte chunks.  <a href=\"https://imgur.com/a/TyzCAYi\" rel=\"nofollow noreferrer\">imgur.com/a/TyzCAYi</a></span>",
                    "time": null
                },
                {
                    "user": "llm",
                    "text": "<span class=\"comment-copy\">maybe binwalk could help to find the architecture is used: <a href=\"https://embeddedbits.org/reverse-engineering-router-firmware-with-binwalk/\" rel=\"nofollow noreferrer\">embeddedbits.org/…</a>  and can you put up some photos of the controller cards?</span>",
                    "time": null
                },
                {
                    "user": "Sasha Carlson",
                    "text": "<span class=\"comment-copy\">Loads! I'm not used to posting on StackExchange, so a bit unclear on how to post an update. But very short summary: I took apart the motherboard, and found the processor is an Intel i960 (should have guessed, right?). This \"monitor mode\" is actually described a lot around the intel manuals as a prebuilt ROM, and it seems the developers of this uCito language has kept that monitor mode for updating the firmware. I also found the guy that made it: <a href=\"https://www.extratech.com/co-history\" rel=\"nofollow noreferrer\">extratech.com/co-history</a></span>",
                    "time": null
                },
                {
                    "user": "Sasha Carlson",
                    "text": "<span class=\"comment-copy\">The i960 is specifically a 80960SB. It has a PA28F400-BVB80 (BOOT FLASH / EEPROM) that I suspect is used for firmware and the \"file storage\", and a bit of to the side is a UV-erasable EPROM that has a \"home-made\" uCito sticker on it. That EPROM is a M87C257-20FXI that most likely contains the \"handler code\" for firmware. I'm gonna work on dumping it's flash, but might be able to dump it all trough the terminal :)</span>",
                    "time": null
                },
                {
                    "user": "Sasha Carlson",
                    "text": "<span class=\"comment-copy\"><a href=\"https://imgur.com/a/jctOo4v\" rel=\"nofollow noreferrer\">Here</a> are some pictures of the board</span>",
                    "time": null
                }
            ]
        }
    ]
}