{
    "title": "How to Convert given set of Assembly-Level Instructions to High-Level Language Code?",
    "link": "https://reverseengineering.stackexchange.com/questions/30972/how-to-convert-given-set-of-assembly-level-instructions-to-high-level-language-c",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  As I am working on malware analysis, I got stuck in a place where I have to change the given set of assembly-level instructions to high-level code. Example:\n </p>\n <h3>\n  Assembly Level Code\n </h3>\n <pre><code>mov ebp, esp       \n\nand eax,0\n</code></pre>\n <h3>\n  High-Level Code\n </h3>\n <pre><code>r_ebp_1 = r_esp_1 \n\nr_eax_1 = r_eax_1 & 0x0\n</code></pre>\n <p>\n  Though I have searched on the internet, I couldn't get the solution I am searching for. Could someone please help me to find the answer?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 2,
    "views": "304",
    "tags": [
        "decompilation"
    ],
    "user": "okokok hack",
    "time": "Dec 25, 2022 at 9:37",
    "comments": [
        {
            "user": "Rolf Rolles",
            "text": "<html><body><span class=\"comment-copy\">\n Is this homework? If so, presumably your instructor gave you some directions in this regard in the earlier material...?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Mega Tonnage",
            "text": "<html><body><span class=\"comment-copy\">\n One thing to keep in mind is that there likely will not be a 1:1 mapping of assembly to higher level language instructions. You need to understand what the assembly instructions are doing, then write the equivalent HL code. Don't try to translate each line of assembly.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "okokok hack",
            "text": "<html><body><span class=\"comment-copy\">\n Dear @RolfRolles, as I told I'm working on malware analysis, for doing in dept analysis I suppose to do this\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "AKS",
            "text": "<html><body><span class=\"comment-copy\">\n It is just like asking to convert my jet  to a car that too among various kind of cars and without even knowing which kind of car. Please note that to become a satellite one need to left ground, that is the expected path. Going down, you need to be clear on various parameters (read as requirements).\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <h3>\n  Assemble Level Code\n </h3>\n <p>\n  mov ebp, esp\n </p>\n <p>\n  and eax,0\n </p>\n <p>\n  Since the code is incomplete, I would venture to guess that this is part of a function and that the function returns a value in the eax register.\nThus, based on the\n  <em>\n   truth table\n  </em>\n  of the logical operation\n  <code>\n   AND\n  </code>\n  - whatever is in\n  <code>\n   eax\n  </code>\n  - it will be set to zero.\n </p>\n <h3>\n  High-Level Code\n </h3>\n <p>\n  return 0;\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "0xC0000022L",
            "time": "May 1, 2023 at 20:15",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  For the solution of your trivial example, see the answer of @rce.\n </p>\n <p>\n  However, achieving a proper understanding of a more realistc, fairly complex assembler code and convert it into HL-code, you should be sure that your reversing produced not only understandable, but also\n  <strong>\n   correct\n  </strong>\n  HL-code.\n </p>\n <p>\n  \"Correct\" means here that the original assembler code and the HL-code produce the same results, which you can verify e.g. by letting them run in two instances of IdaPro, each with the debugger running, and comparing after each significant step for correctness.\n </p>\n <p>\n  You could proceed like so:\n </p>\n <ol>\n  <li>\n   <p>\n    Convert the assembler code in \"Assembler-like\" C code, just as you did it in your question.\n   </p>\n  </li>\n  <li>\n   <p>\n    Simplify it. Try to get rid of constructs specific for the assembler version and convert it into a more \"C\" natural form. This is what @rce did in his answer.\n   </p>\n  </li>\n  <li>\n   <p>\n    Try to understand the logic behind the constructs. Change the \"register-like\" variable names to \"speaking\" names connected to the logical meaning of the code. This is not possible from your example as you only provide two(!) lines of assembly code.\n   </p>\n  </li>\n  <li>\n   <p>\n    Re-write the whole thing step-by-step in logical terms only.\n   </p>\n  </li>\n  <li>\n   <p>\n    Always compare whether the output is correct. Even if steps 1 to 4 could be realized differently, this step is indispensible.\n   </p>\n  </li>\n </ol>\n <p>\n  As this seems tedious, for more complex algorithms (which cannot be recognized by other means like the use of known \"magic numbers\"), this can be a successful strategy for a proper reverse engineering of non-trivial assembler code. It can become difficult, e.g. if you have \"\n  <a href=\"https://reverseengineering.stackexchange.com/questions/2221/what-is-a-control-flow-flattening-obfuscation-technique\">\n   flattened\n  </a>\n  \" code or algorithms which contain vectorized code realized with intrinsics.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "josh",
            "time": "Dec 23, 2022 at 12:50",
            "is_accepted": false,
            "comments": []
        }
    ]
}