{
    "title": "Patched Mac application throws \"Invalid value of (null) for entitlement\" when running it",
    "link": "https://reverseengineering.stackexchange.com/questions/30973/patched-mac-application-throws-invalid-value-of-null-for-entitlement-when-ru",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have patched a specific application that I downloaded from the app store but when I ran the executable, it gave me a signal kill 9. I also reverted back the change I made, but the same error was thrown when I ran it. I figured it might be a code signing issue and removed it with optool but then I got this error:\n </p>\n <pre><code>[CK] Invalid value of \"(null)\" for entitlement \"com.apple.application-identifier\" or \"com.apple.developer.associated-application-identifier\" on process \"(57039)\". We expect TEAMID.BUNDLEID, and insist that TEAMID is exactly 10 characters long, consisting of [0-9][A-Z]. This is a permanent issue, and access to CloudKit will be denied until this is resolved.\n</code></pre>\n <p>\n  I'm not sure if I'm on the right track but in case I am, how can I codesign the binary with its original bundle identified after patching the binary?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "88",
    "tags": [
        "patching",
        "mach-o",
        "macos"
    ],
    "user": "Raeein Bagheri",
    "time": "Oct 9, 2022 at 4:27",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n MacOS and iOS use a cache for saving the signature validation result. If you just modify or move the file the cache is not updated. Make sure to really copy the file, delete the old one and the rename the copied file to the old file name. Then the cache will recognize it as new and re-perform the signature validation.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}