{
    "title": "Reverse engineering engine room simulator license management (x32dbg)",
    "link": "https://reverseengineering.stackexchange.com/questions/31166/reverse-engineering-engine-room-simulator-license-management-x32dbg",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  folks, I'm marine engineer and recently got in touch with simulator software with my professor at the Simulator Department of my university. Today I thought we could dump the original installation and copy to the class computer so we can teach it without the needs of going to the department which is a bit far from here.\n </p>\n <p>\n  Said that, we have made a copy to my computer and we are currently trying to skip license checks using x32dbg.\n </p>\n <p>\n  My first attempt was disable the network license check and so far it has worked, this is the piece of Assembly code from x32dbg:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/i4WlU.png\" rel=\"nofollow noreferrer\">\n   <img alt=\".\" src=\"https://i.sstatic.net/i4WlU.png\"/>\n  </a>\n </p>\n <p>\n  By changing the jump condition to jump if equal I managed to bypass it and now it goes directly to the Hardware License Check.\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/vBpkd.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\".\" src=\"https://i.sstatic.net/vBpkd.jpg\"/>\n  </a>\n </p>\n <p>\n  Then the next idea I had was to set the code: 83F8\n  <strong>\n   01 75\n  </strong>\n  23 >>>> 83F8\n  <strong>\n   00 74\n  </strong>\n  23 to skip the illegal license error but it unfortunately didn't work, I tried on the old version and this seems to be enough so I don't know where to look after.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 0,
    "views": "101",
    "tags": [
        "patch-reversing"
    ],
    "user": "Vryashi Hyashi",
    "time": "Nov 22, 2022 at 18:26",
    "comments": [
        {
            "user": "Mega Tonnage",
            "text": "<html><body><span class=\"comment-copy\">\n RE is about understanding what the code is doing, and there are many good books and courses available to help you learn about assembly and binary analysis. If your goal is simply to use software for free, you could probably find cracked software on the Internet without much effort.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}