{
    "title": "debug stripped file",
    "link": "https://reverseengineering.stackexchange.com/questions/31203/debug-stripped-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've system embedded mips big endian with gdb-server and I want debug stripped file of the target, I can run in target gdb server with stripped file (--attach PID), but when I try to connect with gdb-multiarch I can't debug the file, I get\n  <code>\n   (gdb) target remote 192.168.1.13:1235 Remote debugging using 192.168.1.13:1235 warning: No executable has been specified and target does not support determining executable automatically.  Try using the \"file\" command. 0xd452ae2a in ?? ()\n  </code>\n </p>\n <p>\n  if I try to use file command I can set only stripped file and then I get\n  <code>\n   (gdb) file XXX A program is being debugged already. Are you sure you want to change the file? (y or n) y \"XXX\": not in executable format: file truncated (gdb) info file Remote serial target in gdb-specific protocol: Debugging a target over a serial line. (gdb)\n  </code>\n </p>\n <p>\n  maybe I am wronging something in the environment, my situation is this, I've embedded system mips and I want to reverse stripped file launched in the device.\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 0,
    "views": "133",
    "tags": [
        "assembly",
        "firmware",
        "gdb",
        "mips",
        "debug"
    ],
    "user": "timb55",
    "time": "Dec 1, 2022 at 13:36",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Hi and welcome to RE.SE. It's unclear what you are doing on the client and server side and how the respective GDB instances were built. It sounds as if your (client) side wants a file corresponding to whatever the remote (server) side is attached to. If that's a process, then apparently the remote doesn't have\n <code>\n  /proc/self/exe\n </code>\n to determine what it's running from. But all in all you don't give enough information.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "timb55",
            "text": "<html><body><span class=\"comment-copy\">\n I m running gdb-server obvisly in server side with stripped file and then I try to debug with gdb-multiarch in client, but I'vent unstripped file in client but I use same file of server, obvisuly I ve to do reverse, I think could be something about ptrace, but I don't know\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n And have you tried to confirm on the second prompt? ... or checked whether\n <code>\n  file\n </code>\n somehow allows you to sneak in a file without having to restart the debuggee?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}