{
    "title": "Reverse Engineering CTF help",
    "link": "https://reverseengineering.stackexchange.com/questions/31397/reverse-engineering-ctf-help",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am having trouble figuring out this microcorruption challenge in the link below:\n  <a href=\"https://microcorruption.com/debugger/Halifax\" rel=\"nofollow noreferrer\">\n   https://microcorruption.com/debugger/Halifax\n  </a>\n </p>\n <p>\n  Basically, the 0x7f interrupt has been disabled so I must reenable it before inserting a payload that will call it. The program says I need to call the 0x41 interrupt with the 16byte key that is stored in secure memory, which I seemingly don't have access to.\n </p>\n <p>\n  My main issue is that when I call the 0x41 interrupt, I am not sure which argument I need to supply the pointer to the password into. The second issue is, since I'm not sure I'm supplying the password into the correct argument, I am also unsure I have found the password at all.\n </p>\n <p>\n  <strong>\n   Things I know:\n  </strong>\n  The sha256_internal calls the 0x41 interrupt as well, so I have tried to emulate this with my payloads. When I insert 0x1000 as the second argument (into r14 when using sha256_internal) it gives me the encryption that the program printed out to the screen. When I change that number, the encryption changes. Each time I reset the CPU, all of these encryptions change (except for when I insert 0x0, in which case the sha256 encryption of an empty string is outputted). The max number I can put in is 0x1000, into this argument, as well as into the third argument, and if I exceed 0x1000 then the \"Exceeded SRAM length\" exception is thrown.\n </p>\n <p>\n  <strong>\n   Things I have tried:\n  </strong>\n </p>\n <p>\n  -forcing the pc to restart all the instructions from the initialization of the program, but after having overwritten the instructions for disabling the interrupt. This didn't work since apparently after the interrupt is disabled, it can only be reenabled by using the 0x41 interrupt with the password.\n </p>\n <p>\n  -I have tried to insert the parts of the internal SRAM hash they keep printing to the screen, its 32bytes and the password is only 16bytes, but unsurprisingly this hasn't worked since its just a hash of the password which doesn't seem to be very useful.\n </p>\n <p>\n  <strong>\n   An example payload I inserted:\n  </strong>\n </p>\n <pre><code>800060301210473012e043301200103012000030124100b0125045301244453041\n</code></pre>\n <p>\n  <code>\n   8000\n  </code>\n  refers to where the payload will be written to to be run later\n </p>\n <p>\n  <code>\n   60\n  </code>\n  refers to the length of the payload (I made a large length so I wouldn't have to set it every time)\n </p>\n <p>\n  <code>\n   301210473012e043301200103012000030124100\n  </code>\n  is for pushing all the arguments of the interrupt onto the stack. Here I tried putting the password address as a 5th argument instead\n </p>\n <p>\n  <code>\n   b0125045\n  </code>\n  is for calling the INT function to carry out the interrupt\n </p>\n <p>\n  <code>\n   30124445\n  </code>\n  is to push the address I want to go back to after my payload is about to finish\n </p>\n <p>\n  <code>\n   3041\n  </code>\n  return to the address I just pushed so the program can receive another payload\n </p>\n <p>\n  My biggest problem is that I am unsure if I am inserting the password tries into the right argument, so even if I have found the password, I am not sure it is being entered. I keep putting in a pointer to it as the third argument (into r15 in sh256_internal), but it seems wrong since this argument also has a length limit of 0x1000.\n </p>\n <p>\n  Any suggestions, hints, new things to try would be much appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 4,
    "views": "575",
    "tags": [
        "assembly",
        "memory",
        "encryption"
    ],
    "user": "PurpleHacker",
    "time": "Jan 13, 2023 at 20:41",
    "comments": [
        {
            "user": "pipik",
            "text": "<html><body><span class=\"comment-copy\">\n Where is the definition of INT 0x33 or other interrupt, I only find this manual:\n <a href=\"https://microcorruption.com/public/manual.pdf\" rel=\"nofollow noreferrer\">\n  microcorruption.com/public/manual.pdf\n </a>\n ,but it doesn't have... I'm stuck in Cold Lake\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Im also stuck. It is a bit weird that, according the the manual, INT 0x41 is to be used to unlock, but in the code it is used to produce a hash of the SRAM... This is what I've tried so far:\n </p>\n <h2>\n  Other interrupts\n </h2>\n <p>\n  Maybe there is an undocumented interrupt that would reverse the hardening mode? I couldn't find anything a part from 0x31 which seems to be identical to 0x41, but produces a hash of our working memory instead of the non-addressable SRAM. Can't see how this will help us..\n </p>\n <h2>\n  Dissecting the SRAM\n </h2>\n <p>\n  When calling the\n  <code>\n   sha256_internal\n  </code>\n  function, r14 is the length of the data you want to hash and r15 is the offset from start of SRAM. I figured out, by calculating the hash of long sequences of zeroes and comparing that to the output of the sha256_internal, that almost the entire SRAM is filled with zeroes. It seems that there's only non-zero data in the first ~0x100 bytes. I tried to find 16 byte sequences within these 0x100 bytes that didn't differ between tries. If I found any static 16 byte sequence, that must be the key! But no luck...\n </p>\n <h2>\n  Watchdog\n </h2>\n <p>\n  Just at the start of the program, there's a function named\n  <code>\n   __watchdog_support\n  </code>\n  . The program also writes 0x5a08 to 0x15c. The value 0x5a08 seems to be connected to the watchdog control register according to the  user manual. I tried to fiddle around with this, but I don't think the watchdog is implemented. At least I didn't get anywhere..\n </p>\n <p>\n  As there's no information about how to unlock via the 0x41 Interrupt, I'm inclined to think that solving this is done by somehow reversing the hardening process and then issuing the 07f interrupt...\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Gruffalon",
            "time": "Apr 6, 2023 at 20:35",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  To add to your interrupt discussion, you can also do a sha1 hash with 0x30 or a sha512 hash with 0x32.  Not sure how that would help, but maybe there are more interrupts out there?\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "jowler",
            "time": "Apr 9, 2023 at 13:25",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've managed to complete the other challenges but I'm also stalled on Halifax.\n </p>\n <p>\n  The other interrupts appear to be a dead end. All the interrupts used in St. John are available (sha1, sha256, sha512), but they only hash userspace memory. Maybe they need to be used to hash some data for the final solution once its pulled from SRAM, but none of those functions produce 16 byte outputs so no obvious hints.\n </p>\n <p>\n  Watchdog appears not to be implemented. If it was, you could potentially trigger a watchdog interrupt with an infinite loop, and overwrite the interrupt vector (in memory at\n  <code>\n   ff80\n  </code>\n  ) to execute a handler. Tried it, but it does not work, and I'm not sure it would help if it did.\n </p>\n <p>\n  Dissecting the SRAM may be a dead end. In brief, using\n  <code>\n   0x41\n  </code>\n  interrupts we can get sha256 hashes of sections of the SRAM and we can use those hashes to create a dump.  Happy to give more detail if anyone needs a few hints to make that work.\n </p>\n <p>\n  But here's where I'm stalled, since the SRAM is different on each reset. It's mostly 0's, but always starts with a section of apparently random data which is always one of two exact byte lengths. The non-zero byte lengths are strange values, that don't match any standard key or hash lengths.\n </p>\n <p>\n  So no obvious keys in SRAM, and even if there was one, I don't see a clear way to get a non static key value from SRAM into userspace without a live memory dump (so couldnt do it in the solver). Also,  I don't see a way to call the\n  <code>\n   0x41\n  </code>\n  interrupt to accept a key as input.\n </p>\n <p>\n  Has anyone solved Halifax yet? The progress page is broken for the newer challenges. For me, it shows that I've solved Halifax already, but not Cold Lake, but it's actually the other way around.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Viktor",
            "time": "May 20, 2023 at 20:48",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There is an unfortunate typo in the challenge. You provide the key through the 0x42 interrupt, not the 0x41 interrupt.\n </p>\n <p>\n  The 16-byte key is actually stored in SRAM. It is not the hash.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "John Doe",
            "time": "Sep 4, 2023 at 19:59",
            "is_accepted": false,
            "comments": []
        }
    ]
}