{
    "title": "Analyzing the difference from 2 execution flows",
    "link": "https://reverseengineering.stackexchange.com/questions/31423/analyzing-the-difference-from-2-execution-flows",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm a beginner in the reversing field, so apologize if the question is too dumb.\n </p>\n <p>\n  When analyzing binaries I always had this idea of saving somehow an execution flow so I can compare with other saved flow and get the exact points where they differ so I can start analyzing from that point.\n </p>\n <p>\n  Having a tool capable of doing that would be awesome. I can think of a lot of stuff I could do with this that with my current skill level is simply not feasible.\n </p>\n <p>\n  Is there a tool that already does that?\n </p>\n <p>\n  If not, how could I create such a tool?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "61",
    "tags": [
        "bin-diffing"
    ],
    "user": "underthevoid",
    "time": "Jan 17, 2023 at 12:52",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Yes, there a marvelous tool available for your needs. Moreover it's free and open source (however earlier it was a commercial product - thanks to Google)\n </p>\n <p>\n  Also please do check their another product BinDiff for comparison/difference in code execution.\n </p>\n <p>\n  <a href=\"https://www.zynamics.com/binnavi.html\" rel=\"nofollow noreferrer\">\n   Link to software: Zynamics - Bin Navi\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Viktor",
            "time": "Jan 17, 2023 at 14:28",
            "is_accepted": true,
            "comments": [
                {
                    "user": "underthevoid",
                    "text": "<span class=\"comment-copy\">checking it rn. Thanks for the information!</span>",
                    "time": null
                },
                {
                    "user": "underthevoid",
                    "text": "<span class=\"comment-copy\">hey friend I'm having a really hard time installing BinNavi. Do you know of any alternative or any place where I can find a tutorial on installing the app?</span>",
                    "time": null
                },
                {
                    "user": "Viktor",
                    "text": "<span class=\"comment-copy\">@underthevoid Hi, I understand it can be quite complex to build and install BinNavi from source code. However when it was a commercial product it was easy to install and as it was packaged in a installer. It's better to search for the older commercial release to get work done. I think you understood what I mean.</span>",
                    "time": null
                }
            ]
        }
    ]
}