{
    "title": "decompile, build apk without mdify code have error like app crashed and icon changed",
    "link": "https://reverseengineering.stackexchange.com/questions/31452/decompile-build-apk-without-mdify-code-have-error-like-app-crashed-and-icon-cha",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I want to try modifying the apk and when I try to build then install there is no problem, but when I check the icon on the apk changes like the default Android icon and the app crashes. Likewise when I try when decompile, build, sign and install without modifying the contents.\n </p>\n <p>\n  the tools I use are apktool.\n </p>\n <p>\n  Trying to use JADX but error when decompile\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/WgCX3.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/WgCX3.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "114",
    "tags": [
        "decompile"
    ],
    "user": "Aminudin",
    "time": "Jan 21, 2023 at 15:02",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Please do no post text as screenshot. You forgot to mention how you decompiled and modified the APK - please include the commands for decompiling, recompiling, signing and so on. When an app crashed it usually prints errors on\n <code>\n  adb logcat\n </code>\n look at it to understand what is going wrong. Also check the code for code that checks the app signature and integrity. May be the crash is performed intentionally because the signature is wrong? Jadx decompile errors are common, that is nothing unusual some byte code is extremely difficult to recompile to Java language.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Joshua Terrill",
            "text": "<html><body><span class=\"comment-copy\">\n I don't think you're going to have much luck decompiling an APK and being able to install it from the decompiled code. As listed on the jadx Github page \" Please note that in most cases jadx can't decompile all 100% of the code, so errors will occur\"\n <a href=\"https://github.com/skylot/jadx\" rel=\"nofollow noreferrer\">\n  github.com/skylot/jadx\n </a>\n you could check their troubleshooting guide for specific issues, but I wouldn't get your hopes up too much.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}