{
    "title": "Can ESP point to a global variable",
    "link": "https://reverseengineering.stackexchange.com/questions/31467/can-esp-point-to-a-global-variable",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This 3 lines of code are used by some encoders to get EIP into ECX register:\n </p>\n <pre><code>fldz\nfnstenv [esp-C]\npop ecx\n</code></pre>\n <p>\n  The 2 first instructions push some datas on stack and we get one of this into ECX on the last line.\n </p>\n <p>\n  I have tried this code in a very basic poc. It works fine.\n </p>\n <p>\n  But in real life (in a Buffer overflow application), ecx contains 0x0000000 and I do not understand why.\n </p>\n <p>\n  The only thing I know is ESP value has been changed, but points in the middle of a big buffer.\n </p>\n <p>\n  Are there some rules on ESP ? Can ESP points anywhere (on an allocated memory region of course) ?\n </p>\n <p>\n  For example if I create a global variable in my program: unsigned char buf[1024]. Can I set ESP to buf+512 and call PUSH, fldz or fnstenv instructions ?\n </p>\n <p>\n  Thanks\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "58",
    "tags": [
        "x86",
        "stack",
        "shellcode"
    ],
    "user": "Bob5421",
    "time": "Jan 24, 2023 at 21:47",
    "comments": [
        {
            "user": "peter ferrie",
            "text": "<html><body><span class=\"comment-copy\">\n You might require fninit before the fldz, to initialise the FPU state explicitly.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <strong>\n   ESP always points to the top of stack.\n  </strong>\n  Do you really understand stack concept? If you overwrite esp with random value, the application can crash.\n </p>\n <p>\n  <strong>\n   fldz\n  </strong>\n  - Push +0.0 onto the\n  <strong>\n   FPU\n  </strong>\n  stack.\n  <strong>\n   fnstenv\n  </strong>\n  - Store\n  <strong>\n   FPU\n  </strong>\n  environment in the area which is placed on memory in your case.\n  <strong>\n   [esp-C]\n  </strong>\n  - this is memory pointer.\n  <strong>\n   pop ecx\n  </strong>\n  - just pop dword from the top of stack to the ecx\n </p>\n <p>\n  What do you want to do with this code? Describe your task.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "strannyi",
            "time": "Jan 25, 2023 at 1:56",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Bob5421",
                    "text": "<span class=\"comment-copy\">I know what is stack and how it works. The os creates a memory space for the stack. My question is will it work if i put an esp value that points on another memory space. I am not talking about a random memory space. I am talking about a buffer i control. I want to know if the cpu will detect this is not the memory space dedicated for stack</span>",
                    "time": null
                },
                {
                    "user": "strannyi",
                    "text": "<span class=\"comment-copy\">You can change ESP, but after that pop/return instruction will work incorrect and call/push will store ret_addr/value outside the stack, because you change stack pointer(a location where data was stored). You can use ESP as general purpose register.</span>",
                    "time": null
                }
            ]
        }
    ]
}