{
    "title": "If i disable a few CPU cores on my laptop how exactly does it work?",
    "link": "https://reverseengineering.stackexchange.com/questions/31493/if-i-disable-a-few-cpu-cores-on-my-laptop-how-exactly-does-it-work",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a 1280P Intel processor and I am running Ubuntu, i notice that i have a little to much power for my everyday task and have been debating on disabling a few CPU cores/threads to see if it will conserve more battery life.\n </p>\n <p>\n  My true question is, lets say I disable 4 cores, and there are 10 left, does it simultaneously use 10 (randomly) out of the 14 throughout each process or does it block off the 4 and basically wear down the other cores available?\n </p>\n <p>\n  I hope this makes since.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "677",
    "tags": [
        "intel"
    ],
    "user": "StacyVlanglydu",
    "time": "Feb 3, 2023 at 15:07",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Disabling CPU cores on your laptop will cause the operating system to only utilize the remaining active cores for processing tasks. The operating system will schedule tasks across the available active cores, and distribute the workload as evenly as possible to ensure efficient utilization of resources.\n </p>\n <p>\n  Assuming you disable 4 cores, the operating system will only utilize the remaining 10 cores for processing tasks. The operating system will not block off the disabled cores nor wear down the other cores. Although, disabling cores may affect performance as the operating system will have fewer resources to work with.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "r0xdeadbeef",
            "time": "Feb 5, 2023 at 3:47",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  First, cores are not mechanical, they won't wear out as such.  And they still use many of the same resources as other cores, inside the CPU.\n </p>\n <p>\n  If you a utility such as\n  <a href=\"https://www.coderbag.com/programming-c/disable-cpu-core-parking-utility\" rel=\"nofollow noreferrer\">\n   Disable CPU Core Park Utility\n  </a>\n  , it will allow you to specify the core by number.  Note, I am not associated with it, nor have I used it.\n </p>\n <p>\n  And it looks like it's a common thing to do to save power according to this\n  <a href=\"https://ccm.net/computing/hardware/1859-multicore-cpu-how-to-disable-a-core/\" rel=\"nofollow noreferrer\">\n   article at ccm\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Rohit Gupta",
            "time": "Feb 11, 2023 at 0:29",
            "is_accepted": false,
            "comments": []
        }
    ]
}