{
    "title": "Decrypt the cookies stored by the MS Teams desktop client",
    "link": "https://reverseengineering.stackexchange.com/questions/31593/decrypt-the-cookies-stored-by-the-ms-teams-desktop-client",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am creating a digital forensic tool that gets all data of user from different platforms. I successfully have done extraction for Teams website but I am unable to do so for the desktop app. So far, I know that the cookies are stored in Local/Microsoft/Teams folder. The file has no extension although it is an SQLite3 database. It shows all the cookies but these are in encrypted form. Is there any way I can get the actual decrypted cookies?\n </p>\n <blockquote>\n  <ol>\n   <li>\n    If the server encrypts cookies, it does not mean that the client is able to decrypt them. The client must just send back all the cookies to\nthe server.\n   </li>\n  </ol>\n </blockquote>\n <p>\n  The server is not encrypting instead the client desktop app is. The Microsoft API use plain cookies. And I can not use the encrypted ones in browser as that will not start session.\n </p>\n <blockquote>\n  <ol>\n   <li>\n    <p>\n     Why do you think they are encrypted in the first place instead of just being some identifier into a backend database with the actual\ndata?\n    </p>\n   </li>\n   <li>\n    <p>\n     What makes you think that the client (and thus your tool) would have access to the key to decrypt the data - wouldn't this defeat the\npurpose of encryption in the first place?\n    </p>\n   </li>\n  </ol>\n </blockquote>\n <p>\n  I think they are encrypted because they are under the column \"encrypted value\".\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/VnQOy.png\" rel=\"noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/VnQOy.png\"/>\n  </a>\n </p>\n <p>\n  I have found a library that decrypts cookies stored by chrome and other browsers. I think we can decrypt the MS Teams cookies if we have the keys for it using the following code\n </p>\n <pre><code>import browser_cookie3\n\nc = browser_cookie3.chrome(cookie_file=r\"C:\\Users\\Farhan Ahmed\\AppData\\Local\\Packages\\MicrosoftTeams_8wekyb3d8bbwe\\LocalCache\\Microsoft\\MSTeams\\EBWebView\\Default\\Network\\Cookies\",\n                            key_file=\"Key file\")\n\nfor cookie in c:\n    print(cookie.name, end=\" \")\n    print(cookie.value)\n</code></pre>\n <p>\n  The code does not work for now and give some errors. I am checking why that is happening.\n </p>\n <p>\n  I will appreciate if someone shares a better way of doing it.\n </p>\n</div>\n</body></html>",
    "votes": "6",
    "answers": 1,
    "views": "576",
    "tags": [
        "encryption"
    ],
    "user": "farhan jatt",
    "time": "Feb 25, 2023 at 5:38",
    "comments": [
        {
            "user": "Steffen Ullrich",
            "text": "<html><body><span class=\"comment-copy\">\n 1. Why do you think they are encrypted in the first place instead of just being some identifier into a backend database with the actual data? 2. What makes you think that the client (and thus your tool) would have access to the key to decrypt the data - wouldn't this defeat the purpose of encryption in the first place?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "vidarlo",
            "text": "<html><body><span class=\"comment-copy\">\n Electron has the safeStorage function for such things. I'd look into what Edge webview2 provides.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "mentallurg",
            "text": "<html><body><span class=\"comment-copy\">\n If the server encrypts cookies, it does not mean that the client is able to decrypt them.The client must just send back all the cookies to the server.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "farhan jatt",
            "text": "<html><body><span class=\"comment-copy\">\n @SteffenUllrich I think I have access to browser cookies so why not the App session cookies stored in disk. The root should have access to his cookies when he wants.  I think they are encrypted because they under the column encrypted value. I am new to cyber security and recently started my degree, so I do not have enough knowledge\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "farhan jatt",
            "text": "<html><body><span class=\"comment-copy\">\n @mentallurg The server is not encrypting instead the client desktop app is. The microsoft api use plain cookies. And I can not use the encrypted ones in browser as that will not start session. Still I will try once to confirm\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Just so you know, I think this has already been done -\n  <a href=\"https://github.com/sleuthkit/autopsy_addon_modules/tree/master/IngestModules/Microsoft_Teams_Parser\" rel=\"nofollow noreferrer\">\n   https://github.com/sleuthkit/autopsy_addon_modules/tree/master/IngestModules/Microsoft_Teams_Parser\n  </a>\n </p>\n <p>\n  You could just browse the code at\n  <a href=\"https://github.com/lxndrblz/forensicsim/\" rel=\"nofollow noreferrer\">\n   https://github.com/lxndrblz/forensicsim/\n  </a>\n  to get an understanding of how the Teams data is stored.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Mega Tonnage",
            "time": "Mar 1, 2023 at 8:59",
            "is_accepted": false,
            "comments": [
                {
                    "user": "farhan jatt",
                    "text": "<span class=\"comment-copy\">I have checked it, It gets data for forensic but according to it the cookies are not encrypted but they are. This also helps a lot but if I can get cookies that will be great</span>",
                    "time": null
                },
                {
                    "user": "farhan jatt",
                    "text": "<span class=\"comment-copy\">Awarded you the bounty, because I got my work done with this tool. Although I would still prefer cookies. Thanks for your help</span>",
                    "time": null
                }
            ]
        }
    ]
}