{
    "title": "In IDA freeware, how to create a new database in IDC and load a file into it?",
    "link": "https://reverseengineering.stackexchange.com/questions/31645/in-ida-freeware-how-to-create-a-new-database-in-idc-and-load-a-file-into-it",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have IDA freeware version 5 and version 8, v5 is running on wine, v8 is directly on kali OS, and I am trying to create an IDC script to generate asm+lst files for all files in a certain folder.\n </p>\n <p>\n  What I have so far is a script that gets a list of files from an input folder and saves the list into a file, then I read the file line by line for each input file I want to process. My problem comes here, It seems I can't use\n  <code>\n   loadfile()\n  </code>\n  when I do not have a database opened, ready to receive the file, and when I try to load the file with a database opened and a loaded file I don't get any result back!\n </p>\n <ul>\n  <li>\n   Is there a way to create an empty database via IDC script (free version)?\n  </li>\n  <li>\n   Is it even possible to process a large number of files in a folder programmatically one by one without using command line switches, as it seems I can't get IDA freeware to recognize any of the switches I use in the Kali terminal?\n  </li>\n  <li>\n   I am not even sure that I am using the correct arguments for the loadfile() function, if I want to load the whole file, what should I fill in as the pos parameter? 0?\n  </li>\n  <li>\n   And for the size how do I get file size from within IDC script?\n  </li>\n </ul>\n <p>\n  Any answer to those questions would help greatly.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 0,
    "views": "222",
    "tags": [
        "ida",
        "malware",
        "disassemblers",
        "firmware-analysis",
        "idc"
    ],
    "user": "IDAIDCMalAnalysis",
    "time": "Apr 24, 2023 at 18:07",
    "comments": [],
    "answers_data": []
}