{
    "title": "Finding older IDA files",
    "link": "https://reverseengineering.stackexchange.com/questions/31733/finding-older-ida-files",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am following the Begin RE tutorial\n  <a href=\"https://www.begin.re/assignment-3\" rel=\"nofollow noreferrer\">\n   here\n  </a>\n  but I am stuck towards the end, where I load a file into IDA. I am using IDA Free 8.2 on Windows 11 x64.\n </p>\n <p>\n  On the graph view it is only showing the main function, which is different to the screenshot in the tutorial. Also, I get the below errors about signature files:\n </p>\n <blockquote>\n  <p>\n   Could not find signature file 'vc32_14'\n  </p>\n  <p>\n   Could not find signature file 'vc32ucrt'\n  </p>\n </blockquote>\n <p>\n  Unless I am mistaken, I think it is because I need to use an older version of IDA which includes those signature files, or I need to find the signature files and put them into\n  <code>\n   C:\\Program Files\\IDA Freeware 8.2\\sig\\pc\n  </code>\n  where they are currently missing.\n </p>\n <p>\n  A) Where can I download IDA Free version 7.2 because the Hex-Rays website is only showing the newer version 8.2\n </p>\n <p>\n  B) Additionally, is there a place where I could download missing signature files\n </p>\n <p>\n  <strong>\n   Edit:\n  </strong>\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/WGWAY.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"First signature error\" src=\"https://i.sstatic.net/WGWAY.png\"/>\n  </a>\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/aHQRa.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"Second signature error\" src=\"https://i.sstatic.net/aHQRa.png\"/>\n  </a>\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/Q2MfW.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"Loaded\" src=\"https://i.sstatic.net/Q2MfW.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 0,
    "views": "1k",
    "tags": [
        "ida",
        "x86",
        "executable",
        "exe",
        "flirt-signatures"
    ],
    "user": "securityauditor",
    "time": "Apr 4, 2023 at 14:23",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Please show us a screen shot of your IDA, then we will understand what is different. The default file layout of IDA looks different, you can try to enter the \"block flow mode\" (or what ever it is called) by pressing space. The error message may simply indicator that IDA Free does not contain FLIRT signature files.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "securityauditor",
            "text": "<html><body><span class=\"comment-copy\">\n @Robert Please see the update. My first priority is to resolve the signature errors, it appears older versions of IDA include those missing signatures but I cannot find a download anywhere. Next, is why it took me to a single block, whereas the tutorial shows several blocks joined together.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Even paying customers don't have access to older IDA versions. HexRays always only provides the latest version of their software products. If you want older versions you have to download them when they are available and keep them. So the only way to get an older version of IDA Free is to check non-official servers and search for older versions.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n The screen shot of the tutorial is low res so it is not visible which function (or better which address) it displays.Event the text does not mention the address of the shown function. You simply have selected a different function that does not make use of conditional branch ops (\n <code>\n  if ...\n </code>\n in C code) . Select different functions of the executable and try to find the one that has a similar graphical layout.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Seems like the tutorial is simply not that exact, it also mentions that you should see\n <b>\n  see something like this\n </b>\n . You simply have to select the correct function. Most likely the function you search is at address\n <code>\n  0x00401159\n </code>\n . Press\n <code>\n  g\n </code>\n and then enter\n <code>\n  401159\n </code>\n to go to this function.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}