{
    "title": "API Breakpoints not hitting while debugging a malware using x32dbg",
    "link": "https://reverseengineering.stackexchange.com/questions/31759/api-breakpoints-not-hitting-while-debugging-a-malware-using-x32dbg",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have been having a really strange issue which I have tried all ways to troubleshoot from my end but was not successful.\n </p>\n <p>\n  I am going through a malware analysis course and following the debugging process of the trainer in the video, when I am trying to debug the same malware on my system, I am not able to hit the same break points as him.\n </p>\n <p>\n  I am using x32Dbg for debugging.\n </p>\n <p>\n  The following are some examples of the issue -\n </p>\n <blockquote>\n  <ul>\n   <li>\n    The API CreateProcessInternalW hits for him but never hits for me in any malware sample.\n   </li>\n   <li>\n    The API WriteProcessMemory hits for him but never hits for me in any malware sample.\n   </li>\n   <li>\n    On stepping over VirtualAlloc breakpoint, for him the API is VirtualAllocEx and for me its NtAllocateVirtualMemory\n   </li>\n   <li>\n    On stepping over VirtualProtect breakpoint, for him the API is VirtualProtectEx and for me its zwprotectvirtualmemory\n   </li>\n  </ul>\n </blockquote>\n <p>\n  The following are the things I have tried -\n </p>\n <blockquote>\n  <ul>\n   <li>\n    I have made sure that the tutor and me are running the same operating system (Windows 10)\n   </li>\n   <li>\n    I have tried to use both 64bit and 32bit versions of Windows 10\n   </li>\n   <li>\n    I have made sure I have the same malware sample as the malware samples are provided by the tutor himself and also I have verified the hash of the malware.\n   </li>\n   <li>\n    I have made sure the difference is not being caused by a Anti-Analysis mechanism of the malware\n   </li>\n   <li>\n    I have verified the above point by analysing the malware behaviour and found that the malware is being executed the same way as it is for him\n   </li>\n   <li>\n    Like for one case for a malware, for the tutor the malware was using the CreateProcessInternalW API to call cmd.exe and drop a file in a directory, for me the API doesn't hit but the file is still dropped.\n   </li>\n  </ul>\n </blockquote>\n <p>\n  I am not sure what is causing this difference of API calls and trying to fix this issue.\n </p>\n <p>\n  Help would be appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 0,
    "views": "123",
    "tags": [
        "debugging",
        "malware",
        "winapi",
        "kernel-mode"
    ],
    "user": "Daksh Kapur",
    "time": "Apr 7, 2023 at 22:09",
    "comments": [
        {
            "user": "fpmurphy",
            "text": "<html><body><span class=\"comment-copy\">\n Is the trainer in the video using the same version of the debugger?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}