{
    "title": "BIOS serial number and UUID tampering",
    "link": "https://reverseengineering.stackexchange.com/questions/31782/bios-serial-number-and-uuid-tampering",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  what happens if I tampered the serial number in the bios of a laptop? This laptop was issued to us by our company and what happened was we were laid out without any compensation for what happened so I decided to keep this laptop however after installing windows OS it was frozen because it was reported as stolen or lost, Is there a way to bypass this? I successfully made a reset in the BIOS admin password and now this is my current problem. By the way the handset was HP elitebook 840 g8\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 0,
    "views": "270",
    "tags": [
        "bios"
    ],
    "user": "pao",
    "time": "Apr 15, 2023 at 2:41",
    "comments": [
        {
            "user": "secfren",
            "text": "<html><body><span class=\"comment-copy\">\n Try it? If you managed to install Windows, at which point did it freeze? Did you connect it to the network? Maybe use it for Linux ...\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "pao",
            "text": "<html><body><span class=\"comment-copy\">\n it works fine with ubuntu, but for windows it won't stop in freezing everytime i reinstall a clean copy of windows. I also found out that it was equipped with absolute computrace persistence and several sources mentioned that once the computrace is enabled it can't be disable even with reflashing. however i'll still try to change the serial number as I generated several serial numbers from the orig serial number.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "pao",
            "text": "<html><body><span class=\"comment-copy\">\n I am also thinking about blocking the IP addresses of Absolute's servers to prevent it from communicating with the computer. Any ideas regarding this issue would be a great help.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "secfren",
            "text": "<html><body><span class=\"comment-copy\">\n At which point during install does it freeze? Early or later on when the network is accessed? And what does freeze mean? Error message, bluescreen, ...? You could block access to the servers with a firewall or check with something like Wireshark what connections are made during the setup. You could also try to edit the BIOS with something like UEFITool and remove computrace.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "pao",
            "text": "<html><body><span class=\"comment-copy\">\n after being frozen, I need to perform a clean install of windows and if I don't connect it at the internet at all it doesn't freeze, maybe I should use a firewall to block the communication between the laptop and the servers of Absolute Software Corp.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}