{
    "title": "How to force IDA to load MFC DLL symbols while disassembling an EXE that uses such DLL?",
    "link": "https://reverseengineering.stackexchange.com/questions/31854/how-to-force-ida-to-load-mfc-dll-symbols-while-disassembling-an-exe-that-uses-su",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I found that IDA may not load symbols for MFC DLLs while disassembling EXEs that load such DLLs. This makes the disassembling horrible if the DLL is linked just by ordinals, and IDA doesn't have a signature for the particular MFC DLL version.\n </p>\n <p>\n  For example, if I load old MFCOGL.EXE 1.0.0.1 that uses MFC42.DLL 6.06.8064.0, IDA shows all MFC DLL entries as MFC_nnnn, where nnnn is an ordinal number of the export. Even if I place MFC42.DLL together with the corresponding MFC42.PDB (downloaded from MS Symbol Store) to the same directory, IDA doesn't load PDB for the DLL, just applying the common signature:\n </p>\n <blockquote>\n  <p>\n   File C:\\Tmp\\4\\mfc42.dll is used for module MFC42...\n   \n\n   Plugin \"eh_parse\" not found\n   \n\n   Plan  FLIRT signature: Microsoft VisualC 2-14/net runtime\n   \n\n   autoload.cfg: vc32rtf.sig autoloads mssdk_win7.til\n   \n\n   Type library 'mssdk_win7' loaded. Applying types...\n   \n\n   Types applied to 87 names.\n   \n\n   Plan  FLIRT signature: MFC 3.1-14.0 32bit\n   \n\n   autoload.cfg: vc32mfc.sig autoloads mssdk_win7.til\n  </p>\n </blockquote>\n <p>\n  If I try to load the PDB explicitly, IDA applies it to the main EXE, not to the DLL referenced by the EXE.\n </p>\n <p>\n  If I load the DLL as an additional binary file, IDA doesn't treat it as a PE module.\n </p>\n <p>\n  Ghidra successfully finds and loads all MFC symbols, but IDA is more familiar to me.\n </p>\n <p>\n  Is there a way to instruct IDA to load the PDB?\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 0,
    "views": "526",
    "tags": [
        "ida",
        "dll",
        "symbols",
        "pdb",
        "mfc"
    ],
    "user": "Eugene Muzychenko",
    "time": "May 10, 2023 at 11:14",
    "comments": [
        {
            "user": "Eugene Muzychenko",
            "text": "<html><body><span class=\"comment-copy\">\n I never built it. I took MFCOGL.EXE (1.0.0.1 from 1995) from MS examples many years ago, and just found it in my archive, looking for various MFC applications to test with IDA and Ghidra.  I was told that IDA and Ghidra never use PDBs for DLL imports. Only standard databases (IDA Free doesn't have all of them) are used. This is very surprisingly and strange for me, but it's true.  I successfully built an IDT file for the required MFC DLLs, now IDA shows the imports.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}