{
    "title": "Rename a program's button using x64dbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/32000/rename-a-programs-button-using-x64dbg",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to change the name of a button, but I can't find anything that references it. I looked for the\n  <code>\n   CreateWindow\n  </code>\n  function in the intermodular calls, but I only found a reference to the main window. I also tried through strings but without success.\n </p>\n <p>\n  Searching a little more I found a x64dbg function that allows checking the created processes and their identifiers called\n  <code>\n   handle\n  </code>\n  but nothing appears there except the process of the main window, different one from when you analyze the native calculator of windows.\n </p>\n <p>\n  Could someone give me a new tip on what to do? It's like the button doesn't exist but it's visually there in the program.\n </p>\n <p>\n  Sorry for my English I'm using google translator.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "191",
    "tags": [
        "debugging"
    ],
    "user": "William Marques",
    "time": "May 6, 2024 at 4:59",
    "comments": [
        {
            "user": "Ricardo",
            "text": "<html><body><span class=\"comment-copy\">\n Have you tried searching for the text?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Before registering a window for the first time, the Windows os holds all relevant information in a structure.(maybe uses RegisterClass function)  You can do this by looking at the arguments for the functions used.\n </p>\n <p>\n  Otherwise, older legacy UIs use the window's default preset to bring up the window, which is hard to modify internally.\n </p>\n <p>\n  I would suggest searching for the text inside the button, or breakpointing the click, and then pressing the button.\n </p>\n <p>\n  If possible, it would be great if you could specify exactly which method it using.\n </p>\n <p>\n  ps I use the \"deepl\" translator, AI-powered.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Eveheeero",
            "time": "Jun 27, 2023 at 4:47",
            "is_accepted": false,
            "comments": []
        }
    ]
}