{
    "title": "How could I extract a certificate and private key out of a exe?",
    "link": "https://reverseengineering.stackexchange.com/questions/32011/how-could-i-extract-a-certificate-and-private-key-out-of-a-exe",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I’m trying to get API responses from a backend service to make a server emulator for a game called NBA 2k17, but I can't get to them cause they are encrypted so I need to impersonate the client to get them but the server has mTLS on, do you know if this is even possible, cause it’s not stored anywhere locally. I also tried going into IDA pro to see if i can find it in there but I couldn't, it seems like the certificate isn't a pem certificate, it looks like it is in the der format so it would be pretty hard to spot inside ida.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "456",
    "tags": [
        "api",
        "api-reversing",
        "api-hacking"
    ],
    "user": "Botytec",
    "time": "Jun 30, 2023 at 0:50",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Are you sure the game uses mTLS with certificate based client authentication (only if it is used you may be able to find a private key)? In general TLS with certificate based client auth is rarely used, most applications simply use TLS with certificate pinning. Thus the executable may contain the pinned certificate or more likely the certificate hash (usually the hash of the root CA certificate as those certs have the longest life-time).\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  have you tried using binwalk? it's an easy and quick tool that goes through the file and looks for headers of different file formats and can easily pick out if pem certificate is within the exe.\n </p>\n <p>\n  You could also probably wireshark the specific port the exe is using to communicate with the server and get the certificate that way?\n </p>\n <p>\n  I suggest you also look into Burp Suite as it might help you with decrypting the traffic and modifying it before sending it out to the main server.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Josip Stjepanović",
            "time": "Jul 3, 2023 at 17:57",
            "is_accepted": false,
            "comments": []
        }
    ]
}