{
    "title": "How does the Easy Victory cheat get data from another app in real time?",
    "link": "https://reverseengineering.stackexchange.com/questions/32088/how-does-the-easy-victory-cheat-get-data-from-another-app-in-real-time",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Easy Victory was developed in Java for Android\n </p>\n <p>\n  I was very curious about how Easy Victory takes data from the game's balls and billiard cue force/velocity to calculate trajectories\n </p>\n <p>\n  This is not a mod because Easy Victory is not the modified 8 Ball Pool\n </p>\n <p>\n  Somehow it reads data from the game table in real time\n </p>\n <p>\n  It runs in the background and runs the game if the game is installed on the smartphone. Otherwise it redirects to the Play Store to download\n </p>\n <p>\n  How was that possible?\n </p>\n <p>\n  I used Apktool and Ghidra to decompile but I couldn't identify where the cheat actually gets the game information\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/HDBsu.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/HDBsu.jpg\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "548",
    "tags": [
        "android",
        "java",
        "cheat-engine"
    ],
    "user": "Jonathan Silva",
    "time": "Jul 23, 2023 at 1:31",
    "comments": [
        {
            "user": "Andrew T.",
            "text": "<html><body><span class=\"comment-copy\">\n Does the app ask for accessibility settings? Those can directly read the screen.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n A non-rooted Android system uses sandboxes for each app so direct manipulation of the game is unlikely. But there techniques exist where you load a third party apk file (e.g. 8 Ball Pool) into a running app instance (e.g. Easy Victory). In such a case the whole app runs in the same sandbox as easy victory does so direct memory access is possible. If 8 Ball Pool has settings or a high score table those values should be different to the values you see when directly start 8 Ball Pool vs when you start it in easy victory.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Jonathan Silva",
            "text": "<html><body><span class=\"comment-copy\">\n @AndrewT. I haven't tested it (I don't trust it to be anti-ban), I only watch videos and there are no accessibility settings there\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Jonathan Silva",
            "text": "<html><body><span class=\"comment-copy\">\n @Robert complex :(\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}