{
    "title": "Is there a debugger for the entire x86 architecture?",
    "link": "https://reverseengineering.stackexchange.com/questions/32139/is-there-a-debugger-for-the-entire-x86-architecture",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  When learning about the topic that includes processes, threads and image files it helped immensely to use x86dbg. However, it only shows things from the \"view\" of a single process.\nI am currently at x86 architecture in more detail with help of the \"Intel® 64 and IA-32 Architectures Software Developer’s Manual\", which I think explains it very comprehensibly.\nI wonder if there is also a debugger that shows data structures such as the Global Descriptor Table (GDT) or the Page Directory. I still have difficulties sorting these concepts in my mind; where these structures reside, who modifies them, when they are accessible, or how that \"kernel space\" is built from these address translations and privilege levels.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "68",
    "tags": [
        "x86",
        "debuggers",
        "kernel-mode"
    ],
    "user": "AirToTec",
    "time": "Aug 10, 2023 at 22:24",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Hi and welcome to RE.SE. I am a bit confused by your question. Assuming you are interested in Windows, you'd use something like WinDbg with a kernel debugger connection. Similar solutions exist for Linux etc with GDB. You could have a fully virtualized VM in something like VMware and debug that via the GDB protocol. Another option would be something like Qemu or Bochs. But it's not really clear what you're after. Sounds like protected mode at least, but obviously some of the non-processor-specific details differ between OSs.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "AirToTec",
            "text": "<html><body><span class=\"comment-copy\">\n I don't primarilly mean a debugger for tracing (which WinDbg can do). I mean a program that displays OS and processor data structures. For example a view of the kernel space that shows what data sits there, and where.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}