{
    "title": "Retrieve functionality to button - game patching",
    "link": "https://reverseengineering.stackexchange.com/questions/32222/retrieve-functionality-to-button-game-patching",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm patching an old game, and I want the retrieve the toggle fullscreen functionality it's supposed to have.\n </p>\n <p>\n  In the menu, in the display tab, there is a disabled option of fullscreen mode that you can either click on or press ALT+ENTER and it should toggle fullscreen and windowed screen.\n </p>\n <p>\n  Currently the button is disabled like this:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/JZ4GS.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/JZ4GS.png\"/>\n  </a>\n </p>\n <p>\n  At first, I thought the button is disabled because of inaccurate flags were sent to the ModifyMenu function, but it doesn't seem to be the case.\n </p>\n <p>\n  After that, I looked for an accelerator table in the resource section but there wasn't one, not even an external one. Every function related the accelerators got passed on or return NULL.\n </p>\n <p>\n  It got me thinking, what about the other supposed accelerator keys in different parts of the menu, how are they handled?\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/60ITB.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/60ITB.png\"/>\n  </a>\n </p>\n <p>\n  So I looked for the scalars 0x71 and 0x72 which are the virtual key codes to F2 and F3 keys and sure enough, I found a function that checks for these values and handle them like the game behaves:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/gHtAs.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/gHtAs.png\"/>\n  </a>\n </p>\n <p>\n  My problem is that I'm not sure how to proceed from here because the function that calls the  one I found now was being call way too often and I can't debug it properly.\n </p>\n <p>\n  Do I just need to add my own condition that checks for the ALT+ENTER virtual key code and handle it accordingly? If so, what are the best way of doing it?\n </p>\n <p>\n  Or maybe I'm missing something else entirely?\n </p>\n <p>\n  Please let me know if you have any other leads!\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "47",
    "tags": [
        "debugging",
        "binary-analysis",
        "c++",
        "static-analysis",
        "game-hacking"
    ],
    "user": "Yair Derry",
    "time": "Aug 26, 2023 at 16:06",
    "comments": [],
    "answers_data": []
}