{
    "title": "X64dbg question",
    "link": "https://reverseengineering.stackexchange.com/questions/32325/x64dbg-question",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I got a program that I try to patch. Normally you get a message box or something to get at the right point in program. But this program behaves else. It opens, then you can type in your license number and click verify. But it wont jump at any point in programcode. It just writes this message \"License verification failed!\"\n </p>\n <p>\n  Normally I go with the \"Search for String\" in Module or \"Call Stack\" but neither of them seems to work. you got any ideas?\n  <a href=\"https://i.sstatic.net/fdWLi.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/fdWLi.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "49",
    "tags": [
        "x64dbg",
        "patching"
    ],
    "user": "silvio",
    "time": "Sep 27, 2023 at 16:54",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n \"But it wont jump at any point in programcode\" how do you check that? Do you put any breakpoints on some APIs? It feels like this Q is missing some details to provide help.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "silvio",
            "text": "<html><body><span class=\"comment-copy\">\n I mean normally in other software if you click \"verify license\" then the code is jumping at a specific point and a new window pops up with message like \"bad license\" or something. But in this software no popup is happening. The \"bad message\" is only shown in the nag at the beginning.  Moreover i cant find any strings with bad messages. And call stack didn't bring me further. I tried also with the software \"resource hacker\" to find some buttons addresses or something but there is not much usable.  Maybe you got an idea.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "<html><body><span class=\"comment-copy\">\n string can be encrypted/encoded before drawing and only decoded while drawing. The look of the \"Verify button\" suggests that it might be not a native app. So some translation might be happening. Unfortunately there's not really a \"do this and this\" kind of answer to such Q.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}