{
    "title": "Is DOS Assembly Hexadecimal Different To Modern Hex Editor Hexadecimal?",
    "link": "https://reverseengineering.stackexchange.com/questions/32455/is-dos-assembly-hexadecimal-different-to-modern-hex-editor-hexadecimal",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to find the correct Data Segment, corresponding to a certain File in a 16bit DOS Game.\nThe Assembly Instructions for the Decompiled .exe File in IDA Pro Version 5, I am looking at.\n </p>\n <p>\n  I was wondering, is there a difference to DOS Assembly Hexadecimal, for a File, than a File opened up in a modern Hex Editor ? I use HxD the File in question, opened up in that Hex Editor is Offset(h):220A\n </p>\n <p>\n  An example of Assembly Instruction in the decompiled code is :- mov  ds:264Ah, ax\n </p>\n <p>\n  there is no Code with ds i.e. Data Segment ds:220Ah so what Value should I be looking for, if there is differences ? And are there any online converters, to help me achieve this ? or does anyone know how do work it out manually ?\n </p>\n <p>\n  Any help would be much appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "271",
    "tags": [
        "ida",
        "disassembly",
        "assembly",
        "hex",
        "dos"
    ],
    "user": "Edward Winch",
    "time": "Oct 30, 2023 at 1:23",
    "comments": [
        {
            "user": "blabb",
            "text": "<html><body><span class=\"comment-copy\">\n No hex representation cannot change  0x2b cannot become 0x2c or 0x2? Based on tools.  Your interpretation the address you are looking may be different  and your question as is does not make sense  devoid of context.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  As was said, hex is hex - so the actual bytes are just bytes. But there are some things that you need to understand in order to progress.\n </p>\n <ol>\n  <li>\n   What does ds prefix mean? its meaning is defined by data structures (segment descriptors) that reside in memory and pointed to by a special register. Basically they define the memory offset, range etc. On modern system like windows most are set to the entire virtual space so are meaningless from a reversing perspective (though GS, FS are still used)\n  </li>\n  <li>\n   To find the offset you're looking for, the easiest way I can think of is to debug the process and try to see if you can look at the address using a debugger (that would help you understand more quickly)\n  </li>\n  <li>\n   The assembly you're looking at is 16bit assembly, which is not the exact same \"language\" as x64 assembly - so you need to be aware of that\n  </li>\n  <li>\n   You have to read a lot of material to move forward - you are working on an ancient format running on ancient \"OS\", be careful not to be confused with new information because everything has changed\n  </li>\n  <li>\n   You might want to consider working on more modern stuff, there are some disadvantages with learning from working on very outdated things. But that depends on your objectives and what you enjoy...\n  </li>\n </ol>\n <p>\n  If you want to understand more, I suggest to read Windows Internals, understand assembly and keep going (it will take some time)\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "ereisr",
            "time": "Jul 26, 2024 at 8:48",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Tip:\n </p>\n <p>\n  DOS exe get \"relocated\" when loaded by DOS/Dosbox - and only the non header part of the EXE gets loaded at the load-segment behind the PSP\n </p>\n <p>\n  and IDA offsets are relocated differently: normally to base adress 0x1000 and start segment is 0\n </p>\n <p>\n  so there is a mapping between the real loaded EXE, the EXE as a file and the EXE loaded in IDA\n </p>\n <p>\n  to your hex-question:\n </p>\n <p>\n  hex is hex but there are many difference when talking about \"offsets\"\n </p>\n <ol>\n  <li>\n   linear offset in DOS 1MB ram?\n  </li>\n  <li>\n   segment/offset pointer in DOS ram?\n  </li>\n  <li>\n   segment/offset loaded in Dosbox(with/without debugger)\n  </li>\n  <li>\n   linear IDA (EA) offsets, segment/offset in IDA, file offset in IDA\n  </li>\n  <li>\n   file offset in EXE-image\n  </li>\n  <li>\n   file offset in EXE-file\n  </li>\n  <li>\n   near/far pointer\n  </li>\n  <li>\n   code/data-segments,overlays offsets\n  </li>\n </ol>\n <p>\n  you want to read a book, written in encrypted chinese - without knowing anything about decryption AND chinese\n </p>\n <p>\n  and the answer is completely different if the game is using some sort of non-standard overlay-technique or many other only-this-game-exe related stuff like self modifiying code, memory reduction techniques, partially packed data, strange stuff that were only done in the old times of coding\n </p>\n <p>\n  and you still asking questions like the 4 before - questions out of context, no information what you already know, that just does not work\n </p>\n <p>\n  reverse engineering is much more suffering as you think\n </p>\n <p>\n  maybe come up with a small assembler example and help people to explain that to you - maybe one i've already sent :)\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "llm",
            "time": "Oct 30, 2023 at 7:13",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Edward Winch",
                    "text": "<span class=\"comment-copy\">@blabb many thanks for your reply aswell</span>",
                    "time": null
                },
                {
                    "user": "Edward Winch",
                    "text": "<span class=\"comment-copy\">Hi @llm Many thanks for your reply, I see now, that this alot harder, than I first thought. And trial and error, is really hard, with so much assembly code in the .exe File.</span>",
                    "time": null
                }
            ]
        }
    ]
}