{
    "title": "Function return in machine code (by platform/compiler)",
    "link": "https://reverseengineering.stackexchange.com/questions/32516/function-return-in-machine-code-by-platform-compiler",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am asking this question to gather a knowledge base. I know in x86-64, a machine code function can have only one function return, i.e.,\n  <code>\n   ret\n  </code>\n  instruction. I know it can be compiler (GCC, clang, etc) and platform (MIPS, ARM, etc) specific. My question is, is it always to be true to have only one function\n  <code>\n   return\n  </code>\n  in machine code for every platform and generated by any compiler?\nThanks in advance.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "62",
    "tags": [
        "functions"
    ],
    "user": "Mustakimur Khandaker",
    "time": "Nov 25, 2023 at 1:49",
    "comments": [
        {
            "user": "blabb",
            "text": "<html><body><span class=\"comment-copy\">\n A function as such can have multiple returns like if(foo) {return blah} ; .elseif {} .else {}\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  As far as I remember ARM has at least 3 different possibilities to implement return from function functionality, and I had seen all of those in real code, allegedly generated by ordinary compiler.\n </p>\n <p>\n  The first pattern is\n  <code>\n   push {list of registers, LR}\n  </code>\n  at the prologue of the function and then\n  <code>\n   pop {same list of registers, PC}\n  </code>\n  at the end of the epilogue. It is used this way because call like instructions in ARM put the return address into LR register and not on stack, and if there is another function call inside the first one LR changes.\n </p>\n <p>\n  The second pattern is just\n  <code>\n   BX LR\n  </code>\n  (or just\n  <code>\n   B LR\n  </code>\n  ) for functions without calls inside.\nThe third one is\n  <code>\n   MOV PC,LR\n  </code>\n  .\n </p>\n <p>\n  It should be also taken in account, that ARM has 2 instruction sets, ARM and THUMB, and instructions from those 2 instruction sets may co-exists in the same executable. This gives us different encodings(and sometimes mnemonics) for all mentioned instructions, so technically all those are different instructions.\n </p>\n <p>\n  So the answer to you question is\n  <strong>\n   no\n  </strong>\n  ,\n  <strong>\n   it is not always to be true\n  </strong>\n  to have only one function return in machine code for every platform and generated by any compiler.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "w s",
            "time": "Nov 25, 2023 at 16:36",
            "is_accepted": false,
            "comments": []
        }
    ]
}