{
    "title": "Unable to run system Save As dialogue while debugging Notepad with IDA",
    "link": "https://reverseengineering.stackexchange.com/questions/32560/unable-to-run-system-save-as-dialogue-while-debugging-notepad-with-ida",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to hook a function to Notepad.exe, so that it will encrypt a file when saving.\nI have dis-assembled it with IDA. I want to place breakpoints on the saving subroutine which I have identified. When starting a Notepad process inside the IDA debugger, I can use notepad fine but when try to \"Save As\" from inside the Notepad the process crashes with the following error:\n </p>\n <p>\n  7FFE28C9565C: unknown exception code 6BA (exc.code 6ba, tid 10436)\n </p>\n <p>\n  What can I do to solve this?\n </p>\n <p>\n  A problem that might be related is that when I first dis-assemble notepad.exe I get a popup asking me to place the path of api-ms-win-shcore-path-l1-1-0.dll, which I can't find.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "99",
    "tags": [
        "ida",
        "hooking"
    ],
    "user": "Yizhar Amir",
    "time": "Dec 12, 2023 at 15:48",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Value 6BA is 1722 in decimal so most likely corresponds to the following Win32 error code:\n </p>\n <pre><code>//\n// MessageId: RPC_S_SERVER_UNAVAILABLE\n//\n// MessageText:\n//\n// The RPC server is unavailable.\n//\n#define RPC_S_SERVER_UNAVAILABLE         1722L\n</code></pre>\n <p>\n  At a guess, the system function used for the save dialog tries to communicate with some RPC service but it's not available (e.g. it's used only in some Windows versions or configurations). Since standalone Notepad works, most likely the code is prepared to handle this exception so you can try to continue execution and select \"pass exception to the program\".\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "Dec 12, 2023 at 15:53",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Yizhar Amir",
                    "text": "<span class=\"comment-copy\">Thank you for the response! Where can I pass an exception to the program in the IDA interface?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@YizharAmir the choice is shown when you try to continue execution (step or run)</span>",
                    "time": null
                }
            ]
        }
    ]
}