{
    "title": "Analyzing USB traffic coming from XCode -> iPhone via USBC/Lightning cable",
    "link": "https://reverseengineering.stackexchange.com/questions/32623/analyzing-usb-traffic-coming-from-xcode-iphone-via-usbc-lightning-cable",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I tried posting this on stack overflow with no luck, hoping I can get some more answers here.\n </p>\n <p>\n  have an app running on my iPhone via XCode by way of USBC -> Lightning cable. I would like to analyze the USB packets that go between XCode and the device when I install an app from Xcode to the device. I open up wireshark, and I see a few interfaces that seem like an obvious choice:\n </p>\n <ul>\n  <li>\n   iPhone USB: en6\n  </li>\n  <li>\n   en12, en13 (these only showed up when I plugged the phone in, they disappeared when unplugging, so I figured they're related)\n  </li>\n  <li>\n   Thunderbolt 1-4: en1-4 (I have it plugged into one of my thunderbolt ports, so maybe?)\n  </li>\n </ul>\n <p>\n  I've tried running wireshark as sudo, I've also tried turning the interfaces off and then on again using\n  <code>\n   sudo ifconfig <interface> off/on\n  </code>\n </p>\n <p>\n  When I run Wireshark on en6, en12, and en13, I see traffic that looks like it correlates with when I build in XCode and the app starts running, but I don't see anything that looks like it's big enough traffic to copy the code from XCode to the phone, and then run it. All I see are some DHCP discover packets, and some MDSN packets.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "42",
    "tags": [
        "ios",
        "usb"
    ],
    "user": "Joshua Terrill",
    "time": "Jan 8, 2024 at 0:04",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Are you aware that there is an open source command-line tool available that can install iOS apps via USB?\n <a href=\"https://github.com/libimobiledevice/ideviceinstaller\" rel=\"nofollow noreferrer\">\n  github.com/libimobiledevice/ideviceinstaller\n </a>\n If you still want to an the USB traffic yourself please read\n <a href=\"https://ask.wireshark.org/question/30854/how-do-i-capture-usb-traffic-on-macos/\" rel=\"nofollow noreferrer\">\n  ask.wireshark.org/question/30854/…\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Joshua Terrill",
            "text": "<html><body><span class=\"comment-copy\">\n I'm not trying to install iOS apps via USB. I'm trying to analyze the traffic from XCode to iPhone via USB.  I've also read that wireshark article, I've disabled the system integrity monitor, it makes no difference on packets in wireshark from XCode -> iPhone from what I can tell (at least no in this scenario)\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}