{
    "title": "Question about anti-debug methods and anti-anti-debug methods",
    "link": "https://reverseengineering.stackexchange.com/questions/32669/question-about-anti-debug-methods-and-anti-anti-debug-methods",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've come across several binaries that have simple anti-debug methods in place, like checking\n  <code>\n   IsDebuggerPresent()\n  </code>\n  ,\n  <code>\n   NtQueryInformationProcess()\n  </code>\n  , etc. But I recently came across a binary that looked totally new to me. It was completely filled with\n  <code>\n   add byte ptr ds:[eax], al\n  </code>\n  instructions. The IDA tree graph was so large that it wouldn't even load, and after IDA took 20 minutes to process the instructions to load it, the file was 500mb+ on disk (the binary is 30mb). I've attached a screenshot of what some of it looks like here:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/zV1cY.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/zV1cY.png\"/>\n  </a>\n </p>\n <p>\n  Any time during debugging when it hits one of these it basically crashes immediately.\n </p>\n <p>\n  I was able to execute the binary via\n  <code>\n   rundll32.exe\n  </code>\n  and then attach to it really quickly, putting some hardware breakpoints on some stack strings that looked interesting, but then I would see this:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/ejGOE.jpg\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/ejGOE.jpg\"/>\n  </a>\n </p>\n <p>\n  Where it appears any time I tried to attach to the running process with the debugger, this stack string saying \"noway\" would always get loaded, I'd tried to step through some instructions, and then it eventually would crash.\n </p>\n <p>\n  When looking at the binary through DIE, the import table only has one import:\n  <code>\n   MSVBM60.dll\n  </code>\n  , however, when I run the binary through\n  <code>\n   rundll32.exe\n  </code>\n  and then quickly attach to the running process, it starts to load dozens of other Windows DLL's.\n </p>\n <p>\n  My questions are this:\n </p>\n <ol>\n  <li>\n   <p>\n    Why is it that these kinds of instructions work differently when stepping through it on a debugger vs. having it run like a normal binary? I thought that the debugger would execute the code the same way the binary normally would, is that not the case? What's this called and where can I learn more about it?\n   </p>\n  </li>\n  <li>\n   <p>\n    What kind of anti-debugging method with all of these what appear to be junk instructions called?\n   </p>\n  </li>\n  <li>\n   <p>\n    What can I do to get around this? Basically to where I can remove all of the junk that is getting in the way and step through the program the same way it would normally run under normal execution?\n   </p>\n  </li>\n  <li>\n   <p>\n    What kind of anti-debug method is it where the import table is basically one library, but then when the program actually runs, it imports several others? Are they just stored dynamically as variable names somewhere in the binary, and it manually loads them in?\n   </p>\n  </li>\n </ol>\n <p>\n  If anyone is interested in looking at this binary you can get it her, but WARNING!!! IT IS MALICIOUS:\n  <a href=\"https://mega.nz/file/ssBBGI4C#YcOYWDmENZkfpdPKwV6h0Iw9wDgJWsced5oXcy7R8bc\" rel=\"nofollow noreferrer\">\n   https://mega.nz/file/ssBBGI4C#YcOYWDmENZkfpdPKwV6h0Iw9wDgJWsced5oXcy7R8bc\n  </a>\n </p>\n <p>\n  Password to it is\n  <em>\n   infected\n  </em>\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "113",
    "tags": [
        "x64dbg",
        "anti-debugging"
    ],
    "user": "Joshua Terrill",
    "time": "Jan 26, 2024 at 3:35",
    "comments": [
        {
            "user": "jsotola",
            "text": "<html><body><span class=\"comment-copy\">\n <code>\n  filled with add byte ptr ds:[eax], al instructions\n </code>\n ... look at the bytes  ... they are not instructions\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Joshua Terrill",
            "text": "<html><body><span class=\"comment-copy\">\n Every time it gets past one of those lines, it throws an exception though, so I'm not sure what is causing that to happen.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "ynwarcs",
            "text": "<html><body><span class=\"comment-copy\">\n the program does run in the same manner whether it's being debugged or not, unless the debugger intervenes. what this means is that the program you're debugging is detecting that you've attached the debugger and forcefully doing something unexpected to deter you from debugging. there's a very comprehensive list of anti-debug techniques\n <a href=\"https://anti-reversing.com/Downloads/Anti-Reversing/The_Ultimate_Anti-Reversing_Reference.pdf\" rel=\"nofollow noreferrer\">\n  here\n </a>\n that will hopefully help you get to the bottom of it.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}