{
    "title": "Patching an old piece of software [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/32702/patching-an-old-piece-of-software",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <div>\n  <aside class=\"s-notice s-notice__info post-notice js-post-notice mb16\" role=\"status\">\n   <div class=\"d-flex fd-column fw-nowrap\">\n    <div class=\"d-flex fw-nowrap\">\n     <div class=\"flex--item wmn0 fl1 lh-lg\">\n      <div class=\"flex--item fl1 lh-lg\">\n       <div>\n        <b>\n         Closed.\n        </b>\n        This question is\n        <a href=\"/help/closed-questions\">\n         off-topic\n        </a>\n        . It is not currently accepting answers.\n       </div>\n      </div>\n     </div>\n    </div>\n   </div>\n   <hr class=\"my12 outline-none baw0 bb bc-blue-400\"/>\n   <div class=\"fw-nowrap fc-black-500\">\n    <div class=\"d-flex fd-column lh-md\">\n     <div class=\"mb0 d-flex\">\n      <div class=\"flex--item mr8\">\n       <svg aria-hidden=\"true\" class=\"svg-icon iconLightbulb\" height=\"18\" viewbox=\"0 0 18 18\" width=\"18\">\n        <path d=\"M15 6.38A6.5 6.5 0 0 0 7.78.04h-.02A6.5 6.5 0 0 0 2.05 5.6a6.3 6.3 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.3 6.3 0 0 0 15 6.37M4.03 5.85A4.5 4.5 0 0 1 8 2.02a4.5 4.5 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.3 4.3 0 0 1-1.64-3.94M10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2z\">\n        </path>\n       </svg>\n      </div>\n      <p>\n       Questions asking for help\n       <b>\n        reverse-engineering a specific system\n       </b>\n       are off-topic unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem.\n      </p>\n     </div>\n     <div class=\"mb0 mt6 d-flex\">\n      <p class=\"ml24 pl2\">\n       Closed\n       <span class=\"relativetime\" title=\"2024-03-02 15:40:23Z\">\n        last year\n       </span>\n       .\n      </p>\n     </div>\n     <div class=\"ml24 pl2\">\n     </div>\n    </div>\n   </div>\n   <div class=\"mt24 d-flex gsx gs8\">\n    <a class=\"s-btn s-btn__outlined flex--item js-post-notice-edit-post\" href=\"/posts/32702/edit\">\n     Improve this question\n    </a>\n   </div>\n  </aside>\n </div>\n <p>\n  First off, let me just start by preemptively apologizing if this isn't the right place to ask this question. If that is indeed the case, let me know and I will delete the post. It's just that I'm currently rather desperate for some help with an issue I've been having, so I'm trying every possible avenue in order to potentially get some help.\n </p>\n <p>\n  Anyways, onto the issue at hand. I have a very old (15+ years) large format printer that came with a piece of RIP/printing software specific for this machine. And this software is old too, as it is compatible with only Windows XP 32-bit. This software also requires an USB dongle key to be plugged in in order to start and keep running. The problem is that the company that made both the machine and the software stopped supporting either years ago (it's a Chinese company called Yishan). And my USB dongle has started to break down, disconnecting at random and making the software crash because of it. Last time that happened some 10 years ago, the company that made the printer sold me a replacement and told me that it was the last one they had and that they no longer support this printer. So I can't just buy another one from them, or from anyone else for that matter because apparently the dongle is encrypted or some such thing. Believe me, I tried. And the printer is basically useless without the software as it's not compatible with other RIP/printing applications.\n </p>\n <p>\n  So my question is this: is there a way to make the software simply not look for the dongle anymore and what would it entail? I'm not well-versed (or versed at all) when it comes to programming or hacking, so I have no idea how much work would be involved. I ran into this article online where this dude managed to do just that with his own piece of software. (link:\n  <a href=\"https://samdecrock.medium.com/reverse-engineering-dongle-protected-software-138e5965cb59\" rel=\"nofollow noreferrer\">\n   https://samdecrock.medium.com/reverse-engineering-dongle-protected-software-138e5965cb59\n  </a>\n  ). However, most of that is just gibberish to me and I wouldn't know where to start. Is there someone here who might be interested in having a crack at it? This piece of software is rather simple and small (it's about 70mb in total). Also (not sure if this is allowed or not here), I'd be willing to compensate whoever manages to do so up to a reasonable amount (I really have no idea how much work this would be, so I don't know how much it might cost).\n </p>\n <p>\n  In conclusion, I would be very thankful for any kind of help with this matter. Even if someone could point me in the right direction where to look for a solution, it would be of great help. Cheers.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "110",
    "tags": [
        "patching"
    ],
    "user": "Duro Prem",
    "time": "last year",
    "comments": [
        {
            "user": "Allinone",
            "text": "<html><body><span class=\"comment-copy\">\n Can you post pictures of your Dongle? Please, remove any serial number if any on the Dongle. First, we need to know what kind of Dongle you have.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Rup",
            "text": "<html><body><span class=\"comment-copy\">\n You could also investigate repairing your dongle, e.g. if it turns out it's just a loose connection someone could solder for you, or a capacitor or simple component that needs replacing. Hopefully you can find an expert to look at this for you.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Duro Prem",
            "text": "<html><body><span class=\"comment-copy\">\n Sorry for the late reply. I didn't get a notification that someone responded until now. The photo of the dongle can be found here:\n <a href=\"https://imgur.com/a/UX0vToA\" rel=\"nofollow noreferrer\">\n  imgur.com/a/UX0vToA\n </a>\n . Also, I looked into getting repaired, but the two repairmen I took it to couldn't find anything physically wrong with it (you can actually see on the photo that the plastic is cracked from when they opened it up).\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Duro Prem",
            "text": "<html><body><span class=\"comment-copy\">\n Also, from what I could gather while doing research on it, the dongle is Sentinel Senselock or something like that. It's very hard to find any info on it as it's very old and the company that made it no longer makes that model. I actually contacted the company that made it about a year ago, but they told me they couldn't help me, as it's not an issue with the dongle itself, but rather with the protection/code/whatever the company that made the printer put on it, which has nothing to do with them, as they sell only blank dongles.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Rup",
            "text": "<html><body><span class=\"comment-copy\">\n 😢 I'd ask if they could clone your broken dongle onto a new blank dongle if you sent it to them, although I'd guess they'll say no.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Welcome to RE.SE\n </p>\n <p>\n  Reverse engineering a dongle-protected software is anywhere on the spectrum between trivial and extremely complex.\n </p>\n <p>\n  If all you need is a means to operate your printer, there are other RIP printer software, by various providers, that (claim to) support an extensive list of printer vendors, Yishan printers included. This suggests that the Yishan proprietary software is not required.\n </p>\n <p>\n  The search term\n </p>\n <blockquote>\n  <p>\n   \"yishan\" rip printer driver\n  </p>\n </blockquote>\n <p>\n  Returned quite many results.\n </p>\n <p>\n  I'm voting to close this thread as it is a request for private work on a specific piece of software and does not meet the site rules.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Yotamz",
            "time": "Feb 5, 2024 at 19:29",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Duro Prem",
                    "text": "<span class=\"comment-copy\">I apologize if my question was not within the site rules. I would like to point out that, while there are several other RIP applications out there, none of them supports my particular model. They all support later Yishan models that were more in line with western, more modern machines. As mine is an early model (YS2407-GL), none of them support it as it comes with its own custom software, which I hope to have patched.</span>",
                    "time": null
                }
            ]
        }
    ]
}