{
    "title": "Reverse engineering from sets of data",
    "link": "https://reverseengineering.stackexchange.com/questions/32729/reverse-engineering-from-sets-of-data",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm starting in the world of reverse engineering, for educational purpose, by studying a (supposed-to-be) relatively simple system as black-box.\n </p>\n <p>\n  The system uses a NFC Mifare 1k badge to store persistent data. Upon each completed operation, it writes a single chunk of 3*128bits ; no other sector gets modified. My  first experiments led me to identify some 64bits patterns in the produced data.\n </p>\n <ol>\n  <li>\n   the data at offset 0x10 represents a timestamp of the last operation. The timestamp is made of two 64bits blocks (one for the date and one for the time). One same date always results in the same 64bits encoding.\n  </li>\n </ol>\n <pre><code># date:2024-02-06 time:???\n0x0010: FD C9 D4 5B E7 7A 09 89 | 26 C9 75 47 8E 01 AE 56\n\n# date:2024-02-07 time:???\n0x0010: 20 29 4E 54 82 ED 12 3E | A3 22 73 3A BE B2 55 5E\n\n# date:2024-02-12 time:???\n0x0010: 00 EB 83 C7 98 FC E5 DE | D9 2B FD F9 B9 F7 22 8F\n</code></pre>\n <ol start=\"2\">\n  <li>\n   <p>\n    the data at offset 0x20 represents the last executed operation. It is made of two 64bits blocks (one is the operation and one is an extra parameter). One same operation identifier always results in the same 64bits encoding.\n   </p>\n  </li>\n  <li>\n   <p>\n    the data at offset 0x30 is always the same. According to the NFC Mifare spec, it describes the key-A, access rights, and key-B.\n   </p>\n  </li>\n </ol>\n <p>\n  <strong>\n   NOTE:\n  </strong>\n  I use the word \"encoding\" because I cannot tell whether the data is encoded or encrypted. If the data is encrypted, I guess a fairly simple algorithm may be in use without random IV or seed (because of the patterns and constant results for constant inputs).\n </p>\n <p>\n  How can I go further with the pieces of information I gathered until now? Is there some tools for guessing the encoding/ciphering of a data without knowing its exact representation (I mean, I know the date is valid, but I do not know how the system represents it nor how the system produced the resulting encoded/ciphered data)?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "74",
    "tags": [
        "encryption",
        "encodings"
    ],
    "user": "Jib",
    "time": "Feb 12, 2024 at 13:40",
    "comments": [
        {
            "user": "Yotamz",
            "text": "<html><body><span class=\"comment-copy\">\n Where does the data come from? Is this part of the communication between the terminal and the card? Or is it only on the program side? And if it is so, where does it write the data to?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Jib",
            "text": "<html><body><span class=\"comment-copy\">\n @Yotamz the data is dumped from the NFC tag memory using the Mifare Classic android application.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}