{
    "title": "microcontroller to microcontroller - is this I2C protocol?",
    "link": "https://reverseengineering.stackexchange.com/questions/32748/microcontroller-to-microcontroller-is-this-i2c-protocol",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a consumer grade hot water boiler that I am trying to interface to get various internal measurements (outlet temp, inlet temp, etc.). The main control board is powered by a defunct Fujitsu microcontroller mb90495g. There is a separate display board where you can change user settings of the boiler and read all the measurements I’m looking for. This board looks simple and it’s powered by a similar Fujitsu microcontroller MB89190. There is a 10 pin ribbon cable connecting the two that is about a meter long.\n </p>\n <p>\n  I was able to get a scope on it and it does’t seem like I2C. There is a clock line that pulses about ever 100us. There are 7 pulses per frame so that data rate and 7 bits on the clock isn’t I2C. There is what appears to be a data line from the main controller uart but it doesn’t look digital.\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/T7Z6U.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/T7Z6U.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "129",
    "tags": [
        "hardware",
        "protocol"
    ],
    "user": "DaveInPA",
    "time": "Feb 28, 2024 at 16:51",
    "comments": [
        {
            "user": "jsotola",
            "text": "<html><body><span class=\"comment-copy\">\n it could be anything ... run tests to confirm if it is I2C\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "the busybee",
            "text": "<html><body><span class=\"comment-copy\">\n If you are still after this, please\n <a href=\"https://reverseengineering.stackexchange.com/posts/32748/edit\">\n  edit\n </a>\n your question to add a link to the MCU's programmer's manual and the waves from your scope. These \"non-digital\" signals might just be caused by the R-C networks.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It looks like SPI, a common protocol for this type of communication.\n </p>\n <p>\n  <a href=\"https://en.m.wikipedia.org/wiki/Serial_Peripheral_Interface\" rel=\"nofollow noreferrer\">\n   https://en.m.wikipedia.org/wiki/Serial_Peripheral_Interface\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Yotamz",
            "time": "Feb 28, 2024 at 6:49",
            "is_accepted": false,
            "comments": [
                {
                    "user": "DaveInPA",
                    "text": "<span class=\"comment-copy\">Yea i thought it could be but isn't SPI 4 pins/channels. I also believe the clock is 7 pulses and the pulse rate is about 10k a second. I thought SPI was a much faster data rate.  I'm still working on getting the SDO/SDI channels visible on my scope. There are some caps to ground and resistors on the target board that may be helping fix clean up the signal. What i'm seeing on the scope without those isn't clean digital pulses.</span>",
                    "time": null
                },
                {
                    "user": "the busybee",
                    "text": "<span class=\"comment-copy\">@DaveInPA What 4 pins do you mean? There are (beside ground) \"select\" (could be optimized away), \"clock\", and \"data.\" The clock frequency can be anything. But SPI transmits commonly multiples of 8 bits, so this might indeed not be SPI.</span>",
                    "time": null
                }
            ]
        }
    ]
}