{
    "title": "How to use reverse engineering to learn how facebook send messages?",
    "link": "https://reverseengineering.stackexchange.com/questions/32844/how-to-use-reverse-engineering-to-learn-how-facebook-send-messages",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I would like to know how I can use reverse engineering technique to learn how Facebook/messenger send messages? I were analyzing my developer tools network tab, but couldn't find anything. Fiddler tool also doesn't help.Of course I sent the message on messenger so the request on dev tools could appear, but just few not related appears, or it's just only me who doesn't fully understand really how it works.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "63",
    "tags": [
        "debugging",
        "encryption",
        "javascript"
    ],
    "user": "innocent98",
    "time": "Mar 28, 2024 at 8:39",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n It seems you are talking the web versions so you are in a webbrowser environment. Then don't forget that there is the WebSockets technology. Not sure if Fiddler supports to show data from a WebSocket. Better try mitmproxy / mitmweb.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "innocent98",
            "text": "<html><body><span class=\"comment-copy\">\n Hi yes that's probably it. Thank you. I can see some websocket requests in mitmweb after sending a message, but after running python code with same headers I receive 400 http error. Any ideas?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Python is a programing language not used by regular end users (more for scrapers and other unwanted tools), therefore it is often blocked by Cloudflare and similar service providers using TLS fingerprinting.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "innocent98",
            "text": "<html><body><span class=\"comment-copy\">\n I know some people made scripts for rensponding for messages that works in python. I'm not saying you're not right, but probably python can handle it as well, maybe it's just me doing something wrong? Can you please provide more tips would appreciate it. Sorry for asking so many, but I don't have really much experience in that. Really trying my best. Anyway got same 400 http error in node.js\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}