{
    "title": "Static analisys of smali source code via smalisca",
    "link": "https://reverseengineering.stackexchange.com/questions/32919/static-analisys-of-smali-source-code-via-smalisca",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to make some changes to an android app and to do so i decided to use smalisca to understand the code flow via graph, a function of said tool, but i can't make it work!\n </p>\n <p>\n  I used a blackarch linux OVA since it comes preinstalled but everytime i try to analize an apk smali code extracted via apktool the sqlite DB created is empty (fixed size of 49152 byte but the tables are devoid of any data).\n </p>\n <p>\n  Trying to search for any pattern is pointless since the tool always return \"no result\"\n </p>\n <p>\n  Below i show the instructions i use:\n </p>\n <ol>\n  <li>\n   <code>\n    smalisca parser -l /root/gmail/smali -s smali -f sqlite -o apk.sqlite\n   </code>\n   using either\n   <code>\n    /root/gmail/smali\n   </code>\n   or\n   <code>\n    /root/gmail\n   </code>\n   doesn't change the output neither\n  </li>\n  <li>\n   <code>\n    smalisca analyzer -i /root/apk.sqlite -f sqlite\n   </code>\n  </li>\n  <li>\n   <code>\n    sc -c class_name -p a\n   </code>\n   (most class are named alfter alphabet letters)\n  </li>\n </ol>\n <p>\n  The tool didn't work neither when using a new apk or an old gmail apk (version 2.9.3 from apkmirror).\nSo i don't know what to do:\n </p>\n <ol>\n  <li>\n   Are my instruction correct or is there some error that impair the tool functions?\n  </li>\n  <li>\n   Is the tool too old so is unusable now? If so, what alternative are there to help understand how the application works?\n  </li>\n </ol>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "60",
    "tags": [
        "dalvik",
        "call-graph"
    ],
    "user": "Marcus34",
    "time": "Apr 26, 2024 at 1:15",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Note that\n <a href=\"https://github.com/dorneanu/smalisca\" rel=\"nofollow noreferrer\">\n  smalisca\n </a>\n has not received any update for more than 7 years. If I remember correctly during that time several new Dalvik opcodes / smali commands have been added. You can try to decompile the apk using an apktol version that was released at the time smalisca was still maintained.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Marcus34",
            "text": "<html><body><span class=\"comment-copy\">\n Tried with a comparably old apktool version but got this warning\n <code>\n  Could not decode attr value, using undecoded value instead: ns=, name=, value=0x00001001\n </code>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n For Smali analysis you don't need resources, so just disable resource decompilation (if this option is available on the old apktool version).\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}