{
    "title": "Most Effective Methods to Master Reverse Engineering",
    "link": "https://reverseengineering.stackexchange.com/questions/32970/most-effective-methods-to-master-reverse-engineering",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am excited to begin learning assembly. I intend to learn it to guarantee security assurances when writing code for cryptography. One of the skills I wish to gain are reverse engineering.\n </p>\n <p>\n  This is a way to test if I understand the disassembly of code. I came up with a technique to check if my reverse engineered code is correct.\n </p>\n <p>\n  You all heard of competitive programming websites such as LeetCode where you can submit code and an online judge checks if thr code is correct.\n </p>\n <p>\n  What I can do is download someone else's solution in a high level language such as C or Rust. I can compile that to machine code.\n </p>\n <p>\n  Next I can try reverse engineering the machine code back to the source code language and submit that solution to the online judge. If all test cases pass then I reverse engineered correctly.\n </p>\n <p>\n  Please let me know what educational flaws are in this approach.\n </p>\n <p>\n  Thanks!\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "122",
    "tags": [
        "untagged"
    ],
    "user": "T. Salim",
    "time": "May 17, 2024 at 4:03",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n your \"technique\" relies on some hypothetical \"online judge\", but where do you find one?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "T. Salim",
            "text": "<html><body><span class=\"comment-copy\">\n To be honest...I was planning on reversing LeetCode solutions back into C and submitting to LeetCode. This tests if the reversed code is correct.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}