{
    "title": "Sniff Bluetooth traffic using Fitness Tracker",
    "link": "https://reverseengineering.stackexchange.com/questions/33011/sniff-bluetooth-traffic-using-fitness-tracker",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am attempting to sniff the Bluetooth between the fitness tracker(GOJI ACTIVE GFITBK20 Activity Tracker) and the application(Goji Active) installed on the phone but I am unable to see any health information such as heart beat rate, calories, sleep, distance, sleep hours, etc from the Bluetooth traffic generated from the Android Phone using Wireshark.\n </p>\n <p>\n  I enabled the Developer option on the phone and enable \"Enable Bluetooth HCI snoop log\" to gather Bluetooth logs.\n </p>\n <ol>\n  <li>\n   I disable Bluetooth and enable Bluetooth from the phone.\n  </li>\n  <li>\n   I run the Fitness Tracker App and run it.\n  </li>\n  <li>\n   I then connect the Android phone to the Laptop and run adb to generate bugreport using the command, adb bugreport bluetooth\n  </li>\n  <li>\n   I use Wireshark to analyze the logs, btsnoop_hci.log.\n  </li>\n </ol>\n <p>\n  I have attached the Bluetooth logs via Wireshark and unable to look for information relating to health information transmitted. Is it encrypted or decrypted? How do we determine this?\n </p>\n <p>\n  Please kindly advise and assist.\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/DCxRvA4E.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"Bluetooth\" src=\"https://i.sstatic.net/DCxRvA4E.png\"/>\n  </a>\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "112",
    "tags": [
        "encryption",
        "android",
        "wireshark",
        "sniffing",
        "bluetooth"
    ],
    "user": "user309729",
    "time": "Jun 6, 2024 at 17:07",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You have the app, therefore if you want to know the data format of the packets decompile the app. For standard Java/Kotlin apps\n  <a href=\"https://github.com/skylot/jadx\" rel=\"nofollow noreferrer\">\n   Jadx-GUI\n  </a>\n  is an easy start. If Xamarin/MAUI is used it is getting more complicated, and even worse if react native is used. You have to see is and which framework is used in your app.\n </p>\n <p>\n  The HCI snoop log is a good start, but personally I prefer a rooted device and some\n  <a href=\"https://frida.re\" rel=\"nofollow noreferrer\">\n   Frida\n  </a>\n  hooks like\n  <a href=\"https://github.com/optiv/blemon\" rel=\"nofollow noreferrer\">\n   blemon\n  </a>\n  to capture Bluetooth traffic. In combination with the knowledge from decompiling you can extend the frida script with own hooks to see the data before it is encoded into the BLE packets.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Robert",
            "time": "Jun 7, 2024 at 7:00",
            "is_accepted": false,
            "comments": []
        }
    ]
}