{
    "title": "How to make a program start in Tray with reverse engineering?",
    "link": "https://reverseengineering.stackexchange.com/questions/33021/how-to-make-a-program-start-in-tray-with-reverse-engineering",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The icon is already displayed in Tray. So maybe to block appearing the window only for launch. Or some nicer approach like switching launch parameters in exe (not available in the program settings).\n </p>\n <p>\n  Please help.\n </p>\n <p>\n  I am interested in reverse engineering, maybe in system ways in Windows (it looks like no working ways, that is why I ask about reverse), but not in programs to do this.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "54",
    "tags": [
        "windows"
    ],
    "user": "oleedd",
    "time": "Jun 10, 2024 at 9:19",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n If I remember correctly you are searching for a window creation using the flag\n <code>\n  WS_EX_APPWINDOW\n </code>\n (0x40000). It can be e.g. supplied as dwExStyle paramater for various create windows functions.\n <a href=\"https://stackoverflow.com/q/33538264/150978\">\n  stackoverflow.com/q/33538264/150978\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "oleedd",
            "text": "<html><body><span class=\"comment-copy\">\n @Robert I don't know what to do. I need an example with steps. You can try with any program for answer.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Based on your question and comment it seems that you want to learn reverse engineering but have not yet much experience. I am sorry but I can not provide a tutorial here, building something like this requires multiple hours. Therefore I would recommend to you to start from the other side, create a small C/C++ program that opens a window including task bar item. Then open it in Ghidra /or what else you use for reversing) and search for the relevant calls and learn to modify it.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "oleedd",
            "text": "<html><body><span class=\"comment-copy\">\n @Robert Why multiple hours? You said to find the window creation. So I need help with this. As I know, it is not hard. Maybe there is a more short way than trying \"various create windows functions\" in searching. Maybe I can directly search for \"dwExStyle\"?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n Because I don't make such post without testing everything on my own. The simple versions I have already described in my previous comments. Depending on your windows programming skills that should have been already enough to give you a starting point.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}