{
    "title": "Going from NAND dump to firmware update package",
    "link": "https://reverseengineering.stackexchange.com/questions/33145/going-from-nand-dump-to-firmware-update-package",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I.... Have no idea what I'm doing.\n </p>\n <p>\n  So, I did a full NAND dump of an Actions ATJ2257 based MP4 player (url:\n  <a href=\"https://archive.org/details/eclipse-t-2810-c.-7z\" rel=\"nofollow noreferrer\">\n   https://archive.org/details/eclipse-t-2810-c.-7z\n  </a>\n  ) and I want to recreate the \".fw\" file that's used to flash the software on these things.\n </p>\n <p>\n  Now, both the device's firmware and user data space is stored on the same NAND chip (very common, not surprising), but I can't figure out exactly where the user data and firmware partitions are separated.\n </p>\n <p>\n  Infact, I don't even know HOW stuff is physically organized on a NAND chip! I figured just\n  <em>\n   zeroing the device out using DD\n  </em>\n  would wipe the user partition out, but NO! The thing just, left most of the old data on the chip, and hid it away from the USB side of things. WEIRD.\n </p>\n <p>\n  So I ended up putting a text file on the player that just contained \"Stalin did nothing wrong.\" repeatedly to fill the device's storage up, but even then, it seems like the firmware isn't neatly packaged into one place, but instead somehow.... Interleaved with the user data partition? I don't know.\n </p>\n <p>\n  I DO know wear leveling is a thing, and that NAND flash controllers will shuffle pages around in the process, but I don't know how to \"get around it\".\n </p>\n <p>\n  I'm primarily analyzing the dump without the \"spare\" (ECC/Out of Band?) data.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "33",
    "tags": [
        "binary-analysis",
        "firmware-analysis",
        "flash",
        "dump"
    ],
    "user": "qwerty keyboard",
    "time": "Aug 7, 2024 at 2:54",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n IMHO the questionable political text you used for filling up the flash is of no concern here and thus should be removed from the question.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "qwerty keyboard",
            "text": "<html><body><span class=\"comment-copy\">\n It's just some dummy text I used to fill the storage up.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}