{
    "title": "What does \"overlap with smaller symbols\" mean?",
    "link": "https://reverseengineering.stackexchange.com/questions/33201/what-does-overlap-with-smaller-symbols-mean",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Ghidra shows in my decompile window the following warning at the top:\n </p>\n <pre><code>/* WARNING: Globals starting with '_' overlap smaller symbols at the same address */\n</code></pre>\n <p>\n  When looking at my decompilation I notice that sometimes there is an underscore and sometimes there is none:\n </p>\n <pre><code>void UndefinedFunction_00000014(void)\n{\n_DAT_fffffa00 = 0x63cd;\n_DAT_fffffa04 = _DAT_fffffa04 | 0x4000;\nDAT_fffffa17 = 0xf7\n...\n</code></pre>\n <p>\n  (It seems that only word addresses are having an underscore, not byte addresses.)\n </p>\n <p>\n  The warning tells that \"smaller symbols\" are overlapped, so I checked the Symbol Table. It is empty. I also checked the Memory Map, but there is nothing defined for that address range. And I also checked the labels, but there are no labels defined at all.\n </p>\n <p>\n  So why do I receive this warning? What does it refer to? And why do some of my assignments start with an underscore while some don't?\n </p>\n <p>\n  In case that there is no added value in that, how can I unify it?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "58",
    "tags": [
        "ghidra",
        "symbols"
    ],
    "user": "Steffen Hausinger",
    "time": "Sep 3, 2024 at 19:42",
    "comments": [
        {
            "user": "Robert",
            "text": "<html><body><span class=\"comment-copy\">\n My interpretation is this: if you have for example a 16 byte global memory block (e.g. a struct) at 0xfffff000 and there is a symbol at 0xfffff008 then the symbol and the struct overlap. May be the struct or the symbol do not really exist (misinterpretation of something) or they do not exist at the same time.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}