{
    "title": "Firmware dumping a PIC16C71 microcontroller",
    "link": "https://reverseengineering.stackexchange.com/questions/33225/firmware-dumping-a-pic16c71-microcontroller",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  What's the cheapest, easiest way to dump the program rom from a PIC16C71?\n </p>\n <p>\n  I'd use my XGecu T48, but that thing doesn't dump PIC16c microcontrollers correctly. At all. (Minipro under linux does the same garbage as the Windows utility, XGecu support hasn't responded, and their forum has a broken account setup process. Tried updating both the program and device too. No change.)\n </p>\n <p>\n  Is there a quick Arduino sketch out there that supports the old \"CMOS\" chips? Or some sort of parallel port project that supports the same chip? (NOPPP is.... Eh? That homebrew DOS program doesn't inspire confidence.)\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "67",
    "tags": [
        "dumping"
    ],
    "user": "qwerty keyboard",
    "time": "Sep 14, 2024 at 23:53",
    "comments": [
        {
            "user": "the busybee",
            "text": "<html><body><span class=\"comment-copy\">\n Are you aware of code protection? Are you sure that the device is not code protected? Is the PIC16C71 supported by the tools you have? If you know that the code is not protected against readout, and the tools know the device, what is the error you see? (Please clarify by\n <a href=\"https://reverseengineering.stackexchange.com/posts/33225/edit\">\n  edit\n </a>\n ing your question, this is not a forum.) -- It is a simple task to write your own readout tool for an Arduino, for example. I did so for a PIC10 some months ago.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "qwerty keyboard",
            "text": "<html><body><span class=\"comment-copy\">\n The Xgecu does read the contents of the pic16C71, but it only reads the least significant 8 bits of the program rom. Interestingly, the \"NOPPP\" parallel programmer I built does the same thing (Although the software only supports microcontrollers mostly similar to the 16c71).\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}