{
    "title": "Reconstructing Source Code for a scratch-built GIS system",
    "link": "https://reverseengineering.stackexchange.com/questions/33310/reconstructing-source-code-for-a-scratch-built-gis-system",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a new client who wants to move their GIS platform support to a new vendor.  The only problem is the outgoing vendor of 15 years does not want to release the source code.  My client made a mistake by outsourcing all their knowledge on their own platform.\n </p>\n <p>\n  I believe this platform is developed in Java.  I have ability to access the production systems.  I will have all permissions to read and copy files.\n </p>\n <p>\n  What options do I have to leverage my access to reconstruct the source code?  Do I need to reconstruct it?\n </p>\n <p>\n  When I take this platform over, I need to be sure that I am able to deliver CRs and ongoing support to my clients' end customers so its very important I also have full understanding of the data flows.  What tools and methodologies can I use?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "61",
    "tags": [
        "decompilation",
        "java"
    ],
    "user": "Josh",
    "time": "Dec 6, 2024 at 13:39",
    "comments": [
        {
            "user": "Thorbjørn Ravn Andersen",
            "text": "<html><body><span class=\"comment-copy\">\n You do know that this may be explicitly against the signed contract and therefore something you may want to consult with the legal department first?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Josh",
            "text": "<html><body><span class=\"comment-copy\">\n already verified with Legal that client owns the source code. They just dont have access to it due to vendor defiance\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Thorbjørn Ravn Andersen",
            "text": "<html><body><span class=\"comment-copy\">\n Sounds like a law suit right there. You may want to get there first.  Ud written in java there are plenty of decompilers.  Given you have to ask you may want to hire a consultant to do this efficiently in the first try.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Thorbjørn Ravn Andersen",
            "text": "<html><body><span class=\"comment-copy\">\n _ I believe this platform is developed in Java_ - why aren’t you certain?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}