{
    "title": "Combining a RAM snapshot and an exe in Ghidra",
    "link": "https://reverseengineering.stackexchange.com/questions/33353/combining-a-ram-snapshot-and-an-exe-in-ghidra",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have two things: (1) A .exe file, and (2) a memory snapshot of a system running that .exe file at a moment in time.\n </p>\n <p>\n  Ghidra's auto analyzer very nicely figures out the .exe file and separates it into\n  <code>\n   .text\n  </code>\n  and\n  <code>\n   .data\n  </code>\n  sections. But the\n  <code>\n   .exe\n  </code>\n  file doesn't have the memory addresses or values that were used by the system at the moment the snapshot was taken.\n </p>\n <p>\n  Can I combine these two things in a useful way with Ghidra? I'd love it if the Ghidra file for the memory snapshot knew that the\n  <code>\n   .exe\n  </code>\n  was loaded in it - it's very helpful to have the right addresses and live values.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "108",
    "tags": [
        "ghidra"
    ],
    "user": "bbayles",
    "time": "Dec 29, 2024 at 2:20",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I believe you can.\n </p>\n <p>\n  From what I remember Ghidra has a auto-analyzer process where the .exe file can be separate sections like .text and .data.\nTo make use of the memory snapshot, you’d want to map it to the .exe's sections. First, figure out where the .exe was loaded in memory (its base address) when the snapshot was taken. Then, in Ghidra, you can rebase the .text and .data sections to align with the memory addresses in the snapshot.(i believe this last sentence is possible i cant remember tho...)\n </p>\n <p>\n  Once its done, Ghidra will let you analyze the live values from the snapshot alongside the symbols and code from the .exe. This should give you a much clearer picture of how the executable was functioning at the time of the snapshot.\" (hope this helps!)\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "bllry",
            "time": "Jan 1 at 6:57",
            "is_accepted": false,
            "comments": [
                {
                    "user": "hippietrail",
                    "text": "<span class=\"comment-copy\">I believe you use \"file/add to program\" to get two files into a single address space. There are two ways to \"reposition\" a memory block and I don't yet understand the difference. One has a four-way arrow icon and says \"Move a block to another address\" and the other has a house icon and says \"Set image base\". For some file formats you can specify a load address at load time, but not for Windows PE. But maybe however OP is loading the memory snapshot has such an option?</span>",
                    "time": null
                },
                {
                    "user": "bbayles",
                    "text": "<span class=\"comment-copy\">Thanks - this is exactly the process I want to automate. The part where I manually relocate each section is what I'm trying to avoid.</span>",
                    "time": null
                },
                {
                    "user": "Nalan PandiKumar",
                    "text": "<span class=\"comment-copy\">There are two types of loading the executables into ram. One method is using absolute addressing, in this method the exe file which about load into the ram, contains all the addresses of the segments hardcoded in the binary file itself  and in each execution, os load it into same address es , other method is relative addressing, in this method the binary file only contains offsets calculated relative to the <code>instruction pointer</code> this type binary is called <code>PIE</code>.</span>",
                    "time": null
                },
                {
                    "user": "Nalan PandiKumar",
                    "text": "<span class=\"comment-copy\">The os can also load the binary anywhere in ram. It can also change the base address of the segments with the help of <code>ASLR</code> to make hard to predict the memory layout at runtime in between different executions.</span>",
                    "time": null
                }
            ]
        }
    ]
}