{
    "title": "Change default Chinese fonts into Kaiti in Android: What and where to add or replace?",
    "link": "https://reverseengineering.stackexchange.com/questions/33377/change-default-chinese-fonts-into-kaiti-in-android-what-and-where-to-add-or-rep",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have been dreaming to change the fonts within my favorite Chinese learning app to be changed into Kaiti, since it's the best font for Chinese characters to learn. (It's like comparing TeX with .docx to me, if that's even relevant). Alas, the app I'm using is not currently developed anymore since more than 2 years ago. I have requested to the developer to consider replacing the boring plain font and haven't been answered yet.\n </p>\n <p>\n  So I discovered that for learning and trial-error purposes, I could change, for example the font in a Chinese android app (another app, the name will be given if that's necessary). With this one, I successfully changed the font into Kaiti by replacing the \"ttf\" file with the Kaiti font file that I got online. However not all apps are the same. For instance, some apps have\n  <em>\n   assets\n  </em>\n  or\n  <em>\n   res\n  </em>\n  folders that contains the\n  <em>\n   ttf\n  </em>\n  file, but sadly some not. I used chatGPT to do this problem and it suggested me to make a\n  <em>\n   font\n  </em>\n  folder myself and fill it in with the Kaiti font.\n </p>\n <p>\n  However it seems like it's not enough since I don't know whether the developer defines the textViewer globally or not, or using smali. So, assumming this app I want to reverse engineer doesn't have\n  <em>\n   ttf\n  </em>\n  for the fragment of textView stored somewhere, hidden? (I don't know). My question is, what to add? And what to replace? Also where? And what's the prompt? The only trick I know that sometimes does the job is doing something like\n </p>\n <pre><code>android:fontFamily=\"@font/my_custom_font\"/\n</code></pre>\n <p>\n  But it didn't change anything. It turned out, I found the font folder that says\n  <code>\n   roboto_medium_numbers.ttf\n  </code>\n  , however I'm not sure which font it is. Could be the header or for the button, etc.\n </p>\n <p>\n  If it's in smali, I was suggested to try looking up for something like\n </p>\n <pre><code>TextView;->setTypeface\n</code></pre>\n <p>\n  However, again, what to add? What's the prompt? I honestly have zero foundation knowledge of reverse engineering or even smali (familiar with it). If it's relevant,  My device isn't rooted and not having any intentions to do so. I'm doing it using Apktool/MT Manager. But if you have a way to it using Android Studio, please do tell me how to. Thanks in advance.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "98",
    "tags": [
        "android"
    ],
    "user": "user516076",
    "time": "Feb 11 at 16:37",
    "comments": [
        {
            "user": "Morrison Chang",
            "text": "<html><body><span class=\"comment-copy\">\n 1) Its easier to modify an open-source app than to reverse engineer. 2)\n <code>\n  roboto\n </code>\n covers a number of open-source Android fonts. The idea of replacing a\n <code>\n  .ttf\n </code>\n file is one approach but assumes that the app holds its own font files rather than use the system ones. If it does use its own font files, say\n <code>\n  xyz.ttf\n </code>\n you can rename your prefered font file to that and see if it works. If app uses the system fonts you are really need to hack the smali to get it to even load the correct font.\n <a href=\"https://android.stackexchange.com/q/247123/3573\">\n  You'll need root to change the system font files\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Morrison Chang",
            "text": "<html><body><span class=\"comment-copy\">\n The basic problem is that for an Android developer adding a custom font takes work as seen by\n <a href=\"https://stackoverflow.com/q/39531157/295004\">\n  Custom Font for an Android App\n </a>\n and\n <a href=\"https://stackoverflow.com/q/8787690/295004\">\n  Adding custom Font to Theme in Android\n </a>\n , so what you are trying to do the same thing but in smali. Good luck.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}