{
    "title": "Renaming ordinal exported functions in a multi file ghidra project",
    "link": "https://reverseengineering.stackexchange.com/questions/33370/renaming-ordinal-exported-functions-in-a-multi-file-ghidra-project",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm analyzing multiple files in a single ghidra project. There are a few DLLs that only export via ordinal. I would like to be able to rename the exported functions as I identify what they do, to make it easier to see what is going on in other locations that call these functions. This works fine within a single DLL, but seems to break external program name references across the file boundary.\n </p>\n <p>\n  I created a MWE that creates these conditions at\n  <a href=\"https://github.com/balloon-bin/ordinal-mwe\" rel=\"nofollow noreferrer\">\n   https://github.com/balloon-bin/ordinal-mwe\n  </a>\n  . Running\n  <code>\n   make\n  </code>\n  builds the example if you have the\n  <code>\n   x86_64-w64-mingw32\n  </code>\n  toolchain, but the binaries are included too.\n </p>\n <p>\n  This is my approach so far:\n </p>\n <ol>\n  <li>\n   create a ghidra project and import all files into it\n  </li>\n  <li>\n   Set all external program name associations for DLL files in window->external programs.\n  </li>\n  <li>\n   At this point you can right click imported functions and \"go to external location\" to follow the function call into the dll where it is defined.\n  </li>\n  <li>\n   When the function has been identified it is renamed (pressing L on the symbol)\n  </li>\n  <li>\n   Now the external name association is broken and you can no longer go to external function\n  </li>\n </ol>\n <p>\n  Is there a way to achieve a rename that is visible across all files in the project?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "31",
    "tags": [
        "windows",
        "ghidra",
        "dll"
    ],
    "user": "omicron",
    "time": "Jan 26 at 16:13",
    "comments": [],
    "answers_data": []
}