{
    "title": "How to format data exported from BinDiff?",
    "link": "https://reverseengineering.stackexchange.com/questions/3373/how-to-format-data-exported-from-bindiff",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am using BinDiff 4.0 as a plug-in for IDA Pro 6.5. I know that it is possible to save the results as a\n  <code>\n   .BinDiff\n  </code>\n  file, however is there a way I can format this into a more easily accessible file type? I have been searching for a solution for several days and so far the two best solutions I have discovered are to:\n </p>\n <ol>\n  <li>\n   <p>\n    Copy and paste the matched functions window (this is simply too inefficient for what I am looking for).\n   </p>\n  </li>\n  <li>\n   <p>\n    Export the data as a\n    <code>\n     .BinDiff\n    </code>\n    and then access through an SQL database manager and try to export from there. However it seems to change the data to incorrect values and not what I am looking for. (I want the exact information from the matched functions window).\n   </p>\n  </li>\n </ol>\n <p>\n  <strong>\n   Additional Information\n  </strong>\n  : I know that BinDiff 3.x had a\n  <code>\n   save_to_log\n  </code>\n  function which (I think) did what I am looking for, and saves the information in the matched function window to a\n  <code>\n   .txt\n  </code>\n  file. I have tried contacting both Zynamics support, and Google/Zynamics support with no reply.\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ida",
        "ida-plugin",
        "tool-bindiff"
    ],
    "user": "user3119546",
    "time": "Oct 11, 2016 at 13:17",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am not sure if a separate email got lost somewhere, but the .BinDiff file that BinDiff saves is in fact a sqlite3 database -- so the easiest way to get the\nresults would be to use sqlite to dump the results.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "0xC0000022L",
            "time": "Jan 9, 2014 at 17:17",
            "is_accepted": false,
            "comments": []
        }
    ]
}