{
    "title": "Do you have tips analyzing reported PoC(exploit) files?",
    "link": "https://reverseengineering.stackexchange.com/questions/3471/do-you-have-tips-analyzing-reported-pocexploit-files",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  My daily job is analyzing reported proof of concept files that exploits document viewers. People who report vulnerabilities in document viewers just give me the PoC and vulnerable version number. They usually fuzz stuff and find offset that leads to stack overflows etc. Which means they do not give me info about the root cause of the vuln. So only with the vulnerable binary and the PoC, I need to analyze following things:\n </p>\n <ol>\n  <li>\n   <p>\n    Does the PoC actually work?\n   </p>\n  </li>\n  <li>\n   <p>\n    In which part of the binary is vulnerable? (ex. no argument checking in function A ... blah blah; I need to know this because I have to contact the vendor to fix the vuln)\n   </p>\n  </li>\n </ol>\n <p>\n  I am new to this field and currently this is how I do it(I analyze in XP).\n </p>\n <ol>\n  <li>\n   <p>\n    Run the PoC\n   </p>\n  </li>\n  <li>\n   <p>\n    look at the call stack when there is a exception->follow them\n   </p>\n  </li>\n  <li>\n   <p>\n    Check whether SEH is corrupted -> set breakpoint on the corrupted SEH to find the instruction that overflows the stack\n   </p>\n  </li>\n </ol>\n <p>\n  By playing around I can find the assembly instruction that triggers the exploit. However, it is hard to backtrack all the way to the root cause. Assembly instruction that overflows is usually in the library but the vuln is not the library, it is the user program that maliciously called the library right?\n </p>\n <p>\n  I don't know if I made my point clear but need some tips doing this kind of reverse engineering.\n </p>\n</div>\n</body></html>",
    "votes": "5",
    "answers": 1,
    "views": "350",
    "tags": [
        "exploit",
        "vulnerability-analysis",
        "seh"
    ],
    "user": "Jaewon Min",
    "time": "Jan 16, 2014 at 22:20",
    "comments": [
        {
            "user": "Dominik Antal",
            "text": "<html><body><span class=\"comment-copy\">\n I'ld use memory/hardware breakpoints, or look for repeating patterns in the buffer values, to track back to the root problem. Btw in the POC code you see how the value is inputted, so you should be able to determine where to look from that.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Jaewon Min",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks for the reply. I should make one thing clear, POC is a document file( ex .doc files) so there is no code that inputs value :( I just open it inside the viewer\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<html><body><span class=\"comment-copy\">\n Don't assume that a working exploit will always cause an exception to be thrown :)\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  First, your platform is very important ( mine is Windows )\n </p>\n <p>\n  In Windows WinDbg +\n  <code>\n   !exploitable\n  </code>\n  is one of fast analyze options.\nit is\n  <a href=\"http://msecdbg.codeplex.com/\" rel=\"nofollow\">\n   here\n  </a>\n </p>\n <p>\n  Additionally I use WinDbg +\n  <code>\n   !analyze\n  </code>\n  to determine standard name of bug...\nit is default WinDbg extension.\n </p>\n <p>\n  Finally, as the nature of bugs is unknown (in your case) it is not an easy way to detect root cause.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "0xC0000022L",
            "time": "May 7, 2014 at 10:23",
            "is_accepted": true,
            "comments": []
        }
    ]
}