{
    "title": "Rename classes and packages in a jar file",
    "link": "https://reverseengineering.stackexchange.com/questions/3779/rename-classes-and-packages-in-a-jar-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have an obfuscated jar file I'm trying to decompile and get into an eclipse project. I can easily view the \"source\" using a tool like jd-gui but I cant save it because the filenames are too long. I need some sort of tool that can rename the calss name and all instances of that class inside the jar file. I wrote a program to extract all of the files from the jar that renames them to class_1, class_2 ect and save the original name along with the new name in a file. I  planned to just do a replace all to rename the instances inside the java files but it wont work because I didn't take packages into account. Also a lot of the classes are named with keywords like super or return which seems to work fine in the .class files but most IDEs get confused by it and throw errors all over the place. Altogether I have 1680 class files and most look like this:\n </p>\n <p>\n  <img alt=\"Obfuscated filenames\" src=\"https://i.sstatic.net/dg9NY.png\"/>\n </p>\n <p>\n  If anyone can recommend any tools ar methods that will allow me to rename these or at least extract the archive I would appreciate it.\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "3k",
    "tags": [
        "java",
        "deobfuscation",
        "jar"
    ],
    "user": "Ephyxia",
    "time": "Mar 3, 2014 at 18:30",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The Krakatau decompiler will automatically rename the output files to valid filenames if the original class name doesn't correspond to a valid filename.\n </p>\n <p>\n  Note that the original names will still be preserved inside the generated files. As for renaming inside the actual source files, I wrote a script to do that (along with various other deobfuscation scripts) but I haven't publicly released it for various reasons. If you send me the jar I can try to deobfuscate it for you though.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Antimony",
            "time": "Mar 3, 2014 at 20:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ephyxia",
                    "text": "<span class=\"comment-copy\">I tried the krakatau decompiler and it would give a lot of error during the decompilation and would only get through the first few files.</span>",
                    "time": null
                },
                {
                    "user": "Antimony",
                    "text": "<span class=\"comment-copy\">@Ephyxia Could you please open a bug on Github with the exact error message and jar you are trying to decompile?</span>",
                    "time": null
                },
                {
                    "user": "Ephyxia",
                    "text": "<span class=\"comment-copy\">It tells me the file cant be found. I think its because of the folders that have long names. Some of the files with long names are extracted but only from regular folders.</span>",
                    "time": null
                },
                {
                    "user": "Antimony",
                    "text": "<span class=\"comment-copy\">@Ephyxia please post an issue on Github with the exact commands and directory structure you're using.</span>",
                    "time": null
                }
            ]
        }
    ]
}