{
    "title": "Reversing a synchronisation cable between LED displays",
    "link": "https://reverseengineering.stackexchange.com/questions/3821/reversing-a-synchronisation-cable-between-led-displays",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have two LED Call queuing displays. I don't know what is the english name for this but is LED display that you can increment one and people take paper ticket, used for counters, it looks something like this:\n </p>\n <p>\n  <img alt=\"LED Call queuing display\" src=\"https://i.sstatic.net/P4qus.jpg\"/>\n </p>\n <p>\n  The two displays are connected with a RJ11/14 cable that sincronizes the information between them. I want to place a Arduino between them to get the current value in the display. I suspect the information between is passed using something like a serial connection (\n  <a href=\"http://arduino.sundh.com/2012/01/arduino-ethernet-shield-hooked-up-to-led-message-display/\" rel=\"nofollow noreferrer\">\n   mostly because posts like this\n  </a>\n  ), however it may only send a\n  <em>\n   tick\n  </em>\n  event to the other board. I can't find a brand in the display, neither any documentation. What I would like to know is how should I try to reverse the RJ11 pinout.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "109",
    "tags": [
        "hardware"
    ],
    "user": "Artur Ventura",
    "time": "Mar 7, 2014 at 19:11",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The place to start would be to characterize the electrical signal.  Using an oscilloscope, you can determine:\n </p>\n <ul>\n  <li>\n   what voltages are used?\n  </li>\n  <li>\n   assuming it's digital, are there more than two levels?\n  </li>\n  <li>\n   what are the shortest duration signals?\n  </li>\n  <li>\n   what seems to be the voltage level when there is no traffic?\n  </li>\n  <li>\n   which end is driving which line? (Hint: unplug one end and check voltages)\n  </li>\n </ul>\n <p>\n  After you have the electrical parameters, you can build a circuit to interface the signal(s) to your Arduino.  The simplest would be to simply connect signal and ground to appropriate lines on the Arduino, but you might need to incorporate level converters or buffers.\n </p>\n <p>\n  Once you have access to the digital signal, you can start to work on the protocol details.  At the datalink layer, some questions are:\n </p>\n <ul>\n  <li>\n   what is the size of the frame?\n  </li>\n  <li>\n   is there an identifiable header?\n  </li>\n  <li>\n   is there a length field?\n  </li>\n  <li>\n   is there a CRC or checksum?\n  </li>\n  <li>\n   can the protocol be identified as some well-known protocol?\n  </li>\n  <li>\n   can you correlate messages with external stimuli?\n  </li>\n  <li>\n   is the protocol bidirectional or unidirectional?\n  </li>\n </ul>\n <p>\n  Once you have captured a number of frames as data on a computer, you can use a number of different kinds of approaches to determine the protocol details  I find it useful to experiment with the frames in an interactive Python session to quickly test ideas. Another promising tool for that would be an open source tool called\n  <a href=\"http://www.netzob.org/\" rel=\"nofollow\">\n   Netzob\n  </a>\n  .\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Edward",
            "time": "Mar 24, 2014 at 12:56",
            "is_accepted": false,
            "comments": []
        }
    ]
}