{
    "title": "Ollydbg and hundreds of events under QT GUI",
    "link": "https://reverseengineering.stackexchange.com/questions/3828/ollydbg-and-hundreds-of-events-under-qt-gui",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to debug an application that uses QT GUI library. The problem is that I can't even start debugging as ollydbg seems to be processing ~1k events per second where in stack trace I see all of them running inside QT. The application has very fancy GUI (blending, custom window and buttons etc) and perhaps that is what hangs the debugger as it tries to process all this. Eventually it bluescreens. Can I somehow force olly to skip or ignore these events?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "1k",
    "tags": [
        "ollydbg"
    ],
    "user": "Mike",
    "time": "Mar 8, 2014 at 4:58",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<html><body><span class=\"comment-copy\">\n It bluescreens?? Could you post the crashdump?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Mike",
            "text": "<html><body><span class=\"comment-copy\">\n It's weird. I tried to open memory.dmp in BlueScreenView (freeware) and it shows nothing. No raw data, no drivers. Just basic information like termination string (CRITICAL_OBJECT_TERMINATION) bug check code and size. Is it possible that dumps are corrupted?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "<html><body><span class=\"comment-copy\">\n WinDbg is the preferred way to review a crashdump.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Mike",
            "text": "<html><body><span class=\"comment-copy\">\n Alright. If the application happens to crash the system, it might use some rootkit to prevent memory analysis and whatnot. Anyway, I tried with different QT application and result is the same (yet, perhaps it's not QT fault but coincidence). 100-400 events per second and I can't use the application since it's \"stuck\" (I can't even maximize it or open popup menu -- when right clicking the icon on task bar).\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Mike",
            "text": "<html><body><span class=\"comment-copy\">\n Perhaps some extensive applications really do process lot of events, even in the background. How can I debug such applications? This is what the stack trace shows (it hits new events all the time, very quickly)\n <a href=\"http://cap.ring0.cc/c7234a2d45e076d62aecf28a74e95c29.png\" rel=\"nofollow noreferrer\">\n  cap.ring0.cc/c7234a2d45e076d62aecf28a74e95c29.png\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}