{
    "title": "How does Kernel Detective check if API functions are hooked?",
    "link": "https://reverseengineering.stackexchange.com/questions/3882/how-does-kernel-detective-check-if-api-functions-are-hooked",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  One of the many features of Kernel Detective is the possibility to retrieve the original addresses of the native apis functions implemented in the driver win32k.sys and checking if they are hooked. What are the possible ways to achieve the same ?\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 2,
    "views": "1k",
    "tags": [
        "kernel-mode"
    ],
    "user": "user4170",
    "time": "Mar 16, 2014 at 10:57",
    "comments": [
        {
            "user": "Dominik Antal",
            "text": "<html><body><span class=\"comment-copy\">\n You might be also interested in HookShark. I know this is not the place for guessing, but I think it works the same. \"It scans through the code-section of every loaded module of each running process and compares it with the file-image\"\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  For conventional inline hooks (that just replace the first few bytes of the function), you can simply read the first few bytes of each function to check if it is hooked. Deeper inline hooks will be difficult to detect.\n </p>\n <p>\n  Apart from inline hooks, someone may also hook the SSDT. The SSDT is a table that sits between syscalls from WINAPI's and the kernelmode functions that implement them. The SSDT is indexed by syscall ID and maps each ID to the address of the kernelmode function. This mapping\n  <a href=\"http://j00ru.vexillium.org/ntapi/\" rel=\"nofollow noreferrer\">\n   remains static\n  </a>\n  for any given service pack for a Windows OS. So it is very easy to figure out what function each syscall ID corresponds to, and thus what function each entry in the SSDT should correspond to.\n </p>\n <p>\n  To detect SSDT hooks and restore original addresses, you could try any of the following:\n </p>\n <p>\n  You could load your program/driver once before the SSDT is hooked, and grab the original addresses. This would be fairly reliable, as long as you load your driver before the hook is in place.\n </p>\n <p>\n  Alternatively, you could download the .pdb file from Microsoft's symbol store and get the original addresses from it using the DIA SDK or DbgHelp API's. This is very reliable as long as a connection is present and nothing is interfering with it. However, this would be quite slow for a .pdb as big as the one for ntoskrnl or win32k.\n </p>\n <p>\n  There are actually two SSDT's, a regular SSDT and a Shadow SSDT. If only the first SSDT is hooked, you could check the values with those in the Shadow SSDT. Or vice versa.\n </p>\n <p>\n  You can check if any entries in the SSDT point to addresses outside the kernel/win32k. This is a very reliable way of detecting the hooks, but it won't easily get you the original address.\n </p>\n <p>\n  Scanning for a byte signature is a somewhat reliable and stealthy way you could locate the original addresses.\n </p>\n <p>\n  There's also a similar question\n  <a href=\"https://reverseengineering.stackexchange.com/questions/1461/is-there-an-easy-way-to-detect-if-the-ssdt-has-been-patched-from-a-memory-dump\">\n   here\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": [
                {
                    "user": "ivan_pozdeev",
                    "text": "<span class=\"comment-copy\">An alternative way to read the original SSDT entries is from the kernel image on disk. It's a PE file, and <code>KeServiceDescriptorTable</code> is an exported entry.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I think you should read from original file (exe, dll) of exported API function and compare with the data in the loading memory. To avoid the fake result in which the read API functions are also hooked, you should use some tricks to get the original read API function from memory.\n </p>\n <p>\n  Hope this help!\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "tuantm",
            "time": "Jun 9, 2014 at 1:44",
            "is_accepted": false,
            "comments": []
        }
    ]
}