{
    "title": "System for reverse engineering RF signals",
    "link": "https://reverseengineering.stackexchange.com/questions/3953/system-for-reverse-engineering-rf-signals",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Lately I've been experimenting with\n  <a href=\"https://en.wikipedia.org/wiki/Software-defined_radio\" rel=\"nofollow\">\n   software-defined radio\n  </a>\n  (SDR) and have come up with some heuristics by which I can visually identify certain kinds of signals by looking at their representation on a waterfall diagram.  Certain obvious characteristics such as frequency and bandwidth can be measured, but how might one systematically go about determining such things as modulation and channel coding?\n </p>\n <p>\n  All of the books and papers I've read describe the process of transmitting or receiving a known signal, but none that talk about the identification and decoding of unknown signals. Is there a system or method? Are there papers, books or other documents that describe this?\n </p>\n <p>\n  <strong>\n   Edit:\n  </strong>\n  Perhaps it wasn't clear enough from the original question, but what I'm looking for are techniques (read\n  <em>\n   automatable\n  </em>\n  techniques) that might be used to classify and demodulate an unknown signal that is received over the air. For example, by what method might one automate a method that would reliably identify\n  <a href=\"https://en.wikipedia.org/wiki/Quadrature_amplitude_modulation\" rel=\"nofollow\">\n   16QAM\n  </a>\n  modulation?\n </p>\n</div>\n</body></html>",
    "votes": "7",
    "answers": 4,
    "views": "5k",
    "tags": [
        "radio-interception",
        "gnu-radio"
    ],
    "user": "Edward",
    "time": "Mar 26, 2014 at 1:52",
    "comments": [
        {
            "user": "Adam Davis",
            "text": "<html><body><span class=\"comment-copy\">\n This answer has some useful resources for using visual identification on waterfall displays.  Perhaps looking at those will help you find a method that might meet your needs:\n <a href=\"http://ham.stackexchange.com/a/1045/9\">\n  ham.stackexchange.com/a/1045/9\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  As atdre suggested, you might want to check on and learn how usual, known, modulations function. That way you'll usually be able to at least figure out what kind of modulation is in question. In most cases it will turn out to be some known modulation. Read on how AFSK or POCSAG work for example.\n </p>\n <p>\n  Carl Weisman did a series of introductory lessons on RF and wireless communication:\n  <a href=\"http://www.slideshare.net/cjweisman/introduction-to-rf-wireless-part-1\" rel=\"nofollow noreferrer\">\n   Part 1\n  </a>\n  ,\n  <a href=\"http://www.slideshare.net/cjweisman/introduction-to-rf-wireless-part-2\" rel=\"nofollow noreferrer\">\n   Part 2\n  </a>\n  ,\n  <a href=\"http://www.slideshare.net/cjweisman/introduction-to-rf-wireless-part-3\" rel=\"nofollow noreferrer\">\n   Part 3\n  </a>\n  ,\n  <a href=\"http://www.slideshare.net/cjweisman/introduction-to-rf-wireless-part-4\" rel=\"nofollow noreferrer\">\n   Part 4\n  </a>\n  .\nThe lessons cover different types of modulation.\n </p>\n <p>\n  Also , passing the signal trough a few known demodulators can sometimes yeild results.\n  <a href=\"http://eliasoenal.com/2012/05/24/multimonng/\" rel=\"nofollow noreferrer\">\n   Multimon-ng\n  </a>\n  is a handy tool.\n </p>\n <p>\n  <a href=\"https://twitter.com/windyoona\" rel=\"nofollow noreferrer\">\n   Oona\n  </a>\n  recently wrote an interesting blog post about reversing an unknown\n  <a href=\"http://www.windytan.com/2014/02/mystery-signal-from-helicopter.html\" rel=\"nofollow noreferrer\">\n   signal from a helicopter\n  </a>\n  video so you might find some hints there too.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "0xea",
            "time": "Mar 25, 2014 at 17:35",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you can't access the modulation specifics in the documentation or via FCC and patent searches, then you might want to reverse it out of the firmware or chip off.\n </p>\n <p>\n  If you can get an audio-out or oscilloscope visual of the signal, then you may be able to determine the type of modulation -- whether FSK, simple on/off keying, or another data format (especially easy to spot might be ones like POCGAG and Flex). Data will always sound like a dialed modem, and it might not be too difficult to pick out certain types of modulation just based on this sound.\n </p>\n <p>\n  The RTLSDRs, which can receive only in frequencies from 64 to 1700 MHz, with some gaps around 1100–1250 MHz -- isn't ideal to do this, but it certainly can be done with just a 20 USD device and GNU Radio Companion aka GRC (which supports two-level and four-level FSK signals out of the box, no money for additional \"add-ons\" involved). The Hak5 Youtube channel covers using RTLSDRs with GRC.\n </p>\n <p>\n  A simple alternative to SDR (besides straight hardware, but this option does require some hardware) is\n  <a href=\"http://labs.inguardians.com/posts/20131007_RfCat_Tutorial.html\" rel=\"nofollow\">\n   RFcat\n  </a>\n  . You can see a 2FSK demodulation process from that Inguardians blog post, as well as more information on how to find the information from the FCC.\n </p>\n <p>\n  However, even if you prefer SDR -- there are a few more options currently (and soon to be) available. Coming soon is the\n  <a href=\"http://www.youtube.com/watch?v=l42mZ7BDB9A&list=TLeTEHmfJzKaR8oX_2YW_NVcEPeGLVjpZr\" rel=\"nofollow\">\n   HackRF\n  </a>\n  device, which will let you transmit using GRC -- a step above the RTLSDR. Available now are the Funcube and the Ettus Research Universal Software Radio Peripherals\n  <a href=\"https://intrepidusgroup.com/insight/2011/07/usrp-101-unlocking-wireless-pc-locks-and-freeing-dolphins/\" rel=\"nofollow\">\n   (USRP), which also work with GRC\n  </a>\n  .\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "atdre",
            "time": "Mar 25, 2014 at 16:51",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Edward",
                    "text": "<span class=\"comment-copy\">While these are valid techniques, that answer doesn't really match the question. The question is about how to decode an UNKNOWN signal that is received over the air.  Disassembling the transmitter is not an option; the type, purpose, owner, manufacturer and even the location of the transmitter is generally unknown in this instance.</span>",
                    "time": null
                },
                {
                    "user": "atdre",
                    "text": "<span class=\"comment-copy\">Nah, if you know who owns the land or nearby land, this may reveal a company who owns a certain lieu of products some of which happen to use a certain RF chip that matches some known frequency range. Purpose may occasionally be revealed by band. It really depends on the situation. What is your situation?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  RF signals are composed of three possible modulations: Amplitude, Frequency, and Phase.\n </p>\n <p>\n  Once you've determined the width and center frequency of the signal, analyze the amplitude changes, if any.  Try to determine if the amplitude is periodic. Similarly, look at the frequency and phase.\n </p>\n <p>\n  Most radio systems conform to established standards, so once you've identified which modulations the signal is using, and whether they appear to be discrete or continuous, you can narrow them down to more specific possibilities.\n </p>\n <p>\n  Note that some will be very complex, and won't be easily discerned using this type of system.  GPS can't be understood this way because you're receiving signals from many satellites simultaneously, and must separate them using code division techniques.  Other new technologies such as MIMO are similarly complex, and won't easily succumb to any automated system looking at the above three modulations alone.\n </p>\n <p>\n  But it should give you a start.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Adam Davis",
            "time": "Mar 25, 2014 at 19:34",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  After reading this excellent presentation\n </p>\n <p>\n  <a href=\"http://ewh.ieee.org/r5/denver/sscs/Presentations/2012_10_Agilent2.pdf\" rel=\"nofollow noreferrer\">\n   http://ewh.ieee.org/r5/denver/sscs/Presentations/2012_10_Agilent2.pdf\n  </a>\n  ,\n </p>\n <p>\n  I have a much better understanding of where all the modes come from and that their decoding might not be so utterly complex. A lot of the apparent complexity comes from sloppy terminology, different points of view and several names for the same thing, as I read in CCC-editor where many modes use the same decoder\n </p>\n <p>\n  On the Wavecom website there is a lot of information (CCCeditor), examples and I suspect even decoders, that can be downloaded for free. From the information on the Sigmira and Sorcerer websites, and also Wavecom which appears to be no longer active, I get the idea that the various decoders are some-how or some-where available, or built into the software as modules and that they must just be activated, copied in or selected.\n </p>\n <p>\n  The Wavecom CCCeditor show a great many digital modes and the names of the decoders. Once the right decoder was selected, one only have to adjust one or two parameters, mainly baud rate, to decode the signal. Not that I know how to do this, or where to find the decoders, but it gives an idea.\n </p>\n <p>\n  Out of this will come decoded text, which may be freeform or arranged according to some protocol such as for POCSAG or ACARS and that might need further interpretation. The Constellation display and Eye-diagram can be used to determine when the right baud and other adjustments are selected.\n </p>\n <p>\n  If given the OK. I can write a page or two on how I think we can proceed from here, but I suggest that you look in great detail at the Wavecom/ Sigmira / Sorcerer approaches, do a bit of disassembly and see if one can discover the various decoders and hopefully re-use them or upgrade them.\nThem we simply need a GUI and GNURADIO could be a good starting point.\n </p>\n <p>\n  73 Henry ZS3HA\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Henry",
            "time": "Jun 22, 2017 at 7:53",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Henry",
                    "text": "<span class=\"comment-copy\">On the Wavwcom.ch  web site, downloads, there are a lot of stuff and there may even be a working decoder etc., but it we need help to explore and understand what is there and how it functions together. For 1 person, I would say there is enough work for for 2 or 3 months. Download, Try out, Read manuals, Try again - Henry</span>",
                    "time": null
                }
            ]
        }
    ]
}