{
    "title": "Disassemble communication protocol for an old device",
    "link": "https://reverseengineering.stackexchange.com/questions/4053/disassemble-communication-protocol-for-an-old-device",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have an old device connected to personal computer via specific PCI card. Device is handled with C++ control application, which is not able to run on new versions of Windows. Manufacturer of that device was consumed by big company a while ago and do not continue on development of such devices.\n </p>\n <p>\n  What I want to do is disassemble communication protocol between this device and computer, respective between the software and PCI card; however, I am complete beginner. I downloaded IDA tool. I am able to trace application and find couple of subroutines that are often trigerred when application is sending commands to the device, but these subroutines contains others etc etc. \nAlso I could not find any meaningful strings in the disassembled application (i was expecting many short string instructions with numeric parameters).\n </p>\n <p>\n  I would like to ask you for some advice, what I should do at first, or what to be careful on when I want to detect communication protocol.\n </p>\n</div>\n</body></html>",
    "votes": "8",
    "answers": 1,
    "views": "352",
    "tags": [
        "ida",
        "c++",
        "communication"
    ],
    "user": "Michal",
    "time": "Apr 10, 2014 at 13:33",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You may want to start with something simple like monitoring the API calls the controller application is doing. I'm not sure how old your Windows version is but it might be worth giving\n  <a href=\"http://www.rohitab.com/apimonitor\" rel=\"nofollow\">\n   API Monitor\n  </a>\n  a try. It gives you a good start to monitoring the application at least and you get to trivially see how it interacts with the operating system.\n </p>\n <p>\n  Essentially what you're looking for is probably\n  <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/aa363858%28v=vs.85%29.aspx\" rel=\"nofollow\">\n   CreateFile\n  </a>\n  followed by\n  <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/aa363216%28v=vs.85%29.aspx\" rel=\"nofollow\">\n   DeviceIoControl\n  </a>\n  calls which use the same handle as returned from CreateFile. This is one way for an application to interact with kernel mode software. Another option is to look for a CreateFile call followed by\n  <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/aa365467%28v=vs.85%29.aspx\" rel=\"nofollow\">\n   ReadFile\n  </a>\n  and\n  <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/aa365747%28v=vs.85%29.aspx\" rel=\"nofollow\">\n   WriteFile\n  </a>\n  which is another common way for user space applications to communicate with kernel mode drivers.\n </p>\n <p>\n  If your software is so old that we're talking Windows 9x you should probably use something like SoftICE.\n </p>\n <p>\n  Once you've figured out these things you'd need to examine the driver for the card and look for the handlers for the DeviceIoControl calls you saw before or the ReadFile, WriteFile handling. We've had a similar discussion\n  <a href=\"https://reverseengineering.stackexchange.com/questions/3955/how-to-reverse-deviceiocontrol\">\n   here\n  </a>\n  and there is a decent resource available as\n  <a href=\"http://www.reverse-engineering.info/SystemCoding/SkeletonKMD_Tutorial.htm\" rel=\"nofollow\">\n   Kernel Mode Driver Tutorial by Clandestiny\n  </a>\n  which is getting a bit long in the tooth but still applies.\n </p>\n <p>\n  This is quite a bit of work and I would strongly advice you to buy something like\n  <a href=\"http://rads.stackoverflow.com/amzn/click/1118787315\" rel=\"nofollow\">\n   Practical Reverse Engineering\n  </a>\n  , as well as\n  <a href=\"http://rads.stackoverflow.com/amzn/click/1593273851\" rel=\"nofollow\">\n   A bug hunter's diary\n  </a>\n  . They both discuss the issues of how to reverse engineer user space and kernel mode interaction. If you're very serious about this I would recommend also getting a copy of\n  <a href=\"http://rads.stackoverflow.com/amzn/click/0735648735\" rel=\"nofollow\">\n   Windows Internals, Part 1\n  </a>\n  and\n  <a href=\"http://rads.stackoverflow.com/amzn/click/073566587\" rel=\"nofollow\">\n   Windows Internals, Part 2\n  </a>\n  .\n </p>\n <p>\n  If you want to look at the actual PCI traffic, which is probably not what you want to do, I think you have to go the hardware route. There's a PCI bus analyzer available from\n  <a href=\"http://www.silicon-control.com/pci650.htm\" rel=\"nofollow\">\n   Silicon Control\n  </a>\n  , then there's the expensive solutions from the big names, LeCroy and Agilent. Although I'm not sure if they still make PCI bus analyzers anymore or if everyone has moved on to PCIe. You also have the option of breaking out the bus yourself and using an FPGA to sniff the signals. ElectroFriends has\n  <a href=\"http://electrofriends.com/articles/computer-science/protocol/introduction-to-pci-protocol/\" rel=\"nofollow\">\n   a short introduction to the PCI bus\n  </a>\n  available.\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "Peter Andersson",
            "time": "Apr 12, 2014 at 8:30",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Michal",
                    "text": "<span class=\"comment-copy\">Thank you very much for advice and suggestions. I am going to get through it. Thank you.</span>",
                    "time": null
                }
            ]
        }
    ]
}