{
    "title": "IDA PRO _data keeps getting misaligned lost bytes while scrolling down Can't find references (hint: redo analisys)",
    "link": "https://reverseengineering.stackexchange.com/questions/4092/ida-pro-data-keeps-getting-misaligned-lost-bytes-while-scrolling-down-cant-fin",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <img alt=\"image\" src=\"https://i.sstatic.net/rF0DW.png\"/>\n </p>\n <p>\n  The code of the functions is still valid but now the\n  <code>\n   _data\n  </code>\n  segment keeps losing 6 bytes everytime I fix it by pressing\n  <code>\n   G\n  </code>\n  going to\n  <code>\n   42A000\n  </code>\n  fixing what it undoes then I scroll down a bit and scroll back up and I'll notice\n  <code>\n   42A000\n  </code>\n  is completely gone when I go into Hex View I'll notice it doesn't show the 6 bytes.\n </p>\n <p>\n  Also going bit lower I noticed my string started to get lost too when I started I had a bunch more strings then I have now the first string is cut half way with a bunch of fake assembly code.\n </p>\n <p>\n  My strings keep disappearing one by one each time I work on re-factoring it.\n </p>\n <p>\n  Is there a way to re-position / move this string / constants information or maybe keep it blocked from being de-synced.\n </p>\n <p>\n  Whats the cause of it? I checked all the functions I've edited they all start and end with the same addresses as a fresh original none re-factored load of the same file.\n </p>\n <p>\n  Here's a few pictures of the problems.\n </p>\n <p>\n  There are the errors in the output that get generated as I scroll down.\n  \n\n </p>\n <p>\n  <img alt=\"0\" src=\"https://i.sstatic.net/SE1Ng.png\"/>\n </p>\n <p>\n  This is how it looks good when I use\n  <code>\n   G\n  </code>\n  +\n  <code>\n   42A000\n  </code>\n </p>\n <p>\n  <img alt=\"1\" src=\"https://i.sstatic.net/WvRoL.png\"/>\n </p>\n <p>\n  This is what happens when I scroll a full screen view away from\n  <code>\n   42A000\n  </code>\n  then come back 6 bytes are lost. I'd like to add that\n  <code>\n   align 800\n  </code>\n  I've added it only had\n  <code>\n   align 1000\n  </code>\n  but that's because there was a bunch of zero bytes there so I guess the\n  <code>\n   align\n  </code>\n  just hides em for now I'll use them if I need to later.\n </p>\n <p>\n  <img alt=\"2\" src=\"https://i.sstatic.net/inPYT.png\"/>\n </p>\n <p>\n  Here is the Hex-View after a screw up, you can see the first 6 are not in use.\n </p>\n <p>\n  <img alt=\"3\" src=\"https://i.sstatic.net/Pu3b4.png\"/>\n </p>\n <p>\n  Here you can see the first String is\n  <code>\n   Player leaving game %s',0AH, 0\n  </code>\n  which isn't even on the strings of the Hex-View above that's how much strings are lost so far.\n </p>\n <p>\n  <img alt=\"4\" src=\"https://i.sstatic.net/KKAyX.png\"/>\n </p>\n <p>\n  When you scroll down far enough then scroll back up it even makes more of a mess.\n </p>\n <p>\n  <img alt=\"5\" src=\"https://i.sstatic.net/WpAug.png\"/>\n </p>\n <p>\n  Any advise what I should do? I'll probably start from a fresh revision of the exe and slowly start fixing things up and looking at the bottom each time to see if anything messes up. Or is there a way to find out what screwed it up? or maybe a way to prevent further screws up in the future? to be honest I recall it screwed up on a fresh project as well just the first time it messed up it just kept undoing my changes with Keys\n  <code>\n   A\n  </code>\n  's and\n  <code>\n   O\n  </code>\n  's and\n  <code>\n   D\n  </code>\n  's\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "627",
    "tags": [
        "ida"
    ],
    "user": "SSpoke",
    "time": "Apr 17, 2014 at 17:32",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  \"redo analisys\"?  Why is a commercial product misspelling \"analysis\"?\n </p>\n <p>\n  I would suspect hardware or serious software problems.  Do you have unexpected computer crashes?  faulty memory?  corrupted disc structure?\n </p>\n <p>\n  If none of those, and in the absence of any better advice I would reinstall IDA, check your hard drives, make sure you have sufficient RAM that is correctly configured in BIOS and check your IDA against a different project.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Paddywhacker",
            "time": "Apr 18, 2014 at 1:17",
            "is_accepted": false,
            "comments": [
                {
                    "user": "SSpoke",
                    "text": "<span class=\"comment-copy\">Well I don't think anything is wrong with IDA PRO really it's just it's really risky with no undo's If you get a Please confirm The new variable size is bigger than the old one. You should get scared haha. I am almost done renaming from the screwed up project back to a fresh version. Might work better.</span>",
                    "time": null
                }
            ]
        }
    ]
}