{
    "title": "Are jump instructions targeting addresses in ntdll a sign of malware?",
    "link": "https://reverseengineering.stackexchange.com/questions/4106/are-jump-instructions-targeting-addresses-in-ntdll-a-sign-of-malware",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  For fun I downloaded an installer from a \"driver downloads\" website.  I do NOT intend on installing it, but I was interested to check it out just to see what it looked like.  I tossed it into Ollydbg (without advancing the pointer) and just browsed the assembly.\n </p>\n <p>\n  There are multiple different calls/jumps/far jumps to various\n  <code>\n   ntdll.addr\n  </code>\n  .\n </p>\n <p>\n  I know\n  <code>\n   ntdll\n  </code>\n  is a pretty low-level library, but I just don't have enough experience in windows x86 disassembly to know what's '\n  <em>\n   normal\n  </em>\n  '.  This is also ostensibly, a driver installer, so it seems reasonable that there would be calls into\n  <code>\n   ntdll\n  </code>\n  .  Are jumps like that considered normal behavior?  Usually I'm used to seeing calls that expressly name the function... not a specific address in\n  <code>\n   ntdll\n  </code>\n  .\n </p>\n <h2>\n  Extra detail/context\n </h2>\n <p>\n  The file wasn't packed, but there were a few spots where the full printable ASCII\n  <code>\n   [A-Za-z]\n  </code>\n  appeared in the hex view, which I recall could be a sign that there's base64 encoding/decoding going on somewhere. Maybe shift-ciphers.\n </p>\n <p>\n  For reference, the precise binary I'm peering into is\n  <a href=\"http://driverscollection.com/?H=GM-M7700&By=Gigabyte\" rel=\"nofollow\">\n   here\n  </a>\n  .  Windows 7 64bits.  (The installer itself appears to be 32bits... Ollydbg loaded it fine, and IDA free too.)\n </p>\n <p>\n  PEBrowse64 also showed me something possibly suspicious under\n  <code>\n   Resources->STRING->4085\n  </code>\n  .\n </p>\n <p>\n  In this section there appears to be strings set aside for\n  <kbd>\n   Pageup\n  </kbd>\n  /\n  <kbd>\n   Down\n  </kbd>\n  /\n  <kbd>\n   Backspace\n  </kbd>\n  /\n  <kbd>\n   Esc\n  </kbd>\n  /\n  <kbd>\n   Enter\n  </kbd>\n  keys, which I know could be a sign of a keylogger... but again, I'm new, so I'm unsure.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "890",
    "tags": [
        "disassembly",
        "windows",
        "malware"
    ],
    "user": "avgvstvs",
    "time": "Apr 20, 2014 at 6:40",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  There is a legitimate situation where this can occur, which is called \"import forwarding\".  That is, a DLL (such as kernel32.dll) might export a symbol, for which the implementation is held in another DLL (such as ntdll.dll).  A typical example of that is the heap allocation functions: HeapAlloc and HeapFree.  If you examine kernel32.dll, you will see that they are redirected to ntdll.RtlAllocateHeap and ntdll.RtlFreeHeap.  The reason for this is behavior is probably not particularly interesting (it's to do with maintaining compatibility).\n </p>\n <p>\n  That is not to say that all such cases of direct calls into ntdll.dll are legitimate, but it might explain what you are seeing.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "peter ferrie",
            "time": "Apr 20, 2014 at 4:37",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">In addition to what Peter said, sometimes programs need to use functionality that is exposed by <code>ntdll</code> but not exposed by higher level libraries. For example, if a user-mode application wants to call <a href=\"http://msdn.microsoft.com/en-us/library/windows/hardware/ff552191(v=vs.85).aspx\" rel=\"nofollow noreferrer\"><code>RtlDecompressBuffer()</code></a>, it needs to call the function in <code>ntdll</code> directly; there's no higher-level version exposed by Windows.</span>",
                    "time": null
                },
                {
                    "user": "avgvstvs",
                    "text": "<span class=\"comment-copy\">@Jason, would that result in ollydbg reporting <code>ntdll.addr</code> instead of <code>ntdll.RtlDecompressBuffer</code>?  I would think that if the fxn was deliberately exposed by <code>ntdll</code> its public and I <i>should</i> be seeing the fxn name--unless this name can be changed by the loader at runtime?</span>",
                    "time": null
                },
                {
                    "user": "avgvstvs",
                    "text": "<span class=\"comment-copy\">@Jason, Yikes... nm.  I think I see what's going on, but why on earth make functions in ntdll private, if its possible to load them anyway with <code>GetProcAddress</code>?   Seems counter-intuitive to hiding implementations.</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">@avgvstvs, they're not private if they're exported.  They are simply platform-specific.  Before everything was based on Windows NT, Windows 95 (for example) could not do everything that NT could do, so functionality was not exposed at a lower level (i.e. in kernel32.dll).</span>",
                    "time": null
                }
            ]
        }
    ]
}