{
    "title": "Any Home Made Alternatives to X-Ray ICs?",
    "link": "https://reverseengineering.stackexchange.com/questions/4128/any-home-made-alternatives-to-x-ray-ics",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am on the hunt for several ICs by searching for the markings on them. But sometimes the markings are just too vague and I cannot really guarantee that the IC I found is the IC I am looking for. I know that some manufacturers place a logo or something equivalent on the die itself, and that it is possible to X-Ray the package in order to see the bare die.\n </p>\n <p>\n  My question is, is there any home-made (preferably cheap) alternative to the X-Ray method?\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "350",
    "tags": [
        "integrated-circuit"
    ],
    "user": "KingsInnerSoul",
    "time": "Apr 23, 2014 at 14:06",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm far from an authoritative source but I've personally never seen x-rays being used to identify anything but defects or bad joints under BGA chips. I don't think x-rays would be a good fit here because the die is extremely likely to appear like a solid blob with possibly the bonding wires visible.\n </p>\n <p>\n  The cheapest way I know of to accomplish what you want to do is by grinding, usually called polishing, the chip using a very very fine sandpaper or abrasive surface to remove the packaging and different metal layers. In your case you probably only want to remove the protective polymer. If you go this route you need to take extreme care when it comes to aligning the chip and the grinding surface so that your material removal isn't slanted.\n </p>\n <p>\n  The other, and similarly cheap, method is a chemical etch, also called wet etching. This is usually very dangerous though if you're not very careful and make damn sure that your ventilation is good. It usually involves nitric or sulphuric acid. I won't discuss it in detail here.\n </p>\n <p>\n  For an overview of different techniques please see\n  <a href=\"http://siliconpr0n.org/wiki/doku.php?id=decap%3astart\" rel=\"nofollow\">\n   siliconpr0n's article on decapsulation\n  </a>\n  . t4f has a decent article on low cost\n  <a href=\"http://www.t4f.org/articles/ultra-low-cost-ic-decapsulation/\" rel=\"nofollow\">\n   decapsulation using a chemical etch\n  </a>\n  . Siliconzoon has\n  <a href=\"http://siliconzoo.org/tutorial.html\" rel=\"nofollow\">\n   a nice tutorial\n  </a>\n  for the very basics of understanding what you're looking at once you've decapsulated, polished and imaged the metal layers of your ICs.\n </p>\n <p>\n  If you're not hell bent on doing it on your own there's a number of companies that offer decapsulation services for you. Usually this service doesn't have to be very expensive due to them using automated decapsulation machines, usually by so called jet etching. They usually send you the decapsulated sample for analysis. There's probably services out there willing to take high resultion, high magnification pictures of the various metal layers for you as well. My recommendation would be to send a sample to one of these firms, it will cost you less than 100 USD, you're very likely to get a working sample back and it also has the highest success to chemical burn ratio.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Peter Andersson",
            "time": "Apr 23, 2014 at 18:56",
            "is_accepted": true,
            "comments": [
                {
                    "user": "ixje",
                    "text": "<span class=\"comment-copy\">Apart from companies try your local university (Computer Engineering or Chemistry department) they sometimes rent chemical lab or service time for decapping. Additional keep in mind that grinding is likely going to destroy some bonding wires. If it's a flip chip you might be get somewhere with Infrared backside imaging. The required <a href=\"http://tinyurl.com/koncoxr\" rel=\"nofollow noreferrer\">wave length depends on the material</a> and your camera needs to be capable of capturing it. Again your local university might have this stuff.</span>",
                    "time": null
                },
                {
                    "user": "KingsInnerSoul",
                    "text": "<span class=\"comment-copy\">@justsome, mind you tell me about those services they offer? Which universities do you know of that offer it?</span>",
                    "time": null
                },
                {
                    "user": "ixje",
                    "text": "<span class=\"comment-copy\">@KingsInnerSoul Given that I'm living in Europe I'm not sure my suggestion regarding which university will be helpful to you. I suggest to contact the departments and ask if they can somehow help. Start by saying you're doing it for research purposes, which often triggers their interest like a cape does for bulls :D As for services; a local one here offers decapping or allows you to use their chemicals/facilities to decap yourself. For current/former students they don't charge or minimal. For companies they charge a slightly higher rate (unknown).FIB'ing, Imaging etc services depend on the uni</span>",
                    "time": null
                }
            ]
        }
    ]
}