{
    "title": "What safety steps are to be followed when opening up an unknown piece of hardware?",
    "link": "https://reverseengineering.stackexchange.com/questions/41/what-safety-steps-are-to-be-followed-when-opening-up-an-unknown-piece-of-hardwar",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I recently found a plastic box with various dials and unknown sockets on it, in my Grandfather's attic.\n </p>\n <p>\n  It is around 12\"x8\"x4\".\n </p>\n <p>\n  From the plastic, it appears to be of 1980's vintage. I asked around, and no one knows what it is.\n </p>\n <p>\n  What safety precautions do I need to follow while opening it up?\n </p>\n</div>\n</body></html>",
    "votes": "7",
    "answers": 1,
    "views": "262",
    "tags": [
        "hardware"
    ],
    "user": "Devdatta Tengshe",
    "time": "Mar 20, 2013 at 3:34",
    "comments": [
        {
            "user": "markovchain",
            "text": "<html><body><span class=\"comment-copy\">\n Could you post a picture of it? Someone may be able to identify it. At any rate, I think if you're worried about your own safety, opening up an old piece of hardware is pretty safe. But you're more likely to be worried about wrecking the hardware -- which is why you might want to post a picture of it\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Devdatta Tengshe",
            "text": "<html><body><span class=\"comment-copy\">\n Unfortunately I don't have a pic of the item. And It's still at my grandparents place.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The biggest danger from opening a piece of tech hardware (other than breaking it) is electrical shock.  Equipment, especially older stuff, but really anything was designed to be plugged into the house mains may contain large capacitors in their power circuitry.  These can store a surprising charge that would result in a major shock.  Most modern equipment implements bleeder resistors that render them safe within minutes to an hour at most.  Older equipment should be left unplugged for a day or three unless you know what you are about.\n </p>\n <p>\n  In particular older CRT monitors and TVs contain a flyback transformer circuit for the electron gun that runs thousands of volts and will hold a charge for a while (hours/days depending on the make and age).\n </p>\n</div>\n</body></html>",
            "votes": "12",
            "user": "0xC0000022L",
            "time": "Apr 17, 2013 at 5:03",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Devdatta Tengshe",
                    "text": "<span class=\"comment-copy\">How long do the capacitors store charge? I think this equipment has not been touched/ attached to the mains for atleast a decade.</span>",
                    "time": null
                },
                {
                    "user": "WPrecht",
                    "text": "<span class=\"comment-copy\">All capacitors have some leakage which will eventually drain them.  After a decade, you are certainly safe on that score. For most power circuits, we are talking a few days at most.  Maybe longer (A week or two) for some real major capacitors (think a soda can sized or larger).</span>",
                    "time": null
                },
                {
                    "user": "Mike",
                    "text": "<span class=\"comment-copy\">+1 that was the first thing I thought of too when I read the question. zzzzzap!</span>",
                    "time": null
                }
            ]
        }
    ]
}