{
    "title": "Sharing IDC file between versions 5 and 6 of IDA pro",
    "link": "https://reverseengineering.stackexchange.com/questions/4214/sharing-idc-file-between-versions-5-and-6-of-ida-pro",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am using version 6 of IDA because it is the only one that works on Mac. My colleague is using IDA 5. We would like to collaborate by sending the an IDC file back and forth.\n </p>\n <p>\n  However, the IDC file generated by my program cannot be loaded in his program.\n </p>\n <p>\n  Is there a way for me to generate an IDC file that is compatible with her machine? Is it possible it doesn't work because I am using the trial version of IDA? Are there scripts that can be run on the file to convert it back and forth?\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 0,
    "views": "939",
    "tags": [
        "ida",
        "ida-plugin"
    ],
    "user": "Kevin Burke",
    "time": "Oct 2, 2018 at 20:01",
    "comments": [
        {
            "user": "bad_decoy",
            "text": "<html><body><span class=\"comment-copy\">\n Can you clarify if you are talking about an IDA script (IDC) or an IDA database (IDB)? IDC files are generally cross-compatible across versions of IDA (though sometimes needing minor changes). IDB files are designed to only work with the current and more recent versions of IDA, which I suspect is the issue you are having.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Kevin Burke",
            "text": "<html><body><span class=\"comment-copy\">\n It's an IDC file.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n AFAIK there is no way. The generated IDC files have changed quite a lot over the years. However, it should work by having your colleague generate the IDC and both of you working on the subset of IDC functions available on IDA 5.x. Also, I have used IDA inside WINE and CrossOver Office. Since at least IDA 5.x. So you should be fine running any of those versions, albeit not natively.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}