{
    "title": "Reverse engineering zip file",
    "link": "https://reverseengineering.stackexchange.com/questions/4251/reverse-engineering-zip-file",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Is it possible to reverse engineer ZIP file with password, and get the password or the data that is containing. I'm wondering because there is challenge in hacking lab which is to extract file from ZIP with passwd protection, and it's category is reverse engineering but when I look at the HEX dump I only see the file name.\n </p>\n</div>\n</body></html>",
    "votes": "-1",
    "answers": 2,
    "views": "11k",
    "tags": [
        "disassembly"
    ],
    "user": "user4536",
    "time": "May 3, 2014 at 17:23",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Password cracking is not reverse engineering.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Hagen von Eitzen",
            "text": "<html><body><span class=\"comment-copy\">\n If you have the file name, you may guess the file type, and then may be able to make good assumptions on the initial bytes of the plain content (\"magic numbers\")\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ange",
            "text": "<html><body><span class=\"comment-copy\">\n obviously a miss-categorization from them. unless you have extra files to get the password from.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "ShHolmes",
            "text": "<html><body><span class=\"comment-copy\">\n RE is the process, which purpose may differ. Password cracking is one of the possible uses of RE. In this particular case, you reverse engineer the zip file (learning file headers, magic numbers etc) to get the idea of how the file is organised IN ORDER to get something (change file contents, circumvent the file protection, like password etc). So, I don't understand the first comment here.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  From\n  <a href=\"http://www.elcomsoft.com/archpr.html\" rel=\"nofollow\">\n   http://www.elcomsoft.com/archpr.html\n  </a>\n  -\n </p>\n <blockquote>\n  <p>\n   Certain ZIP and ARJ archives can be unlocked and decrypted in just\n  minutes, provided that you have at least one unprotected file from\n  that archive at your discretion. It does not matter how long and\n  complex the password is! If you have a file from the encrypted ZIP\n  archive in your hands, the whole archive can be usually unlocked in\n  minutes by applying the known-plaintext attack.\n  </p>\n  <p>\n   After carefully analyzing the algorithms and implementations of\n  password protection in different versions of WinZip, ElcomSoft\n  developed a work-around solution to allow quick guaranteed decryption\n  of certain ZIP archives instead of performing lengthy attacks. If an\n  encrypted ZIP archive was created with WinZip version 8 or earlier,\n  and if the archive contains 5 or more files, Advanced Archive Password\n  Recovery can unlock the archive and decrypt its content – guaranteed!\n  A modern PC takes just under one hour to finish the job.\n  </p>\n </blockquote>\n <p>\n  If those special cases don't apply, you'd need to apply standard brute-force techniques. Either way, you'd want to use\n  <a href=\"http://www.elcomsoft.com/archpr.html\" rel=\"nofollow\">\n   Advanced Archive Password Recovery\n  </a>\n  or a\n  <a href=\"http://www.password-crackers.com/en/category_98/\" rel=\"nofollow\">\n   similar tool\n  </a>\n  .\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Jason Geffner",
            "time": "May 3, 2014 at 17:37",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user4536",
                    "text": "<span class=\"comment-copy\">They don't apply. Also I had finish my dictionary attack on it(top 10000 use passwords). They only way I have is brute force which is extremely slow. I think there is other way to get the password via RE because the challenge is in the section or RE.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">I assure you, if you're not given any other context (like password clues), then either the special cases apply or brute forcing applies :)</span>",
                    "time": null
                },
                {
                    "user": "user4536",
                    "text": "<span class=\"comment-copy\">No, but too many peoples have solve it to be brute forcing. Anyway since you are the only one who answer I will give you \"best answer\". Thanks for trying to help.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If this is a class competition, and it's filed under Reverse Engineering, the chances are the tutor has compiled this package themselves and has used techniques you've learnt in previous lessons to store the password somewhere within the executable.\n </p>\n <p>\n  Look back on the techniques you've already learnt, and try those.\n </p>\n <p>\n  Judging by the question I'll assume that you've not covered advanced Reverse Engineering techniques so the first place to start would be to view all the strings in the executable - provided no encryption is used, again I'm assuming not.\n </p>\n <p>\n  If you're using Windows you can use Sys Internals Strings (\n  <a href=\"http://technet.microsoft.com/en-gb/sysinternals/bb897439.aspx\" rel=\"nofollow\">\n   http://technet.microsoft.com/en-gb/sysinternals/bb897439.aspx\n  </a>\n  ). IDA Pro also allows you to do this.\n </p>\n <p>\n  Use a PE viewer to check whether it's a valid zip file created with WinZip, WinRar etc. It could have been created with a different program that contains a vulnerability to extract/crack the password.\n </p>\n <p>\n  Failing that, and not knowing the level of your experience or class the only option left is to brute force.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "James Jeffery",
            "time": "May 4, 2014 at 15:10",
            "is_accepted": false,
            "comments": []
        }
    ]
}