{
    "title": "Experiences from reverse engineers in detecting recursive calls",
    "link": "https://reverseengineering.stackexchange.com/questions/4368/experiences-from-reverse-engineers-in-detecting-recursive-calls",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have absolutely no experience in reversing real-world binary codes, so I wonder how the obfuscated codes prevent reversers. I doubt that the reverses always find some ways to understand what are hiden inside, even for heavy obfuscated codes, but I do not know how they think about them.\n </p>\n <p>\n  That partly comes from\n  <a href=\"https://reverseengineering.stackexchange.com/questions/3498/detecting-recursive-functions-in-ida/\">\n   this question\n  </a>\n  in detecting recursive calls where both two answers give a static approach: looking recursively in the functions called by the original function whether it is re-called.\n </p>\n <p>\n  In somehow theoretical manner, this approach can be bypassed if the programmer uses the continuation passing style, that is because there is no more explicit\n </p>\n <pre><code>call myself\n</code></pre>\n <p>\n  inside the code. The following program I have implemented to test out this idea:\n </p>\n <pre><code>template<typename T> \nauto obf_if(bool p, T a, T b) -> T\n{\n  T* pts[4] = { &a, &b, &a + 1, &b + 1 };\n  return *pts[int{ p }];\n}\n\ntemplate<typename T>\nauto obf_cmp(T a, T b) -> int\n{\n  return obf_if<int>(a == b, 0, obf_if<int>(a < b, -1, 1));\n}\n\nusing obf_strcmp_t = std::function < int(char*, char*) >;\n\nauto h_strcmp(obf_strcmp_t func, char* str1, char* str2) -> int\n{\n  return obf_if<int>((*str1 == *str2) && (*str1 != 0), \n                     func(str1 + 1, str2 + 1), obf_cmp<int>(*str1, *str2));\n}\nusing h_strcmp_t = decltype(h_strcmp);\n\nobf_strcmp_t y_strcmp(h_strcmp_t func)\n{\n  return std::bind(func, std::bind(y_strcmp, func), \n                   std::placeholders::_1, std::placeholders::_2);\n}\n\nint main(int argc, char* argv[]) \n{\n  char str1[] = \"ab\"; \n  char str2[] = \"ac\";\n  return y_strcmp(h_strcmp)(str1, str2);\n}\n</code></pre>\n <p>\n  This is a trivial implementation of\n  <code>\n   strcmp\n  </code>\n  using the\n  <em>\n   y combinator\n  </em>\n  . But this piece of codes leads to the fact that there is no more direct call inside the implementation (even no conditional jump), except the first one\n </p>\n <pre><code>y_strcmp(h_strcmp)(str1, str2)\n</code></pre>\n <p>\n  As an amateur, I have even loaded the binary code (compiled by VS2013) in IDA and see a big mess where calls are replaced by\n </p>\n <pre><code> call edx\n</code></pre>\n <p>\n  However because I write it I know how to detect this (e.g. the implicit recursive calls are detected by tracing the arguments passed into the function, the value of edx can only be one of passed arguments), and I think so do the reversers. So my question is:\n </p>\n <p>\n  Suppose that you do not know this trick, does it prevent you in understanding the binary code?\n </p>\n <p>\n  <strong>\n   NB\n  </strong>\n  Because w-s has suggested that this question is only an opinion-based one, so it will be closed sooner or later, but I very appreciate if someone gives an idea.\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "446",
    "tags": [
        "ida",
        "obfuscation",
        "deobfuscation",
        "functions"
    ],
    "user": "Ta Thanh Dinh",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [
        {
            "user": "w s",
            "text": "<html><body><span class=\"comment-copy\">\n Strictly speaking it is opinion based question. Less strictly speaking there is dynamic analysis. Such kind of obfuscation (as almost any other obfuscation) will not prevent anyone to read this code because there is no obfuscation that can prevent reading the code at all, obfuscation just makes code reading slower.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ta Thanh Dinh",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks a lot w-s, I am very agree with you. That leads me to this question because when I read some very nice approachs in code obfuscation, the question in my head is always: if the reversers know this trick, does it prevent them anymore.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "w s",
            "text": "<html><body><span class=\"comment-copy\">\n It is much more psychological question then question of reverse engineering. I know a lot of reversers that will stop reversing any code when they see any kind of obfucation but I also know some reverse engineers that will not recognize here any obfuscation and will define this code as \"over-designed\" and over C++ed :)\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ta Thanh Dinh",
            "text": "<html><body><span class=\"comment-copy\">\n I got your joke w-s :D. I think that I should delete this psycho question before it is down-voted by many people and I lose all of my reputation points.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "gandolf",
            "text": "<html><body><span class=\"comment-copy\">\n This will only slow down a dedicated reverser, but because the code itself is not hiding its functionality in any way, it can be reversed given enough time. And like the answer below, there are ways to identify recursive functions, no matter how elusive the programmer may try to be. stack based traces are a good way to spot this.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Hook the start of all functions that you're concerned might be recursive with EasyHook. Have your hooking function log the function address in the thread local storage (to avoid synchronisation issues) then look at either a full stack back trace or just the calling function. Recursive functions will be obvious.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "offbyseveral",
            "time": "May 23, 2014 at 4:19",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ta Thanh Dinh",
                    "text": "<span class=\"comment-copy\">Thanks a lot offbyseveral, I am very appreciated your answer. I am very agree with you that this obfuscation trick (which bypasses the static analysis) can be bypassed easily by the dynamic analysis (in particular, nothing is hidden inside a \"session\" of dynamic analysis). But the problem is the dynamic analysis is quite bad in detecting which might \"potentially become\" recursive calls.</span>",
                    "time": null
                },
                {
                    "user": "offbyseveral",
                    "text": "<span class=\"comment-copy\">To do what you want to do rigorously is impossible. Imagine a program that only becomes recursive when a structure is full of data which correctly decrypts using a key. Or which is based on a specific password. Static analysis isn't going to cut it for all but the most trivial programs.</span>",
                    "time": null
                },
                {
                    "user": "offbyseveral",
                    "text": "<span class=\"comment-copy\">Imagine that a program does call edx based on data lookup in a vtable that has been modified by an attacker with an exploit to become recursive. To solve your problem rigorously you'd need to first show that the program state can't be modified in this way and then you'd be a very rich person indeed!</span>",
                    "time": null
                },
                {
                    "user": "Ta Thanh Dinh",
                    "text": "<span class=\"comment-copy\">Thanks a lot offbyseveral, you are absolutely correct. The question is not rigorous (coincidentally I have just used the word \"rigorous\" to reponse the comment of gandolf) so it is impossible to give a precise answer. I just want to receive your precious ideas.</span>",
                    "time": null
                }
            ]
        }
    ]
}