{
    "title": "After a CALL instruction, jumping to RETN",
    "link": "https://reverseengineering.stackexchange.com/questions/4372/after-a-call-instruction-jumping-to-retn",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm trying to analyze a piece of code, I'm confused about the following line:\n </p>\n <pre><code>CALL  fct.00402589\n</code></pre>\n <p>\n  Then after that, I come across a block beginning with RETN.(See below)\n  \n\n  Here are a couple of lines of that code-block:\n </p>\n <pre><code>RETN\nNOP\nPUSH EBP\nMOV EBP,ESP\nLEA ESP, DWORD PTR SS:[ESP-0X2D0]\nPUSH ESP\nCALL ntdll.RtCaptureContext\n......\n......\nINT 3 \nNOP\n</code></pre>\n <p>\n  So as I said, after the call I am in the line RETN. But when I want to go further(click on the \"step over\"-button of ollydbg) then it jumps back to the next line after the call-instruction.\nIn the line before the last instruction \"NOP\", there is the instruction INT 3.\n </p>\n <p>\n  I have figured out that in some cases, especially as anti-debugging technique, the program inserts the opcode 0xCC of INT 3 to confuse the debugger. The debugger thinks that it is a breakpoint because normally, the debugger uses OxCC to set breakpoints.\n </p>\n <p>\n  So, I change the debugging options of ollydbg (Options -> Debugging Options -> Exceptions and then click the INT 3 breaks-Box). From now on, the debugger does not trap the exception, it passes the exception to the program.\n </p>\n <p>\n  When I start the program again, and come to the call-instruction, then the following appears(again i copy some lines):\n </p>\n <pre><code>JMP DWORD PTR DS: [<%crtdll._GetMainArgs>] \nNOP\nNOP\nADD BYTE PTR DS:[EAX], AL\nADD BYTE PTR DS:[EAX], AL\nJMP DWORD PTR DS: [<%crtdll._strcmpi>]\nNOP\nNOP\nADD BYTE PTR DS:[EAX], AL\nADD BYTE PTR DS:[EAX], AL\nJMP DWORD PTR DS: [<%crtdll._atoi>]\nNOP\nNOP\nADD BYTE PTR DS:[EAX], AL\nADD BYTE PTR DS:[EAX], AL\nJMP DWORD PTR DS: [<%crtdll._exit>]\nNOP\nNOP\nADD BYTE PTR DS:[EAX], AL\nADD BYTE PTR DS:[EAX], AL\nJMP DWORD PTR DS: [<%crtdll._memcpy>]\nNOP\nNOP\n----\n</code></pre>\n <p>\n  And so on, has anyone a clue? Or can someone explain me what is going on here?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ollydbg"
    ],
    "user": "user3097712",
    "time": "May 19, 2014 at 4:50",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "<html><body><span class=\"comment-copy\">\n Where is the connection between the\n <code>\n  int3\n </code>\n ,\n <code>\n  call\n </code>\n and\n <code>\n  retn\n </code>\n ? The\n <code>\n  call\n </code>\n and\n <code>\n  retn\n </code>\n just about anybody can explain you, but the question is unclear.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user3097712",
            "text": "<html><body><span class=\"comment-copy\">\n ok, then forget INT 3. What does RETN in combination with a CALL instruction mean ?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The\n  <code>\n   int3\n  </code>\n  that you see in your disassembly exists for the purposes of debugging, because it is hit when there is a bug in the executing code.  It is intended to transfer control to a debugger in order to present the user (i.e. developer) with a more meaningful information about the location and possibly the cause of the problem.  In the absence of a debugger, it will force termination of the program to occur, which is the safest possible action.  For example, in the case of heap corruption, continued execution could result in exploitation and execution of arbitrary code.\n </p>\n <p>\n  There are other reasons for\n  <code>\n   int3\n  </code>\n  instructions to appear - they can be unused padding between routines, particular for hot-patch-aware functions, among other things.  The presence of\n  <code>\n   int3\n  </code>\n  is not always an indication of anti-debugging techniques.  In fact, it could be said that it is more likely to be not an anti-debugging technique at all.\n </p>\n <p>\n  edit: after your comment clarified your question a bit better - what you're asking about is not a jump to a return, but a jump to a routine that returns.  That's quite different.\n </p>\n <p>\n  So, a call to a routine leaves the return address on the stack.  That return address is the line immediately after the call instruction.  When a routine executes the ret instruction, the code resumes after the call.  The jump instruction is merely a transfer of control to a routine which will return, allowing the code to continue executing.\n </p>\n <p>\n  A transfer of control to an exit() routine, irrespective of the name, does what it suggests: it causes the process to terminate.  If you are tracing through code and you hit that, then the process is done.  If you think that it should do more, then you need to watch the code that executed prior to that transfer of control.  Perhaps the program expects particular command-line options to be set, in order to do any work.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "peter ferrie",
            "time": "May 20, 2014 at 15:28",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user3097712",
                    "text": "<span class=\"comment-copy\">ok, then back to JMP DWORD PTR DS: [&lt;%crtdll._GetMainArgs&gt;]. After the call instruction, I come to that. When I go further, the debugger switches from that to the back to the first line after the CALL instruction. I look up the functions. They are all from the C Runtime Library. So, when I step further, after a while I come to the \"exit\" function and that means that the process is finished. Is there a trick to pass that exit function to anaylze the other part of the code?</span>",
                    "time": null
                }
            ]
        }
    ]
}