{
    "title": "Anti-debug techniques on Unix platforms?",
    "link": "https://reverseengineering.stackexchange.com/questions/43/anti-debug-techniques-on-unix-platforms",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to scan all possible techniques to disrupt the usage of a debugger on a Unix platform (ie POSIX and a bit more).\n </p>\n <p>\n  I am thinking about techniques such as the\n  <code>\n   PTRACE\n  </code>\n  test at the beginning of a program (or at various points of its execution), the insertion of fake breakpoints (eg\n  <code>\n   int3\n  </code>\n  /\n  <code>\n   0xcc\n  </code>\n  x86 opcode) or time checks. But, also global strategies defined on the program to slow down the analysis of the program.\n </p>\n <p>\n  For now, all the techniques I found on Internet were easily worked around as soon as the anti-debug technique has been understood. So, I wonder if there are stronger ones.\n </p>\n</div>\n</body></html>",
    "votes": "22",
    "answers": 3,
    "views": "6k",
    "tags": [
        "assembly",
        "obfuscation",
        "anti-debugging"
    ],
    "user": "perror",
    "time": "Jun 5, 2014 at 13:04",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n \"all the techniques I found on Internet were easily worked around as soon as the anti-debug technique has been understood\" <- this is the case with most of them but not a reason to discount them just because of that.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "jvoisin",
            "text": "<html><body><span class=\"comment-copy\">\n You may want to check [this][1] topic.        [1]:\n <a href=\"http://reverseengineering.stackexchange.com/questions/1930/detecting-tracing-in-linux\" title=\"detecting tracing in linux\">\n  reverseengineering.stackexchange.com/questions/1930/…\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "12431234123412341234123",
            "text": "<html><body><span class=\"comment-copy\">\n You can't. It is impossible for any software to detect if it runs on a real machine or a perfect emulation which can be analyzed from the outside. Don't try to do something mathematically impossible.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Thorbjørn Ravn Andersen",
            "text": "<html><body><span class=\"comment-copy\">\n @12431234123412341234123 Modern CPU's are perfect emulations of the abstract instruction set.  That said, perfection is very hard to achieve.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "12431234123412341234123",
            "text": "<html><body><span class=\"comment-copy\">\n @ThorbjørnRavnAndersen The possible instructions a CPU can make is limited, so it isn't THAT hard. However, doing it fast, efficient and at the same time without exploitable side effect is very hard.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Here's some I've seen or heard about:\n </p>\n <ul>\n  <li>\n   <p>\n    Stripping the section headers. A simple and fully legal action that stops GDB dead in its tracks. Does not work against some other debuggers (e.g. IDA). Can be done using the\n    <a href=\"http://www.muppetlabs.com/~breadbox/software/elfkickers.html\">\n     <code>\n      sstrip\n     </code>\n    </a>\n    tool.\n   </p>\n  </li>\n  <li>\n   <p>\n    Using\n    <code>\n     syscall\n    </code>\n    function or direct syscalls instructions instead of calling specific functions like\n    <code>\n     ptrace()\n    </code>\n    . Can be defeated by setting the breakpoint on\n    <code>\n     syscall\n    </code>\n    function or just stepping through the file, but may be non-obvious if you don't know about it.\n   </p>\n  </li>\n  <li>\n   <p>\n    Performing anti-debugging actions before\n    <code>\n     main()\n    </code>\n    , e.g. in constructors of global objects or using\n    <code>\n     __attribute__((constructor))\n    </code>\n    . Since GDB usually sets initial breakpoint in\n    <code>\n     main()\n    </code>\n    , it takes care of the default situation. Workaround is simple: put breakpoint on the actual file's entrypoint (\n    <code>\n     info file\n    </code>\n    in GDB).\n   </p>\n  </li>\n  <li>\n   <p>\n    Sending itself debugging-related signals like\n    <code>\n     SIGTRAP\n    </code>\n    . (Note that this can be ignored with\n    <code>\n     handle SIGTRAP nostop\n    </code>\n    in GDB.)\n   </p>\n  </li>\n  <li>\n   <p>\n    Forking and tracing itself with\n    <code>\n     ptrace\n    </code>\n    .\n   </p>\n  </li>\n  <li>\n   <p>\n    Fake breakpoints insertion: Inserting int3/0xcc will force the debugger to stop on these bytes as they will be treated as software breakpoints. If they are numerous it might slow down considerably the analysis.\n   </p>\n  </li>\n  <li>\n   <p>\n    Breakpoint detection: I saw this technique in this\n    <a href=\"http://www.stonedcoder.org/~kd/lib/14-61-1-PB.pdf\">\n     paper\n    </a>\n    , you can attach a function that will be triggered when a breakpoint is encoutered. This paper covers also some other tricks.\n   </p>\n  </li>\n </ul>\n</div>\n</body></html>",
            "votes": "22",
            "user": "4 revs, 4 users 74%Igor Skochinsky",
            "time": "Jan 2, 2014 at 22:06",
            "is_accepted": true,
            "comments": [
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">Ok, this seems a reasonable list of techniques but nothing surprising til now. And, you are missing the breakpoints tricks (insertion of fake breakpoints to confuse the debugger when PTRACEd and checking the hash of the next code block to see if new software breakpoints have been inserted or not). But, would you know a paper describing all these techniques for Unix (I know some papers for MS-Windows but none for Unix systems).</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@Emmanuel: feel free to edit it and add more, that's why I made it a wiki. I'm not aware of any papers, but possibly you can find some more tricks in something like Phrack.</span>",
                    "time": null
                },
                {
                    "user": "nneonneo",
                    "text": "<span class=\"comment-copy\">My IDA died while trying to load an ARM binary that had its section headers stripped. So #1 may still be a useful trick (though I ultimately wrote a script to reconstitute the headers).</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@nneonneo: if that happens with the current version, please send a bug report. thanks.</span>",
                    "time": null
                },
                {
                    "user": "Joshua",
                    "text": "<span class=\"comment-copy\">The real fun is fork and use ptrace() on yourself as a form of IPC.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  My understanding of anti-debugging technology is that it is a game of cat and mouse (or cat and also cat). A technique works until it is understood by the opposing side and then it doesn't work any more. I think that ultimately the advantage is on the side of the debugger. Consider dynamic binary instrumentation or virtual machine systems. You can detect the presence of DBI or emulation by looking for cracks or faults in the emulation of the platform, but those are just errors in the emulation/translation software. If you had a \"perfect\" emulation system, then a debugged application could not know that it was being traced?\n </p>\n <p>\n  So I think the best you can do is little things that are easily worked around. The Shiva system still I think represents \"okay\" protection from debugging on Unix platforms, since it decrypts small portions of itself to run on demand and then re-encryptes them, as I recall.\n </p>\n</div>\n</body></html>",
            "votes": "12",
            "user": "Andrew",
            "time": "Mar 20, 2013 at 14:31",
            "is_accepted": false,
            "comments": [
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">I would tag the Shiva system as an advanced packer but not really an anti-debug technique (even if its main effect is to render the usage of a debugger extremely tedious because your window in memory where you can effectively set breakpoints is extremely small compared to a \"normal\" program).</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  They aren't any, do not try to do the mathematically impossible.\n </p>\n <blockquote>\n  <p>\n   For now, all the techniques I found on Internet were easily worked\naround as soon as the anti-debug technique has been understood. So, I\nwonder if there are stronger ones.\n  </p>\n </blockquote>\n <p>\n  Yes, because there is no way of detecting a debugger that can not be faked.\nSoftware can not detect if it runs in a perfect emulation or in the real world. And a emulator can be stopped, the software can be analyzed, variables can be changed, basically everything can be done that can be done in a debugger.\n </p>\n <p>\n  Let's say you want to detect if the parent process is a debugger. So you make a system call to get the parent PID? The debugger can intercept the system call and return any PID which does not have to be the real PID. You want to intercept every SIGTRAP so the debugger can't use it anymore? Well the debugger can just stop in this case and send the SIGTRAP also to your process. You want to measure the time when you send SIGTRAP to know if the process stops for a short time by the debugger for sending SIGTRAP so you know when there is a debugger? The debugger can replace your calls to get the time and return a fake time. Let's say you run on a Processor that has a instruction that returns the time, so no function call is needed to get the time. Now you can know that the time you are getting is real? No, the debugger can replace this instruction with a SIGTRAP instruction and return any time he wants or in case such a instruction does not exist, run the Software in a emulator that can be programmed in any way. Everything you can come up with to detect a debugger or emulator can be faked by the environment and you have 0 change to detect it.\n </p>\n <p>\n  The only way to stop debugging is by not giving the software to the customers but keep it in your hands. Make a cloud service and run the software on your server. In this case the customer can not debug your program since he does not run it and has no control over it. Except the customer can access the server or the data somehow, but that is a different story.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "Rohit Gupta",
            "time": "May 12, 2023 at 13:33",
            "is_accepted": false,
            "comments": []
        }
    ]
}