{
    "title": "Can Trusted computing/TPM defeat crack attempts?",
    "link": "https://reverseengineering.stackexchange.com/questions/4490/can-trusted-computing-tpm-defeat-crack-attempts",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I read some things about trusted computing platforms (TPM) and its applications in the past.\n </p>\n <p>\n  AFAIK, its applications include such things as countering software reverse engineering/crack and cheating in multiplayer games. And nowadays, it seems that most systems (including most PCs) have trusted computing capabilities or TPM chips.\n </p>\n <p>\n  I want to know how widespread are TC applications at the moment and how successful they were (or can be if implemented/used properly - I mean without any human mistakes) in achieving their goals.\n </p>\n <p>\n  And, can TC be a definitive end to reverse engineering/crack (at least in some cases), and if not, why?\n </p>\n <p>\n  It seems to me that TC has great capabilities and can create strong protection against software manipulation, because I am somewhat informed in cryptography and I know it uses modern and strong cryptographic algorithms/protocols ... that breaking them is almost infeasible if implemented properly (free of human mistakes). But, on the other hand, I don't know why its use is not widespread yet (apparently) and almost all software are cracked everyday (Although I have some guesses myself, like extra complexity and cost required to implement such software, also the cryptography knowledge/expertise required that almost no ordinary programmer has).\n </p>\n <p>\n  So, I decided to ask this question from you here.\n </p>\n <p>\n  <strong>\n   PS\n  </strong>\n  : Maybe I should have posted this question in crypto or security StackExchange sites. IDK for sure, but probably will try them if I don't get enough info here.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "981",
    "tags": [
        "hardware",
        "cryptography",
        "software-security"
    ],
    "user": "user40602",
    "time": "May 31, 2014 at 8:07",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am not sure there is a definitive answer to this.\n </p>\n <p>\n  For example, anyone with physical access to the system can do a whole manner of things that TPM may not be able to prevent.\n </p>\n <p>\n  For example, the TPM itself could be reverse engineered:\n  <a href=\"http://gcn.com/articles/2010/02/02/black-hat-chip-crack-020210.aspx?m=1\" rel=\"nofollow\">\n   http://gcn.com/articles/2010/02/02/black-hat-chip-crack-020210.aspx?m=1\n  </a>\n </p>\n <p>\n  Then you have timing attacks and other side channels.\n </p>\n <p>\n  And as you say yourself, cost and complexity: this is well summed up by Andrew 'Bunnie' Huang in 'Hacking the Xbox' (pg. 203,\n  <a href=\"http://www.nostarch.com/xboxfree\" rel=\"nofollow\">\n   http://www.nostarch.com/xboxfree\n  </a>\n  )\n </p>\n <blockquote>\n  <p>\n   In the consumer electronics industry, one can either ship a perfect\n  product, or one can make money. Products that don't make money are\n  quickly cancelled. Thus, it is very rare to find a consumer product that is\n  technically perfect in all respects. As a result, the only practical way to\n  guarantee the security of consumer electronics system as complex as\n  Palladium is to throw it into the wild, and let the hackers have their way\n  with it for many years until all of the big security holes have been\n  discovered and plugged.\n  </p>\n  <p>\n   On the other hand, the TCPA's TPM is a device created to solve a certain\n  set of problems that is smaller in scope than Palladium's. Thus, the TPM\n  is not as exciting from a market perspective, but it may be more practical\n  and serviceable for its intended purpose. Both the TPM and Palladium\n  are weak to hardware attacks, but the TPM doesn't attempt to extend\n  security requirements as far into third-party system design territory. The\n  TPM is primarily a secured key management module that can detect most\n  modifications and intrusions to the host system. The software layers built\n  on top of this substrate do the rest of the heavy lifting, caveat emptor.\n  </p>\n </blockquote>\n</div>\n</body></html>",
            "votes": "1",
            "user": "6EQUJ5",
            "time": "Jun 1, 2014 at 13:25",
            "is_accepted": false,
            "comments": []
        }
    ]
}