{
    "title": "How to disable a button click using Ollydbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/4582/how-to-disable-a-button-click-using-ollydbg",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am trying to disable a button of a game client.\n </p>\n <p>\n  I have checked the answer of this\n  <a href=\"https://reverseengineering.stackexchange.com/questions/3288/how-can-i-set-a-breakpoint-for-a-button-click?newreg=f94533fe742742c2a47cc3678243be2b\">\n   question\n  </a>\n  about how to set a breakpoint for a button message.\n </p>\n <p>\n  But, after clicking the button, it breaks on a specific line but when I set a break point on this line client stop and keep returning to the line if I try to start client again.\n </p>\n <p>\n  So, my questions are:\n </p>\n <ol>\n  <li>\n   How can I find the calls or lines which uses the line that broke with me recently?\n  </li>\n  <li>\n   am I going on the right way to find the button lines and disable it ?\n  </li>\n </ol>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ollydbg"
    ],
    "user": "Muhab",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You probably found the correct line - the start of the dialog function that gets called whenever something happens with the dialog.\n </p>\n <p>\n  The problem is, this function gets called a lot of times; especially, when Windows wants the dialog shown, it sends a WM_PAINT message to the dialog. This calls the dialog function as well, so whenever you tell Ollydbg to continue, and alt-tab to your game client, windows redraws the dialog, which calls your function, which triggers your breakpoint.\n </p>\n <p>\n  What you want to do is disassemble and understand the complete function. The function should check the message for WM_COMMAND (0x111), then check the wParam parameter for the ID of your button. Find the assembly lines that are executed in this specific case. Then, you can start changing stuff - for example, if these lines call some function, replace the function calls with NOP to prevent the button from doing what it's supposed to do.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Guntram Blohm",
            "time": "Jun 10, 2014 at 12:03",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Muhab",
                    "text": "<span class=\"comment-copy\">sorry but i'm newbie with assembly, so how i can dissemble the function ,, also is wParam exists on ollydbg ? note: the button doesn't send any packets or op codes to the server it just pop up new window on the client. it will be great if u give me some tips about this questions!</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">if you are not sure what disassembling means what wparam means etc and say buttons send opcodes to server then you are not ripe for reverse engineering get a spy utility like winspy or spy++ hover the utility over the button and change the buttons style to WS_DISABLED</span>",
                    "time": null
                },
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">I agree with blabb. If you want to do any reverse engineering, you need to a) be able to read assembler easily, b) know about the specifics of your processor, and c) know about stack usage and procedure calling conventions of the mostly-used compilers. Right now, it's like a student pilot asking how to fly loopings on his first day.</span>",
                    "time": null
                },
                {
                    "user": "Muhab",
                    "text": "<span class=\"comment-copy\">i agree with that too but i'm trying to manage 3~5 coding language to be able to lunch a game server , so my goal is not to become a pro assembler i'm just trying to find out how to trace and find lines on ollydbg so i can edit it. i have found wParam <a href=\"http://prntscr.com/3rkhi3\" rel=\"nofollow noreferrer\">pic</a> with spy++ and got the lines already which called when any command sent WM_COMMAND or WM_PAINT whatever, but still can't achieve how to disassemble the function and is this lines are the function or i have to trace it?,it will be grateful if u guys give me some tips about disassembling. and thanks for your help.</span>",
                    "time": null
                },
                {
                    "user": "Muhab",
                    "text": "<span class=\"comment-copy\">@blabb also there is no way to change styles i have checked it ,it's not able to be changed or maybe i'm going wrong !</span>",
                    "time": null
                }
            ]
        }
    ]
}