{
    "title": "Serial console stops output abruptly",
    "link": "https://reverseengineering.stackexchange.com/questions/4657/serial-console-stops-output-abruptly",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've been playing with a device similar to this one:\n  <a href=\"http://wiki.openwrt.org/toh/cisco/epc3208g\" rel=\"nofollow\">\n   EPC3208G\n  </a>\n  . \nI've connected GND, TX and what i think is an RX pins via ttl adapter. Using minicom, 8N1 and baudrate of 115200, I managed to get some output after the device powers up. But, much like in the linked article on openwrt wiki, the serial console output just stops after some time. It stops on the same character every time, although not the same as in the article.\n </p>\n <p>\n  I was wondering what could be the reason for this behaviour?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "153",
    "tags": [
        "hardware",
        "serial-communication"
    ],
    "user": "0xea",
    "time": "Jun 20, 2014 at 21:08",
    "comments": [
        {
            "user": "lornix",
            "text": "<html><body><span class=\"comment-copy\">\n Umm, perhaps it's waiting for some input? Have you sent anything?  Try it! Exciting Adventures Await!\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xea",
            "text": "<html><body><span class=\"comment-copy\">\n no, it stops mid-sentence, and i did try but either it doesn't echo anything or i have the wrong pin for RX\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "lornix",
            "text": "<html><body><span class=\"comment-copy\">\n Hmmm, what does it say?\n <code>\n  This explosive device will explode in ....\n </code>\n CRAP!  Oh noes!!!  Oh, probably not that, huh?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "0xea",
            "text": "<html><body><span class=\"comment-copy\">\n See the console output in the linked openwrt wiki article.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "lornix",
            "text": "<html><body><span class=\"comment-copy\">\n A quick count shows that the console output stops with approximately 4005 characters... that's suspiciously close to 4096 characters, which is likely a buffer size.  Of course, it shouldn't require any input to continue outputting the boot log, BUT... perhaps you have an incorrect connection to the RX- pin?  Speculating here: Maybe you're holding DTR/DSR/CD high/low and the system is blocked waiting for that to clear to send the rest?  What happens if you just listen on TX, but with no RX connection?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}