{
    "title": "Process termination after calling a function",
    "link": "https://reverseengineering.stackexchange.com/questions/4771/process-termination-after-calling-a-function",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have the following problem:\n </p>\n <p>\n  in an assembly code I have a call into a function. When I step into the function and analyze a little bit, after a while ollydbg says that is suddenly terminated and I can not do anything against that. You know, after terminating ollydbg does not allow to step futher.\n </p>\n <p>\n  My question would be: \nIs is possible to go back to the line where the function is called and step over the function ? I mean, after knowing that the function is terminating the whole thing i would not go again in that function.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "183",
    "tags": [
        "assembly"
    ],
    "user": "user3097712",
    "time": "Jul 3, 2014 at 0:06",
    "comments": [
        {
            "user": "Dmitry Janushkevich",
            "text": "<html><body><span class=\"comment-copy\">\n If the control flow reaches that function, it will terminate the process anyway, no matter whether you stepped in or over it. You might want to investigate the exact reason why the function does it.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user3097712",
            "text": "<html><body><span class=\"comment-copy\">\n in my case that what you wrote is not true. At same place where the CALL instruction comes, I step over and do it my work further. The process did not terminate.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Here is my considerations based on your description.\n </p>\n <p>\n  Say you have some function, that you want to step into for analyze purposes. Here is list(non exhaustive) of conditions, that can take debugger down\n </p>\n <ul>\n  <li>\n   Unhandled exception was thrown when you tried to step into(maybe anti-debugging trick)\n  </li>\n  <li>\n   You're trying to step into address, that, actually, doesn't exists(unlikely, but may be)\n  </li>\n </ul>\n <p>\n  Anyway, if you want the community to help you, there is lack of technical details in your topic. Here is the list of things, that worth providing: OS, commands prompted (breakpoints, etc), debugger listing(IMHO, Windbg better).\n </p>\n <p>\n  About \"time shifting\". As you can see, main OS is not suitable for analyzing purposes. Consider doing this in virtual environment. Best practice is to save initial snapshot of all the configuration and go step-by-step through all parts of interest doing snapshots when needed. The advantage of this approach is that you can rollback previous configuration easily without roughly duplication of all the steps.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "see ya",
            "time": "Jul 3, 2014 at 11:17",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  When you say step over, I assume you actually want to not execute that function. This can be done by changing the value of EIP.\n </p>\n <p>\n  In olly you can actually highlight the line you want to skip to, right click, and select\n  <code>\n   New origin here\n  </code>\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "ben_re",
            "time": "Jul 8, 2014 at 15:35",
            "is_accepted": false,
            "comments": []
        }
    ]
}