{
    "title": "Suspicious breakpoint message in ollydbg",
    "link": "https://reverseengineering.stackexchange.com/questions/4812/suspicious-breakpoint-message-in-ollydbg",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I want to set a breakpoint and suddenly the following message appears:\n </p>\n <blockquote>\n  <p>\n   You want to place breakpoint outside the code section. INT3 breakpoint set on data will  not execute and may have disastrous influence on the debugged program. Do you really want to set breakpoint here?\n  </p>\n  <p>\n   Note: you can permanently disable this warning in Options|Security.\n  </p>\n </blockquote>\n <p>\n  Without knowing what that is, I would guess that is not allowed to set the breakpoint.\nSo my question would be:\n </p>\n <p>\n  How can I bypass the annoying message? Or better: what must I do to not see this?\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ollydbg"
    ],
    "user": "user3097712",
    "time": "Jun 17, 2020 at 9:54",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  PE files have several sections like\n  <code>\n   .code\n  </code>\n  ,\n  <code>\n   .data\n  </code>\n  ,\n  <code>\n   .bss\n  </code>\n  etc. Each of the sections have a special purpose, such as the\n  <code>\n   .code\n  </code>\n  section\n  <em>\n   usually\n  </em>\n  contains the programs code i.e. the instructions, the\n  <code>\n   .data\n  </code>\n  sections houses the initialized variables etc.\n </p>\n <p>\n  The above rule is merely a convention followed by compilers. In a packed/obfuscated program, the convention may not always hold true. You can have instructions in data segment and vice-versa. This is done for various reasons like thwarting analysis ,disassembly etc.\n </p>\n <p>\n  When in Ollydbg you try to set a\n  <code>\n   INT3\n  </code>\n  breakpoint on an instruction that happens to be in a section marked for data, Ollydbg would complain and that is the message you see.\n </p>\n <p>\n  The reason for this is suppose that the instruction you set a breakpoint on is actually data. In this case, when the program reads in the value at the address it would read\n  <code>\n   0xCC\n  </code>\n  (INT3 -> 0xCC) instead of the actual value. That can crash the program. Further since this is a read operation, the breakpoint will never be hit.\n </p>\n <p>\n  If you want, you may disable the message in Ollydbg options, however doing that is not always recommended. Instead if you are sure that it is an instruction, you may ignore the warning and set the breakpoint.\n </p>\n <p>\n  The other way is instead of using a\n  <code>\n   INT3\n  </code>\n  breakpoint, set a Hardware breakpoint (HWBP) on execution at the aforesaid address. This way the program would not crash, even if the hwbp was set on data. HWBP's are enforced my the CPU and does not modify the program in any way unlike\n  <code>\n   INT3\n  </code>\n  breakpoints\n </p>\n</div>\n</body></html>",
            "votes": "6",
            "user": "0xec",
            "time": "Jul 9, 2014 at 3:30",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user3097712",
                    "text": "<span class=\"comment-copy\">thank you for your great answer. I have read about Hardware Breakpoints, so then I will try it. Again, thx.</span>",
                    "time": null
                },
                {
                    "user": "user3097712",
                    "text": "<span class=\"comment-copy\">EDIT: Hardware Breakpoint did not work because suddenly the process is terminated before the breakpoint comes. So, I try again a software breakpoint, ignore the message let run ollydbg and it helps</span>",
                    "time": null
                },
                {
                    "user": "0xec",
                    "text": "<span class=\"comment-copy\">@user3097712 It is possible to detect hardware breakpoints as an anti-debugging feature. <b><i><a href=\"http://www.codeproject.com/Articles/30815/An-Anti-Reverse-Engineering-Guide#BpHardware\" rel=\"nofollow noreferrer\">See this</a></i></b></span>",
                    "time": null
                }
            ]
        }
    ]
}