{
    "title": "Dumping firmware through mtdblock device",
    "link": "https://reverseengineering.stackexchange.com/questions/4817/dumping-firmware-through-mtdblock-device",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This is my first attempt at doing some reverse engineering. I'm trying to dump the filesystem off a huawei hg523a TalkTalk router.\n </p>\n <p>\n  The problem is its quite limited in the amount of programs that are on the device. Below are a list of programs i can use.\n </p>\n <pre><code>BusyBox vv1.9.1 (2012-03-05 00:16:52 CST) multi-call binary\nCurrently defined functions:\n        [, [[, arp, ash, cat, chmod, chown, cp, date, echo, ftpget,\n        ftpput, halt, ifconfig, init, kill, killall, linuxrc,\n        ln, ls, mcast, mkdir, mknod, mount, netstat, nslookup,\n        ping, poweroff, ps, reboot, rm, route, sh, sleep, test,\n        top, traceroute, umount, vconfig, wget\n</code></pre>\n <p>\n  So im trying to extract the filesystem to another linux machine so i can go through it more eaisely. I can upload single files with the ftpput command.\n </p>\n <pre><code>cat /proc/mtd\ndev:    size   erasesize  name\nmtd0: 00010000 00001000 \"boot\"\nmtd1: 00001000 00001000 \"flag\"\nmtd2: 003c0000 00001000 \"main\"\nmtd3: 0002d000 00001000 \"config\"\n</code></pre>\n <p>\n  What im trying to do is upload mtdblock0-3 and then mount this on my other machine to explore the folder structure etc.. It looks like from /proc/mounts that it is a squashfs file system.\n </p>\n <pre><code>cat /proc/mounts\nrootfs / rootfs rw 0 0\n/dev/root / squashfs ro 0 0\nnone /dev tmpfs rw 0 0\n/proc /proc proc rw 0 0\nnone /var tmpfs rw 0 0\nnone /tmp tmpfs rw 0 0\nnone /mnt tmpfs rw 0 0\n</code></pre>\n <p>\n  So basically i upload the mtdblock0.\n </p>\n <pre><code>ftpput -s -v -u james -p password -l /dev/mtdblock0 -r ftpdir/mtdblock0 192.168.1.64\n</code></pre>\n <p>\n  and mount it on the other computer with:\n </p>\n <pre><code>root@kali:~/Desktop/talktalk/blocks# mount -t squashfs mtdblock0 /mnt\nmount: wrong fs type, bad option, bad superblock on /dev/loop0,\n       missing codepage or helper program, or other error\n       In some cases useful info is found in syslog - try\n       dmesg | tail  or so\n</code></pre>\n <p>\n  Could anyone guide me in the right direction as to what i might be doing wrong? So it not possible to transfer the filesystem in this way?\n </p>\n <p>\n  thank you in advance for your help.\n </p>\n</div>\n</body></html>",
    "votes": "4",
    "answers": 3,
    "views": "12k",
    "tags": [
        "firmware",
        "embedded",
        "dumping"
    ],
    "user": "Xtrato",
    "time": "Jul 9, 2014 at 9:04",
    "comments": [
        {
            "user": "Dominik Antal",
            "text": "<html><body><span class=\"comment-copy\">\n I don't think question is related to reverse engineering in it's current form, or maybe I just failed to see it. Did you try asking this in sysadmin or askubuntu?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "perror",
            "text": "<html><body><span class=\"comment-copy\">\n @DominikAntal Well, reverse-engineering will depend most of the time of your\n <i>\n  intentions\n </i>\n ... So, it is very subtle to decide when it is (or not) reverse-engineering. In the case of this question, I tend to think that a reverser will be quite interested in dumping a firmware to analyze it... So, I would disagree with your statement.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n Show the hexdump of the first bytes. Most likely it's not Squashfs.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  As the names in /proc/mtd suggest, mtd0 is probably not a file system, but more likely is the boot loader. Likewise, the name of mtd3 suggests that it contains the saved configuration settings (admin password, wireless settings etc).\n </p>\n <p>\n  The \"flags\" and \"main\" names for mtd1 and mtd2 respectively are a bit ambiguous, but I would expect, due to the name and the size, that mtd2 contains the file system. It also probably contains the Linux kernel as well, so the file system may not start at the beginning of mtd2; once you've ftp'd off a copy of mtd2 you'll have to find the start of the file system and dd it out in order to extract/mount it.\n </p>\n <p>\n  As a side note, don't be surprised if once you find the squashfs file system, your Linux host can't mount it. There are many hacked up versions of squashfs, and you may need to find the right squashfs tools for that particular version and run unsquashfs on the image to extract the files.\n </p>\n</div>\n</body></html>",
            "votes": "8",
            "user": "devttys0",
            "time": "Jul 9, 2014 at 14:26",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Xtrato",
                    "text": "<span class=\"comment-copy\">Thanks for your help. Also thank you for your website. I saw your interview on pauldotcom and visited your website from there. It has been invaluable while i attempt to learn much of this stuff. I'm going to have a closer look at mtd2 and see if i can figure it all out. If i remember correctly the firmware modkit has lots of different versions of unsquashfs to try. Ill likely give that a go if i can find the start of the file system.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I found the solution with devttys0's comment.\n </p>\n <p>\n  mtdblock2 contained the file system. This is obvious by the fact that it is larger in size than the other mtd devices. I ftpd this file and I then downloaded the firmware mod kit which has a script which goes through all the unsquashfs versions and attempts to extract the firmware. In this case it worked using version quashfs-3.2-r2-hg612-lzma.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Xtrato",
            "time": "Jul 9, 2014 at 21:41",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You can do cat\n  <code>\n   /proc/mtd\n  </code>\n  for the exact \"image\"\n </p>\n <pre><code>cat /proc/mtd \ndev:    size   erasesize  name\nmtd0: 01000000 00001000 \"whole_flash\"\nmtd1: 00020000 00001000 \"bootloader\"\nmtd2: 00060000 00001000 \"userconfig\"\nmtd3: 004c0000 00001000 \"filesystem1\"\nmtd4: 00300000 00001000 \"kernel1\"\nmtd5: 00300000 00001000 \"kernel2\"\nmtd6: 004c0000 00001000 \"filesystem2\"\n</code></pre>\n</div>\n</body></html>",
            "votes": "0",
            "user": "Vido",
            "time": "Mar 9, 2017 at 17:38",
            "is_accepted": false,
            "comments": []
        }
    ]
}