{
    "title": "Disassemble using an emulator",
    "link": "https://reverseengineering.stackexchange.com/questions/4821/disassemble-using-an-emulator",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I learned the disassembly challenges from\n  <a href=\"https://www.usenix.org/legacy/event/usenix03/tech/full_papers/prasad/prasad_html/node5.html\" rel=\"nofollow\">\n   this link\n  </a>\n  . The following six challenges are listed in that article:\n </p>\n <ol>\n  <li>\n   Data embedded in the code regions\n  </li>\n  <li>\n   Variable instruction size\n  </li>\n  <li>\n   Indirect branch instructions\n  </li>\n  <li>\n   Functions without explicit CALL sites within the executable's code segment\n  </li>\n  <li>\n   Position independent code (PIC) sequences\n  </li>\n  <li>\n   Hand crafted assembly code.\n  </li>\n </ol>\n <p>\n  However, I am thinking about the following disassembly method which seems to solve the above challenges. Assuming we have an executable to be disassembled, an input set that can has 100% coverage of the code, and an emulator (e.g. QEMU). Then, we can instrument the emulator to output each instruction executed by the emulated CPU and the corresponding memory address. After that, we can translate each instruction to assembly instruction, and the whole program is now disassembled.\n </p>\n <p>\n  Could you please tell me why this idea will not/will work?\n </p>\n</div>\n</body></html>",
    "votes": "7",
    "answers": 4,
    "views": "2k",
    "tags": [
        "disassembly",
        "emulation"
    ],
    "user": "ZillGate",
    "time": "Jul 25, 2014 at 21:29",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   an input set that can has 100% coverage of the code\n  </p>\n </blockquote>\n <p>\n  This may be\n  <em>\n   very\n  </em>\n  difficult to achieve, especially if the code behavior depends on something that you don't directly control (time, memory, OS version/environment, random number generator etc.). Additional observations:\n </p>\n <ol>\n  <li>\n   actually executing all that code may take more time than you can afford\n  </li>\n  <li>\n   executing some parts of the code may require conditions you cannot satisfy (e.g. a specific hardware peripheral)\n  </li>\n  <li>\n   you will miss code which is present in binary but never executes (dead code). In some cases such code can reveal additional information about the binary\n  </li>\n  <li>\n   your approach may discover all code, but it will likely miss a lot of\n   <em>\n    data\n   </em>\n   .\n  </li>\n </ol>\n <p>\n  However, it does not mean that the approach is completely useless. In fact there's already been some work in this area. For example, check out the S2E (Selective Symbolic Execution) project:\n </p>\n <p>\n  <a href=\"https://sites.google.com/site/dslabepfl/proj/s2e\" rel=\"noreferrer\">\n   https://sites.google.com/site/dslabepfl/proj/s2e\n  </a>\n </p>\n <blockquote>\n  <p>\n   Conceptually, S2E is an automated path explorer with modular path analyzers: the explorer drives the target system down all execution paths of interest, while analyzers check properties of each such path (e.g., to look for bugs) or simply collect information (e.g., count page faults). Desired paths can be specified in multiple ways, and one can either combine existing analyzers to build a custom analysis tool, or write new analyzers using the S2E API.\n  </p>\n  <p>\n   S2E helps make analyses based on symbolic execution practical for large software that runs in real environments, without requiring explicit modeling of these environments.\n  </p>\n </blockquote>\n</div>\n</body></html>",
            "votes": "10",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   Can we use dynamic analysis (or just emulator) to achieve 100% code coverage?\n  </p>\n </blockquote>\n <p>\n  No, if I was right, it equals to Turing Halting problem.\n </p>\n <blockquote>\n  <p>\n   emulator based disassemble approach\n  </p>\n </blockquote>\n <p>\n  I am afraid this may not be a very new idea, and code coverage is a big issue.\n </p>\n <p>\n  But it is always possible that you find a different angle and make some contributions in related area.\n </p>\n <p>\n  An interesting paper in last year's tier-one security conference CCS 2013\n  <a href=\"https://www.utdallas.edu/~zxl111930/file/CCS13.pdf\" rel=\"nofollow\">\n   Obfuscation Resilient Binary Code Reuse through\n  </a>\n  even push related ideas future.\n </p>\n <p>\n  It leverages an emulator to disassemble code, dynamic taint analysis to lift concrete value into symbols, and somehow re-use the disassembled asm code (embedded in C code.)\n </p>\n <p>\n  I wish it could be helpful\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "lllllllllllll",
            "time": "Oct 14, 2014 at 20:30",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  If you want a simple answer. Code coverage. If you only trace called/executed code, how do you know you found all the code.\n </p>\n <p>\n  Emulation is good to understand code when it has memory altering behavior or to understand code. Like in one of my projects I knew I had some double math functions implemented in software. So running an emu to see the results was useful to see the results to identify division verse addition functions. But the emu if started from the entry point would get into an infinite loop as the external\nInterrupts did not fire at the expected times.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Simeon Pilgrim",
            "time": "Jul 10, 2014 at 3:43",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ZillGate",
                    "text": "<span class=\"comment-copy\">Thanks! For the code coverage, many programs are shipped with a test suite. And we could assume that they can cover most of the code.</span>",
                    "time": null
                },
                {
                    "user": "Simeon Pilgrim",
                    "text": "<span class=\"comment-copy\">@zillgate That would be a very flawed assumption</span>",
                    "time": null
                },
                {
                    "user": "broadway",
                    "text": "<span class=\"comment-copy\">In practice, test suites often cover a very small percentage of the basic blocks. Much smaller than one would hope.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  <strong>\n   Dis-assembly as a technique isn't a problem\n  </strong>\n  As long as you know the boundaries of your binary file (where the data/code starts) and you know the Instrustion Set.\n </p>\n <p>\n  If you know you have UNIX ELF file on x86, you can just run\n  <code>\n   objdump\n  </code>\n  on it to get disassembled output:\n </p>\n <p>\n  <code>\n   objdump -d <file>\n  </code>\n </p>\n <p>\n  <strong>\n   Their research was on security\n  </strong>\n  . They wanted to read the code boundaries, understand what certain sections of code do and then overwrite some of them. It's much harder problem (\n  <strong>\n   e.g.: when do you know the fragment being overwritten isn't actually supposed to be there?\n  </strong>\n  )\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Wojciech A. Koszek",
            "time": "Jul 10, 2014 at 2:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ZillGate",
                    "text": "<span class=\"comment-copy\">Thank you! But if disassembly as a technique isn't a problem, then why the article in the question mentioned those challenges? And based on that article, there must be some binary cases that objdump cannot correctly disassemble, right?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">\"As long as you know the boundaries of your binary file (where the data/code starts)\" - that's <b>exactly</b> the problem that is difficult to solve when you only have the raw binary</span>",
                    "time": null
                },
                {
                    "user": "ZillGate",
                    "text": "<span class=\"comment-copy\">@IgorSkochinsky By \"only have the raw binary\", do you mean the binary cannot be executed? If so, then the emulator idea won't work, and we need to use linear sweeping or recursive traversal...</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@ZillGate: no, I mean we have an executable but we don't know the boundaries where exactly is data and where's code (besides the entrypoints). E.g. <code>objdump</code> suggested by Wojciech has issues when you have jumptables intermixed with code.</span>",
                    "time": null
                },
                {
                    "user": "Wojciech A. Koszek",
                    "text": "<span class=\"comment-copy\">@ZillGate You'll get overall understanding of what program is doing that way, but since the program doesn't execute all its code always, you won't be able to fully reconstruct (its source code).  Direction which you're thinking about is right, but it's hard to make it work well.  <b>For example:</b> QEMU accepts disk images or ELF files.If you have an ELF file it means you can use better tools than QEMU for binary analysis.   Disk image assumes you're running without an OS..</span>",
                    "time": null
                }
            ]
        }
    ]
}