{
    "title": "Set up an interrupt handler at kernel mode",
    "link": "https://reverseengineering.stackexchange.com/questions/5937/set-up-an-interrupt-handler-at-kernel-mode",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm looking for\n  <em>\n   something\n  </em>\n  (a tool?) that can help me achieve my current goal: write a driver that can momentously interrupt the execution of the operating system (Linux, in my case), let me be able to run some code, and then resume the operating system execution, letting me access information on the pre-interruption context afterwards.\n </p>\n <p>\n  Following some advice, I've tried the well-known Intel Pin (a binary instrumentation framework), only to discover that in fact, it can only operate at user-level, while I need to access kernel mode. After some research, I've then found some interesting threads in this group, namely\n  <a href=\"https://reverseengineering.stackexchange.com/questions/1724/how-can-i-use-dynamorio-or-something-similar-in-linux-kernel-space\" title=\"this\">\n   this\n  </a>\n  and\n  <a href=\"https://reverseengineering.stackexchange.com/questions/1797/kernel-level-dynamic-binary-instrumentation?lq=1\">\n   this\n  </a>\n  . Currently, my doubt is which tool is best suited for my needs. I'm leaning towards DynamoRio Kernel (DRK), but besides the other frameworks/tools mentioned in both threads, I found some more that seem to somewhat relate to what I'm looking for, namely Valgrind, GILK (although this is pretty deprecated, so it's not an option) or QEMU.\n </p>\n <p>\n  The thing is, I'm a newbie in the area, so probably some of the tools I've mentioned in the last paragraph don't even apply to what I'm looking for. Can someone help me in choosing the best framework for my purposes?\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 0,
    "views": "131",
    "tags": [
        "tools",
        "linux",
        "kernel-mode",
        "instrumentation"
    ],
    "user": "João Fernandes",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "<html><body><span class=\"comment-copy\">\n Maybe you should mention what problem you're trying to solve with this approach.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "João Fernandes",
            "text": "<html><body><span class=\"comment-copy\">\n I'm trying to figure out a way of injection a small fault into the Linux kernel. I'm a new researcher on this field, and so after searching a little bit, I came with this kind of framework/application shortlist. To start, I would like to make a bit-flip in a CPU register, at kernel mode, and so I'm trying to figure out which of the tools mentioned above best suits my needs. Can you help me on that? Valgrind seems to only work at user level, for instance, but I still need to discover if QEMU, Franary or BT Kernel are good choices (DRK is looking good, though). Thanks.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "João Fernandes",
            "text": "<html><body><span class=\"comment-copy\">\n Can't anyone help me?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}