{
    "title": "How to figure out which imported function(s) in a virus determine its behaviour?",
    "link": "https://reverseengineering.stackexchange.com/questions/5949/how-to-figure-out-which-imported-functions-in-a-virus-determine-its-behaviour",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I want to know how to find the functions which is interesting in malware tools.\nFor example, I have a sample of unknown virus (this sample is\n  <code>\n   lab01-01.exe\n  </code>\n  in the book practical malware analysis\n  <code>\n   lab1-01.dll\n  </code>\n  ). It is not packed.\n </p>\n <p>\n  I am supposed to find out what does this malware by knowing the imported DLLs and the functions it uses. Here are the imported functions in the executable file\n  <code>\n   lab01-01.exe\n  </code>\n  :\n </p>\n <pre><code>KERNEL32.dll :\nCloseHandle\nUnmapViewOfFile\nIsBadReadPtr\nMapViewOfFile\nCreateFileMappingA\nCreateFileA\nFindClose\nFindNextFileA\nFindFirstFileA\nCopyFileA\n</code></pre>\n <p>\n  And from\n  <code>\n   MSVCRT.dll\n  </code>\n  :\n </p>\n <pre><code>_getmainards\n_p_initenv\n_p_commode\n_p_fmode\n_set_apps_typr\n_setusermatherr\n_adjust_fdiv\n_controlfp\n_except_handler3\n_exit\n_initterm\n_stricmp\n_XcptFilter\nexit\nmalloc\n</code></pre>\n <p>\n  But, I didn't find any function imported from\n  <code>\n   lab01-01.dll\n  </code>\n  .\n </p>\n <p>\n  I also want to know why, although the book mentioned that both the executable file and DLL are related (it should be imported).\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 3,
    "views": "6k",
    "tags": [
        "windows",
        "malware",
        "static-analysis",
        "dll",
        "pe"
    ],
    "user": "Ahmed",
    "time": "Jul 28, 2014 at 7:18",
    "comments": [
        {
            "user": "Dominik Antal",
            "text": "<html><body><span class=\"comment-copy\">\n You could use Apimonitor or Sysinternal's tools.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user45891",
            "text": "<html><body><span class=\"comment-copy\">\n The msvcrt imports are mostly normal, actually I think they are used by the CRT. The kernel32 functions on the other hand search for files and then manipulate them. If you already know that it is malware that points to a file infecting virus.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Dlls can not only be imported statically but also dynamically. For the dynamic case, it uses\n  <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/ms684175(v=vs.85).aspx\" rel=\"nofollow\">\n   <code>\n    LoadLibrary\n   </code>\n  </a>\n  to load the dll, and\n  <a href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/ms683212(v=vs.85).aspx\" rel=\"nofollow\">\n   <code>\n    GetProcAddress\n   </code>\n  </a>\n  to resolve the address of the function it needs.\n </p>\n <p>\n  If the dlls are imported statically, then a simple dependency walking will give you information about each dll its imports and also the function within each of them it uses. This information is actually present in the PE header which a tool like\n  <em>\n   dependency walker\n  </em>\n  shows you.\n </p>\n <p>\n  If the dll is imported dynamically, then walking through the imports will not give you any idea about the dlls and functions it uses. In such a case, debug the application (if possible). Set a breakpoint on\n  <code>\n   kernel32.LoadLibraryA\n  </code>\n  /\n  <code>\n   kernel32.LoadLibraryW\n  </code>\n  or even the undocumented\n  <code>\n   ntdll.LdrLoadDll\n  </code>\n  and run the app. When the breakpoint is hit you immediately know which dll it is trying to import. Similarly setting a breakpoint on\n  <code>\n   GetProcAddress\n  </code>\n  will reveal the function the application wants to use.\n </p>\n <p>\n  I am talking about the simplest case here. You may encounter malware which bypasses the LoadLibrary mechanism totally, by implementing its own PE loader. See\n  <em>\n   <a href=\"http://www.joachim-bauch.de/tutorials/loading-a-dll-from-memory/\" rel=\"nofollow\">\n    this\n   </a>\n  </em>\n  page for such an example. Similarly\n  <code>\n   GetProcAddress\n  </code>\n  can be bypassed too, by manually parsing the import tables.\n </p>\n <p>\n  <a href=\"http://books.google.co.uk/books?id=FQC8EPYy834C&lpg=PP1&dq=practical%20malware%20analysis&pg=PA453#v=twopage&q&f=true\" rel=\"nofollow\">\n   This chapter\n  </a>\n  from the book\n  <em>\n   Practical Malware Analysis\n  </em>\n  gives you a list of some important Windows API functions which can be used to get some insight into the workings of a malware.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "0xec",
            "time": "Jul 28, 2014 at 7:59",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Extreme Coders has provided a good answer about the IAT (Import Address Table).\n </p>\n <p>\n  This question is so abroad I was originally not going to answer but I'll try quickly summarise the sort of tools and things you'll want to look for.\n </p>\n <p>\n  Firstly, let me tell you what any imported or exported function can't really say it's used primary malware. For example, DeleteFile can be used to delete important files is considered as malware but the actual API itself can be used for common non-related malware operations.\n </p>\n <p>\n  If you want to see what APIs are actually been executed you'll want to use something like:\n  <a href=\"http://www.rohitab.com/apimonitor\" rel=\"nofollow\">\n   http://www.rohitab.com/apimonitor\n  </a>\n  this will give you much better graphical presentation and lists all the function parameters for that known API too. So more rich data to work with. As looking at long list is too overwhelming.\n </p>\n <p>\n  After you have found the APIs which look suspicious then you can get into a debugger and start investigating the usage of the API which comes a complexed field. You'll have to know how to software is expected to work for example.\n </p>\n <p>\n  Let's say you have a text editor just a simple notepad program you have downloaded.\nYou'll just review APIs for unusual activity such as:\n </p>\n <ol>\n  <li>\n   If you see network actvity on a simple text editor - Why does it need networking? Is it malicious related or just an auto patcher for self updating?\n  </li>\n  <li>\n   If you see process modification external or internal - Why is it doing this? Review the related APIs to memory modifying\n   <code>\n    WriteProcessMemory\n   </code>\n   or lower level API is\n   <code>\n    NtWriteVirtualMemory\n   </code>\n   .\n  </li>\n </ol>\n <p>\n  Though really you can't rely on just checking APIs as you can use\n  <code>\n   syscall\n  </code>\n  directly which would bypass any listed APIs.\n </p>\n <p>\n  To determine malware you'll want to use things such as:\n  <a href=\"http://camas.comodo.com/\" rel=\"nofollow\">\n   http://camas.comodo.com/\n  </a>\n </p>\n <p>\n  You'll want to get yourself varies tools such as:\n </p>\n <ol>\n  <li>\n   Virtual Machine (VMWare, Virtual PC or something similar). As you don't want to get your host machine infected with malware, do you? Though, do note that complexed malware can break out of virtual machines!\n  </li>\n  <li>\n   Snapshot software to compare before and after execution of file system and registry. There is a good one developed by Microsoft. I'll dig it up for you when I'm at home. So, take snapshot before you run the application and after.\n  </li>\n  <li>\n   Get yourself a debugger such as IDA PRO (ideally but very expensive) otherwise OllyDbg is my next favourite debugger.\n  </li>\n </ol>\n <p>\n  Maybe I am getting off-topic? Anyway, I hope this information was useful. If so, I'll expand my answer.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Paul",
            "time": "Jul 28, 2014 at 9:08",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  While others have already provided some answers, I would like to add some additional points.\n </p>\n <p>\n  You could code a pintool (DBI) which logs all the API calls. You could add some filters in your pintool to reduce the amount of API calls you log. Using a pintool has an advantage since anti debugging techniques used by malwares would not have an effect on it. Of course, we are assuming that the malware is not trying to protect itself from DBI frameworks. However, if you set breakpoints on LoadLibrary and GetProcAddress to see which libraries are loaded dynamically and which function addresses are resolved, you could be effected by anti debugging techniques used by the malware. Before you hit the breakpoint, the malware would have already discovered that it is being debugged and alter the program flow.\n </p>\n <p>\n  I would suggest you not to conclude the functionality of a  malware only by looking at the API names imported from different modules. A sequence of API calls can sometimes indicate malicious activity. For instance,\n </p>\n <pre><code>CreateProcessW\nVirtualAllocEx\nWriteProcessMemory\nWriteProcessMemory\nGetThreadContext\nSetThreadContext\nResumeThread\n</code></pre>\n <p>\n  Now, you could see these API names imported from kernel32.dll when you open the binary in a software like CFF explorer, however to conclude the usage of these APIs, an API trace would help. In this case, it is a standard method used by several binaries to perform code injection into the address space of another process.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "c0d3inj3cT",
            "time": "Jul 28, 2014 at 15:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}