{
    "title": "How to do static analysis to identify pointer from concrete value in assembly?",
    "link": "https://reverseengineering.stackexchange.com/questions/5984/how-to-do-static-analysis-to-identify-pointer-from-concrete-value-in-assembly",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  So basically I am writing some code to do analysis work on disassembled assembly code.\n </p>\n <p>\n  I am trapped in this issue for a while, here is an simple example of a disassembled asm code by objdump, basically all the address symbols have been translated into concrete value.\n </p>\n <pre><code>1. mov 0x8408080, %eax\n2. ....\n3. call *%eax\n</code></pre>\n <p>\n  So basically for the above example, it is easy to determine that\n  <code>\n   0x8408080\n  </code>\n  used in line 1 is an address of code, and I know it is relatively easy to heuristically consider all the value falling into the range of\n  <code>\n   .text section\n  </code>\n  as a pointer.\n </p>\n <p>\n  However, how to use static analysis to automatically identify this issue? (I want to write a tool to analyze large amount of code as accurate as possible)\n </p>\n <p>\n  I know somehow I should use\n  <strong>\n   constant propagation\n  </strong>\n  to forwardly do the analysis, but  basically as I am new to program analysis, I just don't know actually where to start..\n </p>\n <p>\n  Does anyone have experiences like this? Or is there any implemented tools I can look for help..?\n </p>\n</div>\n</body></html>",
    "votes": "10",
    "answers": 2,
    "views": "2k",
    "tags": [
        "disassembly",
        "assembly",
        "x86",
        "static-analysis"
    ],
    "user": "lllllllllllll",
    "time": "Jul 31, 2014 at 1:28",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Some decompilers (\n  <a href=\"http://users.ece.cmu.edu/~ejschwar/pres/usenix13.pdf\" rel=\"noreferrer\">\n   phoenix\n  </a>\n  for example) use\n  <a href=\"http://pages.cs.wisc.edu/~bgogul/Research/Papers/cc04.pdf\" rel=\"noreferrer\">\n   Value Set Analysis\n  </a>\n  to recover the cfg.\n </p>\n <h1>\n  Paper Abstract\n </h1>\n <blockquote>\n  <p>\n   This paper concerns static-analysis algorithms for analyzing binary executables. The aim of the work is to recover intermediate representations (IRs) that are similar to those that can be created for a program written in a high-level language. Our goal is to perform this task for programs such as viruses, worms, and mobile code. For such programs, symbol-table and debugging information is either entirely absent, or cannot be relied upon if present; hence, the analysis described in the paper makes no use of symbol-table/debugging information.\n  </p>\n </blockquote>\n <p>\n  The main analysis discussed in the paper, called\n  <em>\n   value-set analysis\n  </em>\n  , tracks address-valued and integer-valued quantities simultaneously. It is related to pointer-analysis algorithms that have been developed for programs written in high-level languages, which determine an over-approximation of the set of variables whose addresses each pointer variable can hold. At the same time, value-set analysis is similar to range analysis and other numeric static-analysis algorithms that over-approximate the integer values that each variable can hold.\n </p>\n <p>\n  The techniques described in the paper have been implemented as part of CodeSurfer/x86, a prototype tool for browsing (``surfing''), inspecting, and analyzing x86 executables.\n </p>\n</div>\n</body></html>",
            "votes": "6",
            "user": "perror",
            "time": "Jul 31, 2014 at 6:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "lllllllllllll",
                    "text": "<span class=\"comment-copy\">Thank you for your answer. I actually have read some papers about VSA. Basically, is it the right way to use VSA..? It is doable to leverage VSA on analyzing the \"candidacy of indirect control flow transfer\", which is a extremely critical issue in reverse engineering based static analysis. However, IMHO, I can not figure the relation between VSA and what I proposed..</span>",
                    "time": null
                },
                {
                    "user": "lllllllllllll",
                    "text": "<span class=\"comment-copy\">anyway, CodeSurfer/x86 is not open source, and I find it really hard to even somehow re-implement a toy version only targeting on the issue I presented...</span>",
                    "time": null
                },
                {
                    "user": "broadway",
                    "text": "<span class=\"comment-copy\">It's not the only option of course. A simpler option, which is also quite successful, is simple recursive disassembly augmented with heuristics. This is the approach ida takes, to good practical effect. As for open source, I believe vine implements vsa and bap has at least a partial implementation per this blog post in 2012 <a href=\"http://edmcman.bitbucket.org/blog/2012/07/23/cfg-recovery-in-bap/\" rel=\"nofollow noreferrer\">edmcman.bitbucket.org/blog/2012/07/23/cfg-recovery-in-bap</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Basically, distinguish between values, addresses and instruction is the role of a\n  <strong>\n   type recovery system\n  </strong>\n  .\n </p>\n <p>\n  There is an excellent seminal paper from Alan Mycroft about a technique called\n  <a href=\"http://www.cl.cam.ac.uk/~am21/papers/esop99.ps.gz\" rel=\"nofollow\">\n   type-based decompilation\n  </a>\n  (ESOP'99) which might give you some ideas on how to do.\n </p>\n <p>\n  Another, more recent, paper describes the technique that is currently used in the\n  <a href=\"http://users.ece.cmu.edu/~ejschwar/pres/usenix13.pdf\" rel=\"nofollow\">\n   Phoenix decompiler\n  </a>\n  which is called:\n  <a href=\"http://users.ece.cmu.edu/~aavgerin/papers/tie-ndss-2011.pdf\" rel=\"nofollow\">\n   TIE: Principled Reverse Engineering of Types in Binary Programs\n  </a>\n  (NDSS'11) written by people from CMU and that give an in-depth of the technique they use.\n </p>\n <p>\n  Apart from that, the reconstruction of the\n  <em>\n   shape\n  </em>\n  of the types (array, struct, etc.) can be done by using the\n  <a href=\"https://research.cs.wisc.edu/wpis/papers/vmcai07.invited.pdf\" rel=\"nofollow\">\n   DIVINE technique\n  </a>\n  (VMCAI'07) by Reps and Balakrishnan. A more extensive\n  <a href=\"http://pages.cs.wisc.edu/~bgogul/Research/Journal/toplas10.pdf\" rel=\"nofollow\">\n   journal paper\n  </a>\n  (TOPLAS'10) has been also published by both authors that gather all their work about the topic.\n </p>\n <p>\n  Still, there are a lot of other works on this domain, but I believe the papers I cited above to be, more or less, the current trend in the 'type-recovery' domain.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "perror",
            "time": "Jul 31, 2014 at 11:15",
            "is_accepted": false,
            "comments": []
        }
    ]
}