{
    "title": "CRC with OR but seed differ every time the protocol restart",
    "link": "https://reverseengineering.stackexchange.com/questions/6036/crc-with-or-but-seed-differ-every-time-the-protocol-restart",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It's some days I'm trying to understand how this protocol works without any success. I need some help.\n </p>\n <p>\n  Basically I'm sniffing an UART signal. 115200 8N1 \nI understood what's happening under the hood of the protocol. It is based on xor. Here are a couple of examples:\n </p>\n <pre><code>A0 82 00 01 02 14 81 6A 76 \nA0 82 00 02 02 14 81 6A 75 \n</code></pre>\n <p>\n  As you can see the 01 to 02 change is reflected to 76 to 75. The data is xor-ed nibble to nibble.\n </p>\n <p>\n  Here's come the problem. The day after I turn on the system and I made another acquisition. Surprise the Checksum change. Apparently also the way the crc is calculated differ because not the bit to change are 2 and 3 of last byte.\nthe data changes from D0 => DC while before it was from 76 to 75.\n </p>\n <pre><code>A0 82 00 01 02 14 81 14 D0 \nA0 82 00 02 02 14 81 14 DC \n</code></pre>\n <p>\n  Actually, I discovered that in the full transmission I have a single message that is changing every time. It is a 5 byte message in the format:\n </p>\n <pre><code>A0 07 0B 40 44\nA0 07 EA 1B 58\n</code></pre>\n <p>\n  The 2 messages just posted was taken from the 2 transmission taken before.\n </p>\n <p>\n  I think that the two A0 messages sends some type of CRC feed and some way for calculating it. Second strange thing, I don't understand what kind of CRC is applied in the first message. It looks strange that the message who need to fix a CRCc base seed is non CRC'ed.\n </p>\n <p>\n  Do somebody have some idea on what protocol could be? Something similar?\n </p>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 0,
    "views": "127",
    "tags": [
        "serial-communication",
        "protocol"
    ],
    "user": "andyinno",
    "time": "Aug 7, 2014 at 12:26",
    "comments": [],
    "answers_data": []
}