{
    "title": "What methodology can be used to change code flow atomically during program execution?",
    "link": "https://reverseengineering.stackexchange.com/questions/6052/what-methodology-can-be-used-to-change-code-flow-atomically-during-program-execu",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have been reading a lot about the different techniques for Windows API hooking  (a technique I'm particularly fascinated by and fond of), and it seems a major problem in implementing a\n  <em>\n   realiable\n  </em>\n  hook function is ensuring that the hook is written in a way that is thread-safe. Of course, there are some techniques where this problem has been solved or can be solved trivially, such as\n  <a href=\"https://devblogs.microsoft.com/oldnewthing/20110921-00/?p=9583\" rel=\"nofollow noreferrer\">\n   hotpatching the Windows API\n  </a>\n  , but hot patching is not guaranteed to work on all win32 or third party API functions and the techniques that do support hooking them are not normally thread-safe.\n </p>\n <p>\n  A very common technique that is has problems caused by multithreading is a inline hook that replaces the normal function prologue code with a\n  <a href=\"http://jbremer.org/x86-api-hooking-demystified/\" rel=\"nofollow noreferrer\">\n   jump instruction to the hook procedure\n  </a>\n  , and then calls the original function as needed through a trampoline.\n </p>\n <p>\n  There are several inherent issues to the inline hook technique, which makes it a very complicated method to use and debug. A primary issue is as I mentioned, that it is not safe in a orthodox multithreaded environment in the real world. This is due to that when changing the bytes of the function, you can not guarantee that the instruction pointer will not be in the middle of your newly injected code, which may then cause the target application to crash from executing an invalid mix of the old opcodes mixed with the opcodes you inserted.\n </p>\n <p>\n  There are some solutions to this problem, with one being suspending all the threads in the process and then checking the instruction pointer in each thread to ensure that no thread is currently executing the target instructions you wish to replace. Then if there happens to be a thread or two executing that particular function, then you can respond accordingly by doing something such as performing a stack trace to place a breakpoint at the return address, resuming the thread, and then handling the exception when the thread has returned from the target function.\n </p>\n <p>\n  Of course, this method is still unsafe, because there is nothing stopping one sneaky thread from using\n  <code>\n   CreateThread()\n  </code>\n  before you can suspend all of the running threads in the process (some applications on my computer run with 40+ threads at once). There could even be a related process that uses\n  <code>\n   CreateRemoteThread()\n  </code>\n  in your target application and then calls the function you are hooking before it's safe.\n </p>\n <p>\n  A solution to that problem could be trying to debug the process and receive notifications of when a process creates a new thread, and then respond by suspending that thread. Of course, many event notification systems provided by the Windows    API or a third party API will not be sent in real time, which may allow that thread to perform an unsafe operation before it is suspended.\n </p>\n <p>\n  Another solution could be to statically patch the executable with the hook function before the process is launched, presumably by hooking the EAT/IAT. This is not an option for me because I need to have an implementation that will work\n  <em>\n   process wide\n  </em>\n  , regardless of how a function is resolved or in the event of a new unhooked module calling the function.\n </p>\n <p>\n  There are many other issues to overcome with the inline hook technique that I did not mention.  Which brings me back again to my question:\n </p>\n <blockquote>\n  <p>\n   What methodology can be used to change code flow atomically during program execution ?\n  </p>\n </blockquote>\n <p>\n  I was curious to see if there was a more robust solution out there that overcomes some of the shortcomings of the methods I covered in this post.\n </p>\n <p>\n  <strong>\n   Please no third party library suggestions for hooking functions. I want to implement my own for the educational benefits.\n  </strong>\n </p>\n <p>\n  I prefer hooking technique documentation and examples that use the C programming language.\n </p>\n <p>\n  My processor is an AMD Athlon II X2 250 that is x86-x64 compatible, and my operating system is Windows 7.\n </p>\n</div>\n</body></html>",
    "votes": "11",
    "answers": 3,
    "views": "1k",
    "tags": [
        "windows",
        "x86",
        "c",
        "function-hooking",
        "x86-64"
    ],
    "user": "CaptainObvious",
    "time": "Jul 4, 2022 at 19:17",
    "comments": [
        {
            "user": "0xec",
            "text": "<html><body><span class=\"comment-copy\">\n Check out\n <i>\n  <a href=\"http://www.ksplice.com/doc/ksplice.pdf\" rel=\"nofollow noreferrer\">\n   this\n  </a>\n </i>\n paper; particularly in the section\n <code>\n  5.2 Capturing the CPUs to update safely\n </code>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "CaptainObvious",
            "text": "<html><body><span class=\"comment-copy\">\n Interesting, but I do not know of an equivalent operation to use on Windows for the linux function\n <code>\n  stop_machine\n </code>\n .\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Ta Thanh Dinh",
            "text": "<html><body><span class=\"comment-copy\">\n I think a dynamic code instrumentation framework (e.g. PIN, DynInst) may help, because the instrumentation will be realized \"transparently\" from the program's codes. For example, the paper about DynInst\n <a href=\"http://www.cs.umd.edu/~hollings/papers/apijournal.pdf\" rel=\"nofollow noreferrer\">\n  An API for Runtime Code Patching\n </a>\n says: \"...The API is designed so that a single instrumentation process can insert snippets into multiple processes executing on a single machine...\". Here, snippets are injected codes.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  A sketch of how to implement your own patching system, where the length of the replacement instruction is less than or equal to the length of the instruction that you want to patch:\n </p>\n <ol>\n  <li>\n   Make sure that none of your code depends on any of the code that you will want to patch. This is an issue of re-entrancy. If you patch code that your patching system will use, then you might deadlock / block / raise an infinite number of signals. A common solution is to do things like re-implement the subset of\n   <code>\n    libc\n   </code>\n   that you need, or statically link against some other implementation of\n   <code>\n    libc\n   </code>\n   . Symbol versioning can help ensure that no other libraries link against your version of\n   <code>\n    libc\n   </code>\n   (or\n   <code>\n    libc\n   </code>\n   -like functions) at runtime.\n  </li>\n  <li>\n   Have a dedicated patching \"master\" thread. If you're on linux, then this patching thread can be an external process that controls the program via\n   <code>\n    ptrace\n   </code>\n   . An alternative is to dynamically elect a master thread from one of the threads that gets signalled (mentioned in the next point).\n  </li>\n  <li>\n   Install a signal handler such that your patching thread can signal all other threads to stop and block on a condition variable. Obviously, make sure that your patcher thread does not signal itself. You might need to double check that in the time it took you to signal all threads (that you knew about), that no more new threads have been created.\n  </li>\n  <li>\n   Now you can patch code. Change the memory protection of the pages of code containing what you want to patch so that they are readable, writeable, but not executable. Make sure the code you're using doesn't appear on the same page(s)! Change the code. Change the memory protection of that code back to readable, executable, but not writeable.\n  </li>\n  <li>\n   Signal your condition variable / threads to wake up.\n  </li>\n  <li>\n   When your threads wake up from being blocked on the condition variable in their signal handlers, they need to execute a synchronizing instruction, e.g.\n   <code>\n    CPUID\n   </code>\n   , before executing the patched code. This is so that the old versions of the code do not remain in any instruction prefetch caches/buffers/whatever. Intel's software optimization manual goes into a few details here. By the way, watch out about patching the concurrency/signal mechanisms that you use to implement signal/wait/etc!\n  </li>\n  <li>\n   Then the threads will return from the signal handler to resume execution where they were signalled.\n  </li>\n </ol>\n <p>\n  Now, what to do if you want to patch an\n  <code>\n   N\n  </code>\n  byte instruction with an\n  <code>\n   M\n  </code>\n  byte instruction such that\n  <code>\n   M > N\n  </code>\n  ? We'll apply roughly the same technique, but we'll modify the return addresses of the signalled threads to point into a copy of the original instructions that include your patch\n  <code>\n   P\n  </code>\n  .\n </p>\n <p>\n  For example, lets say you have instructions\n  <code>\n   I1; I2; I3; I4; ...\n  </code>\n  , and your patch\n  <code>\n   P\n  </code>\n  , if placed, would end up as:\n  <code>\n   P; I3_tail_garbage; I4; ...\n  </code>\n  .\n </p>\n <p>\n  Then you could create a patch entrypoint\n  <code>\n   P; I1_copy; I2_copy; I3_copy; jmp &I4;\n  </code>\n  at address\n  <code>\n   patch\n  </code>\n  . You will modify some of the the return addresses in the signal handlers as follows:\n </p>\n <ul>\n  <li>\n   If\n   <code>\n    RA == &I1\n   </code>\n   , then make it point to:\n   <code>\n    P; I1_copy; I2_copy; I3_copy; jmp &I4;\n   </code>\n   .\n  </li>\n  <li>\n   If\n   <code>\n    RA == &I2\n   </code>\n   , then make it point to:\n   <code>\n    I2_copy; I3_copy; jmp &I4;\n   </code>\n  </li>\n  <li>\n   If\n   <code>\n    RA == &I3\n   </code>\n   , then make it point to:\n   <code>\n    I3_copy; jmp &I4;\n   </code>\n  </li>\n </ul>\n <p>\n  Patch\n  <code>\n   I1; I2; I3; I4; ...\n  </code>\n  to do the following:\n  <code>\n   jmp patch; int3; ...; int3; I4; ...\n  </code>\n  .\n </p>\n <p>\n  <strong>\n   Note:\n  </strong>\n  When copying code, you need to re-relativize it if your instructions somehow read from the instruction pointer. For example, if\n  <code>\n   I1\n  </code>\n  ,\n  <code>\n   I2\n  </code>\n  , or\n  <code>\n   I3\n  </code>\n  are branch instructions, or compute a\n  <code>\n   RIP\n  </code>\n  -relative address, then they will potentially need to be widened/modified/replaced with equivalent instructions.\n </p>\n <p>\n  Another approach is to patch each of\n  <code>\n   I1\n  </code>\n  ,\n  <code>\n   I2\n  </code>\n  , and\n  <code>\n   I3\n  </code>\n  . If you do this, then you must start by patching only the\n  <em>\n   first\n  </em>\n  byte of each of these instructions, and only with an\n  <code>\n   int3\n  </code>\n  . This can be done safely, even while other threads are executing the code being patched. However, you\n  <em>\n   cannot\n  </em>\n  safely modify the other bytes of these instructions if other threads are concurrently executing those instructions. This is because those instructions might have been prefetched, and once that has happened, they are no longer a cohesive unit.\n </p>\n <p>\n  Figuring out the right protocol to handle the cases where threads concurrently execute the\n  <code>\n   int3\n  </code>\n  s is tricky, but I think it can be handled by following a similar methodology to above approach of duplicating the first few instructions so that you guarantee that those instructions aren't lost, but you also capture threads executing code that falls within your patch region.\n </p>\n <p>\n  I am not familiar with the Windows environment, so the\n  <code>\n   CreateRemoteThread\n  </code>\n  issue sounds tricky, but I think installing\n  <code>\n   int3\n  </code>\n  instructions into the code as well as protecting the code from execution while you search for threads to signal might be sufficient. You might also consider having your master patching thread go to sleep for a short period of time.\n </p>\n <p>\n  Finally, some good references to look at are Kprobes and RCU stuff as well, as the problem faced by some \"extra\" thread seeing the old or the new version (or something in-between) is a major concern with RCU. As a concluding remark, watch out about the language of the Intel manual w.r.t. cache coherency and the icache. A lot of text can be interpreted as if atomic writes to the data caches will be represented in the icache, but in practice, this isn't guaranteed to be true (especially where prefetching is concerned), and there are some important CPU errata on the issue that make the problem harder than it first appears.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "Peter Goodman",
            "time": "Aug 15, 2014 at 18:19",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This is a good question, and I would argue there is no 100% safe method to patch a running windows process, unless you actively debug it, and even then there are probably edge cases.  You could eliminate many potential problems, but I feel that potential threading problems couldn't be entirely eliminated for generic purposes.\n </p>\n <p>\n  This leaves a couple practical options in my opinion:\n </p>\n <p>\n  1.)  Suspend the process, patch your code, and resume execution.  Either all threads are suspended or they aren't, this is easily detectable if you have the rights to patch the process to begin with. This is my preferred method, though anti-debug measures based on timers as well as defensive hooks can detect this.  Overall though I'd say it's quite dependable.\n </p>\n <p>\n  2.)  Know your target well and don't depend upon \"generic\" one-size-fits-all patching techniques.  You should know beforehand whether or not multi-threading is going to hamper a particular patch at a particular address for a specific target, and how feasible it will be to perform reliable realtime patching.\n </p>\n <p>\n  If you know or suspect that your target code is threaded, find the synchronization method used (locks, mutexes, interlocked operations, etc.) and begin your patch from thread-safe code, ideally after forcing temporary thread contention/deadlock to prevent execution while patching.  Reliably doing this will likely be very target specific and therefore require at least a tiny bit of fairly intimate knowledge of your target.\n </p>\n <p>\n  Most important of all:  Know which instructions on your current hardware are atomic.  Without this knowledge to start with you can't possibly create an atomic patch.\n </p>\n <p>\n  You then have the problem of making a series of atomic writes (of atomic instructions) such that execution mid-patch doesn't crash/hang/alter execution in unintended ways.  This is not a trivial problem to solve.  Suspend the process and play it safe.\n </p>\n <p>\n  EDIT:  I just realized that I took the bait and answered in a way that only considered hooking, i.e patching, even though your question specifically asks how to change code flow atomically during execution.  Proper DLL injection should allow you to do this pretty reliably in most cases, though like always it's never a sure thing when you are modifying a running process.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Matthew Geyer",
            "time": "Jan 7, 2016 at 12:34",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">From kernel mode there is ... or does that qualify as cheating? ;)</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Here's an\n  <a href=\"https://jpassing.com/2011/05/03/windows-hotpatching-a-walkthrough/\" rel=\"nofollow noreferrer\">\n   older article\n  </a>\n  on how hotpatching was implemented in Windows. If you want it done absolutely atomically, it has to be done from the kernel mode. There's no way around it. Here's the walkthrough:\n </p>\n <ul>\n  <li>\n   <p>\n    Set your thread's IRQL to\n    <code>\n     CLOCK1_LEVEL\n    </code>\n    (heck, you can even try\n    <code>\n     HIGH_LEVEL\n    </code>\n    ), which is way above 2, that will pretty much stop all task switching in that system for the time your patching code is running. It is also high enough to preempt most interrupts. Or, you can try to disable them with a\n    <code>\n     CLI\n    </code>\n    instruction.\n   </p>\n  </li>\n  <li>\n   <p>\n    Also schedule CPU-specific DPCs on all CPUs but your thread to keep those DPCs busy. (This is needed in case of a multi-core CPU.)\n   </p>\n  </li>\n </ul>\n <p>\n  This basically turns your patching thread into a single threaded environment for a short while.\n </p>\n <ul>\n  <li>\n   <p>\n    To ensure that no other running thread was stopped on that short span of executable memory where you're applying your 5-byte JMP, walk through the context of each thread and check its RIP value. In an unlikely event that it overlaps, either cancel the patch and retry after a short while, or raise the thread's IRQL for a very short while and then lower it back. Then check again. Repeat N times until its RIP doesn't overlap with the patch.\n   </p>\n  </li>\n  <li>\n   <p>\n    Finally apply the patch. Make sure to do it as quickly as possible. Try not to call any outside functions. Just do a quick\n    <code>\n     REP MOVS\n    </code>\n    on a prepared memory blob.\n   </p>\n  </li>\n  <li>\n   <p>\n    You'll probably need to clear the processor's instruction cache. (In case the old code before the patch was in there.)\n   </p>\n  </li>\n  <li>\n   <p>\n    Then undo all the steps above to restore the system back into the working state.\n   </p>\n  </li>\n </ul>\n <p>\n  PS. Should work in theory. In practice,\n  <em>\n   debugging\n  </em>\n  this will be a living hell. Obviously do it in a VM and be ready to reboot (a lot.)\n </p>\n <hr/>\n <p>\n  <strong>\n   <em>\n    Edit:\n   </em>\n  </strong>\n  <em>\n   Here's an actual example, taken from the\n   <a href=\"https://docs.microsoft.com/en-us/sysinternals/downloads/debugview\" rel=\"nofollow noreferrer\">\n    DebugView\n   </a>\n   tool. If you know what it does, it tries to capture a program's debugger output. If you enable kernel debugger output on an older OS, that tool has no other option but to install a trampoline on a\n   <a href=\"https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/content/wdm/nf-wdm-dbgprint\" rel=\"nofollow noreferrer\">\n    DbgPrint\n   </a>\n   function on a live system when the DebugView starts up.\n  </em>\n </p>\n <p>\n  Here's how it does it (it uses somewhat old kernel functions, but it still delivers the idea):\n </p>\n <p>\n  <strong>\n   1.\n  </strong>\n  Get number of CPU cores (it uses an older\n  <code>\n   KeNumberProcessors\n  </code>\n  global variable as such):\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/rA2D1.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/rA2D1.png\"/>\n  </a>\n </p>\n <p>\n  (For modern code I would probably use\n  <a href=\"https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/content/wdm/nf-wdm-kequeryactiveprocessors\" rel=\"nofollow noreferrer\">\n   <code>\n    KeQueryActiveProcessors()\n   </code>\n  </a>\n  with its bitmask, and\n  <a href=\"https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/content/ntddk/nf-ntddk-kequerygroupaffinity\" rel=\"nofollow noreferrer\">\n   <code>\n    KeQueryGroupAffinity()\n   </code>\n  </a>\n  to account for number of CPUs greater than 32/64.)\n </p>\n <p>\n  <strong>\n   2.\n  </strong>\n  Make sure that the current thread is running on the CPU core 0 by calling\n  <code>\n   KeSetAffinityThread\n  </code>\n  :\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/SJJzW.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/SJJzW.png\"/>\n  </a>\n </p>\n <p>\n  (Then check global variable\n  <code>\n   bDontSet_FuncTrampoline\n  </code>\n  in case we don't need to set this trampoline & restore thread affinity by jumping to step 6. But that case is not interesting.)\n </p>\n <p>\n  <strong>\n   3.\n  </strong>\n  Then check if we just have one CPU core, and if so jump to step 5. (Not very interesting either.) Otherwise set global variable\n  <code>\n   nCountCpuCores\n  </code>\n  to the count of CPU cores, and reset global\n  <code>\n   bAllowToContinue_CoreNon0_DeferredRoutine\n  </code>\n  flag to 0:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/7hYCw.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/7hYCw.png\"/>\n  </a>\n </p>\n <p>\n  <strong>\n   4.\n  </strong>\n  Set each CPU core (other than 0, i.e.\n  <code>\n   rsi\n  </code>\n  pointer starts from index 1, or 0x8 offset in bytes) for\n  <code>\n   high importance\n  </code>\n  DPCs (\n  <a href=\"https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/introduction-to-dpc-objects\" rel=\"nofollow noreferrer\">\n   deferred procedure calls\n  </a>\n  ) for our\n  <a href=\"https://msdn.microsoft.com/library/windows/hardware/ff542972?f=255&MSPPError=-2147217396\" rel=\"nofollow noreferrer\">\n   <code>\n    DeferredRoutine\n   </code>\n  </a>\n  with the\n  <code>\n   context\n  </code>\n  set to CPU core number:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/PHQvN.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/PHQvN.png\"/>\n  </a>\n </p>\n <p>\n  This will basically preempt whatever those other cores were doing and direct them to our DPC.\n </p>\n <p>\n  <strong>\n   5.\n  </strong>\n  Then for our thread running in core 0, execute DPC routine\n  <code>\n   DeferredRoutine\n  </code>\n  :\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/zSPLY.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/zSPLY.png\"/>\n  </a>\n </p>\n <p>\n  <strong>\n   6.\n  </strong>\n  After which restore this thread's affinity to what it used to be before:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/BXj5x.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/BXj5x.png\"/>\n  </a>\n </p>\n <hr/>\n <p>\n  Now the interesting thing is what happens in\n  <code>\n   DeferredRoutine\n  </code>\n  :\n </p>\n <p>\n  (Note that this routine will be executed on each CPU core.)\n </p>\n <p>\n  <strong>\n   A.\n  </strong>\n  The first step, set\n  <a href=\"https://blogs.msdn.microsoft.com/doronh/2010/02/02/what-is-irql/\" rel=\"nofollow noreferrer\">\n   IRQL\n  </a>\n  for the thread to\n  <code>\n   CLOCK_LEVEL\n  </code>\n  (or\n  <code>\n   13\n  </code>\n  for x64 code.) This is done by using the\n  <code>\n   cr8\n  </code>\n  CPU register. Doing this will block processing of the most interrupts:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/mzTTB.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/mzTTB.png\"/>\n  </a>\n </p>\n <p>\n  <strong>\n   B.\n  </strong>\n  Then decrement the counter in\n  <code>\n   nCountCpuCores\n  </code>\n  global variable, but do it using a\n  <code>\n   lock\n  </code>\n  CPU prefix to ensure synchronization among all CPU cores:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/ccjl4.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/ccjl4.png\"/>\n  </a>\n </p>\n <p>\n  <strong>\n   C.\n  </strong>\n  Check what CPU core this thread runs on and enter a spin-loop accordingly:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/I56v5.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/I56v5.png\"/>\n  </a>\n </p>\n <p>\n  <strong>\n   C.1.\n  </strong>\n  (\n  <em>\n   Right side block in the code flow above.\n  </em>\n  ) For non-0 cores continue spinning in a loop while global variable\n  <code>\n   bAllowToContinue_CoreNon0_DeferredRoutine\n  </code>\n  is 0.\n </p>\n <p>\n  <strong>\n   C.2.\n  </strong>\n  (\n  <em>\n   Left side block in the code flow above.\n  </em>\n  ) For core 0, continue spinning in a loop while the count of processed cores in the\n  <code>\n   nCountCpuCores\n  </code>\n  global variable doesn't reach 0.\n </p>\n <p>\n  (I would personally add to each of those loops a\n  <a href=\"https://stackoverflow.com/questions/4725676/how-does-x86-pause-instruction-work-in-spinlock-and-can-it-be-used-in-other-sc\">\n   <code>\n    pause\n   </code>\n  </a>\n  instruction to ensure that CPU doesn't waste too much power while \"spinning\".)\n </p>\n <p>\n  <strong>\n   C.3.\n  </strong>\n  Once the condition C.2. has been met, it means that we have our core 0 all to ourselves and all other cores are busy spinning in the loop in C.1. and we can proceed by calling our\n  <code>\n   install_func_Trampoline\n  </code>\n  function to install required trampoline.\n </p>\n <p>\n  <strong>\n   C.4.\n  </strong>\n  When we're done with the trampoline, remember to release all cores from the spin-loop in C.1. by setting\n  <code>\n   bAllowToContinue_CoreNon0_DeferredRoutine\n  </code>\n  to 1.\n </p>\n <p>\n  <strong>\n   D.\n  </strong>\n  Lastly, very important, restore IRQL back to what it used to be:\n </p>\n <p>\n  <a href=\"https://i.sstatic.net/07lGP.png\" rel=\"nofollow noreferrer\">\n   <img alt=\"enter image description here\" src=\"https://i.sstatic.net/07lGP.png\"/>\n  </a>\n </p>\n <p>\n  Return error\n  <code>\n   nt_status\n  </code>\n  code, if so. Otherwise, we're done!\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "c00000fd",
            "time": "Jun 25, 2018 at 6:26",
            "is_accepted": false,
            "comments": [
                {
                    "user": "RbMm",
                    "text": "<span class=\"comment-copy\">really all this is sesnseless and nothing give. assume thread execute instructions in place where we apply patch . say <code>push rbp; /** interrupt **/ sub rsp,10</code> let thread X executed <code>push rbp</code> and then clock interrupt , from where already we return on another thread in another place. then you apply patch (say set jmp here ) and then thread X continue execution from place where it was interrupted. already inside jmp instruction. and even without thread swap - you interrupt thread by DPC - but to where thread returned after DPC ? without change thread context - all this senseless</span>",
                    "time": null
                }
            ]
        }
    ]
}