{
    "title": "Figuring out how an old serial based PC IR remote control works",
    "link": "https://reverseengineering.stackexchange.com/questions/6198/figuring-out-how-an-old-serial-based-pc-ir-remote-control-works",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have an old serial based remote control for the PC. It has an IR receiver that plugs into a standard DB9 serial port. I am trying to figure out how this remote works. I have downloaded various serial monitor programs to try and figure out how it works. However, none of them display anything when I point the remote control at the receiver and press buttons. I know the remote and receiver work. Maybe I am doing something wrong. Any help with this would be greatly appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 2,
    "views": "160",
    "tags": [
        "windows",
        "serial-communication"
    ],
    "user": "Sega dude",
    "time": "Sep 8, 2014 at 15:03",
    "comments": [
        {
            "user": "ixje",
            "text": "<html><body><span class=\"comment-copy\">\n \"Figure out how this remote works\" is an ambiguous statement. Please clarify what exactly you're trying to achieve. We could tell you to use an oscilloscope or logic analyzer to capture traffic while you might just want to replace the IR control by a Bluetooth version and want to know how the PC side is controlled. For the latter we could give you software reversing help instead of hardware.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Sometimes devices like that use pins like DTR (Data Terminal Ready) which trigger an interrupt and track the time between interrupts and decode that rather than actually feeding data in to the serial port on the data lines.\n </p>\n <p>\n  (edit: The software might be polling a line in software rather than relying on a port to have something interrupt on one of the pins.  DTR and RI, ring indicator, are still the likely suspects.  Power to the device, likely an IR phototransistor, is likely to be from driving one or more of the extra pins to +12v.  See:\n  <a href=\"http://www.tldp.org/HOWTO/Serial-HOWTO-19.html\" rel=\"nofollow\">\n   http://www.tldp.org/HOWTO/Serial-HOWTO-19.html\n  </a>\n  )\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "BitShifter",
            "time": "Sep 8, 2014 at 19:51",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  As BitShifter said, the device might be using some pins other than Transmit/Receive, so a software monitor might not detect much. The best you can do is get a hardware device with LEDs like this\n  <img alt=\"this\" src=\"https://i.sstatic.net/DyVu3.jpg\"/>\n </p>\n <p>\n  which i found on\n  <a href=\"http://www.awrtech.co.uk/awr_cat.htm\" rel=\"nofollow noreferrer\">\n   http://www.awrtech.co.uk/awr_cat.htm\n  </a>\n  (look for RS232_SPM)\nthat shows you which of the lines do something while your device is active. After that, you might be able to monitor the relevant pin in software, or use a scope or a logic analyzer to find out what's actually going on.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Guntram Blohm",
            "time": "Sep 9, 2014 at 9:17",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user187",
                    "text": "<span class=\"comment-copy\">Why should he buy this advice if you can see all ports with software? <a href=\"http://electronics.stackexchange.com/q/38342\">electronics.stackexchange.com/q/38342</a></span>",
                    "time": null
                },
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">He said he tried various serial port monitor programs, without success. A software might not display short spikes on one of the control lines, but they should be visible on the hardware LEDs.</span>",
                    "time": null
                },
                {
                    "user": "user187",
                    "text": "<span class=\"comment-copy\">True, I'm sorry, I understood that he just didn't use monitoring software where you can see all lines.</span>",
                    "time": null
                }
            ]
        }
    ]
}