{
    "title": "IDA - cannot rename or jump to a global variable",
    "link": "https://reverseengineering.stackexchange.com/questions/6377/ida-cannot-rename-or-jump-to-a-global-variable",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  In an application I'm analyzing, there's a global variable whose purpose/role in the program is known to me. I'd like to rename it, but for some reason I cannot.\n </p>\n <p>\n  The assembly code:\n </p>\n <pre><code>.text:00537E90                 mov     edx, ds:1C968D8h\n.text:00537E96                 mov     [eax], edx\n.text:00537E98                 mov     ds:1C968D8h, eax\n</code></pre>\n <p>\n  If I position the cursor on the address (\n  <code>\n   ds:1C968D8h\n  </code>\n  ) and try to jump (using Enter), IDA will complain\n  <code>\n   Command \"JumpEnter\" failed\n  </code>\n  . Attempting to rename it with the N hotkey will cause IDA to place a label at that address rather than rename the variable as intended.\n </p>\n <p>\n  While I'm doing this for educational purposes, this is a proprietary application, so I don't have the source code.\n </p>\n <p>\n  I've checked Chris Eagle's \"The IDA Pro Book\", but there seems to be nothing on the subject in there.\n </p>\n <p>\n  Help is greatly appreciated.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "3k",
    "tags": [
        "ida"
    ],
    "user": "user4520",
    "time": "Oct 4, 2014 at 13:18",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  It is possible that the address segment which this data belongs to does not exists in the idb.\nIt can happen if this segment is created dynamically by OS level memory allocation functions like VirtualAlloc or VirtualAllocEx in Windows.\nYou can check it by viewing segment addresses in corresponding IDA window.\nIf this segment doesn't exist, just create one from the same segment window.\n </p>\n <p>\n  If it is not so, there is another possibility: your global data is not defined as offset ( and not treated as address ). Place cursor on it, press left button, press o on the keyboard to say to IDA that it is address.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "w s",
            "time": "Oct 4, 2014 at 16:48",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user4520",
                    "text": "<span class=\"comment-copy\">The second method doesn't work so I guess it must be the first one. Could you tell me a bit more? Given the address I have in my question, what segment should I add? Currently it contains <code>.text</code>, <code>.idata</code>, <code>.rdata</code>, <code>.data</code>, <code>.tls</code>, <code>.version</code>.</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">The name doesn't really matter.Check addresses in vicinity of desired address for similar situation, find  start address and end address and add the segment as follows: Go to View--&gt;OpenSubviews--&gt;Segments, press Ins, enter any name and segment boundaries, mark it as 32 bit segment, press OK, reanalyze program via Options--&gt;General--&gt;Analysis--&gt; Reanalyze program. Please note that this segment will not contain real data, but it will give you an opportunity to track access to this address.</span>",
                    "time": null
                },
                {
                    "user": "user4520",
                    "text": "<span class=\"comment-copy\">Well, it turns out that the globals are indeed in the <code>.data</code> segment already, but the method you've described (pressing 'O') does not work, just nothing happens. Although according to <a href=\"https://www.hex-rays.com/products/ida/support/freefiles/IDA_Pro_Shortcuts.pdf\" rel=\"nofollow noreferrer\">hex-rays.com/products/ida/support/freefiles/…</a> your method should work...</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">It shouldn't change anything. Would you post desired address and content of segments window ?</span>",
                    "time": null
                },
                {
                    "user": "user4520",
                    "text": "<span class=\"comment-copy\">Of course. The segments: <a href=\"http://i.imgur.com/i89BeVN.png\" rel=\"nofollow noreferrer\">i.imgur.com/i89BeVN.png</a> . The address I want is for example the one I've posted in my question (<code>ds:1C968D8h</code>).</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  One thing that I've failed to notice turned out to be crucial: this file wasn't generated by my copy of IDA, it was given to me by a friend as a helping resource. I've simply disassembled the very same exe with my IDA and the troublesome address is now correct:\n </p>\n <p>\n  <img alt=\"enter image description here\" src=\"https://i.sstatic.net/i2Y5o.png\"/>\n </p>\n <p>\n  <img alt=\"http://i.imgur.com/AzHGbT1.png\" src=\"https://i.sstatic.net/fK3Bo.png\"/>\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "user4520",
            "time": "Oct 15, 2014 at 16:16",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Zach Riggle",
                    "text": "<span class=\"comment-copy\">In the future, it may help to undefine the target (hotkey: U), or undefine the disassembly (U), and then re-define and rename the data (D) or code (C).</span>",
                    "time": null
                }
            ]
        }
    ]
}