{
    "title": "Tracing adware on windows - ads showing up in browser",
    "link": "https://reverseengineering.stackexchange.com/questions/6392/tracing-adware-on-windows-ads-showing-up-in-browser",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Sometime ago I came across this situation:\n  \n\n  Windows 7 machine infected with adware, ads tabs opening up in chrome out of nowhere. Pretty invasive stuff. In the end i got rid of it with some malware removal tool (adaware), but that's like the \"i'm feeling lucky\" approach.\n </p>\n <p>\n  Say it didn't work, there's no suspect browser plugin / extension in sight, so it's some kind of program getting spawned from time to time that opens up stuff in chrome. Let's say we've looked in the usual places (scheduler, startup registry entries, services ...) but found nothing or it's just too messy.\n </p>\n <p>\n  <strong>\n   How do you go about tracing something like that ?\n  </strong>\n </p>\n <p>\n  Any way to catch the process red-handed, as in some kind of system-wide debugger we can tell to attach itself to any process that tries to\n  <code>\n   exec\n  </code>\n  chrome (or whatever call it is windows uses) so we can look at it before it goes away ?\n </p>\n <p>\n  Any dev / system / RE tool out there that can do that ?\n </p>\n <p>\n  <a href=\"https://superuser.com/questions/270719/tracing-adware-mysterious-ads-being-opened-in-chrome\">\n   Similar question\n  </a>\n  came up a while back with no good answer.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "302",
    "tags": [
        "windows",
        "malware",
        "dynamic-analysis"
    ],
    "user": "lemonsqueeze",
    "time": "Mar 20, 2017 at 10:18",
    "comments": [
        {
            "user": "Gizmo",
            "text": "<html><body><span class=\"comment-copy\">\n First thing I always do is look into extensions/dll's that load with explorer and any other windows startup processes. Those are the nastiest as they are no process by themselves - they use another processs' memory space to execute their dirty stuff. And it's really hard to detect.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  In such cases I use\n  <a href=\"http://technet.microsoft.com/en-us/sysinternals/bb842062.aspx\" rel=\"nofollow\">\n   Sysinternals Suite\n  </a>\n  which provides a wide toolset. For your particular scenario try \"Process Monitor\"\n </p>\n <p>\n  Another good system monitor would be\n  <a href=\"http://www.gmer.net/\" rel=\"nofollow\">\n   GMER\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "pHiL",
            "time": "Oct 9, 2014 at 17:15",
            "is_accepted": false,
            "comments": [
                {
                    "user": "lemonsqueeze",
                    "text": "<span class=\"comment-copy\">The question is about tracing. How is this going to help ?</span>",
                    "time": null
                },
                {
                    "user": "ST3",
                    "text": "<span class=\"comment-copy\">@lemonsqueeze using sys monitor you will be able to find all processes and dlls loaded, so you could search them and find malicious.</span>",
                    "time": null
                },
                {
                    "user": "pHiL",
                    "text": "<span class=\"comment-copy\">define \"tracing\". To find out which process is responsible, the Sysinternals Suite is a very good toolset. Once you know the process, you can use any debugger to attach and really \"trace\" around in it what and how its doing it</span>",
                    "time": null
                },
                {
                    "user": "lemonsqueeze",
                    "text": "<span class=\"comment-copy\">@pHiL Tracing is like hunting down an animal by following his tracks until you find it. The suggested answer feels more like scanning to me: going through the whole forest hoping to find it somehow. Sysinternals tools are great, but if the adware has infected a system exe or is just not running when i run Process Monitor, how is that going to help ?</span>",
                    "time": null
                }
            ]
        }
    ]
}