{
    "title": "OllDbg error message",
    "link": "https://reverseengineering.stackexchange.com/questions/6510/olldbg-error-message",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have the follwoing error message:\n </p>\n <pre><code> Don't know how to step because memory at address 00000000 is not readable.\n Try to change EIP or pass exeption to program.\n</code></pre>\n <p>\n  Because I dont know how to change the EIP, I try it with exception passing. So:\nWhen I click Shift+F7/F8 to pass exception to the program, then nothing happens. When I try Shift+F9 the program runs in a RETN instruction, somewhere at the end of the whole process. So, the whole thing doesnt work. \nAfter that, I try the following:\nIn the Debugging options(in the Exeptions-Tab) I enable the field \"Memory access violation\".\nBut the error message comes again.\n </p>\n <p>\n  My question is now: \nHow can I fix that problem?\n </p>\n <p>\n  The second thing is(i dont know if that information is relevant but I write it):\nWhen I open the malware with ollydbg a message appears to inform me that is encrpyted or compressed. You know, the typical error message when you deal with packed malware.\nBut the problem is, that I definitely unpacked it. And the beginning of that, is a normal beginning/intro like:\n </p>\n <pre><code>       PUSH EBP\n       MOV EBP, ESP\n       ...\n</code></pre>\n <p>\n  Also, when I open the packed version of the process with PEiD, it tells me that it is packed with FSG 1.3.3 -> bart/xt.\nWhen I open the unpacked version of the malware, PEiD tells me : Nothing found *\nSo, I am very confused about the fact that Ollydbg talks about compressed/packed data although I have unpacked it. \nSo, how that can be?\n </p>\n <p>\n  best regards,\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 1,
    "views": "4k",
    "tags": [
        "ollydbg"
    ],
    "user": "user3097712",
    "time": "Oct 20, 2014 at 15:57",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <blockquote>\n  <p>\n   Ollydbg talks about compressed/packed data although I have unpacked it. So, how that can be?\n  </p>\n </blockquote>\n <p>\n  Ollydbg is wrong and flat out doesn't work for a lot of things! Messages it gives should be taken with a grain of salt. It's likely that when you unpacked the binary you provided a bad entry point or included the junk encrypted data with it that is no longer used.\n </p>\n <blockquote>\n  <p>\n   Because I dont know how to change the EIP\n  </p>\n </blockquote>\n <p>\n  Right click EIP in the register portion of Olly's CPU window.\n </p>\n <blockquote>\n  <p>\n   I try it with exception passing\n  </p>\n </blockquote>\n <p>\n  EIP is the\n  <strong>\n   instruction pointer\n  </strong>\n  , if it is trying to execute the memory at address 0, your program will definitely fail to run correctly. It's likely you set the entry point when unpacking to be zero, which is absolutely wrong. If the program has no exception handler defined, and you pass the exception, it'll just bubble up to windows and cause a crash(\"close this program/debug\" dialog).\n </p>\n <p>\n  Great alternative that'd rule out any ollydbg issues you're having: http//x64dbg.com\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Ditmar Wendt",
            "time": "Oct 27, 2014 at 0:01",
            "is_accepted": false,
            "comments": []
        }
    ]
}