{
    "title": "Why there are not any disassemblers that can generate re-assemblable asm code?",
    "link": "https://reverseengineering.stackexchange.com/questions/6518/basic-concept-misunderstood",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I am struggling on this problem for around three months:\n </p>\n <p>\n  <em>\n   How to use disassemblers (IDA Pro and others...) to generate re-assemblable asm code and assemble it back\n  </em>\n </p>\n <p>\n  My experience is that:\n </p>\n <ol>\n  <li>\n   <p>\n    There is NO tool that can generate re-assemblable asm code on 32-bit x86.\n   </p>\n  </li>\n  <li>\n   <p>\n    You need to adjust/heuristically modify the asm code created by IDA Pro to make it re-assemblable.\n   </p>\n  </li>\n  <li>\n   <p>\n    It is doable to\n    <strong>\n     automatically\n    </strong>\n    adjust/heuristically modify process on\n    <strong>\n     benign program\n    </strong>\n    (one without obfuscation).\n   </p>\n  </li>\n  <li>\n   <p>\n    It is very tedious, and VS compiled PE binary is much more complex than GCC compiled ELF binary.\n   </p>\n  </li>\n </ol>\n <p>\n  So my questions are:\n </p>\n <ol>\n  <li>\n   <p>\n    Why there are not any disassemblers that can generate re-assemblable asm code targeting on\n    <strong>\n     benign program\n    </strong>\n    (one without obfuscation) ?\n   </p>\n  </li>\n  <li>\n   <p>\n    If I want to implement such a tool (without the help of IDA Pro, sketching from the beginning), is it possible?\n   </p>\n  </li>\n  <li>\n   <p>\n    Are there any other concerns related to this that I may have missed?\n   </p>\n  </li>\n </ol>\n</div>\n</body></html>",
    "votes": "32",
    "answers": 5,
    "views": "12k",
    "tags": [
        "ida",
        "disassembly",
        "x86",
        "disassemblers",
        "reassembly"
    ],
    "user": "vackermann",
    "time": "Apr 28, 2017 at 12:56",
    "comments": [
        {
            "user": "Stolas",
            "text": "<html><body><span class=\"comment-copy\">\n The close votes are because they think this is 'opinion based'. I think this is not the case.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "nrz",
            "text": "<html><body><span class=\"comment-copy\">\n Have you checked VCOM Sourcer? It should produce re-assemblable disassembly for DOS and Windows. Maybe you can find it somewhere.\n <a href=\"http://archive.is/UJrsa\" rel=\"nofollow noreferrer\">\n  archive.is/UJrsa\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Trass3r",
            "text": "<html><body><span class=\"comment-copy\">\n There are research efforts like\n <a href=\"https://github.com/GrammaTech/ddisasm\" rel=\"nofollow noreferrer\">\n  github.com/GrammaTech/ddisasm\n </a>\n .\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <h2>\n  <strong>\n   Because this is really hard to do.\n  </strong>\n </h2>\n <p>\n  To elaborate:\n </p>\n <p>\n  You'll also need to extract things that are not code. Think of import tables, export tables, strings and other data.\n </p>\n <p>\n  When you write code, this is only one part of the program. The other part is the Compiler Optimizations and data section. This makes it almost impossible to create re-compilable assembly. If you want to edit a program on assembly level I'd recommend to use windbg and LordPE.\n </p>\n</div>\n</body></html>",
            "votes": "23",
            "user": "Stolas",
            "time": "Sep 12, 2016 at 7:07",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  This is from the IDA Pro book, but even IDA, as good as it is, is still in the end making guesses.  The answers here are from \"The IDA Pro Book\" by Chris Eagle.\n </p>\n <ol>\n  <li>\n   \"Why there are not any disassemblers that can generate re-assemblable asm code targeting on benign program (one without obfuscation) ?\"\n  </li>\n </ol>\n <blockquote>\n  <p>\n   <strong>\n    The compilation process is lossy.\n   </strong>\n  </p>\n  <p>\n   At the machine language level there are no variable or function names,\n   <em>\n    and variable type information can be determined only by how the data is used rather than explicit type declarations.\n   </em>\n   When you observe 32\n  bits of data being transferred, you’ll need to do some investigative\n  work to determine whether those 32 bits represent an integer, a 32-bit\n  floating point value, or a 32-bit pointer.\n  </p>\n  <p>\n   <strong>\n    Compilation is a many-to-many operation.\n   </strong>\n  </p>\n  <p>\n   This means that a source program can be translated to assembly\n  language in many different ways, and machine language can be\n  translated back to source in many different ways. As a result, it is\n  quite common that compiling a file and immediately decompiling it may\n  yield a vastly different source file from the one that was input.\n  Decompilers are very language and library dependent. Processing a\n  binary produced by a Delphi compiler with a decompiler designed to\n  generate C code can yield very strange results. Similarly, feeding a\n  compiled Windows binary through a decompiler that has no knowledge of\n  the Windows programming API may not yield anything useful.\n  </p>\n </blockquote>\n <p>\n  Basically, at this point it still requires human judgment.  The best analogy I've heard is that compiling a binary from source is like computing a Hash.\n </p>\n <ol>\n  <li>\n   \"If I want to implement such a tool (without the help of IDA Pro, sketching from the beginning), is it possible?\"\n  </li>\n </ol>\n <p>\n  This sounds to me like an interesting theoretical research question:  Can compilation truly be viewed as generating a hash signature?  My gut says \"Yes.\"  The math would be terribly intricate, and would probably have to be done with a provable language.  We typically use hashes because they aren't easy to reverse engineer.  However you can still attack hashes using things like rainbow tables, so there's one mega-project to consider.  My instinct tells me that rainbow tables on all possible binaries is NP-Complete.\n </p>\n <p>\n  Also consider that determining data types kinda requires human judgment, and we still aren't terribly good at automating THAT kind of intelligence.  Is it possible?  Maybe.  There's a reason why smart people still make tools like IDA.\n </p>\n <ol>\n  <li>\n   \"Are there any other concerns related to this that I may have missed?\"\n  </li>\n </ol>\n <p>\n  I'm new to disassembly, so I'll leave that to the big boys, but hopefully at least I answered the question on why its so difficult to do what you ask.\n </p>\n <p>\n  Eagle, Chris (2011-06-16). The IDA Pro Book: The Unofficial Guide to the World's Most Popular Disassembler (Kindle Locations 151-152). No Starch Press. Kindle Edition.\n </p>\n</div>\n</body></html>",
            "votes": "20",
            "user": "avgvstvs",
            "time": "Mar 8, 2014 at 16:56",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Your question is very interesting, though, not really new.\n </p>\n <p>\n  Many people already use what we call binary rewriting for profiling purposes. For example\n  <strong>\n   DynInst\n  </strong>\n  &\n  <strong>\n   MAQAO\n  </strong>\n  do that to profile applications in order to locate bottlenecks in basic blocks. Now the question you'll probably be asking yourself is how is it done ? Simple. Most available disassemblers like\n  <em>\n   objdump\n  </em>\n  ,\n  <em>\n   objconv\n  </em>\n  ,\n  <em>\n   IDA\n  </em>\n  , etc. work in standalone mode and usually print an instruction on disassembly, but others like\n  <em>\n   udis86\n  </em>\n  &\n  <em>\n   distorm\n  </em>\n  offer an API to access the disassembled code in addition to being available in standalone mode.\nBut, what\n  <strong>\n   DynInst\n  </strong>\n  ,\n  <strong>\n   MAQAO\n  </strong>\n  , and most binary rewriting tools do is disassemble a binary file and insert probes wherever it is appropriate in the data structure before reassembling the binary. Thus all necessary changes related to addresses, branches, context saving, and so on are handled properly before reassembly.\n </p>\n <p>\n  What you must know is that it is extremely hard to write such tools. The first challenge is to write a reliable disassembler. This of course implies choosing a disassembly algorithm (linear sweep vs. recursive traversal), separating the instructions from the data (they can be mixed - shellcodes for example), and so on. Then comes the second challenge, patching the disassembled code. This is extremely tricky and I'll point out this document which should be of great help :\n  <a href=\"http://www.maqao.org/publications/techreports/madras_techreport.pdf\" rel=\"nofollow noreferrer\">\n   http://www.maqao.org/publications/techreports/madras_techreport.pdf\n  </a>\n  . \nIt has been written by the author of the disassembler used in\n  <strong>\n   MAQAO\n  </strong>\n  (\n  <em>\n   MADRAS\n  </em>\n  -\n  <em>\n   Multi Architecture Disassembler Rewriter and Assembler\n  </em>\n  ). The interesting part about this documents is the references (over 50 and extremely helpful) and the appendices which describe the algorithms used.\n </p>\n <p>\n  Though I'm not really acquainted with neither\n  <strong>\n   MAQAO\n  </strong>\n  nor\n  <strong>\n   DynInst\n  </strong>\n  I would recommend you checking publications around them (documentation, scientific papers, ...). I would also recommend you checking\n  <strong>\n   PEBIL\n  </strong>\n  (PMaCs Efficient Binary Instrumentation Toolkit), Intel's\n  <strong>\n   PIN\n  </strong>\n  ,\n  <strong>\n   Valgrind\n  </strong>\n  ,\n  <strong>\n   PLTO\n  </strong>\n  ,\n  <strong>\n   Elfsh/ERESI\n  </strong>\n  , and\n  <strong>\n   Etch\n  </strong>\n  .\n </p>\n <p>\n  Most of these tools perform binary rewriting & patching extensively and I believe are good examples of how binary rewriting can be approached.\n </p>\n <p>\n  I hope my answer will help you find what you were looking for.\n </p>\n</div>\n</body></html>",
            "votes": "10",
            "user": "yaspr",
            "time": "Oct 14, 2018 at 20:02",
            "is_accepted": false,
            "comments": [
                {
                    "user": "lllllllllllll",
                    "text": "<span class=\"comment-copy\">Hello yaspr, thank you a lot for your excellent answer! IMHO, these tools you talked are basically binary re-write tools, which require a \"disassemble+patching to the original binary\" processes. However, what I am asking is that a tool can support \"disassemble+re-assemble on the disassembled asm code\".</span>",
                    "time": null
                },
                {
                    "user": "lllllllllllll",
                    "text": "<span class=\"comment-copy\">IMHO, things would become much easier when you just patch on original binaries, in which case you don't need to (heuristically) handle tedious concrete memory addresses generated in the disassembled asm code.</span>",
                    "time": null
                },
                {
                    "user": "yaspr",
                    "text": "<span class=\"comment-copy\">Well, MADRAS is what you need then. It was designed not only to patch to disassemble &amp; reassemble the disassembled code with or without patching !</span>",
                    "time": null
                },
                {
                    "user": "lllllllllllll",
                    "text": "<span class=\"comment-copy\">Hello yaspr, I have read the techreport of MADRAS you attached, and I noticed these things: 1. MADRAS can only work on x86-64 2. It require (optional)debug info!!</span>",
                    "time": null
                },
                {
                    "user": "lllllllllllll",
                    "text": "<span class=\"comment-copy\">Hi @yaspr, have you read the paper? you might want to take a look at their released code. <a href=\"https://github.com/s3team/uroboros\" rel=\"nofollow noreferrer\">github.com/s3team/uroboros</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  By far, the established method for binary rewriting is\n  <strong>\n   dynamic\n  </strong>\n  rewriting where the binary is rewritten while being run on real inputs. Think of instrumentation tools like\n  <strong>\n   PIN\n  </strong>\n  ,\n  <strong>\n   DynamoRIO\n  </strong>\n  and\n  <strong>\n   Dyninst\n  </strong>\n  and also binary translators like\n  <strong>\n   qemu\n  </strong>\n  .\n </p>\n <p>\n  Static rewriting tools have a fundamental challenge compared to dynamic rewriting which is precise Control Flow Graph recovery. That is, for each basic block in the binary we need to know the set of possible targets of its jump instruction. The difficulty is that binaries have many\n  <strong>\n   indirect\n  </strong>\n  jump instructions. For example, if we face a basic block that ends with\n  <code>\n   bx r3\n  </code>\n  then we need to have a\n  <em>\n   precise\n  </em>\n  and\n  <em>\n   reliable\n  </em>\n  Value Set Analysis (VSA) that can tell us the possible values that\n  <code>\n   r3\n  </code>\n  can take at run-time. Unfortunately, such analysis is, generally, undecidable. However, well-behaving compilers produce binaries that are\n  <em>\n   structured\n  </em>\n  somehow which is a fact that can be useful to a large extent.\n </p>\n <p>\n  Note that the solving CFG recovery problem would allow us to solve the code/data separation problem as a by product. That is, recursive descent disassembly would allow us in that case to perfectly seperate code from data in the code byte stream.\n </p>\n <p>\n  I can refer here to the following paper introduced in last year's USENIX Security:\n </p>\n <blockquote>\n  <p>\n   Shuai Wang, Pei Wang, Dinghao Wu:\n   <strong>\n    Reassembleable Disassembling\n   </strong>\n   . USENIX Security 2015: 627-642\n  </p>\n </blockquote>\n <p>\n  Their tool\n  <code>\n   Uroboros\n  </code>\n  is\n  <strike>\n   not\n  </strike>\n  open source. It's based on iterative linear sweep disassembly using\n  <strong>\n   objdump\n  </strong>\n  . The disassembly technique itself is discussed in an earlier paper. Nonetheless, it provides interesting techniques for static binary rewriting that actually works (or at least that is their claim). They even rewrite the same binary multiple times without breaking it. Finally, note that static binary rewriting is largely inapplicable to binaries with run-time code generation.\n </p>\n <p>\n  <strong>\n   Update\n  </strong>\n  :\n </p>\n <p>\n  It seems like many of the shortcomings of\n  <code>\n   Uroboros\n  </code>\n  has been addressed in\n  <code>\n   Ramblr\n  </code>\n  which is discussed here:\n </p>\n <blockquote>\n  <p>\n   Wang et. al. \"\n   <strong>\n    Ramblr: Making Reassembly Great Again\n   </strong>\n   \", Proceedings of the Network and Distributed System Security Symposium (NDSS'17). 2017\n  </p>\n </blockquote>\n <p>\n  Particularly, they mention that their reassembled binaries have no execution overhead or size expansion.\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "Codoka",
            "time": "May 22, 2017 at 9:43",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Trass3r",
                    "text": "<span class=\"comment-copy\">Ramblr seems to be abandoned. Alternative: <a href=\"https://github.com/GrammaTech/ddisasm/\" rel=\"nofollow noreferrer\">github.com/GrammaTech/ddisasm</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Some systems use a simple executable format which is linked by combining the instructions and defined data contained in the processed assembly files, in a specified sequence; the linker will apply address fix-ups, but otherwise the contents of the output executable will be exactly what the programmer specified--nothing more; nothing less.  The old MS-DOS .COM file format was like that, and so it's possible for a disassembler to take a COM file and produce an file which, when assembled and linked, will yield a bit-identical file (the disassembly may have to use data directives for anything it doesn't understand, or for any instructions which might compile to something other than the bit pattern than appears in the file, but any executable-file bytes could be created using define-byte directives if nothing else.\n </p>\n <p>\n  Other systems, however, use linkers which are more sophisticated and have to generate additional information which gets stored within the file.  It's possible that building the same source file with different versions of the tools may yield different binary files.  In general, when doing a disassemble-patch-reassemble sequence, one would strive to minimize the amount of code whose address changes.  If code stores the address of a function somewhere but the disassembler doesn't realize it's a function address rather than a constant, the only way the code will work is if the function stays at the same address.  Unfortunately, there's no way for an object file which is compatible with MS-DOS or Windows build tools to specify where things should be located.  When the code was originally compiled or assembled, the linker would be free to put the function anywhere and would update the \"constant\" function address appropriately.  When processing disassembled code, there's no way to ensure that the function stays at the old address, nor of having all addresses which depend upon it will get updated if it moves.\n </p>\n</div>\n</body></html>",
            "votes": "4",
            "user": "supercat",
            "time": "Jun 24, 2014 at 20:11",
            "is_accepted": false,
            "comments": []
        }
    ]
}