{
    "title": "WinDbg is unable to communicate with the target after some time",
    "link": "https://reverseengineering.stackexchange.com/questions/6574/windbg-is-unable-to-communicate-with-the-target-after-some-time",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Host and target are both Windows 7 x64.\nThe session goes well, but sometimes after 15-20 minutes the target freezes (like a break point was hit), but WinDbg reports that the debuggee is running and it can not take commands. Also, when I attempt to break into the target (ctrl + break)  I am told that I can't communicate with the target:\n </p>\n <blockquote>\n  <p>\n   Wrote 0 of 1 bytes of the breakin packet.\n  Failed to write breakin packet to target.  HRESULT 0x80004005\n  WARNING: The HOST cannot communicate with the TARGET!\n  </p>\n </blockquote>\n <p>\n  If I am quick to catch the moment, the first errors are different: Win32 error 0n23 and Win32 error 0n121. I looked around for this error, but I could not find something related to WinDbg.\n </p>\n <p>\n  The only way I can resume my session is to shut down the target by pressing it's power button.\n </p>\n <p>\n  At first I thought this has something to do with the target entering stand by, but I modified the power options so it should never enter in a sleep state and I started to actively use it.\n </p>\n <p>\n  I thought this was my driver's fault (although it just iterates through some LIST_ENTRYs and displays some addresses with DbgPrint) so I restarted the target and never loaded my driver.\n </p>\n <p>\n  I noticed that right before this happens the target display goes black for a moment. Any place where I should start looking?\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 0,
    "views": "1k",
    "tags": [
        "windows",
        "windbg"
    ],
    "user": "user3002428",
    "time": "Nov 3, 2014 at 12:42",
    "comments": [
        {
            "user": "Thomas Weller",
            "text": "<html><body><span class=\"comment-copy\">\n Which version of WinDbg (6.2.9200 / 6.3.9600)? This sounds like kernel debugging. IEEE1394 or other setup? Please give more details.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "user3002428",
            "text": "<html><body><span class=\"comment-copy\">\n WinDbg 7600.16385, debugging over 1934. Lately it stopped happening. I tried to pinpoint it to something in my driver, but nothing came out. Maybe it's just a bug and I had the bad luck of experiencing it multiple times in a row.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}