{
    "title": "Is it possible to Reverse engineer digitally signed Windows Phone 8 apps (WP8 APPS)?",
    "link": "https://reverseengineering.stackexchange.com/questions/6839/is-it-possible-to-reverse-engineer-digitally-signed-windows-phone-8-apps-wp8-ap",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have researched a lot about reverse engineering WP8 apps but nothing seems to work for apps that are digitally signed (Yes, I am talking about Apps from Windows App Store)\n </p>\n <p>\n  XAPSpy works with Windows Phone 7 only and may be, with unsigned WP8 apps(but I am not sure on this part).\n </p>\n <p>\n  Some answers of StackExchange says that\n  <code>\n   Tangerine\n  </code>\n  and\n  <code>\n   Windows Phone App Analyzer\n  </code>\n  can be used, but it doesn't seem to work with digitally signed apps.\n </p>\n <p>\n  <code>\n   Question\n  </code>\n  :\n </p>\n <p>\n  Is it not possible at all, to reverse engineer WP8 apps collected from Store and perform security audit? \nTIA.\n </p>\n <p>\n  Regards,\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "1k",
    "tags": [
        "windowsphone"
    ],
    "user": "node_analyser",
    "time": "Dec 17, 2014 at 7:29",
    "comments": [
        {
            "user": "Willem Hengeveld",
            "text": "<html><body><span class=\"comment-copy\">\n i think xap files are encrypted, so my guess is you would need to root/jailbreak the phone first, and then run the app under a debugger to be able to decrypt it.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Willem Hengeveld",
            "text": "<html><body><span class=\"comment-copy\">\n but maybe the decryption is handled at installation time, in that case,  you might be able to find the decrypted apps in a device backup.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "node_analyser",
            "text": "<html><body><span class=\"comment-copy\">\n Willem - The marketplace apps are digitally signed and PlayDRM encrypted. The \"root/jailbreak\" solution is true but as per my knowledge the jailbreak is not yet available for Windows Phone 8.  I have been searching since long and have come to the conclusion that currently my question has no solution unless any jailbreak is available or else the device has a zero-day ;-).  The only solution left is to get the Developer version of the app in order to proceed further.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "David d C e Freitas",
            "text": "<html><body><span class=\"comment-copy\">\n possible duplicate of\n <a href=\"http://reverseengineering.stackexchange.com/questions/274/reverse-engineering-apps-for-windows-phone-7-and-8\">\n  Reverse engineering apps for Windows Phone 7 and 8\n </a>\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "node_analyser",
            "text": "<html><body><span class=\"comment-copy\">\n David - Thank you Sir, but this no more works. I already came across this question during my research.  You can read the first comment to that question. It is true, I tried it. New formats come encrypted and can't be simply renamed and opened.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}