{
    "title": "How to remove SimplePack signature so it won't be detected by AVs",
    "link": "https://reverseengineering.stackexchange.com/questions/6909/how-to-remove-simplepack-signature-so-it-wont-be-detected-by-avs",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I've tried\n  <a href=\"http://mordor.in/\" rel=\"nofollow\">\n   SimplePack\n  </a>\n  , which is an open-source file packer for windows,\nnow, for some reasons, when I check via online virus-checkers, lots of alerts are being popped saying the file is crypted using SimplePack, though the file is innocent.\n </p>\n <p>\n  I realize this is somehow related to a header SimplePack adds or to its algorithm, but I'm not quite sure what to do to fight that, because I'd like to use this for myself.\n </p>\n <p>\n  Suggestions are always welcome!\nThanks.\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 0,
    "views": "272",
    "tags": [
        "encryption",
        "packers"
    ],
    "user": "FigureItOut",
    "time": "Dec 28, 2014 at 16:50",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "<html><body><span class=\"comment-copy\">\n If your benign program is being detected by AV engines, you should notify the AV vendors to fix their detections instead of trying to subvert their detection logic.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "DarthGizka",
            "text": "<html><body><span class=\"comment-copy\">\n Many AV products flag any program that uses a packer as 'suspicious'. In some cases it is possible to hide the fact that a packer is being used, by modifying the packer slightly. However, such success is bound to be short-lived as AV heuristics improve and incorporate more time-consuming detection methods. There are only two ways to escape the AV-numbskullity in the long term: don't use a packer, or stay ahead of the pack. Trying to get all AV vendors to avoid misdetection of a program seems an exercise in futility, even though it is the only way of getting them to change their behaviour.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "diff",
            "text": "<html><body><span class=\"comment-copy\">\n It should also be noted that online virus-checkers (ex. VirusTotal) are often using AV engines which are inherently set to a more high risk level than the normal desktop equivalents. While it is true many AVs will broadly detect packers, VT might be giving you a false sense of real life detections as well.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "peter ferrie",
            "text": "<html><body><span class=\"comment-copy\">\n the act of patching the packer makes it\n <i>\n  more\n </i>\n likely that your program will be detected as malicious, since that is a common practice among malware authors.  Instead, you choose a packer that carries a Taggant.  It is highly unlikely to be misdetected.\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": []
}