{
    "title": "Attach to specific process using IDA + WINDBG in kernel debugging",
    "link": "https://reverseengineering.stackexchange.com/questions/8036/attach-to-specific-process-using-ida-windbg-in-kernel-debugging",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I asked this question at the StackOverflow website and they referenced me here.\n </p>\n <p>\n  (\n  <em>\n   Previous topic\n  </em>\n  :\n  <a href=\"https://stackoverflow.com/questions/27917592/attach-to-specific-process-using-ida-windbg-in-kernel-debugging?noredirect=1#comment44253284_27917592\">\n   https://stackoverflow.com/questions/27917592/attach-to-specific-process-using-ida-windbg-in-kernel-debugging?noredirect=1#comment44253284_27917592\n  </a>\n  )\n </p>\n <p>\n  I want to debug a specific process on a remote system and the only way i can do that is to use the kernel debugging method. \nIt works pretty good with just WINDBG, but i think ida can give me the extra edge i need for a better reversing experience.\n </p>\n <p>\n  So far debugging with windbg was successfull but now when i am using the windbg plugin in ida:\n  <img alt=\"Ida issue\" src=\"https://i.sstatic.net/8upc2.png\"/>\n </p>\n <p>\n  what i am actually experiencing is that i cant get the extra analysis from ida, all i can do is attach only to the  process it self (only one available to attach to). and in the Modules window all i can see is the ntkrpamp.exe, which i assume is the kernel process.\n </p>\n <p>\n  i can use all WINDBG regular commands like !process 0 0, etc.. and can debug normally but nothing shows in the IDA window\n </p>\n <p>\n  I have never debugged dynamically using IDA but i can see it is possible..\n </p>\n <p>\n  could it work aswell in a kernel debugging session?\n </p>\n <hr/>\n <p>\n  I also noticed it is possible to analyze a model if i set a breakpoint with the windbg plugin and when IDA hits that breakpoint, this module is added to the IDA Modules windows.\n </p>\n <p>\n  It would be a lot easier if i could just analyze it without pre-putting a breakpoint on the specific module and waiting for it to hit.\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 0,
    "views": "886",
    "tags": [
        "ida",
        "windows",
        "debugging",
        "windbg"
    ],
    "user": "0xAK",
    "time": "May 23, 2017 at 12:37",
    "comments": [],
    "answers_data": []
}