{
    "title": "What does Hopper's Debugger Server do?",
    "link": "https://reverseengineering.stackexchange.com/questions/8092/what-does-hoppers-debugger-server-do",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Hopper offers a\n  <a href=\"http://www.hopperapp.com/HopperGDBServer/index.html\" rel=\"nofollow noreferrer\">\n   GDB/LLDB Debugger Server\n  </a>\n  companion to the standard program. I'm unclear on what this should / can  be used for. When I run the debugger server on the same machine that I'm using I see this:\n </p>\n <p>\n  <img alt=\"enter image description here\" src=\"https://i.sstatic.net/ODJUT.png\"/>\n </p>\n <hr/>\n <p>\n  There aren't really any options or built-in help. When I open\n  <code>\n   Hopper.app\n  </code>\n  's debugger panel I only see the program running locally. I was initially thinking that the Remote Debugger was maybe used to offload some of the processing to another computer, but I've also tried running Hopper Debugger Server on another mac on my LAN but I don't see it come up in the list, only my local machine:\n </p>\n <p>\n  <img alt=\"enter image description here\" src=\"https://i.sstatic.net/cCHgb.png\"/>\n </p>\n <hr/>\n <p>\n  As there are no settings to specify remote connection information, I think I need to do something remotely that would specify a the address of the machine running Hopper so that it can sort of 'dial in' and then show up on the list.\n </p>\n <p>\n  I haven't had any luck with the Hopper website, forum, FAQ.\n </p>\n <p>\n  What am I missing?\n </p>\n <p>\n  Can anyone give me a brief outline of how the GDB/LLDB remote debugger\n  \n\n  is intended to be used (with Hopper) ?\n </p>\n</div>\n</body></html>",
    "votes": "2",
    "answers": 1,
    "views": "4k",
    "tags": [
        "debuggers",
        "debugging",
        "gdb",
        "hopper",
        "lldb"
    ],
    "user": "cwd",
    "time": "Jan 25, 2015 at 14:42",
    "comments": [
        {
            "user": "Jongware",
            "text": "<html><body><span class=\"comment-copy\">\n Write a short program that crashes. You will see OSX'es own \"Program terminated\" dialog pop up, with the option to view the crash log and Send To Apple. What happens when when you have the debugger server running?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "cwd",
            "text": "<html><body><span class=\"comment-copy\">\n @Jongware - you're saying it should catch OS X crashes and allow debugging? Does it do anything else, i.e. what about the \"GDB: not found\" message?\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "<html><body><span class=\"comment-copy\">\n Well it's only a guess. It seems to search for a debugger to start up when a crash happens.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Henno Brandsma",
            "text": "<html><body><span class=\"comment-copy\">\n On the same machine you don't need the debugger server anymore. There is a built-in debugger. Just for a remote machine.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "cwd",
            "text": "<html><body><span class=\"comment-copy\">\n @HennoBrandsma - thanks, can you describe how to use it with a remote machine? Does the remote machine have to be a mac?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I'm surprised nobody posted an answer, but here's what I eventually came to realize:\n </p>\n <p>\n  A lot of times disassembling is used for taking apart potential malicious apps like viruses, worms, or malware to understand how they affect a system. There is both\n  <a href=\"https://reverseengineering.stackexchange.com/questions/3473/what-is-the-difference-between-static-disassembly-and-dynamic-disassembly\">\n   static and dynamic disassembly\n  </a>\n  . Static disassembly poses (little) threat to your system as it is only looking through the code - however dynamic disassembly is actually running the code ( with breakpoints, etc ) - which is something you probably don't want to do on your main computer if the code is potentially malicious.\n </p>\n <p>\n  Here's what IDA says in a\n  <a href=\"https://www.hex-rays.com/products/ida/support/tutorials/unpack_pe/manual.shtml\" rel=\"nofollow noreferrer\">\n   tutorial about disassembling a \"hostile\" executable\n  </a>\n  :\n </p>\n <blockquote>\n  <p>\n   We could put a breakpoint there and let the program run. Now, before we do that, let's repeat that it is not a good idea to run untrusted code on your computer. It is much better to have a separate \"sandbox\" machine for such tests, for example using the remote debugging facilities IDA offers. Therefore, IDA displays a warning when a new file is going to be started under debugger: ignore at your own risk.\n  </p>\n </blockquote>\n <p>\n  This finally made sense as an explanation for why you may want to use a remote debugger - seems so obvious now!\n </p>\n <p>\n  I'm still not exactly sure on how to setup and/or use Hopper's remote debugger but I'm sure I'll figure that out eventually.\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": []
        }
    ]
}