{
    "title": "Reversing serial RS485 half duplex bus protocol understanding",
    "link": "https://reverseengineering.stackexchange.com/questions/8237/reversing-serial-rs485-half-duplex-bus-protocol-understanding",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have a master & slaves setup in which the slaves only respond when spoken too.  I can snoop & record an existing master/slaves conversation.  I have an extra slave device that I would like to have my own conversation with, but have so far failed miserably.  I suspect that each device has its own unique ID, but have no idea what my extra slave devices ID is.\n </p>\n <p>\n  What I know from a logic analyzer & days worth of studying:\n </p>\n <ul>\n  <li>\n   messages start with 0x10\n  </li>\n  <li>\n   prior to message end is a 2 byte CRC-16/MCRF4XX, little endian (thanks: reveng!)\n  </li>\n  <li>\n   messages end with 0x1003\n  </li>\n </ul>\n <p>\n  Suspicions:\n </p>\n <ul>\n  <li>\n   first byte is a message type identifier, I've observed ~12 unique message types based on this.  Each message 'type' based on this has the same length.\n  </li>\n  <li>\n   second byte might ??? be a destination device id ???.  Based on this suspicion I took the first 20 unique messages, inserted 255 different ID's into this byte, and sent each of them (correctly packetized with start + data + crc + end) - it did not respond to any of them.\n  </li>\n </ul>\n <p>\n  Data sample from the bus during startup, I removed the start, crc & end bytes:\n </p>\n <pre><code>0xff020300010400\n0x09510000\n0xff01030002ffff\n0xff020300013c03\n0x01000000\n0x350d0000\n0xff01030002ffff\n0xff020300020200\n0x02007400...big packet with lots of text from a slave A...\n0x340d7400...big packet with lots of text from a/the master?...\n0xff010300010000\n0xff020300010800\n0x09510000\n0xff01030003ffff\n0xff020300030200\n0x02007400...big packet with lots of text from a slave A...  (exactly the same as prior 2 big packets)\n0x340d7400...big packet with lots of text from the master or yet a third slave?... (exactly the same as prior 2 big packets)\n0x0952040000000080\n0xff010300010000\n0xff02030001101000\n0x09510000\n0xff01030004ffff\n0xff020300040200\n0x02007400...big packet with lots of text from a slave B...\n0x340d7400...big packet with lots of text from the master or yet a third slave?...\n0x0952040000000080\n0xff010300010000\n0xff020300012000\n0x09510000\n0xff01030005ffff\n0xff020300050200\n0x02007400...big packet with lots of text from a slave B...  (exactly the same as prior 2 big packets)\n0x340d7400...big packet with lots of text from the master or yet a third slave?... (exactly the same as prior 2 big packets)\n0x0952040000000080\n0xff010300010000\n0xff020300010400\n0x09510000\n0xff01030002ffff\n0xff020300020200\n0x0952040000000080\n</code></pre>\n</div>\n</body></html>",
    "votes": "3",
    "answers": 1,
    "views": "1k",
    "tags": [
        "hardware",
        "serial-communication",
        "protocol"
    ],
    "user": "Zac",
    "time": "Feb 14, 2015 at 6:46",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Sounds a lot like my recent CAN bus sniffing. Ha! That's funny, RS485 is a popular alternative to CAN. :P\n </p>\n <p>\n  A few quick thoughts:\n </p>\n <ul>\n  <li>\n   You're not terminating your \"RE\" master node properly.\n  </li>\n  <li>\n   You need to check the very first comms to see if there is an opening sequence, such as to establish privilege.\n  </li>\n  <li>\n   I see numbers incrementing in your output. That's definitely not on accident.\n  </li>\n  <li>\n   Are the big packets all the same size? If not, there will be a length value somewhere in the packet. You'll need some kind of program to go through each packet checking if any byte or word matches the length of the total packet or length following (and also with / without CRC+0x1003).\n  </li>\n </ul>\n <p>\n  Googling for\n  <code>\n   RS485 half duplex bus protocol crc 0x1003\n  </code>\n  led me to a few interesting PDFs about protocols. Unless the makers are hideously paranoid, they'll be using something \"normal\" on the RS485 bus:\n </p>\n <ul>\n  <li>\n   Modbus (can have ASCII or TCP frames). I haven't studied TCP frames, but wouldn't surprise me if that could be source of the incrementing values.\n  </li>\n  <li>\n   CANopen maybe? Why not it's a protocol... :P\n  </li>\n  <li>\n   <a href=\"https://www.automationdirect.com/static/manuals/ea1mg6userm/appxa.pdf\" rel=\"nofollow\">\n    This PDF result\n   </a>\n   from the google above lists all kinds of different protocols I haven't heard of before.\n  </li>\n </ul>\n <p>\n  I'd set up a chipKIT uC32 with multiple UARTs in the middle with a \"master\" side and a \"slave\" side. You'll probably need the \"driver\" or \"transceiver\" ICs for each circuit. Oh, an Arduino might work, but the 80MHz PIC32 in the chipKIT rocks. Once you can relay messages and the system keeps working, you'll know a lot more about what's going on. Physically and signal-wise.\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Krista K",
            "time": "Feb 16, 2015 at 3:52",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Zac",
                    "text": "<span class=\"comment-copy\">Thanks for the tips! I love the idea of relaying messages, that will let me know the direction the packets are traveling. Will dig into your other comments.</span>",
                    "time": null
                },
                {
                    "user": "Zac",
                    "text": "<span class=\"comment-copy\">To answer a few questions: first packet in my listing is the first packet on the wire during startup. The big packets with the first byte matching are the same size; grouping all packets by the first byte makes it appear to be a fixed size packet protocol.</span>",
                    "time": null
                }
            ]
        }
    ]
}