{
    "title": "Calling a function in a MIPS library",
    "link": "https://reverseengineering.stackexchange.com/questions/9089/calling-a-function-in-a-mips-library",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I have disassembled a MIPS library in the online Retargetable Disassembler, but I don't really understand the code I got (I'm new to reverse engineering). Would it be possible for me to either recompile the code so I can call it, or use the library directly to call the code?\n </p>\n <p>\n  I assume the latter would only be possible if I'm running on MIPS. How else could I proceed with reverse engineering this code?\n </p>\n</div>\n</body></html>",
    "votes": "1",
    "answers": 2,
    "views": "586",
    "tags": [
        "mips"
    ],
    "user": "Stavros Korokithakis",
    "time": "Jun 8, 2015 at 0:55",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You will have to learn MIPS assembly, and some information about the processor and the registers it uses (for example, opcodes are 3-operand, and\n  <code>\n   r0\n  </code>\n  is always zero).\n </p>\n <p>\n  If you want to add dynamic analysis to your efforts at static disassembly, you'll need the corresponding environment. For example, if your binary is a piece of old SGI IRIX software, a Linux MIPS system won't help you much, since calling conventions, file formats etc. are different. However, this doesn't neccesarily mean you need a MIPS processor, there are various\n  <a href=\"http://www.linux-mips.org/wiki/Emulators\" rel=\"nofollow\">\n   emulators\n  </a>\n  out there for MIPS devices.\n </p>\n <p>\n  Especially in the case of MIPS under Linux, many routers use MIPS processors, and there are several of them that allow you to telnet or ssh in. So, in addition to running an emulator, you could try getting one of those devices, copying your binary there, and running it, possibly under the control of a debugger like gdb or IDA Pro (you need the professional version, the free version and the entry-level version don't support MIPS).\n </p>\n</div>\n</body></html>",
            "votes": "1",
            "user": "Guntram Blohm",
            "time": "Jun 8, 2015 at 10:19",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Stavros Korokithakis",
                    "text": "<span class=\"comment-copy\">I see, thank you. This is actually a binary from a router, so I can use the same router to do it, which makes sense. Thank you!</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Reverse-engineering a binary only code is done through tools (disassemblers, debuggers, decompilers...) and through a certain amount of knowledge of the assembly langage that you are looking at.\n </p>\n <p>\n  The only way to reverse-engineer a piece of binary code is to go through it and try to understand it. If you have no prior knowledge of MIPS assembler, then get some. If you know nothing about disassemblers, debbugers and decompilers, learn some about it.\n </p>\n</div>\n</body></html>",
            "votes": "0",
            "user": "perror",
            "time": "Jun 8, 2015 at 8:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}