{
    "title": "Modify code with ILSpy",
    "link": "https://reverseengineering.stackexchange.com/questions/9178/modify-code-with-ilspy",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I want to modify an exe a little bit.\n </p>\n <p>\n  With ILSpy I see all the code that I need but I don't know how to modify the code.\n </p>\n <p>\n  I tried \"save code\" on ILSpy that exports a .cs file, but when I open the .cs file in Visual Studio and change the code I can't compile or run the modified code.\n </p>\n <p>\n  Is there a way to do that?\n </p>\n <p>\n  P.S.\nI read that I can change the code in assembly but I don't know assembly so I have to do that at high level, if there is a way.\n </p>\n</div>\n</body></html>",
    "votes": "9",
    "answers": 4,
    "views": "57k",
    "tags": [
        "disassembly",
        ".net",
        "c#"
    ],
    "user": "sivlab",
    "time": "Jun 19, 2015 at 20:30",
    "comments": [
        {
            "user": "Abr001am",
            "text": "<html><body><span class=\"comment-copy\">\n you cant modify exe file using ILSpy , you should rather manipulate CFF explorer and patch new addresses of CS and DS in header each time you dilate or shorten the code\n <a href=\"http://fs-uk.com/forum/index.php?topic=54930.0\" rel=\"nofollow noreferrer\">\n  for more informations\n </a>\n )\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "sivlab",
            "text": "<html><body><span class=\"comment-copy\">\n Thanks for you comment but I'm a newbie in this field and I'm only able to modify if the decompiler show me all the code with a high-level language such as C#. I'm trying with .Net Reflector and Reflexil but I have some trouble as show in beyond comments.\n</span>\n</body></html>",
            "time": null
        },
        {
            "user": "Imran Qadir Baksh - Baloch",
            "text": "<html><body><span class=\"comment-copy\">\n There are 2\n <code>\n  Save as\n </code>\n and\n <code>\n  Save Code\n </code>\n <a href=\"https://www.youtube.com/watch?v=ZhancUbQN2k\" rel=\"nofollow noreferrer\">\n  youtube.com/watch?v=ZhancUbQN2k\n </a>\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  For reference to those still looking for an answer to this question, I would recommend trying\n  <a href=\"https://github.com/dnSpy/dnSpy\" rel=\"noreferrer\">\n   dnSpy\n  </a>\n  - it allows you to do exactly what the requester asked - modify the high level code and recompile.\n </p>\n <p>\n  It isn't perfect, but I've been able to make small changes to the in-house exe's we have where we didn't have the latest source code (disgruntled employees, don't ask).\n </p>\n <p>\n  <a href=\"https://github.com/dnSpy/dnSpy\" rel=\"noreferrer\">\n   https://github.com/dnSpy/dnSpy\n  </a>\n </p>\n</div>\n</body></html>",
            "votes": "11",
            "user": "Raithlin",
            "time": "Oct 21, 2020 at 11:05",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  You may work according to the following pattern:\n </p>\n <ul>\n  <li>\n   Save code in ILSpy (or in Reflector) as .cs files (as you already   described)\n  </li>\n  <li>\n   <p>\n    Try to create a Visual Studio project from that code\n   </p>\n  </li>\n  <li>\n   <p>\n    Make all modifications in Visual Studio.\n   </p>\n  </li>\n  <li>\n   <p>\n    If VS compiles the code, it should open as well in ILSpy and/or Reflector.\n   </p>\n  </li>\n  <li>\n   <p>\n    If it doesn't it is most probably not complete and/or not correct. In\nthat case you might simplify the code until you get something\ncompilable, to identify the \"missing links\".\n   </p>\n  </li>\n  <li>\n   <p>\n    In this way I have been able to recompile also more complicated\n    \n\n    software. First do everything statically, until you have something\n    \n\n    where code is created in VS. Then test it and expand it.\n   </p>\n  </li>\n </ul>\n <p>\n  Code parts which do not recompile in ILSpy or Reflector (each has its own strengths and weaknesses) can be exported in IL and perhaps manually rearranged to recompile in the tools, then further processed in Visual Studio. Unfortunately, VS does not allow for inline IL assembled code.\n </p>\n <p>\n  For instance, Reflector protects itself (among other means like obfuscation) against recompilation with useless jumps confusing the recompiler. ILSpy mostly is able to cope with this.\n </p>\n <p>\n  ILSpy for instance is not able to recompile subclasses (i.e. classes within a class). They just not show up in the class tree, when in C# view. In IL view, you see all of them.\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "josh",
            "time": "Jun 27, 2015 at 11:25",
            "is_accepted": false,
            "comments": [
                {
                    "user": "sivlab",
                    "text": "<span class=\"comment-copy\">Thanks for the reply. You hit the point: ILSpy doesn't generate a complete/correct project so in VS I saw the code that I want to edit but in the compiling VS generates a lot of errors. Unfortunately I don't know the complete \"desing\" of the software so I don't know which part I have to rearrange.</span>",
                    "time": null
                },
                {
                    "user": "josh",
                    "text": "<span class=\"comment-copy\">ILSpy in IL view - as well as Reflector in IL view or ILDASM output - should give you the complete \"design\". It may be - in particular for non-trivial assemblies - very well possible to identify the causes of errors of a VS project and link them to the IL view. The missing or erroneous parts may be reconstructed in C# from a manual conversion of IL code to C#. It is a similar but simpler procedure than the step from assembly to HL in other languages,  Understanding a \"design\" is very much easier in a HL view like C#.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Currently, there's no way to modify the binary directly with ILSpy. The only solution is the one you described, export the source and recompile it.\n </p>\n <p>\n  However, the feature you are looking for is included with\n  <a href=\"http://www.red-gate.com/products/dotnet-development/reflector/\" rel=\"nofollow\">\n   .NET Reflector\n  </a>\n  in the\n  <a href=\"http://reflexil.net/\" rel=\"nofollow\">\n   Reflexil\n  </a>\n  plugin.\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Spl3en",
            "time": "Jun 20, 2015 at 0:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "sivlab",
                    "text": "<span class=\"comment-copy\">I tried .NET Reflector with Reflexil plugin and I had some improvements. But once I found the method that I want to modify I go with \"Replace all with code\" but Reflexil show me it empty. So I can't modify it. Some help?</span>",
                    "time": null
                },
                {
                    "user": "josh",
                    "text": "<span class=\"comment-copy\">Reflexil is an excellent tool. To learn it, you may look at the tutorial in codeproject.com created by the inventor of Reflexil. The \"Replace all with code\" intentionally offers you an empty method intended to replace a given method completely with your own one.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I used piece of software a few years ago that allowed limited editing of the generated code directly within the tool itself, but when I say 'limited', I\n  <em>\n   really\n  </em>\n  mean limited. In fact, this feature was actually removed from more\nrecent releases of this software. The old version that had this feature is\nno longer available, but it's still a decent and free .NET decompiler so if you want to check it out, it's called DotNet Resolver.\n </p>\n <p>\n  There's also the Reflexil plugin for Reflector, which has already been mentioned, but it's also pretty unreliable and limited.\n </p>\n <p>\n  If you really want to get things done, however, I'd recommend using the ILDASM and ILASM tools which are installed with Visual Studio.\n </p>\n <p>\n  I know you want to be able to just edit the high level code, but that's just not very\nfeasible. You can use Reflector to export the source code generated from a\ndisassembled .NET application as a project, but then you have errors, missing\ndependencies, and the like to deal with.\n </p>\n <p>\n  With ILDASM and ILASM you would be editing the MSIL directly, but it's really the best way to go about modifying a .NET application. MSIL is actually pretty\nsimple and you won't have to deal with the source code produced by tools like\nReflector, which are often riddled with errors. \nMoreover, you generally won't have to worry about obfuscation. In 99% of cases you will always be able to disassemble .NET applications down to MSIL\nand then reassemble them without any issue.\n </p>\n <p>\n  There are plenty of resources online to aid you with both editing and understanding MSIL if you're not familiar with it. Good luck!\n </p>\n</div>\n</body></html>",
            "votes": "2",
            "user": "Radical Raccoon",
            "time": "Jun 28, 2015 at 1:43",
            "is_accepted": false,
            "comments": [
                {
                    "user": "sivlab",
                    "text": "<span class=\"comment-copy\">Thanks a lot. As I wrote in above comment, yeah, the decompiler generates the code that I interested in but when I export it to VS the compilation failed due to the several errors. And without the complete knowledge of the software it is impossible to correct the errors (at least for me). I will try the tool in VS that you have mentioned modifying MSIL directly.</span>",
                    "time": null
                }
            ]
        }
    ]
}