{
    "title": "How do i use IDA for heap search for specific types and values?",
    "link": "https://reverseengineering.stackexchange.com/questions/9319/how-do-i-use-ida-for-heap-search-for-specific-types-and-values",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  How do i use IDA debugger to find some specific values in process memory, like values of float or integer, or string type?\n </p>\n <p>\n  Then how can i trace how program accesses them?\n </p>\n</div>\n</body></html>",
    "votes": "5",
    "answers": 1,
    "views": "9k",
    "tags": [
        "ida"
    ],
    "user": "Croll",
    "time": "Jul 10, 2015 at 11:44",
    "comments": [],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  Question 1:\nYou may use the Ida feature Menu Search, Sequence of Bytes...\n </p>\n <p>\n  In case you  are e.g. looking for a float value, convert that float into a sequence of four bytes and let Ida search for it. The conversion can be done in Ida as well (IIRC), or in any other hex editor allowing to display different data types. Of course, if your variable is a double instead of a float you need the proper byte sequence for a double which is different. \nWhen searching for a string, you may use the same method. Of course here also you must know e.g. whether you are looking for an ascii string or another kind of string like unicode.\nWith that method, the endian-ness must be observed, because the byte sequence may be different with Big-Endian or Little-Endian.\n </p>\n <p>\n  Question 2:\n </p>\n <p>\n  In case you found your memory address, put a breakpoint on it. In a memory region, a window opens where you may edit your breakpoint, e.g. select break or trace, as well as the condition when to break and other items. A breakpoint in a code region may be edited by first putting the breakpoint on the location with F2, and then selecting \"Edit Breakpoint\" with a right mouse click.\n </p>\n</div>\n</body></html>",
            "votes": "5",
            "user": "josh",
            "time": "Jul 13, 2015 at 23:09",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Croll",
                    "text": "<span class=\"comment-copy\">Thank you! Isn't there any plugin or etc to add friendly UI for automatically converting floats or strings to hex sequence?</span>",
                    "time": null
                }
            ]
        }
    ]
}