{
    "title": "Reading line by line of the ollyDBG instead of looking for specific instructions",
    "link": "https://reverseengineering.stackexchange.com/questions/9461/reading-line-by-line-of-the-ollydbg-instead-of-looking-for-specific-instructions",
    "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  I want to know whether there is any way to understand program by reading through lines of assembly produced by OllyDBG?\n  \n\n  Is it really logical and normal thing to do? For instance, for understanding  how the malwares or viruses inject DLL into specific programs to change the way they execute by loading their own functions, is it a normal practice to read line by line? Are there any resources available to teach how to read such instructions and understand the program line by line? I have seen several RE tutorials. But most of the time, the guy would go through and look for specific instructions to manipulate and does not care about how the other areas of the program function.\n </p>\n</div>\n</body></html>",
    "votes": "0",
    "answers": 1,
    "views": "696",
    "tags": [
        "assembly",
        "ollydbg"
    ],
    "user": "FreeMind",
    "time": "Jul 27, 2015 at 10:59",
    "comments": [
        {
            "user": "Abr001am",
            "text": "<html><body><span class=\"comment-copy\">\n is it \"dejunking\" what you are looking for ?\n</span>\n</body></html>",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<html><body><div class=\"s-prose js-post-body\" itemprop=\"text\">\n <p>\n  The main idea behind RE is not just reading line by line, but carefully distinguishing important lines from not important. \nThe main part of all those tutorials is not reading assembly, but selecting places to read.\nBy the way, disassembler such as IDA is better for reading the code.\n </p>\n</div>\n</body></html>",
            "votes": "3",
            "user": "w s",
            "time": "Jul 27, 2015 at 11:13",
            "is_accepted": false,
            "comments": [
                {
                    "user": "FreeMind",
                    "text": "<span class=\"comment-copy\">@w s I have got a program which injects a dll into another process, but I do not know how to find out injection part? Could you give me a general hint for a place to start with?</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\"><a href=\"http://reverseengineering.stackexchange.com/questions/2252/what-is-dll-injection-and-how-is-it-used-for-reversing\" title=\"what is dll injection and how is it used for reversing\">reverseengineering.stackexchange.com/questions/2252/…</a></span>",
                    "time": null
                }
            ]
        }
    ]
}