{
    "title": "How do I find specific sets of data when Hex Editing? (Important) [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/10650/how-do-i-find-specific-sets-of-data-when-hex-editing-important",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nnot trying to sound like my question is just more important than others because I'm asking it, purely because the outcome of my work will involve electrical impulses directly into people's faces. I want to make sure I do this right.\nI've been looking into this hex editing and there seems to be no rhyme or rhythm to what I'm editing. I've programmed before, I can wrap my head around this stuff I just don't know where to begin. The ANSI pane is full of random numbers and letters. Is there any way to find out what hex relates to the number of impulses sent out by this machine? Or at very least, how can I approach the company that made the machine and ask intelligible enough questions to them about how to find the hex code? I want to be as efficient with my time, and their's, as I can be.\nThanks.\n",
    "votes": "-2",
    "answers": 1,
    "views": "1k",
    "tags": [
        "hex"
    ],
    "user": "JS MH",
    "time": "9 years ago",
    "comments": [
        {
            "user": "Jongware",
            "text": "But you would have recognized the data if it was stored as IEEE-754 floating point values, or another (fairly) common format? Are there not repeating values (headers, lengths) or IDs? Atill, even if you do find out that every certain position contains such-and-such number, you cannot know the meaning of that number. Ask its producer to send you the formal specification.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It's often difficult if not impossible to make sense out of raw data (what you're seeing in your hex editor). That data may be unstructured, or compressed, or encrypted, etc.\nYou'll likely need to reverse engineer the code that operates on the raw data in order to understand the content of the data file.\n",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Aug 19, 2015 at 1:15",
            "is_accepted": false,
            "comments": [
                {
                    "user": "JS MH",
                    "text": "<span class=\"comment-copy\">So if I'm just given a hex file, there's practically nowhere I can go with it?</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">Not necessarily, but often times you need to reverse engineer the software that reads from the binary file (\"hex file\") in order to understand the contents of the binary file.</span>",
                    "time": null
                }
            ]
        }
    ]
}