{
    "title": "Saving labels and comments in Immunity Debugger",
    "link": "https://reverseengineering.stackexchange.com/questions/10675/saving-labels-and-comments-in-immunity-debugger",
    "content": "I am using Immunity Dbg v1.85 (the latest version to date). I spent about an hour analyzing a piece of malware, while making comments and relabeling functions from something like X.00402AC0 to something more useful like X.password_checker. After patching the malware to skip over the password checker function (Copy to executable > All modifications) and saving it to a new file, I see all my comments and label changes have disappeared upon opening the patched version in the debugger.\nThe interesting thing is when you terminate the debugger and then re-open the original unpatched executable, the comments and labels remain. It's only when you save binary modifications to a new file that they are lost. Needless to say, this is a huge inconvenience when working on complex binaries that need to be patched and shared.\nIs there any way to save changes to labels and comments to new executables in Immunity?\n",
    "votes": "6",
    "answers": 2,
    "views": "951",
    "tags": [
        "immunity-debugger"
    ],
    "user": "AK-33",
    "time": "Aug 21, 2015 at 8:47",
    "comments": [],
    "answers_data": [
        {
            "content": "Google finds these links. Do they help?\nhttp://www.openrce.org/forums/posts/2072\nhttp://fumalwareanalysis.blogspot.com/2012/01/malware-analysis-tutorial-12-debug.html\n",
            "votes": "1",
            "user": "Vitaly Osipov",
            "time": "Aug 22, 2015 at 22:41",
            "is_accepted": false,
            "comments": [
                {
                    "user": "AK-33",
                    "text": "<span class=\"comment-copy\">Thanks for helping. I need to study these in detail and experiment. These tutorials are about saving comments when analyzing an executable and what to do if comments aren't saved when working with DLL files called by the executable. When you patch a binary, you save it to a new executable, and the new UDD file is not created until the new executable is opened, so I don't think any data saved in the original executable UDD is ever transferred.</span>",
                    "time": null
                },
                {
                    "user": "AK-33",
                    "text": "<span class=\"comment-copy\">In my own research, I came across somewhere that what I want to do is possible in OllyDbg 2.0. I may just have to bite the bullet and switch. Ughhh...</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "To preserve info from the mentioned OpenRCE forum thread, I pasted the relevant info here:\n\nOther reasons for OllyDbg v1.10 to discard .UDD data are:\n1) A change in the file pathname e.g. xxx.exe moved from \"c:\\xxx.exe\"\n  to \"c:\new\\xxx.exe\".\nYou can set the \"Ignore path and extension\" option to bypass this\n  check.\n2) A change in the LastWrite time of file.\nYou can set the \"Ignore timestamp\" option to bypass this check.\n3) A change in the CRC of the code section since last session.\nYou can set the \"Ignore CRC of code section\" option to bypass this check.\n\nI think you have the case 3.\n",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Sep 11, 2017 at 16:44",
            "is_accepted": false,
            "comments": []
        }
    ]
}