{
    "title": "How to access and modify data segment when doing hardware breakpoint crashes the application?",
    "link": "https://reverseengineering.stackexchange.com/questions/10741/how-to-access-and-modify-data-segment-when-doing-hardware-breakpoint-crashes-the",
    "content": "I want to modify the data segment in the x64_DBG, however, I don't know how to access it. \n<pre><code>lea r8,qword ptr ds:[7FEF0CA6AD8]\n</code></pre>\nIn the above code, the address <pre><code>7FEF0CA6AD8</code></pre> is loaded in <pre><code>r8</code></pre> register. I want to access the content of <pre><code>7FEF0CA6AD8</code></pre> memory address and modify it. The problem is each time I modify the address and test in the program something writes to <pre><code>7FEF0CA6AD8</code></pre> memory address. How can make it read only or find a the thing which writes to this address and try to modify that in the same way? My purpose is changing the value of this data segment register or find the logic behind the method which writes to it.\nHardware breakpoint might be a solution but when I do so the program crashes immediately\n",
    "votes": "0",
    "answers": 0,
    "views": "207",
    "tags": [
        "disassembly",
        "debuggers",
        "patch-reversing",
        "register"
    ],
    "user": "FreeMind",
    "time": "Aug 29, 2015 at 12:55",
    "comments": [
        {
            "user": "rev",
            "text": "You can put a hardware breakpoint on that address (just like Jason explained on your other question), and run the program. It'll break when it's written and it'll take you to the instruction that's modifying the data.\n",
            "time": null
        },
        {
            "user": "FreeMind",
            "text": "@AcidShout But the program crashes when I do so.\n",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "Then try a \"Memory, on access\" breakpoint instead, as can be seen in the screenshot in the answer to which @AcidShout linked above.\n",
            "time": null
        },
        {
            "user": "FreeMind",
            "text": "@JasonGeffner When I put memory breakpoint it again crashes.\n",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "Then you'll need to reverse engineer it to find out what's detecting both hardware breakpoints and memory breakpoints and disable that code.\n",
            "time": null
        }
    ],
    "answers_data": []
}