{
    "title": "ARM - Is calling function from external static library possible?",
    "link": "https://reverseengineering.stackexchange.com/questions/10766/arm-is-calling-function-from-external-static-library-possible",
    "content": "Basically i'm debugging a closed source binary on Android and i want to execute some of my code in between which is large enough not to fit in codecave. So is it possible to compile library with my code separately & then calling it from target binary?\nIf yes then how?\nMy friend suggested me to modify binary header & extend data segment to inject my code. Is it convenient?\nI have another one suggestion.\nI know interface to that closed source binary, then is it possible to write a wrapper binary?\nFor ex, suppose closed source binary is libfoo.so. Then is it possible to write a binary libbar.so which actually loads libfoo.so & sends function calls to libfoo.so\nI'm asking this because i've seen some warez programs bundled with some extra dlls & often some wrapper executable.\n",
    "votes": "5",
    "answers": 2,
    "views": "704",
    "tags": [
        "ida",
        "arm",
        "android"
    ],
    "user": "user2578525",
    "time": "Sep 1, 2015 at 3:23",
    "comments": [],
    "answers_data": [
        {
            "content": "\"Wrapping\" is definitely possible, one of the techniques I normally use for Android reverse engineering is \"shimming\" the binary. Essentially you write a small application, either Java/Application based or C/Native based. An example of doing this is here;\nhttps://github.com/rednaga/native-shim\nThis allows you to call any method you would like with slight modifications.\n",
            "votes": "4",
            "user": "diff",
            "time": "Nov 2, 2015 at 5:12",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "If this library is linked statically, you can not change it without changing the executable. However you can use Frida during debugging session to intercept specific calls, automate this task and run your own code written in (surprise!) JavaScript.\nSee simple example here for more details.\n",
            "votes": "2",
            "user": "w s",
            "time": "Sep 1, 2015 at 5:29",
            "is_accepted": false,
            "comments": []
        }
    ]
}