{
    "title": "lm command on Windbg is not showing all modules",
    "link": "https://reverseengineering.stackexchange.com/questions/10993/lm-command-on-windbg-is-not-showing-all-modules",
    "content": "I'm trying to reverse-enginering a Win7 32bit legacy driver.\nIf I break when the system is loaded I can see that the driver is loaded because the corresponding DRIVER_OBJECT is created (<pre><code>!drvobj name</code></pre> show a real object). \nBut I can't see the driver name in the module list with <pre><code>lm</code></pre> command. Is there an explanation for this?\nBecause of this I am also unable to break when this module is loaded with <pre><code>sxe ld name</code></pre> but I think that the driver is loaded just after the loading of umbus (because at this time the corresponding DRIVER_OBJECT is created). \nSearching on internet I found that this is the \"User mode bus enumerator\" but I don't understand because it is a kernel mode driver (.sys file).\n",
    "votes": "2",
    "answers": 0,
    "views": "2k",
    "tags": [
        "windbg",
        "driver"
    ],
    "user": "Marco Ramsay Qualcuno",
    "time": "Sep 29, 2015 at 10:33",
    "comments": [
        {
            "user": "blabb",
            "text": "use !drvobj \\driver\\xxxxx 7  it will show you the Address of DriverEntry: do .reload or .reload /f xxxxx.sys and list nearest symbols like ln Address of DriverEntry and not the module name\n",
            "time": null
        },
        {
            "user": "Marco Ramsay Qualcuno",
            "text": "Doing <pre><code>.reload</code></pre> when the driver is loaded allow me to show MJ function in terms of <pre><code>module name+offset</code></pre>. <pre><code>lm</code></pre> also show the module. But I'm still unable to set a bp on driver entry. <pre><code>ln addr of DriverEntry</code></pre> doesn't show anything. I tried also <pre><code>bu module_name+offset of EntryPoint</code></pre> with no luck. I think the problem is windbg does not know what \"module name\" is before I do <pre><code>.reload</code></pre> and so is unable to break on EntryPoint. Any clues?\n",
            "time": null
        },
        {
            "user": "blabb",
            "text": "module is already loaded and driver entry point is already called if you can see the module in lm list  to stop at DriverEntryPoint you should break very early (During Phase1/2 init Stage  read all the answers in this thread you should be able to find the indirect entry point in your os which is responsible for calling DriverEntry  woodmann.com/forum/archive/index.php/t-9201.html  i also wrote an answer here which i think was updated for newer os offset search this site\n",
            "time": null
        },
        {
            "user": "Marco Ramsay Qualcuno",
            "text": "Of course entry point is already called if I can see the module through <pre><code>lm</code></pre>. I'll read the answers but I usually break at system startup (with driver NOT loaded), then put a breakpoint with <pre><code>sxe ld name.sys</code></pre> but then nothing happens.\n",
            "time": null
        },
        {
            "user": "Marco Ramsay Qualcuno",
            "text": "Also, I tried to patch the \"hot patch point\" with 0xCC 0x90, but then windows fail to load the driver!! How is possible?\n",
            "time": null
        }
    ],
    "answers_data": []
}