{
    "title": "Decompiling a windows 3.1, VisualBasic 3 exe. Do I need to decompile dll too? How?",
    "link": "https://reverseengineering.stackexchange.com/questions/11068/decompiling-a-windows-3-1-visualbasic-3-exe-do-i-need-to-decompile-dll-too-ho",
    "content": "New to decompiling, and code generally. Trying to decompile a windows 3.1 game (text adventure), so I can build it up again. Because at the moment it doesn't work (even on windows 3.1).\nI decompiled the exe with DoDi (7z File) which was recommended in one of the answers to this question on SO.\nThis threw an error when decompiling the exe 'an already known error occurred'. Probably not very helpful, but I mention it just in case.\nSo, it decompiled fine to <pre><code>.mak</code></pre>, <pre><code>.frm</code></pre> and <pre><code>.bas</code></pre> files. I compiled the program again in Visual Basic 4, after correcting some syntax problems, but I get a totally non-interactive window in which none of the buttons work.\nThis makes me think that it needs to talk to the code in the dll, but is not doing so. DoDi won't decompile dlls, and I have yet to find a decompiler which will handle 16-bit (NE/New Executable) dlls.\nSo, I assume I need to decompile this dll too. How? The game files are in  <pre><code>draquest.zip</code></pre>, which is here archived here.\n",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "windows",
        "decompilation",
        "dll",
        "visual-basic",
        "ne"
    ],
    "user": "Ne Mo",
    "time": "May 23, 2017 at 12:37",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "No, it's very unlikely you have to decomile the DLL. <pre><code>COMMDLG.DLL</code></pre> is the dll that has the standard windows dialogs (File open/save dialog, color chooser, that kind of stuff), so it shouldn't have anything that's specific to your game. Everything that's going to be needed to interface with it will probably be in Cmdialog.vbx.\n",
            "time": null
        },
        {
            "user": "Ne Mo",
            "text": "hm, thank you. I wonder why it doesn't work then. Ah well :/\n",
            "time": null
        },
        {
            "user": "Ne Mo",
            "text": "I would still like to decompile it if anyone knows how...\n",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "I've yet to see a decompiler that produces 100% correct output except in trivial cases. In other words, you always start with the decompiled output, look for errors, fix them, repeat until everything seems ok. What might help you is try various options from here, and compare their outputs  to improve your source code.\n",
            "time": null
        },
        {
            "user": "Ne Mo",
            "text": "Yes, I had my hopes raised when the exe came out with nice, readable code... ah well, time to look at some of those options you provided.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "So, I assume I need to decompile this dll too.\n\nAs Guntram said, no, you don't need to decompile the VBX files.\n\nSo, it decompiled fine to mak, frm and bas files. I compiled the program again in Visual Basic 4, after correcting some syntax problems, but I get a totally non-interactive window in which none of the buttons work.\n\nThe window's form is defined in <pre><code>ONLYFORM.FRM</code></pre> and the code for the form's event handlers is in <pre><code>ONLYFORM.bas</code></pre>. If the event handler functions aren't firing, it's likely because the handlers aren't properly registered in <pre><code>ONLYFORM.FRM</code></pre>. However, you already have the code, so any future questions on how to fix the event handler registration should go to https://stackoverflow.com/.\n",
            "votes": "1",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ne Mo",
                    "text": "<span class=\"comment-copy\">I assume you mean I don't need to decompile the dll file. The VBX file can be imported into VB4 as is. Thankyou for the tip about onlyform.frm, will have a look</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">Right, you need not decompile the VBX files nor the DLL file.</span>",
                    "time": null
                }
            ]
        }
    ]
}