{
    "title": "I need advice on how to JTag a Microsoft Band",
    "link": "https://reverseengineering.stackexchange.com/questions/11099/i-need-advice-on-how-to-jtag-a-microsoft-band",
    "content": "I am studying Computer Forensics in at a university in the UK and for my final year project, I wanted to combine my love of Microsoft products and Computer Forensics to see what kind of information a Microsoft band stores.\nTo do this I need to get a data dump from the \"Band\". As the band has no usb connectivity. The only way I can think of this is to JTag the motherboard.\nI am not very experienced when it comes to Jtagging and as part of my research I have to find out how to do this. The facilities are all there in the university so that isn't a problem.\nThere has been very little research and the Microsoft band in terms of Forensic Analysis. So I was wondering whether anyone here knows their way around the band or JTagging in general.\nA picture of the motherboard and chip are available from the this link https://www.sparkfun.com/news/1681 or https://cdn.sparkfun.com/r/500-500/assets/home_page_posts/1/6/8/1/Microsoft_Band_Teardown-33.jpg\nAny help would be largely appreciated.\n",
    "votes": "2",
    "answers": 2,
    "views": "274",
    "tags": [
        "windows",
        "hardware",
        "dumping",
        "jtag"
    ],
    "user": "A Button",
    "time": "Oct 13, 2015 at 13:06",
    "comments": [
        {
            "user": "w s",
            "text": "Would you please post a picture of both sides of the board (and if possible - in better quality ?)\n",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "This post might help you identify the jtag header on your pcb; the image you link to is too low-resolution to be able to identify anything. With any more jtag questions, the guys over at electronics.stackexchange.com probably have more hardware experience than we do.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You have picked a particularly hard target to try and find JTAG on, if this is your first project.\nThere are no obvious JTAG ports on the board. The microcontroller looks to be in a BGA package, so you can't trace the pins from there. Same with the flash. It is almost certainly a multi-layer board as well.\nSo there are a number of options:\n\nIt may never have used JTAG. Very small and light devices sometimes have the processors programmed off-board, or simply have a basic bootloader that can communicate using normal channels.\nThe multi-way connectors may have been used for JTAG - the smaller one on lower right looks JTAG sized. However, those types of connectors are often rated for <100 insertion cycles, so JTAG would be uncommon on these.\nThere are a lot of test points. JTAG could be on these, but you would really need something like the JTAGulator to find it.\nSometimes, light boards have a snap-off connector used for initial programming.\n\nI would attack this from a broader perspective. Personally I would try and desolder the flash, reball it and then read it. This is not trivial either.\n",
            "votes": "4",
            "user": "Cybergibbons",
            "time": "Oct 13, 2015 at 14:10",
            "is_accepted": false,
            "comments": [
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">In the first provided link there is also a picture of the second side. However I don't see obvious JTAG connectors there too.</span>",
                    "time": null
                },
                {
                    "user": "Cybergibbons",
                    "text": "<span class=\"comment-copy\">Odd, I can't see it. Must be me being blind.</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\"><a href=\"https://cdn.sparkfun.com/assets/home_page_posts/1/6/8/1/Microsoft_Band_Teardown-28.jpg\" rel=\"nofollow noreferrer\">cdn.sparkfun.com/assets/home_page_posts/1/6/8/1/…</a> <a href=\"https://cdn.sparkfun.com/assets/home_page_posts/1/6/8/1/Microsoft_Band_Teardown-33.jpg\" rel=\"nofollow noreferrer\">cdn.sparkfun.com/assets/home_page_posts/1/6/8/1/…</a>    - note the orientation of the long connector: they look same, but in reality - different</span>",
                    "time": null
                },
                {
                    "user": "Cybergibbons",
                    "text": "<span class=\"comment-copy\">Yeah, I just saw the connector and switched off. Thanks.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "First, you will need to make a map of every pins on the PCB, you will find a good starter here.\nOnce done, what I propose is to use a JTAG discovery tool. You can find some like this one or this one . It just need an Arduino and cables.\nThese tools are usefull to find JTAG pinout, but be careful to use a 5V to 3.3V adaptor as most JTAG are 3.3V compliant, use logic level shifter.\nTo be frank when you release such hardware JTAG bus are fused, which means that they blow fuse to break the connectivity. History prove that Microsoft forget sometimes to fuse it (check XBOX360).\nIf you can share chips model numbers it would be great as we could find some SPI to use, for example with Bus Pirate.\nBTW a back picture would be great.\n",
            "votes": "2",
            "user": "VivienG",
            "time": "Oct 15, 2015 at 9:01",
            "is_accepted": false,
            "comments": []
        }
    ]
}