{
    "title": "Are HBGary FastDump Pro dumps compatible with WinDbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/11175/are-hbgary-fastdump-pro-dumps-compatible-with-windbg",
    "content": "I have read that HBGary's FastDump Pro (FDPro) can capture kernel dumps and include the page file contents.\nAlthough I'm not sure if the tool is still available commercially (it's not listed on the countertack.com webpage), I'd like to know whether the file format created by FastDump Pro is compatible with WinDbg or if I need other tools to analyze it (HBGary/Countertack tools).\nIf they are compatible, I see some benefit in having the page file contents included in the dump, since that would e.g. give the possibility of debugging a .NET application from a kernel dump, which is usually not possible since parts of the of the virtual memory have been paged out.\n",
    "votes": "2",
    "answers": 1,
    "views": "637",
    "tags": [
        "debugging",
        "windbg",
        "dumping"
    ],
    "user": "Thomas Weller",
    "time": "Oct 26, 2015 at 7:20",
    "comments": [],
    "answers_data": [
        {
            "content": "From http://cfile10.uf.tistory.com/attach/1237FF424DB038D6045F5D:\n\nFDPro is capable of exporting in two formats. The first format is\n  industry standard DD RAW format with a \".bin\" extension. This process\n  is just a literal zero-to-max_mem_size dump of the physical memory.\n  The second format that is available is known as HPAK. HPAK is an\n  HBGary proprietary format which is capable of several key features,\n  namely the ability to store and archive the RAM and Pagefile in a\n  single archive. HPAK format also supports compression using the gzip\n  format. This is useful during instances where space on the collecting\n  device/system is limited.\n\nSo any tool capable of handling raw physical memory dumps should be able to handle FDPro's .bin files.\nAs for the .hpak files, from https://books.google.com/books?id=5hvSrBGVfIgC:\n\nonly HBGary's Responder product can be used to analyze an .hpak format\n  memory dump\n",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Nov 2, 2015 at 17:53",
            "is_accepted": false,
            "comments": [
                {
                    "user": "broadway",
                    "text": "<span class=\"comment-copy\">Volatility (as of 2.3) can read hpak as well</span>",
                    "time": null
                },
                {
                    "user": "Brendan Dolan-Gavitt",
                    "text": "<span class=\"comment-copy\">So in theory this means you can also use Volatility's <code>imagecopy</code> plugin to go from hpak to raw image, then <code>raw2dump</code> to get it into Windbg.</span>",
                    "time": null
                }
            ]
        }
    ]
}