{
    "title": "Disassemble IOS Kernel Module from jailbroken device?",
    "link": "https://reverseengineering.stackexchange.com/questions/11173/disassemble-ios-kernel-module-from-jailbroken-device",
    "content": "I have a jailbroken IOS8 device, with an A6X processor. \nI'd like to pull either the device's kernel or a specific module, and decrypt it to use with a compatible objdump.\nThe IOS kernel modules do not appear to be on the exposed file system.\n",
    "votes": "1",
    "answers": 2,
    "views": "554",
    "tags": [
        "disassembly",
        "kernel-mode",
        "ios"
    ],
    "user": "Just Asking",
    "time": "Oct 26, 2015 at 22:43",
    "comments": [],
    "answers_data": [
        {
            "content": "Googled that for you: http://www.slideshare.net/i0n1c/syscan-singapore-2011-stefan-esser-targeting-the-ios-kernel slides 12 and following, by @i0n1c. I don't know if the layout is still the same, but \"easier to extract from a firmware image\" sounds like good advice.\n",
            "votes": "1",
            "user": "Vitaly Osipov",
            "time": "Oct 26, 2015 at 20:02",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Just Asking",
                    "text": "<span class=\"comment-copy\">Thank you Vitaly.  Unfortunately the method described requires devices that do not appear to have IOS8 or IOS9 firmwares available, and keys that aren't available for more recent devices. I'll update my question accordingly.</span>",
                    "time": null
                },
                {
                    "user": "Vitaly Osipov",
                    "text": "<span class=\"comment-copy\">A significant point in that preso is that modules are a part of the iOS kernel file stored in /System/Library/Caches/com.apple.kernelcaches/kernelcache</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Just so you know, this is a legal grey area. I know Apple would NOT be happy. Since I don't feel like reading their thousand page terms of use I'll tell you that most software companies(quoting from HTC's bootloader red text) state that you may not distribute your actual findings or source code. You're welcome to report bugs, but anything else could end badly.\n",
            "votes": "-1",
            "user": "Chad Baxter",
            "time": "Oct 27, 2015 at 23:23",
            "is_accepted": false,
            "comments": []
        }
    ]
}