{
    "title": "How can I further identify a file which the file command lists as 'data' [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/11205/how-can-i-further-identify-a-file-which-the-file-command-lists-as-data",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI have file named 'out'. If I issue the file command I see :\n<pre><code>:~/Desktop# file out\nout: data\n</code></pre>\nHow can I further identify what type of file this is? Interestingly, if I execute the file, I see a 'syntax error near unexpected token' error, suggesting it might be an executable, rather than data. Above command issued on linux.\nThe file in question was outputted by <pre><code>outguess</code></pre> and is part of a steganography puzzle\n",
    "votes": "2",
    "answers": 0,
    "views": "256",
    "tags": [
        "binary-analysis",
        "file-format",
        "digital-forensics"
    ],
    "user": "codecowboy",
    "time": "8 years ago",
    "comments": [
        {
            "user": "Dominik Antal",
            "text": "Did you try running a \"strings\" or \"binwalk\" on it?\n",
            "time": null
        },
        {
            "user": "codecowboy",
            "text": "strings does find some strings in the file. Binwalk I am not familiar with. I tried binwalk -A (empty output). If you can suggest some things to try I can add them to the question maybe?\n",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "Are you convinced it should be a common file type, or could it be some private data format? Not all files in the world are of common types.\n",
            "time": null
        },
        {
            "user": "codecowboy",
            "text": "it is part of a steganography challenge. I was expecting the file to contain hashes. But that was just a guess really. It would not necessarily be a common file type and could be encrypted in some way.\n",
            "time": null
        },
        {
            "user": "Vitaly Osipov",
            "text": "Most RE tools only exist for automating slow brainless tasks. Open the file in a hex editor and read it. I bet that was the whole point of a challenge - to  force people to think, make hypotheses and then prove/disprove them.\n",
            "time": null
        }
    ],
    "answers_data": []
}