{
    "title": "Condense pseudocode lines in IDA Pro",
    "link": "https://reverseengineering.stackexchange.com/questions/11275/condense-pseudocode-lines-in-ida-pro",
    "content": "In IDA 6.6, is it possible to condense, or otherwise re-arrange, lines of pseudocode given by the Hex-Rays decompiler? For example\n<pre><code>if ( !iFile2Size\n  || *pFile2BufferCopy == *pFile3BufferCopy\n  && (iFile2Size <= 1\n   || pFile2BufferCopy[1] == pFile3BufferCopy[1]\n   && (iFile2Size <= 2 || pFile2BufferCopy[2] == pFile3BufferCopy[2])) )\n  blah;\n</code></pre>\nis a bit eye bleedy. I can't for the life of me figure out how to re-arrange it though.\n",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "hexrays"
    ],
    "user": "Benjamin Tillman",
    "time": "Nov 8, 2015 at 23:50",
    "comments": [],
    "answers_data": [
        {
            "content": "The only reliable way I know about requires writing HexRays plugin.\nHere and here you have an examples of such plugins that manipulates output of the decompiler - not exactly in a way you need, but probably it will give you some direction. Examples of such a plugins in IdaPython (probably not working and outdated) may be found in its old Google Code repository (see v*.py here )\nIn addition you can manipulate decompiler configuration.\nAs it wrote here you can reduce or increase <pre><code>RIGHT_MARGIN</code></pre> parameter, and this will probably give you an ability to manipulate single line size of decompiler output (which will change representation of your condition among others). The same setting can be accessed via edit/plugins/something related to hexrays/ (sorry, I don't have HexRay installed right now) menu.\n",
            "votes": "2",
            "user": "w s",
            "time": "Nov 9, 2015 at 9:12",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Benjamin Tillman",
                    "text": "<span class=\"comment-copy\">Thanks w s. For anyone else reading this, the decompiler settings w s mentions are found under edit/plugins/Hex-Rays Decompiler, then pressing the \"Options\" button allows you to change the Comment Indent / Block Comment / Right Margins.</span>",
                    "time": null
                }
            ]
        }
    ]
}