{
    "title": "Found function in ida pro, but address keeps changing",
    "link": "https://reverseengineering.stackexchange.com/questions/11321/found-function-in-ida-pro-but-address-keeps-changing",
    "content": "I am trying to learn reverse engeneering, so I wrote a little hackme (Very basic console application, asks for a password, and outputs 'right' or 'wrong'). The first thing I wanted to do was finding the address of the '_' function, which basically outputs the given string in the console. After some searching, I found my function, but when placing a breakpoint and debugging or restarting the application, sometimes the function address changes. \nMy questions:\n\nWhy is the address changing\nHow could I dynamically find the function if I can't prevent it from changing?\n",
    "votes": "0",
    "answers": 0,
    "views": "591",
    "tags": [
        "ida"
    ],
    "user": "user2997725",
    "time": "Nov 12, 2015 at 17:32",
    "comments": [
        {
            "user": "0xec",
            "text": "This is a security feature of Windows and is called ASLR.\n",
            "time": null
        },
        {
            "user": "Brendan Dolan-Gavitt",
            "text": "Try recompiling with /DYNAMICBASE:no msdn.microsoft.com/en-us/library/bb384887.aspx\n",
            "time": null
        },
        {
            "user": "user2997725",
            "text": "I could compile my own application with /DYNAMICBASE:no, but what about other applications? Is there a dynamic way to find the function? Does ASLR mix everything or just the module? If it's just the module I could find the module base addr. and calculate the offset, right?\n",
            "time": null
        },
        {
            "user": "rev",
            "text": "You can disable ASLR for other apps using this, or get the relative address in the form of <pre><code>base + offset</code></pre> and have it right every time.\n",
            "time": null
        },
        {
            "user": "peter ferrie",
            "text": "you can also try debugging in an older OS that doesn't support ASLR, in case the file is self-checking and complains if you change the DLLCharacteristics field\n",
            "time": null
        }
    ],
    "answers_data": []
}