{
    "title": "Good training for IDAPython [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/11391/good-training-for-idapython",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 2 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm familiar with python and IDA in general.  I found a few very basic tutorials but nothing that goes through an explanation of the classes used and the full capability set.  Near as I can tell the documentation consists of a list of functions.  The IDAPro book just recommends learning it through banging your head against a wall.  \nAnyone have a better suggestion?\n",
    "votes": "9",
    "answers": 2,
    "views": "7k",
    "tags": [
        "ida",
        "idapython",
        "python"
    ],
    "user": "bravosierra99",
    "time": "2 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "I wrote Sark to avoid this banging-head-against-wall routine. It provides wrappers around most of the commonly-used IDAPython APIs, making them more pythonic.\nYou can find the documentation for Sark here on Read-The-Docs.\nAs mentioned before by @CrazyFrog, you can use:\n\nAlexander Hanel's book and blog;\nEro Carrera's Intro to IDAPyton;\n\nAdditionally, there are official Hex-Rays sources:\n\nIDAPython Examples, which is filled with useful snippets;\nIDAPython Docs, which are not too useful;\nThe IDA SDK headers (or the SDK Docs). This is a really useful source of information, as <pre><code>grep</code></pre>ing through it will usually get you the function you were looking for.\nHex-Blog - The Hex-Rays blog. Contains some neat tricks along with tutorials on new APIs.\n",
            "votes": "12",
            "user": "tmr232",
            "time": "Nov 24, 2015 at 15:55",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "Check out \"The Beginner's Guide to IDAPython\" by Alexander Hanel and his blog\nand this by Ero Carrera\n",
            "votes": "6",
            "user": "krusty",
            "time": "Nov 24, 2015 at 15:15",
            "is_accepted": false,
            "comments": []
        }
    ]
}