{
    "title": "Reverse engineering TPMS sensor data [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/11432/reverse-engineering-tpms-sensor-data",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm trying to reverse engineer data received from TPMS (car tyre pressure) sensors. I used <pre><code>rtl_433</code></pre> tool to capture the data from sensor at 433 MHz. Tool was able to detect data is using FSK modulation and Manchester encoding. \nUsing <pre><code>reveng</code></pre> I confirmed that end of data consists of 8 bit CRC. At the beginning is 32-bit sensor id, then there should be tyre pressure, temperature data and at least few status bits (together 5 bytes of unknown data). I'm not sure if these data are 8/10/16 bits each, nor their endianess or int/float. I have made a simple PHP script to try several combinations, but didn't get meaningful values with any of them.\nThe sensor IDs are: <pre><code>1c/1d/1e/1f e0 ed a5</code></pre>.\nOutput from <pre><code>reveng -a 4 -w 8 -s</code></pre>:\n<pre><code>width=8  poly=0x07  init=0xd3  refin=false  refout=false  xorout=0x00  check=0xd4  name=(none)\n</code></pre>\nTyre pressures as shown on car display were from 211 kPa in the beginning to 220 kPa at the end after few minutes of driving. Outside temperature was about 5 degC, so final tyre temp could be maybe 15-20 degC at the end, so the question is how to decode the data get these values?\nHere is data from 4 sensors:\n<pre><code>00 00 1f e0 ed a5 42 d5 66 c7 f1 10 80\n00 00 1f e0 ed a5 42 d4 66 c7 f1 06 80\n00 00 1f e0 ed a5 44 d6 66 c7 e4 0a 80\n00 00 1f e0 ed a5 44 d4 66 c7 e4 26 80\n00 00 1f e0 ed a5 55 d4 68 c8 da 23 80\n00 00 1e e0 ed a5 42 d5 66 c7 db bf 80\n00 00 1e e0 ed a5 41 d6 65 c8 cb 2d 80\n00 00 1e e0 ed a5 41 d5 65 c8 cb 17 80\n00 00 1e e0 ed a5 55 d5 68 c8 f7 8f 80\n00 00 1e e0 ed a5 55 d4 68 c8 f7 99 80\n00 00 1d e0 ed a5 44 d6 66 c7 f7 81 80\n00 00 1d e0 ed a5 41 d5 64 c8 eb 17 80\n00 00 1d e0 ed a5 55 d5 68 c8 da c7 80\n00 00 1d e0 ed a5 42 d5 65 c7 c8 f0 80\n00 00 1d e0 ed a5 42 d4 65 c7 c8 e6 80\n00 00 1c e0 ed a5 44 d5 65 c8 d9 76 80\n00 00 1c e0 ed a5 41 d4 64 c8 d3 d0 80\n00 00 1c e0 ed a5 55 d6 67 c8 df d8 80\n00 00 1c e0 ed a5 55 d5 67 c8 df e2 80\n00 00 1c e0 ed a5 55 d4 67 c8 df f4 80\n00 00 1c e0 ed a5 42 d6 65 c7 ef 46 80\n00 00 1c e0 ed a5 42 d5 65 c7 ef 7c 80\n00 00 1c e0 ed a5 42 d4 65 c7 ef 6a 80\n00 00 1f e0 ed a5 44 d6 65 c7 f3 d2 80\n00 00 1f e0 ed a5 44 d4 65 c7 f3 fe 80\n00 00 1f e0 ed a5 41 d5 64 c8 f6 b6 80\n00 00 1f e0 ed a5 41 d4 64 c8 f6 a0 80\n00 00 1f e0 ed a5 42 d6 65 c7 f9 af 80\n00 00 1f e0 ed a5 42 d4 65 c7 f9 83 80\n00 00 1e e0 ed a5 42 d6 64 c7 f7 97 80\n00 00 1e e0 ed a5 42 d5 64 c7 f7 ad 80\n00 00 1e e0 ed a5 42 d4 64 c7 f7 bb 80\n00 00 1f e0 ed a5 55 d6 67 c8 f5 85 80\n00 00 1f e0 ed a5 55 d5 67 c8 f5 bf 80\n00 00 1d e0 ed a5 42 d5 64 c7 f3 3a 80\n00 00 1d e0 ed a5 42 d4 64 c7 f3 2c 80\n00 00 1e e0 ed a5 44 d6 64 c7 f4 d5 80\n00 00 1e e0 ed a5 44 d5 64 c7 f4 ef 80\n00 00 1e e0 ed a5 44 d4 64 c7 f4 f9 80\n00 00 1e e0 ed a5 41 d4 64 c8 f6 d9 80\n00 00 1e e0 ed a5 55 d6 67 c8 f7 f2 80\n00 00 1c e0 ed a5 42 d5 64 c7 f3 43 80\n00 00 1d e0 ed a5 44 d6 64 c7 f4 5e 80\n00 00 1d e0 ed a5 44 d5 64 c7 f4 64 80\n00 00 1d e0 ed a5 55 d6 68 c8 f5 30 80\n00 00 1d e0 ed a5 55 d5 68 c8 f5 0a 80\n00 00 1d e0 ed a5 55 d4 68 c8 f5 1c 80\n00 00 1f e0 ed a5 42 d5 65 c7 f4 b6 80\n00 00 1c e0 ed a5 44 d6 65 c7 f5 4b 80\n00 00 1c e0 ed a5 44 d4 65 c7 f5 67 80\n00 00 1c e0 ed a5 41 d6 64 c8 f2 1b 80\n00 00 1c e0 ed a5 41 d5 64 c8 f2 21 80\n00 00 1c e0 ed a5 41 d4 64 c8 f2 37 80\n00 00 1c e0 ed a5 55 d6 67 c8 ed 46 80\n00 00 1c e0 ed a5 55 d5 67 c8 ed 7c 80\n00 00 1e e0 ed a5 42 d5 64 c7 f3 b1 80\n00 00 1e e0 ed a5 42 d4 64 c7 f3 a7 80\n00 00 1f e0 ed a5 44 d6 64 c7 f3 b9 80\n00 00 1f e0 ed a5 44 d5 64 c7 f3 83 80\n00 00 1f e0 ed a5 44 d4 64 c7 f3 95 80\n00 00 1f e0 ed a5 41 d5 64 c8 ed f7 80\n00 00 1f e0 ed a5 41 d4 64 c8 ed e1 80\n00 00 1f e0 ed a5 55 d4 67 c8 ea f4 80\n00 00 1d e0 ed a5 42 d6 64 c7 dc cd 80\n00 00 1d e0 ed a5 42 d4 64 c7 dc e1 80\n00 00 1e e0 ed a5 44 d6 64 c7 da 1f 80\n00 00 1e e0 ed a5 44 d5 64 c7 da 25 80\n00 00 1e e0 ed a5 44 d4 64 c7 da 33 80\n00 00 1e e0 ed a5 41 d4 64 c7 f4 14 80\n00 00 1e e0 ed a5 55 d6 67 c8 f2 e9 80\n00 00 1e e0 ed a5 55 d5 67 c8 f2 d3 80\n00 00 1c e0 ed a5 42 d6 63 c7 c3 ff 80\n00 00 1c e0 ed a5 42 d5 63 c7 c3 c5 80\n00 00 1c e0 ed a5 42 d4 63 c7 c3 d3 80\n00 00 1d e0 ed a5 41 d6 63 c7 dd 7a 80\n00 00 1d e0 ed a5 41 d4 63 c7 dd 56 80\n00 00 1d e0 ed a5 55 d6 67 c8 e0 1c 80\n00 00 1d e0 ed a5 55 d5 67 c8 e0 26 80\n00 00 1f e0 ed a5 42 d6 64 c6 d6 1c 80\n00 00 1c e0 ed a5 44 d6 63 c7 d9 f2 80\n00 00 1c e0 ed a5 44 d4 63 c7 d9 de 80\n00 00 1c e0 ed a5 41 d6 63 c8 d4 ff 80\n00 00 1c e0 ed a5 41 d5 63 c8 d4 c5 80\n00 00 1c e0 ed a5 55 d4 67 c8 d6 cb 80\n00 00 1f e0 ed a5 44 d6 64 c7 d3 59 80\n00 00 1e e0 ed a5 42 d5 64 c6 d4 51 80\n00 00 1f e0 ed a5 41 d6 63 c7 e9 04 80\n00 00 1f e0 ed a5 41 d4 63 c7 e9 28 80\n00 00 1f e0 ed a5 55 d6 67 c8 eb df 80\n00 00 1f e0 ed a5 55 d4 67 c8 eb f3 80\n00 00 1e e0 ed a5 44 d6 63 c7 9d db 80\n00 00 1e e0 ed a5 44 d5 63 c7 9d e1 80\n00 00 1d e0 ed a5 42 d4 63 c6 9a 37 80\n00 00 1e e0 ed a5 41 d6 63 c7 d6 c0 80\n00 00 1e e0 ed a5 41 d5 63 c7 d6 fa 80\n00 00 1e e0 ed a5 55 d6 66 c8 cf 31 80\n00 00 1e e0 ed a5 55 d5 66 c8 cf 0b 80\n00 00 1d e0 ed a5 44 d6 62 c7 f4 23 80\n00 00 1d e0 ed a5 44 d5 62 c7 f4 19 80\n00 00 1c e0 ed a5 42 d6 63 c6 f5 68 80\n00 00 1c e0 ed a5 42 d5 63 c6 f5 52 80\n00 00 1c e0 ed a5 42 d4 63 c6 f5 44 80\n00 00 1d e0 ed a5 41 d6 63 c7 df 74 80\n00 00 1c e0 ed a5 55 d4 66 c8 f7 47 80\n00 00 1c e0 ed a5 41 d5 63 c7 f5 e1 80\n00 00 1c e0 ed a5 44 d6 64 c6 e4 42 80\n00 00 1f e0 ed a5 42 d6 5f c6 d4 1f 80\n00 00 1f e0 ed a5 42 d5 5f c6 d4 25 80\n00 00 1f e0 ed a5 42 d4 5f c6 d4 33 80\n00 00 1f e0 ed a5 55 d6 67 c8 eb df 80\n00 00 1f e0 ed a5 41 d6 61 c7 dd 5e 80\n00 00 1f e0 ed a5 41 d5 61 c7 dd 64 80\n00 00 1f e0 ed a5 41 d4 61 c7 dd 72 80\n00 00 1e e0 ed a5 42 d4 62 c6 f2 c8 80\n00 00 1e e0 ed a5 55 d6 66 c8 e4 e0 80\n00 00 1e e0 ed a5 55 d5 66 c8 e4 da 80\n00 00 1e e0 ed a5 55 d4 66 c8 e4 cc 80\n00 00 1e e0 ed a5 41 d4 62 c7 e2 0b 80\n00 00 1e e0 ed a5 44 d6 63 c6 f5 d1 80\n00 00 1e e0 ed a5 44 d4 63 c6 f5 fd 80\n00 00 1d e0 ed a5 42 d6 60 c6 e4 db 80\n00 00 1d e0 ed a5 42 d5 60 c6 e4 e1 80\n00 00 1d e0 ed a5 42 d4 60 c6 e4 f7 80\n00 00 1d e0 ed a5 41 d6 62 c6 f4 db 80\n00 00 1d e0 ed a5 41 d5 62 c6 f4 e1 80\n00 00 1d e0 ed a5 41 d4 62 c6 f4 f7 80\n00 00 1d e0 ed a5 44 d5 63 c6 f3 72 80\n00 00 1d e0 ed a5 44 d4 63 c6 f3 64 80\n00 00 1c e0 ed a5 42 d6 61 c5 ef c7 80\n00 00 1c e0 ed a5 44 d5 62 c6 c6 eb 80\n00 00 1f e0 ed a5 42 d5 61 c5 dd e8 80\n00 00 1f e0 ed a5 42 d4 61 c5 dd fe 80\n00 00 1f e0 ed a5 41 d6 62 c7 f1 27 80\n00 00 1f e0 ed a5 41 d5 62 c7 f1 1d 80\n00 00 1f e0 ed a5 41 d4 62 c7 f1 0b 80\n00 00 1f e0 ed a5 44 d6 62 c5 d6 15 80\n00 00 1f e0 ed a5 44 d4 62 c5 d6 39 80\n00 00 1e e0 ed a5 42 d5 61 c5 9f 58 80\n00 00 1e e0 ed a5 42 d4 61 c5 9f 4e 80\n00 00 1c e0 ed a5 55 d5 65 c7 85 76 80\n00 00 1e e0 ed a5 41 d6 62 c6 ca ea 80\n00 00 1e e0 ed a5 41 d4 62 c6 ca c6 80\n00 00 1e e0 ed a5 44 d5 61 c6 f3 2f 80\n00 00 1d e0 ed a5 42 d6 60 c5 f0 88 80\n00 00 1d e0 ed a5 42 d5 60 c5 f0 b2 80\n00 00 1d e0 ed a5 42 d4 60 c5 f0 a4 80\n00 00 1f e0 ed a5 55 d5 65 c7 e8 f9 80\n00 00 1d e0 ed a5 41 d6 61 c6 ec 2e 80\n00 00 1d e0 ed a5 41 d5 61 c6 ec 14 80\n00 00 1d e0 ed a5 41 d4 61 c6 ec 02 80\n00 00 1d e0 ed a5 44 d5 62 c5 ea 69 80\n00 00 1d e0 ed a5 44 d4 62 c5 ea 7f 80\n00 00 1c e0 ed a5 42 d6 5c c4 ea b9 80\n00 00 1c e0 ed a5 42 d4 5c c4 ea 95 80\n00 00 1e e0 ed a5 55 d5 65 c7 e2 b6 80\n00 00 1c e0 ed a5 41 d6 61 c6 e4 6f 80\n00 00 1c e0 ed a5 41 d4 61 c6 e4 43 80\n00 00 1c e0 ed a5 44 d6 61 c5 e6 b3 80\n00 00 1c e0 ed a5 44 d5 61 c5 e6 89 80\n00 00 1c e0 ed a5 44 d4 61 c5 e6 9f 80\n00 00 1f e0 ed a5 42 d6 61 c4 dd c7 80\n00 00 1f e0 ed a5 42 d4 61 c4 dd eb 80\n00 00 1d e0 ed a5 55 d5 65 c7 d3 aa 80\n00 00 1d e0 ed a5 55 d4 65 c7 d3 bc 80\n00 00 1f e0 ed a5 41 d6 61 c6 da 5e 80\n00 00 1f e0 ed a5 41 d5 61 c6 da 64 80\n00 00 1f e0 ed a5 44 d5 61 c5 ec 34 80\n00 00 1e e0 ed a5 42 d6 60 c4 e9 59 80\n00 00 1e e0 ed a5 42 d4 60 c4 e9 75 80\n00 00 1e e0 ed a5 41 d6 62 c6 d6 be 80\n00 00 1e e0 ed a5 41 d5 62 c6 d6 84 80\n00 00 1e e0 ed a5 44 d6 61 c5 d9 fc 80\n00 00 1e e0 ed a5 44 d4 61 c5 d9 d0 80\n00 00 1d e0 ed a5 42 d6 60 c3 de 3c 80\n00 00 1d e0 ed a5 42 d5 60 c3 de 06 80\n00 00 1d e0 ed a5 42 d4 60 c3 de 10 80\n00 00 1d e0 ed a5 41 d6 61 c6 e2 04 80\n00 00 1d e0 ed a5 44 d5 61 c5 df 5f 80\n00 00 1d e0 ed a5 44 d4 61 c5 df 49 80\n00 00 1c e0 ed a5 42 d6 5f c4 d8 9a 80\n00 00 1c e0 ed a5 42 d5 5f c4 d8 a0 80\n00 00 1c e0 ed a5 42 d4 5f c4 d8 b6 80\n00 00 1f e0 ed a5 55 d6 65 c7 d8 53 80\n00 00 1f e0 ed a5 55 d4 65 c7 d8 7f 80\n00 00 1c e0 ed a5 41 d6 61 c6 dc c7 80\n00 00 1c e0 ed a5 41 d5 61 c6 dc fd 80\n00 00 1c e0 ed a5 41 d4 61 c6 dc eb 80\n00 00 1c e0 ed a5 44 d6 61 c5 df 1c 80\n00 00 1c e0 ed a5 44 d5 61 c5 df 26 80\n00 00 1c e0 ed a5 44 d4 61 c5 df 30 80\n00 00 1f e0 ed a5 42 d5 60 c3 e6 5c 80\n00 00 1f e0 ed a5 42 d4 60 c3 e6 4a 80\n00 00 1e e0 ed a5 55 d5 65 c7 e6 aa 80\n00 00 1f e0 ed a5 41 de 61 c6 f7 2d 80\n00 00 1f e0 ed a5 41 dd 61 c6 f7 17 80\n00 00 1f e0 ed a5 41 dc 61 c6 f7 01 80\n</code></pre>\nEDIT: The question is how to decode temperature & pressure from the received data.\n",
    "votes": "2",
    "answers": 0,
    "views": "701",
    "tags": [
        "binary-analysis",
        "decryption",
        "encodings",
        "protocol"
    ],
    "user": "Marki555",
    "time": "9 years ago",
    "comments": [
        {
            "user": "pbm",
            "text": "For completeness: this question was asked again with more details and some comments: reverseengineering.stackexchange.com/q/11539/2781\n",
            "time": null
        }
    ],
    "answers_data": []
}