{
    "title": "What's the packer/encrypter used with this file",
    "link": "https://reverseengineering.stackexchange.com/questions/11522/whats-the-packer-encrypter-used-with-this-file",
    "content": "I used PEiD & Stud_PE to get the packer/encrypter signature but unfortunately they didn't detect it.\n\ncould someone help with this issue?\nEDIT:\nAs @beatcracker said in comments, using ExeinfoPe says:\n",
    "votes": "2",
    "answers": 1,
    "views": "4k",
    "tags": [
        "disassembly",
        "unpacking",
        "packers"
    ],
    "user": "M. A.",
    "time": "Dec 13, 2015 at 18:33",
    "comments": [
        {
            "user": "beatcracker",
            "text": "Looks like the section names are randomly generated. Try to feed this file to  Exeinfo PE.\n",
            "time": null
        },
        {
            "user": "beatcracker",
            "text": "Unwrapper for GOTD installers: UnWrapper GOTD V2 Saves the Latest Giveawayoftheday Setup Files\n",
            "time": null
        },
        {
            "user": "M. A.",
            "text": "@beatcracker: it's not a Giveawayoftheday Setup File as the unpacker said, thank you for your help, my question is: is there a native exe unpacker for Themida ?\n",
            "time": null
        },
        {
            "user": "beatcracker",
            "text": "Themida is very hard to unpack (even the new driverless versions), there is a ton of protections options that can be enabled (see manual), so I doubt that there is a generic unpacker in the wild. Try this tutotial: How Unpack Themida 2.x.x\n",
            "time": null
        },
        {
            "user": "M. A.",
            "text": "@beatcracker: it worked like a charm, you have to change your comment into a valid answer\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I used PEiD & Stud_PE to get the packer/encrypter signature but\nunfortunately they didn't detect it.\n\nExeinfo PE has more recent signatures (beware of gifs, though).\n\nEDIT: As @beatcracker said in comments, using ExeinfoPe says:\nDetected Themida v2.x Inside, Themida Code on Section.\nIs there a native exe unpacker for Themida ?\n\nThemida is very hard to unpack (even the new driverless versions), there is a ton of protections options that can be enabled (see manual), so I doubt that there is a generic unpacker in the wild.\nTry this tutotial: How Unpack Themida 2.x.x. It uses OllyDbg script which hides most of the complexity required to unpack\\fix Themida.\nReferences:\n\nOriginal link to sript's author post on Tuts4You (requires registration to view)\nFiles from the post above (includes video converted to <pre><code>exe</code></pre>, I've not checked it so be careful): Themida - Winlicense Ultra Unpacker 1.4 - Tutorial.rar\nThemida unpacking thread at eXeL@B forums (Russian)\n",
            "votes": "3",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": []
        }
    ]
}