{
    "title": "Patching Application on OSX (Memory Protection)",
    "link": "https://reverseengineering.stackexchange.com/questions/11668/patching-application-on-osx-memory-protection",
    "content": "I'm patching an executable on OSX. So far I know the patches have been applied successfully.\nSteps taken (via LLDB):\n<pre><code>lldb /users/Brandon/Desktop/Test.app/Contents/MacOS/Test\nb start\nrun\nbr del 1\nmemory write 0x0006cc9f 0xB8\nmemory write 0x0006cc9f 0x01\nmemory write 0x0006cc9f 0x00\nmemory write 0x0006cc9f 0x00\nmemory write 0x0006cc9f 0x00\nprocess continue\n</code></pre>\nEverything works fine. The above changes:\n<pre><code>call testFunc</code></pre> to <pre><code>mov eax, 1</code></pre>. TestFunc is simple, it looks like:\n<pre><code>bool testFunc()\n{\n    return 0;\n}\n</code></pre>\nNow if I apply this patch via IDA-Pro/Hex-Rays, it does NOT run! I applied the patches via IDA-Pro and ran the executable but that function never seems to be executed.\nHowever, if I take the same patched executable and I run:\n<pre><code>memory read 0x0006cc9f\n</code></pre>\nIt prints: <pre><code>0xB8, 0x01, 0x00, 0x00, 0x00</code></pre> which is my patch! So the patch is applied.\nNow if I run the same <pre><code>memory write</code></pre> code in lldb on the already patched executable, and then <pre><code>process continue</code></pre> the executable behaves correctly.\nI suspect it's because it's some sort of memory protection. How can I re-protect my executable after patching it?\n",
    "votes": "1",
    "answers": 1,
    "views": "899",
    "tags": [
        "osx",
        "patching"
    ],
    "user": "Brandon",
    "time": "Jan 1, 2016 at 0:44",
    "comments": [],
    "answers_data": [
        {
            "content": "IDA Pro does not allow patching an image by default. When IDA Pro analyzes a binary, it is read into its on format; the original executable from that point forward doesn't need to be around. \nYou can however enable IDA Pro patching feature but you must be sure to have the original binary. With patching enabled in IDA Pro config, you select the following from their drop down menu: <pre><code>Edit > Patch Program > Apply Patch</code></pre> to ensure the change is committed.\nIt's is worth noting IDA Pro warns users to be cautious with this capability. Not sure it has ever been formally tested which could mean you will receive undefined behavior. If you have your doubts I suggest patching with some other utility (hex editor, debugger/disassembler).\n",
            "votes": "1",
            "user": "in70x",
            "time": "Jul 20, 2019 at 21:25",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Brandon",
                    "text": "<span class=\"comment-copy\">I actually solved it eventually.. It turns out when you patch an executable on Mac, it must be Re-Signed with a developer certificate or distribution certificate because its signature changed and it will no longer run. I'm not sure if IDA pro somehow fixes this.</span>",
                    "time": null
                },
                {
                    "user": "in70x",
                    "text": "<span class=\"comment-copy\">Ah yes. You can also force it to load non-signed binaries. Jtool is great to work with things like that. It is like otool but a bit better.</span>",
                    "time": null
                }
            ]
        }
    ]
}