{
    "title": "Decrypting IPA Binary on OS X",
    "link": "https://reverseengineering.stackexchange.com/questions/11669/decrypting-ipa-binary-on-os-x",
    "content": "I've been reading this PDF on reverse-engineering iOS applications and have reached slide 39, decrypting the binary. However, I've been attempting to disassemble and explore the binary in OS X 10.9.5 rather than iOS, since my phone is not jailbroken and I'd prefer not to do so.\nI downloaded the IPA file from the App Store by using a forward proxy running locally on my laptop to intercept the download request on my iPhone and replicate it on my laptop. From there I followed these directions to extract the encrypted binary from the IPA file, and used the directions from the PDF file to check whether it was encrypted. I confirmed that it was encrypted because the output from <pre><code>otool</code></pre> was:\n<pre><code>Load command 11\n          cmd LC_ENCRYPTION_INFO\n      cmdsize 20\n    cryptoff  8192\n    cryptsize 15187968\n    cryptid   1\n</code></pre>\nIs there a way to decrypt the DRM using only my Apple computer?\n",
    "votes": "11",
    "answers": 2,
    "views": "21k",
    "tags": [
        "arm",
        "decryption",
        "osx",
        "ios"
    ],
    "user": "Patrick Roberts",
    "time": "Jan 1, 2016 at 7:58",
    "comments": [],
    "answers_data": [
        {
            "content": "Currently you can't decrypt iOS apps without a device. The encryption keys are ultimately protected by an unknown key which is burned into the processor and cannot be extracted using software, that's why no \"offline\" decryption app has been made.\n",
            "votes": "11",
            "user": "Igor Skochinsky",
            "time": "Jan 2, 2016 at 17:21",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "Use dumpdecrypted or clutch:\nhttps://github.com/KJCracks/Clutch\nhttps://github.com/stefanesser/dumpdecrypted.git\nYou could install Clutch on your OS/X, but not sure if you will need a valid Apple developer license to compile for iphone with XCODE. I found much easier to install it through Cydia in a jailbroken device(just look for it in Cydia packet manager and install it).\nIn relation to dumpdecrypted, you will need to compile it in your OS/X with XCODE command line tools (and IOS SDK included with XCODE). With XCODE, just do a make and it should compile, no modification needs to be done to makefile. Once compiled, you could upload it to your jailbroken device through ssh:\n<pre><code># scp dumpdecrypted.dylib root@192.168.0.192:/Library/\n</code></pre>\nAn inject it into the application/process to be decrypted:\n<pre><code># DYLD_INSERT_LIBRARIES=/Library/dumpdecrypted.dylib PATH_TO_YOUR_APP mach-o decryption dumper\n</code></pre>\n",
            "votes": "1",
            "user": "evandrix",
            "time": "Jan 10, 2020 at 22:16",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Patrick Roberts",
                    "text": "<span class=\"comment-copy\">I already tried <code>dumpdecrypted</code> and I'm not sure how to edit the <code>Makefile</code> in order for it to compile on OSX. However I'm trying <code>Clutch</code> right now, I've installed <code>iOSOpenDev</code> and it compiles fine, but at runtime it attempted to access <code>/System/Library/PrivateFrameworks/AppSupport.framework/AppSupport</code> but that's a framework that only exists on iOS, not OSX. I downloaded <a href=\"https://github.com/nst/iOS-Runtime-Headers\" rel=\"nofollow noreferrer\">github.com/nst/iOS-Runtime-Headers</a> and put the framework in the directory, but it's still not loaded and I'm not sure how to load it. Can you be more detailed on getting these functional in OSX?</span>",
                    "time": null
                },
                {
                    "user": "davidfm",
                    "text": "<span class=\"comment-copy\">I included more details about installation in my original answer</span>",
                    "time": null
                },
                {
                    "user": "Patrick Roberts",
                    "text": "<span class=\"comment-copy\">These are directions that assume I have a jailbroken iPhone. I explicitly said in my question that I intend not to jailbreak it. If these don't work on OSX only then please delete your answer.</span>",
                    "time": null
                },
                {
                    "user": "k3a",
                    "text": "<span class=\"comment-copy\">AFAIK decription happens on the actual device and clutch just runs the executable under debugger, watching for main() breakpoint and dumping the decrypted executable memory. So you can't decrypt in OSX currently. We should stop using these frustrating, proprietary devices containing digital handcuffs...</span>",
                    "time": null
                }
            ]
        }
    ]
}