{
    "title": "Why is ASLR not activated though IMAGE_DLLCHARACTERISTICS_DYNAMIC_BASE is set?",
    "link": "https://reverseengineering.stackexchange.com/questions/11710/why-is-aslr-not-activated-though-image-dllcharacteristics-dynamic-base-is-set",
    "content": "Even a minimal console Delphi program that has <pre><code>IMAGE_DLLCHARACTERISTICS_DYNAMIC_BASE</code></pre> set in its PE image does not use ASLR.\n<pre><code>GetProcessMitigationPolicy()</code></pre> returns a <pre><code>PROCESS_MITIGATION_ASLR_POLICY</code></pre> of 0.\nConsequently ProcessHacker (which uses this function) reports the process for this Delphi program to have ASLR disabled -- go into the process details window of ProcessHacker to see the ASLR status.\nI can provide a minimal compiled Delphi program if that helps. I haven't been able to find out why ASLR is not activated.\nAny ideas?\nEdit:\nRelocation information is part of the executable. After even more debugging I found out that Delphi's delay loading code for functions imported from DLLs is the culprit. I'll precise the question when I have more information or a solution.\nEdit2:\nI posted the executables as attachment in the following forum, since I found no way to attach anything here:\nhttp://wj32.org/processhacker/forums/viewtopic.php?p=6887#p6887\n",
    "votes": "5",
    "answers": 1,
    "views": "934",
    "tags": [
        "windows",
        "pe",
        "windows-8",
        "delphi",
        "processhacker"
    ],
    "user": "musings",
    "time": "Jan 8, 2016 at 19:06",
    "comments": [
        {
            "user": "musings",
            "text": "Relocation information is part of the executable. After even more debugging I found out that Delphi's delay loading code for functions imported from DLLs is the culprit. Now on to debugging this...\n",
            "time": null
        },
        {
            "user": "peter ferrie",
            "text": "I would like to see the executable which produces this effect\n",
            "time": null
        },
        {
            "user": "musings",
            "text": "I added the executables in the last edit.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I'm having the same problem for a long time and had lots of investigation on this matter. In older Delphi compilers this problem don't exist and as your mentioned it is due to some API's being converted to delayed load import functions.\nA while ago I reported this issue to Embarcadero and it seems they are working on it (https://blog.marcocantu.com/blog/rad111_pe_security.html). They provided a solution for now and willing to fix it in the near feature (I hope the next release).\n",
            "votes": "1",
            "user": "Vahid Nasehi",
            "time": "Apr 17, 2022 at 5:21",
            "is_accepted": false,
            "comments": []
        }
    ]
}