{
    "title": "Unable to break at DriverEntry of malicious Driver",
    "link": "https://reverseengineering.stackexchange.com/questions/11743/unable-to-break-at-driverentry-of-malicious-driver",
    "content": "I got a malicious kernel mode driver from VirusTotal. Now, I am trying to debug it using Windbg.\nBelow are the details of the setup:\nHost OS: Win 7 Ultimate 64-bit, Windbg version 6.11.x, VMWare Workstation and Guest OS: Win XP SP3\nI placed the kernel mode driver in Guest OS in the path: C:\\drivers\\test\nAdded .sys extension to the kernel mode driver.\nIn Windbg on Host OS, I attached to the guest OS through Named Pipe. Set the breakpoint to break at DriverEntry of the driver as shown below:\n<pre><code>bu malicious_driver!DriverEntry\n</code></pre>\nThen press g.\nIn Guest OS, used OSR Driver Loader from osronline.com to load the driver.\nBrowsed for the Driver, Registered the Service and started the Service.\nI break in Windbg however I receive the following error message:\n<pre><code>kd> bu malicious_driver!DriverEntry\nkd> g\n*** ERROR: Module load completed but symbols could not be loaded for malicious_driver.sys\nBreakpoint 0's offset expression evaluation failed.\nCheck for invalid symbols or bad syntax.\nWaitForEvent failed\nnt!DebugService2+0x11:\n8052e4c5 5d              pop     ebp\nkd> !drvobj malicious_driver\nDriver object (b25eb000) is for:\nb25eb000: is not a driver object\n</code></pre>\nPlease note that I am able to successfully break at the DriverEntry of known legitimate Microsoft Windows OS drivers like ndis.sys, http.sys\nHowever, how do I break at the entry point of malicious drivers as in this case? I don't have the symbols for them either.\nThanks.\n",
    "votes": "4",
    "answers": 1,
    "views": "1k",
    "tags": [
        "windbg",
        "kernel-mode"
    ],
    "user": "Neon Flash",
    "time": "Jan 11, 2016 at 15:25",
    "comments": [],
    "answers_data": [
        {
            "content": "Try \"break on module load\" (e.g. <pre><code>sxe ld malicious_driver.sys</code></pre>). When it's hit, you can check the driver's load address and set  breakpoint by address.\n",
            "votes": "7",
            "user": "Igor Skochinsky",
            "time": "Jan 11, 2016 at 16:51",
            "is_accepted": true,
            "comments": []
        }
    ]
}