{
    "title": "How to analyze deeply every single step of a windows executable/installer [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/11761/how-to-analyze-deeply-every-single-step-of-a-windows-executable-installer",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nSay for example I'm searching for a malware that writes data, or sends data about my OS to external sources, or writes hidden files or registry entries.\nIs there a particular tool that tells me EVERYTHING an installer/executable does? This is regarding the Windows platform.\n",
    "votes": "0",
    "answers": 2,
    "views": "3k",
    "tags": [
        "executable"
    ],
    "user": "BlueStarry",
    "time": "9 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "It sounds like the best tool for you might be Process Monitor. It can log all file-system writes, network events, and registry activity:\n\nIf you need to examine the details of the network traffic, Wireshark will let you capture and see all network communications:\n\nThese two tools should satisfy your ask for \"a particular tool that tells me EVERYTHING an installer/executable does?\". If, on the other hand, you need to see everything that an installer/executable could do, then you'd need to use a disassembler like IDA Pro to examine all possible code paths, but note that this is much more time-consuming and challenging than using the other two tools described above.\n",
            "votes": "4",
            "user": "Jason Geffner",
            "time": "Jan 14, 2016 at 13:48",
            "is_accepted": true,
            "comments": [
                {
                    "user": "tmr232",
                    "text": "<span class=\"comment-copy\">You should probably add <a href=\"http://www.rohitab.com/apimonitor\" rel=\"nofollow noreferrer\">API Monitor</a> to the list.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">@tmr232: API Monitor is a fantastic tool, but the signal-to-noise ratio can be rather low relative to the output of Process Monitor. As such, I'd suggest that BlueStarry try Process Monitor first as it sounds like that will meet his or her needs.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "You may wish to use a tool called RegShot for monitoring changes in the registry. You would take a snapshot of the registry, and then run the suspicious program, any changes will be highlighted by RegShot in the next snapshot you take - RegShot - Sourceforge\n",
            "votes": "0",
            "user": "0xFFFF",
            "time": "Jan 15, 2016 at 10:35",
            "is_accepted": false,
            "comments": []
        }
    ]
}