{
    "title": "Debug an application for analyzing file decryption",
    "link": "https://reverseengineering.stackexchange.com/questions/11803/debug-an-application-for-analyzing-file-decryption",
    "content": "I have an encrypted raw data file generated by an application. This file is used in a second application to generate a readable text file based on the raw data.\nI need to change a few values in the raw data file, but since the contents of the raw data file are encrypted, I wanted to find out what is the encryption mechanism that is being used on the file, so I can decrypt it, make some changes, and encrypt it back.\nA sample of the file can be found here: http://pastebin.com/Cuj8aTG1\nSince I could not infer, based on the contents of the file, what kind of encryption is used, I wanted to know if there is a good debugger for windows that I can use to try and go through the code of the application, and see if I can check how the decryption is made.\nSince I do not know if the debugger will depend on the language used, it does not use .net, that would be more easy to reverse engineer.\nThank you for your help.\n",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "encryption",
        "decryption",
        "cryptography"
    ],
    "user": "Miguel Mesquita Alfaiate",
    "time": "Jan 20, 2016 at 9:03",
    "comments": [
        {
            "user": "w s",
            "text": "Is your app windows exe or (for example) , linux elf or something else ? Is it 32 or 64 bit ? Do I understand correctly that it is not .net application ?\n",
            "time": null
        },
        {
            "user": "Miguel Mesquita Alfaiate",
            "text": "@ws yes, it is a windows application, not using .net, as mentioned in the question. as for the 32 or 64, good question. I cannot clarify that right now.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I wanted to know if there is a good debugger for windows that I can\n  use\n\nOllyDbg v2 is a good debugger for Windows.\n",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Jan 20, 2016 at 14:09",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Stolas",
                    "text": "<span class=\"comment-copy\">My vote goes for winDbg</span>",
                    "time": null
                }
            ]
        }
    ]
}