{
    "title": "What kind of fuzzer can i use? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/11819/what-kind-of-fuzzer-can-i-use",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI studied reverse engineering for 6 months.\nAnd I wanna discover Adobe Reader vulnerability for bughunting.\nBut i have lack knowlege of this branch. Anyone help me plz?\nMy question is what kind of fuzzer can i use to fuzzing Adobe Reader?\n",
    "votes": "-2",
    "answers": 1,
    "views": "459",
    "tags": [
        "vulnerability-analysis"
    ],
    "user": "lotofquestions",
    "time": "9 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "It doesn't work like that.\nAs you might know, bugs are worth money. The main reason for tgis is at it requires both skill and time to find these bugs.\nClearly you want to learn this skill, so in the future you might be able to do this.\nSo, you can't just point a fuzzer at something and find bugs in A-software. You either need to write your own, statebased fuzzer or find bugs by reverse engineering.\nI myself am a huge fan of the latter.\nRead the docs on how it should work. Reverse a complex part (complex = programmer bugs) and audit the code.\nWhen starting out, start with finding bugs in old software. That you know contains bugs.\nHappy bug hunting!!\nEdit: Read Fuzzing Adobe Reader - Exploit Development Joxean Koret posted a great comment there.\n",
            "votes": "2",
            "user": "Stolas",
            "time": "Jan 22, 2016 at 9:56",
            "is_accepted": false,
            "comments": []
        }
    ]
}