{
    "title": "how to add instructions to executable [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/11833/how-to-add-instructions-to-executable",
    "content": "This question already has an answer here:\n                                \n                            \n\n\n\n\nReplacing small length instruction with larger length instruction\n\n                                (1 answer)\n                            \n\nClosed 9 years ago.\n\n\n\nI need to add code into an assembled program.  If I am only changing a jump, I change JE to JNE and that is simple.  If I need to add only a couple of instructions, I can find a section with a bunch of NOP's and jump to that section, insert my new code, and then jump back.\nWhat do I do if I need to insert about 10 lines of instructions and I do not have a section of NOP's that is large enough to fit my new code?  I know I can not move any of the existing code since that would throw off any calls or jumps.  I am trying to update the disassembled code in OLLYDBG since all I have is the executable.\nAny suggestion on how to do this would be appreciated.\n",
    "votes": "4",
    "answers": 1,
    "views": "4k",
    "tags": [
        "ollydbg"
    ],
    "user": "bbj",
    "time": "9 years ago",
    "comments": [
        {
            "user": "blabb",
            "text": "add an extra section of the size you wish at the end of the file and update the pe header to reflect the changes old ZEROADD by santmant used to do this very nicely  i have read cff explorer has the same capability or look for xxxxx.exe ?? by sunshine\n",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "See Replacing small length instruction with larger length instruction\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "What you're looking for is a codecave. Take a look at http://www.codeproject.com/Articles/20240/The-Beginners-Guide-to-Codecaves; it has a good intro on how to get started.\n",
            "votes": "6",
            "user": "cimarron",
            "time": "Jan 24, 2016 at 5:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}