{
    "title": "How do you effectively use gdb and IDA together?",
    "link": "https://reverseengineering.stackexchange.com/questions/12009/how-do-you-effectively-use-gdb-and-ida-together",
    "content": "When dealing with linux binaries, I like IDA as my static analysis tool and gdb as my debugger. However I have not found an effective way to integrate the two with each other.\nTo give an example, let's say I want to place a breakpoint. I will find the place in IDA. Then I will switch from graph to text mode, copy the instruction's address, switch to another window where gdb is running, enter in \"b *0x\", paste, and then I have my breakpoint. If PIE is enabled the process is worse. This is cumbersome. Furthermore, when stepping in gdb I don't have all the names or comments I've declared in IDA.\nIs there a better way to deal with this synchronization?\n",
    "votes": "0",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "gdb"
    ],
    "user": "TorbenB",
    "time": "Feb 11, 2016 at 20:29",
    "comments": [
        {
            "user": "TorbenB",
            "text": "To be clear, I don't want to switch to IDA's own debugger instead\n",
            "time": null
        },
        {
            "user": "joxeankoret",
            "text": "You can use the GDB debugger in IDA and use the GDB prompt from inside IDA if you feel more comfortable. This is the best option. Any other option, will be a hack or a workaround.\n",
            "time": null
        },
        {
            "user": "TorbenB",
            "text": "I don't mind a hack if it works.\n",
            "time": null
        },
        {
            "user": "Vitaly Osipov",
            "text": "Have you tried hex-rays.com/products/ida/support/idadoc/1335.shtml and hex-rays.com/products/ida/support/idadoc/1343.shtml ?\n",
            "time": null
        },
        {
            "user": "joxeankoret",
            "text": "In that case, you will need to develop your own hack because of your own, uhm, reasons, by yourself. I don't think anybody was so \"decided\" not to use a thing just because.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "As suggested by joxeankoret, try using the \"Remote GDB Debugger\" backend in IDA. It's quite simple to setup, debug your program with <pre><code>gdbserver</code></pre> and connect to it with IDA.\n",
            "votes": "1",
            "user": "ekse",
            "time": "Feb 12, 2016 at 19:42",
            "is_accepted": false,
            "comments": [
                {
                    "user": "TorbenB",
                    "text": "<span class=\"comment-copy\">@joxeankoret As I said, I want to use gdb, not IDA's own debugger. This link should show why they are different: <a href=\"http://reverseengineering.stackexchange.com/questions/6127/can-i-send-gdb-command-from-ida-debugger-to-gdbserver\" title=\"can i send gdb command from ida debugger to gdbserver\">reverseengineering.stackexchange.com/questions/6127/…</a>  attaching to a gdbserver means I can't use the usual gdb commands, which is what I want.</span>",
                    "time": null
                },
                {
                    "user": "ekse",
                    "text": "<span class=\"comment-copy\">That's unfortunate, I thought the gdb commandline in IDA worked in the same fashion as the WinDbg one. Unfortunately I don't have a solution in that case.</span>",
                    "time": null
                }
            ]
        }
    ]
}