{
    "title": "IDA Pro can't view part of the file, which I can see exists WinHEX",
    "link": "https://reverseengineering.stackexchange.com/questions/12043/ida-pro-cant-view-part-of-the-file-which-i-can-see-exists-winhex",
    "content": "Why does this happen and how do I get to that place in file using IDA? I have found a unicode string using WinHEX. Now I would like to see from where is it referenced. I tried to jump on the file offset, but it prints out an error: <pre><code>Command \"JumpFileOffset\" failed</code></pre>. Searching for those bytes as well as for the text value yields no results. It's like IDA somehow missed that part of the file. Looking at IDA's hex-view the file ends with a lot of <pre><code>??</code></pre> bytes, whereas in WinHEX those offsets have all sorts of data: what looks like garbage and a lots of unicode strings. \nIt seems like there is some trivial knowledge I'm missing.\n",
    "votes": "-1",
    "answers": 2,
    "views": "2k",
    "tags": [
        "ida"
    ],
    "user": "Stranger1399",
    "time": "Feb 15, 2016 at 17:57",
    "comments": [],
    "answers_data": [
        {
            "content": "By default, IDA does not load all sections.\nTo force IDA to load all sections, check the <pre><code>Manual load</code></pre> checkbox when opening the file in IDA:\n\nHowever, note that this likely won't help you, since it's very unlikely that you'll find a cross-reference from that string back to the code. If the string is in a <pre><code>.rsrc</code></pre> section, look for calls to <pre><code>FindResource()</code></pre>.\n",
            "votes": "2",
            "user": "Jason Geffner",
            "time": "Feb 16, 2016 at 0:00",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Stranger1399",
                    "text": "<span class=\"comment-copy\">That helps, thank you. I was able to put a read breakpoint on the string and find out what code uses it.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Existing data on disk that appears in IDA as '??' bytes usually means that this data is overlay, i.e. it's behind the end of the last section. Check what should be the RVA of your string and whether it does land in a section or not depending on the header of your executable.\n",
            "votes": "0",
            "user": "user2823000",
            "time": "Feb 15, 2016 at 19:05",
            "is_accepted": false,
            "comments": []
        }
    ]
}