{
    "title": "Unable to view stack and memory addresses in IDA Pro [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/12204/unable-to-view-stack-and-memory-addresses-in-ida-pro",
    "content": "This question already has an answer here:\n                                \n                            \n\n\n\n\nESP out of range of \"Stack View\" in IDA\n\n                                (1 answer)\n                            \n\nClosed 7 years ago.\n\n\n\nI am debugging a 32-bit ELF executable using remote GDB debugging option of IDA Pro. However, I am unable to view the contents of stack in the stack view. Also, the stack pointer value is: 0xFFFFD328\nIn the hex dump view, if I press G and enter the above address, it does not display. Similarly, in the stack view, I cannot scroll to this address or view it either.\nThe function prolog in the main function initializes the stack pointer as shown below:\n<pre><code>lea     ecx, [esp+4]\nand     esp, 0FFFFFFF8h\npush    dword ptr [ecx-4]\npush    ebp\nmov     ebp, esp\npush    ecx\nsub     esp, 0Ch\n</code></pre>\n",
    "votes": "1",
    "answers": 1,
    "views": "5k",
    "tags": [
        "ida",
        "debugging",
        "linux",
        "elf"
    ],
    "user": "Neon Flash",
    "time": "7 years ago",
    "comments": [
        {
            "user": "user2823000",
            "text": "Is that a userland or a kernel executable?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Right click on the Stack View and you can sync with ESP or jump to ESP. \nThe second instruction may be misleading, but it's subtracting 8 from ESP not adding a very large value.\nIn Hex view, as with many windows in IDA, you can use register names instead of a linear address when you use the Go To command. You can press 'G', input 'esp' and press ENTER to jump to ESP.\n",
            "votes": "0",
            "user": "Rhizzakanizza",
            "time": "Mar 21, 2016 at 21:55",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Nordwald",
                    "text": "<span class=\"comment-copy\">The second instruction applies a bitmask to round esp down</span>",
                    "time": null
                },
                {
                    "user": "sherrellbc",
                    "text": "<span class=\"comment-copy\">This does not seem to answer the OP's question. I am encountering the same thing right now. Upon entry to <code>main</code>, the stack pointer is <code>0xFFFFD95C</code>, while the <code>stack view</code> only shows up through <code>0xFEFFFFFC</code>. Attempting to \"sync with esp\" or jump to esp will fail. Is there a way to add more memory such that the contents of the stack can be viewed?</span>",
                    "time": null
                }
            ]
        }
    ]
}