{
    "title": "Benign Portable Executables [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/12261/benign-portable-executables",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\n.\nHello, everybody!\nFor my scientific work I need big amount of benign PE-files(dll, exe, scr, com). An amount of 500-600 files would be great.\nWhile there are plenty of websites where you can download malware, I have not found one where you may download a big amount of non malicious executables. \nDo you have some ideas where I could obtain such a big amount of Portable Executables which are not malicious?\nThank you in advance!\n",
    "votes": "2",
    "answers": 1,
    "views": "1k",
    "tags": [
        "pe",
        "benign"
    ],
    "user": "0xDEADC0DE",
    "time": "9 years ago",
    "comments": [
        {
            "user": "perror",
            "text": "I'm voting to close this question as off-topic because it's not a question and it way off-topic for this website.\n",
            "time": null
        },
        {
            "user": "0xDEADC0DE",
            "text": "But why is it not an off-topic to ask where you can download malware?(see: reverseengineering.stackexchange.com/questions/206/…) While to ask where you can download non-malware PEs for purposes of reverse engineering or research is an off-topic?\n",
            "time": null
        },
        {
            "user": "perror",
            "text": "Getting malware is certainly related but this site is more dedicated to discuss about technical stuff. Somehow, asking for an URL is just off topic (first, because it is changing at a too high pace and second because it is not technical).\n",
            "time": null
        },
        {
            "user": "0xDEADC0DE",
            "text": "Asking for an URL - is not an off topic, since it may be needed by another people who are, for example, trying to find out how to recognise malware by PE-Malformation or obfuscation in static fashion. These people may need additional benign files along with malware to compare them and do a research. That is why it is technical too and I believe that it is changing with the same pace as malware stuff. Don't be so strict, there are plenty of questions where somebody asks to find something.\n",
            "time": null
        },
        {
            "user": "blabb",
            "text": "look for getgnuwin32 and get all the windows port of unix utilities it should amount to 1200 executables\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can try to use an automated analysis system like http://bsa.isoftware.nl/ or https://www.cuckoosandbox.org/. They have the option to automate installation of setups and also keep the dropped files.\nYou can go to download.com or softpedia.com and download a large amount of setups/installers(crawler is suggested), put them in a folder and run an automatic analysis on them. You will get a list of folders with each analysis where you can search for *.exe, *.dll, etc. \nSuggestion: as some setups come bundled with toolbars, adware, etc, I suggest running a virustotal scan for all the files you obtain in order to have 100% clean set.\n",
            "votes": "1",
            "user": "xistense",
            "time": "Mar 21, 2016 at 13:02",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xDEADC0DE",
                    "text": "<span class=\"comment-copy\">Thank you for your comment. On download.com or softpedia.com I have to download files manually one by one, which is very tedious work. I would like to download them at once.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">@0xDEADC0DE: See <a href=\"https://en.wikipedia.org/wiki/Offline_reader#List\" rel=\"nofollow noreferrer\">en.wikipedia.org/wiki/Offline_reader#List</a></span>",
                    "time": null
                },
                {
                    "user": "xistense",
                    "text": "<span class=\"comment-copy\">In this case, your best bet is to contact an antivirus vendor, antivirus vendors can easily put together an archive of safe PEs (even with certain characteristics) from their databases, but unfortunately don't know if you'll be able to reach to them, unless you provide more details and proper motivation for your project. If it's an academic project, they might provide to you. Except them, I don't know who else might have such lists of safe PEs.</span>",
                    "time": null
                }
            ]
        }
    ]
}