{
    "title": "run netcat on qnx (armle)",
    "link": "https://reverseengineering.stackexchange.com/questions/12270/run-netcat-on-qnx-armle",
    "content": "I am researching an embedded device which runs QNX. I can login via telnet as a user but don't have the root password (in parallel I am running oclHashCat with the hash from the shadow file but it takes a lot of time).\nI can get access via GDB and can execute commands in root context so I was thinking that <pre><code>netcat</code></pre> would be an easy way to get a root shell (<pre><code>shell</code></pre> command in GDB doesn't appear to work).\nI found netcat binaries from netbsd for armle but when I try to run it I get the error <pre><code>can't access shared library</code></pre>. Not sure what it's missing but my guess is glibc (searching for .so with hex editor shows libc.so libdl.so).\nAm I correct that it's looking for <pre><code>libc.so</code></pre> and <pre><code>libdl.so</code></pre> ? Where to find these for QNX armle?\n",
    "votes": "1",
    "answers": 2,
    "views": "2k",
    "tags": [
        "embedded",
        "qnx"
    ],
    "user": "Remko",
    "time": "Mar 22, 2016 at 7:52",
    "comments": [
        {
            "user": "w s",
            "text": "bernardodamele.blogspot.co.il/2011/09/… - bash and telnet will probably work for you.\n",
            "time": null
        },
        {
            "user": "Remko",
            "text": "That doesn't appear to work, system doesn't have /dev/tcp\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Either get a statically linked netcat binary for said architecture, or - much easier - get the fully-fledged statically linked busybox binary from here, these should have every aviable feature activated, thus including netcat.\n",
            "votes": "1",
            "user": "dge",
            "time": "Apr 21, 2016 at 19:42",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I'm not pretty sure, but I think that these files can be obtained with QNX IDE installation, which, according to the site, can be downloaded and installed for evaluation purposes. Binary utilities and libs (again, as far as I remember) resides under target folder, in a subfolder named by the architecture.\n",
            "votes": "0",
            "user": "w s",
            "time": "Mar 22, 2016 at 12:44",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Remko",
                    "text": "<span class=\"comment-copy\">Enlisted for evaluation but this was denied :(</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">I'm far from recommend you to pirate QNX, but you'll probably find this on torrents somewhere ...</span>",
                    "time": null
                }
            ]
        }
    ]
}