{
    "title": "Question about LEA instruction",
    "link": "https://reverseengineering.stackexchange.com/questions/12300/question-about-lea-instruction",
    "content": "i'm learning to reverse engineer. So i'm coding some programs and try to understand their assembly.\nI stumbled upon a curious case and i think i can't solve it alone.\nHere's the c code:\n<pre><code> #include <stdio.h>\n\nint main(){\n\nchar *texto = \"O numero e %d\n\";\nint i = 10;\n\nwhile(i){\n    printf(texto, i--);\n}\n\nreturn 0;\n}\n</code></pre>\nThe assembly produced by IDA is the following:\n<pre><code>mov     eax, [esp+28]\nlea     edx, [eax-1] ; The part i don't understand\nmov     [esp+28], edx\nmov     [esp+4], eax\nmov     eax, [esp+18h]\nmov     [esp], eax      ; char *\ncall    _printf\n</code></pre>\nWhat i could understand is that it stores the old value in eax and pushes to stack(I purposedly didn't turn on optimizations) and then it pushes the format.\nWhile that happens in the middle it does the <pre><code>i--</code></pre>, but i can't understand how it's working. So it get's the address of <pre><code>eax-1</code></pre> and stores in <pre><code>edx</code></pre> and then stores it in <pre><code>i</code></pre>, but <pre><code>eax</code></pre>doesn't hold an address but a value.\nThanks in advance.\n",
    "votes": "6",
    "answers": 2,
    "views": "7k",
    "tags": [
        "ida",
        "disassembly",
        "x86",
        "c"
    ],
    "user": "krystalgamer",
    "time": "Mar 29, 2016 at 11:22",
    "comments": [
        {
            "user": "Vitaly Osipov",
            "text": "<pre><code>lea edx, [blah-1]</code></pre> is essentially <pre><code>mov edx, blah-1</code></pre> (the latter is obviously not a valid command)\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "What you're seeing is an efficiency trick that compilers like to use.\nInternally, the CPU doesn't make a difference between numbers and addresses - 32 bit integers and pointers are the same thing. (Or 64 bit, if you're using newer architecture, but as your register names start with <pre><code>e</code></pre>, you're using 32 bit).\nThe <pre><code>lea</code></pre> instruction loads the address of its operand, instead of the operand itself. In C terms, you could look at [eax-1] as *(eax-1), and <pre><code>lea</code></pre> adds a <pre><code>&</code></pre> operator to that, so <pre><code>lea edx, [eax-1]</code></pre> is like <pre><code>edx = &(*(eax-1))</code></pre>. Which is the same as <pre><code>eax-1</code></pre> of course.\nThe compiler could have done exactly the same using the instruction sequence <pre><code>mov edx, eax; sub edx, 1</code></pre> or <pre><code>mov edx, eax; dec edx</code></pre>. So, why did it use the <pre><code>lea</code></pre> instruction?\nThe answer is that, historically, resolving addresses in <pre><code>lea</code></pre> was done using dedicated address bus hardware and bypassed the ALU. Also, pipelining had its issues when the same register was used twice in subsequent operations. Which means, on older processors, using <pre><code>lea</code></pre> was a few cycles faster than the alternatives, and it's not hard to implement in the compiler, so this is what compilers traditionally did.\nOn new processors, the distinction \"<pre><code>lea</code></pre> uses separate hardware\" isn't (neccesarily) made any more, and pipelining is a lot more intelligent than it used to be, so i doubt it's make any difference these days. But it's still in the compilers, and won't get removed from them because there's just no good reason to.\n",
            "votes": "11",
            "user": "Guntram Blohm",
            "time": "Mar 29, 2016 at 12:07",
            "is_accepted": true,
            "comments": [
                {
                    "user": "krystalgamer",
                    "text": "<span class=\"comment-copy\">Understanding the &amp;(*(eax-1)) eas the problem. Thanks for the complete and in-depth answer!</span>",
                    "time": null
                },
                {
                    "user": "John Dvorak",
                    "text": "<span class=\"comment-copy\">Even today it reduces the code size. Is that not a win?</span>",
                    "time": null
                },
                {
                    "user": "supercat",
                    "text": "<span class=\"comment-copy\">@JanDvorak: Wouldn't storing EAX to [ESP+4], and then using \"dec eax\" and storing EAX to [ESP+28] save even more code?  I know modern CPUs are slower on \"inc\" and \"dec\" than \"add\", but I think those are still single-byte instructions are they not?</span>",
                    "time": null
                },
                {
                    "user": "DarthGizka",
                    "text": "<span class=\"comment-copy\">@Jan: Modern compilers  tend inline aggressively at the slightest provocation, so a minuscule savings here and there will go unnoticed among the hyper-bloat. Also, CPUs have so many ALUs nowadays that hardly anyone will notice that <code>lea</code> doesn't use any.  However, <code>lea</code> leaves the flags alone, it can reduce register pressure (always an issue in x86 mode!), and it can shorten dependency chains. What's not to like? ;-)</span>",
                    "time": null
                },
                {
                    "user": "Joshua",
                    "text": "<span class=\"comment-copy\">Actually, it makes a lot of difference still. In this case the generation is silly because the constant is 1, but in most cases it is better than the mov / add pair or even move / add / add triplet that would otherwise be used.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "According to Intel the LEA instruction is:\n\nThis instruction computes the effective address of the second operand\n  (the source operand) and stores it in the first operand (destination\n  operand). The source operand is a memory address (offset part)\n  specified with one of the processors addressing modes; the destination\n  operand is a general-purpose register.\n\nSo, the <pre><code>lea edx, [eax-1]</code></pre> computes the address of <pre><code>[eax-1]</code></pre>, which is eax-1, because [] means that the operand should be handled as an address. After it the address will be stored in <pre><code>edx</code></pre>.\n",
            "votes": "1",
            "user": "ebux",
            "time": "Mar 29, 2016 at 11:39",
            "is_accepted": false,
            "comments": [
                {
                    "user": "krystalgamer",
                    "text": "<span class=\"comment-copy\">Im always messing up thinking registers have addresses.. Now i understand it subtracts 1. Thanks!</span>",
                    "time": null
                }
            ]
        }
    ]
}