{
    "title": "Why do Mobile Credit Card Devices use the TRRS connection instead of the Micro USB?",
    "link": "https://reverseengineering.stackexchange.com/questions/12341/why-do-mobile-credit-card-devices-use-the-trrs-connection-instead-of-the-micro-u",
    "content": "I didn't know where to ask this; I hope it's in the proper place. \nMy wife just bought one of these mobile credit card processing devices for her phone and I was curious as to why these devices use TRRS instead of the Micro USB connection. \nCould it be as simple as a more stable, physical, attachment to the frame of the phone?\n",
    "votes": "0",
    "answers": 1,
    "views": "52",
    "tags": [
        "hardware"
    ],
    "user": "Hardrada",
    "time": "Apr 4, 2016 at 18:51",
    "comments": [],
    "answers_data": [
        {
            "content": "Probably because many mobile devices don't have micro-USB ports, but almost all of them (iPhones, iPads, Android phones, etc.) have headset (TRRS) jacks.\nThis allows the mobile credit card processing company to make a single hardware device that will work with all of these mobile devices.\n",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Apr 4, 2016 at 19:02",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Hardrada",
                    "text": "<span class=\"comment-copy\">After thinking about your reply, and then thinking about Apple hardware; I think perhaps you might be correct. Since Apple doesn't have standard \"anything\" /sarc, making use of the TRRS (standard) simplified the products such that they only have to have one technical build. This makes sense.</span>",
                    "time": null
                },
                {
                    "user": "Vitaly Osipov",
                    "text": "<span class=\"comment-copy\">No need to bash Apple, there are gazillions other phones and there is not a single port implemented on, say, more than 30% of them.</span>",
                    "time": null
                },
                {
                    "user": "Hardrada",
                    "text": "<span class=\"comment-copy\">Having no port is not the same as having a port that is proprietary. One would simply be incompatible by omission and the other incompatible by design.</span>",
                    "time": null
                }
            ]
        }
    ]
}