{
    "title": "Reverse engineering Android vendor system apps",
    "link": "https://reverseengineering.stackexchange.com/questions/12393/reverse-engineering-android-vendor-system-apps",
    "content": "I'm trying to reverse engineer certain Samsung system apps in the Galaxy S6 firmware system image, such as KnoxAttestationAgent.apk. I'm a noob when it comes to reverse engineering, and so far my attempts have been unsuccessful. Here's what I've done so far.\n\nRun apktool on the APK. I got a few XML files, including the AndroidManifest, but no source. Apparently this is because there is no classes.dex in the package.\nNoticing that there's a KnoxAttestationAgent.odex in the arm64/ folder, I tried to run baksmali 2.1.1 on it. However, this version apparently doesn't support Android 5 versions of oat. The S6 firmware I'm working on is 5.1.1.\nI tried an earlier version of baksmali 2.0.8 which doesn't have the limitation, but I get another error \"KnoxAttestationAgent.odex is not an apk, dex file or odex file.\"\nI tried to run AndroGuard on the APK, but was also unsuccessful. A bunch of errors.\n\nIs there a way for these tools (or others) to work on system apps such as the Samsung Knox ones?\nThanks!\n",
    "votes": "5",
    "answers": 1,
    "views": "3k",
    "tags": [
        "android",
        "apk"
    ],
    "user": "user1118764",
    "time": "Apr 11, 2016 at 8:23",
    "comments": [
        {
            "user": "Antimony",
            "text": "A lot of system apps are also uploaded to Play. If it is, you can get an ordinary non-odexed apk that way.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Run apktool on the APK. I got a few XML files, including the\n  AndroidManifest, but no source. Apparently this is because there is no\n  classes.dex in the package.\n\nThat's because these are odexed apps: when an app is odexed, the classes.dex is extracted from the apk.\n\nI tried an earlier version of baksmali 2.0.8 which doesn't have the limitation, but I get another error \"KnoxAttestationAgent.odex is not an apk, dex file or odex file.\"\n\nThat's right, because the .odex file is not an apk. An odex file is basically an optimized version of the classes.dex\nSo, in order to disassemble this app, you have to deodex it.\nHere is an HOW-TO guide (I haven't tested it personally): http://www.naldotech.com/how-to-deodex-applications-on-android-5-0-lollipop/\nEventually, if you follow all the steps correctly, you will have an apk ready to be reversed using APKTool. \nGood luck.\n",
            "votes": "3",
            "user": "diff",
            "time": "Apr 12, 2016 at 5:56",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user1118764",
                    "text": "<span class=\"comment-copy\">Thanks. I ended up just using oat2dex on the odex file, which generated a dex file, and then dex2jar on the generated dex file, which generated a jar file, and finally used JD-GUI on the jar file.</span>",
                    "time": null
                }
            ]
        }
    ]
}