{
    "title": "Need help with searching for reference for a string in IDA Pro [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/12456/need-help-with-searching-for-reference-for-a-string-in-ida-pro",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI have a little problem, i have loaded some firmware to IDA and it didn't analyze it correctly so i did located and tagged all the strings manyaly but it didn't helped me to find the references to them in the code.\nHow can i search for references to some memory locations (strings) in IDA ?\n",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "strings"
    ],
    "user": "Igor.N",
    "time": "9 years ago",
    "comments": [
        {
            "user": "tmr232",
            "text": "Can you provide more information? Perhaps the processor?\n",
            "time": null
        },
        {
            "user": "josh",
            "text": "Your question might be a duplicate. Look here: (reverseengineering.stackexchange.com/questions/9319/…).\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "This is a long shot, but i assume what happened is something like this:\nYour firmware does not have any ELF or similar headers (this isn't really a problem, it's expected to be this way), but is supposed to be loaded at a specific location in memory, which is not 0. Or, maybe it does have some headers, which IDA fails to recognize, so it loads those headers at 0, and the real binary a few bytes behind where it should be.\nFor the sake of this example, let's assume the firmware is supposed to be loaded at address <pre><code>0x1000</code></pre>, while IDA loaded it at <pre><code>0x0000</code></pre> - you can specify the load address when you first open the binary; if you don't change it, the default is 0.\nNow, a string that is supposed to be at address <pre><code>0x1234</code></pre> in the running binary will be located at <pre><code>0x0234</code></pre> in your IDA database. But the processor instruction in your code will still use <pre><code>0x1234</code></pre>. But because IDA doesn't find anything sensible there, it will just assume it's a number, or maybe there is something there, but it won't be your string, so IDA might put a label at that point, but it won't recognize the connection with your string.\nSo what you really should do is try and find out if a) the firmware has some headers that don't belong to the binary, in which case you should remove them before analyzing, and b) which address the firmware belongs to, and make sure you state that address when analyzing.\nI'm afraid your work with locating and tagging the strings manually was in vain; IDA does have commands to relocate a binary and adjust references, but these assume the binary is loaded/analyzed/crossreferenced correctly in the first place. Relocating your binary now won't help you as those crossreferences just aren't there.\n",
            "votes": "2",
            "user": "Guntram Blohm",
            "time": "Apr 16, 2016 at 21:20",
            "is_accepted": false,
            "comments": [
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">It isn't a long shot, it is a very standard situation, but marking strings can be useful. If you can find some assembly instruction which may point to the string (such as ADDR in Arm) you can do the following - collect all such commands you have in the code IDA recognized as such. Collect addresses of these strings. Find a common delta between current string address in which you have more hits to starts of strings with ADDR arguments, and this will probably help you to calculate a new base address of the binary.</span>",
                    "time": null
                }
            ]
        }
    ]
}