{
    "title": "Disassembler for batch/automated processing",
    "link": "https://reverseengineering.stackexchange.com/questions/12467/disassembler-for-batch-automated-processing",
    "content": "I want to extract opcodes (<pre><code>MOV, ADD, ...etc</code></pre>) from binary files 'exe files' but as I want the process to be completely automated, I was looking for a free disassembler which can be easily integrated preferably a python based tool.. \nI've found this project : http://www.capstone-engine.org \nhowever, I am still trying to figure out how it can be used to extract the opcodes 'it is a bit complicated for me!' and I want some advice 'before spending more time' in terms of whether it is the best and more flexible option available there or not.\nany help appreciated.\n",
    "votes": "2",
    "answers": 3,
    "views": "2k",
    "tags": [
        "disassemblers"
    ],
    "user": "Ophilia",
    "time": "Apr 18, 2016 at 17:26",
    "comments": [],
    "answers_data": [
        {
            "content": "The problem with most disassembler libraries - including the excellent Capstone - is that they do only part of the job that you need. They will gladly disassemble any instruction bytes that you feed them, but they won't tell you which bytes in an executable image are instructions or not.\nPE32+ executables have to declare all their non-leaf functions in their .pdata sections so that Windows can properly unwind their stack frames; this gives you a good head start if you are dealing with PE32+ (i.e. the AMD64 species of PE). In most other cases you are pretty much left to your own devices unless you have a capable analysis engine like IDA's and a good library of scripts/plugins.\nHave a look at the Python plugins for IDA that are floating around on the 'net. Some of them have to duplicate part of IDA's analysis functionality for one reason or another, and so they tend to fall back on libraries like Capstone. These can be a source of inspiration and/or ready-to-use code.\nAnd don't forget to scrutinise Capstone's list of projects that use Capstone; quite a few of them are Python-based and do advanced analysis of executables.\n",
            "votes": "3",
            "user": "DarthGizka",
            "time": "Apr 18, 2016 at 8:51",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "The free evaluation version of IDA should meet your needs:\nhttps://www.hex-rays.com/products/ida/support/download_demo.shtml\n",
            "votes": "0",
            "user": "Jason Geffner",
            "time": "Apr 17, 2016 at 23:12",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ophilia",
                    "text": "<span class=\"comment-copy\">There are two problems with the free version of ida: 1. from my 'limited experience' it doesn't look like the free version support the text interface ! which I need to use the program in the batch mode , 2. it says on their website that the 'demo' version will expire at some point and the free one doesn't have a 'linux' version which I need.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@Ophilia: in fact, the GUI version supports batch processing just fine, you don't <i>have to</i> use the text mode one.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">@Ophilia: I don't believe the time-out will be an issue if you're using it for batch processing, and there is a Linux version at <a href=\"https://out7.hex-rays.com/files/idademo69_linux.tgz\" rel=\"nofollow noreferrer\">out7.hex-rays.com/files/idademo69_linux.tgz</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Try Pyew by Joxean Koret it's open source\n",
            "votes": "-1",
            "user": "krusty",
            "time": "Apr 18, 2016 at 15:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">This answer is, more or less, link only, the software in question hasn't been maintained in 1.5 years, and there's no explanation at all how it connects to the OP's question, and which advantages or disadvantages it has over capstone which was mentioned by the OP.</span>",
                    "time": null
                }
            ]
        }
    ]
}