{
    "title": "How to obfuscate x86 assembly code?",
    "link": "https://reverseengineering.stackexchange.com/questions/12507/how-to-obfuscate-x86-assembly-code",
    "content": "For my project, I am performing a kind of checksum operation on a portion of code to protect it and therefore do not want its template to be easily visible and therefore need obfuscation.\nI have searched a lot on the net and read papers describing obfuscation definitions, types, etc. But there seems to be no tutorial on obfuscating x86 assembly code. Can anybody suggest a simple algorithm/tool for the same?\nI have read about inserting dummy code, changing the order of the instructions and other techniques but they appear to be totally random i.e. there is no end to how much dummy code to insert, etc.\nCan somebody at least guide me to the correct approach?\n",
    "votes": "1",
    "answers": 3,
    "views": "8k",
    "tags": [
        "assembly",
        "x86",
        "obfuscation",
        "security"
    ],
    "user": "rkabhishek",
    "time": "Apr 22, 2016 at 15:09",
    "comments": [],
    "answers_data": [
        {
            "content": "You should not confuse \"code protection\" and \"code obfuscation\". \"Code protection\" techniques target in recognizing code modifications (you mention a checksum) and take suitable means like crashing or delivering wrong results when tampering with the code has been recognized. Anti-Debug measures also belong into this category.\n\"Code obfuscation\" in a binary targets in blinding the investigator (and the disassembler) with awkward and often useless code, ranging from simple jmp chains to more complicated constructs. Most code obfuscation techniques result in some code bloat, and the tradeoff between the obfuscation and the performance must be considered. Here are two obfuscation examples being found \"in the wild\".\n\nDummy code: There are many means to insert nops in binaries. Examples range from simple statemens like shr eax, 0 or (in the 32-bit world) shl bx, 20h to more complicated constructions like the following example. The combination of jz and jnz followed by garbage statements (cpuid, ret), avoiding a jmp often confuses disassemblers in their ability to display logical assembly blocks.\n\n<pre><code>\n    mov si, si\n    mov esp, ebp\n    jnz loc_abcd\n    xchg edi, esi\n    mov cl, cl\n    xchg esi, edi\n    mov di, di\n    jz loc_dcba ; followed by a jmp to loc_abcd\n    cpuid\n    ret\n</code></pre>\nIn the example, the only \"real\" statement is the mov esp, ebp.\n\nComplicate simple assembly constructs. You may write a simple jmp as a combination of a push and a ret. Or, if you don't like the \"ret\" statement, you may replace it by (in 64-bit code):\n<pre><code>\nlea     rsp, [rsp+8]\njmp   qword ptr[rsp-8]\n</code></pre>\n\nMany more, and much more complicated examples can be found. If you want to dive into this matter, you need practice, as in all SW reversing. Get a protected and/or obfuscated binary like a game or a dongle protector and train. In the literature (e.g. the excellent IdaPro book by Chris Eagle) you may find some obfuscation constructs as well.\nHave fun!\n",
            "votes": "5",
            "user": "josh",
            "time": "Apr 23, 2016 at 0:00",
            "is_accepted": true,
            "comments": [
                {
                    "user": "rkabhishek",
                    "text": "<span class=\"comment-copy\">Hey Thanx a lot. Sorry for replying so late!</span>",
                    "time": null
                },
                {
                    "user": "rkabhishek",
                    "text": "<span class=\"comment-copy\">Your answer was one of the best on suggesting approaches to obfuscation. But how do I know what dummy code to insert, is there any proper algo to obfuscate - add dummy code, then complicate instructions, etc. Because this appears to be random.</span>",
                    "time": null
                },
                {
                    "user": "josh",
                    "text": "<span class=\"comment-copy\">There is no general rule about applying code obfuscation. The more \"spaghetti\", the better (from THAT point of view). If you want to get a comprehensive overview from a practical as well as from a theoretical point of view, have a look at the book by Bruce Dang et al \"Practical Reverse Engineering\". They have a complete chapter about obfuscation. Recommendable reading. Downloadable online (IIRC).</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "As mentioned in the comments, check out chapter 5 of the <pre><code>PDF</code></pre> <pre><code>Practical Reverse Engineering</code></pre> for some ideas.\nJunk code insertion:\n<pre><code>jmp label\n<junk> \nlabel:\n<real code>\n</code></pre>\nOperating System–Based Control Indirection:\n<pre><code>push addr_seh_handler\npush fs:[0]\nmov fs:[0], esp\nxor eax, eax\nmov [eax], 1234h\n<junk code>\naddr_seh_handler:\n<continue execution here>\npop fs:[0]\nadd esp, 4\n</code></pre>\nProcessor-Based Control Indirection:\n<pre><code>call target_addr\n<junk code>\ntarget_addr:\nadd esp, 4\n</code></pre>\nArithmetic Substitution via Identities:\n<pre><code>-x = ~x + 1 (by definition of two's complement) \nrotate left(x,y) = (x << y) | (x >> (bits(x)-y))\nrotate right(x,y) = (x >> y) | (x << (bits(x)-y))\nx-1 = ~-x\nx+1 = - x\n</code></pre>\nPattern-Based Obfuscation:\n<pre><code>push reg32\n</code></pre>\nbecomes\n<pre><code>push imm32\nmov dword ptr [esp], reg32\n</code></pre>\nMore pattern based examples here.\nNop code insertion\n",
            "votes": "0",
            "user": "BullyWiiPlaza",
            "time": "Sep 5, 2019 at 11:35",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "If you don't want to obfuscate the code manually, here's the 'mature' approach:\n\nSource code -> Compiler -> IR aka bitcode\nIR -> obfuscator -> obfuscated IR\nobfuscated IR -> LLVM static compiler -> final executable\n\nWhere:\n\nThe compiler which can generate IR is clang.\nObfuscator is usually opt from https://github.com/obfuscator-llvm/obfuscator/wiki/Installation\nLLVM static compiler is llc also from https://github.com/obfuscator-llvm/obfuscator/wiki/Installation\n\nManipulating IR code is much easier, than manipulating the native code. Yet learning how llvm works and how to use its classes to make changes is not trivial.\n",
            "votes": "0",
            "user": "Anton Kukoba",
            "time": "Sep 5, 2019 at 15:50",
            "is_accepted": false,
            "comments": []
        }
    ]
}