{
    "title": "x64 Memory Pointer and Addressing modes [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/12690/x64-memory-pointer-and-addressing-modes",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm working through example from a Windows disassembly training guide. In the exercise rax is set to a byte ptr, then rbx a word ptr. I notice the next byte of memory is skipped before rcx is to a dword ptr. Why did a byte of memory get skipped? Is there some alignment requirement?\n",
    "votes": "1",
    "answers": 1,
    "views": "259",
    "tags": [
        "disassembly",
        "debugging",
        "windbg"
    ],
    "user": "dcrearer",
    "time": "8 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "The main reason to align the data is for performance (some architectures will fault on misaligned data, but since you tagged this with windbg, we will assume amd/intel x64 + windows).\nQuoting from the AMD64 Architecture Programmer’s Manual Volume 1:\n\nThe AMD64 architecture does not impose data-alignment requirements for\n  accessing data in memory. However, depending on the location of the\n  misaligned operand with respect to the width of the data bus and other aspects of the hardware implementation (such as\n  store-to-load forwarding mechanisms), a misaligned memory access can\n  require more bus cycles than an aligned access. For maximum\n  performance, avoid misaligned memory accesses.\n\nIdeally the word-sized data (pointed via rbx) would be 2-byte aligned, but as noted above, it is not required.\n",
            "votes": "3",
            "user": "josh poley",
            "time": "May 18, 2016 at 19:31",
            "is_accepted": true,
            "comments": []
        }
    ]
}