{
    "title": "is it possible to decrypt Enigma and RC4 encryptions?",
    "link": "https://reverseengineering.stackexchange.com/questions/12788/is-it-possible-to-decrypt-enigma-and-rc4-encryptions",
    "content": "i have been working on a bug for almost a year trying to figure out how i can fix it.\nthe app is suppose to show some message like (\"Processing\")to notify a user that the main function is executed, so since Delphi is easy to reverse with its strings. i have searched for encryption using Olly's SnD Crypto plugin and\ni have found the following\n<pre><code> CRC32(table)\n CRC32b(table)\n MD5\n SHA1\n SHA256\n Base64 alphabet\n Base64 alphabet(Unicode/VB)\n ENIGMA encryption algorithm(WiteG)\n RC4 encryption algorithm\n</code></pre>\naccording to the plugin Enigma was used to protect two pieces in CODE section which i thought is hiding an Algorithm. \nRC4 is protecting most pieces of the DATA sections probably the Base64 encoded strings so dealing with strings is a none start for me because if it wasn't like that i would look for a messagebox Api or Search for strings.\ni would like to Decrypt Enigma then simply follow through since the app is an email transporter i will know the function and in i will be able to see where the message should be executed.\nhow can i decrypt ENIGIMA thats mostly my question?\nthank you\n",
    "votes": "2",
    "answers": 1,
    "views": "1k",
    "tags": [
        "encryption",
        "decryption",
        "delphi"
    ],
    "user": "Alexio puk2sefu",
    "time": "Jun 3, 2016 at 1:38",
    "comments": [],
    "answers_data": [
        {
            "content": "RC4 can be unpacked manually using OLLYDBG and break-pointing on VirtualAlloc\nEnigma is triky because there is enigma protector which is a packer of course its just a matter of finding Original Entry Point\nthe hardest is Enigma Vitualbox which is a crypter fully undetectable by PEiD but somebody released a program to unpack it, in my case the program didnt successfully decrypt Enigma it doesnt find engma entrypoint so i used ollydbg to manually break on CreateProcessA\n",
            "votes": "1",
            "user": "Alexio puk2sefu",
            "time": "Jun 15, 2016 at 2:21",
            "is_accepted": true,
            "comments": []
        }
    ]
}