{
    "title": "Decrypting Firmware File",
    "link": "https://reverseengineering.stackexchange.com/questions/12908/decrypting-firmware-file",
    "content": "I am by no means a hardware or software expert. But I've got a bit of a dilemma. I have on my hands an \"encrypted\" firmware image. I say that with air quotes because I'm not sure if it's encrypted, obfuscated, or whatever. It's an old firmware file that was written to a temporary firmware memory on a device and then executed through a bootloader of some kind. People before me have decrypted the same file; however that was about three years ago and the user who posted the decrypted file has dissappeared, along with the file. I really need the decrytped file, as well as the ability to re-encrypt it once I change some code and have it still run on the device once I've edited it. According to the user who decrypted it originally:\n\n\"The format is pretty complex, the cryptography is simple. There can be multiple files, encryption is optional, metadata is optional.\"\n\nThe things I know:\n\nIt is not any advanced encryption of any kind - the 1990's vintage chip had to decode it very quickly\nThe first few lines are plaintext\nThe extension is .enc\nIt has been decrypted in the past and is apparently fairly easy\n\nWhere should I start with this? I tried running a few of the first tools that come up in a google search and they lead me to dead ends. Basically I'd like something that doesn't require me to have a degree in CS to understand. Things would be so much easier if the user who figured out how to decrypt this originally had not fallen off the face of the earth, but we aren't so lucky.\nHere's a link to the original file if you want to look\n",
    "votes": "3",
    "answers": 0,
    "views": "2k",
    "tags": [
        "firmware",
        "decryption"
    ],
    "user": "Patrick",
    "time": "Jun 22, 2016 at 3:51",
    "comments": [
        {
            "user": "fpmurphy",
            "text": "Can you show us the plaintext?\n",
            "time": null
        },
        {
            "user": "Patrick",
            "text": "Updated post with a link to the file\n",
            "time": null
        },
        {
            "user": "fpmurphy",
            "text": "Yes please.  What device is the firmware for?\n",
            "time": null
        },
        {
            "user": "Patrick",
            "text": "A programming tool for old Motorola radios. Runs on a Moto HC11K4 processor, but it's loaded to a bootloader of some kind so it doesn't run directly on the chip.\n",
            "time": null
        }
    ],
    "answers_data": []
}