{
    "title": "Infrared Remote Control Programming / Development",
    "link": "https://reverseengineering.stackexchange.com/questions/12971/infrared-remote-control-programming-development",
    "content": "How do I create an infrared remote control development environment in Linux? My short term goal is to find out available command codes accepted or recognized by the infrared receiver on my older projector. The device was purchased second hand with missing remote control and I would like to know how can I use a generic remote control to interact with it. \nThis seems like an interesting challenge to me and I am interested to explore further how to decode, encode and reverse engineer infrared modules on other devices. While playing with LIRC on my computer allows me to play with the remote controls, I am yet to find resources that can interact with the receiver modules on other devices. One of the possible solution is to create an infrared transceiver module using Arduino to bruteforce and log communication with other infrared receivers  but I am still looking for the resources online that can help me achieve that. However I would like to know if anyone here reverse engineered infrared remote control modules before and find out a better/simpler ways to do so.\n",
    "votes": "0",
    "answers": 1,
    "views": "244",
    "tags": [
        "serial-communication",
        "communication"
    ],
    "user": "harayz",
    "time": "Nov 26, 2016 at 16:11",
    "comments": [],
    "answers_data": [
        {
            "content": "I don't want to stop anyone from reverse engineering stuff cuz I certainly do things all the time when they aren't necessary, BUT it sort of sounds like you're shaving a yak (phrase was learned from another RE answer). I'd suggest buying a cheap remote control that is programmable and lookup your devices on the package insert. Then if you really want, you can get the IR codes using whatever method you want.\n",
            "votes": "1",
            "user": "justin",
            "time": "Jul 4, 2016 at 1:47",
            "is_accepted": false,
            "comments": [
                {
                    "user": "harayz",
                    "text": "<span class=\"comment-copy\">if at all, at least i learned not control my urges to be 'shaving a yak' a little less. thank you!</span>",
                    "time": null
                }
            ]
        }
    ]
}