{
    "title": "Function is returning to somewhere in stack",
    "link": "https://reverseengineering.stackexchange.com/questions/12996/function-is-returning-to-somewhere-in-stack",
    "content": "I'm trying to hook this 'recv callback' function and can manage to hook the function. However, when the 'new function' is supposed to return to its caller, it's instead returning to somewhere in stack, causing an access violation while executing opcodes which are actually some data on stack. \nI've been trying to debug this for hours but got nowhere. If someone did experience a similar issue and can point me to possible solutions I'd appreciate it very much.\nIf you've got a clue of what could be the issue and need further information on anything please let me know and I'll try to provide the best I can.\nUpdate 1\nFunction information from IDA:\n\nMy function:\n\nAlso need to point that I can call original function(non-hooked) using:\n<pre><code>on_recv((char*)buf, ARRAYSIZE(buf), 0, 0x0018F7AC);\n</code></pre>\nAlso tried changing myOnRecv to __cdecl and __fastcall but no luck there either. \nUpdate 2\nUpon further debugging I figured that function is returning to whatever was passed as 4th(last) parameter. What could be the reason of this?\n",
    "votes": "1",
    "answers": 1,
    "views": "97",
    "tags": [
        "c",
        "stack"
    ],
    "user": "AcarX",
    "time": "Jul 5, 2016 at 18:01",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "It sounds like your new function's prototype doesn't match the original function's prototype.\n",
            "time": null
        },
        {
            "user": "AcarX",
            "text": "Edited my post.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It was as Jason Geffner suspected. My function prototype was correct but the pOnRecv typedef didn't have __stdcall in it. \nI couldn't figure it out until I've looked at assembly of the function and seen it did add to esp. I'm leaving it here, incase someone else happens so have a similar issue.\n",
            "votes": "2",
            "user": "AcarX",
            "time": "Jul 6, 2016 at 20:13",
            "is_accepted": false,
            "comments": []
        }
    ]
}