{
    "title": "IDA - Is it possible to \"add\" local variables in pseudocode view",
    "link": "https://reverseengineering.stackexchange.com/questions/13136/ida-is-it-possible-to-add-local-variables-in-pseudocode-view",
    "content": "I was disassembling a function using IDA's pseudocode view and for some reason, IDA did not associated labels to some of the variables\n\nTo fix that, I added some comments so I can work with it.\nIs there a way to manually add such variables ?\nI saw a SE post saying to make a script, I'm a new IDA user, I don't really want to bother with that yet.\nIf it's not possible or \"\"\"complicated\"\"\" (don't throw me rocks please ;) ) that's no big deal, the function is not that large I can work on it without problems, I'm asking this to get the hang of IDA or to get a general approach of this problem.\nThank you for your time.\n",
    "votes": "2",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ida"
    ],
    "user": "Riptide",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [],
    "answers_data": [
        {
            "content": "All highlighted identifiers looks like class members (or structure members, depends on the code) where the object is pointed by <pre><code>this</code></pre> pointer, which is located not on stack of this specific function, but in other place.\nYou can handle it as follows:\n\nRight click on <pre><code>this</code></pre>\nFind in the context menu something like \"Create structure\" and press it\nGive this structure a name\nEnjoy results\nYou can rename structure fields by pressing N just as in case of ordinary variables.\nYou can edit the structure in structures window (View->Open subviews->Structures, refresh the pseudo-code view after edit)\n\nYou'll probably need to assign the same pointer type to <pre><code>this_</code></pre> variable.\nBy the way, if you'll press = on <pre><code>this_</code></pre> variable you'll be able to define that <pre><code>this</code></pre> and <pre><code>this_</code></pre> are actually the same thing, this will simplify the resulting pseudo-code.\nGood luck\n",
            "votes": "2",
            "user": "w s",
            "time": "Jul 25, 2016 at 13:52",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Riptide",
                    "text": "<span class=\"comment-copy\">Right! Silly me, of course these are not arguments or stack variables, I'll try to use the data structure feature when I'll get to my pc, thanks for the tips I'll come back ;D</span>",
                    "time": null
                }
            ]
        }
    ]
}