{
    "title": "Reverse engineering a whole website [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/13253/reverse-engineering-a-whole-website",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nHow do i reverse engineer every single aspect and functionality of a website so that i get an exact fully working copy of it?. All interactions including JavaScript, cascade style sheets, PHP to make a perfect clone of it?\n",
    "votes": "0",
    "answers": 2,
    "views": "21k",
    "tags": [
        "websites"
    ],
    "user": "user87552",
    "time": "8 years ago",
    "comments": [
        {
            "user": "NirIzr",
            "text": "Are you trying to comprehend the interactions with the web site or are you trying to create a clone? I don't think cloning a website is considered reverse engineering and predicting outputs for every possible input is a problem difficult to solve.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can get pretty close, but if the site uses PHP, ASP.NET, or some other form of server-side html rendering, you'll never be able to completely reproduce a copy of it. This is because that server-side rendering code is just that, only on the server, and it is never sent down to the browser. \nBut if you want to ignore all that, you can certainly assume the html that comes back is static and work from there. The first request made to a website (once all redirects are done) is always a single response containing an html page. The browser then renders this html onto the window. It will download and run any scripts (js) when it hits a script tag. The scripts are run in-place, even if the whole html page hasn't been rendered yet. This is why web frameworks like Angular or React will recommend putting the script tags after the main content container has been rendered. The process is similar for style sheets. Each style tag will download a style sheet and compile it. \nThe great thing is that all this is laid out in order in the network tab of your browser's developer tools. You can view each http request made to the website's server, including the latency, full request contents, and full response contents, and a bunch of other helpful information. I'm not sure how it works for Firefox or other browsers, but if you're on Chrome you can open the developer tools by hitting F12 on Windows or Alt+Shift+I on Mac. There's a bunch of other really cool stuff you can see as well.\n",
            "votes": "1",
            "user": "jchitel",
            "time": "Aug 10, 2016 at 20:15",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "You may be able to reverse engineer the Javascript, CSS, and HTML, but not PHP or ASP. Using PHP as an example, if you have a command <pre><code>echo \"foo\";</code></pre>, the echo code gets executed on the server itself, and you see only the \"foo\" in the HTML you get. If you want to get PHP, you should test the functionality of the webpage, and hand-code the PHP accordingly.\nYou do not need to reverse-engineer CSS. You can simply copy it from the HTML if it's inline, and cURL the CSS from the link element, or simply use Chrome's dev tools to find the location and source. \nTo reverse-engineer Javascript, I heavily recommend using Chrome's developer tools. Features include a JS console, pretty printing (making obfuscated code way easier to read by spacing out), a timeline to see when different functions are called, a debugger with breakpoints, and a sources section to see the script's location.\n",
            "votes": "1",
            "user": "John K",
            "time": "Aug 11, 2016 at 18:48",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user87552",
                    "text": "<span class=\"comment-copy\">i dont know PHP yet ...ive read that you can hack into servers and grab the file ....im on kali linux ...can you advise me on how to get access to them? ....its not a complex site...its a simple one... www.musicforyou.ga</span>",
                    "time": null
                },
                {
                    "user": "John K",
                    "text": "<span class=\"comment-copy\">I think you should not attempt to do this. That would be illegal to do. You could hire someone who knows PHP though. Apart from that, \"knowing how to hack\" might not be a good term. A hacker finds an exploit with creativity</span>",
                    "time": null
                },
                {
                    "user": "user87552",
                    "text": "<span class=\"comment-copy\">ill take your advise ....ill try to learn PHP ...thank you good sir :-)</span>",
                    "time": null
                },
                {
                    "user": "Ibrahim Mohamed",
                    "text": "<span class=\"comment-copy\">@TheBro21 (\"knowing how to hack\" might not be a good term. A hacker finds an exploit with creativity.) Exactly!</span>",
                    "time": null
                }
            ]
        }
    ]
}