{
    "title": "reverse engineering of electronics of father.io game [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/13294/reverse-engineering-of-electronics-of-father-io-game",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nFather.io game has recently become a famous AR FPS game. I want to know the concept of this game electronics design and ideas?\nI'm planning with some friends of me to make a shooting game like Father.io [see this link for video of the game], and we're very confused about the teknik/tools/sensors/methods they are using for detecting other players and shooting them when aiming on them.\nImage processing, thermal detection, calculating players position and orientation, we thought almost in everything but nothing seemed to be working.\nHow possibly could they detect other players, and how could they recognize players from other people outside the game?\n",
    "votes": "0",
    "answers": 1,
    "views": "173",
    "tags": [
        "hardware"
    ],
    "user": "Abozanona",
    "time": "8 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "There doesn't seem to be much hardware involved. The addon seems to be not much more than a couple of IR LEDs plus a few sensors, so I suspect most of the algorithms are in the software running on the phone. At a guess, some information is encoded into the IR emission patterns and the software decodes them.\nMaybe I'm mistaken but it's pretty difficult to say more without at least a teardown and access to the software.\n",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Aug 17, 2016 at 11:26",
            "is_accepted": false,
            "comments": []
        }
    ]
}