{
    "title": "Invalid Win32 application/Not a valid Exe",
    "link": "https://reverseengineering.stackexchange.com/questions/13316/invalid-win32-application-not-a-valid-exe",
    "content": "I am currently trying to reverse a program that is EXE format, and I believe written and compiled with Microsoft Visual C++ 2010. The end goal is to map the executables functions, and find a method to bypass the file entirely. I have attempted among other things to open the file with ollydbg.\nOlly states that it is probably not a win32 application, upon accepting that, olly is unable to start the program. Log says nothing. Yet the program starts perfectly in a normal context. After some reading it seems clear to me that the author must have exploited the PE header in some way to confuse the debugger.\nMy question is, surely there must be plugins or debuggers out there that can closer mimic the windows loader, and therefore can run these files, if so can you list an example?\nI say this because i can open the file in resource hacker,but again PEid does not.\nP.S - Starting the program and then attempting to attach does nothing as the process is not listed.\nWhat I've Read:\nRESE - Basically messed with PE to the point where windows wouldn't load the exe\nRESE - Specific only to Resource Hacker (which funnily enough works)\nRESE - Does not seem to give a way to combat\nRESE - Explains of methods for other resource editors, is there a method for Olly\nVirus Bulletin - Explains PE manipulation, introduces PeSweep\nPE Header (Not complete):\n",
    "votes": "2",
    "answers": 0,
    "views": "5k",
    "tags": [
        "windows",
        "ollydbg",
        "pe"
    ],
    "user": "RandomHash",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [
        {
            "user": "peter ferrie",
            "text": "if Olly can't load the file, then Windows can't load the file.  If you don't see the PE header, then it's not a PE file.\n",
            "time": null
        },
        {
            "user": "RandomHash",
            "text": "There is a PE header. Windows can run the file. I will update with picture.\n",
            "time": null
        },
        {
            "user": "peter ferrie",
            "text": "ah, this is a 64-bit executable.  you can tell that by the value after the \"PE\" signature - \"8664\" is 64-bit.  \"014C\" is 32-bit.  Olly doesn't understand 64-bit executables.\n",
            "time": null
        },
        {
            "user": "blabb",
            "text": "Try x64dbg it is wip but should be able to provide some info\n",
            "time": null
        },
        {
            "user": "RandomHash",
            "text": "ah! a rookie mistake :( i should have really got that. Thanks :)\n",
            "time": null
        }
    ],
    "answers_data": []
}