{
    "title": "Reversing a 3D file format from 2001",
    "link": "https://reverseengineering.stackexchange.com/questions/13331/reversing-a-3d-file-format-from-2001",
    "content": "This is a korean MMORPG released back in 2001. The game and the company no longer exists. I've been analyzing the file formats as a personal project for awhile now. \nI have already decoded the textures and script files. I only have 2 more files left to decode: <pre><code>.ani</code></pre> and <pre><code>.obj</code></pre>. With the extensions, I would guess that the <pre><code>.ani</code></pre> contains the animation and <pre><code>.obj</code></pre> contains the 3d models. As the title of my question would suggest. I'm currently working on the <pre><code>.obj</code></pre> file. \nWhat I Know\n<pre><code>.obj</code></pre> files are actually archives that contains one or more models. But exclusively 3D models (biped) because the textures are found on another archive with the extension <pre><code>.t16</code></pre> or <pre><code>.tex</code></pre>.\nI'll take the 22nd model inside the file <pre><code>def.obj</code></pre> as an example. I have also taken it out of the archive and saved it as a file called `def_022.obj.\nFrom here on, I'll call the 22nd model <pre><code>Armor of Eagle</code></pre>. The next image is the texture for the <pre><code>Armor of Eagle</code></pre> found on <pre><code>def.t16</code></pre>:\n\nThe Armor of Eagle in-game:\n\nA <pre><code>def_inf.txt</code></pre> file has this related line:\n<pre><code>filename    LODstep polycnt\narmor_eagle 0       313     // eagle = index 22\n</code></pre>\nIn general, the structure of <pre><code>.obj</code></pre> is:\n<pre><code>06 00 00 00 03 00     // don't know what\n3C 00                 // total number of models in this list\n01 00 9E 00 00 00 9E 00 00 00 78 00 00 00 78 00 00 00 // the first model on the list with 0x9E polygons and 0x78 verticies\n01 00 64 00 00 00 64 00 00 00 61 00 00 00 61 00 00 00 // the 2nd model\n....... // continues until you reach the end of the headers\n....... // then the bodies start, actual 3d data\n</code></pre>\nThis is how the headers looks:\n\n\nCyan: \n\n\n39 01 00 00 = 313 polygon count\n18 01 00 00 = 280 vertex count\nAD 00 6B 00 = unknown\n\n\nAbout def_022.obj\nThe face indices start at <pre><code>0x4C [00 00 01 00...]</code></pre>\nand by the looks of it ends at <pre><code>0x7A2 [...A2 00 A3 00]</code></pre>\nI was using the tool called <pre><code>hex2obj 0.24c</code></pre> but didn't have any luck in guessing the starting points of the vertices and uv list.\n\n\nYellow: seems to me that it is the chunk marker. (because all files start with it)\nLight Blue: is a uint16 seq no., +1 for every model inside the <pre><code>def.obj</code></pre>. And it also corresponds to the index of its texture (on the texture archive).\nDark Green: is the face indices.\n\nThe Question\n\nHow do I go forward?  \nHow do I find the address where the UV starts? (books? articles? resources?)\nLastly, how do I know where the vertices start?\n\nThis is all considering that I just analyze the binary and not debug the client itself to see how the client is taking the data.\nUPDATE\nI noticed a few new things on the file I'm analyzing <pre><code>def_022.obj</code></pre>. A bytearray gets repeated a lot of times. Although, I'm still not sure of the significance YET. <pre><code>00 00 80 3F</code></pre> is also the bytes that each model start with, which I thought was the chunk marker:\n\n\nYellow: is the repeated bytes. You'll also notice that it is usually preceded by the byte <pre><code>0x3F</code></pre> or <pre><code>0x3E</code></pre> and followed by <pre><code>0x0C</code></pre> and <pre><code>0x0D</code></pre> and then 3 bytes of <pre><code>0x00</code></pre>. This pattern gets repeated 185 times.\nCyan: is the area containing the face indices.\nUpon further research I found out that <pre><code>3f80 0000 = 1</code></pre> or <pre><code>0000 803f = 1</code></pre> for little endian. But still don't know the significance, I'm going to dig deeper.\n\nBased on the notes Mr @RadLexus has kindly provided. I was also able to plot the vertices and imported into blender:\n\nAdded the normals and UV:\n<pre><code>v -13.531700 37.445000 2.338600\nvn -0.687800 0.725000 -0.036200\nvt 0.583800 0.086300\n</code></pre>\nThen I tried adding the faces:\n<pre><code>f 1 2 3\nf 1 3 4\nf 5 6 7\nf 5 7 8\nf 9 10 11\n...\n</code></pre>\n\nBut still can't figure out how to apply the textures.\nUPDATE\nSo I tried changing my <pre><code>.obj</code></pre> file to include a few more info about the face values like (just duplicated the value as x/x/x):\n<pre><code>f 1/1/1 2/2/2 3/3/3\nf 1/1/1 3/3/3 4/4/4\nf 5/5/5 6/6/6 7/7/7\n</code></pre>\nI finally got this:\n\nAlthough it's still wrong, I guess I'm a bit closer.\nFINAL UPDATE\nHave figured it out. Although, I still don't know what the unknown1 and unknown2 are but it looks good enough:\n\n\n\nNote: I know almost nothing about 3D file formats. Other than the basic components of a 3D object.\n\nDownload Related Files Here\n",
    "votes": "6",
    "answers": 1,
    "views": "3k",
    "tags": [
        "binary-analysis",
        "file-format",
        "hex"
    ],
    "user": "majidarif",
    "time": "Aug 25, 2016 at 19:43",
    "comments": [
        {
            "user": "Jongware",
            "text": "Can you add a link to original files to download and inspect?\n",
            "time": null
        },
        {
            "user": "majidarif",
            "text": "@RadLexus thank you for your interest. I've added updated the question to include a link to the related files. I've also included related scripts I wrote for extracting data.\n",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "Just FYI: you are on the right track with those 'repeated sequences'. Look up how a 4-byte float is stored. Recognizing these is a huge and important step in reversing a 3D format.\n",
            "time": null
        },
        {
            "user": "majidarif",
            "text": "@RadLexus I'm digging more into it. But I'm still not sure what the pattern is about. Although, a quick search showed that <pre><code>3f80 0000 = 1</code></pre> or <pre><code>0000 803f</code></pre> in little endian (which is what the file uses).\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Some preliminary notes only – may evolve into a complete answer.\n\nMy approach was the following. Clearly, the numbers at the end are floating point numbers. Also, they are not all floating point; the sequence <pre><code>0C 00 00 00</code></pre> a few bytes in is not a reasonable floating point number. Counting off to the next \"unreasonable\" value (which happened to be <pre><code>0C 00 00 00</code></pre> again, but there are other values as well) told me the stride of this data was <pre><code>28</code></pre> bytes. (Which is 40 in decimal, but for documentation I strongly prefer hex.) If you have a capable hex viewer of which you can adjust the view width, you can see that this is correct if you set its view width to 40 characters.\nCounting back from the end in 40-byte steps gave me the most likely starting point of this sequence.\nThe digits right before it are clearly at least 2-byte (unsigned short), and sort of increase from the start to the end. As this is a 3D model, I had a strong hunch they form triangle data, so at least they should contain <pre><code>a</code></pre>, <pre><code>b</code></pre>, and <pre><code>c</code></pre> vertex indices, and possibly additional triangle attributes. This turned out, by trial and error, to be not the case. (The \"trial and error\" consisted of dumping them into a display program. As that worked straight away, further numerical investigations were unnecessary.)\nSince this information is (1) enough to display an object, and (2) covers all of the data in the file apart from the few bytes at the start – which can be anything – I went on writing a full display program.\n\nThe first <pre><code>004A</code></pre> bytes are unknown. They contain some floating point numbers (<pre><code>00 00 80 3F</code></pre> is <pre><code>1.0</code></pre>, as a little endian 4 byte floating point number), and they could be anything. (A scale is likely.)\nThe next 2 bytes form the number <pre><code>0016</code></pre>, which is in decimals <pre><code>22</code></pre>. This could be the internal 'object number'.\nThen, starting at <pre><code>004C</code></pre>, <pre><code>113h</code></pre> (313, in decimal) triangle definitions follow. A single triangle definition consists of 3 unsigned short indices <pre><code>a</code></pre>,<pre><code>b</code></pre>,<pre><code>c</code></pre>, which point to 3 coordinates. The largest index in this list is <pre><code>0117</code></pre>, a significant number!\nRight after this, <pre><code>0118</code></pre> 3D points follow. Each 3D point has the following structure:\n<pre><code>float x\nfloat y\nfloat z\nfloat unknown (usually 1.0?)\nunsigned int unknown\nfloat normal_x\nfloat normal_y\nfloat normal_z\nfloat u   \\\nfloat v   / correct; see bottom update\n</code></pre>\nAffirming that the 3 <pre><code>normal_*</code></pre> variables indeed form a normal can be done by adding their squares together; they should hover around a value of <pre><code>1.0</code></pre>. That is correct for the first hundred or so of these coordinates, up to 3 decimals of accuracy:\n<pre><code>1.000004\n1.000080\n0.999935\n1.000076\n0.999936\n(and so on)\n</code></pre>\nAdding up the sizes of all coordinate elements leads to a total size of <pre><code>28</code></pre> bytes (40, in decimal), and:\n\nthe remaining part of the file is a multiple of this;\ndividing the size of the remaining part by <pre><code>28</code></pre> results in <pre><code>118</code></pre> (280, in decimal).\n\nThe significance of the 'highest index' in the triangle list is therefore proven :) They are indeed coordinate indices.\nWhere do these numbers <pre><code>139h</code></pre> and <pre><code>118h</code></pre> come from? They appear in the header part of the entire file!\nHere is the proof that the first 3 elements are indeed x, y, and z. I plotted x and y only, with y inverted (negative towards the bottom of the screen). You can clearly recognize the 'body' part of your in-game image.\n\n\nNot all coordinates are quite the same. The <pre><code>unknown_1</code></pre> float value is <pre><code>1.000</code></pre> for the first 173 coordinates, then jumps to other values for the remainders. Similarly, the integer <pre><code>unknown_2</code></pre> hovers between values from <pre><code>4</code></pre> to <pre><code>43</code></pre> for these, and then jumps to a much higher value. This needs some further investigation.\n\nThe <pre><code>u</code></pre>,<pre><code>v</code></pre> values can be mapped onto the source image directly. They are expressed in a floating point range from <pre><code>0..1</code></pre> so you need to multiply them by the source image's width and height. Here is an image of that:\n\nThe unused parts of the image are presumably used by other 3D models.\n",
            "votes": "4",
            "user": "Jongware",
            "time": "Aug 23, 2016 at 22:42",
            "is_accepted": true,
            "comments": [
                {
                    "user": "majidarif",
                    "text": "<span class=\"comment-copy\">I'm starting to understand the format. Although, I'm confused about UV and mapping the texture. And also how to guess what part is the face indices if the \"scrambled alphabet\" isn't recognizable.</span>",
                    "time": null
                },
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">@majidarif: My idea about <code>u</code>,<code>v</code> was correct, see the update. I'm not sure what you mean with \"scrambled alphabet\" though. Are you referring to the original hex dump?</span>",
                    "time": null
                },
                {
                    "user": "majidarif",
                    "text": "<span class=\"comment-copy\">Thanks, I'll try the update about the <code>u</code>,<code>v</code> now. About the <code>scrambled alphabet</code>, I read somewhere that the easiest way to find the <code>face indices</code> is by finding a segment of <code>scrambled alphabets</code> as shown <a href=\"http://www11.pic-upload.de/img/27103613/hex2obj_tut.jpg\" rel=\"nofollow noreferrer\">here</a>. But I'm just thinking what if that's not the case? Is there a more concrete definition of the <code>face indices</code>? Like, maybe, values that are between 1-255 only?</span>",
                    "time": null
                },
                {
                    "user": "majidarif",
                    "text": "<span class=\"comment-copy\">When you say <code>u</code>,<code>v</code>, when using <code>.obj</code> is it the <code>vp</code>? I can't make it work on my end. This is how I did it: <code>\"vt %f %f\" % (u*width, v*height)</code>, I'm not sure if this is what you meant by multiplying by the source image dimensions.</span>",
                    "time": null
                },
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">@majidarif: multiplying is only necessary when your library does not already do it for you. Reading a few topics on <a href=\"https://blender.stackexchange.com\">Blender</a> seems to suggest it's not necessary, but of course you could ask on there and refer to this question.</span>",
                    "time": null
                }
            ]
        }
    ]
}