{
    "title": "How does one reverse engineer a SWF file?",
    "link": "https://reverseengineering.stackexchange.com/questions/133/how-does-one-reverse-engineer-a-swf-file",
    "content": "What tools and techniques exist to either decompile or analyze the bytecode in a SWF file?  What resources are available to the reverse engineer to learn more about SWF internals?\n",
    "votes": "38",
    "answers": 9,
    "views": "61k",
    "tags": [
        "swf",
        "actionscript"
    ],
    "user": "user1354557",
    "time": "Mar 21, 2013 at 22:09",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Which version of ActionScript? There are two completely different virtual machines in existence for AS. You should specify. For starters I recommend reading the standard, it really helps but it might cause hair pulling and other odd reflexes, too.\n",
            "time": null
        },
        {
            "user": "user1636717",
            "text": "Interesting question. Could anybody provide an overview of the information available on the topic of Flash RE? Papers and such would be much appreciated.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There is good tool flasm, which is open-source, and contain both flash assembler and disassembler. And flare, which is free, but closed-source, and contain flash decompiler. Looks like both are abandoned (last update from 2007), and have no support for ActionScript 3, but, maybe someone could extend them.\n",
            "votes": "13",
            "user": "Anton Kochkov",
            "time": "Mar 22, 2013 at 7:37",
            "is_accepted": false,
            "comments": [
                {
                    "user": "MrSynAckSter",
                    "text": "<span class=\"comment-copy\">Just as un update, the current version of Flare for Mac is only for PowerPC.</span>",
                    "time": null
                },
                {
                    "user": "Luc",
                    "text": "<span class=\"comment-copy\"><code>apt-get install flasm</code> works and the program is easy to use. Would recommend.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "First I would recommend reading through the specifications of the SWF file format and ActionScript. I wouldn't recommend reading it all (it does get boring). Just the first three or four chapters. This will help with having a foundation of knowledge for the structure and keywords. Here are the two I would recommend.  \nSWF File Format PDF, ActionScript Virtual Machine 2 (AVM2) Overview PDF\nOnce you have a basis of knowledge check out some posts on Flash Exploits. Here is a list of posts in no particular order or value 1, 2, 3, 4, 5, 6, 7. Searching the RE Reddit is also another good resource for SWF/Flash analysis. \nFor better or for worse a lot of great work has been done by the exploit community for reverse engineering SWF/ActionScript/Flash/etc. There a number of researchers I would recommend google stalking their work. Haifei Li is one notable individual. A quick google search for filetype:PDF + \"Haifei Li\" will bring up a lot of great resources. Example: link. \nIF you are sick of reading I'd recommend downloading some samples. Contagiodump is a good place to grab samples. Typically the sample have the proper CVE number. This can be helpful because a quick google of CVE-number + \"analysis\" will allow you to do the at home follow along version. Of course you will need tools. I personally would recommend REMnux by Lenny Zeltser. Almost all the tools listed in this thread are already installed in it. If you are working with SWFs embedded in documents I'd recommend xxxswf.py for extracting them. The source code isn't that badly commented so it will give you some basics about the file structure. Disclaimer: my tool. \nA couple of tools that aren't listed that I'd recommend is Flash Decompiler by Trillix and Yogoda. Both of these tools are for Windows.\n",
            "votes": "11",
            "user": "alexanderh",
            "time": "May 9, 2013 at 18:11",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Used SWFWire Debugger once to extract an AES key from a flash game. It can trace functions and their parameters while executing. I find it extremely helpful.\n",
            "votes": "8",
            "user": "samuirai",
            "time": "Mar 22, 2013 at 1:00",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Lizz",
                    "text": "<span class=\"comment-copy\">Its website mentions Adobe Flash player is required. This tells me the app actually renders/plays the flash, which could be dangerous. Do you know if it renders the SWF?</span>",
                    "time": null
                },
                {
                    "user": "samuirai",
                    "text": "<span class=\"comment-copy\">Yes it does. It's a debugger not a static analysis tool, therefore it will run the SWF. But it's really nice for dynamic analysis.</span>",
                    "time": null
                },
                {
                    "user": "BlueRaja - Danny Pflughoeft",
                    "text": "<span class=\"comment-copy\">@Lizz On that same website, SWFWire provides <a href=\"http://www.swfwire.com/decompiler\" rel=\"nofollow noreferrer\">a static-analysis decompiler</a> as well.  I've used it with great success to decompile SWF's before.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Check out Sebastian Porst's work [1] (see in particular the /slides directory for an overview, and then the rest of the code can be found from the root).\n[1] https://github.com/sporst/SWFREtools\n",
            "votes": "6",
            "user": "Rolf Rolles",
            "time": "Mar 21, 2013 at 22:53",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "There is an IDA Pro plugin that allows you to disassemble SWF files just like any other executable.\n",
            "votes": "3",
            "user": "Martin",
            "time": "May 9, 2013 at 13:46",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "There already exist many tools to do this just do a quick google search.\nAn example would be asdec\nAlso here is a releated question \"does-an-actionscript-decompiler-get-actionscript-from-dynamically-linked-as-file\"\nAlso Gnash and Lightspark are open source implementations of flash that should be interesting.\n",
            "votes": "2",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I have used SWFTools (http://www.swftools.org) package in the past for swf files analysis.\nThe swfextract tool in that package allows you to extract all kinds of artifacts from a swf file.\nThe swfdump tool in the same package can disassemble all versions of ActionScript (v1-3). The nice thing about swfdump is that it will show the output in human-readable p-code format which helps very much with analysis.\nAlso, there are commercial decompilers such as Sothink SWF Decompiler and Flash Decompiler Trillix. I don't have any experience using them and can't recommend as to how well they work.\n",
            "votes": "2",
            "user": "rev",
            "time": "Mar 24, 2013 at 12:21",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "If you care mostly about the raw code, I can recommend you RABCDAsm\nhttps://github.com/CyberShadow/RABCDAsm\nThis will generate very workable Actionscript bytecode and also allows you to patch it back.\n",
            "votes": "2",
            "user": "Carraway",
            "time": "Oct 30, 2016 at 23:18",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I really like the Sothink's Flash Decompiler. Although it's commercial it's really worth it if you occasionally reverse engineer flash files.\nThe full version (which I own and use) can decompile whole SWF files back to FLA, supports latest versions of AS (when other free tools were not), lets you modify and run SWF files as well as create a modified SWF version, allows editing all resource types (not just code), and has a full-blown feature-rich GUI.\n",
            "votes": "1",
            "user": "NirIzr",
            "time": "Oct 29, 2016 at 22:14",
            "is_accepted": false,
            "comments": []
        }
    ]
}