{
    "title": "Where can I, as an individual, find clean programs to analyze?",
    "link": "https://reverseengineering.stackexchange.com/questions/13522/where-can-i-as-an-individual-find-clean-programs-to-analyze",
    "content": "This question includes a good list of sources where an individual might collect malware samples for analysis.\nI'd like to get a large number of public, non-malicious programs for the purpose of comparing various attributes to malware samples. \nI have explored the following options:\n\nScraping executables from arbitrary websites with a bot. Such a bot would be rather difficult to write, not to mention being unethical, and requiring strategies to deal with anti-bot measures such as CloudFlare.\nUsing C:\\Windows as a source. I spent some time looking at some Windows files. They were abundant, but all seem to perform extremely specialized functions and I have doubts about how well they would represent legitimate programs in the real world\nFinding and downloading programs manually. This would be extremely slow and tedious, and also ineffective to get large numbers of such programs.\n\nI suppose what would be ideal for my situation is a sort of program dump, but I'm not aware of any that exist.\nAs someone unaffiliated with any organisation, is there an effective way of getting a large number of public normal programs for the purpose of comparing their features to a set of malicious programs?\n",
    "votes": "5",
    "answers": 1,
    "views": "229",
    "tags": [
        "windows",
        "malware"
    ],
    "user": "konsolas",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [
        {
            "user": "NirIzr",
            "text": "Possible duplicate of Where can I find benign samples with a high potential to false positive?\n",
            "time": null
        },
        {
            "user": "w s",
            "text": "If you are not limited by using Windows as a base OS, you have a lot of pre-compiled programs in Ubuntu and other Linux related repositories, for example here: packages.ubuntu.com.\n",
            "time": null
        },
        {
            "user": "Nordwald",
            "text": "Possible duplicate of reverseengineering.stackexchange.com/questions/12261/…\n",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "@Nordwald it's also a duplicate of a question that wasn't closed as off-topic, with more helpful answers. see my comment.\n",
            "time": null
        },
        {
            "user": "Nordwald",
            "text": "@Nirlzr Regardless, the closed topic may be more strongly related. The reasoning behind this decision may apply here as well.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "For Windows, I would suggest shareware aggregators, for example\n\nhttp://download.cnet.com/windows/ \nhttp://www.tucows.com/windows\nhttp://padsites.org/\n\nand/or archive sites:\n\nhttp://cd.textfiles.com/ \nhttp://www.oldversion.com/\n",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "Sep 20, 2016 at 15:25",
            "is_accepted": false,
            "comments": []
        }
    ]
}