{
    "title": "Reverse Engineering an APP With Frida [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/13625/reverse-engineering-an-app-with-frida",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI am trying to reverse engineer an app but I am having problems unlike the previous apps that I reverse engineered.....\nWhen Untouched the app let's you login perfectly but when I reverse engineer it and repackage it( Without changing anything) I am getting a \"Network Error\"\nI also tried using Frida and I am experiencing the same problem... does anyone know why this is happenning?\n",
    "votes": "-1",
    "answers": 1,
    "views": "578",
    "tags": [
        "android",
        "apk"
    ],
    "user": "user2437609",
    "time": "8 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "There could be multiple reasons for such a behavior to occur. Without more thorough investigation on your end and a more detailed description it's impossible to provide a good answer. Please take the Tour to learn how good questions are structured.\nHowever, what you're experiencing could be some kind of anti-patching protection, and the network related error suggested it might be related to some kind of server side verification.\nSome ideas I can come up with:\n\nAn internal CRC or other code integrity blob (such as a cryptographic hash) is being sent to the server for validation.\nA code integrity check is being performed and validated locally, only reporting the validation failure to the server or falsely reporting there's a network issue.\nYour repackaging does change the application is some less obvious way which damages the application's ability to communicate with the server.\nThere's actually a network error, either due to your repackaging or for any other reason.\n",
            "votes": "2",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}