{
    "title": "crash using ida 6.8 debugging on android 5.0",
    "link": "https://reverseengineering.stackexchange.com/questions/13687/crash-using-ida-6-8-debugging-on-android-5-0",
    "content": "I need to debug .so of my.apk, I'm working on a phone with android 5.0, using ida 6.8's android_server. It seems ok for attaching ida to the process, but when clicking something on the apk there is message box that shows an exception(see the image), and breaks at this line:\n<pre><code>system@framework@boot.oat:7314709E DCB    8\n</code></pre>\nAnd the 'call stack' window is empty.\n\nThe problem happens with android 5.x + ida 6.8,  or android 7.0 + ida 6.8\nbut it works fine on android 4.x + ida 6.5\nBut I tried another apk, there is no such problem.\nAny idea? \nUpdate 1\nAccording to comments from @ws, it's something wrong with segment type: ARM(0) and THUMB(1), here's what I tried:\n\nPress Alt+G at that line, a window popups and shows the segment register value is 1, I modified it to 0, run.\nThen it breaks at another place with same exception. I did that again.\nThen it goes to boot.oat, but this time is different. Even after modified it to 0(ARM), it breaks at this line about 6~7 times\n\nAnd finally it breaks at some random code with same exception, such as memset in the image below. Then program crashes if continue run.\n",
    "votes": "2",
    "answers": 0,
    "views": "951",
    "tags": [
        "ida",
        "android"
    ],
    "user": "aj3423",
    "time": "Oct 10, 2016 at 14:02",
    "comments": [
        {
            "user": "w s",
            "text": "Is your target little or big endian ?\n",
            "time": null
        },
        {
            "user": "aj3423",
            "text": "@ws  It's little endian, the variables in hexdump are in reverse order. For example integer 1 looks like \"01 00 00 00\"\n",
            "time": null
        },
        {
            "user": "w s",
            "text": "Did you try to change this code from THUMB to ARM (now it shows \"CODE16\" mark which is probably used by debugger) ? All other threads staring from address aligned by 4, and the problematic thread start address is aligned by 2, which is strange.\n",
            "time": null
        },
        {
            "user": "aj3423",
            "text": "@ws It seems exactly the problem, but I still cannot make it work, I've updated the post, please refer to the UPDATE section.\n",
            "time": null
        },
        {
            "user": "w s",
            "text": "I'd try to review all CODE16 and CODE32 marks. As far as I know IDA sets it automatically after auto-analysis and, unfortunately, sometimes misses. In addition I'd compare such marks from ida 6.5 with the ida 6.8.\n",
            "time": null
        }
    ],
    "answers_data": []
}