{
    "title": "ARM assembly: Strange instruction pattern (endless loop?)",
    "link": "https://reverseengineering.stackexchange.com/questions/13718/arm-assembly-strange-instruction-pattern-endless-loop",
    "content": "I noticed a strange instruction pattern. First the value of PC is moved into LR and then a register value is moved into PC.\nHere some examples:\n<pre><code>.text:00001488                 MOV             LR, PC\n.text:0000148C                 MOV             PC, R2\n ...\n.text:000304E8                 MOVNE           LR, PC\n.text:000304EC                 MOVNE           PC, R3\n</code></pre>\nIf this pattern corresponds to a call instruction, wouldn't this result in an endless loop? If this does not correspond to a call, what is this ?\n",
    "votes": "2",
    "answers": 2,
    "views": "1k",
    "tags": [
        "disassembly",
        "assembly",
        "arm"
    ],
    "user": "langlauf.io",
    "time": "Oct 14, 2016 at 10:50",
    "comments": [],
    "answers_data": [
        {
            "content": "I'm not pretty sure if it is a call pattern, but this code is OK because of pipeline and will not create the endless loop. As people quoting here from here\n\non page A2-11 (Section A2.3) of the manual (ARM Architecture Reference\n  Manual ARMv7-A and ARMv7-R edition) it's been said that:\nPC, the program counter\n\nWhen executing an ARM instruction, PC reads as the address of the current instruction plus 8.\nWhen executing a Thumb instruction, PC reads as the address of the current instruction plus 4.\nWriting an address to PC causes a branch to that address.\n\nMost Thumb instructions cannot access PC. The ARM instruction set\n  provides more general access to the PC, and many ARM instructions can\n  use the PC as a general-purpose register. However, ARM deprecates the\n  use of PC for any purpose other than as the program counter. See\n  Writing to the PC on page A2-46 for more information. Software can\n  refer to PC as R15\n",
            "votes": "3",
            "user": "w s",
            "time": "Oct 14, 2016 at 11:37",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "This was actually the correct way to perform indirect calls in ARM before the introduction of the <pre><code>BLX</code></pre> instruction (ARMv5 IIRC). ARM(32-bit version) is special in that the value of PC is pointing two instructions ahead when you read it (so +8 in ARM mode and +4 in Thumb mode). So, taking your example:\n<pre><code>.text:00001488                 MOV             LR, PC\n</code></pre>\nhere, the <pre><code>PC</code></pre> value will be 1488+8 = 1490, so <pre><code>LR=0x1490</code></pre>\n<pre><code>.text:0000148C                 MOV             PC, R2\n</code></pre>\nhere, the <pre><code>PC</code></pre> will be set to the value in <pre><code>R2</code></pre> and the processor will start fetching instructions from that address. Most likely it will be a function which ends with a return instruction - <pre><code>MOV PC, LR</code></pre> (IDA shows it as <pre><code>RET</code></pre>), so the execution will resume at the value of <pre><code>LR</code></pre>（0x1490) which happens to be just after the original <pre><code>MOV PC, R2</code></pre> instruction (0148C+4=0x1490), so in effect that sequence of instruction is equivalent to <pre><code>BLX R2</code></pre> in the newer processors.\n",
            "votes": "4",
            "user": "Igor Skochinsky",
            "time": "Oct 14, 2016 at 17:58",
            "is_accepted": false,
            "comments": []
        }
    ]
}