{
    "title": "Advice on creating a reverse engineering introduction course? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/13782/advice-on-creating-a-reverse-engineering-introduction-course",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm organizing an introduction to reverse engineering weekend class in my city and wanted to get some feedback and advice on how to structure it. I'm considering two 5 hour sessions.\nThe objective is for the students to be able to use linux tools and and reverse engineering tools (specifically radare2/GDB) to start doing CTFs and crackmes to practice. The target audience is software engineers, developers and students. Having said that and after a few conversations with potential participants, quality here is mediocre at best so I rather prepare for the worse and assume some participants won't even know the behind the scenes of a compilation process.\nWhat I have so far is the following:\n\nLinux usage\nMemory map\nBinary sections\nPassing function arguments\nRadare installation\nQuick intro to x86 assembler\nGdb\nStacks - return address\nstack canaries\nBuffer overflows\nShellcode\nNop slides\nCTF’s challenges\n",
    "votes": "0",
    "answers": 1,
    "views": "127",
    "tags": [
        "x86",
        "tools"
    ],
    "user": "user3577138",
    "time": "8 years ago",
    "comments": [
        {
            "user": "NirIzr",
            "text": "I'm voting to close this question as off-topic because this type of questions does not quite fit into the stack exchange model. It is better to use other means to find relevant and up-to-date references instead.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "This type of questions does not quite fit into the stack exchange model. It is better to google for relevant and up-to-date references instead.\nYou can find an old similar question here, and you can see the reasoning behind closing such questions here.\nI advise against writing/planning something for yourself, as a lot of time and effort was put by others and there are plenty of existing reverse engineering introduction materials. \nHere's a short list of tutorial repositories and collections, that seemed constantly maintained for a period of time and relevant at the time of writing (October 2016).\nOver 150 modules/articles (some include exercises) by the InfoSec Institute.\nA two day class created by Matt Briggs\nVideo presentations and exercises by Symantec\n",
            "votes": "2",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}