{
    "title": "Extract an image out of a application and customize after edited",
    "link": "https://reverseengineering.stackexchange.com/questions/13916/extract-an-image-out-of-a-application-and-customize-after-edited",
    "content": "I was wondering if you guys could help me.I have an application for OSX it is called Traktor..I want to extract an image of a vinyl and edit it than reassign it back to the application...\n\nI want to add a customized image of a vinyl with my name on it..like this example\n\nCan anyone help me how to accomplish this on mac? I can do it on windows machine but not on OSX..\nthank you very much\n",
    "votes": "1",
    "answers": 1,
    "views": "142",
    "tags": [
        "tools",
        "osx"
    ],
    "user": "Eduardo Tavares",
    "time": "Nov 13, 2016 at 19:25",
    "comments": [
        {
            "user": "Jongware",
            "text": "How do you do this on Windows (although there can't be a generalized method that works for every type of file), and why can't you do the same on a Mac app?\n",
            "time": null
        },
        {
            "user": "Eduardo Tavares",
            "text": "there are softwares that you can open your exe file and it shows you every resource in that file.You simply extract(there is function to do this) you open it on photoshop so you can have the exactly size of the image then you re-assign the image back to the exe using the same program you used... I can't use this program on mac because it is for windows and not OSX...\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "@EduardoTavares please don't post comment as answers. Wait until you get some reputation and can comment.\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "@RadLexus: no, it's the same account; he posted an \"answer\" which I converted to a comment.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Many images in OS X applications live in the bundle.  Meaning they are linked with the application, but not compiled into the binary.  One exception to this would be if the application is using an asset catalog which compiles images into a binary format for quick lookup at runtime.\nTake a look at Calculator.app that ships with OS X.  In the application bundle, you will see a Resources directory (full path: <pre><code>Calculator.app/Contents/Resources</code></pre>).  This is where all of the images are stored in the application.  In the case of Calculator.app, there are a bunch of tiff images which represent the keys:\n\nI'd experiment with replacing or modifying images in the Resources folder of the application.\n",
            "votes": "1",
            "user": "JAL",
            "time": "Nov 22, 2016 at 5:59",
            "is_accepted": false,
            "comments": []
        }
    ]
}