{
    "title": "Can a RTMPS stream be authenticated by a cookie?",
    "link": "https://reverseengineering.stackexchange.com/questions/14004/can-a-rtmps-stream-be-authenticated-by-a-cookie",
    "content": "After performing an mitm attack I discovered that the Nest mobile application appears to use a cookie as authentication to access data. It receives a response that gives an RTMPS address, but it seems to need an authentication of sorts to access as currently when trying to access it connects but transmits no data via RTMPdump. Can an RTMP stream use a cookie as Authentication, if so how would I send that via RTMPdump?\n*Tags are inaccurate because I don't have required reputation to create appropriate tags\n",
    "votes": "1",
    "answers": 1,
    "views": "461",
    "tags": [
        "ios",
        "command-line"
    ],
    "user": "AppleTechy",
    "time": "Nov 21, 2016 at 1:09",
    "comments": [],
    "answers_data": [
        {
            "content": "Possibly, but it's unlikely that secure information like the RTMP auth key is stored in an insecure cookie.\nWhat is most likely happening is that Nest has a REST API used for authentication.  After signing in with your username and password, you get a token back (OAuth2).  Some combination of your username and the token is probably used as the RTMP key, unless the server is employing an additional level of security, in which there is probably another endpoint used to generate specific keys for each RTMP stream you have permissions to access to.\nI would analyze the RTMP request leaving the application, checking for any auth information in headers or URL query strings.\nI encourage you to read through Adobe's RTMP spec for further information.\nSources: The spec linked to above and I have written an entire application (server side and iOS frontend) that centers around RTMP video encoding, ingestion, and playback.\n",
            "votes": "1",
            "user": "JAL",
            "time": "Nov 22, 2016 at 5:26",
            "is_accepted": false,
            "comments": [
                {
                    "user": "AppleTechy",
                    "text": "<span class=\"comment-copy\">Well I see an access token that renews everything month and a session token that renews every session. How would I test which token to use? I have been using rtmpdump but I don't know how I would input the token correctly. I got a wireshark pcap of the stream but I think its encrypted but how would I decrypt it? I have a decrypted version of the Nest mobile app, and the requests sent from the the mobile app in decrypted if that helps at all...? I really appreciate your help!!</span>",
                    "time": null
                }
            ]
        }
    ]
}