{
    "title": "Symbols visible in EXE file without PDB",
    "link": "https://reverseengineering.stackexchange.com/questions/14122/symbols-visible-in-exe-file-without-pdb",
    "content": "I imported my exe file in OllyDB and when I searched for the names(labels) present, I was able to see all the function declarations, class names etc. I didn't have my PDB in the EXE path. Why does this occur? Should I enable some obfuscation settings during my build?\n",
    "votes": "3",
    "answers": 1,
    "views": "570",
    "tags": [
        "symbols",
        "debugging-symbols",
        "pdb"
    ],
    "user": "Kaushik Ramachandran",
    "time": "Dec 8, 2016 at 20:22",
    "comments": [
        {
            "user": "Nordwald",
            "text": "Was the .pdb in the search path?\n",
            "time": null
        },
        {
            "user": "Kaushik Ramachandran",
            "text": "No, the PDB was not in the search path.\n",
            "time": null
        },
        {
            "user": "w s",
            "text": "Are you using RTTI ?\n",
            "time": null
        },
        {
            "user": "Kaushik Ramachandran",
            "text": "Yes,  I have used dynamic_cast<> in my code. But is that an issue?\n",
            "time": null
        },
        {
            "user": "w s",
            "text": "Yes, it is probably the issue and definitely should be at least part of it. Would you post some examples of suspicious strings that you see in the code ?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<pre><code>dynamic_cast</code></pre> requires a runtime check that the cast is valid at execution time and the usual implementation uses RTTI (Run-time type information) attached to all classes participating in the casts. However, since it's not easy to narrow down the classes that may be possibly casted, in practice the compiler emits RTTI for all polymorphic classes (i.e. those that have virtual methods). While the RTTI details are not specified by the C++ standard, the Visual C++ implementation retains full class names. You can find more details in my article on the topic.\n",
            "votes": "5",
            "user": "Igor Skochinsky",
            "time": "Dec 8, 2016 at 20:21",
            "is_accepted": false,
            "comments": []
        }
    ]
}