{
    "title": "IDA Dalvik Debugger doesn't work with official Android emulator",
    "link": "https://reverseengineering.stackexchange.com/questions/14139/ida-dalvik-debugger-doesnt-work-with-official-android-emulator",
    "content": "I try to use IDA to debug application with official Android ARM emulator. I set up debugger, installed APK and run application, it starts, writes \"waiting for debugger\", and debugger writes that \"connection has been gracefully closed\", and I see following message in IDA log: <pre><code>ADB error: listener 'tcp:23915' not found</code></pre>\nThe application is for sure debuggable; I have sources and debug the same APK with Android Studio. I can also debug C++ code with IDA remove ARM on the same emulator and the same APK.\nSo why does Dalvik debugger not work?\n",
    "votes": "1",
    "answers": 2,
    "views": "2k",
    "tags": [
        "ida",
        "android",
        "dalvik"
    ],
    "user": "Vitalii",
    "time": "Dec 9, 2016 at 14:55",
    "comments": [
        {
            "user": "DevZer0",
            "text": "i have done some smali but never attempted debugging with IDA, however i ran into this article, maybe you have seen it already finn.svbtle.com/remotely-debugging-android-binaries-in-ida-pro\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I found solution myself. The thing is easy. It is one more Android Studio bug. I found that when IDA tries to connect to Dalvik debugger, I see following message in log:\n<pre><code>Ignoring second debugger -- accepting and dropping</code></pre>\nIn not doubts no second debugger existed. Next, I found that this AVD doesn't work even with Android Studio and gives the same error.\nI found that other people have similar issue: https://stackoverflow.com/questions/3735450/ignoring-second-debugger-and-service-hang-in-android\nThe problem disappeared when I rebooted Windows.\n",
            "votes": "1",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "maybe this helps:\nhttps://github.com/strazzere/android-scripts/blob/master/shell/ida_android\nAnother possibility could be, that you have serveral adb installations in your system and the ida debugger is using a different one.\n",
            "votes": "0",
            "user": "bujindo",
            "time": "Dec 9, 2016 at 16:36",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Vitalii",
                    "text": "<span class=\"comment-copy\"><code>android_server</code> is about binary native code debugging and not Dalvik.</span>",
                    "time": null
                }
            ]
        }
    ]
}