{
    "title": "OllyDbg: How to set a conditional breakpoint for a value anywhere in the stack?",
    "link": "https://reverseengineering.stackexchange.com/questions/14187/ollydbg-how-to-set-a-conditional-breakpoint-for-a-value-anywhere-in-the-stack",
    "content": "I know how to set conditional breakpoints on a register, but how can I have a breakpoint trigger if a specific value (say, 0x12345678) appears anywhere in the active call stack frame?\n",
    "votes": "7",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ollydbg",
        "debugging",
        "breakpoint"
    ],
    "user": "John Blatz",
    "time": "Dec 18, 2016 at 20:26",
    "comments": [
        {
            "user": "mrexodia",
            "text": "In x64dbg you could do this by setting a watch on every stack address, probably you could write a plugin that scans a stack page on every step but it's going to involve checking a lots of addresses, slowing everything down massively.\n",
            "time": null
        },
        {
            "user": "John Blatz",
            "text": "@mrexodia Thanks, I will give x64dbg a try. Actually, I'm only interested in the active call stack frame. I have edited my question accordingly. I suppose that makes it somewhat easier?\n",
            "time": null
        },
        {
            "user": "mrexodia",
            "text": "It would definitely be possible to write a plugin that scans the stack on every pause event with x64dbg. Plugin templates are available if you're interested.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Not for Ollydbg, but I wrote a plugin called StackContains for x64dbg that allows you to check if a value is present in the check during conditional tracing. This allows you to break as soon as the value becomes visible on the stack.\nYou use it like this:\n\nThis will break as soon as the value <pre><code>00E60000</code></pre> appears on the stack:\n\nIt should be easy enough to extend this plugin and tailor it to your needs...\n",
            "votes": "5",
            "user": "mrexodia",
            "time": "Dec 19, 2016 at 19:24",
            "is_accepted": false,
            "comments": [
                {
                    "user": "John Blatz",
                    "text": "<span class=\"comment-copy\">That looks awesome, thanks for taking the time to write this plugin! If I can't get what I want in OllyDbg, I'll definitely try it. But the only problem is that I am not a C++ developer. I assume Visual Studio is needed to build the plugin? Or is there a compiled binary available?</span>",
                    "time": null
                },
                {
                    "user": "mrexodia",
                    "text": "<span class=\"comment-copy\">I made binaries available <a href=\"https://github.com/mrexodia/StackContains/releases\" rel=\"nofollow noreferrer\">github.com/mrexodia/StackContains/releases</a></span>",
                    "time": null
                },
                {
                    "user": "John Blatz",
                    "text": "<span class=\"comment-copy\">Awesome, thank you so much.</span>",
                    "time": null
                }
            ]
        }
    ]
}