{
    "title": "Write own obfuscator in Python [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/14246/write-own-obfuscator-in-python",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI want to create my own, static obfuscator for any executables. What is the best way to do it with python? How should I start or what sources should I learn to do it? Anyon can give me some tips or links connected with this topic?\n",
    "votes": "0",
    "answers": 1,
    "views": "1k",
    "tags": [
        "python"
    ],
    "user": "Developus",
    "time": "8 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "You should start with reading documents.\nYour problem definition is too broad to be covered by reading sources of already existing solutions. \n\nYou need to learn the executable formats you are intending to work with, \"any executable\" is too broad (ELF, PE, jar, whatever else ?)\nYou need to learn the platform architecture (is it ARM, MIPS, x64 ?)\nAfter that you need to define the list of obfuscating transformations you want to apply to the executable of type of your choice .\nAll the rest depends very much on the list of the transformations and information you'll have to apply these transformations.\n\nHere is the reading list (unfortunately, it is far from being covering the whole problem) \n\nTaxonomy of obfuscating transformations - classic work by Collberg and others \nStudies in program obfuscation - if you want to have some theoretical background on math around the obfuscation\nPE format - go by links from wiki, there are a lot\nELF format - the same if you want to obfuscate elf executables\nIntel SDM - the best and definitive definition of Intel processors assembly language, replace it with similar document about your platform if you choose to obfuscate non-intel binaries\ntuts2you downloads section related to obfuscation - some articles inside\nIn addition I'd recommend you to follow @Rolf Rolles, he wrote some excellent articles on deobfuscation, such as this or this.\n\nAfter reading this you'll be able to search for more fine-grained information.\nThe most approachable methodology to deal with the issue is using LLVM.\nLLVM has python bindings that probably can be used for this.\nThere are some works related to obfuscation with this methodology, but none of them has complete solution in python, for example\n\nExample of simple obfuscator with LLVM\nYou'll probably find something interesting here, more invested LLVM based obfuscator\nBy the way, here is work on deobfuscating results of one of version of obfuscator mentioned before\nMcSema - a framework for transforming executable to LLVM IR. - you'll need it to read the executable and transform it into the form related to LLVM.\n\nYour question is actually huge, and I'm far from covering the topic.\nHowever this topic is very interesting, and I wish you good luck with that :)\nUPDATE: \nAs it appears from comments the topic starter wants to write as a starter something similar to UPX, which looks much simpler.\nHere is a list of links that may be helpful for that:\n\nUPX source code - it is not python, but good for reference\npefile is a multi-platform Python module to parse and work with Portable Executable (aka PE) files.\n\nI'd suggest to learn PE format first, and read the code of UPX.\n",
            "votes": "2",
            "user": "w s",
            "time": "Dec 26, 2016 at 11:39",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Developus",
                    "text": "<span class=\"comment-copy\">Thanks so much. I know that question is too broad. I want to create an obfuscator for PE files first. Platform architecure is x64. So at the beginning I should understand the form I want to obfuscate and then go deepper? I'm interesting in RE, but in practical side I decided to create something like UPX packer.</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">You need to understand the form (PE) - or you'll not be able to create a valid executable, the platform (x64) - or you'll not be able to add something meaningful to the executable, and you need to choose specific obfuscating transformations set to apply. UPX, by the way, is not obfuscator, but packer: it scrambles and archives IAT and the original code and AFIK unpacks it prior to the execution.</span>",
                    "time": null
                },
                {
                    "user": "Developus",
                    "text": "<span class=\"comment-copy\">So maybe at the begining, write own packer instead of obfuscator would be simpler? I should try same way - learn PE format and go step by step through your list?</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">I'll update the answer</span>",
                    "time": null
                }
            ]
        }
    ]
}