{
    "title": "How decompilation works? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/14320/how-decompilation-works",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nwhat is the theory behind the subject of translate assembly code to pseudo code?\nCould you explain few words ? Also some book about it?\n",
    "votes": "-2",
    "answers": 1,
    "views": "638",
    "tags": [
        "disassembly",
        "x86",
        "decompilation",
        "c++"
    ],
    "user": "lemanb84",
    "time": "8 years ago",
    "comments": [
        {
            "user": "Jongware",
            "text": "The theory is that pseudocode is easier to understand than assembly. (A necessary assumption, then, is that \"all assembly can be converted to equivalent-or-easier pseudocode\".) That's not what your title asks about, though.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "A thorough but dated theoretical treatment of decompilation can be found in Cristina Cifuentes' 1994 PhD thesis \"Reverse Compilation Techniques\". The subject matter therein, which includes discussion of syntax analysis, semantic analysis, control flow analysis, data flow analysis, and code generation, will be difficult to understand without being familiar with compiler or programming language theory beforehand, as decompilation is the reverse process of compilation. \nA shorter treatment of decompilation by the same author is given in a paper called \"Decompilation of Binary Programs\".\nIf you are looking for something more contemporary you may wish to investigate techniques employed by CMU's Phoenix decompiler as well as the answers to this question.\n",
            "votes": "5",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": []
        }
    ]
}