{
    "title": "Is reverse engineering possible for old windows kernels? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/14380/is-reverse-engineering-possible-for-old-windows-kernels",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm interesteing, why someone not reverse engineer old windows 3.1?\nIn theory, win 3.1 have no kernel(because kernel is dos), it's simply window manager(such as x window on unix), so why i can't reverse engineer it's and modify?\n",
    "votes": "0",
    "answers": 2,
    "views": "1k",
    "tags": [
        "windows",
        "kernel"
    ],
    "user": null,
    "time": "8 years ago",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "I think this question will be closed because it's asking  for an opinion. If you have something specific to ask about Windows 3.1 RE, make a new one.\n",
            "time": null
        },
        {
            "user": "Spektre",
            "text": "If my memory serves well Microsoft published sources for Windows (not sure which version I think it was XP)  quite a while ago and send them to selected Universities in Europe... it was ~20 CDs of code and win 3.1 files where part of it (#included in it). May be it would be better to find that instead of reversing ...\n",
            "time": null
        },
        {
            "user": "Spektre",
            "text": "From a quick search I found this joke Michael Sync: WINDOW XP SOURCE CODE so my memory did not played any tricks on me... so just find the real download links possibly in some msdn archive\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Someone should have reversed win3.1 when they needed it... they are probably retired now.\nOthers reimplemented Win3.1 API (Win16) in the WINE project using published API references rather than reverse engineering it (to avoid legal issues).\nEarly DOS source code is released a while ago.\nYou can reverse anything you want. You may however not be able to release any of your findings.\n",
            "votes": "0",
            "user": "user18772",
            "time": "Jan 13, 2017 at 22:36",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user18759",
                    "text": "<span class=\"comment-copy\">thanks, is really some old api's from win3.1 still in 10 for compatibility(and win10 can't run 16bit apps, so no need for this old api's)?</span>",
                    "time": null
                },
                {
                    "user": "Sigtran",
                    "text": "<span class=\"comment-copy\">No, but there must be some old systems that are still around that use that API, potentially even win3.1 may still be in use on some old ATMs or automation systems.</span>",
                    "time": null
                },
                {
                    "user": "marshal craft",
                    "text": "<span class=\"comment-copy\">Why can you not release any findings? If the company hasn't patented it or copy righted it and you aren't under NDA I don't see why you can't tell everyone? Seems like part of a trade secret is the trade off that if someone does truely reverse engineer that secret it's gone. Where patent/copyright you tell everyone at the expense that they have to pay to use it.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "There is a really good book which does exactly that:\n\"Windows Internals: The Implementation of the Windows Operating Environment\" by Matt Pietrek.\nIt's full of disassembly listings from the Windows 3.x kernel and other parts.\n",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Jan 12, 2017 at 20:42",
            "is_accepted": false,
            "comments": []
        }
    ]
}