{
    "title": "How come such large a data region has got the same address in IDA?",
    "link": "https://reverseengineering.stackexchange.com/questions/14399/how-come-such-large-a-data-region-has-got-the-same-address-in-ida",
    "content": "There is a large continuous, memory region as shown above in IDA disassembly which has got the same address for every possible address. Is the disassembly incorrect? How do I interpret one single row?\n<pre><code>DCB \"0000000000000000 l    df *ABS*\",9,\"0000000000000000 gic.c\",0xA</code></pre>\nThe row above doesn't seem to be continuous data even. How are the columns  (space/tab and comma separated) significant? I can locate the following column values:\n\nDCB\n0000000000000000\n1\ndf\n*ABS*\n9\n0000000000000000\ngic.c\n0xA\n",
    "votes": "0",
    "answers": 2,
    "views": "227",
    "tags": [
        "ida",
        "disassembly"
    ],
    "user": "sherlock",
    "time": "Jan 13, 2017 at 17:03",
    "comments": [],
    "answers_data": [
        {
            "content": "It's just a single (very long) text string. Look at the <pre><code>dcb</code></pre> and double quotes; unprintable characters are included outside the double quotes, in hex.\nPresumably there is a zero-terminator at the very end, which is how IDA Pro identified it as a string: all it contains are printable characters, plus the characters Tab and LF.\nIt's broken up at the linefeeds so it is slightly better readable, but that's for display only. If you press the <pre><code>*</code></pre> \"Define array\" key somewhere inside this, you will see it's indeed a single long array of bytes.\nThe starting address is only repeated for your convenience. \"The\" address of a larger structure is in general the address of its first byte.\n",
            "votes": "2",
            "user": "Jongware",
            "time": "Jan 13, 2017 at 22:10",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "This is a structure recognized automatically by IDA.\nStructures are displayed like that, IDA bundles the different values of the structure sequentially and displays the starting address of the entire structure for all values of it. If you'll hit the plus (+) key IDA will spread the structure across multiple lines, displaying extra details about each member of the structure.\n",
            "votes": "1",
            "user": "NirIzr",
            "time": "Jan 13, 2017 at 17:15",
            "is_accepted": false,
            "comments": [
                {
                    "user": "sherlock",
                    "text": "<span class=\"comment-copy\">Pressing the <code>+</code> key doesn't do anything. But how come all the structures start from the same address?</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">I might be wrong about the key shortcut. This is a single structure and every member is listed with the address of the structure's start address.</span>",
                    "time": null
                }
            ]
        }
    ]
}