{
    "title": "How do I know the bytes corresponding to an instruction in Hex view in IDA?",
    "link": "https://reverseengineering.stackexchange.com/questions/14422/how-do-i-know-the-bytes-corresponding-to-an-instruction-in-hex-view-in-ida",
    "content": "When I select an assembly instruction in IDA graph view, I want to see the exact bytes corresponding to the selected instruction when I switch to He view in IDA. How do I do that?\n",
    "votes": "14",
    "answers": 2,
    "views": "26k",
    "tags": [
        "ida"
    ],
    "user": "sherlock",
    "time": "Jan 16, 2017 at 18:17",
    "comments": [
        {
            "user": "Jongware",
            "text": "You do not need the hex viewer for that. Under (from memory) View options, you can check a box to get the source bytes in a column next to the actual disassembled instructions.\n",
            "time": null
        },
        {
            "user": "sherlock",
            "text": "I can't spot nothing of that sort\n",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "Foind it: hex-rays.com/products/ida/support/idadoc/605.shtml\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "The easiest way to get this done is simply by opening the Options -> General -> Disassembly window, and setting the \"Number of opcode bytes (Graph)\" field to the number of opcode bytes you wish IDA to show you in the both the graph and linear disassembly listing views.\nThis is how the configuration change should look:\n\nAnd the result of doing that will be similar to what's seen in the following image:\n\nNote that at most 6 bytes are displayed, and a plus sign is used to indicate a specific opcode contains additional bytes.\n",
            "votes": "23",
            "user": "NirIzr",
            "time": "Sep 27, 2018 at 7:21",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "IDA actually already does that for you. Put your mouse cursor on the instruction that you are interested in, go to Hex View, and the bytes corresponding to that instruction will be highlighted.\nIf you want to see the bytes corresponding to multiple instructions, you can write an IDAPython script to do that, such as this: (first use your cursor to select the instructions, then run this script)\n<pre><code>start = idc.SelStart()\nend = idc.SelEnd()\n\nprint hex(start), hex(end)\n\nwhile start < end: \n    print hex(idc.Byte(start))\n    start = idc.NextAddr(start)\n</code></pre>\n",
            "votes": "7",
            "user": "yellowbyte",
            "time": "Jan 16, 2017 at 21:25",
            "is_accepted": false,
            "comments": []
        }
    ]
}