{
    "title": "How can I see the IDAPython implementation of HexRay's decompiler API?",
    "link": "https://reverseengineering.stackexchange.com/questions/14463/how-can-i-see-the-idapython-implementation-of-hexrays-decompiler-api",
    "content": "I am trying to use HexRay's decompiler API, however having trouble due to its lack of documentation. Is there any means so That I can get to see the Python implementation of decompiler API?\n",
    "votes": "0",
    "answers": 1,
    "views": "349",
    "tags": [
        "ida",
        "idapython",
        "hexrays"
    ],
    "user": "sherlock",
    "time": "Jan 20, 2017 at 18:19",
    "comments": [
        {
            "user": "Nordwald",
            "text": "The actual source files should be contained in your IDA's python distribution (idaapi.py, idc.py, ..).. I fear there is no decent documentation\n",
            "time": null
        },
        {
            "user": "sherlock",
            "text": "Those are stubs generated by SWIG\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "yes, but they are still the \"Python implementation of decompiler API\".\n",
            "time": null
        },
        {
            "user": "sherlock",
            "text": "I guess that the actual logic is wrapped inside corresponding <pre><code>.so</code></pre> libraries\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "As far as I remember IDA license allows reverse engineering of IDA itself.\nIf suggestion that same rule is applicable to the decompiler is correct - the most approachable way to see the implementation is to reverse engineer the plugin - despite the fact that at least part of it should be significantly obfuscated.\nThere is, however, additional source of the information you can use, the documentation about C++ decompiler SDK is opened and can be found here.\nIt includes the source of hexrays.hpp file (here) with decent amount of comments that may be helpful.\n",
            "votes": "1",
            "user": "w s",
            "time": "Jan 23, 2017 at 8:03",
            "is_accepted": false,
            "comments": []
        }
    ]
}