{
    "title": "Can you decompile Actionscript 3 on a Mac?",
    "link": "https://reverseengineering.stackexchange.com/questions/144/can-you-decompile-actionscript-3-on-a-mac",
    "content": "Reverse engineering <pre><code>SWFs</code></pre> with <pre><code>ActionScript 3</code></pre> on a Mac typically requires a Windows VM and a lot of copying and pasting. There are some good decompilers for Windows such as as3extractor but I haven't found anything that seems to work on MacOS X.\nDoes a functional equivalent to <pre><code>as3extractor</code></pre> exist for Mac OS X ?\n",
    "votes": "10",
    "answers": 3,
    "views": "4k",
    "tags": [
        "decompilation",
        "swf",
        "actionscript",
        "osx"
    ],
    "user": "Jay",
    "time": "Jul 15, 2015 at 15:57",
    "comments": [],
    "answers_data": [
        {
            "content": "Here is a blog URL that lists free SWF Decompilers available. It includes programs for decompiling AS2 & AS3.\nSome of the tools listed there include:\n\nActionScript Extractor\nSWFWire Decompiler\nJPEXS Free Flash Decompiler\nJP ActionScript decompiler (ASDec)\nHP SWFScan, etc.\n\nIf you want to disassemble AS3, then I highly recommend <pre><code>SWFDump</code></pre>.\n<pre><code>swfdump</code></pre> (part of <pre><code>SWFTools</code></pre> package) will decompile AS3 and will work in Mac as long as you follow the instructions in their FAQ to compile the tool set for Mac.\nThe current collection is comprised of the programs detailed below:\n\n<pre><code>SWFDump</code></pre> Prints out various informations about SWFs, like contained images/fonts/sounds, disassembly of contained code as well as cross-reference and bounding box data.\n<pre><code>SWFStrings</code></pre> Scans SWFs for text data.\n<pre><code>SWFC</code></pre> A tool for creating SWF files from simple script files. Includes support for both - ActionScript 2.0 as well as ActionScript 3.0.\n<pre><code>SWFExtract</code></pre> Allows to extract Movieclips, Sounds, Images etc. from SWF files.\n<pre><code>AS3Compile</code></pre> A standalone ActionScript 3.0 compiler. Mostly compatible with Flex.\n<pre><code>SWFCombine</code></pre> A multi-function tool for inserting SWFs into Wrapper SWFs, contatenating SWFs, stacking SWFs or for basic parameter manipulation (e.g. changing size).\n<pre><code>PDF2SWF</code></pre> A PDF to SWF Converter. Generates one frame per page. Enables you to have fully formatted text, including tables, formulas, graphics etc. inside your Flash Movie. It's based on the <pre><code>xpdf</code></pre> PDF parser from Derek B. Noonburg.\n<pre><code>JPEG2SWF</code></pre> Takes one or more JPEG pictures and generates a SWF slideshow from them. Supports motion estimation compression (h.263) for better compression of video sequences.\n<pre><code>PNG2SWF</code></pre> Like <pre><code>JPEG2SWF</code></pre>, only for PNGs.\n<pre><code>GIF2SWF</code></pre> Converts GIFs to SWF. Also able to handle animated gifs.\n<pre><code>WAV2SWF</code></pre> Converts WAV audio files to SWFs, using the L.A.M.E. MP3 encoder library.\n<pre><code>AVI2SWF</code></pre> Converts AVI animation files to SWF. It supports Flash MX H.263 compression. Some examples can be found at examples.html. (Notice: this tool is not included anymore in the latest version, as ffmpeg or mencoder do a better job nowadays)\n<pre><code>Font2SWF</code></pre> Converts font files (TTF, Type1) to SWF. \n<pre><code>SWFBBox</code></pre> Allows to read out, optimize and readjust SWF bounding boxes. \n\n<pre><code>SWFTools</code></pre> has been reported to work on Solaris, Linux (both 32 as well as 64 bit), FreeBSD, OpenBSD, HP-UX, Solaris, MacOS X and Windows 98/ME/2000/XP/Vista.\n",
            "votes": "7",
            "user": "0xC0000022L",
            "time": "Apr 7, 2013 at 15:33",
            "is_accepted": false,
            "comments": [
                {
                    "user": "tnc",
                    "text": "<span class=\"comment-copy\">I used to like <a href=\"http://www.nowrap.de/flasm.html\" rel=\"nofollow noreferrer\">Flasm</a> but it is outdated. If you don't have other options you should check it too.</span>",
                    "time": null
                },
                {
                    "user": "rev",
                    "text": "<span class=\"comment-copy\">Yes, I do agree that Flasm is outdated which is why I am recommending SWFTools.</span>",
                    "time": null
                },
                {
                    "user": "Ange",
                    "text": "<span class=\"comment-copy\">does SWFDump decompile (bytecode) or disassemble (high level syntax) ?</span>",
                    "time": null
                },
                {
                    "user": "rev",
                    "text": "<span class=\"comment-copy\">ange, you are correct. SWFDump disassembles AS3. I have updated the answer to include the list of free decompilers.</span>",
                    "time": null
                },
                {
                    "user": "Wyatt Ward",
                    "text": "<span class=\"comment-copy\">@rev is there a way to re-assemble that bytecode after it's been disassembled via swfdump? I'm reading the manpages but feel like I must be missing something.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Commercial:\nIf you're alright with commercial tools, Sothink's SWF decompiler for Mac should be capable of decompiling AS3 on Mac. I've only used the Windows version but I believe their features should be mostly similar. They have a feature to export FLA from a SWF file which works very well for most cases.\nTheir product page mentions\n\nSupport Flash CS3/CS4/CS5/CS5.5/CS6 and ActionScript 2.0/3.0.\n\nhttp://www.sothink.com/product/flash-decompiler-for-mac/\nFreeware:\nI do not know of a good freeware solution. If you'd like to use AS3Extractor on your Mac, you can consider running Wine (install via Homebrew). AS3Extractor also mentions that they have a dependency on Visual C++ 2008 Redistributable Package so do take note!\n",
            "votes": "5",
            "user": "jg0",
            "time": "Mar 22, 2013 at 4:06",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I use https://www.free-decompiler.com/flash/ which is the best software I have seen. It has almost all features you can want. It also comes with a java library which can be handy to automate your workflow.\nFor a more low-level tool : https://github.com/CyberShadow/RABCDAsm\n",
            "votes": "1",
            "user": "Labo",
            "time": "Jan 28, 2017 at 14:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}