{
    "title": "IDA Pro Export C style array using Python instead of GUI menu",
    "link": "https://reverseengineering.stackexchange.com/questions/14569/ida-pro-export-c-style-array-using-python-instead-of-gui-menu",
    "content": "IDA Pro 6.95. From the menu I can use Edit... Export data... C unsigned char array (hex).\nI want to do this in a Python script without rewriting what already works.\nI have looked for a way to find a list of the commands I have performed through the GUI menus, but export data is not the sort of thing that appears in an IDC file.\n",
    "votes": "1",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ida",
        "idapython",
        "array"
    ],
    "user": "John Banks",
    "time": "Feb 4, 2017 at 18:06",
    "comments": [],
    "answers_data": [
        {
            "content": "Because this is a relatively basic functionality, there's not builtin way to call that command from IDAPython. You could do some Qt trickery to fake that GUI menu being clicked by the user, but that seems too much effort.\nTo me it seems as if the easiest and cleanest solution here is to simply call <pre><code>idaapi.get_many_bytes</code></pre> to get the buffer of data you're interesting in dumping, and then format it however you'd like.\nfor example, the following code snippet will output the binary data as a hexadecimal string:\n<pre><code>buf = idaapi.get_many_bytes(start, end)\nbuf.encode('hex')\n</code></pre>\nOr to get a c-like array:\n<pre><code>buf = idaapi.get_many_bytes(start, end)\nbuf = buf.encode('hex')\ntwo_hex_char_seq = map(operator.add, buf[::2], buf[1::2])\nc_array = \"{0x\" + \", 0x\".join(two_hex_char_seq) + \"}\"\n</code></pre>\nWhich will give an output similar to:\n<pre><code>{0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38, 0x39, 0x30}\n</code></pre>\n",
            "votes": "3",
            "user": "NirIzr",
            "time": "Feb 7, 2017 at 14:33",
            "is_accepted": true,
            "comments": [
                {
                    "user": "John Banks",
                    "text": "<span class=\"comment-copy\">Perfect. This teaches me more IDA Python, and also lets me automate a whole load more stuff.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">@JohnBanks Can I interest you in accepting this answer if it suits your needs and provides the information you were looking for? :)</span>",
                    "time": null
                }
            ]
        }
    ]
}