{
    "title": "Area calculations & what about 12.5m? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/14748/area-calculations-what-about-12-5m",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nThe shown girder is made from plain stone concrete and four 25 mm diameter steel wires. \nIncluding the weight of steel wires, determine self weight of the girder if its length is 12.5 m.\nNeglect the volume of concrete displaced by steel wires\nMy answer,\n area of concrete = ((150*1200)+ 4((200*100)+(0.5*100*150))-(4*pi*(12.5)^2))*(1×10^-3)^2=70.44m^2\narea of steel = (4*pi*(12.5)^2))*(1×10^-3)^2 = 1.963×10^-3m^2\nW = [(70.44×22.6)+(1.96×10^-3×77.3)] = 1.59×10^3KN/m\n",
    "votes": "-2",
    "answers": 1,
    "views": "73",
    "tags": [
        "struct",
        "math"
    ],
    "user": "Just Believe",
    "time": "8 years ago",
    "comments": [
        {
            "user": "julian",
            "text": "Have you thought about asking this question on the mathematics SE site?\n",
            "time": null
        },
        {
            "user": "0xec",
            "text": "I'm voting to close this question as off-topic because this is a question of areas and weight calculations related to Mathematics.\n",
            "time": null
        },
        {
            "user": "blabb",
            "text": "Well this question has nothing to do with reverse engineering i assume this is your homework question so here are some hints split the shape into basics so it is 3 rectangles and 4 triangles compute the area multiply the ares by length gives you volume muliply the volume by density to get msss  and answer it on your own\n",
            "time": null
        },
        {
            "user": "Just Believe",
            "text": "But What about asking for it's length which is 12.5m while actually it is 12m?\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "This question it's not about Reverse Engineering.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "This is not a question of reverse engineering, but anyway this is how you can  proceed. \nDivide the cross-section into 5 parts - 3 rectangles and 2 trapezoids.\n\nArea of rectangle and trapezoids can be calculated with their respective formulae. Multiply by the length (12.5m) to get the volume. The product of volume and density would give the mass.\nSimilarly, you can calculate the mass for the 4 steel wires.\n",
            "votes": "0",
            "user": "0xec",
            "time": "Feb 25, 2017 at 17:44",
            "is_accepted": true,
            "comments": []
        }
    ]
}