{
    "title": "How to extract D-Link DCS-4603 camera firmware",
    "link": "https://reverseengineering.stackexchange.com/questions/14861/how-to-extract-d-link-dcs-4603-camera-firmware",
    "content": "I tried extract the firmware image from the binary file available at the D-Link DCS-4603 Vigilance Full HD PoE Dome Network Camera technical support page  it by using <pre><code>binwalk</code></pre> but failed. Is there another way to extract the firmware? Or is there another tool that I can use? Or you can guide my extraction efforts?\n",
    "votes": "-1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "binary-analysis",
        "firmware",
        "decompress"
    ],
    "user": "QChí Nguyễn",
    "time": "Mar 10, 2017 at 9:41",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "how did you \"try and failed\"? Did you get any output at all? post any details in the question.\n",
            "time": null
        },
        {
            "user": "QChí Nguyễn",
            "text": "It just print infomations such as: md5 file, ... but not print DECIMAL, HEXADECIMAL ,DESCRIPTION. I tried with other firmware and it work.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Recommendation: since the firmware is obfuscated, recover the bootloader\nThe firmware may be encoded, compressed, encrypted, or some combination of these. In order for the firmware image to be loaded into memory and execute, it must be deobfuscated. Since the bootloader is responsible for this, it is likely that deobfuscation of the binary file containing the firmware image is performed by a routine or set of routines within the bootloader. Locating the code handling deobfuscation will enable you to deobfuscate the binary file containing the firmware image yourself.\nRecovering the bootloader requires access to the hardware. Several resources exist that will guide you in your efforts to dump the bootloader from the hardware as well as locate the deobfuscation code:\nReverse Engineering Serial Ports\nReversing the WRT120N’s Firmware Obfuscation\nTurning a Webcam Into a Backdoor\nBelkin F9K1111 V1.04.10 Firmware Analysis\nHow do I extract a copy of an unknown firmware from a hardware device?\nAnalysis\nThere are 2 firmware versions available for download at the page in the link provided: \n\nversion 1.00.00\nversion 1.01\n\nBoth were analyzed. \nThe binary files are named <pre><code>DCS-4603_A1_FW_V1.00.00.bin</code></pre> (version 1.00) and <pre><code>DCS-4603_A1_FW_V1.01.00.bin</code></pre> (version 1.01) when the packages containing them are unzipped. \nBoth files are approximately 15MB each, with version 1.01 being slightly larger than version 1.00:\n<pre><code>15521100 DCS-4603_A1_FW_V1.00.00.bin\n15848708 DCS-4603_A1_FW_V1.01.00.bin\n</code></pre>\n1. <pre><code>strings</code></pre> and <pre><code>hexdump</code></pre>\nPreliminary analysis using <pre><code>strings -n</code></pre> and <pre><code>hexdump -C</code></pre> did not reveal beyond the absence of ASCII strings in either ~15MB file as well as no discernible file header.\n2. Entropy Analysis\nEntropy was consistently high throughout both files:\n<pre><code>DCS-4603_A1_FW_V1.00.00.bin</code></pre>:\n\n<pre><code>DCS-4603_A1_FW_V1.01.00.bin</code></pre>:\n\nA smooth entropy line and consistent entropy level throughout tends to indicate encryption. Reference: Differentiate Encryption From Compression Using Math. \nAs can be seen in the plots above, there was a perturbation in the entropy level in both files at offset ~0x002EB870. This was investigated further in when both files were diffed.\nThese plots also show that there are no areas of very low entropy in between areas of higher entropy. Such low entropy areas can indicate padding between different types of data in the binary file.\n3. Diffing the Binary Files\nThere are at least 2 interesting regions of commonality between the 2 binary files: the region between offset 0x00000000 and 0x000068F0 and the site of the perturbation revealed in the entropy plots above, the region between offsets 0x002EB870 and 0x002ED320.\nDiff of region between offsets 0x00000000 and 0x000068F0 (length of 26864 bytes):\n\n\nThe first four bytes, <pre><code>73 00 2E 30</code></pre>, may be a signature of some kind.\nDiff of region between offsets 0x002EB870 and 0x002ED320 (length of 6832 bytes):\n\n\nTo my (very) inexperienced eye, these relatively large regions of commonality suggest compression or encoding rather than encryption of similar underlying data. \nFinal observation: D-Link's documentation for the camera explicitly discusses encoding capability (emphasis mine):\n\nTo maximize bandwidth efficiency and improve image quality, the DCS-4603 provides real-time video compression using the H.264 and MJPEG codecs, and supports separate profiles for simultaneous video streaming and recording. \n\nHowever, this my not play any role in how the binary file containing the firmware image is obfuscated.\nConclusion\nThe fastest way to decode the binary file in order to extract the firmware image seems to be dumping the bootloader and analyzing it to pinpoint the obfuscation routine(s). \n\nis there another tool that I can use?\n\nfirmware mod kit\nSignsrch (Windows exe)\ndeezee\n",
            "votes": "4",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": []
        }
    ]
}