{
    "title": "What is a good and reliable C decompiler that support ELF and SH4 Architecture?",
    "link": "https://reverseengineering.stackexchange.com/questions/14877/what-is-a-good-and-reliable-c-decompiler-that-support-elf-and-sh4-architecture",
    "content": "I have a ELF file, which is a partial firmware of a navigation module(my BMW idrive CCC), I need to decompile the elf file. \nI tried Reko Decompiler which said it does not support SH4 and Snowman plugin on IDA and but looks like it does not detect the SH4 architecture cause it brought some push and pop instruction in C code, which besides the fact that it is considered cheating for a decompiler!, SH4 architecture has register block that does not need push and pop while calling routines, it actually does not have such thing.\nAt the following picture, the floating window at right shows the correct assembly code, unassembelied out of my ELF file. at the center however you see some incorrect assembly that snowman derived from ELF file which is totaly different! comparing with the correct one.\n\nSo the decompiler MUST support architecture.\nI need a good Decompiler that can support SH4 architecture and ELF files.\n",
    "votes": "9",
    "answers": 2,
    "views": "15k",
    "tags": [
        "elf",
        "decompiler"
    ],
    "user": "Iman Rosstin",
    "time": "Mar 11, 2017 at 10:14",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "Writing decompilers is not easy. Be glad if you find any decompiler for SH, let alone a \"reliable\" one. BTW, what is an \"ELF pe\"?\n",
            "time": null
        },
        {
            "user": "julian",
            "text": "Are you looking for a tool that translates CPU instructions to assembly (a disassembler) or a tool that reconstructs the source code of an executable binary (decompiler)?\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "\"PE\" most commonly refers to the Microsoft Windows COFF/PE format, I would suggest you to edit that part to reduce confusion.\n",
            "time": null
        },
        {
            "user": "John Källén",
            "text": "Hello @Zich; reko decompiler maintainer here. If you wish to request SH4 support in reko, just add an issue here (github.com/uxmal/reko/issues). It takes me about 2 weeks to complete basic support for a new architecture in Reko. It helps if you can supply a sample ELF file for that architecture.\n",
            "time": null
        },
        {
            "user": "John Källén",
            "text": "Well, I went ahead and implemented partial support for SH4 anyway :) It's there in Reko should you wish to test it.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "As of the 9.1 release, Ghidra supports SH4.\n",
            "votes": "2",
            "user": "hairlessbear",
            "time": "Dec 26, 2020 at 8:42",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "One of the most complete decompilers i use for pretty much everything ;) is the Radare2. Very agile, with a browser-based GUI (which you have to install extra :( ), supports python scripting and it decompiles almost everything!\n",
            "votes": "-3",
            "user": "Chris Tsiakoulas",
            "time": "Mar 14, 2017 at 10:14",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">does it actually <i>decompile</i>  SH, or just <i>disassembles</i> it? Please post some screenshots if it does.</span>",
                    "time": null
                },
                {
                    "user": "Chris Tsiakoulas",
                    "text": "<span class=\"comment-copy\">If its an .elf there wont be any problem. I haven't tried SH4 based binaries myself, but there is an unofficial package for that <a href=\"https://packages.debian.org/sid/sh4/radare2/download\" rel=\"nofollow noreferrer\">packages.debian.org/sid/sh4/radare2/download</a></span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">that just looks like r2 compiled for sh4.</span>",
                    "time": null
                },
                {
                    "user": "Chris Tsiakoulas",
                    "text": "<span class=\"comment-copy\">Im on the go, i haven't checked thoroughtly... 😐 but give it a try... i once decompiled a .bin with firmware from an e-cigarrete without knowing anything about its microcontroller. Radare2 is very good with multiple hardware architectures.</span>",
                    "time": null
                },
                {
                    "user": "Iman Rosstin",
                    "text": "<span class=\"comment-copy\">@ChrisTsiakoulas it does not support SH4 see supported architectures here : <a href=\"https://radare.org/r/cmp.html\" rel=\"nofollow noreferrer\">radare.org/r/cmp.html</a></span>",
                    "time": null
                }
            ]
        }
    ]
}