{
    "title": "what is best forum to ask about hex reversing? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/14905/what-is-best-forum-to-ask-about-hex-reversing",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\ni want to create c script extract encrypt package. just can open it in hex editor to view and need knowledge and technique for write script for extract it. Script will work in command-line ( window 10 ).  I want to training my hex reversing skill. First, what need to look? Two, how to read? what is string,offset, byte, bit and how to know it in hex read? HOW THe SCRIPT RUN AND EXTRACT FILE? How do those words in script relate to numbers? How to find those word for script? where i can learning it? kind of patched number? I need all answer. If have any tutorial , please share me link . Also, i want to find best forum, no matter Russian or US, France. this is hex reverse engineering. please help.\n",
    "votes": "-1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "c",
        "decryption",
        "hex"
    ],
    "user": "fastestsuperman",
    "time": "8 years ago",
    "comments": [
        {
            "user": "julian",
            "text": "This is good place to ask questions about reverse engineering. The more detail you provide about the problem you are having the more likely it is someone will be able to help you. A list of resources for beginners can be found here. Can you provide more specific info in your question about the file and steps you have taken to analyze it?\n",
            "time": null
        },
        {
            "user": "fastestsuperman",
            "text": "it is a game data file.\n",
            "time": null
        },
        {
            "user": "julian",
            "text": "is that the full extent of the information you can provide? have you tried to analyze the file?\n",
            "time": null
        },
        {
            "user": "fastestsuperman",
            "text": "it is encrypt file. the only way get into game file is .exe file. ida pro, but i still don't know use ida pro for this .\n",
            "time": null
        },
        {
            "user": "julian",
            "text": "here are some tutorials\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "We call it data (file format) reverse engineering but, it is also bounded with software reverse engineering because you need to examine (if you have) actual software which creates, edits, extracts this file-type. Reverse Engineering Stack Exchange is not a forum but, it is most helpful community I have ever seen. Also, just a few active forums discuss reverse engineering topics and they expect you know some basics about this field. Most people don't want to help step by step reverse engineering to somebody. For resources I can recommend you Reversing: Secrets of Reverse Engineering and Reverse Engineering for Beginners to start. It discuss theoretical basics and practical examples of reverse engineering.\n",
            "votes": "2",
            "user": "Kerim Can Kalıpcıoğlu",
            "time": "Dec 5, 2020 at 5:26",
            "is_accepted": false,
            "comments": []
        }
    ]
}