{
    "title": "how to translate HEX values into X Y Z",
    "link": "https://reverseengineering.stackexchange.com/questions/14932/how-to-translate-hex-values-into-x-y-z",
    "content": "I am trying to understand how an application I have been using is setting its data in XYZ coordinates which I wish to convert to HEX value. The application essentially shows me the XYZ in one format (float maybe), but I am only able to edit this data in HEX, so I need to understand the translation to make proper edits. \nFirst off lets look at the values displayed in the program\nX = 1.085597\nY = 4.703604\nZ = -17.573305\nThe HEX values for these XYZ values is 12 bytes, which I assume is 4 bytes for X values, 4 for Y, and for for Z. Here is the HEX output:\n19 B3 87 44 D6 FC 92 45 9C 4A 89 C6\nSo what I am wondering is if there is a way to ascertain (from the data I have provided) the formula that the application is using so I can convert the XYZ values to HEX values?\nSomeone metioned it might be IEEE 754 standard? but I'm new to hex editing so I'm not sure how to apply this or what it means.\nHEX values appear to be in little endian.\n",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "hex"
    ],
    "user": "Kalamalka Kid",
    "time": "Mar 17, 2017 at 19:49",
    "comments": [],
    "answers_data": [
        {
            "content": "The hex you posted is equivant to the float value * 10^3\nThat is  1085.597 == 0x4487b319 and so on \nUse any online calculator to check in both direction  like\nhttps://www.h-schmidt.net/FloatConverter/IEEE754.html\n",
            "votes": "2",
            "user": "blabb",
            "time": "Mar 17, 2017 at 20:08",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Kalamalka Kid",
                    "text": "<span class=\"comment-copy\">thank you so much. I found this site worked too  <a href=\"http://www.scadacore.com/field-tools/programming-calculators/online-hex-converter/\" rel=\"nofollow noreferrer\">scadacore.com/field-tools/programming-calculators/…</a></span>",
                    "time": null
                }
            ]
        }
    ]
}