{
    "title": "How can I change the values in esp?",
    "link": "https://reverseengineering.stackexchange.com/questions/14936/how-can-i-change-the-values-in-esp",
    "content": "<pre><code>   0x08048785 <+344>:   movl   $0x0,0xc(%esp)\n   0x0804878d <+352>:   movl   $0x804896c,0x8(%esp)\n   0x08048795 <+360>:   movl   $0x8048973,0x4(%esp)\n   0x0804879d <+368>:   movl   $0x8048973,(%esp)\n=> 0x080487a4 <+375>:   call   0x8048470 <execlp@plt>\n</code></pre>\nI am wondering is it possible to alter the argument that is going to the function execlp() in order to execute a shell? and if it is possible how can I change those values like 0x8(%esp)?\nThanks a lot.\n",
    "votes": "1",
    "answers": 1,
    "views": "968",
    "tags": [
        "disassembly",
        "debugging",
        "binary-analysis",
        "gdb"
    ],
    "user": "mylifeisdark",
    "time": "Mar 18, 2017 at 5:30",
    "comments": [
        {
            "user": "NirIzr",
            "text": "It's not quite clear if you're interested in manually changing that assembly code by patching or are you're asking about exploitation.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I am wondering is it possible to alter the argument that is going to the function execlp() in order to execute a shell?\n\nYes, this is possible. The strings located at the memory addresses written to the stack prior to calling <pre><code>execlp</code></pre> can be patched such that <pre><code>/bin/sh</code></pre> is executed instead. If there is not enough space for the pathname of the program to execute and/or its arguments between the current memory references, the memory addresses being written to the stack will have to be patched as well to reflect the lengths of the new strings they reference.\nThe memory addresses being written to the stack prior to calling <pre><code>execlp</code></pre> are pointers to strings in the <pre><code>.rodata</code></pre> section of the binary, where  the string pointed to by the first argument (<pre><code>0x8048973</code></pre> in the snippet of disassembled code above) is the pathname of the program to execute (we can think of <pre><code>execlp</code></pre> as \"exec load path\"). If this string is changed, <pre><code>execlp</code></pre> will load the program located at the new pathname.\nFor reference, here is the prototype for <pre><code>execlp</code></pre> and its description from the man page:\n\n<pre><code>int execlp(const char *file, const char *arg, ... /* (char  *) NULL */);</code></pre>\nThe <pre><code>const char *arg</code></pre> and subsequent ellipses in the execl(), execlp(), and execle() functions can be thought of as arg0, arg1, ..., argn. Together they describe a list of one or more pointers to null-terminated strings that represent the argument list available to the executed program.  The first argument, by convention, should point to the filename associated with the file being executed.  The list of arguments must be terminated by a null pointer, and, since these are variadic functions, this pointer must be cast <pre><code>(char *) NULL</code></pre>.\n\nHere is a good explanation of how <pre><code>execlp</code></pre> works:\nI do not understand how execlp() works in Linux\nNote also that since the ISA is x86 and the compiler is GCC, the arguments to a function are written to the stack in the reverse order of their corresponding parameters in the function prototype. This means that the last argument written to the stack corresponds to the first parameter in the function prototype. In the case of <pre><code>execlp</code></pre>, the last argument written to the stack prior to calling <pre><code>execlp</code></pre> will be the pointer to the pathname of the program to load.\n\nand if it is possible how can I change those values like 0x8(%esp)?\n\nPatching strings in the <pre><code>.rodata</code></pre> section and patching instructions and memory addresses in the <pre><code>.text</code></pre> section can be accomplished using a hex editor like <pre><code>xxd</code></pre> or <pre><code>hexedit</code></pre>, or by using radare2.\nResources\nFor using GDB to patch the binary, see these:\nUsing GDB to modify an executable\nUse gdb to Modify Binary\nDebugging with GDB: Patching\nELF binary modification:\nFixing/Making Holes in ELF Binaries/Programs - Black Hat\nHow do I add functionality to an existing binary executable?\nThe ELF shell\n",
            "votes": "1",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}