{
    "title": "Dalvik dex file version 036",
    "link": "https://reverseengineering.stackexchange.com/questions/14968/dalvik-dex-file-version-036",
    "content": "I came upon a sample that indirectly contains <pre><code>classes.dex</code></pre> with the magic \"Dalvik dex file version 036\". If not for the version, the file seems to be normal and JEB loads it without any problem.\nBut per official spec of DEX format the only allowed values are 035 and 037, with 038 in Android 8.0. Previously the text explicitly read (but not any more):\n\nDue to a Dalvik bug present in older versions of Android, Dex version 036 has been skipped. Dex version 036 is not valid for any version of Android and never will be.\n\nThe same story is confirmed here - https://github.com/JesusFreke/smali/issues/484.\nHow Android behaves on such a dex? Does Dalvik simply load it silently or rejects? Or this is a known technique of concealing the file from analysis and the version is being corrected just before the dex is loaded?\n",
    "votes": "4",
    "answers": 2,
    "views": "1k",
    "tags": [
        "android",
        "static-analysis",
        "apk",
        "protection",
        "dalvik"
    ],
    "user": "Ilia Barahovsky",
    "time": "Mar 21, 2017 at 8:57",
    "comments": [],
    "answers_data": [
        {
            "content": "I believe most versions of dalvik and art will reject the dex file and refuse to load it.\n",
            "votes": "2",
            "user": "JesusFreke",
            "time": "Mar 21, 2017 at 16:12",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ilia Barahovsky",
                    "text": "<span class=\"comment-copy\">Thank you for the answer. Do you have any idea why somebody would create such a file? Is it a bug or some concealment technique?</span>",
                    "time": null
                },
                {
                    "user": "JesusFreke",
                    "text": "<span class=\"comment-copy\">There was a short time around the JB timeframe (iirc) where the platform used this version.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Definitely, this file would not be executed on new'ish platforms, but could be accepted on some older ones (which ones/vendors would be an interesting trivia to research), per this comment in dex_file.cc:\n\n// Dex version 036 skipped because of an old dalvik bug on some\n  versions of android where dex // files with that version number would\n  erroneously be accepted and run.\n",
            "votes": "0",
            "user": "Nick",
            "time": "Jun 21, 2017 at 5:35",
            "is_accepted": false,
            "comments": []
        }
    ]
}