{
    "title": "How does a SIM card work?",
    "link": "https://reverseengineering.stackexchange.com/questions/15011/how-does-a-sim-card-work",
    "content": "I understand that a SIM card has memory, and that some or maybe all of them also include microprocessors.  \nThey act as peripherals that are more than just flash memory.\nI would like to be able to read the contents and extract my contacts and messages, for backup, so I bought an el-cheapo \"SIM Card Reader\" that plugs into a USB port.  But when I plug it in it is as if it isn't even there.  \nSo how can I get access to the data?\nSecondly, I understand that they can affect the baseband portion of the cellphone, including frequency of operation and whatever codes are necessary to identify itself (IMEI) and to access a particular network (T-Mobile, AT&T, Verizen).  Again, it is clearly more than just flash memory.\nSo my question is, how exactly do they work, and how can I read the data from my phone's card?\n",
    "votes": "15",
    "answers": 2,
    "views": "7k",
    "tags": [
        "firmware",
        "memory"
    ],
    "user": "SDsolar",
    "time": "May 14, 2018 at 17:00",
    "comments": [],
    "answers_data": [
        {
            "content": "SIMs card are a type of Universal Integrated Circuit Card (UICC).\n\nhow exactly do they work\n\nAccording to Karsten Nohl's presentation \"Mobile Network Attack Evolution\", SIM cards contain an embedded real-time operating system, a filesystem and a Java VM:\n\nHere is the technical specification for UICCs, which describes exactly how they work: \nETSI TS 102 221 V8.2.0 (2009-06)\nTechnical Specification for smart cards, the UICC-Terminal interface and physical and logical characteristics.\n\nhow can I get access to the data?  how can I get into my own card?\n\nThis DefCon presentation \"DEF CON 21 - Karl Koscher and Eric Butler - The Secret Life of SIM Cards\" video explains quite a bit about SIM cards and how to interface with them.\nFrom the presentation slides:\n\nThey also had trouble:\n\nThey found SIM Alliance Loader software...\n\n...but decided to use GlobalPlatform instead, which is far more complicated. In order to use GlobalPlatform to interface with the SIM card, the presenters drew on techniques presented in Karsten Nohl's research.\n",
            "votes": "17",
            "user": "julian",
            "time": "Mar 26, 2017 at 3:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "SDsolar",
                    "text": "<span class=\"comment-copy\">Thank you, @SYS_V - I really appreciate you explaining this.  It isn't nearly as easy as reading a regular SD card at all.       (btw, cool handle -  I was trained on ATT System V also)</span>",
                    "time": null
                },
                {
                    "user": "julian",
                    "text": "<span class=\"comment-copy\">@SDsolar <a href=\"http://opensecuritytraining.info/SmartCards.html\" rel=\"nofollow noreferrer\">opensecuritytraining.info/SmartCards.html</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Found some good answers in this article:\nWhat Is A SIM Card (And What Comes Next)? (howtogeek.com)\nEXCERPT:\n\nWhat’s Stored On A SIM Card? \nA SIM card stores the 15-digit International Mobile Subscriber Identity (IMSI) \n  identifying the card on carrier’s mobile network. The IMSI is an\n  important part of the lookup process and determines the network to\n  which a mobile device connects.\nAlong with the IMSI, a 128-bit value authentication key (Ki) is sent\n  to verify your SIM with the GSM cellular network. The Ki is assigned\n  by the operator and stored in a database on their network.\nA SIM card is also capable of storing SMS messages and the names and\n  phone numbers of up to 500 contacts, depending on the memory size of\n  the SIM card you have. If you have to change phones for whatever\n  reason, you’re able to transfer your contacts via the SIM card\n  painlessly.\nMost SIM cards contain between 64-128 KB of storage.\n> How Does A SIM Work? \nEssentially, a SIM card serves as your phone’s credentials to access\n  the carrier network. Because the SIM holds this information, you’re\n  able to pop it into any phone with the same carrier, or an unlocked\n  phone, to access the network.\nHere’s how it works:\nWhen you boot up your device, it obtains the IMSI from the SIM, and\n  then relays the IMSI to the network in order to request access. \nThe operator network searches the database for your IMSI and the\n  associated Ki. \nAssuming your IMSI and Ki are verified, the operator\n  then generates a random number, signs it with your Ki using the GSM\n  cryptography algorithm for computing SRES_2, and creates a new unique\n  number. \nThe network then sends that unique number back to the device,\n  which then passes it to the SIM to use in the same algorithm, creating\n  a third number. \nThis number is then relayed back to the network. \nIf both numbers match, the SIM card is deemed legitimate and is granted\n  access to the network. \nSo if you break the screen on your phone, while\n  it’s getting fixed you can take your SIM out and put it in a\n  replacement phone and still access phone calls, texts, and data from\n  your network.\n",
            "votes": "1",
            "user": "SDsolar",
            "time": "Jun 1, 2018 at 19:41",
            "is_accepted": false,
            "comments": []
        }
    ]
}