{
    "title": "Need help in understanding the code of a \"Malicious\" file [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/15086/need-help-in-understanding-the-code-of-a-malicious-file",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions asking for help reverse-engineering a specific system are off-topic unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem.\n\n\nClosed 8 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm testing a malware sample :\nhxxps://www.virustotal.com/en/file/55f4cc0f9258efc270aa5e6a3b7acde29962fe64b40c2eb36ef08a7a1369a5bd/analysis/\nThis is a malicious executable file. When executed in Windows XP, it exhibits its behavior (ransomware). But the same file when executed in windows 7, it does't show its actual behavior.\nNeed your help to identify that specific condition in the which makes the malware run only in a specific operating system.\n",
    "votes": "-2",
    "answers": 1,
    "views": "99",
    "tags": [
        "malware",
        "static-analysis"
    ],
    "user": "Lavangam",
    "time": "8 years ago",
    "comments": [
        {
            "user": "SDsolar",
            "text": "May I suggest that you break that link up into pieces so nobody accidentally clicks on it?\n",
            "time": null
        },
        {
            "user": "Lavangam",
            "text": "That's not a malicious URL. Anyways I have edited it\n",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "What have you tried doing? where did you get so far? What specific problems you encountered in your reverse engineering process?\n",
            "time": null
        },
        {
            "user": "julian",
            "text": "Here is a technical analysis of a variant of this program\n",
            "time": null
        },
        {
            "user": "user2823000",
            "text": "Did you try to debug the malware on Win7 to see when it fails?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Need your help to identify that specific condition in the which makes\n  the malware run only in a specific operating system.\n\nPlease note malware authors seldomly care about keeping their products updated.\nFor example, when assembling a ground truth for malware evaluation, there is a clear slope: most samples will work on XP, somewhat less on Windows 7 and even less on Windows 8 / 10 (not much difference here). For each step upwards, you'll lose an average of about 15% of the samples.\nOften, you may be able to find a variant of a family capable of running on an newer system (but not for all families).\nI figured one of the main reasons is either that the sample checks for a specific windows version or a certain exploit does not work. For example, often privilege escalation using Process Injection may fail on more recent platforms when is was developed for XP. Somewhat more advanced malware even implements different methods for different OS versions.\nPlease remember that malware deals with pretty low level structures of the system.\nTL;DR\nEither malware does support multi-os functionality, or it does not.\nedit\nThe .dll you linked seems pretty sraight forward (unpacked?) since it contains some debug information and an intact import table. Is there anything in particular you're having problems with?\n",
            "votes": "2",
            "user": "Nordwald",
            "time": "Apr 5, 2017 at 6:10",
            "is_accepted": false,
            "comments": []
        }
    ]
}