{
    "title": "DGA(Domain Generation Algorithm) based malware files",
    "link": "https://reverseengineering.stackexchange.com/questions/15083/dgadomain-generation-algorithm-based-malware-files",
    "content": "Where i can get DGA (Domain Generation Algorithm) based malware files for analysis?\nAnd,Can I get malware family names which is using Domain Generation Algorithm?\n",
    "votes": "2",
    "answers": 1,
    "views": "513",
    "tags": [
        "malware",
        "networking",
        "dga"
    ],
    "user": "xoreax",
    "time": "Apr 4, 2017 at 15:12",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "I don't think anyone makes a special category for DGA-based malware so you'll just have to find them yourself among other samples. Otherwise such type of question is too broad to be answered properly.\n",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "I tend to disagree with closing this question. There are only dozens of DGA-centric malware families, and only a handful of well-known ones. This question, IMHO, can be cleanly answered and provides value to users. I therefore nominate it to reopening.\n",
            "time": null
        },
        {
            "user": "broadway",
            "text": "you can use botconf.eu/wp-content/uploads/2015/12/… is a reasonable start\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I know of no collection of malware samples, focusing specifically on DGAs.\nHowever, there are some resources that generally concentrate on DGAs and may provide you enough pointers to identify a reasonable number of different samples yourself.\n\nThere is Johannes Bader's github repository which features several reimplementations of DGAs found in malware, along with detailed write-ups and reference hashes.\nIf you are looking for some more background (more than in my BotConf talk) check out our USENIX paper, we listed many of the primary characteristics for a selection DGAs.\nI also run DGArchive - the referenced database of algorithmically generated domains (69 DGAs, 617 seeds, 63,699,402 unique domains). Other similar databases are John Bambenek's OSINT feed and 360.cn Netlab's DGA project.\nI will likely provide tags on samples (such as \"c2_dga\" or similar) on the corpus of my current pet project malpedia.\n",
            "votes": "6",
            "user": "pnX",
            "time": "Apr 5, 2017 at 15:54",
            "is_accepted": true,
            "comments": []
        }
    ]
}