{
    "title": "How to get elf header via IDAPython?",
    "link": "https://reverseengineering.stackexchange.com/questions/15110/how-to-get-elf-header-via-idapython",
    "content": "In IDAPython, we can get segments with <pre><code>idautils.Segments()</code></pre>.However, the result doesn't cover the whole input file, and the the first segment is \".init\". My question is, how to get other things in the input file, like elf header, or other sections, like \".dynsym\"?\nIn most elf files, the elf header can be located with address <pre><code>0x400000</code></pre>. But what if the address changed? Can I read it directly from the binary file?\n",
    "votes": "3",
    "answers": 2,
    "views": "1k",
    "tags": [
        "ida",
        "idapython",
        "static-analysis"
    ],
    "user": "liubenxi",
    "time": "Apr 6, 2017 at 8:48",
    "comments": [],
    "answers_data": [
        {
            "content": "You are actually asking multiple questions here :\n\nIf you checked \"Manual Load\" when creating your IDB, and answered \"Yes\" when IDA asks you if you want to load the header, you should have a \"HEADER\" section with the header data in it as your first Segment. This is pretty generic and should work for any binary format.\nI do believe that the other sections of the ELF might be loaded that way if you answer \"Yes\" when IDA asks you if you want to parse the header.\nTo get the base address of your programm, you can use the IDAPython call get_imagebase() but that should be your first section anyway in most binary formats (that is, if you loaded the header)\nIf you have loaded the header, you can read it directly from IDA using your usual IDAPython functions.\n",
            "votes": "1",
            "user": "user2823000",
            "time": "Sep 5, 2017 at 17:14",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "With LIEF you do it as follow:\n<pre><code>import lief\nelf = lief.parse(\"my_binary\")\ninit_section = elf.get_section(\".init\")\ndynsym_section = elf.get_section(\".dynsym\")\nprint(init_section)\nprint(dynsym_section)\n</code></pre>\nSource code is available here: https://github.com/lief-project/LIEF\n",
            "votes": "-2",
            "user": "Romain",
            "time": "Apr 6, 2017 at 14:32",
            "is_accepted": false,
            "comments": [
                {
                    "user": "julian",
                    "text": "<span class=\"comment-copy\">This does not answer the question. He is asking about how to do this using IDAPython specifically.</span>",
                    "time": null
                }
            ]
        }
    ]
}