{
    "title": "Batch mode of ida pro 6.5",
    "link": "https://reverseengineering.stackexchange.com/questions/15118/batch-mode-of-ida-pro-6-5",
    "content": "i have tried almost all links about batch mode.\nMy Question is that i did not get the user manual about batch mode of ida pro that how can i use the commands like -c -A -B and how i can run script on on any file with batch or terminal mode commands\nand what the use of idag, idaw\n",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "disassembly",
        "idapython",
        "ida-plugin"
    ],
    "user": "Jerry shaw",
    "time": "Apr 7, 2017 at 9:42",
    "comments": [
        {
            "user": "w s",
            "text": "Which OS do you want to use ?\n",
            "time": null
        },
        {
            "user": "w s",
            "text": "What exactly are you trying to do ?\n",
            "time": null
        },
        {
            "user": "Jerry shaw",
            "text": "currentyl i am using windows os and i want to export .asm or text files from multiple .exe files in IDA pro 6.5 and also each .exe file has its separate txt or .asm file and txt or .asm file contain the assembly code of that .exe\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You should do the following:\n\nOpen a command line interpreter window of Windows OS (cmd.exe)\nFind the exact location of the IDA executable that you are usually running (should be idaq.exe in modern versions, you can check the exact name in desktop shortcut by examining its properties)\nRun it from the comma\nnd line interpreter window (paste the IDA executable full name, surround it with quotes) with <pre><code>-B</code></pre> command line switch. You'll have something like this: <pre><code>\"c:\\Program Files (x86)\\IDA 6.95\\idaq.exe\" -B {full path to  the file you want to analyze}</code></pre>\nAfter running this command you should see the idb and assembly file in the same directory where your executable that you tried to analyze resides. Please note that you should run it on behalf of user that has write access permission for the folder where it resides. In addition you need to use appropriate IDA version: if the analyzed executable has 64 bit instruction set you have to use idaq64 executable.\n\nHere is how it works (and worked always) on my computer with IDA 6.95 (I analyzing 64 bit object file test.o, and corresponding ida database extension is not idb, but i64):\n<pre><code>C:\\Users\\[censored]\\Downloads\\idatest>copy z:\\test.o .\\\n        1 file(s) copied.\n\nC:\\Users\\[censored]\\Downloads\\idatest>\"c:\\Program Files (x86)\\IDA 6.95\\idaq64.exe\" -B .\\test.o\n\nC:\\Users\\[censored]\\Downloads\\idatest>dir\n Volume in drive C is OSDisk\n Volume Serial Number is F88B-CF68\n\n Directory of C:\\Users\\[censored]\\Downloads\\idatest\n\n04/13/2017  04:20 PM    <DIR>          .\n04/13/2017  04:20 PM    <DIR>          ..\n04/13/2017  04:20 PM             2,985 test.asm\n04/13/2017  04:20 PM            65,992 test.i64\n03/22/2017  06:44 PM             1,424 test.o\n               3 File(s)         70,401 bytes\n               2 Dir(s)   8,296,001,536 bytes free\n</code></pre>\nLet me know in comments if something doesn't work. Btw, help on command line switches is here.\n",
            "votes": "2",
            "user": "Dan Grahn",
            "time": "Sep 11, 2018 at 14:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jerry shaw",
                    "text": "<span class=\"comment-copy\">1)\tThank u for showing your interest   2)\twhen i run this command in cmd i got nothing in cmd .The cmd          just takes me to next line and ask for next command. 3)\twhere the produce .asm files are placed 4)\twhat will be the path of your file \"calc.exe\"</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">Please put the full path to your executable instead of calc.exe: it is a kind of tradition to use this executable as an example. Keep me posted.</span>",
                    "time": null
                },
                {
                    "user": "Jerry shaw",
                    "text": "<span class=\"comment-copy\">again when i give path to calc.exe like \"C:\\Program Files (x86)\\IDA 6.5\" -B .\\C:\\Program Files (x86)\\IDA 6.5\\calc.exe and run this command in cmd i got nothing in cmd .The cmd just takes me to next line and ask for next command</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">Check the content of the directory where you are running IDA. do you see new files there ? There should be idb and asm files</span>",
                    "time": null
                },
                {
                    "user": "Jerry shaw",
                    "text": "<span class=\"comment-copy\">actually i got nothing in that directory</span>",
                    "time": null
                }
            ]
        }
    ]
}