{
    "title": "iOS Position-independent code and relocations",
    "link": "https://reverseengineering.stackexchange.com/questions/15266/ios-position-independent-code-and-relocations",
    "content": "I'm reversing few iOS Mach-O application executables these days and all of them use Position-independent code (PIC; the MH_PIC flag is set). I've been expecting a large number of relocation entries (just like with Windows PE or Android ELF) but all the executables contain zero relocations (well, at least the <pre><code>__text</code></pre> section I'm interested in).\nThe oficial docs say that this is because the segments are always located at a constant offset from each other and that makes sense to me.\nHowever, can I take this for granted? Do all typical iOS applications contain no relocations because all the code and data are usually located in one binary (i. e., dynamic libraries are usually not used)?\n",
    "votes": "2",
    "answers": 1,
    "views": "544",
    "tags": [
        "ios",
        "mach-o",
        "pie"
    ],
    "user": "MazeGen",
    "time": "May 3, 2017 at 13:43",
    "comments": [],
    "answers_data": [
        {
            "content": "The Mach-O format does support relocations but they appear rarely outside of the object files; usually linker does pretty good job using PIC addressing inside the final linked module. \nAs for imports from other libraries on iOS, they don't use relocations anymore but special tables handled by the dynamic loader (dyld). I've described how they work previously. For even more gruesome details see dyld sources and inspect actual binaries.\n",
            "votes": "3",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": true,
            "comments": [
                {
                    "user": "MazeGen",
                    "text": "<span class=\"comment-copy\">(Thank for fast response, I upvoted your answer but it is not shown for some reason related to reputation or whatever...)</span>",
                    "time": null
                }
            ]
        }
    ]
}