{
    "title": "Help finding CPU/SOC on a board",
    "link": "https://reverseengineering.stackexchange.com/questions/15298/help-finding-cpu-soc-on-a-board",
    "content": "I have some difficult to find CPU from a board.\nFirst I though that CPU/SOC was this one :\n\nAll I know (about CPU) is that's an ARM core little-endian (because I begin reverse firmware in IDA) but I lack of information on it. The hardware is a 8 years old GPS with 800x480 tft.\nAccording to Igor link document from Samsung,  codification of K4X2G303PC - XGC6 means :\nK : Memory\n4 : DRAM\nX : Mobile DDR SDRAM\n2G : 2G, 8K/64ms (Density,Refresh)\n30 : x32 (2CS, 2CKE) (Organization)\n3 : 4Bank \nP : LVTTL, 1.8V, 1.8V (Interface, VDD, VDDQ)\nC (Generation)\nX : POP (Lead-Free, DDP, Halogen-Free)\nG : Extended, Low, PASR & TCSR (Temp, Power)\nC6 : 6ns@CL3 (Speed)\nHere is the whole board (warning EMMC is unsolded)\n\n\nHere same hard, but component is another reference from Micron Technology (picture is 180° rotated)\n\nAnd the backside\n\nX16V554IL is quad UART (https://www.exar.com/content/document.ashx?id=505) I checked GND pinout it is corresponding\nSo if Samsung K4x2G303PC is not SOC/CPU where is SOC/CPU ?\nWhy is there a Crystal near K4x2G303PC  ? (The other Crytal is for XR16V)\nCan Latticle CPLD LC4064 have an arm software core ?\nREgards ;)\n",
    "votes": "4",
    "answers": 3,
    "views": "670",
    "tags": [
        "arm"
    ],
    "user": "user2296435",
    "time": "May 8, 2017 at 8:27",
    "comments": [
        {
            "user": "Ian Cook",
            "text": "Please could you add a picture of the whole board ?\n",
            "time": null
        },
        {
            "user": "user2296435",
            "text": "Yes, I updated it\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "could it be that the CPU is somewhere else? what is this board from?\n",
            "time": null
        },
        {
            "user": "Ian Cook",
            "text": "What are the two ICs between the Samsung RAM and the EMMC ?\n",
            "time": null
        },
        {
            "user": "hobi",
            "text": "I also try to understand which CPU is being used there. Hard to find out, and I drilled down a little bit in a firmware bin file I have. If I am correct, the hex base address for the firmware running on that specific device ( a specific GPS device with a nice sunlight visible screen) is 0x80200000 , and indeed it is a little indian 32 bits arm code. There is a primary boot code also loaded at 0x80100000, and from the web surfing I made, that is to initialize among others the RAM. The entry point is not 100% easy to locate in the firmware bin file, and I am at that stage. I will now start to lo\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "On this photo you can see there are two \"layers\" in this chip separated by a matrix of solder balls. This is package on package — a method used to save board space. The actual processor is hidden under the RAM chip.\n\nLook at Raspberry Pi Zero — you won't find SoC there either! The chip there has Elpida label, which is a RAM manufacturer, and the SoC itself is under there.\n",
            "votes": "5",
            "user": "Vladislav Ivanov",
            "time": "May 22, 2017 at 18:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user2296435",
                    "text": "<span class=\"comment-copy\">This is it ! Amazing ! I didn't know. Knowing this I found this video : <a href=\"https://www.youtube.com/watch?v=ILmsp7Bk1kA\" rel=\"nofollow noreferrer\">pop video</a> at 1:45 min we can see approximately the same reference memory ( IBAI8 D9LFW &lt;=&gt; IBAI8 D9LBZ from  Micro) and under the cpu chip...</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Are you sure it's a SoC and that is the IC the firmware came from?  Results on Google suggest that is a DRAM chip.  Looking at Samsung part numbers show that most of the memory chips (mobile and otherwise) seem to start with K as well.\n",
            "votes": "3",
            "user": "user1593858",
            "time": "May 5, 2017 at 23:01",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ian Cook",
                    "text": "<span class=\"comment-copy\">Yes, it's consistent with the part numbers of their 2GB Mobile DDR SDRAM chips. I haven't found this specific one but other very similar parts seem quite common.  e.g. K4X2G323PC or K4X4G303PC</span>",
                    "time": null
                },
                {
                    "user": "user2296435",
                    "text": "<span class=\"comment-copy\">Yes THANKS, I think your are right. I find other reference for same hard (Micron Technologie) : IBAI8 on picture... They provide only DRAM, EMMC, NAND Flash but no CPU. So, it could be no SOC but just an Arm CPU ? Where is the Arm CPU ? Is it component reference XR16V ???</span>",
                    "time": null
                },
                {
                    "user": "user2296435",
                    "text": "<span class=\"comment-copy\">Meanwhile, I think that X16V554 is quad UART (<a href=\"https://www.exar.com/content/document.ashx?id=505\" rel=\"nofollow noreferrer\">exar.com/content/document.ashx?id=505</a>). SO I don't understand where is CPU ?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "You can use Samsung DRAM part number decoder  to find out the exact specs of this DRAM chip.\nSo no, this is not the CPU, it must be somewhere else.\n",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "May 8, 2017 at 16:52",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user2296435",
                    "text": "<span class=\"comment-copy\">This is done. I updated description of subject with it. It seem this is just a DRAM. If thisis the case I don't understand why there is a crytal near it and where is cpu ?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">good question, but I guess we need someone experienced in hardware to answer it. Maybe try to figure out JTAG, the chain scan might give the device IDs and from that some hints about the CPU.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">another possibility could be to try tracing pins of DRAM and/or eMMC to see where they connect to.</span>",
                    "time": null
                },
                {
                    "user": "user2296435",
                    "text": "<span class=\"comment-copy\">I have tryed open-ocd on pins that seems JTAG header with no result. I will try a JTAG finder later. Perhaps il will unsolder chipset. But for now this is a mystery</span>",
                    "time": null
                }
            ]
        }
    ]
}