{
    "title": "SWF flash analysis",
    "link": "https://reverseengineering.stackexchange.com/questions/15334/swf-flash-analysis",
    "content": "An SWF file was recently detected by Windows Defender as SWF/Meadgive. I uploaded a sample to VT and only Microsoft flagged it as malicious. As of today's signatures I am not seeing any further detection's and I am hoping this is simply a false positive.\nI'm using this as an opportunity to learn more about malware analysis and incident response. To take a deeper dive I opened the file with the JPEXS decompiler, but have no idea on where to go from here. Looking for guidance on how to better understand and analyze this for myself.\nAlso, are there any online tools/sandboxes that accept swf files that would provide any value?\n",
    "votes": "2",
    "answers": 1,
    "views": "958",
    "tags": [
        "malware",
        "exploit",
        "flash"
    ],
    "user": "Heisenberg",
    "time": "May 12, 2017 at 15:02",
    "comments": [],
    "answers_data": [
        {
            "content": "According to \nhttps://www.microsoft.com/security/portal/threat/encyclopedia/entry.aspx?Name=Exploit%3aJS%2fMeadgive this malware will download packages based on existing vulnerabilities.\nOne way to handle this would be to setup a virtual machine with one of these vulnerabilities and use Wireshark to monitor network activity and ApateDNS to forward any DNS requests to another Linux virtual machine running iNetSim.\n",
            "votes": "1",
            "user": "T. Edison",
            "time": "May 12, 2017 at 17:22",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Heisenberg",
                    "text": "<span class=\"comment-copy\">I've already looked at this on Wireshark and was able to grap a copy of the .swf file. My question more involves how to analyze or RE the file.</span>",
                    "time": null
                },
                {
                    "user": "Heisenberg",
                    "text": "<span class=\"comment-copy\">I found this video which is a helpful walkthrough - <a href=\"https://youtu.be/NySUxsWxaTo\" rel=\"nofollow noreferrer\">youtu.be/NySUxsWxaTo</a></span>",
                    "time": null
                }
            ]
        }
    ]
}