{
    "title": "Where to find a hard crackme [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/1539/where-to-find-a-hard-crackme",
    "content": "As it currently stands, this question is not a good fit for our Q&A format. We expect answers to be supported by facts, references, or expertise, but this question will likely solicit debate, arguments, polling, or extended discussion. If you feel that this question can be improved and possibly reopened, visit the help center for guidance.\n                                \n                            \n\n\n\nClosed 12 years ago.\n\n\n\nI'd like to improve my skill as a reverse engineer. And thus I am looking for a location to find these.\n",
    "votes": "0",
    "answers": 4,
    "views": "3k",
    "tags": [
        "obfuscation",
        "unpacking",
        "crackme"
    ],
    "user": "user1636717",
    "time": "12 years ago",
    "comments": [
        {
            "user": "Gilles 'SO- stop being evil'",
            "text": "Welcome to Stack Exchange. This is a questions and answers site. This “question” is a request for recommendations that doesn't fit the format of the site: it cries for a list of links, not for answers — and a list of links is what you've been getting. Stack Exchange is for questions like “I'm trying to reverse this crackme, and I tried techniques A and B but they produced this strange result, what does it mean?”. Please read our faq for generic advice.\n",
            "time": null
        },
        {
            "user": "amccormack",
            "text": "We can add suggested crackme websites to the new crackme tag-wiki.  But if you add some criteria (language, platform) and some particular challenges (anti-debug, VM-aware, IDT hooking), this could be considered a more legitimate question\n",
            "time": null
        },
        {
            "user": "user1636717",
            "text": "I'm actually pretty happy with the answers. I dont see how this question is any different to somebody asking about what are the state of art tools to do this or that.\n",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "Asking for a tool with specific requirements can have a single or more definitive answers which can be objectively evaluated on the basis of the specified requirements. Asking for a \"hard\" problem is impossible to answer by everybody other than yourself because of the fundamental question; What is \"hard\" ? Something that may be hard for you may be easy for another. There is no way to objectively evaluate the answers.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Here is a just closed reverse engineering challenge that was posted by Halvar Flake:\nhttp://addxorrol.blogspot.kr/2013/01/encouraging-female-reverse-engineers.html\nThe winner and a link to her very detailed and well written report is linked on this page:\nhttp://addxorrol.blogspot.kr/2013/03/congratulations-marion.html\nThis is much more difficult than most crackme's that I have encountered and is an example of a complex and obfuscated piece of Windows malware.\n",
            "votes": "3",
            "user": "Mick",
            "time": "Apr 3, 2013 at 18:10",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "Also you should check http://crackmes.de/ They have a huge list that you can sort by difficulty.\n",
            "votes": "7",
            "user": "tnc",
            "time": "Apr 3, 2013 at 14:53",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "open an account if you don't already have at forum.tuts4you.com, then browse to http://forum.tuts4you.com/forum/37-crackmes-unpackmes-keygenmes/ I believe that you will find many that you will like.\n",
            "votes": "6",
            "user": "Nicolas",
            "time": "Apr 3, 2013 at 14:30",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Along with the crackmes and tuts4u sites some conferences have reverse engineering challenges. They are typically harder than the average crackmes. AthCon recently put up a challenge. Here's a link to the zip if you are interested. I haven't personally done the challenge myself, so I don't know the skill level.\n",
            "votes": "1",
            "user": "alexanderh",
            "time": "Apr 3, 2013 at 17:11",
            "is_accepted": false,
            "comments": []
        }
    ]
}