{
    "title": "Understanding the variables in stack layout",
    "link": "https://reverseengineering.stackexchange.com/questions/15497/understanding-the-variables-in-stack-layout",
    "content": "i am reading the  \"The Grey Hat Hacking-The ethical hacker's Handbook\".The book is nice ,but there is a doubt on a particular subject.In the vulnerability analysis chapter it is trying to analyze a vulnerability using IDA-PRO.\nBut there is a twist on it.As we know stack variables are pushed right to left fashion.\nEx:function x(int x, int y, int z),so variable will push into following order \npush z\npush y\npush x\nIn the book it is saying about function name which is below\n \nFunction Format is as below:\n\nThen after that it is saying if we click any variable in IDA-PRO it will give up to below stack layout where arguments of function are passed.chek the below image\n[\nBut if we see the above picture we can see that arguments are not passed in the proper way.something mixed up .i mean to say not \"right to left\" manner, which is little bit confusing.\nAnyone have any idea, please let me know\n",
    "votes": "1",
    "answers": 1,
    "views": "714",
    "tags": [
        "ida",
        "disassembly",
        "disassemblers",
        "patch-reversing",
        "vulnerability-analysis"
    ],
    "user": "Bikash Dash",
    "time": "Jun 7, 2017 at 6:57",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "Please don't post text as image, it makes it hard to copy&paste and is not good for searching.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Look at the place where <pre><code>sprintf</code></pre> is called and you should see the arguments being pushed in the correct order.\nThe variables listed here are local variables of the function <pre><code>manage_request</code></pre> and not its arguments. They're arguments of the <pre><code>sprintf</code></pre> call but the variables themselves can be placed in whatever order the compiler decides in the stack (usually, but not always, the order they were declared in the source code).\n",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Jun 9, 2017 at 22:48",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Bikash Dash",
                    "text": "<span class=\"comment-copy\">Yeah you are right.They are already declared on the stack during local variables of manage_request.I just missed it.</span>",
                    "time": null
                }
            ]
        }
    ]
}