{
    "title": "How do people typically RE large binaries with lots of threads and imports? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/15584/how-do-people-typically-re-large-binaries-with-lots-of-threads-and-imports",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 7 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nIf you have a 40MB PE that has a lot of dynamic third-party imports and threads how do you typically see what it's doing without manually documenting every routine and then tracking thread creation? Using IDA Pro or OllyDbg.\nI've seen people RE such binaries inside a five-hour sitting even where it had some custom obfuscation..\n",
    "votes": "-1",
    "answers": 1,
    "views": "559",
    "tags": [
        "thread"
    ],
    "user": "user1276423",
    "time": "7 years ago",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "there's no magic solution. just work through it. practice with small binaries first to gain experience.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "One method I tend to use (with IDA):\n\nRun the binary (without a debugger).\nAttach to it.\nTake a memory snapshot.\nKill the process (from the debugger).\nRe-analyse the whole database (i.e.: AnalyzeArea(MinEA(), MaxEA())).\n\nYou might need to find and rebuild IAT (Import Address Table). For this purpose, the IDC script \"renimp.idc\" comes handy.\nAfter doing the previous steps, hopefully, you will have a database without the initial compression/obfuscation layers with most/all function calls resolved.\nMy 2 cents.\n",
            "votes": "1",
            "user": "joxeankoret",
            "time": "Jun 19, 2017 at 8:30",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user1276423",
                    "text": "<span class=\"comment-copy\">It was more of a question of actually reversing the binary to see what it does with all the threads and imports without documenting every routine. I currently document routines statically then do dynamic and break on thread creation.  I see other people navigate large binaries in a third of the time to do things like figure out file formats and crypto keys across dozens of threads.</span>",
                    "time": null
                },
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">You can run a tool like SysInternal's Process Monitor or use a sandbox like Cuckoo Sandbox to see what is it doing, etc... However, there is no magic way to determine what a huge binary does without actually digging into it and documenting what it does. There are scripts and plugins for IDA for detecting usual encryption methods, you can find some known APIs to try determine what is it doing, etc... But is not enough, usually.</span>",
                    "time": null
                },
                {
                    "user": "user1276423",
                    "text": "<span class=\"comment-copy\">I seen a person once do a larger windows PE than I described from Linux using IDA and a VM, and they made tools for the custom file formats and encryption inside a couple days. It seems there are more efficient methods than static documenting then doing runtime and referencing notes on thread and buffer BP  I'm not a fan of the sandbox logging method a lot of malware researchers use.. It's worthless for learning file formats or static encryption..</span>",
                    "time": null
                },
                {
                    "user": "Vitaly Osipov",
                    "text": "<span class=\"comment-copy\">@user1276423 perhaps ask that superman person then.</span>",
                    "time": null
                }
            ]
        }
    ]
}