{
    "title": "IDA Pro Graph question",
    "link": "https://reverseengineering.stackexchange.com/questions/15847/ida-pro-graph-question",
    "content": "I was wondering if anyone could help me and explain how I should process a graph that looks like this in IDA Pro, where the right most node is the entrypoint, and it contains several of these small function chunks to its left. does it mean that function has multiple entry points? (the cross-references from the noes seem to indicate that). How is this translated into a high level language?\n (pseudocode).\n",
    "votes": "0",
    "answers": 2,
    "views": "911",
    "tags": [
        "ida",
        "control-flow-graph"
    ],
    "user": "gandolf",
    "time": "Jul 18, 2017 at 2:37",
    "comments": [],
    "answers_data": [
        {
            "content": "It may be a result of unrecognized or misunderstood switch/case.\nPlease post all the assembly code of the function - this will probably help to locate it.\n",
            "votes": "1",
            "user": "w s",
            "time": "Jul 18, 2017 at 6:13",
            "is_accepted": false,
            "comments": [
                {
                    "user": "gandolf",
                    "text": "<span class=\"comment-copy\">Hi, you can find the relevant code in a 64bit ntdll on Windows 7 SP1 x64 fully patched. It is the function <code>tppWorkerThread()</code> if you still need me to paste the assembly somewhere I could post it in a gist. Thanks.</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">Post a gist, please.</span>",
                    "time": null
                },
                {
                    "user": "gandolf",
                    "text": "<span class=\"comment-copy\">Ok, this might take a while because the function chunks (in text view) span across several addresses and other functions. It's worst than I thought to just extract because they are not in sequential order in plain disassembly view. I may have to insist one opens up that ntdll themselves to see for themselves, but i'll see what I can do to present the  relevant assembly.</span>",
                    "time": null
                },
                {
                    "user": "w s",
                    "text": "<span class=\"comment-copy\">I found this function occasionally, and it looks completely different. Which IDA version are you working with ?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Try right-clicking and then clicking on layout graph.\nThat should fix things up, if you dont see it try moving one the windows. And it should pop up. I know this is a comment-type answer, but I cannot comment.\n",
            "votes": "0",
            "user": "Verideth",
            "time": "Jul 18, 2017 at 4:55",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Verideth",
                    "text": "<span class=\"comment-copy\">@gandolf ahh, sorry then :)</span>",
                    "time": null
                }
            ]
        }
    ]
}