{
    "title": "Sniffing https traffic of an android app",
    "link": "https://reverseengineering.stackexchange.com/questions/15935/sniffing-https-traffic-of-an-android-app",
    "content": "I want to do a challenge: automise some tasks that I do in a game so I can get the max of points.\nTo do that, I need to know the url called and the parameters that are used in the Game. After setting a genymotion station and made a proxy, I've discovered that the game won't start if the certificate doesn't match with the one that is set in the app.\nSo my question is how I can go further?\n",
    "votes": "1",
    "answers": 2,
    "views": "15k",
    "tags": [
        "android",
        "apk",
        "sniffing",
        "https-protocol"
    ],
    "user": "rsabir",
    "time": "Jul 28, 2017 at 10:06",
    "comments": [],
    "answers_data": [
        {
            "content": "If you're a Windows user, as a matter of dynamic analysis, you could try using an emulator like BlueStacks, then inspect your system network traffic with a program like Fiddler or WireShark.\nAdditionally, you could use a program like Cheat Engine to open the BlueStacks process and scan its memory for strings related to URLs. As an aside, you could statically analyze the APK by unpacking/decompressing it, then comb through its files looking for relevant strings.\nBack to Cheat Engine, you could ultimately write a script in Assembly or Lua to automate certain tasks--or you could just change certain values in memory if there is weak server validation (or none at all).\nPerhaps a significantly easier solution all around is to use something like AutoIt, which would allow you to script mouse movements and keystrokes. At that rate, all you have to do is install the game in the emulator, then script whatever process(es) you need to script for automation.\n",
            "votes": "1",
            "user": "dsasmblr",
            "time": "Jul 28, 2017 at 15:52",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Anteino",
                    "text": "<span class=\"comment-copy\">Would you recommend using the emulator from the android sdk instead of bluestacks? I'm doing a similar project but the specific app does not run on bluestacks.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "If you can emulate the application, you could try to look at the hooking method :) for example take a look to:\n\nxposed framework -  a simple example - and another\nfrida - It’s a dynamic code instrumentation toolkit\n\nXposed Framework requires root access to install.\nAlso Frida require a rooted phone.\nThen you can edit for example the parameters of the function which controls the certificate\n",
            "votes": "0",
            "user": "invictus85",
            "time": "Jul 28, 2017 at 14:42",
            "is_accepted": false,
            "comments": [
                {
                    "user": "rsabir",
                    "text": "<span class=\"comment-copy\">Is your suggestions work for an app that is downloaded from the play store?</span>",
                    "time": null
                },
                {
                    "user": "invictus85",
                    "text": "<span class=\"comment-copy\">Yes, if you are able to emulate it, otherwise you need a rooted phone</span>",
                    "time": null
                },
                {
                    "user": "invictus85",
                    "text": "<span class=\"comment-copy\">Try to look this <a href=\"http://repo.xposed.info/module/kmod.xposed\" rel=\"nofollow noreferrer\">repo.xposed.info/module/kmod.xposed</a></span>",
                    "time": null
                }
            ]
        }
    ]
}