{
    "title": "How to bypass or block GetSystemTime?",
    "link": "https://reverseengineering.stackexchange.com/questions/15933/how-to-bypass-or-block-getsystemtime",
    "content": "I have a DLL that call <pre><code>GetSystemTimeAsFileTime</code></pre> and set it for check time to prevent program runing\nNow I want to replace it with fixed date and time for example 07/25/2017 instead of real and dynamic time \nIs this possible ?\nScreenshot\n",
    "votes": "1",
    "answers": 2,
    "views": "1k",
    "tags": [
        "ida",
        "ollydbg"
    ],
    "user": "sIiiS",
    "time": "Jul 28, 2017 at 18:23",
    "comments": [
        {
            "user": "blabb",
            "text": "uninformed.org/index.cgi?v=7&a=2&p=5\n",
            "time": null
        },
        {
            "user": "sIiiS",
            "text": "How this link can help me?\n",
            "time": null
        },
        {
            "user": "blabb",
            "text": "you are looking at gs cookie generation .  it is a standard api every application that was compiled in windows post  vc2010 will have this  .   the cookie generation procedure is described i the link  .  you should be looking elsewhere not here for why your program is being blocked  .\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I'm going to reply to this without making any assumptions. I have had to do this very thing before for a client regarding non-copyrighted abandonware. Your results may vary.\nAs for your specific question, yes, it's possible, but probably not the most optimal (or easiest) solution for what you want to achieve. Regardless, consider the following, bearing in mind that these are just potential solutions:\n1. Read into codecaves. This very common technique avails you the memory and functionality to craft, inject, redirect, and execute custom code you write.\n2. Trace the execution of that routine. Note any values of interest to you that are residing in registers and/or on the stack, especially return values from <pre><code>call</code></pre> instructions. Depending on what you find, you can create an injection that only modifies existing bytes.\nFor instance, perhaps the bytes from <pre><code>1009A467</code></pre>-<pre><code>1009A474</code></pre> are enough to create a custom <pre><code>mov</code></pre> instruction that puts a value you want into <pre><code>eax</code></pre> prior to the <pre><code>mov</code></pre> instruction at <pre><code>1009A477</code></pre>.\nOr, if you've studied that bit of code enough, perhaps there's something in another register that you can specify at <pre><code>1009A477</code></pre>, i.e. <pre><code>mov [ebp+var_4], ebx</code></pre> or <pre><code>mov [ebp+var_4], edx</code></pre>, etc.\n3. What happens if you <pre><code>nop</code></pre> the two <pre><code>jz</code></pre> instructions? See how they both jump to that segment of code at <pre><code>loc_1009A467</code></pre>? Note that there may be unintended results like instantly triggering the end of a trial period or corrupting data. This is when it can help to monitor the footprint of an application when installing it so you can identify how it maintains persistence with functionality like activation. Maybe it's a temp file, a registry key, or something else.\nFinally, the two <pre><code>and</code></pre> instructions you're pointing to at <pre><code>1009A442</code></pre> and <pre><code>1009A446</code></pre> are zeroing the memory addresses being referenced at <pre><code>[ebp+offsets]</code></pre>, respectively. This is just setting them up for use somewhere afterward. Anything you <pre><code>and</code></pre> with 0 will equal 0. It's a common method in Assembly for clearing a register, as is when you <pre><code>xor</code></pre> a register with itself, i.e. <pre><code>xor eax, eax</code></pre>. You can read more about the binary operation <pre><code>and</code></pre> here.\n",
            "votes": "3",
            "user": "dsasmblr",
            "time": "Jul 28, 2017 at 14:34",
            "is_accepted": false,
            "comments": [
                {
                    "user": "sIiiS",
                    "text": "<span class=\"comment-copy\">new image with full view added. hope it help more to understand..</span>",
                    "time": null
                },
                {
                    "user": "sIiiS",
                    "text": "<span class=\"comment-copy\">Unfortunately, none of you method works!</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Here is an example for you.\nA friend and I made this a long time ago, to bypass trial on a certain program (not naming it). It modifies the value that <pre><code>GetSystemTimeAsFileTime</code></pre> returned.\nGetSystemTimeAsFileTime Hotpatch\n",
            "votes": "-1",
            "user": "Mithical",
            "time": "Jul 30, 2017 at 13:43",
            "is_accepted": false,
            "comments": [
                {
                    "user": "sIiiS",
                    "text": "<span class=\"comment-copy\">Thank you for your reply and code but really I don't know how can I use this code in the DLL?! Can you please explain more?</span>",
                    "time": null
                },
                {
                    "user": "fyyre",
                    "text": "<span class=\"comment-copy\">You want to modify GetSystemTimeAsFileTime, so the date does not change, yes?  One way to do this; hooking GetSystemTimeAsFileTime itself, so you control the values it returns.  My DLL example, does just this, simply compile it with Visual C++ and attach it to the Import table of application, with a tool such as CFF_Explorer.</span>",
                    "time": null
                },
                {
                    "user": "fyyre",
                    "text": "<span class=\"comment-copy\">See the void WINAPI GetSystemTimeAsFileTimeFake(PFILETIME fileTime) function of my DLL for how to set a fixed date.</span>",
                    "time": null
                },
                {
                    "user": "sIiiS",
                    "text": "<span class=\"comment-copy\">I want to set date&amp;time for example 04/25/2017 instead of the date of today... I have not an application, this is a DLL file that control php file for time expiration</span>",
                    "time": null
                },
                {
                    "user": "fyyre",
                    "text": "<span class=\"comment-copy\">Again, look at the example in my code \"GetSystemTimeAsFileTimeFake\".  Setting wDay = 27;  wMonth = 4;  wYear = 2017; should accomplish what you needed.</span>",
                    "time": null
                }
            ]
        }
    ]
}