{
    "title": "Windows API reference for OllyDbg",
    "link": "https://reverseengineering.stackexchange.com/questions/1603/windows-api-reference-for-ollydbg",
    "content": "There is an old help file containing Windows API I used few years ago with ollydebug, which can jump to the appropriate help page of function when double clicking on the function in the disassembly window.\nIs there a more recent reference like this which includes also Windows 7 library calls ?\nI managed to find an online reference in Microsoft website but a local file is much easier to work with...\n",
    "votes": "10",
    "answers": 3,
    "views": "6k",
    "tags": [
        "winapi",
        "ollydbg"
    ],
    "user": "Mellowcandle",
    "time": "Apr 5, 2013 at 19:32",
    "comments": [],
    "answers_data": [
        {
            "content": "If you are using OllyDbg 1.x, you could use the MSDN Help Plugin which simply looks up the requested API call on MSDN. It works for me on my Windows XP sp3 system with OllyDbg 1.x.\nOf course, this requires internet connectivity.\nAnother incomplete option that may work is to obtain the Windows 7 SDK and be sure to install the \"Documentation / Win32 and COM\" sub feature.\nThen copy all the *.HXS files from the SDK install folder. Then the only task left is to find a way to convert *.HXS files into a single *.HLP file....not sure if that's possible or not.\nFWIW, the IDA Scope plugin (for IDA Pro) recommends this in their manual for integrating offline MSDN help. Except their instructions have the user extract the HXS files to a folder and point IDA Scope to it where IDA Scope knows how to read/parse the files extracted from the HXS files. The HXS files can be deleted after extracting.\n",
            "votes": "7",
            "user": "Mick",
            "time": "Apr 5, 2013 at 13:57",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Mellowcandle",
                    "text": "<span class=\"comment-copy\">MSDN plugin is an excellent solution for me, thanks.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Is this something You looking for?\nWin32api and x86 Opcodes\n",
            "votes": "4",
            "user": "Denis Laskov",
            "time": "Apr 5, 2013 at 13:00",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Not up-to-date, though. And wouldn't be. But the new help systems also would allow for integration, probably the OllyDbg author simply hasn't done it.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I'd recommend installing the Windows SDK documentation and the Driver Development Kit if you don't have them already. It might seem like overkill but it's extremely helpful to have both of these documentation kits locally. \nA word of caution when installing the Windows SDK documentation. Microsoft removed dexplore.exe (viewer) in the Windows 7 2010 SDK update. It now relies on the default browser and the documentation has to be pre-configured and downloaded. The new viewing option feels much slower than dexplorer.exe. I have the Windows XP SDK and the Windows 7 SDK documentation installed because I prefer dexplorer.exe\n",
            "votes": "4",
            "user": "alexanderh",
            "time": "Apr 5, 2013 at 14:11",
            "is_accepted": false,
            "comments": []
        }
    ]
}