{
    "title": "How to make radare2 work for a large binary?",
    "link": "https://reverseengineering.stackexchange.com/questions/16112/how-to-make-radare2-work-for-a-large-binary",
    "content": "I compiled cpython with debugging headers and I want to perform the following analysis using radare2. \nThe problem I encounter is that it takes forever (at least 27 hours) to perform the <pre><code>aaa</code></pre> (analysis) part.\n",
    "votes": "11",
    "answers": 1,
    "views": "6k",
    "tags": [
        "binary-analysis",
        "radare2"
    ],
    "user": "0x90",
    "time": "Nov 13, 2017 at 15:11",
    "comments": [],
    "answers_data": [
        {
            "content": "It is not a good practice to run full analysis of your binary at the startup and it also isn't encourged by radare. Running <pre><code>aaa</code></pre> by default is a heavy action and absolutely not recommended or needed in most of the cases.\nAs stated in this execllent post from radare's blog:  \n\nCode analysis is not a quick operation, and not even predictable or taking a linear time to be processed. This makes starting times pretty heavy, compared to just loading the headers and strings information like it’s done by default.\n  ...\n  We enforce users to think about their workflows in order to better understand the problem they are facing and solve it in an optimal way, saving cpu, memory and why not: cats.\n\nTo make the analysis process more efficient you can start with configuring different analysis configuration variables in radare. These configuration variables can help you to fit the analysis process to your program and to your needs. Some of the interesting variables are:  \n<pre><code>anal.afterjmp  \nanal.depth  \nanal.eobjmp  \nanal.esil  \nanal.hasnext  \nanal.nopskip  \nanal.from\nanal.to\n</code></pre>\nSee the <pre><code>e??anal.</code></pre> command to get more detailed descriptions for them. \nAnalysis of a program isn't just performing one action and that's it -- it is combined from different analysis for different needs.\nradare implements many different commands that perform different kind of analysis. Smart use of these command can help you quick the process of the analysis and analyze only the parts which you believe are the most important:\n\nFind functions by prelude instructions (<pre><code>aap</code></pre>)    \nIdentify functions by following calls (<pre><code>aac</code></pre>)    \nDetect jump tables and pointers to code section (<pre><code>/V</code></pre>)     \nAnalyze opcode absolute and relative references (<pre><code>aa\\r</code></pre>)     \nFind code/data/string references to a specific address (<pre><code>/r</code></pre>)    \nEmulate code to identify new pointer references (<pre><code>aae</code></pre>)\nUse binary header information to find public functions (<pre><code>aas</code></pre>)\nAssume functions are consecutive (<pre><code>aat</code></pre>)\n\nTo sums it up, you should think and plan the analysis process that fits best to your needs:\n\nradare2 is not a click-and-run program, it’s a set of orthogonal tools and commands that allows you to understand, analyze, manipulate and play with a large list of binary types... Only experience and understanding will give you control on what you are doing.\n\nIf after reading this answer and the post in radare's blog you believe its a bug and you can point at the problem, feel free to open an issue on github.\n",
            "votes": "24",
            "user": "mrexodia",
            "time": "Aug 19, 2017 at 11:33",
            "is_accepted": true,
            "comments": [
                {
                    "user": "newlog",
                    "text": "<span class=\"comment-copy\">Given that this answer was set to correct, it would be interesting to know what analysis switches did you use to analyze that binary specifically and how much time it took.</span>",
                    "time": null
                }
            ]
        }
    ]
}