{
    "title": "How to extract contents from this .DIG file?",
    "link": "https://reverseengineering.stackexchange.com/questions/16198/how-to-extract-contents-from-this-dig-file",
    "content": "I have this .DIG file from a PS2 game:\nhttps://drive.google.com/open?id=0B8-7FMP3lW8cU3NqUmNUcWdhcEk\nApparently, it should contain most of the game data, except cutscene movies and voiceovers, which are stored in different files. I could identify and extract audio with the IECS header from it. But how do I extract the rest? I'm particularly interested in textures, and above all, the dialogue files.\n",
    "votes": "0",
    "answers": 1,
    "views": "432",
    "tags": [
        "file-format"
    ],
    "user": "Irene",
    "time": "Aug 27, 2017 at 19:01",
    "comments": [],
    "answers_data": [
        {
            "content": "See my answer to this question. There, I note two primary forums dedicated to reversing file formats: XeNTaX and ZenHAX. If there aren't already .DIG scripts therein, you can sign up and inquire in the appropriate forum on each site, respectively. You can also try Googling for something like QuickBMS .DIG PS2 or MultiEx .DIG PS2 (QuickBMS and MultiEx are scripting tools supported via the ZenHAX and XeNTaX forums). In doing so myself, here and here are results you may find of interest.\n",
            "votes": "2",
            "user": "dsasmblr",
            "time": "Aug 29, 2017 at 15:12",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Irene",
                    "text": "<span class=\"comment-copy\">Thank you. I checked that script. Unfortunately, most of the extracted content consists of .raw files with an unknown compression algorithm, so I don't know how to proceed from there. The .raw files begin with 00 05. For example, this small one:</span>",
                    "time": null
                },
                {
                    "user": "Irene",
                    "text": "<span class=\"comment-copy\">00 05 40 0C 08 10 00 04 80 03 02 4C 04 D8 E2 C8  91 01 A0 01 06 60 0A 30 00 7C 80 01 08 02 3C 72  E4 C8 91 23 47 8E 1C 39 72 E4 88 80 80 01 8E 10  D0 77 49 20 C0 00 14 01 16 40 0A B0 40 86 11 8B  44 40 08 08 A0 20 40 10 01 17 18 04 18 21 C2 88  FF FF 0F 02 5C F3 1F 00 43 80 FB 7E 1D 38 70 E0  40 00  Ring any bells? The only files that can be identified are the audio ones, with the IECS header. The rest is like this.</span>",
                    "time": null
                },
                {
                    "user": "dsasmblr",
                    "text": "<span class=\"comment-copy\">I recommend registering and inquiring on one (or both) of those two forums--in those related threads I linked, perhaps. Both communities are usually pretty good about responding and are far more in-tune with the minutiae of reversing file formats than I am.</span>",
                    "time": null
                }
            ]
        }
    ]
}