{
    "title": "Slow kernel dbg with VirtualBox and WinDBG",
    "link": "https://reverseengineering.stackexchange.com/questions/16209/slow-kernel-dbg-with-virtualbox-and-windbg",
    "content": "I am trying to do windows kernel debugging with VirtualBox and WinDBG. But every time I hit a breakpoint the virtual machine CPU usage skyrockets and the CPU registers do not show up in WinDBG. Am I doing something wrong?\nWhat I have done:\n\nIn <pre><code>boot.ini</code></pre> I set <pre><code>/debugport=COM1 /baudrate=115200</code></pre>;\nIn VirtualBox I forwarded <pre><code>COM1</code></pre> to a named pipe <pre><code>\\\\.\\pipe\\debug</code></pre>;\nIn WinDBG File > <pre><code>Kernel Debug...</code></pre> > <pre><code>COM</code></pre> tab: Ticked the \"Pipe\" check box, and for the <pre><code>Port = \\\\\\\\.\\pipe\\debug</code></pre>;\n\nIn WinDBG the debug session is found, and I can hit breakpoints, I can step through code, I can see the disassembled code in the \"Disassembly window\", and I can view memory locations in the \"Memory window\". But nothing shows up in WinDBG \"Registers window\".\nThe Host OS is Windows 10 and for the Virtual Guest OS i tried both Windows XP and Windows 7 both have the same issue.\nI am really not sure where to look for answers to this issue, could anyone point me in the right direction ?\nFor anyone else having this issue or trying to learn kernel debugging i used parts from the following tutorials to get to where I am so far:\n\nWindows Kernel Debugging Tips (Virtualbox documentation);\nHow to configure WinDbg for kernel debugging (blogpost).\n",
    "votes": "3",
    "answers": 2,
    "views": "2k",
    "tags": [
        "debugging",
        "windbg",
        "virtual-machines",
        "kernel"
    ],
    "user": "ResQue",
    "time": "Aug 29, 2017 at 11:45",
    "comments": [
        {
            "user": "conio",
            "text": "Not sure where to look? First try another virtualization software to pin-point the blame.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You should try VirtualKD which uses a fast VM-specific mechanism to communicate with the debugger instead of slow serial port emulation. Another option could be Ethernet or USB-based debugging but I'm not sure how to set it up with VMs...\n",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Aug 29, 2017 at 8:02",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">The better answer of the two. Hope this one gets accepted.</span>",
                    "time": null
                },
                {
                    "user": "conio",
                    "text": "<span class=\"comment-copy\">Ethernet-based - the same way you set it up with physical computers, but it requires newer target Windows versions than OP said he used.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Fixed the issue this was a two part problem.\n\nAvast anti virus was slowing down the VM to a crawl\nsolution uninstall avast or in some cases DISABLE the option: Settings > Troubleshooting > \"Enable hardware assisted visualization\"\nThere is a bug in newer versions of WinDBG when debugging older versions of windows\nsolution use an older version of WinDBG, or use the WinDBG command \"r\" to view the cpu registers rather than using the \"Registers window\", or use a WinDBG plugin to fix the issue\nhttps://stackoverflow.com/questions/35961246/windbg-not-showing-register-values\n",
            "votes": "2",
            "user": "ResQue",
            "time": "Aug 29, 2017 at 10:19",
            "is_accepted": true,
            "comments": []
        }
    ]
}