{
    "title": "What does NtSetInformationKey do in the Windows Native API? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/16210/what-does-ntsetinformationkey-do-in-the-windows-native-api",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions on software development are off-topic here, but can be asked on Stack Overflow.\n\n\nClosed 7 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nProcMon lists <pre><code>RegSetInfoKey</code></pre> as an \"operation\" on the registry. Process Monitor operations do not necessarily map directly to Native symbols, however, it seems that this operation uses NtSetInformationKey. When we examine that function though, we see that it has a parameter: <pre><code>IN KEY_SET_INFORMATION_CLASS InformationClass</code></pre>. Finally, undocumented.ntinternals.net states:\n\nCurrently only KEY_WRITE_TIME_INFORMATION is supported.\n\nWhen we look up KEY_WRITE_TIME_INFORMATION, the definition is just a simple data structure which stores the last write time to the registry key. So the question then becomes, when ProcMon displays a last write time, but no RegSetKey or other write occurs, what is the purpose for setting this value and is a simple write to this member what is actually occurring?\n",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "windows"
    ],
    "user": "the_endian",
    "time": "7 years ago",
    "comments": [
        {
            "user": "the_endian",
            "text": "@Igor Well I asked this from a reverse-engineering standpoint. I am not trying to use this function as a software developer and I worry that if I ask on SO, they will also close it because my intentions are reverse-engineering here. What do you think?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "As simple as it may sounds - calling <pre><code>NtSetInformationKey</code></pre> with the class <pre><code>KEY_WRITE_TIME_INFORMATION</code></pre> is simply used to modify the time a key was last modified.\nThe reason depends of context, but I can guess a couple:\n\nA malware wants to make sure a user investigating that registry will think it was there since a different time (either it was always there to make it look benign or it was just written to make a detected infection seem very new).\nA program uses the time as a \"last update\", and occasionally needs to modify it manually to fit some business logic.\n\nYou should use your imagination or whatever else you know about the program you're investigating to make up other reasons, it's fun! :D\n",
            "votes": "1",
            "user": "NirIzr",
            "time": "Aug 29, 2017 at 7:24",
            "is_accepted": false,
            "comments": []
        }
    ]
}