{
    "title": "How to see what data is being transmitted when an application calls home?",
    "link": "https://reverseengineering.stackexchange.com/questions/1628/how-to-see-what-data-is-being-transmitted-when-an-application-calls-home",
    "content": "Always wondered how it would be possible to see what data is being transmitted back and forth with an application that calls home.\nLet's say we emulate the server via host file redirect. Would it be possible to see what requests are being made by the application?\nAlso is it possible at all to intercept the response(and view data) from the real server before it reaches the application?\n",
    "votes": "15",
    "answers": 7,
    "views": "11k",
    "tags": [
        "tools",
        "windows",
        "security",
        "php",
        "serial-communication"
    ],
    "user": "GuYY",
    "time": "Apr 6, 2013 at 13:57",
    "comments": [
        {
            "user": "RobotHumans",
            "text": "Everything here seems to be HTTP inspection related.  For more custom protocols, you could hook ws32.recv and ws32.send respectively as well.  I don't think it's a full on answer, but it's an option that bears noting I think.\n",
            "time": null
        },
        {
            "user": "Jonathon Reinhart",
            "text": "@CallmeV I don't see anything HTTP-specific in the question or answers.\n",
            "time": null
        },
        {
            "user": "RobotHumans",
            "text": "@JonathonReinhart - clarification: many of the answers refer to mostly web proxies\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You may capture the traffic with packet sniffer to capture all the communications of client\\server application, or You may use reverse proxy to intercept and alter data in real time.\nIn simple words, network sniffers allow You to see data flow between client and server, analyse it and reverse the protocol communications\nReverse proxy intercept communication between client and server, allow alter the requests and re-send them, manipulate and examine in real time.\nNetwork sniffers:\nWireShark \ntcpdump\nWinDump\nReverse Proxy:\nZAP (OWASP Project)\nVulture\nBurp Proxy\nFiddler (most recommended for Web\\malware analysis)\nYou may see samples of successful use of such technique here:\nIntercepting Blackberry Application Traffic \nIntercepting SSL traffic using WebScarab \niOS data interception\n",
            "votes": "19",
            "user": "Denis Laskov",
            "time": "Apr 6, 2013 at 14:22",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "There are a couple of ways that come to mind. The first would be to use a network packet analyzer on the actual client running the application. Some well known packet analyzers are Wireshark, tcpdump, and even Microsoft Network Monitor.\nAnother alternative would be to intercept the traffic via man-in-the-middle (M. The easiest way to do this (if you control the client) is to turn your Linux based laptop into a wireless access point, and intercept the client's traffic, analyze it, and route it to the internet. This will require 2 network cards, at least one of them being a wireless card.\nHere's a tutorial to get you started on performing a mitm attack in this manner:\nhttp://www.backtrack-linux.org/forums/showthread.php?t=1939\nOr mitmproxy is another great tool to accomplish this (and they support SSL), and have lots of examples on their website.\n",
            "votes": "7",
            "user": "Mick",
            "time": "Apr 6, 2013 at 14:00",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Just before posting this answer I realized he's asking how to do this on windows and my answers is for Mac. I'm posting it regardless because I believe it might be useful for others trying to perform the same thing but then using a Mac\nIf you're using a Mac, then it's really easy by the combination of a Remote Virtual Interface (rvi) and Wireshark. Note that this does not work if your application uses HTTP/SSL, in that case do what @MickGrove suggests and perform a MITM.  \nAssume you do have a mac, try this:\n\nConnect your phone/ipad/ipod via USB\nGo to system information (use Spotlight or via Apple Logo -> about this mac) and under hardware->USB  find your iphone and copy the Serial Number (it's a long hex number)\nOpen a terminal and type <pre><code>rvictl -s <serialnumber></code></pre> This will create a network interface called rvi0.\nOpen wireshark and start sniffing on rvi0\nOnce done type <pre><code>rvictl -x <serialnumber></code></pre> to remove the interface\n",
            "votes": "5",
            "user": "ixje",
            "time": "Apr 6, 2013 at 14:22",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "If the network traffic is in \"plain text\" (not encrypted) then a network sniffer such as Wireshark is ideal.\nIf the network traffic is encrypted via SSL but you have the private key (or if the client application does not validate the server's public key) then you can use a proxy such as Burp.\nIf the network traffic is encrypted via SSL and you don't have the private key readily available and the client validates the server's public key then you can use a program such as Echo Mirage, which hooks Winsock's send and receive functions, thus giving you access to the plain text before it's encrypted and after it's decrypted.\nAlternatively, if network traffic is encrypted using something other than SSL then you'd need to reverse engineer the client software to determine how the encryption and decryption are performed. Your best bet would be to find cross-references to Winsock's send and receive functions and determine how the client encrypts the data before sending it and decrypts it after receiving it.\n",
            "votes": "5",
            "user": "Jason Geffner",
            "time": "Apr 9, 2013 at 1:48",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Another option that's pointed out in the comments above by @CallMeV is to use hooking.  On Windows you may look at using EasyHook.\n",
            "votes": "4",
            "user": "mrduclaw",
            "time": "Apr 9, 2013 at 6:51",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "You can add the HTTP proxy Fiddler to the list if they use a HTTP protocol\n",
            "votes": "1",
            "user": "rslite",
            "time": "Apr 6, 2013 at 14:11",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Well, do you know what is the IP address or domain which the malware is trying to call home?\nIf you do, you can try changing the hosts file located at <pre><code>%systemroot%\\system32\\drivers\\etc\\</code></pre>. That way, it won't be able to call home.\nThen use Wireshark to sniff the traffic.\nOnce you know the IP address and the port number, you can use the filters to make it more appeasing to the eyes and easier to find the information that you require.\n",
            "votes": "0",
            "user": "Igor Skochinsky",
            "time": "Apr 7, 2013 at 15:32",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">A better method would be a transparent proxy which also intercepts the DNS queries. I am aware of such systems that have been used at the anti-malware company for which I work. It was proprietary, however.</span>",
                    "time": null
                },
                {
                    "user": "Gilles 'SO- stop being evil'",
                    "text": "<span class=\"comment-copy\">I wouldn't do this with malware: you aren't preventing it from phoning home unless you're absolutely sure it won't contact other hosts than the one you blocked (and if it tries IP addresses, changing <code>hosts</code> won't help a bit). And this isn't a very useful approach anyway, since preventing the application from phoning home is likely to inhibit the interesting behaviors you're trying to observe — if it can't initiate the connection, there won't be any traffic to sniff.</span>",
                    "time": null
                }
            ]
        }
    ]
}