{
    "title": "Need help reversing an Android Game",
    "link": "https://reverseengineering.stackexchange.com/questions/16292/need-help-reversing-an-android-game",
    "content": "I am trying to find the portion of code in an android game that is responsible for the main logic of the game. (e.g Calculating damage when shooting the zombie) The game is obviously using native code and the whole app consists of 2 files, a standard apk file and an obb file. After searching the smali code and to no avail, I tried disassembling the .so files in the lib folder of the apk file using IDA Pro but they seem to be libraries rather than code written by the developer.On the other file, the obb seems to contain mainly the resources and a few dlls which seem to be libraries too. Where would an android game developer using JNI place the main logic of their game at?\nUpdate:I also noticed that the game uses the Unity engine so I see files like libunity.so\nUpdate: In my lib folder,I have the files libAnalytics.so, libApp.so, libmain.so, libmono.so,libnat.so,libunity.so . It seems like libmain.so contains the main logic due to the presence of function names such as ANativeActivity_onCreate but it only has 6 such functions with such names so I'm not too sure.\n",
    "votes": "0",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "android",
        "apk",
        "shared-object"
    ],
    "user": "Lew Wei Hao",
    "time": "Sep 7, 2017 at 15:47",
    "comments": [
        {
            "user": "Antimony",
            "text": "\"but it only has 6 such functions with such names so I'm not too sure.\" -> Note that only functions exposed via JNI need symbols like that. Functions internal to the .do don't need symbols.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Unity games are scripted in C#. Check the <pre><code>Managed</code></pre> folder in the APK file, patch <pre><code>Assembly-CSharp.dll</code></pre> and enjoy your cheat until you get banned.\n",
            "votes": "2",
            "user": "MazeGen",
            "time": "Sep 17, 2017 at 20:24",
            "is_accepted": false,
            "comments": [
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">I \"guess\" he's asking for help to cheat in a local game. If he is asking for help to cheat in on-line games using a profile with his, supposedly, full name and picture of him... Well, in that case, he is not bright.</span>",
                    "time": null
                }
            ]
        }
    ]
}