{
    "title": "decrypting a microSD [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/16294/decrypting-a-microsd",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 7 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\na micro sd has been encrypted by a device, i have a backup of the encryption key (*.pk5), but the encryption device has been destroyed. any suggestions to decrypt the MicroSD? (except of buying a new phone)\ndevice: nokia e52\nthanks for taking the time to read this and your suggestions.\n(if this is not the right site to ask it, please let me know)\n",
    "votes": "1",
    "answers": 2,
    "views": "233",
    "tags": [
        "decryption"
    ],
    "user": "paul",
    "time": "7 years ago",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "how does the card look when you plug it in? do you see anything at all? what do you know about the encryption process?\n",
            "time": null
        },
        {
            "user": "paul",
            "text": "@IgorSkochinsky - as soon as i plug it in, i have its icon \"mSD\" on my computer and also a window asking permission about formatting the card. \"you need to format the disk in drive x: before you can use it.\"   and unfortunately, i didn't get your purpose of asking about encryption process, but i don't know anything about encryption. thanks\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Encryption is never \"by a device\", there must be some algorithm/software run by the phone's CPU. I recommend you figure out what it software does encryption/decryption and what algorithm it uses for the crypto task. Then look into that software (\"reverse-engineer\" it) and then you will be able to decrypt the card. And I agree that dumping the contents of the encrypted bitstream into a reasonably common format is a good first step on this long journey.\nReverse engineering is not a game - there is no magic solution, just sweat blood and tears.\n",
            "votes": "1",
            "user": "Vitaly Osipov",
            "time": "Sep 23, 2017 at 2:30",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Vitaly Osipov",
                    "text": "<span class=\"comment-copy\">Apologies for waxing lyrical. I have read one too many question that assume there's a hidden \"one trick\" to this hard (but rarely routine! 😊) work of reversing.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Put yours MicroSD card in linux box\nLet presume that MicroSD card is identified as device <pre><code>/dev/sdf</code></pre>, so type \n<pre><code>[ dd if=/dev/sdf of=/home/my_MicroSD_copy.img ]</code></pre>\nHaving copy of yours MicroSD you can try different tools to decrypt it. \nBe advised to try with OpenSSL. Beside OpenSSL project docs \nyou can check out ReyMii web pages to.\n",
            "votes": "0",
            "user": "NirIzr",
            "time": "Sep 10, 2017 at 13:52",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Gogeta70",
                    "text": "<span class=\"comment-copy\">@paul I'd like to just add that your microSD card is probably encrypted using a block cipher, so I would try those first. I'm not sure how old the Nokia E52 is, but AES-128-CBC and AES-256-CBC are pretty common. If you have the know-how, you can write a shell script to automate the process and then dump the first kilobyte of each \"decrypted\" image. You will probably see some identifying text in the image that is decrypted with the proper algorithm.</span>",
                    "time": null
                }
            ]
        }
    ]
}