{
    "title": "Reverse Engineering A Tely 200 Camera",
    "link": "https://reverseengineering.stackexchange.com/questions/16332/reverse-engineering-a-tely-200-camera",
    "content": "I recently got a hold of some free hardware from a company called Telylabs who had recently gone out of business. I got a Tely 200 which is an IP camera that's used for online conferences and presentations. \nUnfortunately it appears that the camera needs to phone home to Tely's servers in order to be operated but the servers were shut down along with Telylabs.\nIt seems like such a waste of good hardware so I was hoping someone here might be able to help me unlock it.\nCheers.\n",
    "votes": "0",
    "answers": 1,
    "views": "183",
    "tags": [
        "hardware"
    ],
    "user": "DavKro",
    "time": "Sep 13, 2017 at 0:24",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "What have you tried? Did you monitor the network traffic? what kind of requests is the camera sending? Provide more info!\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "These are the steps what I will do:\na.Find the debug port:   either a serial port or some RXTX port where you can write the initial program inside.\nb.Upon booting up, probe the device to see if there are any open network ports:   what are they?   is there a ssh login?   telnet? ftp etc?\nc.search online for default IP camera password.   any device which you first bought has to have a default password built into it to start the setup going - search for that?\nd.if you can bootup, and login, then it is possible that you can overwrite the existing filesystem.  if not, then may be remount as rewriteable will do.\ne.if all the options are giving you problem, identify the flash chip, desolder it, and buy a new one, reprogram it to your liking - this will depend on how the existing flash internals is designed.\nEveryone of tasks above comes with lots of online resources and challenges.   Good luck.\n",
            "votes": "1",
            "user": "Peter Teoh",
            "time": "Jan 26, 2018 at 6:01",
            "is_accepted": false,
            "comments": []
        }
    ]
}