{
    "title": "What does __CFSHL__ do?",
    "link": "https://reverseengineering.stackexchange.com/questions/16410/what-does-cfshl-do",
    "content": "<pre><code>  unsigned __int8 v2; // cf@1\nv2 = __CFSHL__(v3, 28);\n</code></pre>\nWhat does the CFSHL function mean? I can't seem to find any documentation on it.\n",
    "votes": "1",
    "answers": 1,
    "views": "861",
    "tags": [
        "ida",
        "disassembly"
    ],
    "user": "user1698144",
    "time": "Sep 25, 2017 at 16:41",
    "comments": [],
    "answers_data": [
        {
            "content": "This function usually generate a 'Carry Flag for SHift Left' operators (CFSHL).\n<pre><code>__CFSHL__(x, y) // Generate a carry flag for (x<<y)\n</code></pre>\nIn fact, when decompiling we, sometimes, loose the origin of the very-low level operations such as manipulation of carry flags. Originally, this operation must have been linked to some arithmetic operation which might have been missed by the decompiler (or optimized out). But, the manipulation of the carry bit on the <pre><code>eflags</code></pre> is still here, so to keep the semantic equivalence of the decompiled program, Hexrays' decompiler is sometimes forced to use such tricks (which appears to come from outer space even if they probably have a perfectly natural cause).\n",
            "votes": "1",
            "user": "perror",
            "time": "Sep 25, 2017 at 17:16",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user1698144",
                    "text": "<span class=\"comment-copy\">Thanks for the answer. Im a bit new to reverse engineering, and ida. So what does the operation actually do to the variables, x and y?</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">In fact, it does not touch <code>x</code> and <code>y</code>. It simply computes if the carry bit of the <code>%eflags</code> must be touched if an operation <code>x &lt;&lt; y</code> would have been performed (but without performing it). Sorry, I should have been clearer... I wrote my answer a bit too quickly. Shame on me. :-/</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">@user1698144: You still didn't get it, right ? If so, it really means that you lack a lot of background in assembly. You should learn a bit more about it.</span>",
                    "time": null
                }
            ]
        }
    ]
}