{
    "title": "OLLYdbg is stopping on 7000000 addresses on the ntdll and not the entry point of the application",
    "link": "https://reverseengineering.stackexchange.com/questions/16418/ollydbg-is-stopping-on-7000000-addresses-on-the-ntdll-and-not-the-entry-point-of",
    "content": "i am solving the leena's 4th binary challenge.but the ollydbg is unable to stop at Entry point which some around 400000 or above.Application stops working and start with some around 700000\ncheck the image below\n\nAnd if we close the application it will stop at 700000 address.check the below image\nAnd i already checked the debugged configuration of olydbg to the below setting.\nNow if anyone tell me how to solve this that would be great.And let me know if my configuration is wrong on this.I am using ollydbg v1.10\n",
    "votes": "5",
    "answers": 1,
    "views": "2k",
    "tags": [
        "disassembly",
        "ollydbg",
        "binary-analysis"
    ],
    "user": "Bikash Dash",
    "time": "Sep 26, 2017 at 16:28",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "why not try with 2.0? It looks like it correctly stops at @<pre><code>402950</code></pre>\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "OllyDbg has stopped the execution at <pre><code>ntdll!RtlUserThreadStart</code></pre>, what seems like almost the \"System Breakpoint\" which is the location where the operating system uses to break so the debugger can do its work -- but not exactly there.\nThe address which you are in is inside <pre><code>NTDLL</code></pre> and you have nothing to be afraid of being there.  \nI believe that there's a bug (or a configuration which I'm not aware of) in OllyDbg in which the program breaks in <pre><code>RtlUserThreadStart</code></pre> although your settings is set to first break on program's entry.   <pre><code>RtlUserThreadStart</code></pre> is kind of every thread's entrypoint so I wonder maybe Olly hits this-not-exactly System Breakpoint even though it is not configured to do so.  \nBoth OllyDbg v2 and x64dbg doesn't have this problem and they would break on program's entrypoint as expected, unless you configure it elsewhere.\nFor example, here's the program as it loaded on Ollydbg version 2:  \n\nAnd here's how it looks like when it configure to break on System Breakpoint:  \n\nYou can configure it by using Alt+O >> Debugging >> Start and check \"System Breakpoint\" under \"When starting application, make first pause at\".\nAs you can see, the program broke on a different address which is considered as the System Breakpoint.  \nx64dbg also breaks in this address:  \n\nYou can configure x64dbg inital breakpoints in Options >> Preferences >> Events.  \nAnyway, in your case, pressing F9 or <pre><code>Run</code></pre> in OllyDbg v1 will take you to the program's entrypoint.  \n\nI highly recommend to use x64dbg which is an active open-source project, unlike Ollydbg which is absolutely outdated.  \nHere are some resources:\n\nx64dbg main website\nThe project's Github repository \nx64dbg's documentation\n",
            "votes": "6",
            "user": "Megabeets",
            "time": "Sep 26, 2017 at 18:46",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Paweł Łukasik",
                    "text": "<span class=\"comment-copy\">+1 for recommnding x64dbg. I guess the point for using Olly is that Lena's tut contains steps to follow in Olly but probably they can be used in other tools almost 1-to-1.</span>",
                    "time": null
                },
                {
                    "user": "Dr Deo",
                    "text": "<span class=\"comment-copy\">@Megabeets How is ntdll.77B2746D translated to ntdll!RtlUserThreadStart. Thanks</span>",
                    "time": null
                }
            ]
        }
    ]
}