{
    "title": "How find all subroutine calls using Hopper?",
    "link": "https://reverseengineering.stackexchange.com/questions/16412/how-find-all-subroutine-calls-using-hopper",
    "content": "How one can find all subroutine calls once an iOS app has been load into Hopper ?\nIf I understand correctly, a subroutine is identified by a unique address. So in the binary, all calls to this subroutine should point to this address. Thus, it should be possible to list all calls to this address, am I wrong ? It seems to be a simple things to look for, yet I cannot find anything about that elsewhere.\n",
    "votes": "6",
    "answers": 2,
    "views": "2k",
    "tags": [
        "hopper"
    ],
    "user": "Hector",
    "time": "Sep 25, 2017 at 20:25",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "you title is asking one thing but the body seems to be somewhat different... some clarification may help\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "If I correctly understand your question, you are searching for the Cross References feature in Hopper.\nCross References\nCross References (or simply XREFs) is a feature of disassemblers to show you where certain functions and objects were called from or which functions and objects are used by a specific function. We can simplify it by relate to it as XREF-To and XREF-From. The referenced can be either Data or Code.\nXREFs are a valuable resource when we want to figure out exactly where a function was called from or what functions the current function calls. This, as you understand, can be quite useful, so we don’t have to iterate the stack for frame pointers to look for the function that called the current function or alternatively searching by hand for a CALLs to specific addresses.\nHopper\nIn hopper disassembler you can can see XREFs-To addresses by pressing X while you mark the desired address. XREFs-From can be shown using Alt+X. Alternatively you can find the Cross References lists under <pre><code>Navigate</code></pre> in the Hopper's top toolbar.\nYou can also find the references to and from an adress by pressing Right Click on it and then choosing either \"References to...\" or \"References from...\".\n\nNeverthless, when a program is analyzed, Hopper is adding a list of XREFs-From in the comments:\n<pre><code>  j_puts:\n08048390   jmp   dword [puts@GOT]   ; puts@GOT,puts, CODE XREF=sub_8048662+15, sub_8048662+31, sub_8048662+86, sub_8048662+104\n</code></pre>\n",
            "votes": "4",
            "user": "Megabeets",
            "time": "Sep 27, 2017 at 9:31",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I'm not sure how it works on IOS or hopper but from my experience function calls can be obfuscated.\nI've seen values loaded into registers and then some algorithm is performed before a call is made to said register. \nEx. A function is located at VA 1000\n\nLoad value 100 into register1\nMultiply register1 by 5\nAdd 500 to register1\nPush arguments onto the stack\nCall register1\n\nI hope this helps a bit.\n",
            "votes": "0",
            "user": "Ismael Vazquez",
            "time": "Sep 25, 2017 at 21:48",
            "is_accepted": false,
            "comments": []
        }
    ]
}