{
    "title": "Download and Decompile an Ios app [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/16550/download-and-decompile-an-ios-app",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 7 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI want to write an automatic process that downloads an ios app and decompile it?\nI couldn't find any source or method to download an ios app without using any Apple Device.\n",
    "votes": "1",
    "answers": 1,
    "views": "3k",
    "tags": [
        "decompilation",
        "ios"
    ],
    "user": "Hassan Anwer",
    "time": "7 years ago",
    "comments": [
        {
            "user": "Nordwald",
            "text": "Where do you mean to download the apps from? The AppStore is the only legal distributor. If its legal in your country, you could use a shady redistributor. Apple keeps a very thigh grip on things.\n",
            "time": null
        },
        {
            "user": "Hassan Anwer",
            "text": "Without using appstore.\n",
            "time": null
        },
        {
            "user": "Nordwald",
            "text": "So you want help hacking Apple's servers?\n",
            "time": null
        },
        {
            "user": "Hassan Anwer",
            "text": "nop , just want to download apps and wants to analyse it. I couldn't find any source and method to dowload app without using appstore\n",
            "time": null
        },
        {
            "user": "Nordwald",
            "text": "See: that is the point. There are two ways to get these apps: utilizing apple hardware to download apps or to use a service which in turn employs apple hardware to download apps. As for other options, you may have to contact apple yourself.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "AFAIK there is no way to download apps without a device, since the necessary keys are embedded in the CPU and cannot be extracted using software means (this also prevents offline decryption of apps). However, with a jailbroken device it's possible to simulate user input in the App Store app and download the apps automatically (and then decrypt them). Check this presentation (video) from last Recon Brussels for some ideas.\n",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Oct 16, 2017 at 14:03",
            "is_accepted": false,
            "comments": []
        }
    ]
}