{
    "title": "possible to get reference assembly address in file for special memory address?",
    "link": "https://reverseengineering.stackexchange.com/questions/16567/possible-to-get-reference-assembly-address-in-file-for-special-memory-address",
    "content": "Hello I try to learn reverse engineering, so i use from <pre><code>process hacker</code></pre> to view dynamic strings in the process's memory... (more info)\ni get something like this :\n<pre><code>Address  Length Result\n-----------------------\n0x853978 (43): hello\n0xfb5e1a8 (86): hello alex !\n</code></pre>\nnow i want to know how can i get/find reference address for them ? \nI try with <pre><code>WinHex</code></pre> but i cant, i don't know how can i do this, is it possible to find reference assembly address in file form memory address (for ex : <pre><code>0x853978</code></pre>) or this is not possible in any way.\nanyone can help ?\n",
    "votes": "1",
    "answers": 1,
    "views": "341",
    "tags": [
        "disassembly",
        "assembly",
        "binary-analysis",
        "memory",
        "processhacker"
    ],
    "user": "MrUnknow",
    "time": "Oct 17, 2017 at 0:24",
    "comments": [
        {
            "user": "Kerim Can Kalıpcıoğlu",
            "text": "Binary loaded into memory, relocated and mapped to process' virtual memory. It is vary between static and dynamic addresses.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "When you are using Process Hacker to find strings, you will look at a running process. Process Hacker iterates over the mapped parts of the processes virtual memory and tries to parse everything it finds as a string.\nWhen you use WinHex to look at your binary, these sections have not been mapped yet and are cramped together into the binary.\ntl:dr;\nUse another program to check for strings (e.g. exe explorer, pe studio, ida, binaryninja, ...), use a debugger to find the strings at the adresses process hacker tells you, or calculate the file offset utilizing the section information.\nCould you clarify what you are trying to do?\nedit\nif you want to find references to strings in code, you are best off utilizing a decent disassembler (binaryninja, radare2, ida pro). It will show you references it can find:\n",
            "votes": "2",
            "user": "Nordwald",
            "time": "Oct 17, 2017 at 5:46",
            "is_accepted": true,
            "comments": []
        }
    ]
}