{
    "title": "Faster Kernel debugging for Windows",
    "link": "https://reverseengineering.stackexchange.com/questions/16588/faster-kernel-debugging-for-windows",
    "content": "I am Kernel debugging in Windbg and it's slow , very slow stepping through. \nMy current setup is using VMWARE and Windbg through a com port on the Virtual Machine.\nIs there a faster way to debug the Windows Kernel?\nWhat are some of my options?\n",
    "votes": "5",
    "answers": 3,
    "views": "3k",
    "tags": [
        "debugging",
        "windbg",
        "kernel-mode"
    ],
    "user": "LUser",
    "time": "Oct 20, 2017 at 20:20",
    "comments": [
        {
            "user": "Megabeets",
            "text": "Check out \"Slow kernel dbg with VirtualBox and WinDBG\" and \"Advice about first steps on reversing windows kernel\", you may find your answer there.\n",
            "time": null
        },
        {
            "user": "LUser",
            "text": "Thanks for linking this. I looked for an answer but I guess I didn't use the magic keywords )\n",
            "time": null
        },
        {
            "user": "Kerim Can Kalıpcıoğlu",
            "text": "I didn't used Vmware but, I'm using Hyper-V and serial ports for debugging Windows 7 32-bit. It is fast for me.\n",
            "time": null
        },
        {
            "user": "LUser",
            "text": "@de6f I'd like to test this because I want to test drivers.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You want VirtualKd. It is excellent and robust.\nhttp://virtualkd.sysprogs.org\n",
            "votes": "10",
            "user": "Elias Bachaalany",
            "time": "Oct 21, 2017 at 5:07",
            "is_accepted": true,
            "comments": [
                {
                    "user": "LUser",
                    "text": "<span class=\"comment-copy\">I will test this out today. Thank you for the answer!</span>",
                    "time": null
                },
                {
                    "user": "LUser",
                    "text": "<span class=\"comment-copy\">Tested it . This is indeed a lot more faster.</span>",
                    "time": null
                },
                {
                    "user": "LUser",
                    "text": "<span class=\"comment-copy\">For some reason it took forever to get it to connect, it seems fine now though. Ironically this tool requires driver signing to be disabled  which is exactly what I am testing. So I am not sure if this is the best tool for what I need but , you did answer the question.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "GynvaelColdwind had invited honorary_bot who had 4 streams about Kernel Debugging. \nThe videos can be found here: Stream 1, Stream 2, Stream 3, Stream 4.\nAround 34 min in the stream 1 he mentions the slowness of COM connection and around 38 he mentions usage of VirtualKd and why it works much faster. There's also a short installation/setup process. \nAlso there are some downsides of this one - as you need to install something on the machine (someone might don't want to do it). So what it's presented as the best solution (for him) is using physical Firewire but the setup requires separate machines.\nI recommend to have a watch of those 4 streams if you are new into the topic.\n",
            "votes": "4",
            "user": "Paweł Łukasik",
            "time": "Oct 21, 2017 at 16:39",
            "is_accepted": false,
            "comments": [
                {
                    "user": "LUser",
                    "text": "<span class=\"comment-copy\">These are both superb answers that it's hard to pick just one.</span>",
                    "time": null
                },
                {
                    "user": "Paweł Łukasik",
                    "text": "<span class=\"comment-copy\">@ApertureSecurity No worries :)</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "If you are debugging a newer version of Windows (Windows 8 or higher I believe). You should checkout network based debugging. Works like a charm. No third party dependencies.\nJust open up a cmd prompt as admin and type:\n<pre><code>\nbcdedit /debug on\nbcdedit /dbgsettings net hostip:w.x.y.z port:n\n</code></pre>\nCheckout the MSDN docs for more info\n",
            "votes": "2",
            "user": "Bambu",
            "time": "Oct 26, 2017 at 18:59",
            "is_accepted": false,
            "comments": []
        }
    ]
}