{
    "title": "Searching for strings in ollydbg",
    "link": "https://reverseengineering.stackexchange.com/questions/16586/searching-for-strings-in-ollydbg",
    "content": "I have the following program:\n<pre><code>int main() {\n    char buff[11] = \"helloitbd9\";\n    int x = 4;\n    printf(\"%d\", x);\n\n    return 0;\n}\n</code></pre>\nI can see the string \"helloitbd9\" through a hexdump of the binary, in the beginning of the data section. However, what I don't understand is why when I search for \"all referenced strings\" I only get \"%d\" as a result? Is it because the search only looks for strings which are used in functions? Is there a way to search for all \"strings\" in the data section? \nImage:\n",
    "votes": "4",
    "answers": 1,
    "views": "23k",
    "tags": [
        "ollydbg"
    ],
    "user": "Xymistic",
    "time": "Oct 20, 2017 at 15:56",
    "comments": [],
    "answers_data": [
        {
            "content": "From my experience, OllyDbg is not so good with handling string references. \n\nIs it because the search only looks for strings which are used in functions?\n\nAs far as I know, \"Search for >> All referenced text strings\" is searching, well, for strings which are referenced in the assembly. It is not searching for a strings in the whole binary, even if they're exist somewhere in the binary. If you want to search for strings in the whole binary you can use your favorite hex-editor or other utilities such as Sysinternals' strings.\nWe should keep in mind, though, that whether or not a string which is being used in the code itself (e.g, just assigned to a variable which is never used in the program) will be showed in the binary, might changed in different compilers. Some of them would show the assigning even though the variable is never used, some would still keep the string in the binary but you won't see it in the assembly and others would ignore it entirely and would not include the string in the binary at all.\nAnother thing that worth mentioning is that disassemblers sometimes not recognizing strings and would mistake it with hexadecimal values. In such cases you might see something like this:\n<pre><code>...\nmov     eax, 6C6C6568h\n...\nmov     eax, 6274696Fh\n...\nmov     eax, 3964h \n</code></pre>\nInstead of showing it as <pre><code>mov     eax, \"helloitbd9\"</code></pre>.\n\nIs there a way to search for all \"strings\" in the data section?\n\nYou said that you saw the string with a hex editor, you should be able to find it with OllyDbg through looking at the memory maps. Go to View >> Memory and double click the memory map you're interested in which is in your case -- <pre><code>.data</code></pre>. In the opened window press Ctrl+b and search for your string, you should find it there. If you don't find it you can also search for it in another memory maps such as <pre><code>.rdata</code></pre>.\n\nOn a personal note, I highly recommend to use x64dbg which is an active open-source project, unlike Ollydbg which is absolutely outdated. Moreover, x64dbg is inspired by OllyDbg so you should not have too many problems with migrating to it.  \nHere are some resources:\n\nx64dbg main website\nThe project's Github repository \nx64dbg's documentation\n",
            "votes": "5",
            "user": "Megabeets",
            "time": "Oct 20, 2017 at 21:47",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Trey",
                    "text": "<span class=\"comment-copy\">\" It is not searching for a strings in the whole binary\" can you elaborate that? I mean how does olly determine if a string is in fact being used by the binary?</span>",
                    "time": null
                }
            ]
        }
    ]
}