{
    "title": "How does a Smartcard work? [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/16611/how-does-a-smartcard-work",
    "content": "This question already has answers here:\n                                \n                            \n\n\n\n\nHow does a SIM card work?\n\n                                (2 answers)\n                            \n\nClosed 7 years ago.\n\n\n\nIt appears there is more than just flash memory on Smartcards.  \nPresumably there is also some sort of microprocessor.  \nSo then along comes this article:\nCrippling crypto weakness opens millions of smartcards to cloning\nExcerpt:\n\nMillions of smartcards in use by banks and large corporations for more than a decade have been found to be vulnerable to a crippling cryptographic attack. That vulnerability allows hackers to bypass a wide range of protections, including data encryption and two-factor authentication.\nThe critical vulnerability, which researchers disclosed last week, allows attackers to derive the private portion of any vulnerable key using nothing more than the corresponding public portion. \nThe so-called factorization attack can be completed in minutes or days, and the price can range from nothing, depending on the key size and type of computer an attacker uses, to $20,000. \nThe vulnerability stems from a widely deployed library developed by German chipmaker Infineon, which in turn sells its hardware and software to third-party smartcard and device manufacturers.\nThe defect has now been confirmed to affect the first line of Gemalto IDPrime.NET smartcards. \nThe cards have been on the market since 2004 at the latest, when Gemalto predecessor Axalto announced Microsoft employees were using the card to secure access to the software maker's network, by, among other things, providing two-factor authentication to company employees worldwide. During the 12 years the cards are known to have been in use, Netherlands-based Gemalto has shipped cards numbering in the millions or even the tens or hundreds of millions.\n\nThe question is in the title:  How does a Smartcard work?\n",
    "votes": "2",
    "answers": 1,
    "views": "660",
    "tags": [
        "encryption",
        "smartcards"
    ],
    "user": "SDsolar",
    "time": "7 years ago",
    "comments": [
        {
            "user": "julian",
            "text": "Smart card technology conforms to international standards (ISO/IEC 7816 and ISO/IEC 14443) and is available in a variety of form factors, including plastic cards, fobs, subscriber identity modules (SIMs) used in GSM mobile phones, and USB-based tokens - smartcardalliance.org/smart-cards-intro-primer\n",
            "time": null
        },
        {
            "user": "SDsolar",
            "text": "So they work the same?\n",
            "time": null
        },
        {
            "user": "julian",
            "text": "The subscriber identity modules used in mobile-phone systems are reduced-size smart cards, using otherwise identical technologies. en.wikipedia.org/wiki/Smart_card#SIM\n",
            "time": null
        },
        {
            "user": "SDsolar",
            "text": "According this, the flaw in smartcards is dire enough that Estonia is suspending their use entirely:  arstechnica.com/information-technology/2017/11/…  - no word on whether they are also banning SIM cards.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "According to the Smartcard Alliance, Smartcards are functionally identical to SIM cards as used in cellphones and tablets, as described here:\nSmart Card Primer (smartcardalliance.org)\nExcerpt:\n\nA smart card is a device that includes an embedded integrated circuit\n  chip (ICC) that can be either a secure microcontroller or equivalent\n  intelligence with internal memory or a memory chip alone. The card\n  connects to a reader with direct physical contact or with a remote\n  contactless radio frequency interface. With an embedded\n  microcontroller, smart cards have the unique ability to store large\n  amounts of data, carry out their own on-card functions (e.g.,\n  encryption and mutual authentication) and interact intelligently with\n  a smart card reader. Smart card technology conforms to international\n  standards (ISO/IEC 7816 and ISO/IEC 14443) and is available in a\n  variety of form factors, including plastic cards, fobs, subscriber\n  identity modules (SIMs) used in GSM mobile phones, and USB-based\n  tokens.\n\nAs @SYS_V rightfully pointed out, the answer is given in depth here:\nHow does a SIM card work?\n",
            "votes": "1",
            "user": "SDsolar",
            "time": "Oct 24, 2017 at 19:34",
            "is_accepted": true,
            "comments": []
        }
    ]
}