{
    "title": "Solving method of DLL crackme",
    "link": "https://reverseengineering.stackexchange.com/questions/16624/solving-method-of-dll-crackme",
    "content": "I was given two DLL files (link) . The task is to get the flag from them. First what I've done - opened the first file (called <pre><code>original</code></pre>) in IDA and found the function called <pre><code>_GetFlag</code></pre>.\n\nAs I understood, I need to call that function from the DLL library somehow (that's the first question - I don't have any info about the function except its name, so I'd like to know how exactly I can call it).\nHowever, as wee see, even if I knew how to call it, we can't get the flag from <pre><code>original</code></pre> DLL, it says <pre><code>Sry, flag is in the patched version</code></pre>.\nOk, I opened <pre><code>patched</code></pre> DLL in IDA. First what we see that the file can be opened only as a binary:\n\nAs always, I opened the Strings window and we see the string <pre><code>\"0day is bring your own header day! Flag is: %s\"</code></pre> . It looks like a key for solution.\n\nHowever, I don't exactly know what to do after that. I'd really appreciate if somebody would explain me how to solve this.\n",
    "votes": "1",
    "answers": 1,
    "views": "544",
    "tags": [
        "ida",
        "dll",
        "crackme"
    ],
    "user": "kekyc",
    "time": "Oct 25, 2017 at 22:17",
    "comments": [
        {
            "user": "sudhackar",
            "text": "This might give you a hint imgur.com/FELroA0 The patched file has been changed to not look like a dll. Patch the bytes properly so that it is a valid dll.\n",
            "time": null
        },
        {
            "user": "kekyc",
            "text": "@sudhackar thank you for your answer - I thought about it. Indeed, after I patched file signatures to MZ and PE it looks like a valid DLL. I see a functions like genFlag and getFlag - this is exactly what I need to call. What's the proper way to do that if we have only DLL file, in your opinion?\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "@kekyc: try LoadLibrary & GetProcAddress\n",
            "time": null
        },
        {
            "user": "kekyc",
            "text": "@PawełŁukasik Yep, it worked perfectly. Thank you!\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Once you have patched the malformed bytes to make the patched DLL proper, you can use something like this to call the <pre><code>GetFlag</code></pre> function.\n<pre><code>#include <Windows.h>\n\ntypedef DWORD (__cdecl *_GetFlag)();\n_GetFlag GetFlag;\nHMODULE hDll = NULL;\n\nNTSTATUS main(int argc, char **argv) {\n    hDll = LoadLibrary(\"my_head_flew_away_patched.dll\");\n    GetFlag = (_GetFlag)GetProcAddress(hDll, \"GetFlag\");\n    GetFlag();\n}\n</code></pre>\n",
            "votes": "4",
            "user": "ashish",
            "time": "Jul 1, 2018 at 14:05",
            "is_accepted": true,
            "comments": [
                {
                    "user": "kekyc",
                    "text": "<span class=\"comment-copy\">You late just for ~2-3 minutes I did it myself using the same method. But thank you, anyway!</span>",
                    "time": null
                },
                {
                    "user": "sudhackar",
                    "text": "<span class=\"comment-copy\">If you look at the time of the gist, it is about the same time as the earlier comment. I didn't want to spoil it for you. That's exactly what I wanted.</span>",
                    "time": null
                },
                {
                    "user": "kekyc",
                    "text": "<span class=\"comment-copy\">Of course, I understand that.</span>",
                    "time": null
                }
            ]
        }
    ]
}