{
    "title": "How to label local variables in x64dbg",
    "link": "https://reverseengineering.stackexchange.com/questions/16625/how-to-label-local-variables-in-x64dbg",
    "content": "As the title stands, I want to label local variables ([ebp - x] addresses) the same way I do with functions and global variables. What I've learned:\n\nI found no way to label locals in the debugger window.\nThere's <pre><code>Locals</code></pre> tab in the bottom panel. I can give names to locals there, but they don't propagate to the main window.\nI can rename variables in the decompiler window, but again, they don't sync with the debugger window.\n\nIf x64dbg lacks this functionality, is there any plugin that achieves this?\n",
    "votes": "7",
    "answers": 2,
    "views": "5k",
    "tags": [
        "tools",
        "debuggers",
        "x64dbg"
    ],
    "user": "Viacheslav Kroilov",
    "time": "Oct 25, 2017 at 21:55",
    "comments": [
        {
            "user": "Nordwald",
            "text": "Often reverse engineers do dynamic and static analysis side by side. You start off with Binja/IDA/radare2 and annotate information from the dynamic analysis. These tools can save this information and offer more functionality.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Two ways to label local variables in x64dbg:\n\nIn x64dbg, follow in dump at address of local var (like this [ebp-4]). Right click at this address and select Add label, then name the label.\n\n\nNow in the CPU window, local var is displayed like the following picture:\n\n\nTry the labeless plugin : https://github.com/a1ext/labeless/ to sync from IDA to x64dbg.\n\nRegards;\n",
            "votes": "3",
            "user": "m4n0w4r",
            "time": "Nov 3, 2017 at 3:51",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "Local variables labeling is not yet supported by x64dbg and as far as I know there's no plugin to achieve that.\nHowever, you can still label a specific memory address. You can do this by selecting the address and press :, or right click it and select Label >> Label Current Address.  \nIf you want this functionality you can ask for it on the x64dbg's Github repository or even implement it by yourself.\n",
            "votes": "3",
            "user": "Megabeets",
            "time": "Oct 27, 2017 at 6:46",
            "is_accepted": false,
            "comments": []
        }
    ]
}