{
    "title": "How does a TAP card work? [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/16657/how-does-a-tap-card-work",
    "content": "This question already has answers here:\n                                \n                            \n\n\n\n\nHow does a SIM card work?\n\n                                (2 answers)\n                            \n\nClosed 7 years ago.\n\n\n\nTAP cards have been around for a while now, but there seems to be very little information around that explains how they work, particularly by the LA transit system.  \nHere is an article saying that they are set to replace the MetroCard for the New York transit system with TAP:  \nMTA gets ready to dump the Metrocard\n\nThe official Transit Access Pass website has this to say:\nWhat's TAP?\nExcerpt:\n\nEach TAP card has a built-in electronic chip.\nIt’s like a mini-computer inside your card! It lets you load Stored Value (money) and a variety of passes for travel across 24 transit agencies. No more fumbling for change.  Just load the type of fare you want on your card, then tap it each time you board a bus or train.  It’s way faster than cash!\n\nIt is some sort of contactless smart card, but looking around using that as a search term, TAP seems not to be listed as using the ISO 14443 standard.  Yet maybe it does.\nQuestion:  How do they work?\n",
    "votes": "0",
    "answers": 1,
    "views": "3k",
    "tags": [
        "smartcards"
    ],
    "user": "SDsolar",
    "time": "7 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "Too long to fit in a comment.\n\nA TAP card is a durable plastic card with a smart chip designed to make your transit experience simple and secure.1\n\n\n\nContactless payments use the international standard ISO/IEC14443 for contactless communications that is being adopted worldwide for financial payments and leverage the existing payments infrastructure which has supported payment cards for more than 40 years.\n2\n\n\n1. TAP FAQs. https://www.taptogo.net/TAPFAQ\n2. Contactless Payments: Frequently Asked Questions. https://www.securetechalliance.org/publications-contactless-payments-faq\n",
            "votes": "1",
            "user": "julian",
            "time": "Oct 30, 2017 at 4:37",
            "is_accepted": true,
            "comments": [
                {
                    "user": "SDsolar",
                    "text": "<span class=\"comment-copy\">TNX, SYS_V.  I would add just this:  \"Its embedded integrated circuits can store (and sometimes process) data and communicate with a terminal via 13.56-MHz radio waves.\" - from <a href=\"https://en.wikipedia.org/wiki/Contactless_smart_card\" rel=\"nofollow noreferrer\">en.wikipedia.org/wiki/Contactless_smart_card</a></span>",
                    "time": null
                }
            ]
        }
    ]
}