{
    "title": "How to decompile an exe file? [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/16694/how-to-decompile-an-exe-file",
    "content": "This question already has answers here:\n                                \n                            \n\n\n\n\nWhy there are not any disassemblers that can generate re-assemblable asm code?\n\n                                (5 answers)\n                            \n\nClosed 7 years ago.\n\n\n\nI have been wondering, if every program is based on machine code, can we not decompile a program until it hits machine code and make it up to real programming languages? \nHow to decompile exe files with a rate of 100%? If my computer understands the processes it should take, isn't it also be able return me the steps of what's its done, values from memory exc..? \nHow do I decompile an exe file without an error?\n",
    "votes": "1",
    "answers": 1,
    "views": "52k",
    "tags": [
        "windows",
        "decompilation",
        "decryption"
    ],
    "user": "Ahmed Can Unbay",
    "time": "7 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "I have been wondering, if every program is based on machine code, can we not decompile a program until it hits machine code and make it up to real programming languages?\n\nThis question is based on a false premise; namely that every program is based on machine code. Programs are typically written in high-level languages, which are by design architecture independent and therefore must be translated into an architecture-specific form in order to be executed:\n\n\n“High-level” programming languages take their name from the relatively\n  high level, or degree of abstraction, of the features they provide, relative to those of the assembly languages they were originally designed to replace. The adjective “abstract,” in this context, refers to the degree to which language features are separated from the details of any particular computer architecture.1 \n\n\nMachine independence is a fairly simple concept. Basically it says that a programming language should not rely on the features of any particular instruction set for its efficient implementation.1\n\n\nProgramming languages are examples of formal languages:\n\nWhat is the Relationship Between Programming Languages, Regular Expressions and Formal Languages\nFormal Language Theory\nProgramming language syntax\n\n\n\nThe translation of the series of statements written in a programming language in a program source file to semantically equivalent object code is accomplished by a compiler. Decompilation involves translation of architecture-dependent object code to a semantically equivalent representation (source code) that is not architecture specific, the reverse process of compilation.\n\nHow to decompile exe files with a rate of 100%? \n\nThis does not seem to be possible.\n\nCertainly, fully automated decompilation of arbitrary machine-code programs is not possible -- this problem is theoretically equivalent to the Halting Problem, an undecidable problem in Computer Science. What this means is that automatic (no expert intervention) decompilation cannot be achieved for all possible programs that are ever written. Further, even if a certain degree of success is achieved, the automatically generated program will probably lack meaningful variable and function names as these are not normally stored in an executable file (except when stored for debugging purposes).2\n\n\nFurther description of the challenges posed for decompilation can be found here:\n\nReverse Compilation Techniques\nNative x86 Decompilation using Semantics-Preserving Structural Analysis and Iterative Control-Flow Structuring\nC Decompilation: Is It Possible?\n\nIn fact, correct disassembly (much less decompilation) is a major challenge:\n\nWhy is disassembly not an exact science\nDisassembling Obfuscated Assembly\n\n\n1. Scott, Michael L. Programming Language Pragmatics. 3rd ed. Page 111\n2. Is Decompilation Possible?\n",
            "votes": "7",
            "user": "julian",
            "time": "Nov 3, 2017 at 19:08",
            "is_accepted": true,
            "comments": []
        }
    ]
}