{
    "title": "Difference between INT 0X80 and SYSCALL",
    "link": "https://reverseengineering.stackexchange.com/questions/16702/difference-between-int-0x80-and-syscall",
    "content": "The SYSCALL instruction is said to be the 64-bit version of INT 0X80, however it's still possible to use the latter in 64-bit code (although strace decodes it wrong because of the 64-bit ABI I guess) which usually goes through a \"legacy entry\". But there's something I don't quite understand, why is the SYSCALL instruction faster?\n",
    "votes": "9",
    "answers": 1,
    "views": "18k",
    "tags": [
        "x86",
        "system-call"
    ],
    "user": "Trey",
    "time": "Nov 3, 2017 at 16:02",
    "comments": [],
    "answers_data": [
        {
            "content": "The short answer is that <pre><code>syscall</code></pre> has less overhead than <pre><code>int 0x80</code></pre>. \nFor more details on why this is the case, see the accepted answer to Intel x86 vs x64 system call, where a nearly identical question was asked: \n\nI'm told that syscall is lighter and faster than generating a software interrupt. Why it is faster on x64 than x86, and can I make a system call on x64 using int 80h?\n\nSee also:\n\nIntel P6 vs P7 system call performance\n\nthis email thread discusses the observed slowdown on certain Intel CPUs caused by the overhead associated with <pre><code>int 0x80</code></pre>\n\nSysenter Based System Call Mechanism in Linux 2.6\n\nIt was found out that this software interrupt method [int 0x80] was much slower on Pentium IV processors. To solve this issue, Linus implemented an alternative system call mechanism to take advantage of SYSENTER/SYSEXIT instructions provided by all Pentium II+ processors.\n\nThe Linux kernel, 4.6 Sysenter and the vsyscall page (2003)\n\nIt has been observed that a 2 GHz Pentium 4 was much slower than an 850 MHz Pentium III on certain tasks, and that this slowness is caused by the very large overhead of the traditional <pre><code>int 0x80</code></pre> interrupt on a Pentium 4. Some models of the i386 family do have faster ways to enter the kernel. On Pentium II there is the <pre><code>sysenter</code></pre> instruction. Also AMD has a <pre><code>syscall</code></pre> instruction.\n",
            "votes": "11",
            "user": "julian",
            "time": "Nov 3, 2017 at 18:50",
            "is_accepted": true,
            "comments": []
        }
    ]
}