{
    "title": "reverse engineering a website for the Html, css and javascript [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/16730/reverse-engineering-a-website-for-the-html-css-and-javascript",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 7 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nIs this possible to do? I intend to extract those files and change all coding to make it my own. Its meant for a static website.\n",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "websites"
    ],
    "user": "Rivash Harripersad",
    "time": "7 years ago",
    "comments": [
        {
            "user": "Megabeets",
            "text": "This is not really Reverse Engineering question, voted to close. Anyway, press Ctrl+S on your favorite browser and choose Complete Webpage.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "If what you see rendered on the page is sufficient, then just save the complete page via your browser and modify what you want changed.\nIf you want to be more granular about seeing what the page is pulling in, press F12 in your browser to bring up the developer tools. The \"Sources\" tab will show you files that are being loaded and from where. This can help you avoid keeping junk/irrelevant files, like analytics JS files, etc.\nIf you click on the \"Network\" tab and refresh the page, you can see the order and timing of everything loading.\nReversing functionality from dynamic pages can be exponentially more difficult (see: impossible). Implementations like Angular create a black box that stores a lot of functionality server-side, so if you wanted to save, say, the functionality of the live-update notification icon from YouTube, you won't be able to do that using just what's rendered on the client side.\nThis is where reverse engineering really does come into play. You can learn a lot about how a page/site works via the browser's developer tools, but taking it to the next step, you're going to want to use tools like Wireshark or Fiddler to capture packets and inspect data more thoroughly (if you can; the data may be encrypted).\nIf a site is based on a platform like WordPress, then there are likely breadcrumbs in the code that will hint at either the theme the site is based on, plugins being utilized, etc.\nConclusion: Your question is far more broad than you think (which isn't your fault because you don't know any better), but if the page you're interested in has no dynamically-updating content and its static form is truly enough for you, then saving the complete page via your browser should be sufficient. That, or use an application like HTTrack or Web2Disk for something a bit more thorough that can crawl a page/site and nab more resources than a browser will render.\n",
            "votes": "3",
            "user": "dsasmblr",
            "time": "Nov 7, 2017 at 16:14",
            "is_accepted": false,
            "comments": []
        }
    ]
}