{
    "title": "What are some ways in which virtual machines make native static and dynamic reversing of a binary more difficult?",
    "link": "https://reverseengineering.stackexchange.com/questions/16826/what-are-some-ways-in-which-virtual-machines-make-native-static-and-dynamic-reve",
    "content": "It is practically common knowledge in reverse engineering that trying to use a native debugger or disassembler on a \"VM protected\" or virtualized program is much more difficult to analyze. However, I would like to know specific, concrete ways in which this is the case and why. Please list some reasons along with any relevant work on whether the various reasons have been overcome manually (not using a script).\nIn case this question is perceived as being too general, let us focus on a specific example. The example is we are trying to use a native debugger (such as x64Dbg) to locate a call to the Windows API CreateFile and find out the location of a file write. In an unprotected program, we could open it up, place a breakpoint on CreateFile and locate the call after examining cross-referenced calls.\nHow would this process successfully be obstructed by Themida Protector? Obviously, at the end of the day, the program must still write the file, but what steps severely hamper analysis?\n",
    "votes": "5",
    "answers": 2,
    "views": "421",
    "tags": [
        "unpacking",
        "virtual-machines"
    ],
    "user": "the_endian",
    "time": "Nov 23, 2017 at 11:38",
    "comments": [
        {
            "user": "EWD-0-",
            "text": "It's not just about using a debugger/disassembler being more difficult it's the whole analysis processes. The question is not focused.  As I see the subject it's too much to say about this. Specifically about the last part. If you have an example please add it to the question to make it easier to answer.\n",
            "time": null
        },
        {
            "user": "the_endian",
            "text": "@EWD-0- you mean a specific file to be examined or a specific type of vm?\n",
            "time": null
        },
        {
            "user": "the_endian",
            "text": "See added example\n",
            "time": null
        },
        {
            "user": "julian",
            "text": "static.usenix.org/event/woot09/tech/full_papers/rolles.pdf, ieeexplore.ieee.org/document/5207639\n",
            "time": null
        },
        {
            "user": "julian",
            "text": "msreverseengineering.com/blog/2018/1/23/…, welivesecurity.com/wp-content/uploads/2018/01/WP-FinFisher.pdf\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It depends on your goal. If all you care about is side-effects (as in API calls, written files, network stuff and so on), they don't really make life difficult. As you said, in the end the API has to be used and you will be able to catch it.\nThe purpose of virtualization is preventing people from understanding internal processes of the target. As such, often times people virtualize only specific code blocks to lessen the overall negative performance impact and just protect for example code that reads a license file, code that does cryptography and so on.\nThis makes it very tedious to extract algorithms from the target. If your question is what happens inside, VM protections are the worst. If you just care about what the target does, well, they do nothing.\nBasically, their goal is turning an executable into a black box, not shroud their doings.\n",
            "votes": "1",
            "user": "Johann Aydinbas",
            "time": "Mar 30, 2018 at 9:40",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "So as I understood the question has two main parts.\nFirst why it is hard to reverse/analyze a virtualized code. Standard assembly instructions have particular byte code which by that you can understand what is happening in the program. By using virtualization one can create arbitrary byte codes which then is translated to the original code that system can understand. This means by viewing the code you can't understand what goes on.\nThis goes further when we encounter virtualization machines which produce the original code part by part at run time not all the code at once. So as an analyst you see small parts of the real assembly at run time.\nThe second part about CreateFile/WriteFile. If by this example you mean analyzing behavior of a program, there is no difference between virtualized or normal executable most of the time. In both cases you can put BP on CreateFile/WriteFile in the debugger or a better way just do black box monitoring.\nIt's worth mentioning that the other problem we face reversing virtualized code is that they mostly benefit from heavy protectors/anti debugging techniques too.\nhttp://resources.infosecinstitute.com/reverse-engineering-virtual-machine-protected-binaries/#gref\nhttp://resources.infosecinstitute.com/tutorial-building-reverse-engineering-simple-virtual-machine-protection/#gref\n",
            "votes": "0",
            "user": "EWD-0-",
            "time": "Nov 27, 2017 at 12:27",
            "is_accepted": false,
            "comments": []
        }
    ]
}