{
    "title": "Import table vs Import Address Table",
    "link": "https://reverseengineering.stackexchange.com/questions/16870/import-table-vs-import-address-table",
    "content": "What's the difference between the Import Table and the Import Address Table?\n",
    "votes": "7",
    "answers": 2,
    "views": "18k",
    "tags": [
        "binary-analysis",
        "x86",
        "pe"
    ],
    "user": "Trey",
    "time": "Nov 30, 2017 at 12:39",
    "comments": [
        {
            "user": "julian",
            "text": "Duplicate of What's the difference between the import table, import adress table, and import name table?. Also  RTFM. Hence the down vote.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "As general, I recommend reading the PE Format documentation on MSDN regarding the PE structure. \nImport Table\nThe Import Table is actually called \"Import Directory Table\" and contains entries for every DLL which is loaded by the executable. Each entry contains, among other, Import Lookup Table (ILT) and Import Address Table (IAT)\nTo quote from the PE format specs about Import Directory Table:\n\nImport Directory Table\n  The import information begins with the import directory table, which describes the remainder of the import\n  information. The import directory table contains address information\n  that is used to resolve fixup references to the entry points within a\n  DLL image. The import directory table consists of an array of import\n  directory entries, one entry for each DLL to which the image refers.\n  The last directory entry is empty (filled with null values), which\n  indicates the end of the directory table. Each import directory entry\n  has the following format:\n<pre><code>Offset    Size    Field\n0         4       Import Lookup Table RVA\n4         4       Time/Date Stamp\n8         4       Forwarder Chain\n12        4       Name RVA\n16        4       Import Address Table RVA\n</code></pre>\n\n\nImport Address Table\nThe Import Address Table is comprised of function pointers, ans is used to get the addresses of functions when the DLLs are loaded. A compiled application was designed so that all API calls will not use direct hardcoded addresses but rather work through a function pointer. The pointer table can be accessed in several ways -- either directly by a call to <pre><code>[pointer address]</code></pre> or by the \"Import Lookup Table\" and the \"Hint/Name Table\".\nLet's quote again from the PE specs about the \"Import Address Table\":\n\nImport Address Table\n  The structure and content of the import address table are identical to those of the import lookup table, until\n  the file is bound. During binding, the entries in the import address\n  table are overwritten with the 32-bit (for PE32) or 64-bit (for PE32+)\n  addresses of the symbols that are being imported. These addresses are\n  the actual memory addresses of the symbols, although technically they\n  are still called \"virtual addresses.\" The loader typically processes\n  the binding.\n\n\nReferences:\n\nPE Format specifications\nUnderstanding the Import Address Table\nWikipedia: Portable Executable\nSO answer\n",
            "votes": "17",
            "user": "evandrix",
            "time": "Jun 15, 2020 at 12:30",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "First, beside “yours” two tables, I introduce a third one, the Import Lookup Table.\nSide by side with the Import Address Table, these two tables look like in this simplified picture:\n\nThis picture shows the situation in your executable file on disk. They are totally identical, with the exactly same lists of the API function names (more precisely, pointers to the displayed names), in the exactly same order.\n\nNow, the loader loads your executable and maps all required DLLs (Dynamic-Link Libraries) into your virtual memory space.\nAfter finishing it and some calculations, the loader already knows addresses of all your imported functions.\nSo it replaces the names of your imported functions in the second table (Import Address Table) with their addresses, and the situation in memory becomes different:\n\n\nOn the other hand, the Import Table, more precisely Import Directory Table, is a gateway to these 2 tables.\nIt is an array (a table) of entries, one entry (a row) for every imported library.\nA simplified picture of it is here:\n\nEvery row consist of 5 double words (pointers). Important are only 3 of them, the first (a pointer to the ILT), the last (a pointer to the IAT), and the last but one (identifying the row by the name of DLL; so it's a pointer to the DLL's name in the fourth involved table, the Hint/Name Table).\nSo its cooperation with other two tables looks like this:\n\n(I omitted the fourth table, the mentioned Hint/Name Table with names of all imported functions and names of all imported libraries, too.)\n\nNote: I intentionally omitted zero-filled separating rows in my pictures, and I didn't deal with imports by ordinal (for the sake of simplicity to emphasize ideas).\n",
            "votes": "9",
            "user": "MarianD",
            "time": "Oct 14, 2021 at 17:56",
            "is_accepted": false,
            "comments": []
        }
    ]
}