{
    "title": "Finding Addresses in Ollydbg from IDA [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/16969/finding-addresses-in-ollydbg-from-ida",
    "content": "This question already has answers here:\n                                \n                            \n\n\n\n\nHow to find offsets in OllyDBG from IDA\n\n                                (5 answers)\n                            \n\nClosed 7 years ago.\n\n\n\nSo I have an address from IDA which is:\n.text:10924D10: Bool (IsDebuggerPresent). Now when I open the same PE in Ollydbg I can't find this adress, any ideas?\n",
    "votes": "2",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ida",
        "ollydbg"
    ],
    "user": "Ayazasker",
    "time": "7 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "In a nutshell, the address you are seeing in IDA Pro is the \"on disk virtual address\" which is not necessarily the \"real\" address that the program actually maps to when it is loaded into memory (RAM). Many times, there is an address change due to Address Space Layout Randomization (ASLR) but it could also occur due to other reasons. To disable ASLR, you can use the program CFF Explorer; open the binary and navigate to the OptionalHeader and then scroll down to DllCharacteristics area and you will have an option to edit here. Untick the checkbox \"image can be moved\" and make sure to save the binary before you exit. This will disable ASLR.\nAnother option you have is to first load the binary into a debugger and locate the image base address of the binary in the debugger (use the \"memory map\" option) and then go into IDA Pro and click Edit -> Segments -> Rebase Program now enter the image base into the box, tick Image Base, and click OK. Now, the addresses in your debugger will correspond properly with the addresses in IDA Pro Disassembler.\n",
            "votes": "2",
            "user": "the_endian",
            "time": "Dec 14, 2017 at 8:15",
            "is_accepted": false,
            "comments": []
        }
    ]
}