{
    "title": "What are the differences between metamorphic, oligomorphic and polymorphic malware?",
    "link": "https://reverseengineering.stackexchange.com/questions/1696/what-are-the-differences-between-metamorphic-oligomorphic-and-polymorphic-malwa",
    "content": "Malware use several methods to evade anti-virus software, one is to change their code when they are replicating. I saw mainly three type of techniques in the wild which are: metamorphic malware, oligomorphic malware and polymorphic malware (I might have missed one). What are the main differences between theses techniques and what do they do ?\n",
    "votes": "9",
    "answers": 2,
    "views": "7k",
    "tags": [
        "obfuscation",
        "malware"
    ],
    "user": "perror",
    "time": "Apr 10, 2013 at 8:34",
    "comments": [
        {
            "user": "Ange",
            "text": "security.stackexchange.com/questions/4619/…\n",
            "time": null
        },
        {
            "user": "perror",
            "text": "Are you sure we can't do better than this (short) answer ?\n",
            "time": null
        },
        {
            "user": "perror",
            "text": "Still the difference between metamorphic and polymorphic are unclear to me... If someone can come with a better definition, I take it.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "In order of increasing complexity: oligomorphic, polymorphic, metamorphic.\nThe first two terms are generally applied to decryptors.  We (anti-virus industry) define them this way: oligomorphic - decryptor with few variable elements, which does not affect the size or shape of the code.  It means that the variable elements are usually fixed-size instructions, but it can also apply to the register initialization.\nOligomorphic example\n<pre><code>std ;fake, might be replaced by cld / nop / xchg ax, cx / ...\nmov cx, size\nmov ax, ax ;fake, might be replaced by mov bx, bx / or cx, cx / ...\nmov si, decrypt_src\ncld ;fake\nmov di, decrypt_dst\nor ax, ax ;fake\nmov bl, key\nand bp, bp ;fake\ndecrypt:\nxor [di], bl\nxchg dx, ax ;fake\ninc di\ncld ;fake\nloop decrypt\n</code></pre>\nIn this case, the <pre><code>di</code></pre> register could be exchanged with <pre><code>si</code></pre>, for example.  Very simple replacement.\nPolymorphic\ndecryptor with potentially highly variable elements, which does affect the size and/or shape of the code.  It means that all kinds of changes can be applied, including subroutine creation, large blocks of garbage instructions, code \"islands\", or even algorithmic register initialisation (example here).\nMetamorphic\nhighly variable elements are applied directly to the body.  There is generally no decryptor in this case.  The same techniques for polymorphism are applied to the code itself.  The most famous example of this is the Simile virus from 2002 (details here).  There's a detailed paper on the subject with actual examples here)\n",
            "votes": "7",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "polymorphic code (the generic term) different (different encryption key) code but same result\noligomorphic code: pattern-based polymorphism\n\nexample:\n\n2 different executions of some oligomorphic code:\n<pre><code>MOV ECX,FC07379C    PUSH 40\nXOR ECX,FC0737DC    PUSH Tada\nPUSH ECX            NOP\nNOP                 PUSH Helloworld\nPUSH Tada           PUSH 0\nNOP                 NOP\nMOV ECX,F8477840    CALL MessageBoxA\nXOR ECX,F80779BC    MOV ECX,0A2EF248\nPUSH ECX            XOR ECX,0A2EF248\nNOP                 PUSH ECX\nPUSH 0              CALL ExitProcess\nCALL MessageBoxA\nPUSH 0\nPUSH 00400136\nPUSH ExitProcess\nCALL $ + 5\nRETN\n</code></pre>\nmetamorphic code: polymorphism with auto-mutation - the result is slightly different\n",
            "votes": "5",
            "user": "Ange",
            "time": "Apr 10, 2013 at 19:02",
            "is_accepted": false,
            "comments": []
        }
    ]
}