{
    "title": "Stone's PE Encrypter v2.0",
    "link": "https://reverseengineering.stackexchange.com/questions/16980/stones-pe-encrypter-v2-0",
    "content": "Does anybody know an unpacker/decryptor that can unpack Stone's PE Encrypter v2.0? I found one but it was for a previous version, not version 2.0. IDA's universal unpacker seems to hang when trying to unpack this. \"waiting for unpacker to finish\" forever. Thank you.\n",
    "votes": "0",
    "answers": 1,
    "views": "882",
    "tags": [
        "ida",
        "unpacking",
        "packers"
    ],
    "user": "savram",
    "time": "Dec 15, 2017 at 19:31",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "unless it uses some advanced tricks, most likely you can unpack it manually with a bit of effort.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Depending on what you're looking to accomplish, you have a handful of options:\n\nUse RL!dePacker 1.5, which supports unpacking Stone's PE Encryptor 2.0. The technology at the core of this unpacker, TitanEngine, has been immensely improved since its implementation back then, and is available as open source via ReversingLabs. Official video tutorial from RL can be viewed here.\nFUU utilizes TitanEngine and has signatures for multiple versions of Stone's PE Encryptor, including v2.0.\nUse The aPE, which allows for patching of supported packed binaries--Stone's PE Encryptor v2.0 being one of the supported packers.\nA code search on GitHub for \"PE Encryptor v2.0\" yields additional results you may want to sift through in case any of the solutions above don't pan out.\n",
            "votes": "6",
            "user": "dsasmblr",
            "time": "Dec 18, 2017 at 5:47",
            "is_accepted": true,
            "comments": [
                {
                    "user": "savram",
                    "text": "<span class=\"comment-copy\">Are you sure this \"RL!dePacker 1.5\" is virus free? My AV is going nuts with it.</span>",
                    "time": null
                },
                {
                    "user": "dsasmblr",
                    "text": "<span class=\"comment-copy\">Mine did as well. Virus Total shows more positives than negatives: (<a href=\"https://www.virustotal.com/#/url/dca3fde4df8b92b170d99f604707bdb54c400f09ddc246279c3ce89b93eb6401/detection\" rel=\"nofollow noreferrer\">virustotal.com/#/url/…</a>), but if you're weary, just run it and your target within a VM or use something like Sandboxie: <a href=\"https://www.sandboxie.com/\" rel=\"nofollow noreferrer\">sandboxie.com</a></span>",
                    "time": null
                },
                {
                    "user": "savram",
                    "text": "<span class=\"comment-copy\">I used RDG Packer Detector v0.7.6.2017 to determine that the PE is packed with Stone's PE Encrypter, but oddly FUU doesn't seem to recognize that, and RL!dePacker just seems to freeze. They don't seem able to find the OEP.</span>",
                    "time": null
                },
                {
                    "user": "dsasmblr",
                    "text": "<span class=\"comment-copy\">Try using Exeinfo PE to see what it thinks it's packed with: <a href=\"http://exeinfo.atwebpages.com/\" rel=\"nofollow noreferrer\">exeinfo.atwebpages.com</a></span>",
                    "time": null
                },
                {
                    "user": "Megabeets",
                    "text": "<span class=\"comment-copy\">@savram, any chances that you'd share the binary with us? We may be able to help</span>",
                    "time": null
                }
            ]
        }
    ]
}