{
    "title": "IDA Pro getting division by zero when trying to debug assault cube [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/17028/ida-pro-getting-division-by-zero-when-trying-to-debug-assault-cube",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 7 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm new to IDA and I am trying to debug a game using win32. When it starts up though I get a division by zero error then it crashes. Any help would be awesome!\n",
    "votes": "-2",
    "answers": 2,
    "views": "465",
    "tags": [
        "ida"
    ],
    "user": "Steven",
    "time": "7 years ago",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Does that exception happen inside IDA or inside the debuggee? As a side-note: you know what you're dealing with, but you give us little to help you. Perhaps you should use the site help to learn what can be asked (within the scope of this site) and how to ask.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "short question yields short answer\nThis is probably happening because of anti debugging techniques used by the program. By detecting and nullifying  the anti-debugging techniques you can safely avoid the exception and crash.\n",
            "votes": "2",
            "user": "NirIzr",
            "time": "Dec 21, 2017 at 18:32",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">I don't think so. IDA <i>looks</i> at code, it does not <i>execute</i> it. This sounds more like a Tech Support type of question – for example, a bad or missing font that IDA may be expecting to draw its interface with.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">@usr2564301 IDA has a debugger and OP explicitly states multiple times he's debugging using IDA...</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">IDA has even <i>several</i> debugger backends and even allows for remote debugging. Frankly I prefer it whenever I don't have the source to something available. Otherwise I prefer WinDbg and x64dbg and then with some space the VS debugger follows ...</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "IDA debugger for win32 is pretty unstable, especially when you load a big file into ida (bigger than 20 mb), and then try to debug it. You can try attaching to a running process from IDA, instead of loading exe for disassembly first. Also, I would suggest trying the other debugging backends like Windbg (Debugger - Select debugger menu). You'll need debugging tools for Windows. And if there's no specific need to debug from IDA, then use Windbg directly.\n",
            "votes": "2",
            "user": "Anton Kukoba",
            "time": "Dec 22, 2017 at 16:12",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">That's a pretty generic statement. For starters I've <i>never</i> had the instability issues you describe and then given you're making such a claim you might want to point out the version of IDA you're running as well as the backend <i>you</i> are using.</span>",
                    "time": null
                },
                {
                    "user": "Anton Kukoba",
                    "text": "<span class=\"comment-copy\">If you want to experience some problems try loading chrome_child.dll and then start debugging. It's going to die trying to relocate the image. IDA x64 version survives this, x86 - dies.</span>",
                    "time": null
                }
            ]
        }
    ]
}