{
    "title": "Unable to unpack heavly obfuscated malware",
    "link": "https://reverseengineering.stackexchange.com/questions/17051/unable-to-unpack-heavly-obfuscated-malware",
    "content": "I'm trying to unpack malware packed with ConfuserEx 1.0.0 and I can't seem to get it to work. Each time I remove the anti-tamper the whole file gets corrupted.\nI tried all possible tools that I found online, when that failed I tried to do so manually using some tutorials I found online, I always end up destroying the executable in the first stage of the unpacking. I'm using dnspy for this sample.\neach time I attempt to locate the anti-tamper module, it ends up being the incorrect one and i end up destroying the executable..\nThen I tried to debug it and check for memory dumps on x64(32 bit) debugger, I found some anti debugging mechanisms but I am still missing something because the program just keeps running junk code until i detach from it and it crashes, dumping it when its already loaded into memory also dumps junk code.\nWhat am I missing here? \nDoes anyone have experience with unpacking the confuserex packer? \nCan you guys link me to some information I'm missing? or maybe explain how the ConfuserEx works? \nI would appreciate help in understanding how to unpack it. I'll provide the sample here:\n<pre><code>[WARNING THIS IS A LIVE MALWARE SAMPLE]\neagleepicsocks(dot)com/jk/jkeq.exe\n[WARNING THIS IS A LIVE MALWARE SAMPLE]\n</code></pre>\n",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "malware",
        ".net"
    ],
    "user": "Potato",
    "time": "Dec 27, 2017 at 8:58",
    "comments": [
        {
            "user": "Vladislav Ivanov",
            "text": "What exactly do you mean by \"destroying\"?\n",
            "time": null
        },
        {
            "user": "Potato",
            "text": "I'm assuming the memory gets corrupted there is no way of knowing since the file is so highly obfuscated I have a hard time knowing what exactly got destroyed.  I am new to the field so even if there is a way of knowing I dont hold the skill set for it\n",
            "time": null
        },
        {
            "user": "Michael Pittino",
            "text": "Tip: ConfuserEx will unpack the target during runtime and keep it in memory. You can dump it using dnSpy Debugging. I think the name of the unpacked module was <pre><code>koi</code></pre> or something like that.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<pre><code>ConfuserEx</code></pre> unpacks your executable at runtime and then gives control to it.\nAfter the <pre><code>ConfuserEx</code></pre> loader finishes its job you can dump the memory and the assembly.\nIn order to avoid detection, you can restort to <pre><code>SysInternals</code></pre> <pre><code>Process Explorer</code></pre> or <pre><code>ProcDump</code></pre> to dump the live process after the loader has finished unpacking. This avoids early interference with the loader and simplifies your dump if no other measures are implemented in the protected program.\nYou can find an unpacker, this for example, ConfuserEx-Unpacker should do the job.\nHowever, the more interesting part is do it by hand: this well-written blog shows how to do that in a real case.\n",
            "votes": "2",
            "user": "Yennefer",
            "time": "Jan 7, 2020 at 23:59",
            "is_accepted": false,
            "comments": []
        }
    ]
}