{
    "title": "How can I see the heap data in ollydbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/17070/how-can-i-see-the-heap-data-in-ollydbg",
    "content": "I have a C compiled binary that allocates an array of chars into the heap via <pre><code>HeapAlloc()</code></pre>.\nI would like to be able to see the allocated dynamic array in the heap using Ollydbg to be able to trace it and see how it is being modified.\nSo far I've tried:\n\nInsert a unique string e.g. <pre><code>r00tr00tr00tr00t...r00t</code></pre> via the binary**\nGo to Memory View (ALT+M)\nSearch (CTRL+B) for ASCII: <pre><code>r00t</code></pre>\n\nI always fail to locate it. I'm new to this so is the steps I took the right direction? If no how can I locate the string in the heap?\n** this is injected with normal flow of the program, it accepts data from user. Let's say it's a serial number to be entered for instanc, which is placed in the heap using <pre><code>HeapAlloc</code></pre>\n",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ollydbg",
        "c",
        "memory",
        "heap"
    ],
    "user": "AK_",
    "time": "Dec 29, 2017 at 11:57",
    "comments": [],
    "answers_data": [
        {
            "content": "There is two ollydbg plugins that can help you to see the heap data.  \n1- Heap Vis by Pedram Amini\nYou may have noticed the ghosted 'Heap' option under the 'View' menu in OllyDBG. The feature is available only under Windows 95 based OSes and is supposed to display a list of allocated memory blocks. The Olly Heap Vis plug-in was written to provide this functionality and more on all modern Windows OSes such as Windows 2000, XP and 2003. The OllyDbg Heap Vis plug-in exposes the following functionality:\n\nView Heaps\nSearch Heaps\nJump to Heap Chunk\nCreate Heap Visualization   \n\n\nhttp://www.openrce.org/downloads/details/1/Heap_Vis \n2- OllyHeapTrace by Stephen Fewer\nOllyHeapTrace (Written in 2008) is a plugin for OllyDbg (version 1.10) to trace the heap operations being performed by a process. It will monitor heap allocations and frees for multiple heaps, as well as operations such as creating or destroying heaps and reallocations. All parameters as well as return values are recorded and the trace is highlighted with a unique colour for each heap being traced.\nThe primary purpose of this plugin is to aid in the debugging of heap overflows where you wish to be able to control the heap layout to overwrite a specific structure such as a chunk header, critical section structure or some application specific data. By tracing the heap operations performed during actions you can control (for example opening a connection, sending a packet, closing a connection) you can begin to predict the heap operations and thus control the heap layout.  \n\nhttps://github.com/stephenfewer/OllyHeapTrace\n",
            "votes": "2",
            "user": "user22363",
            "time": "Dec 29, 2017 at 14:15",
            "is_accepted": true,
            "comments": []
        }
    ]
}