{
    "title": "Identifying Checksum?",
    "link": "https://reverseengineering.stackexchange.com/questions/17140/identifying-checksum",
    "content": "I bring you either a hard challenge or the easiest challenge you've ever had.\nI have a save file for this game The first bytes are:\n<pre><code>F9 29 CE 54 02 4D 71 04 4D 71 00 00 \n</code></pre>\nthis is the same throughout every save file I create, now this is where I come to you guys, I can't see anywhere in IDA where it's generating this \"checksum\" I looked at the string refs for \"savegame.dat\" it's reffed in 3 places but when I do C psuedo-code I can't see any writing to file happening around the refs, so maybe I am going crazy?\nAnyway, like I was saying, the check sum I get back looks like this: \n<pre><code>45 13 CD 5A 02 00 00 00\n</code></pre>\nIt might not end in the trailing 00's, I only include them because this goes up to 8 bytes which seems logically, there is still lots of file to go, but it goes randomly like 05, 02, 01 etc so I don't think it would be needed however a better person will likely prove me wrong :).\n<pre><code>45 56 42 E5 01 00 00 00\nC4 94 3D 73 08 00 00 00\n4C 67 FA 44 01 00 00 00\n45 13 CD 5A 02 00 00 00\nD8 9A F1 E6 0A 00 00 00\nF7 84 4F 99 02 00 00 00\n18 4B 4F 56 02 00 00 00\n25 44 F6 AF BF 00 00 00\n</code></pre>\nWhat little advice I can offer is there was a section later in this file that had\n<pre><code>00 00 00 00 00 00 00 00 00 00 00 00 E2 07 00 02 07 77 18 00 46 00 00 00 E2 07 00 02 07 B7 B0 00 66 01 00 00 00 00 00 00 00 00 00 00 00 00 00 00 7E 00 00 00 00 00 00 00 00 00 00 00 01 00 00 00\n</code></pre>\nwhich after testing with someone we determined this is \"Creation\" and either \"Last accessed\" or \"Last modified\" we found this out because what goes into E2 07's in INT16 - Little Endian is what the year is, although we don't know what the last few parts are. But that isn't what this is about. It's more an idea saying that it might be fully Little Endian.\nAny advice how I could find in Ida or anything else would be greatly appreciated :).\n",
    "votes": "0",
    "answers": 1,
    "views": "147",
    "tags": [
        "file-format",
        "hex"
    ],
    "user": "Jalomba",
    "time": "Jan 7, 2018 at 10:27",
    "comments": [],
    "answers_data": [
        {
            "content": "Turns out it was a XOR'd checksum, managed to figure it out and will be here: https://github.com/Arefu/Wolf if people want to see it in action in the future.\n",
            "votes": "0",
            "user": "Jalomba",
            "time": "Jan 8, 2018 at 1:28",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Megabeets",
                    "text": "<span class=\"comment-copy\">Please mark your answer as accepted :)</span>",
                    "time": null
                },
                {
                    "user": "Jalomba",
                    "text": "<span class=\"comment-copy\">Waiting for the new day :).</span>",
                    "time": null
                }
            ]
        }
    ]
}