{
    "title": "Find functions that constantly calls another",
    "link": "https://reverseengineering.stackexchange.com/questions/17186/find-functions-that-constantly-calls-another",
    "content": "Here is a brief list of all the places where this particular function gets called in IDA Pro.\nWhat this function does is return 1/60=0.01666 (the game tick's timestep) from a pointer, which value is used in the physics calculations of the game.\nI want to find where is this function constantly getting called in order to determine where I should look to analyse just the relevant code, instead of going through the entire list 1 by 1.\nI know I have to do this while debugging and I need the fastest way to narrow down the list.\nEdit after ~4 years lol:\nYou can hook the function and call _ReturnAddress, at least for MSVC.\n",
    "votes": "0",
    "answers": 2,
    "views": "161",
    "tags": [
        "functions"
    ],
    "user": "nukeulater",
    "time": "Sep 20, 2022 at 13:59",
    "comments": [
        {
            "user": "Jongware",
            "text": "What tool are you using? It would really be useful to know that.\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "@usr2564301 looks like IDA...\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I'd solve this by running the target in a debugger and putting a logging bp on the function (OllyDbg has them, should be Ctrl+F2 if I remember correctly) that just writes out the return address from the stack.\nThat will spam your log and you quickly should see which return address appears the most.\n",
            "votes": "2",
            "user": "Johann Aydinbas",
            "time": "Feb 13, 2018 at 17:58",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "If this is for a game and you want to approach this via dynamic analysis, my personal approach is to use Cheat Engine, then in the Memory Viewer window, click Tools -> Dissect Code.\nYou can now go to the prologue of that function you're interested in, then see all the calls that lead to the function (they'll be grouped via multiple lines just above the first instruction of the sub-routine). You can then double-click on any of those calls to go to that particular call's location and start having a field day researching from there.\nI'm sure there is either in-built functionality or plug-ins you can use to essentially achieve the same sort of code analysis to find all calls to  thing statically via x64dbg, IDA, etc.\n",
            "votes": "0",
            "user": "dsasmblr",
            "time": "Jan 12, 2018 at 23:24",
            "is_accepted": false,
            "comments": []
        }
    ]
}