{
    "title": "Reversing PE - which tools should beginner use?",
    "link": "https://reverseengineering.stackexchange.com/questions/17197/reversing-pe-which-tools-should-beginner-use",
    "content": "As a beginner  i want to ask u some questions.\nWell , i'm not talking about all kinds of programs... i'm just asking for PE ( executables ) for windows -> (.exe) extension\nso , i don't know which tools should i use.\nAnd what's the difference between :\n<pre><code>IDA - Ollydbg - Immunity_Debugger - x64dbg</code></pre>\nThanks ^_^ ...\n",
    "votes": "-2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "debugging"
    ],
    "user": "9ys",
    "time": "Jan 16, 2018 at 11:58",
    "comments": [],
    "answers_data": [
        {
            "content": "I'd suggest you to read Dennis Yurichev's book \"Reverse Engineering for beginners\". \nThe answer to your specific question about tool difference is covered in chapter 7:\nIDA is a disassembler (a tool for static analysis of the code, intended to observe the code), and all the rest are debuggers (tools for dynamic analysis, intended to observe the code's behavior in action).\nIn general there are a lot of different tools depending on what exactly do you want to achieve:\n\nDisassemblers (see answers to Is there any disassembler to rival IDA Pro? )\nDecompilers (Ida Pro has decompiler inside, there is also https://retdec.com/home/ )\nDebuggers (OllyDbg, x64dbg, etc)\n",
            "votes": "4",
            "user": "w s",
            "time": "Jan 15, 2018 at 8:53",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">Plus every web page you can find on the PE format (some esoteric tidbits are quite rare). And be very confident in your assembler skills. And, for software for Windows, know enough about its APIs to be able to find what you are looking for on MSDN.</span>",
                    "time": null
                }
            ]
        }
    ]
}