{
    "title": "What is a \"goodboy/badboy\" [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/17276/what-is-a-goodboy-badboy",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 7 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm confused and I'm trying to follow the Radare 2 Crackme Challanges. In it, they say,\n\nThis seems to be a goodboy/badboy.\n\nIs a \"goodboy/badboy\" lingo for a specific thing, and if so what?\n",
    "votes": "-1",
    "answers": 1,
    "views": "281",
    "tags": [
        "radare2",
        "crackme"
    ],
    "user": "Evan Carroll",
    "time": "7 years ago",
    "comments": [
        {
            "user": "julian",
            "text": "stackoverflow.com/questions/9251568/…\n",
            "time": null
        },
        {
            "user": "julian",
            "text": "I'm voting to close this question as off-topic because it is about colloquialisms\n",
            "time": null
        },
        {
            "user": "Evan Carroll",
            "text": "@SYS_V what's the difference between a technical colloquialism, and \"terminology\"\n",
            "time": null
        },
        {
            "user": "julian",
            "text": "if it was about terminology instead of slang I would still vote to close\n",
            "time": null
        },
        {
            "user": "adric",
            "text": "I recall that terminology in Lena151's reversing tutorials. When changing program execution program flow she designates the desired function calls / modules (like congratulatory dialog boxes) as \"good boy\" and the undesired calls/subroutines (like early exit) as \"bad boy\"\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "The \"good boy\" is the thing that lets you know you were successful in your cracking/patching. The \"bad boy\" is the thing that lets you know you're unsuccessful.\nIn a commercial app, a \"good boy\" would be akin to a message box saying, \"Thank you for entering a valid license! You're now fully registered.\" Whereas the \"bad boy\" would be the message box that says, \"I'm sorry. That's an invalid license. Please enter a valid license.\"\n",
            "votes": "4",
            "user": "dsasmblr",
            "time": "Jan 24, 2018 at 19:21",
            "is_accepted": false,
            "comments": []
        }
    ]
}