{
    "title": "What is an \"addend\"?",
    "link": "https://reverseengineering.stackexchange.com/questions/17346/what-is-an-addend",
    "content": "From Learning Linux Binary Analysis by Ryan \"elfmaster\" O'Neill. On Page 32, the author states,\n\nThe relocation records for 32-bit ELF files are the same as for 64-bit, but use 32-bit integers. The following example for are object file code will be compiled as 32-bit so that we can demonstrate implicit addends, which are not as commonly used in 64-bit. An implicit addend occurs when the relocation records are stored in <pre><code>ElfN_Rel</code></pre> type structures that don't contain an <pre><code>r_addend</code></pre> field and therefore the addend is stored in the relocation target itself. The 64-bit executables tend to use the <pre><code>ElfN_Rela</code></pre> structs that contain an explicit addend. I think it is worth understanding both scenarios, but implicit addends are a little more confusing, so it makes sense to bring light to this area.\n\nWhat is the actual definition of an \"addend\"?\n",
    "votes": "1",
    "answers": 3,
    "views": "2k",
    "tags": [
        "symbols",
        "dynamic-linking",
        "terminology"
    ],
    "user": "Evan Carroll",
    "time": "Mar 13, 2019 at 6:03",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "english.stackexchange.com/search?q=addend\n",
            "time": null
        },
        {
            "user": "Ian Cook",
            "text": "Addend+addend, minuend-subtrahend, multiplicand*multiplier, dividend/divisor\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I think it just means \"a number that's added\", and in this case \"the number that's added to the base load address (or segment load address) to compute the final pointer for this relocation\".\nLet's imagine that when we load our binary into memory at 0x400000 we have a pointer at 0x401234 that points to 0x405678. (If instead we loaded the binary at 0x800000 then this should point to 0x805678, hence it needs relocating.) I don't know ELF, but my reading of this is that\n\nin the implicit case the relocation table stores just offsets into your binary, in this case 0x1234, and in our binary at offset 0x1234 we store the target offset 0x5678. Therefore relocation becomes\nfor each address <pre><code>A</code></pre> in the relocation table <pre><code>*(base + A) += base</code></pre> \n(This is how relocation tables work in PE files.)\nin the explicit case, the relocation table stores both the offset into your binary and the target offset, i.e. 0x1234 0x5678. So relocation here is\nfor each address pair <pre><code>A, B</code></pre> in the relocation table <pre><code>*(base + A) = base + B</code></pre>\nI don't know what goes in the binary at offset 0x1234 in this case.\n",
            "votes": "2",
            "user": "Rup",
            "time": "Jan 31, 2018 at 7:29",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Augend is a term that means a number that is subject to addition\nAddend is the number that you will be adding.\n\nFrom Dictionary.com,\n\nHave you ever found yourself staring at a piece of paper with “3 + 4” written on it, and wondered ‘what is the proper term for each of these two respective quantities?’ No? The first number is the augend and the number that is added to it is the addend.\n\nYou can see a chart of other math terms here on Wikipedia's \"Calculation results\",\n\nWhy the special terms here?\n\nWell, that's likely because in assembly <pre><code>add rbi, rax</code></pre> will actually store the result in <pre><code>rbi</code></pre>. So knowing the first argument is not just an argument to <pre><code>add</code></pre> but the destination; <pre><code>add rax, rbi</code></pre> will store the result in <pre><code>rax</code></pre>. If assembly was displayed with operators instead, we'd have <pre><code>rbi += rax</code></pre> and <pre><code>rax += rbi</code></pre>.\nBecause the addend is not always an offset, and the augend is not always the base. Though in this specific example, \"offset\" is far more appropriate.\nIn this specific case, the term \"implicit offset\" can be found in the Tool Interface Standard (TIS) Executable and Linking Format (ELF) Specification\nVersion 1.2,\n\n... only <pre><code>Elf32_Rela</code></pre> entries contain an explicit addend. Entries of type <pre><code>Elf32_Rel</code></pre> store an implicit addend in the location to be modified. Depending on the processor architecture, one form or the other might be necessary or more convenient. Consequently, an implementation for a particular machine may use one form exclusively or either form depending on context.\n",
            "votes": "2",
            "user": "Evan Carroll",
            "time": "Mar 13, 2019 at 6:25",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "Addend is simply \"a number to be added to another\", according to Merian Webster.\n",
            "votes": "1",
            "user": "Joezer",
            "time": "Mar 12, 2019 at 7:52",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Paweł Łukasik",
                    "text": "<span class=\"comment-copy\">It was already stated in the existing answer. You could add a bit more to your answer to make it more informative.</span>",
                    "time": null
                }
            ]
        }
    ]
}