{
    "title": "Can more than one person disassemble part of a file? [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/17394/can-more-than-one-person-disassemble-part-of-a-file",
    "content": "This question already has answers here:\n                                \n                            \n\n\n\n\nIs there an actively maintained collaboration plugin for IDA?\n\n                                (2 answers)\n                            \n\nClosed 7 years ago.\n\n\n\nI am looking to outsource a disassembly project. Basically I need to add custom code to a MCP5xxx MCU and change the function of a certain part. \nI have identified, named and found the axis for around 6800 lookup tables, identified blank data.\nAs I have little programming experience I need to outsource this but I have to have it done within a week. \nIf I choose two freelancers in say two countries to speed things up how can I make sure that they're not overlapping each other and the disassembled code is correct?\nWhat systems are used in such cases? IDA pro seems to be the most popular choice for this MCU\n",
    "votes": "0",
    "answers": 2,
    "views": "155",
    "tags": [
        "ida",
        "disassembly"
    ],
    "user": "Newbie Noob",
    "time": "7 years ago",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "have you checked this? bitbucket.org/argussecurity/psida\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "First of all, sorry if my answer sounds rude, but I prefer to be realistic instead of condescending.\n\nAs I have little programming experience I need to outsource this but I\n  have to have it done within a week.\n\nMost reverse engineering projects, even when done by seasoned reversers, cannot be done \"within a week\", unless they are trivial.\n\nIf I choose two freelancers in say two countries to speed things up how\n  can I make sure that they're not overlapping each other and the \n  disassembled code is correct?\n\nShort answer: you cannot be sure. Also, most likely, having 2 people working on the same database will slow down it instead of speeding up. It might speed things up when working on different, isolated, pieces of code/binaries and, still, communication between different time zones, agreeing things, explaining what one did to the other, etc... will slow down the project.\n\nWhat systems are used in such cases? IDA pro seems to be the most\n  popular choice for this MCU\n\nIDA is the de-facto tool for reverse engineering, although other tools might be used. But, in any case: reverse engineering an ECU (probably) by 2 persons within a week? Yeah, no. I don't think it will work unless you find out people that already have done that. Good luck...\n",
            "votes": "4",
            "user": "joxeankoret",
            "time": "Feb 6, 2018 at 9:35",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "In general what you're looking for is rather impossible - one needs to tinker with the whole binary in order to force it to make sense aka decompile (this is an opinion). Although you can try any of several existing (not sure how good they are) tools to parallelise work on the same IDA Pro database. IMMV. I recall there were several announced in the last few years.\nIs there an actively maintained collaboration plugin for IDA?\nhttps://github.com/cseagle/collabREate\nhttps://github.com/CubicaLabs/IDASynergy\nhttps://solidarity.re/\nand so on.\n",
            "votes": "1",
            "user": "Vitaly Osipov",
            "time": "Feb 6, 2018 at 7:50",
            "is_accepted": false,
            "comments": [
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">When you're working in a project with people from different \"geographic workplaces\", most of these collaborative plugins simply don't work because they require you to be connected in the same network. Yeah, you can use it with a VPN but... no. Also, such tools, IMHO, create more problems than talking and sharing scripts/databases between reversers. Why? Let's say that 2 reversers worked in the same subset of functions. Which comments and names are correct? Which ones aren't?</span>",
                    "time": null
                },
                {
                    "user": "Vitaly Osipov",
                    "text": "<span class=\"comment-copy\">@joxeankoret I concur :)</span>",
                    "time": null
                }
            ]
        }
    ]
}