{
    "title": "Upgrading IDA Free 5 Database to IDA 7 Freeware",
    "link": "https://reverseengineering.stackexchange.com/questions/17397/upgrading-ida-free-5-database-to-ida-7-freeware",
    "content": "With the release of IDA 7.0 Freeware, I've been wanting to open some of my academic projects I've been doing with IDA 5 in the new version.\nHowever, the database format has changed. I have a set of <pre><code>.idb</code></pre> files which will not be opened by IDA 7.\nWhat I have tried so far:\n\nOpening the file directly in IDA as recommended in the manual. It's not listed as an option in the open menu, and when forced, it says it can't disassemble the file.\nRename the <pre><code>.idb</code></pre> file to <pre><code>.id0</code></pre>. It first reports that the file is not closed, asking to repair it. If I say Yes, it reports <pre><code>bTree error: bad B-tree header</code></pre>.\nRename the <pre><code>.idb</code></pre> file to <pre><code>.i64</code></pre>. It shows <pre><code>Please use 32-bit version of IDA to open <file></code></pre>. There is no 32-bit version of IDA 7 Freeware.\n",
    "votes": "8",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida"
    ],
    "user": "Kupiakos",
    "time": "Feb 6, 2018 at 7:36",
    "comments": [],
    "answers_data": [
        {
            "content": "Have you tried using the IDC importing procedure? It's also listed in the manual (https://www.hex-rays.com/products/ida/support/idadoc/444.shtml). Basically:\n\nExport from IDA old to <pre><code>.idc</code></pre> (this will generate an IDC file)\nRun new IDA with switch <pre><code>-x</code></pre> with your old IDB database (From my experience, this just opens IDA and autoanalyzes everything again, I'm not sure if that's the expected behavior)\nExecute the IDC file with IDA new (This is supposed to apply all manual work you've done in your old IDB database and apply it to the new database).\n\nThat said, I haven't had any luck getting this to work, but it's supposed to, so maybe you'll have better luck than me, please report back if you have any :).\n",
            "votes": "1",
            "user": "Edu Garcia",
            "time": "Mar 18, 2018 at 22:20",
            "is_accepted": false,
            "comments": []
        }
    ]
}