{
    "title": "can't edit class file with recaf.0.9 without re-compile",
    "link": "https://reverseengineering.stackexchange.com/questions/17450/cant-edit-class-file-with-recaf-0-9-without-re-compile",
    "content": "I have this java code\n<pre><code>public class HelloWorld\n{\n    public static void main(String[] args) {\n        System.out.println(\"Hello World!\");\n    }\n}\n</code></pre>\nI compile to class file, run it , and all fine.\nI want to edit it via class file.\nI open the <pre><code>HelloWorld.class</code></pre> with recaf.0.9, click on recompile, than I edit the code and save it, but the code not changes.\nHow can I edit .class file and not recompile it , and not working with bytecode.\nI want for example add if else to this code(via the class file)\n",
    "votes": "2",
    "answers": 1,
    "views": "3k",
    "tags": [
        "decompilation",
        "java",
        "byte-code"
    ],
    "user": "cdcsccd",
    "time": "Feb 12, 2018 at 21:58",
    "comments": [],
    "answers_data": [
        {
            "content": "How can I edit .class file and not recompile it , and not working with bytecode.\n\nThese requirements are contradictory. You have to choose one or the other.\nThere are two main ways to edit Java code. You can either decompile the classfile, edit the decompiled source, and then try to compile it again, or you can edit it directly at the bytecode level using a bytecode disassembler and assembler such as Krakatau or a bytecode editor such as Recaf.\nDecompilation and recompilation is unreliable, since the process is lossy in both directions, so it will generally only work in simple cases. You're better off editing the bytecode directly, since this is faster and guaranteed to work for all classfiles, but it does require you to understand bytecode. Note that Recaf is also lossy (unlike Krakatau), although it won't matter unless you're doing something highly unusual.\n",
            "votes": "3",
            "user": "Antimony",
            "time": "Feb 13, 2018 at 0:05",
            "is_accepted": false,
            "comments": [
                {
                    "user": "cdcsccd",
                    "text": "<span class=\"comment-copy\">1)why Decompilation and recompilation is lossy2) if I want to edit directly the bytecode, how can I check if I done it well ? wach it on JD-GUI?  3) by the way, if I edit 1 function from big class via bytecode, but edit only the internal logic of this functon, is that influence on another functon?   thank you!</span>",
                    "time": null
                },
                {
                    "user": "Antimony",
                    "text": "<span class=\"comment-copy\">If you only edit the bytecode of one method, that won't affect any other methods. As for how to check your results, you could just disassemble it again.</span>",
                    "time": null
                },
                {
                    "user": "cdcsccd",
                    "text": "<span class=\"comment-copy\">I tried to edit bytecode (.class file) with <a href=\"http://cs.ioc.ee/~ando/jbe/\" rel=\"nofollow noreferrer\">cs.ioc.ee/~ando/jbe</a>   .I have class file with some functions ,  I tried to edit 1 func that get some arguments and have some local var .When I put this class file on intellij I see the name of arguments and name of local var .   but when I click on save on JBE , the name of all arguments and local var changed to var1,var2  . why? I want to edit byte code without delete anything</span>",
                    "time": null
                },
                {
                    "user": "Antimony",
                    "text": "<span class=\"comment-copy\">Most likely, the tool you used didn't preserve the metadata attributes. Have you tried using Krakatau? That will preserve everything by default.</span>",
                    "time": null
                },
                {
                    "user": "cdcsccd",
                    "text": "<span class=\"comment-copy\">I don't understand how to use Krakatau , Is there any gui to use it on windows? I only want to edit bytecode, I dont want to re-compaile code and can you tell me pleaase how can I only edit  byte code of 1 function from .class file that include few funcrion (I don't want touch another functions) without re-compaile it and saving on metadata?  ot o you know another tool with gui for that ? thanks!</span>",
                    "time": null
                }
            ]
        }
    ]
}