{
    "title": "How accurate is Cerberus for reverse engineering malware? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/1749/how-accurate-is-cerberus-for-reverse-engineering-malware",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nAccessData's Cerberus product claims to be :\n\nThe first step towards automated reverse engineering, Cerberus allows\n  you to determine the behavior and intent of suspect binaries, giving\n  you actionable intelligence without having to wait for a malware team\n  to perform deeper, more time consuming analysis.\n\nWhile this may be great for getting basic information about how various malware are functioning, I'm also curious about how much information this tool misses or inaccurately reports. \n\nDoes anyone have experience with Cerberus?\nHow accurate was this tool when reporting ?\nDid this tool miss any specific information or patterns ?\n",
    "votes": "4",
    "answers": 0,
    "views": "604",
    "tags": [
        "tools",
        "malware"
    ],
    "user": "Dan",
    "time": "11 years ago",
    "comments": [
        {
            "user": "Ange",
            "text": "sounds to me like: 'what do you think of this automated machine that is supposed to replace you and your experience?' / 'what do you think of that expensive machine even if you feel that you could implement this functionality yourself?'\n",
            "time": null
        },
        {
            "user": "Dan",
            "text": "@angealbertini I'm not asking for how people feel about the tool or about the automation of reverse engineering in general, I'm asking for an objective review of the capabilities of the product based on someone's firsthand testing/experimentation.\n",
            "time": null
        },
        {
            "user": "Robert Cartaino",
            "text": "I'm not sure this site is well-suited to \"answering\" if Cerberus is worth the investment or even how effective it is at fulfilling its claims. It might be an interesting discussion for a chat room or even an on-going discussion forum, but it's just not well-suited to this type of canonical Q&A format. Sorry about the confusion. See reverseengineering.stackexchange.com/about. If you have any specific questions about the day-to-day use of these tools, I hope you will try again.\n",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "@RobertCartaino There have been a lot of questions asking about which tool to use to do a specific task. Asking whether one of the recommended/suggested tools is effective or not, would be a progression of that. Moreover, this tool would probably have a very limited number of users, and spotting errors in its functioning would require a certain degree of expertise. Taking both of these factors into account, there would be a very limited number of people who would be able to answer this question.\n",
            "time": null
        },
        {
            "user": "zetavolt",
            "text": "Their description of the tool gives the impression of a GUI version of get_relocations + strings for forensics professionals. Significant reverse engineering skill is more honored in it's absence than it's observance among their target demographic and it's clear this tool caters to them. Stick with IDA and Immunity if you are serious.\n",
            "time": null
        }
    ],
    "answers_data": []
}