{
    "title": "Dis-assamble .exe file to .asm in IDA Python [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/17493/dis-assamble-exe-file-to-asm-in-ida-python",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 7 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI have 5K .exe files from different sources like C and C++. I want to Dis-assamble them into .asm file using IDA Python. Consider this .exe file opened in IDA with text view:\n\nI want this \"Assembly\" code but using Python script so that i can loop it on all exe files and save it in their respective .asm file. Anyone having a code to start-with will be a great help. Thanks!\n",
    "votes": "0",
    "answers": 1,
    "views": "736",
    "tags": [
        "ida",
        "idapython",
        "ida-plugin"
    ],
    "user": "M Haris Khan",
    "time": "7 years ago",
    "comments": [
        {
            "user": "Megabeets",
            "text": "And what did you try already? Please edit the question to limit it to a specific problem with enough detail to identify an adequate answer.\n",
            "time": null
        },
        {
            "user": "Dominik Antal",
            "text": "Try looking around on Github, there are many projects related to automating IDA. Check out this and this.\n",
            "time": null
        },
        {
            "user": "w s",
            "text": "hex-rays.com/products/ida/support/idadoc/417.shtml - I'm not sure that it will work with free version, but there is a -B command line switch of full version   of IDA that automatically generates both .idb and .asm.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Alas the Freeware version does not support IDAPython or any plugins other than those shipped with it. If you need to automate your disassembly, buy the full version.\n",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Feb 19, 2018 at 9:36",
            "is_accepted": false,
            "comments": [
                {
                    "user": "M Haris Khan",
                    "text": "<span class=\"comment-copy\">you are saying that writing and execution of IDAPython script is not possible until i buy a pro version?</span>",
                    "time": null
                }
            ]
        }
    ]
}