{
    "title": "Extract firmware from a usb device like for example a USB stick",
    "link": "https://reverseengineering.stackexchange.com/questions/17587/extract-firmware-from-a-usb-device-like-for-example-a-usb-stick",
    "content": "I am breaking my head the last few days over how you should extract the firmware from a USB device I searched all over the internet but I could not find a straight forward way to do it.\nJust to clarify I am trying to do this over the USB connection it self but if this isn't possible then that is just fine.\nI found some things about flashrom online but I don't really understand how it works and I don't know if it is capable of flashing / reading USB firmware ( I mean USB sticks and other peripherals)\nAny help would be very much appreciated\nThanks\n",
    "votes": "2",
    "answers": 4,
    "views": "15k",
    "tags": [
        "firmware",
        "usb"
    ],
    "user": "Misunderstood Salad",
    "time": "Mar 3, 2018 at 15:31",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "what kind of device it is? Did you open it and look at the components inside? Does the manufacturer provide firmware updates?\n",
            "time": null
        },
        {
            "user": "Misunderstood Salad",
            "text": "The device is a USB stick for some reason I can't find out what microcontroller it has inside but I think it is phison but as I said the provided tool from phison can't find the stick and even programs like chipgenius can't see what controller it is so I am not certain\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Sorry that I do not have enough reps to comment. So writing this as an answer instead.\nThe answers to these two questions seem to be be relevant to what you are asking as well. Have a look at them :\nHow do I extract a copy of an unknown firmware from a hardware device?\nHow to dump flash memory with SPI? (I know its SPI but some of the answers still could be relevant to your situation)\n",
            "votes": "1",
            "user": "PeterG",
            "time": "Mar 8, 2018 at 4:24",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "If it has a Cypress FX3 then it will double enumerate in Device Manager when you plug in the device, if that helps. The firmware is loaded FROM the driver and then the device will enumerate again.\nIt seems there are many usb packet sniffing tools, software or hardware.\n",
            "votes": "0",
            "user": "user1713462",
            "time": "Mar 6, 2018 at 5:57",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Usually there's some way to switch the usb drive into programming mode. Then usb drive is being shown as some new usb device, to which a flasher program can connect and upload/download the firmware. In most cases switching to this programming mode requires to connect specific pins on the usb drive board. Or it automatically switches to the programming mode when usb drive firmware gets corrupted.\n",
            "votes": "0",
            "user": "Anton Kukoba",
            "time": "Mar 7, 2018 at 8:48",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "hope this helps\nhttps://linux.die.net/man/8/flashrom\nWith regards\nBabu\n",
            "votes": "0",
            "user": "babu",
            "time": "Apr 12, 2018 at 11:51",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Paweł Łukasik",
                    "text": "<span class=\"comment-copy\">write a bit more. Maybe add the command how to use it?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\"><code>flashrom</code> only handles SPI flash chips. it won't handle NAND flash or know how to extract embedded  USB controller firmware.</span>",
                    "time": null
                }
            ]
        }
    ]
}