{
    "title": "Finding OEP in a VMProtect v3.0 protected malware",
    "link": "https://reverseengineering.stackexchange.com/questions/17604/finding-oep-in-a-vmprotect-v3-0-protected-malware",
    "content": "I've been trying to reverse engineer a malware that has been packed with <pre><code>VMProtect v3.0</code></pre>. My first instinct was to google an automated way for this and I found a script. Unfortunately the script to unpack <pre><code>VMProtect</code></pre> protected binary does not work with version 3.0.\nSo far I've seen that the packer changes the access rights of the sections to be writable, decrypts the original code and writes the code to the sections then changes the access rights for those sections back to their initial values. I saw that by putting breakpoint on the <pre><code>VirtualProtect</code></pre> API. After the final call to <pre><code>VirtualProtect</code></pre> I put the access breakpoint on the sections that had <pre><code>executable</code></pre> right and when my breakpoint was hit I expected it to be the <pre><code>OEP</code></pre> but when I dumped the process it did not run.\nFrom my research I understand that you need to rebuild the <pre><code>IAT</code></pre> and tools like <pre><code>UIF</code></pre> & <pre><code>Scylla</code></pre> won't be any help. Can you give me some tips on how to find the <pre><code>OEP</code></pre> or how to deal with this kind of packing mechanism in general?\nP.S. This is the first time I am dealing with <pre><code>VMProtect</code></pre> protected malware.\nUPDATE\nSha256 Hash: <pre><code>8200755cbedd6f15eecd8207eba534709a01957b172d7a051b9cc4769ddbf233</code></pre>\n",
    "votes": "4",
    "answers": 4,
    "views": "21k",
    "tags": [
        "malware",
        "unpacking",
        "anti-debugging",
        "anti-dumping"
    ],
    "user": "rustam Shirinov",
    "time": "Sep 24, 2018 at 22:33",
    "comments": [
        {
            "user": "TechLord",
            "text": "OK, so this malware is protected with the VMProtect (v3.0.465)  with even a valid taggant.Since VMP is a commercial protector,would like the admins to comment whether it would violate the rules of this site if I discuss in detail the steps of finding the OEP and re-building the IAT, as asked by the OP. I would hate to spend a couple of hours writing an answer only to have it deleted, as I see happening quite frequently these days (sorry). Waiting for a confirmation to go ahead. Thanks.\n",
            "time": null
        },
        {
            "user": "rustam Shirinov",
            "text": "waiting fingers crossed...\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Here are a few  links that address your question in a broad manner:\n\nVMAttack: Deobfuscating Virtualization-Based Packed Binaries\nLink to PDF Paper which uses the VMAttack IDA PRO Plugin.\n\nUnpacking Virtualization Obfuscators by Rolf Rolles.\nUnpacking the FinSpy VM, parts #1, #2, #3\nVarious other articles by Rolf Rolles .\n",
            "votes": "6",
            "user": "PeterG",
            "time": "Mar 8, 2018 at 21:33",
            "is_accepted": true,
            "comments": [
                {
                    "user": "knx",
                    "text": "<span class=\"comment-copy\">You should also mention syntia (<a href=\"https://github.com/RUB-SysSec/syntia\" rel=\"nofollow noreferrer\">github.com/RUB-SysSec/syntia</a>). (Paper: <a href=\"https://www.usenix.org/system/files/conference/usenixsecurity17/sec17-blazytko.pdf\" rel=\"nofollow noreferrer\">usenix.org/system/files/conference/usenixsecurity17/…</a>)</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Set a breakpoint on the \"VM exit\" instruction (though there may be more than one of these if the sample is using the multiple VM option, whose proper name I don't recall). From here you can see where the VM transfers control when it exits. It will exit several times during \"packer\" mode. Eventually it will exit to OEP.\n",
            "votes": "3",
            "user": "Rolf Rolles",
            "time": "Mar 11, 2018 at 1:22",
            "is_accepted": false,
            "comments": [
                {
                    "user": "rustam Shirinov",
                    "text": "<span class=\"comment-copy\">Heey I read your articles about reversing FinFisher after I asked the question. After reading them I realized it was not as easy as putting a breakpoint on an API call. I learned a lot from them. Now I am trying to find the Vm exit instruction. It is not easy to do if you are dealing with VMProtect at least for me</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Since you say it's malware please provide either the SHA256/MD5 hash or a Virustotal/Hybrid-analysis link of the target so that I can take a quick look at it.  \nVMP and its protection mechanisms differ wildly in terms of complexity and characteristics between versions and even builds, in some cases.  \nFor example, many techniques of finding the OEP and rebuilding the IAT which are successful for targets packed with VMP v2.xx fail miserably when attempted on targets packed with VMP v3.xx. \nAs such its impossible to characterize and give a detailed canonical answer that would address all concerns and cover all versions of VMP.  \nWhat I guess can be done is that if you give us the links/hashes of the malware, I would be able to take a look at it and then discuss the answer in the context of that version VMProtect used to pack the malware.  \nNote: :Since VMProtect is a commercial protector, I understand would be appropriate to discuss it only in the context of reversing the malware that was protected with it, to avoid this question being closed off as being off-topic or too broad..  \nHence I guess that unless you can give us more details of the target you are attempting to reverse, we cannot proceed further.\n",
            "votes": "2",
            "user": "TechLord",
            "time": "Mar 8, 2018 at 0:45",
            "is_accepted": false,
            "comments": [
                {
                    "user": "rustam Shirinov",
                    "text": "<span class=\"comment-copy\">I updated my question with the sha256hash of the sample</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Note: I never unpacked VMProtect myself.\nFrom looking at a sample unpackme, all intermodular calls that normally pointed to the IAT, are replaced with direct calls to what I think are obfuscated redirections inside the VMProtect's section that eventually lead to code inside .dlls. It's possible the executable will function if dumped correctly without rebuilding the import table, but it won't work after a reboot when .dll addresses change. Easy but unreliable ways of knowing which redirection leads to which imported function I can think of are by tracing or setting execution breakpoints on imported .dlls and calling the redirections. You can also dig deep into the import resolution mechanism of VMProtect.\nSome protections virtualize the entire entrypoint function but I don't know if VMP has that as a feature. This means setting a page guard on the executable section won't break on the OEP - it's going to break on the first non-virtualized function called by the OEP function. The virtualized OEP function executes inside the protector's section. So if the OEP is virtualized what I'd try doing is finding the VM entry for that function (in VMProtect it's a push  + call pattern) and setting the entrypoint to that when dumping. You can also paste the entrypoint function from another unprotected executable - for example if you have an earlier unprotected build of this malware compiled in the same environment in which case it's possible you even can borrow the imports.\n",
            "votes": "1",
            "user": "Guest",
            "time": "Mar 7, 2018 at 18:33",
            "is_accepted": false,
            "comments": []
        }
    ]
}