{
    "title": "How to paste 30-(N) number of assembly code to ollydbg",
    "link": "https://reverseengineering.stackexchange.com/questions/17616/how-to-paste-30-n-number-of-assembly-code-to-ollydbg",
    "content": "I need to copy some code of old version to the new version .exe file. It contains 30 to (N) number of code line. How can I copy and paste the old code to new version. Any help is so much appreciated. Basically I need to do it like what Fill with NOP does(which is noping N number of lines) I need to copy and paste a code like N number of times.\n",
    "votes": "0",
    "answers": 2,
    "views": "618",
    "tags": [
        "ollydbg"
    ],
    "user": "arc",
    "time": "Mar 6, 2018 at 3:27",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "why you need to do it in Olly? can't you just copy bytes from one binary to the other at a specified offset? a simple python script would suffice\n",
            "time": null
        },
        {
            "user": "arc",
            "text": "I actually just want olly. I don't program in python.\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "well, than any other programming language\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "you can copy paste binary bytes between two ollydbg instances \nselect bytes rightclick->edit -> binary copy (ctrl+insert) from source   \nselect bytes -> right click _> binary paste (shift + insert) in destination\n",
            "votes": "1",
            "user": "blabb",
            "time": "Mar 6, 2018 at 5:30",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "There many ways to do this.\nI once had to add 3000 lines to a program . The answer above works , but your life will become much ,much harder this way.\nUse this tool MLA from Ramm michael\nIn Olly , you can just right click and open a part or section if highlighted in this notepad like plugin. You can just simply copy paste and click to insert assembly. \nI like this tool  because as you go along you can simply just edit your code and click the assemble button and that is it! Its like coding assembly without needing to compile!\nAs a warning, make sure your code fits. Usually , I will code cave or something and then jump back to the origional code.\nLet me know.of you have questions. The tool is pretty simple to use and Ramm is a pretty cool guy. \nHere is a video that uses this a bit.\nAssembly tutorials\n",
            "votes": "0",
            "user": "LUser",
            "time": "Mar 6, 2018 at 5:46",
            "is_accepted": false,
            "comments": []
        }
    ]
}