{
    "title": "In what industries is [code] reverse engineering used?",
    "link": "https://reverseengineering.stackexchange.com/questions/1769/in-what-industries-is-code-reverse-engineering-used",
    "content": "While we all know what fun reverse engineering of code can be, I am wondering what legitimate industries, besides the anti-X industry, reverse engineer code? While this may sometimes be needed in many technical roles, I am speaking more of jobs where this is a primary responsibility. I suspect there are very few jobs where reverse engineering is a necessary skill, or few that would be admitted to, but don't know that for certain. Yes, it is of course always a complementary skill!\n",
    "votes": "18",
    "answers": 6,
    "views": "2k",
    "tags": [
        "disassembly",
        "career-advice"
    ],
    "user": "dyasta",
    "time": "Jan 28, 2019 at 10:38",
    "comments": [],
    "answers_data": [
        {
            "content": "Community wiki: feel free to edit\nAs a main skill\n\nmalware analysis\ndigital forensics and Incident response\nsecurity assessment, pen testing\n\nis this website/software/cpu really secure? which one is the most secure?\n\nexploit development\n\nsi vis pacem, para bellum\n\nplagiarism detection (if a company sues another one because they claim they stole their source code)\nemulation\n\nadapting older games to newer medias\n\nsuch as DotEmu, Good old games\n\nadapting older hardware to newer\n\nemulate older protection dongles for no longer supported softwares\n\n\nsource code recovery\n\nbecause backup may fails\n\nbusiness logic recovery / process recovery (regarding Legacy Systems)\n\nbecause documenting all the quirks, workarounds and clever solutions adequately is hard\n\n\nAs a side skill\n\nunderstanding what a program is about\n\nbecause too often, one doesn't have the time to document how an internal tool works\n",
            "votes": "21",
            "user": "4 revs, 3 users 92%Ange",
            "time": "Jan 2, 2014 at 22:17",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Here's a few that you may not usually think about:\n\nCar tuning shops. A lot of modern car tuning is basically firmware hacking.\nCompiler development. When you're making a toolchain that produces code that other people will rely on, it's good to have an outside tool for sanity check.\nGeneral software development. While debuggers are usually enough, sometimes you need to RE your own program to realize what's going on. Or look inside a library you're using when docs are incomplete, wrong, or just plain missing.\nChecking out what your competitors are doing (both software and hardware).\n",
            "votes": "14",
            "user": "Igor Skochinsky",
            "time": "Apr 14, 2013 at 21:21",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">as for the first point I can tell you that there is a difference between the people packing <i>that</i> experience under their belts and the ones selling/offering it.</span>",
                    "time": null
                },
                {
                    "user": "Rolf Rolles",
                    "text": "<span class=\"comment-copy\">+1 for the comment about RE as a part of the software development process.  I can't tell you how many times IDA has saved my ass during development, where I have some linker error that is driving me insane, and I just open the offending objects in the disassembler and all becomes clear.  Similarly for things that I would swear are \"compiler errors\" which turn out to be my fault.  And that experience also helps me debug my software much better.</span>",
                    "time": null
                },
                {
                    "user": "dyasta",
                    "text": "<span class=\"comment-copy\">Good points! Especially about reverse engineering competitor's products. I remember having to reverse other packers when PECompact was in development over a decade ago, as I couldn't figure out how in the world they packed so tight. I found the answer by reversing: BCJ2 (x86 jmp/call offset optimization). At the time, it was quite a revelation!</span>",
                    "time": null
                },
                {
                    "user": "gandolf",
                    "text": "<span class=\"comment-copy\">+1 for firmware hacking, and firmware development. In fact I found myself doing trivial RE when developing small robotics or other hardware/software projects..And lots of companies, while do not explicitly list reverse engineering as a requirement for a developer position, it's a skill if not present makes you just a very 'technical writer' and not an actual software developer.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "No one seems to have mentioned compatibility yet. I know this isn't the biggest thing reversing is used for, but making software that is compatible with proprietary file formats or protocols is very important, fairly common, and explicitly protected by law in some countries.\nOften, a developer can use reversing as a \"complementary skill\", but in many cases it would make sense for this to be someone's job. For example, when using clean-room techniques, or if the file format or protocol is excessively complex.\n",
            "votes": "11",
            "user": "Dougall",
            "time": "Apr 15, 2013 at 0:16",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Probably a niche but my RE skills often help to get (CR)Applications to work in virtual environments such as Citrix XenApp/XenDesktop. \nI write a lot about these experiences on my blog.\nself promo warning: here are a few recent examples:\n\nThe case of the COM Port redirection\nCannot create shell notification icon error during unattended install\nThe case of the missing audio\n",
            "votes": "8",
            "user": "Remko",
            "time": "Apr 15, 2013 at 21:13",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Probably the security industry is the biggest user of reverse engineering. Malware analysis, analyzing binaries for potential security vulns, and analysis of patches to write security product signatures.\n",
            "votes": "1",
            "user": "broadway",
            "time": "Apr 14, 2013 at 19:37",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "It's rampant in the microprocessor industry; here are a few sources you might find interesting:\n\nhttp://www.techspot.com/article/599-amd-rise-and-fall/\nhttp://www.extremetech.com/extreme/56018-analyst-intel-reverseengineered-amd64\nhttp://www.darkreading.com/security/news/222600843\nhttp://uvicrec.blogspot.ca/2011/09/understanding-intel-4004.html\n",
            "votes": "1",
            "user": "Andrew Odri",
            "time": "Aug 14, 2013 at 0:10",
            "is_accepted": false,
            "comments": []
        }
    ]
}