{
    "title": "IDA 7.0 not recognizing plugins (Eg. ScyllaHide, IDAStealth)",
    "link": "https://reverseengineering.stackexchange.com/questions/17708/ida-7-0-not-recognizing-plugins-eg-scyllahide-idastealth",
    "content": "The problem I'm facing with the latest version of IDA (as of now) which is 7.0 is that it doesn't recognizes plugins, not even adding them in its Edit > Plugins menu tho this was not happening in IDA 6.x versions for me. As an example, my good old friend ScyllaHide is not showing up after I copy all the required files of it to the plugins folder of IDA and I forgot to mark the remaining files in the screenshot but HookLibraryx64.dll and the one under it (x86) and also InjectorCLI programs, NTApiCollection.ini (a must needed) and also ScyllaHide.ini are all present in this directory but it doesn't shows up, I watched a video in YouTube suggesting a solution and that was to edit the plugins.cfg file in the plugins directory and add the plugin file name and hotkey inside the config file manually, I tired that too but it didn't worked.\nScyllaHide works perfect on x64dbg and OllyDbg, I informed the maintainers of ScyllaHide in Github but they said its not the problem with the plugin. So if any of you had this experience, or can help me I'll be glad. \nAnd this problem is almost for all plugins, like FindCrypt2 and IDAStealth and x86emu.\n",
    "votes": "5",
    "answers": 2,
    "views": "10k",
    "tags": [
        "ida"
    ],
    "user": "Gas Can",
    "time": "Mar 15, 2018 at 19:43",
    "comments": [
        {
            "user": "joxeankoret",
            "text": "99% sure the plugins are, simply, not ported to IDA 7.0.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There's a possibility that they might need to be ported to run in IDA 7.0 specifically, as per the following: https://www.hex-rays.com/products/ida/7.0/docs/api70_porting_guide.shtml\n",
            "votes": "3",
            "user": "dsasmblr",
            "time": "Mar 16, 2018 at 5:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">@PsyCode can you post your solution in an answer?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "As others have said, plugins aren't ported to IDA 7.0.\nHowever, if you're looking for ScyllaHide, someone has modified the plugin to work with IDA version 7.\nYou can download it from this GitHub repo.\nCopy contents/files within the <pre><code>IDA</code></pre> folder:\n\nTo your IDA <pre><code>plugins</code></pre> directory. then, restart IDA.\nNow, ScyllaHide should be installed under edit -> Plugins -> ScyllaHide (or click on Alt + X):\n\nAnd ScyllaHide should be working:\n",
            "votes": "1",
            "user": "Glorfindel",
            "time": "Dec 30, 2022 at 16:57",
            "is_accepted": false,
            "comments": []
        }
    ]
}