{
    "title": "Trace back which function called the message box in x64dbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/17874/trace-back-which-function-called-the-message-box-in-x64dbg",
    "content": "I have an error message pop up on the screen every few seconds on a program.\nI would like to trace it back as to which function is calling the message box and why.\nI found the referenced string but how do I trace it back to who called the function?\n",
    "votes": "9",
    "answers": 1,
    "views": "12k",
    "tags": [
        "x64dbg"
    ],
    "user": "user5793353",
    "time": "Oct 5, 2018 at 18:38",
    "comments": [
        {
            "user": "dsasmblr",
            "text": "reverseengineeringtips.blogspot.com/2015/01/…\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can find this out by first running the program to the entry point to skip all of the boilerplate code, then go to the Symbols tab in x64Dbg, going to User32.dll and then filtering for the <pre><code>MessageBox</code></pre> functions. Place breakpoints on any functions with <pre><code>MessageBox</code></pre> in them and then run the program. Now, when MessageBox is called, the program will break and you can see where execution is.\nYou can trace the caller by going to your CPU tab and right-clicking in there, now go to Search For -> All Modules -> Intermodules References.\nNow, you will see a bunch of function calls and at the bottom is a box where you can enter a filter term. Type in <pre><code>MessageBox</code></pre> and you will see where the program calls <pre><code>MessageBox</code></pre> and you can then double-click to jump there or right click for more options, place a breakpoint, etc...\nI've attached an example using <pre><code>printf</code></pre> but in your case, you will use <pre><code>MessageBox</code></pre>. Note, this will only be correct if the MessageBox function is the function being used to display the message. If there is another library imported, it could be another function but the process is still similar.\n",
            "votes": "10",
            "user": "the_endian",
            "time": "Apr 3, 2018 at 8:09",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user5793353",
                    "text": "<span class=\"comment-copy\">Thank you! This was really helpful. :)</span>",
                    "time": null
                }
            ]
        }
    ]
}