{
    "title": "Remove a mutex on windows (with debugger/disassembler)",
    "link": "https://reverseengineering.stackexchange.com/questions/17889/remove-a-mutex-on-windows-with-debugger-disassembler",
    "content": "I'd like to patch an app to avoid it to use/create a specific mutex, because this one prevents the app from running in multiple instances. I'm already able to close the mutex's handle with a program called Process Explorer, but I'd like to not do it every time...\nHave you any idea to help me? I'm really new to mutex, semaphores, and stuff like this, and I have no idea how I can erase it from the app.\n",
    "votes": "1",
    "answers": 3,
    "views": "2k",
    "tags": [
        "windows",
        "patching"
    ],
    "user": "sebastien finor",
    "time": "Jul 3, 2020 at 7:59",
    "comments": [],
    "answers_data": [
        {
            "content": "There are 2 methods to do do this:\n\nUse an API hook to intercept the call to <pre><code>CreateMutex</code></pre> and change the mutex name (e.g. randomize it).\nMake a copy of the executable or dll that calls <pre><code>CreateMutex</code></pre> and search the Mutex name with a Hex editor (search for both ANSI and Unicode strings and modify the string. Make sure that you don't change the length of the string.\n",
            "votes": "2",
            "user": "Remko",
            "time": "Jun 3, 2018 at 19:17",
            "is_accepted": false,
            "comments": [
                {
                    "user": "sebastien finor",
                    "text": "<span class=\"comment-copy\">I tried your second method but the mutex is still there, it just have a brand new name :o. Anyway, I'm just gonna nop some stuff near the mutex call ans see how it goes. Thanks for your answer! :)</span>",
                    "time": null
                },
                {
                    "user": "Remko",
                    "text": "<span class=\"comment-copy\">Did you start the original process and the modified one? For the same reason as the original mutex name, you cannot launch multiple instances with the original name nor multiple instances with the new name. You should however be able to open the original exe and the modified one at the same time...</span>",
                    "time": null
                },
                {
                    "user": "sebastien finor",
                    "text": "<span class=\"comment-copy\">Oh ok I see what you mean now. I just tried to launch twice the modified process. I thought changing the name of the mutex would corrupt it.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "You need to find the code which creates the mutex. I.e. the call to CreateMutex/OpenMutex API function. And then patch it by overwriting the opcodes.\nSo you'll need to learn how to disassemble and how to patch the code of the executable. If it's new for you, you should try from some crackme tutorial, which will teach you to do this.\n",
            "votes": "1",
            "user": "Anton Kukoba",
            "time": "Apr 4, 2018 at 13:01",
            "is_accepted": false,
            "comments": [
                {
                    "user": "sebastien finor",
                    "text": "<span class=\"comment-copy\">Thanks. no problem with that, i know quite good how it works. I just didn't know at all of mutex before and wasn't sure of what to shearch for :).</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I did it. First I replaced the first instructions of the subroutine calling Windows API's CreateMutex by the \"ret\" of this function (it wasn't only \"ret\", but \"ret xxxh\", i don't know why). Then, I avoided the error call when handle is 0 (null) with a simple \"jz\" to \"jmp\" change.\nEdit: I could also have nopped the call and the 3 arguments before it, instead of replacing the first instruction of the call by ret.\n",
            "votes": "0",
            "user": "sebastien finor",
            "time": "Jun 6, 2018 at 22:46",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user22970",
                    "text": "<span class=\"comment-copy\">When calling a function, some arguments are pushed fo the stack and someone need to pop them for the program to keep it's execution correctly. That some is \"decided\" by the calling convention, it can be the caller, it can be fhe callee. Winapi uses the <code>stdcall</code> which states that the callee clears the stack from the arguments. Insted of poping x number of times to get rid of the argument, a <code>ret n</code> is performed. It basically remove n \"variables\" from the stack before returning. Without it, the program will execute incorrectly</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">I would like to offer another potential alternative, depending on what exactly the namespace of the mutex is.  A mutex, just like drive letters can be global or local. So <i>if</i> you are trying to run multiple instances of said application in different sessions <i>and</i> the application uses a name of the form <code>L\"Global\\\\MutexName123\"</code> you could patch the name to <code>L\"Local\\\\MutexName123\\0\"</code> in your binary (the <code>\\0</code> is a result of the length difference between <code>Global</code> and <code>Local</code>).  See: MSDN documentation on <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms684292.aspx\" rel=\"nofollow noreferrer\">Object Names</a></span>",
                    "time": null
                },
                {
                    "user": "sebastien finor",
                    "text": "<span class=\"comment-copy\">Thanks amirag :).  And your idea is cool 0xC0000022L. Do you think I could change the mutex name to \"Local\\[Restofmutexname]\"  even if it is not Global\\\\ before?</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@sebastienfinor: I don't think so. I'm fairly certain that it defaults to local already. However, keep in mind that this suggests that you aren't trying to run your program in different sessions, so my suggestion isn't applicable to your case.</span>",
                    "time": null
                }
            ]
        }
    ]
}