{
    "title": "How does QPST work and how can I make an app like it?",
    "link": "https://reverseengineering.stackexchange.com/questions/17892/how-does-qpst-work-and-how-can-i-make-an-app-like-it",
    "content": "How does Qualcomm's QPST work? Or what protocol/commands does QPST use? As I wanted to develop an app like it, I searched for AT commands. But I can't find out any AT commands that allows me access(read/write) my old phone's internal file system(firmware). Any helps like the name of the commands/protocols that QPST uses are appreciated.\nOr if my question is off-topic, where should I ask?\n",
    "votes": "2",
    "answers": 2,
    "views": "3k",
    "tags": [
        "firmware",
        "embedded",
        "kernel"
    ],
    "user": "Hyeonseo Yang",
    "time": "Apr 7, 2018 at 6:16",
    "comments": [
        {
            "user": "Willem Hengeveld",
            "text": "I think your question is fine, but maybe split it in one about qpst, and another about extracting firmware.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There is an open source project: openpst, which reimplements most functionality of the qpst tool.\nSome of the protocols used are:\n\ndiag - used to read nv memory, and switch to dload mode using <pre><code>kDiagDload</code></pre>.\nsahara - used by the primary bootloader in newer qualcomm chipsets\ndload, used by bootroms, and older chipsets.\nstreaming dload - used by the flash loader.\nfirehose - the xml style protocol used with <pre><code>rawprogram0.xml</code></pre> files.\n\n\nFlashing usually works like this:\n\nswitch to dload mode, this will start the bootloader.\nupload the <pre><code>NPRG*.{hex,mbn}</code></pre> flash loader using the sahara protocol\n\n\nthe <pre><code>ENPRG*</code></pre> file is used for the emergency bootloader mode, launched when the bootrom cannot find a suitable primary bootloader in flash.\n\nnow talking to the <pre><code>NPRG</code></pre> loader, using the streaming dload protocol, upload and write binaries to flash.\n\nNote that some manufacturers lock the bootrom, by fusing a specific certificate into the processor's One-time-programmable fuses. When this is the case, the bootrom will accept only specific binaries.\nA collection of suitable binaries can be found here\n",
            "votes": "5",
            "user": "Willem Hengeveld",
            "time": "May 31, 2019 at 7:19",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Hyeonseo Yang",
                    "text": "<span class=\"comment-copy\">Oops, I didn't know that there were an open source project! Thanks. Then I may start from that.</span>",
                    "time": null
                },
                {
                    "user": "Zibri",
                    "text": "<span class=\"comment-copy\">is it possible to dump all the flash using NPRG ENPRG?</span>",
                    "time": null
                },
                {
                    "user": "Willem Hengeveld",
                    "text": "<span class=\"comment-copy\">I know it is possible with the firehose variants of NPRG or ENPRG</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Use the sniffer for the communication channel it uses (most likely USB) to see which data is sent to your device. Try to search for the constants you see in the sniffer to find which binary may be responsible for generating the data sent to the device. Disassemble the binary, find the exact code piece responsible for protocol processing, decompile it manually. After having this knowledge, write your own code.\n",
            "votes": "3",
            "user": "Anton Kukoba",
            "time": "Apr 4, 2018 at 12:55",
            "is_accepted": false,
            "comments": []
        }
    ]
}