{
    "title": "Break on driver loading with windbg",
    "link": "https://reverseengineering.stackexchange.com/questions/17974/break-on-driver-loading-with-windbg",
    "content": "I try to debug a driver used by malware ( without source code of course ), to see what IOCTLS it uses and for what. I have issues breaking on driver loading, it has a proper driver structure, with driver entry point. I Use ida pro 7.0 + windbg plugin. I have tried to break as suggested on other question using:\n<pre><code>sxe -c \".echo mpAxkSGg3 loaded;\" ld:mpAxkSGg3.sys</code></pre>\nBut it doesn't work for some reason, debugger doesn't break. How can i do this other way? I have discovered, that <pre><code>NtLoadDriver</code></pre> uses <pre><code>MmLoadSystemImageEx</code></pre> but i don't see actualt Driver Entry call there. Can someone guide me the right way to do this?\nP.S. I can't modify the driver itself, it is signed with some certificate, so i suppose if i just patch the first bytes to <pre><code>int 3</code></pre> the whole hash will be invalid, and driver won't load\n",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ida",
        "windbg",
        "driver"
    ],
    "user": "FetucinniAlfredo",
    "time": "Apr 11, 2018 at 23:24",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Are you certain the driver is an actual driver and not a driver library? It is true that you would invalidate the signature, but on the other hand you should be able to load an unsigned driver with kernel debugger attached. Perhaps there could be issues with ELAM, but I never tested that scenario.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<pre><code>bp mpAxkSGg3!DriverEntry</code></pre> should work just fine. Otherwise see which functions <pre><code>mpAxkSGg3.sys</code></pre> exports and set breakpoints on them.\n",
            "votes": "1",
            "user": "Paweł Łukasik",
            "time": "May 13, 2018 at 8:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}