{
    "title": "Decompile a DLL file from Microsoft Media Creation Tool",
    "link": "https://reverseengineering.stackexchange.com/questions/18028/decompile-a-dll-file-from-microsoft-media-creation-tool",
    "content": "In this Superuser topic Windows 10 Media Creation Tool, how does it work?, it is possible to extract the URL from SetupMgr.dll. My question is, how do I extract this URL from SetupMgr.dll? I want to be able to do this in future versions of the Media Creation Tool.\n",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "dll",
        "decompile"
    ],
    "user": "Bart van Hooijdonk",
    "time": "Apr 19, 2018 at 8:26",
    "comments": [],
    "answers_data": [
        {
            "content": "Disclaimer: The following links are for Fall Creators Update and may be change in future updates.\nDownload the Media Creation Tool from Microsoft website. Open the executable in 7ZIP and extract all the files in a folder. Then download Strings from Sysinternals and place it in that previous folder whre you've extracted files. Open Command Prompt in that folder and run this command:\n<pre><code>For /R %X in (*.*) do (Strings.exe %X) | find /i \"LinkID\"\n</code></pre>\nThis command searches all the strings in all files recursively and shows the strings containing \"LinkID\" (piped to <pre><code>find /i</code></pre>). Open all the URLs in any browser and one of them (total 7 or 8 links) will download the Products.CAB or Products.XML file which contains all Windows ESD download links.\nAlternatively, extract the SetupMgr.dll file from MediaCreationTool.exe as above. Then open that DLL in IDA. Press Shift+F12 to open strings window and find <pre><code>LinkID</code></pre>. There will be two strings.\n\n\nThe Link for Products.CAB: https://go.microsoft.com/fwlink/?LinkId=841361\nThis LinkID redirected to another direct download link (may not work in future):\n\nproducts_20170317.cab\nproducts_20171005.cab\nproducts_20180105.cab\nproducts_20180420.cab\n\n\nTip: Check the real file type of MediaCreaTool.exe using the following 7ZIP command and that will be CAB type.\n<pre><code>7z t MediaCreationTool.exe | find /i \"type\"\n</code></pre>\n",
            "votes": "4",
            "user": "Biswapriyo",
            "time": "Apr 30, 2018 at 17:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user541686",
                    "text": "<span class=\"comment-copy\">For those wondering why a simple <code>grep</code> or <code>findstr</code> doesn't find this, it's because it's UTF-16.</span>",
                    "time": null
                }
            ]
        }
    ]
}