{
    "title": "Hauppauge HVR-950Q - Linux - Signal Processing for extra data like subtitles [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/1802/hauppauge-hvr-950q-linux-signal-processing-for-extra-data-like-subtitles",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions asking for help reverse-engineering a specific system are off-topic unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI have a Hauppauge HVR-950Q running on a stripped down debian. I am trying to use the Hauppauge HVR-950Q from the command line to parse subtitles and build a library of accurate subtitles. I am not sure how to start on this one being that I want to do all this programmatically in the background. Some information can be found at linuxtv.org HVR-950Q but I do not see any types of API nor can I find documentation so far. \nHow would I probe this or any other device in such a way that I would start \"finding\" things I need?\n",
    "votes": "6",
    "answers": 0,
    "views": "329",
    "tags": [
        "hardware",
        "linux"
    ],
    "user": "mrhobbeys",
    "time": "11 years ago",
    "comments": [
        {
            "user": "cb88",
            "text": "Doubtful.. since all you have to do is save the recording the dump it from there. ccrma.stanford.edu/~macbeth/notes.html but perhaps you want something more complex or realtime than the save mpeg and dump method allows.\n",
            "time": null
        },
        {
            "user": "mrhobbeys",
            "text": "I would like realtime, and absolutely do not want to save full recordings. Space is very limited, and I have no need for the actual mpeg feeds just the subtitles.\n",
            "time": null
        },
        {
            "user": "mrhobbeys",
            "text": "However, cb88, thank you for the link I will see what I can gain from it.\n",
            "time": null
        },
        {
            "user": "cb88",
            "text": "well you could probably look at mplayer/vlc/ffmpeg and figure out how they parse the stream and do the same thing...\n",
            "time": null
        }
    ],
    "answers_data": []
}