{
    "title": "How to extract firmware from a chip ( snarfing) [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/18086/how-to-extract-firmware-from-a-chip-snarfing",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 7 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nIs there anyone who can guide me how do i do snarfing of firmware on a chip of a VIN Tuner.\nIs there anyone who can do it ?\n",
    "votes": "1",
    "answers": 1,
    "views": "3k",
    "tags": [
        "disassemblers",
        "binary-editing"
    ],
    "user": "vrickson",
    "time": "7 years ago",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "what exactly is \"snarfing\"? Some references might help.\n",
            "time": null
        },
        {
            "user": "yaspr",
            "text": "Snarfing means eating fast with great appetite ... Totally, out of context here. Maybe @vrickson meant sniffing or extracting.\n",
            "time": null
        },
        {
            "user": "Elian Kamal",
            "text": "@IgorSkochinsky I think he meant this sort of snarf: en.m.wikipedia.org/wiki/Snarfing\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "@ElianKamal thanks, I didn't know this term\n",
            "time": null
        },
        {
            "user": "TAbdiukov",
            "text": "With all due respect, I believe the question should be re-opened. Sometimes the generic questions, like this one are priceless to solve problems\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Get the information about the chip. It may happen that firmware, that you need is stored in the external flash memory chip, not in CPU. \nIf it's still the CPU, that you want to dump, read the datasheet for the chip to learn how it's programmed and which hardware you need to connect to the chip (JTAG atapter most probably) \nFind if there are 'test points' on the PCB, which lead to the programming interface pins of the chip \nIf there are no such 'test points' desolder the chip, and solder it to your own PCB where you have all necessary pins connected. \nConnect JTAG adapter to the appropriate pins \nUse the software which is designed to work with such chips via JTAG to read the firmware or SRAM. \nMost likely the chip will have the protection enabled, so that you won't be able to read the firmware, so you'll have to overcome that using various techniques.\n\nHere's the example: http://blog.includesecurity.com/2015/11/NordicSemi-ARM-SoC-Firmware-dumping-technique.html\n",
            "votes": "4",
            "user": "Anton Kukoba",
            "time": "Apr 25, 2018 at 7:39",
            "is_accepted": false,
            "comments": []
        }
    ]
}