{
    "title": "Obfuscating Windows Executables",
    "link": "https://reverseengineering.stackexchange.com/questions/180/obfuscating-windows-executables",
    "content": "GCC allows you to write optimization plugins that can be used to obfuscate your compiled executable, but this wasn't ported to <pre><code>mingw</code></pre>.  LLVM allows something similar but barfs when including <pre><code>Windows.h</code></pre>.\nIs there a compiler that will allow me to get access to the AST right before link time, and produce a Windows executable?\n",
    "votes": "9",
    "answers": 2,
    "views": "2k",
    "tags": [
        "obfuscation",
        "windows"
    ],
    "user": "mrduclaw",
    "time": "Mar 23, 2013 at 9:34",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "Why do you need <pre><code>windows.h</code></pre> in the compiler?\n",
            "time": null
        },
        {
            "user": "Andrew",
            "text": "There's been a lot of work on getting clang to work on windows. There are some flags that you you should pass maybe (like -fms-extensions). I think at this point the clang team advertises they work on windows.h, I know I've gotten it to work before...\n",
            "time": null
        },
        {
            "user": "mrduclaw",
            "text": "@IgorSkochinsky Please forgive my ignorance, was that a slight at Microsoft or am I doing something wholly wrong?\n",
            "time": null
        },
        {
            "user": "mrduclaw",
            "text": "@Andrew I tried passing <pre><code>-fms-extensions</code></pre> previously, but ran into issues.  This has been some months, maybe it's fixed now. Thanks.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "\"Obfuscating\" raises one question: what for? What do you want to achieve?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "A couple of things you might want to look at:\n\nThe book \"Surreptitious Software\" is all about writing compilers that obfuscate.\nThis presentation is similar.\nSomebody wrote a proof-of-concept obfuscator based on the tcc compiler, and made his source code available. Also check the links on this thread.\n",
            "votes": "7",
            "user": "rev",
            "time": "Mar 9, 2015 at 4:38",
            "is_accepted": false,
            "comments": [
                {
                    "user": "newgre",
                    "text": "<span class=\"comment-copy\">To clarify a bit: the book is very good, but it is not really about how to write (extensions) for specific compilers. It rather covers the underlying concepts of program transformations in order to apply obfuscations to programs in general.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "There was a compiler infrastructure named phoenix (also see wikipedia).\nI even used it for some program transformations, but unfortunately it never made it beyond what MS calls a \"Community Technology Preview (CTP)\". Now it appears to be dead, I get 404's for each of the links on the MS research page, so it seems to me that this project was discontinued.\nIf you're interested in using LLVM/CLANG on Windows you might want to have a look at this page, which offers an extension to use LLVM from within VS. I gave it a short try and cannot say much about it, but it should allow you to compile and build extensions for LLVM on Windows.\n",
            "votes": "2",
            "user": "newgre",
            "time": "Apr 3, 2013 at 8:36",
            "is_accepted": false,
            "comments": []
        }
    ]
}