{
    "title": "Reading logs of commercial app and legality",
    "link": "https://reverseengineering.stackexchange.com/questions/18126/reading-logs-of-commercial-app-and-legality",
    "content": "Shortly, there is cheap chinese bluetooth lamp that can change colors by app on Android. \nI am basically reading communication logs on my phone and retrieving communication protocols of the app. Then, I am writing my own app to connect to that lamp. I am not even using any reverse engineering tools. It is basic Android developer's tool set, which can be enabled on any phone.\nI am writing my thesis based on this app. And as I see, it is uncommercial, interoperability aimed, use of reverse engineering. \"Soft reverse engineering\", if it is a thing :)\nBut my thesis supervisor has got super paranoid concerning the law, so now I have to dig into it... \nCould you, please, drop me some sources with legal acts or similar court cases... I would really appreciate if you will write short explanation for me, because english is not even my second language, and I am getting dizzy from lawyers' vocabulary :^j\nP.s.: the country is Finland, though Europe and even US laws and cases would also fit.\n",
    "votes": "1",
    "answers": 0,
    "views": "58",
    "tags": [
        "law"
    ],
    "user": "Roman Lutai",
    "time": "Apr 29, 2018 at 11:17",
    "comments": [
        {
            "user": "w s",
            "text": "Please don't take it as a legal advise, IANAL. eff.org/issues/coders/reverse-engineering-faq . It has some links and case names inside. Anyway, for any law related issue please, for your own safety, ask lawyer: in some countries these conversations with lawyer are protected by the corresponding privilege and can not be used against you.\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "Don't take legal advice from strangers on the Internet, investigate it yourself or ask a local expert. That said, in my opinion this is likely to be covered by the interoperability exception. Nobody can say for sure, but unless you actively set out to make financial harm to the company it's unlikely they will take any action, at least outside of their home country.\n",
            "time": null
        },
        {
            "user": "josh",
            "text": "Why don't you contact the manufacturer and try to get their approval for your work? IMO, all what you describe to do is \"mostly harmless\" (with apologies to Douglas Adams).\n",
            "time": null
        }
    ],
    "answers_data": []
}