{
    "title": "Binwalk extracted images corrupt?",
    "link": "https://reverseengineering.stackexchange.com/questions/18139/binwalk-extracted-images-corrupt",
    "content": "I ran:\n<pre><code>$> binwalk --dd='jpeg:jpg' file.bin\n</code></pre>\nThe JPGs (there are hundreds of them) are extracted but all of the JPGs experience varying levels of \"corruption\". Here's an example of what most of the images look like. \nThe file is about 8 years old and has been stored on probably 3 different drives since then. I can't imagine that bit rot would have gotten to it, but could that be a possibility? Is there anything else I can try?\nThanks.\nEdit: FileJuicer worked perfectly!\n",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "tools",
        "digital-forensics",
        "binwalk"
    ],
    "user": "Justin Clark",
    "time": "May 2, 2018 at 21:16",
    "comments": [
        {
            "user": "Jongware",
            "text": "Could you be overlooking that for some file types binwalk must guess where the data starts and/or end?\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "what exactly is file.bin? how did you get it?\n",
            "time": null
        },
        {
            "user": "Justin Clark",
            "text": "@IgorSkochinsky sorry that's just a placeholder. My file is a .private file created by the app, not .bin.\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "what app? what is the file supposed to contain?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Binwalk does carving, it doesn't care if embeedded file maybe cut into pieces, and its the parts are not stored in the container file continuously. It just finds JFIF header and tries to guess the size, and saves data starting from the point it found the header at. You may try to carve using photorec, but most probably it won't help either.\n",
            "votes": "4",
            "user": "Anton Kukoba",
            "time": "May 2, 2018 at 8:57",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Justin Clark",
                    "text": "<span class=\"comment-copy\">I see, thanks for the insight. Can photorec carve from an individual file? It seems that it will only scan partitions for deleted files, not extract images from WITHIN an existing file. I tried throwing my file on a USB drive and running photorec and as predicted it just grabbed old deleted files from the drive, nothing from within my file.</span>",
                    "time": null
                },
                {
                    "user": "Anton Kukoba",
                    "text": "<span class=\"comment-copy\">you should use your file as if it's a drive image.</span>",
                    "time": null
                }
            ]
        }
    ]
}