{
    "title": "Is there any disassembler to rival IDA Pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/1817/is-there-any-disassembler-to-rival-ida-pro",
    "content": "Is there any disassembler (not only a live debugger) second to IDA in capabilities? IDA is wonderful, and somewhat amazing in how robust and useful it is for reversing. However, it is quite expensive to properly license. Is there any viable alternative, or does IDA hold the monopoly on this market?\nI don't expect an alternative to be as good as IDA, just looking for other options that may be more affordable, and useful enough.\nEDIT: Preferrably, multi-platform support should exist, though that's optional. MIPS, ARM, x86, and x86-64 would be nice, but a disassembler that handles any one of those is a good option to know about.\n",
    "votes": "338",
    "answers": 16,
    "views": "425k",
    "tags": [
        "tools",
        "ida",
        "disassemblers"
    ],
    "user": "dyasta",
    "time": "Feb 26, 2015 at 21:33",
    "comments": [
        {
            "user": "savram",
            "text": "I don't know any tool for static analysis other than IDA. However for live debugging there are many better alternatives, x64dbg being one of them. IDA's UI is clunky and lacking.\n",
            "time": null
        },
        {
            "user": "Top-Master",
            "text": "IDA Pro has a unique IDE style (or all-in-one tool style), which's also seen in Ghidra and Binary ninja (where I have hopes for Ghidra getting faster in next releases, but Binary-Ninja's license is expensive).\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You didn't mention a platform (Windows, Linux, macOS, etc), but here are some great disassemblers.\nGhidra\n\nGhidra is a software reverse engineering (SRE) framework created and maintained by the National Security Agency Research Directorate. Windows, Mac OS, and Linux.\nCapabilities include disassembly, assembly, decompilation, graphing, and scripting, along with hundreds of other features. Ghidra supports a wide variety of process instruction sets and executable formats and can be run in both user-interactive and automated modes. Users may also develop their own Ghidra plug-in components and/or scripts using Java or Python.\n\nradare2\n\nRadare2 is an open source tool to disassemble, debug, analyze and\nmanipulate binary files.\nIt actually supports many architectures (x86{16,32,64}, Dalvik, avr,\nARM, java, PowerPC, Sparc, MIPS) and several binary formats\n(pe{32,64}, [fat]mach0{32,64}, ELF{32,64}, dex and Java classes), apart from support for filesystem images and many more features.\nIt runs on the command line, but it has a graphical interface called Cutter that has support for some of its features already.\n\nBinary Ninja\n\nBinary Ninja is a reverse engineering platform. It focuses on a clean\nand easy to use interface with a powerful multithreaded analysis built\non a custom IL to quickly adapt to a variety of architectures,\nplatforms, and compilers. Runs on macOS, Windows, and Linux.\n\nHopper\n\nHopper is a reverse engineering tool for macOS and Linux, that\nlets you disassemble, decompile and debug (OS X only) your 32/64bits\nIntel Mac, Windows and iOS (ARM) executables.\n\nx64dbg\n\nAn open-source x64/x32 debugger for windows.\n\nImmunityDbg\n\nImmunity Debugger is a branch of OllyDbg v1.10, with built-in support\nfor Python scripting and much more.\n\nPE Explorer's disassembler\n\nThe PE Explorer Disassembler is designed to be easy to use compared\nwith other disassemblers. To that end, some of the functionality found\nin other products has been left out in order to keep the process\nsimple and fast. While as powerful as the more expensive, dedicated\ndisassemblers, PE Explorer focuses on ease of use, clarity and\nnavigation.\n\nHiew\n\nHiew is a great disassembler designed for\nhackers, as the name suggests. It supports three modes - Text,\nHexadecimal and Decode (Dis-assembly) mode.\n\nODA\n\nThe Online Disassembler is a free web-based, reverse engineering platform that\nsupports over 60 architectures and object file formats from all the\nmajor operating systems, including Windows, Mac OS X, Linux, and mobile\nplatforms.\n\nRelyze\n\nRelyze is a commercial interactive disassembler for x86, x64 and ARM\nsoftware with loaders for PE or ELF file formats. It supports\ninteractive flat and graph views of the disassembly, generating call\nand reference graphs, binary diffing two executables, exploring the\nexecutable file's structure and a Ruby plugin API. It can also handle\nthings like symbols (PDB's), function local variables, switch\nstatements, exception handlers, static library identification and\nmore.\n",
            "votes": "311",
            "user": "Mick",
            "time": "Dec 28, 2020 at 18:00",
            "is_accepted": true,
            "comments": [
                {
                    "user": "dyasta",
                    "text": "<span class=\"comment-copy\">I would add HIEW too, since you included PE Explorer. I've always found it remarkably good to do this day, though it needs an update bad.</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">I'm a bit surprised that ImmunityDebugger and OllyDbg are not part of this list. Is it because they are not multi-platforms ?</span>",
                    "time": null
                },
                {
                    "user": "Anton Kochkov",
                    "text": "<span class=\"comment-copy\">From my experience radare2 is much better than hopper. Just use 'fresh' version (at least 0.9.4) and visual mode ('Vpd' command).</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@MickGrove: as much as I appreciate to learn about (new) tools others use, wasn't the question in particular about a <i>contender</i> for IDA as disassembler?</span>",
                    "time": null
                },
                {
                    "user": "Mahmoud Al-Qudsi",
                    "text": "<span class=\"comment-copy\">Hopper is not available for Windows.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "If you were looking for a contender, I believe ImmunityDebugger and OllyDbg can compete in part for dynamic-analysis and Hopper in part for static-analysis.\nThat said, there is a big gap between the capabilities you get with the aforementioned software and IDA.\nIDA Pro is pretty unique with its capabilities and if you add the Hex-Rays Decompiler Plugin into the equation, things look bleak for the wannabe contenders. However, for casual disassembly and even some decompiling Hopper seems a good choice for anyone not willing to shell out hundreds of bucks for IDA Pro. If you want a free ride, radare2 is probably the next in line, but it takes some getting used to.\nHaving gotten my first IDA Pro Standard license as a student I have to admit the price point is steep, but it's worth every penny. When I began to work professionally with RCE-related things I upgraded to the \"normal\" license first and later upgraded to IDA Pro Advanced to get the x64 support.\nAlso keep in mind there is a freeware version of IDA with license restrictions (but suitable for hobbyists or students) and restrictions of the capabilities.\n",
            "votes": "59",
            "user": "0xC0000022L",
            "time": "Apr 18, 2013 at 22:30",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Top-Master",
                    "text": "<span class=\"comment-copy\">IDA Pro is so good that many have used it to patch itself and make it free-for-all. Hence in case of money issues: even White-hat users can simply say \"I use different free tools\" and link to this Q/A which lists them, but in reality find for themself a patched version. Using such patch is even allowed by Islam as long as the Software is \"more accessible\" by an enemy country (note said \"enemy\", hence even if that country is Islamic as well, Technology is ours to take, no copyright).</span>",
                    "time": null
                },
                {
                    "user": "Top-Master",
                    "text": "<span class=\"comment-copy\">However, in my case money is not the issue, but finding ability to de-obfuscate and run that de-obfuscated version instead of original binary, also optionally, ability to create unit-tests for any binary (not code, both de-obfuscated and original).</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Some other disassemblers / decompilers\n\nW32Dasm\nW32DASM was an excellent 16/32 bit disassembler for Windows, it seems it is no longer developed. the latest version available is from 2003\n\n\n\nCapstone\nCapstone is a lightweight multi-platform, multi-architecture disassembly framework.\n\n\n\nBORG Disassembler\nBORG is an excellent Win32 Disassembler with GUI.\n\n\n\nDSM Studio Disassembler\nDSM Studio is an easy-to-use yet comprehensive application that can aid you in the disassembly and inspection of executables built for the Intel x86 architecture.\n\n\n\nDecompiler\nDecompiler is an easy to use and simply application designed to read program binaries and decompile executable or DLL files.\n  The application is designed to decompile executables for any processor architecture and not be tied to a particular instruction set. \n  Although currently only a x86 front end is implemented, there is nothing preventing you from implementing a 68K, Sparc, or VAX front end if you need one.\n\n\n\nLida - linux interactive disassembler\nlida is a fast feature packed interactive ELF disassembler / code-/cryptoanalyzer based on bastards libdisasm\n\n\n\nBugDbg x64 v0.7.5\nBugDbg x64 is a user-land debugger designed to debug native 64-bit applications.\n  BugDbg is released as Freeware.\n\n\n\ndistorm3\nA lightweight, Easy-to-Use and Fast Disassembler/Decomposer Library for x86/AMD64\n\n\n\nUdis86\nUdis86 is an easy-to-use, minimalistic disassembler library (libudis86) for the x86 class of instruction set architectures. It has a convenient interface for use in the analysis and instrumentation of binary code.\n\n\n\nBeaEngine\nThis project is a package with a multi-platform x86 and x64 disassembler library (Solaris, MAC OSX, AIX, Irix, OS/2, Linux, Windows)\n\n\n\nC4 Decompiler\n\nGeneral Machine Code to C Decompiler\nFree Windows I64 target edition\nInteractive Windows GUI\n\n\n \n\nREC Studio 4 - Reverse Engineering Compiler\nREC Studio is an interactive decompiler.\n  It reads a Windows, Linux, Mac OS X or raw executable file, and attempts to produce a C-like representation of the code and data used to build the executable file. \n  It has been designed to read files produced for many different targets, and it has been compiled on several host systems.\n\n\n\nRetargetable Decompiler\nA retargetable decompiler that can be utilized for source code recovery, static malware analysis, etc. The decompiler is supposed to be not bounded to any particular target architecture, operating system, or executable file format.\n\n\n\nmiasm\nMiasm is a a free and open source (GPLv2) reverse engineering framework written in python. Miasm aims at analyzing/modifying/generating binary programs. \n\n\n\nFree Code Manipulation Library\nThis is a general purpose machine code manipulation library for IA-32 and Intel 64 architectures. The library supports UNIX-like systems as well as Windows and is highly portable.\n\n\n\nIntel® X86 Encoder Decoder Software Library\nIntel® XED is a software library (and associated headers) for encoding and decoding X86 (IA32 and Intel64) instructions. \n\n\n\nangr\nangr is a framework for analyzing binaries. It focuses on both static and dynamic symbolic (\"concolic\") analysis, making it applicable to a variety of tasks.\n\n\n\nJEB Decompiler\nJEB is a reverse-engineering platform to perform disassembly, decompilation, debugging, and analysis of code and document files, manually or as part of an analysis pipeline.\n\n\n\nCutter\nA Qt and C++ GUI for radare2 reverse engineering framework (originally Iaito). Cutter is not aimed at existing radare2 users. It instead focuses on those whose are not yet radare2 users because of the learning curve, because they don't like CLI applications or because of the difficulty/instability of radare2.\n\n\n\nREDasm\nREDasm is an interactive, multiarchitecture disassembler written in C++ using Qt5 as UI Framework. Its core is light and simple, it can be extended in order to support new instruction sets and file formats.\n",
            "votes": "55",
            "user": "0xec",
            "time": "Feb 2, 2019 at 7:22",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ZAB",
                    "text": "<span class=\"comment-copy\">as far as I know W32Dasm development was stopped in 1997 and the last version is 8.9</span>",
                    "time": null
                },
                {
                    "user": "John Källén",
                    "text": "<span class=\"comment-copy\">The <code>Decompiler</code> project on Sourceforge is now called <code>Reko</code> and is hosted on GitHub.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Reverse - Reverse engineering tool for x86/ARM/MIPS. Generates indented pseudo-C with colored syntax code.\n\nSmartDec (aka Snowman) is a native code to C/C++ decompiler. Supports PE and ELF (both 32 and 64bit) also has plugin modules for IDA (6.1, 6.4, 6.5). \n\nCurrently supports Intel x86 and x86-x64 architectures. C++ reconstruction supports the 32-bit ABI used by MSVC compiler under Windows. \n\nC reconstruction is generic and can be used on a code produced by virtually any compiler for x86 and x86-x64 architectures. \nGithub repo can be found here.\n",
            "votes": "27",
            "user": "Dominik Antal",
            "time": "Dec 8, 2015 at 6:15",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Laurie Stearn",
                    "text": "<span class=\"comment-copy\">Ida Free doesn't appear to <a href=\"https://reverseengineering.stackexchange.com/a/17640/23872\">support plugins</a> although there is <a href=\"https://github.com/yegord/snowman/issues/158\" rel=\"nofollow noreferrer\">hope</a>, in the meantime Snowman might be better used as standalone.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Another framework to check out is Vdb and Vivisect\n\nVdb - Python based debugger and programatic debugging API\n\nVdbTargetVMWare32 - Kernel debugging using the vmware hypervisor\nVdbOnAndroid - Using vdb to debug android processes\n\nVivisect - Python based static analysis and emulation framework\n",
            "votes": "26",
            "user": "Ange",
            "time": "Apr 21, 2013 at 16:46",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Relyze is a commercial interactive disassembler for x86, x64 and ARM software with loaders for PE or ELF file formats. It supports interactive flat and graph views of the disassembly, generating call and reference graphs, binary diffing two executables, exploring the  executable file's structure and a Ruby plugin API. It can also handle things like symbols (PDB's), function local variables, switch statements, exception handlers, static library identification and more.\n\n\nMedusa is an open source disassembler with x86, x64, z80 and partial ARM support. It runs on Windows and Linux. It has interactive flat and graph views.\n",
            "votes": "16",
            "user": "QAZ",
            "time": "Aug 7, 2017 at 15:20",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "On of my favorite alternatives to IDA is HT Editor.\nI've used it on x86 and x64 binaries and java class files. I think it has support for many other architectures/bytecode. It is cross platform and has some nice features.\n",
            "votes": "15",
            "user": "mikeazo",
            "time": "Apr 26, 2013 at 14:40",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Sourcer (archived website at archive.org) was quite awesome, but I'm not sure it's what you need.\n",
            "votes": "15",
            "user": "Ange",
            "time": "Apr 5, 2023 at 15:18",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">indeed it <i>was</i> good during its time and I kept the manual for years because it had this very nice opcode table (similar what you offer on your website) - until one of my colleagues ended up losing it :-|</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "ArkDasm  is a 64-bit interactive disassembler. Supported file types: PE64, raw binary files.  Its currently in alpha stage but works well.\n",
            "votes": "12",
            "user": "MaxQ",
            "time": "Oct 4, 2013 at 10:17",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Just for completeness: one more disassembler, Binary Ninja:\nAs for now (9/26/2016) it has the following properties:\n\nCommercial ($99 as introductory price for personal use license)\nHandles x86, x64, ARMv7-8, MIPS and 6502 architectures\nWorks on Linux, Mac OsX and Windows\nSupports PE/COFF, ELF, .NES and Mach-O\nHas python API\nHas Undo\nHas IL\nHas a lot of other cool features\n",
            "votes": "11",
            "user": "w s",
            "time": "Sep 26, 2016 at 7:18",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I have been using Hopper recently, and while it is not up to the level IDA is, it's really surprisingly sophisticated, particularly considering what it costs. Its main platform is OS X, but there are versions available for Linux and Windows as well. The OS X version also has some gdb integration, so you can use it as a debugger.\n",
            "votes": "10",
            "user": "Brendan Dolan-Gavitt",
            "time": "Apr 17, 2013 at 1:21",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Have you checked out the open-source Metasm framework? It is a ruby framework for assembly manipulation, and can compete with IDA's static analysis capabilities. It has a graph view, can do disassembly/decompilation on x86/64, MIPS, and PPC and supports a couple of executable file formats. \nI believe it has also been integrated into Metasploit.\n",
            "votes": "9",
            "user": "0xC0000022L",
            "time": "Apr 17, 2013 at 16:51",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I would also add \nPEBrowse64 Professional\n\nWith the PEBrowse disassembler, one can open and examine any\n  executable without the need to have it loaded as part of an active\n  process with a debugger.  Applications, system DLLs, device-drivers\n  and Microsoft .NET assemblies are all candidates for offline analysis\n  using either PEBrowse programs.  The information is organized in a\n  convenient treeview index with the major divisions of the PE file\n  displayed as nodes.  In most cases selecting nodes will enable\n  context-sensitive multiple view menu options, including binary dump,\n  section detail, disassembly and structure options as well as\n  displaying sub-items, such as optional header directory entries or\n  exported functions, that can be found as part of a PE file unit. \n  Several table displays, hex/ASCII equivalents, window messages and\n  error codes, as well as a calculator and scratchpads are accessible\n  from the main menu (calculator, messages and codes in PEBrowse\n  Professional only).\n\nThis is an awesome tool with a lot of useful feature regarding executable analysis and there is also a version that could be used and an interactive debugger.\n",
            "votes": "9",
            "user": "PhoeniX",
            "time": "Sep 11, 2013 at 14:52",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "ODA (the Online Disassembler) supports a myriad of architectures and provides a basic feature set.  You can enter binary data in the Live View and watch the disassembly appear as you type, or you can upload a file to disassemble.  A nice feature of this site is that you can share the link to the disassembly with others.\nhttp://www.onlinedisassembler.com\n",
            "votes": "9",
            "user": "user711461",
            "time": "Sep 29, 2013 at 2:14",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "ScratchABit is an open-source, interactive, incremental, direct-manipulation(*) disassembler with IDAPython-compatible API, allowing reuse of multitude of the plugins developed by the community. ScratchABit stores program state in text files, allowing for easy information reuse and interfacing with other applications and scripts, or tracking history and working collaboratively using version control systems, and minimizing risk of database corruption and recovery efforts.\nFull disclosure: I'm the author of ScratchABit and it is a work-in-progress project.\n(*) Direct manipulation means that you press a command key and immediately get a reaction, you don't need to type long commands with manually specified addresses and parameters and press Enter.\n",
            "votes": "8",
            "user": "pfalcon",
            "time": "Dec 26, 2017 at 10:57",
            "is_accepted": false,
            "comments": [
                {
                    "user": "pfalcon",
                    "text": "<span class=\"comment-copy\">ScratchABit 1.0 was released recently, which means it's now at the state I wish some other project were instead, saving me from writing ScatchABit - both useful and functional already, and giving good base for further hacking and experimentation.</span>",
                    "time": null
                },
                {
                    "user": "pfalcon",
                    "text": "<span class=\"comment-copy\">The latest is 1.8: <a href=\"https://github.com/pfalcon/ScratchABit/releases/tag/v1.8\" rel=\"nofollow noreferrer\">github.com/pfalcon/ScratchABit/releases/tag/v1.8</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "The first tool that comes to mind is Hopper, which is no longer tied to OSX.  It has some debugging support(at least on OSX), but focuses on static analysis, which seems like what you're looking for.\nIt has the ability to break basic blocks into a control flow graph, rudimentary decompilation support, and you can rename functions as you make sense of them.  Perhaps someone who uses it instead of IDA will chime in with a better comparison, I've only played around briefly.   \nAlso, IDA's free version is rather capable and worth a look if you haven't tried it.\n",
            "votes": "7",
            "user": "dingo_kinznerhook",
            "time": "Apr 17, 2013 at 21:44",
            "is_accepted": false,
            "comments": []
        }
    ]
}