{
    "title": "IDA Pro Address doesn't correlate to Immunity Debugger address",
    "link": "https://reverseengineering.stackexchange.com/questions/18186/ida-pro-address-doesnt-correlate-to-immunity-debugger-address",
    "content": "I'm trying to use immunity debugger to step through a confusing binary.\nWhen I open it in IDA Pro, I see certain addresses next to the instructions:\n<pre><code>.text:01001392                 inc     eax\n</code></pre>\nWhen I execute the binary, it simply executes and produces no output. So, I want to put a breakpoint at that line to step through.\nBut Immunity says:\n<pre><code>No memory on the specified address\n</code></pre>\nWhen I search that specific address. How do I add a breakpoint in immunity to the this line in IDA?\n",
    "votes": "0",
    "answers": 1,
    "views": "563",
    "tags": [
        "ida",
        "binary-analysis",
        "x86",
        "immunity-debugger",
        "intel"
    ],
    "user": "Nick",
    "time": "May 5, 2018 at 23:25",
    "comments": [],
    "answers_data": [
        {
            "content": "This could be ASLR (Address Space Layout Randomization). It randomly changes the base address for binaries so people cannot rely on fixed addresses if they try to write an exploit.\nThere are a few ways to disable it, some global, some for specific executables. \nThe easiest way to disable it for a single executable is opening it in a PE editor and removing/renaming the <pre><code>.reloc</code></pre> section - it is required to move the code around and if it isn't present, the base address from the header will be honored by the loader.\nOr to disable it for the whole system, use regedit to add this value:\n<pre><code>“MoveImages”=dword:00000000\n</code></pre>\nunder this key:\n<pre><code>[HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Memory Management]\n</code></pre>\nand then reboot.\n",
            "votes": "1",
            "user": "Johann Aydinbas",
            "time": "May 6, 2018 at 21:43",
            "is_accepted": false,
            "comments": []
        }
    ]
}