{
    "title": "How do the new Swedish implantable microchips work?",
    "link": "https://reverseengineering.stackexchange.com/questions/18263/how-do-the-new-swedish-implantable-microchips-work",
    "content": "So now we see that the Swedes are going large with their implantable chips which allow them to carry out certain kinds of transactions without using plastic.\nThousands of people in Sweden get microchip implants for a new way of life\nExcerpt:\n\nIt’s the size of a grain of rice but could hold the key to many\n  aspects of your life.\nA tiny microchip inserted under the skin can replace the need to carry\n  keys, credit cards and train tickets.\nThat might sound like an Orwellian nightmare to some but in Sweden it\n  is a welcome reality for a growing number who favour convenience over\n  concerns of potential personal data violations.\nThe small implants were first used in 2015 in Sweden – initially\n  confidentially – and several other countries.\nSwedes have gone on to be very active in microchipping, with scant\n  debate about issues surrounding its use, in a country keen on new\n  technology and where the sharing of personal information is held up as\n  a sign of a transparent society.\nSweden’s SJ national railway company has won over some 130 users to\n  its microchip reservation service in a year.\nConductors scan passengers’ hands after they book tickets online and\n  register them on their chip. Sweden has a track record on the sharing\n  of personal information, which may have helped ease the microchip’s\n  acceptance among the Nordic country’s 10 million-strong population.\n\nMy question is:\nHow to read the information, then what information is stored in them?\nHow do these microchips work?  Are they merely RFID units that store a single personal ID number?  Or is it something more complex, like a SIM card or Smartcard with some other kind of registration?\n",
    "votes": "0",
    "answers": 1,
    "views": "102",
    "tags": [
        "firmware",
        "memory"
    ],
    "user": "SDsolar",
    "time": "May 15, 2018 at 8:25",
    "comments": [
        {
            "user": "SDsolar",
            "text": "If like a Smartcard or a SIM card, the \"how it works\" is covered very well here:  reverseengineering.stackexchange.com/questions/15011/…\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "As I know they implant these NFC tag ICs:\nNTAG213_215_216: NFC Forum Type 2 Tag compliant IC with 144/504/888 bytes user memory (nxp.com)\nExcerpt:\n\nFEATURES:\n\nContactless transmission of data and supply energy\n\nOperating frequency of 13.56 MHz\n\nData transfer of 106 kbit/s\n\nData integrity of 16-bit CRC, parity, bit coding, bit counting\n\nOperating distance up to 100 mm (depending on various parameters as e.g. field strength and antenna geometry)\n\n7-byte serial number (cascade level 2 according to ISO/IEC 14443-3)\n\nUID ASCII mirror for automatic serialization of NDEF messages\n\nAutomatic NFC counter triggered at read command\n\nNFC counter ASCII mirror for automatic adding the NFC counter value to the NDEF message\n\nECC based originality signature\n\nFast read command\n\nTrue anticollision\n\n\nEEPROM\n\n180, 540 or 924 bytes organized in 45, 135 or 231 pages with 4 bytes per page\n\n144, 504 or 888 bytes freely available user Read/Write area (36, 126 or 222 pages)\n\n4 bytes initialized capability container with one time programmable access bits\n\nField programmable read-only locking function per page for the first 16 pages\n\nField programmable read-only locking function above the first 16 pages per double page for NTAG213 or per 16 pages for NTAG215 and NTAG216\n\nConfigurable password protection with optional limit of unsuccessful attempts\n\nAnti-tearing support for capability container (CC) and lock bits\n\nECC supported originality check\n\nData retention time of 10 years\n\nWrite endurance 100,000 cycles\n",
            "votes": "2",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "SDsolar",
                    "text": "<span class=\"comment-copy\">Excellent answer.  For the first part of the question - is it simple or more complex.   Clearly it is not just simple.  And with this small amount of memory they clearly are not storing full biometrics.  I wonder what information is stored in the microchips...?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">where did you find the exact model?</span>",
                    "time": null
                },
                {
                    "user": "Anton Kukoba",
                    "text": "<span class=\"comment-copy\">For example <a href=\"https://www.youtube.com/watch?v=0AwnZ5wL2fI\" rel=\"nofollow noreferrer\">youtube.com/watch?v=0AwnZ5wL2fI</a></span>",
                    "time": null
                }
            ]
        }
    ]
}