{
    "title": "How to find offsets in OllyDBG from IDA",
    "link": "https://reverseengineering.stackexchange.com/questions/1833/how-to-find-offsets-in-ollydbg-from-ida",
    "content": "I'm currently trying to gain some practice in RE and I need some help for patching a DLL.\nHere are my steps:\nI first analyze the main program and the dll in IDA trying to understand the logic. I then switch to OllyDBG for patching. Well, the problem is, since Olly dynamically loads the dll (in contrast to the static standalone analysis in IDA), the offsets are different and I don't know how to find the offset that I've inspected in IDA.\nIs there some easy way to \"rediscover\" the offset in the dll?\nThanks in advance!\n",
    "votes": "11",
    "answers": 5,
    "views": "12k",
    "tags": [
        "ida",
        "ollydbg"
    ],
    "user": "Caroline",
    "time": "Apr 17, 2013 at 14:17",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "You patch a live program or on disk? Why not do all of it in IDA?\n",
            "time": null
        },
        {
            "user": "0xea",
            "text": "i'd guess that actual offsets are the same, but the base is changed?\n",
            "time": null
        },
        {
            "user": "Caroline",
            "text": "Running a patched program directly in IDA (Pro 6.1)? How? I can use the \"Assemble\" function in IDA and then export the diff. But running the changed code directly? Additionally, since the changes are in the dll and I can only open one file at a time, I wonder how this should work...\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "@Caroline: IDA has a debugger, you know.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "If only the base is changed, but offsets are constant (as I'd guess is the case), you can just rebase the program in IDA. You can do so by edit->segments->Rebase program ... menu. \nSpecifying the same starting base in IDA as is in Olly should help. Base may be different for numerous reasons, one of which might be ASLR.\n",
            "votes": "12",
            "user": "0xea",
            "time": "Apr 17, 2013 at 14:50",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Peter Andersson",
                    "text": "<span class=\"comment-copy\">I usually calculate it using calc which feels really clumsy. There has to be a better way than doing this sort of stuff manually or rebasing things back and forth. In my experience  after you rebase you can get some notation errors in IDA.</span>",
                    "time": null
                },
                {
                    "user": "0xea",
                    "text": "<span class=\"comment-copy\">I think I had encountered the same issue, and sometimes am calculating the addresses back and forth which is error prone and tedious. Would like to see a better solution too.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Is there some easy way to \"rediscover\" the offset in the dll?\n\nYes, here's the algorithm:\n<pre><code>Target_Address_in_OllyDbg = Source_Address_in_IDA - Base_Address_in_IDA + Base_Address_in_OllyDbg</code></pre>\nHere are the definitions:\n<pre><code>Target_Address_in_OllyDbg</code></pre>: The target address in OllyDbg.\n<pre><code>Source_Address_in_IDA</code></pre>: The source address in IDA.\n<pre><code>Base_Address_in_IDA</code></pre>: The base address of the disassembled module in IDA. You can find this value by going to Edit --> Segments --> Rebase program... in IDA's menu bar. The Value for Image base in that dialog box is the <pre><code>Base_Address_in_IDA</code></pre>.\n<pre><code>Base_Address_in_OllyDbg</code></pre>: The base address of the target module in OllyDbg. You can find this value by pressing Alt-E in OllyDbg (or by going to View --> Executable modules in OllyDbg's menu bar). Find your target module in the Executable modules window; the leftmost field (Base) is the <pre><code>Base_Address_in_OllyDbg</code></pre>.\n",
            "votes": "8",
            "user": "Jason Geffner",
            "time": "Apr 17, 2013 at 15:05",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "If anyone finds it useful I made myself a little calculator to easily get addresses for locations in my disassembler which uses the same  algorithm described above.\nIt currently defaults to binary ninja's base address but this is easy to change in the code.\nhttps://github.com/scrapbird/OffsetCalc\n",
            "votes": "0",
            "user": "scrapbird",
            "time": "Feb 21, 2017 at 10:47",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "i use this small idc script \ni set the base once and input the olly address using the AskAddr\n<pre><code>auto olbase , oladdr , rva;\nolbase = 0x20000;\noladdr = AskAddr(0,\"enter address as seen in olly\");\nJump(  MinEA() + oladdr - olbase);\n</code></pre>\n",
            "votes": "0",
            "user": "blabb",
            "time": "Feb 24, 2017 at 9:56",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I usually rebase it in IDA to <pre><code>0</code></pre>. Then using <pre><code>Adv Ctr + G</code></pre> option of StrongOD, you can just put the address from IDA as RVA to needed module.\n",
            "votes": "0",
            "user": "h0m3us3r",
            "time": "Apr 28, 2020 at 21:39",
            "is_accepted": false,
            "comments": []
        }
    ]
}