{
    "title": "How to use Hopper Debugger Server",
    "link": "https://reverseengineering.stackexchange.com/questions/18402/how-to-use-hopper-debugger-server",
    "content": "I am assuming that Hopper Debugger Server is meant to allow you to remotely debug an potentially malicious app. For example, I would like to debug an app that is running on a VM or on a separate computer on the same network, using Hopper on my laptop.\nHowever, I cannot figure out how to do this. There's no documentation for Hopper Debugger Server, nor am I finding mention of it in the Hopper documentation.\nAny tips on how to make this work?\n",
    "votes": "4",
    "answers": 2,
    "views": "3k",
    "tags": [
        "hopper",
        "macos"
    ],
    "user": "T. Reed",
    "time": "May 29, 2018 at 12:26",
    "comments": [],
    "answers_data": [
        {
            "content": "I figured out how to make it work. Here's the procedure that needs to be followed:\n\nOpen a copy of the executable to be analyzed in Hopper on the host Mac\nPut a copy of the executable to be analyzed on the VM\nInstall Hopper Debugger Server on the VM and launch it\nIn Hopper on the host Mac, choose Debug > Select Debugger\nSelect the VM\nChange the path to the executable to the correct path on the VM, rather than the path to the file on the host Mac\nBegin debugging in Hopper on the host Mac!\n\nI heard from someone else that doing this caused a beachball on their machine, but don't have details. This worked for me, using the following:\n\nHopper 4.3.24\nHopper Debugger Server 2.4\nmacOS 10.13.4 on the host Mac\nmacOS 10.12.6 on the VM\n",
            "votes": "3",
            "user": "T. Reed",
            "time": "Jun 1, 2018 at 14:27",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Maybe this would be a good reference (Just install and run Hopper Debugger Server app then back to hopper Debug > Select Debugger)\n",
            "votes": "1",
            "user": "John Doe",
            "time": "Oct 26, 2023 at 9:47",
            "is_accepted": false,
            "comments": []
        }
    ]
}