{
    "title": "IDA 7 does not recognize/reference Delphi 16bits Strings correctly",
    "link": "https://reverseengineering.stackexchange.com/questions/18437/ida-7-does-not-recognize-reference-delphi-16bits-strings-correctly",
    "content": "I am dabbling with a XE3 Delphi application in IDA 7.0, and can't get Strings representation to work correctly:\n\n\nWhile selecting Delphi (16 bits) in the Strings Window yield correct results:\n\n\n\n\nReferences to Strings in the Disassembly view are failing.\n\nBelow is the string definition at <pre><code>.text:008717DC</code></pre>:\n\n\n\nBelow is a (failing) reference to it:\n\n\n\n\n\nTrying to change the String type to Delphi (16 bits) fails with <pre><code>Command \"SetStrlitStyle\" failed</code></pre>\n\n\n\n\nOddly, not all strings are misreferenced:\n\n\n\n\n\nFor the record, IDR (Interactive Delphi Reconstructor) yields correct representations:\n\n\n\n\nI have set the Default String type to Delphi (16 bits) in Options:\n\n\n\n\nHere are the Compiler Options:\n\n\n\nAll help welcome, thanks !\n",
    "votes": "3",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ida",
        "strings",
        "delphi"
    ],
    "user": "Alexis",
    "time": "Jun 17, 2020 at 9:54",
    "comments": [],
    "answers_data": [
        {
            "content": "It's not only Delphi problem, it's a generic unicode detection problem of IDA.\nI can't be sure how exactly it works, but I feel like IDA has an issue, when detecting the data type. And it's related to the priority of address representation over string literal. I.e. when it finds some instruction, which references the address, it tries to determine what data is situated at this address. In your case it found mov eax, offset 8717E0, it read 4 bytes at address 8717E0. It got 0x6F0053, it made a check does 0x6F0053 look like an address? Yes, in current database it's a valid address. Then screw all further detection let's make data at 8717E0 offset to loc_6F0053. If there was no such address 0x6F0053, it would go into further analysis and in the end came to the conclusion, that it's a unicode string.\nSo to fix this, you need to hook the analysis in the process module, and do your own type detection. It can't be solved by any of IDA settings.\n",
            "votes": "2",
            "user": "Anton Kukoba",
            "time": "Jun 4, 2018 at 7:57",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Alexis",
                    "text": "<span class=\"comment-copy\">Is that a situation you have experienced yourself ? Your analysis appears sound to me, but with the widespread use of Unicode I can't help but wonder how this isn't a largely discussed issue, and how it could exist in such an iconic software in the first place.</span>",
                    "time": null
                },
                {
                    "user": "Anton Kukoba",
                    "text": "<span class=\"comment-copy\">Yes I've seen this multiple times. As for iconic ... there are so many bugs, which are not fixed for decades :)</span>",
                    "time": null
                }
            ]
        }
    ]
}