{
    "title": "What are the available libraries to statically modify ELF executables?",
    "link": "https://reverseengineering.stackexchange.com/questions/1843/what-are-the-available-libraries-to-statically-modify-elf-executables",
    "content": "I would like to be able to rewrite or reorganize an ELF binary program directly from the executable format (not at compile-time). \nThe only library I know to do this is elfesteem (used in Miasm). But, there must be others. So, what are the libraries or frameworks that you use to statically modify ELF executables ?\n",
    "votes": "11",
    "answers": 3,
    "views": "7k",
    "tags": [
        "tools",
        "obfuscation",
        "deobfuscation",
        "elf"
    ],
    "user": "perror",
    "time": "Apr 18, 2013 at 10:06",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "good read ;)\n",
            "time": null
        },
        {
            "user": "Krypton",
            "text": "Maybe a bit too chatty, I saw perror and 0xC0000022L everywhere in this SE subsite. Anw is there any better tool (preferably python) atm? ERESI suggested in the accepted answer seems not to be actively maintained any more.\n",
            "time": null
        },
        {
            "user": "perror",
            "text": "Up to my actual knowledge, I do not know anymore libraries than the ones cited in this page... There might be other projects but they are less featured or more cryptic to use than the ones listed here. Anyway, I would be delighted if you prove me wrong !\n",
            "time": null
        },
        {
            "user": "Ciro Santilli OurBigBook.com",
            "text": "Is there a minimal tutorial of how to open an ELF and modify the assembly with Miasm  somewhere?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I just stumbled on this project ERESI. The project itself looks quite ambitious and supports mainly Intel and Sparc processors with some support for others. There are lots of tools as well that might come in handy. It does have one specific tool that sounds like if fits the bill exactly and quite a few others that are related: \n\nEvarista: A work-in-progress static binary program transformer\n  entirely implemented in the ERESI language.\n\nPatchelf might come in handy for modifying the linker or rpaths specified in an elf:\n\nPatchELF is a small utility to modify the dynamic linker and RPATH of\n  ELF executables\n\nAlso there is this presentation about injectso which seems relevate to the topic static and dynamic patching of elf binaries. Admittedly the coverage on static binaries is limited but that is to be expected as it is more complex that just being a library interposer.\nIf you are looking for libraries specifically then the ERESI project does use alot of libraries so you could probably take Evarista as a guide and write something more in line with your goals with thier libraries.\n\nlibelfsh : the binary manipulation library used by ELFsh, Kernsh,\n  E2dbg, and Etrace.\nlibe2dbg : the embedded debugger library operating within the\n  debuggee program.\nlibasm : the smart disassembling engine (x86, sparc, mips, arm)\n  that gives both syntactic and semantic attributes to instructions and\n  their operands.\nlibmjollnir : the control flow analysis and fingerprinting\n  library. \nlibrevm : the Runtime ERESI virtual machine, that contains the\n  central runtime environment implementation of the framework.\nlibstderesi : the standard ERESI library containing more than\n  100 built-in analysis commands.\nlibaspect : the aspect library brings its API to reflect code\n  and data structures in the ERESI language.\nlibedfmt : the ERESI debug format library which can convert\n  dwarf and stabs debug formats to the ERESI debug format.\nlibetrace : the ERESI tracer library, on which Etrace is based. \nlibkernsh : the Kernel shell library is the kernel accessibility\n  library on which Kernsh is based.\nlibgdbwrap : The GDB serial protocol library, for compatibility\n  between ERESI and GDB/VMware/Bochs/Qemu/OpenOCD.\n",
            "votes": "7",
            "user": "0xC0000022L",
            "time": "Apr 18, 2013 at 22:08",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "I think your best bet will be to take a low level ELF library and write a small program to do what you want. I like the ELF Toolchain Project. I've found the tests and documentation that the team puts together to be pretty good. Regardless of what tool you end up using, you definitely want to read A Whirlwind Tutorial on Creating Really Teensy ELF Executables for Linux which discusses how to modify an ELF executable to be as small as possible (your purpose may be different but there are a lot of general lessons to be had).\n",
            "votes": "6",
            "user": "Vehm Stark",
            "time": "Apr 18, 2013 at 18:09",
            "is_accepted": false,
            "comments": [
                {
                    "user": "st01",
                    "text": "<span class=\"comment-copy\">+1 for the link to the brilliant \"teensy ELF\" tutorial. I saw this a few years ago and had forgotten about it... What a joy to re-read it.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "e9patch\n\nE9Patch is different to other tools in that it can statically rewrite x86_64 Linux ELF binaries without modifying the set of jump targets. To do so, E9Patch uses a set of novel low-level binary rewriting techniques, such as instruction punning, padding and eviction that can insert or replace binary code without the need to move existing instructions. Since existing instructions are not moved, the set of jump targets remains unchanged, meaning that calls/jumps do not need to be corrected (including cross binary calls/jumps).\n\n\nPaper: Binary Rewriting without Control Flow Recovery\nProjects based on e9patch:\n\ne9afl - inserts AFL's instrumentation into ELF binaries. I've had success using this to fuzz closed-source binaries in a production environment; however, using AFL++ with QEMU outperformed this approach.\ne9syscall - System call interception using static binary rewriting of libc.so.\n",
            "votes": "1",
            "user": "julian",
            "time": "Jul 27, 2021 at 1:55",
            "is_accepted": false,
            "comments": []
        }
    ]
}