{
    "title": "What is the meaning of single letters in IDA's functions window?",
    "link": "https://reverseengineering.stackexchange.com/questions/18454/what-is-the-meaning-of-single-letters-in-idas-functions-window",
    "content": "IDA's functions window, the window that lists all functions identified by IDA, has several columns represented by a single letter/character each. See example in attached picture.\nThe characters are: <pre><code>R</code></pre>, <pre><code>F</code></pre>, <pre><code>L</code></pre>, <pre><code>S</code></pre>, <pre><code>B</code></pre>, <pre><code>T</code></pre> and <pre><code>=</code></pre>\n\nWhat is the meaning of each column/character?\n",
    "votes": "10",
    "answers": 1,
    "views": "475",
    "tags": [
        "ida",
        "tools"
    ],
    "user": "NirIzr",
    "time": "Jun 17, 2018 at 5:42",
    "comments": [],
    "answers_data": [
        {
            "content": "Every column value can be either a dot or the same column character. Those columns are boolean and the column character stands for \"True\" while the dot stands for \"False\". \n\nR stands for \"Returns\" and is True (has an \"R\" in the column's value instead of a dot) if the function returns. Functions may not return and this requires special handling by IDA and the reverse engineer.\nF stands for \"Far\" and is true for functions that are far functions, or false otherwise.\nL stands for \"Library\" function, and is true for functions IDA recognised as library functions (usually using FLIRT).\nS stands for \"Static\" function.\nB stands for a E/R/BP stack frame based function. As part of IDA's analysis functions that use the xBP register for easier stack access are marked so.\nT stands for Type and indicates whether a function has type information assigned. Either manually or automatically by IDA using FLIRT.\nthe equal sign (=) indicates the frame pointer is equal to the initial stack pointer. \n\nAll of those values can be manually accessible using the \"Edit function\" dialog (alt+p), like seen here:\n\nThis is also documented and can be found at Hex-Rays website, with a shorter explanation. \nAdditionally, according to Arnaud Diederen:\n\nsince 7.1, IDA also provides tooltips for those arguably cryptic single-letter columns. Just hover your mouse over the column header for a couple seconds, and the tooltip should appear.\n",
            "votes": "13",
            "user": "NirIzr",
            "time": "Jul 27, 2018 at 20:27",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">shortcut is actually Alt-P, at least on Windows.</span>",
                    "time": null
                },
                {
                    "user": "Arnaud Diederen",
                    "text": "<span class=\"comment-copy\">Since 7.1, IDA also provides tooltips for those arguably cryptic single-letter columns. Just hover your mouse over the column header for a couple seconds, and the tooltip should appear.</span>",
                    "time": null
                }
            ]
        }
    ]
}