{
    "title": "How can I make sense of an Android NDK library?",
    "link": "https://reverseengineering.stackexchange.com/questions/18591/how-can-i-make-sense-of-an-android-ndk-library",
    "content": "So I'm currently trying to understand how an Android app interprets the data sent from a Bluetooth-enabled scale.\nUnderstanding the Java code was relatively easy. The code was obfuscated but I found out how the Bluetooth protocol works.\nHowever, the app use the Android NDK to call a native (armeabi) library that calculates data like body fat percentage from the data sent from the scale (weight, impedance...): libBodyfat.so\nI know what all the parameters are and what the C-functions return, but I don't know how they do it (what calculations are done).\nApparently it's not possible to create readable code from a C library the way it's possible with Java. I found some tools that were recommended to work with C binaries (e.g. IDA) but they don't work with ARM binaries.\nWhat can I do to understand how the library works?\n",
    "votes": "2",
    "answers": 2,
    "views": "2k",
    "tags": [
        "android",
        "arm"
    ],
    "user": "akichii",
    "time": "Jun 23, 2018 at 21:13",
    "comments": [
        {
            "user": "Elian Kamal",
            "text": "By readable C code are you referring to comprehensive C commands such as printf(), or are you referring to obfuscated ARM assembly output? Edit: noticed you wrote \"the way it's possible with Java\" and thus I believe that you're referring to C source code ouptut.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "Any disassembler that supports the ARM for which the code was built, will be able to give you a readable representation. However, it takes more effort to make sense of these mnemonics produced by a disassembler than of C pseudo code. There are also free (of charge) and affordable decompilers for hobbyists which support ARM and produce pseudo code. Your question is right at the heart of what reverse code engineering is about.\n",
            "time": null
        },
        {
            "user": "akichii",
            "text": "Can you recommend some free ARM decompiler?\n",
            "time": null
        },
        {
            "user": "w s",
            "text": "You can find online decompilation service at retdec.com (it is able to decompile 32 bit arm and as far as I can tell from your mentions of armeabi it should fit). It is open source and its sources are here : github.com/avast-tl/retdec\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Hope it is not too late. I will try to help you on this. I've been go through this and that to reverse engineer that exactly same library. <pre><code>libBodyfat.so</code></pre>. As @TheKalin answered, you will find few <pre><code>.so</code></pre> files in the folder. \nI found x86-64 is the easiest to read compare to others. Here are the tools that I used to reverse engineer the library:\n\nIDA-free. It will list the constant value nicely.\nHopperApp. I used it for disassemble and decompile to c-like language. It also able to disassemble ARM. You can try the demo version, but it will close the app for sometimes and you need to re-open it.\nHex to Float Convt.. Some constant values are used in the formula, I converted those values with this website.\nAnd websites to learn how the assembly instructions work.\n\nI manage to convert some of the functions (init & body fat percentage) to javascript functions\nHere it is. I have not clean up the code yet. And please do let me know if there is mistakes or something that I need to improve.\nhttps://gist.github.com/mamadcloud/95c8fe8f5816286f2ad62c81f937e6b6\nHope it is helpful.\n",
            "votes": "1",
            "user": "Muhammad Hasni",
            "time": "Jul 25, 2018 at 1:56",
            "is_accepted": true,
            "comments": [
                {
                    "user": "akichii",
                    "text": "<span class=\"comment-copy\">Wow, that's impressive! I couldn't even find out how to open the binary in IDA free. I'll test your implementation against the libBodyfat.so and report back later.</span>",
                    "time": null
                },
                {
                    "user": "Muhammad Hasni",
                    "text": "<span class=\"comment-copy\">sure. let me know if the result is incorrect or does not match with the library or there is something need to be improved. thanks!</span>",
                    "time": null
                },
                {
                    "user": "akichii",
                    "text": "<span class=\"comment-copy\">I think we were actually working on two different libraries. I looked at a library that exports the  <code>com.holtek.libHTBodyfat</code> namespace included in <a href=\"https://www.apkmirror.com/apk/anhui-huami-information-technology-co-ltd/\" rel=\"nofollow noreferrer\">\"Mi Fit\"</a>. However, I will try to follow your steps since it seems to work nicely in this case and report back if I succeed.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Reverse engineering of  .so file is not an easy task. C is not like java, where you can turn .class files into more readable forms like .smali. \nYou can use radare2 to inspect .so file, however to get anything from the r2 output you need some basic knowledge on processor architecture and proper opcodes. \nYou can begin your education here :  https://azeria-labs.com/writing-arm-assembly-part-1/ \nOr you can find some basic instructions below:\nLets assume that you have radare2 installed and you have already unziped your apk file. \nGo to the apk directory and list the lib directory abi docs: \n\n$  tree lib\nlib/\n├── arm64-v8a\n│   └── libnative-lib.so\n├── armeabi-v7a\n│   └── libnative-lib.so\n├── x86\n│   └── libnative-lib.so\n└── x86_64\n    └── libnative-lib.so\n\n4 directories, 4 files\n\n\nSelect your platform (for your case it will be armeabi-v7a or arm64-v8a)\nOpen it with ( -A option runs aaa command )  \n<pre><code> r2 -A lib/armeabi-v7a/libnative-lib.so\n</code></pre>\nList the functions or search the specific function name \n\n    [0x00006498]> afl\n    [0x00006498]> afl ~JNI\n    0x000064e4    9 256  -> 238  sym.Java_foo_com_bar_MainActivity_stringFromJNI\n    0x000065f0    1 44           sym._JNIEnv::NewStringUTF_charconst\n    0x00006724    1 28           sym.JNI_OnLoad\n    //Jump to the function:\n    $ [0x00006498]> s 0x00006724\n    //print the instructions\n    $ [0x00006724]> pdf \n/ (fcn) sym.JNI_OnLoad 28\n|   sym.JNI_OnLoad ();\n|           ; var int local_0h @ sp+0x0\n|           ; var int local_4h @ sp+0x4\n|           ; var int local_8h @ sp+0x8\n|           ; var int local_ch @ sp+0xc\n|           ; var int local_10h @ sp+0x10\n|           ; UNKNOWN XREF from 0x00000234 (aav.0x00000224 + 16)\n|           0x00006724      85b0           sub sp, 0x14\n|           0x00006726      0a46           mov r2, r1\n|           0x00006728      0346           mov r3, r0\n|           0x0000672a      0490           str r0, [sp + local_10h]\n|           0x0000672c      0391           str r1, [sp + local_ch]\n|           0x0000672e      0620           movs r0, 6                  ; aav.0x00000006\n|           0x00006730      .dword 0x0001f2c0 ; aav.0x0001f2c0\n|           0x00006734      0290           str r0, [sp + local_8h]\n|           0x00006736      0298           ldr r0, [sp + local_8h]\n|           0x00006738      0192           str r2, [sp + local_4h]\n|           0x0000673a      0093           str r3, [sp]\n|           0x0000673c      05b0           add sp, 0x14\n\\           0x0000673e      7047           bx lr\n\n\nNow you have to interpret the radare2 output, to do this you need the op codes list with description, it can be found here or (for arm64) here.\nAs you can see there is no easy way. \nTIP\nYou can tell radare2 to write opcodes description next to them. Just type\n<pre><code>e asm.describe=1\n</code></pre>\nand the output will change to something like this:\n\n|           0x0000672e      0620           movs r0, 6                  ; aav.0x00000006 ; move immediate into register and update flags\n|           0x00006730      .dword 0x0001f2c0 ; aav.0x0001f2c0         ; write 16 bit value on top of halfword\n|           0x00006734      0290           str r0, [sp + local_8h]     ; store register into memory\n|           0x00006736      0298           ldr r0, [sp + local_8h]     ; load from memory to register\n|           0x00006738      0192           str r2, [sp + local_4h]     ; store register into memory\n|           0x0000673a      0093           str r3, [sp]                ; store register into memory\n\n\nFinal note: \nArm libraries sometimes use Thumb mode, and this is the topic for another time. You can find some info about thumb mode on  azeria-labs webiste\n",
            "votes": "2",
            "user": "TheKalin",
            "time": "Jun 27, 2018 at 6:22",
            "is_accepted": false,
            "comments": []
        }
    ]
}