{
    "title": "Reverse engineering Nord Lead 4 control board",
    "link": "https://reverseengineering.stackexchange.com/questions/18611/reverse-engineering-nord-lead-4-control-board",
    "content": "I am reverse engineering a synthesizer named nord lead 4.\nI want to tap in between the control board and mainboard which has the microprocessor.\nI didn't start analyzing the signals on the board while it's powered on. I've just been mapping the routes between ICs and familiarizing myself with them.\nI figured out the meaning of all the pins on the 26 pin cable between the control board. It has pins for the potentiometers two leg switches, seven segment displays, and others.\nThis board also has several ICs that I am interested in. 3 ADCs (max1039), a mux/demux(hc4052), 2 octal bus transceivers(lc245a), and 6 flipflop ICs(hct374) which are probably used for the seven segment displays, and one demux(lvc138a).\nI also figured out all the selects and connection between the ADCs and the mux/demux hc4052. This is most of everything I currently know about the topology.\nMy question is about the switches. There are around 34 switches in this control board(ones you press with your finger, they are momentary switches). They have two legs, which are electrically connected only when you're pressing the switches.\nThese switches are distributed to 8 buses of the octal transceiver(lc245a) and as well as the microprocessor. So multiple switches are on the same bus.\nDo you have an idea how this machine reads them and know which is which?\nI'm trying to figure out how to determine which switches are which on the bus.\nThank you very much\nPlease tell me if you need more info.\n",
    "votes": "4",
    "answers": 0,
    "views": "69",
    "tags": [
        "hardware"
    ],
    "user": "Ali Somay",
    "time": "Jun 26, 2018 at 21:58",
    "comments": [
        {
            "user": "Ali Somay",
            "text": "This question is answered in Electrical Engineering Stack Exchange, electronics.stackexchange.com/questions/381869/…\n",
            "time": null
        }
    ],
    "answers_data": []
}