{
    "title": "radare2 not showing function names",
    "link": "https://reverseengineering.stackexchange.com/questions/18718/radare2-not-showing-function-names",
    "content": "I'm using radare2 and I've noticed that it simply prints function offsets rather than function names. \nI've done some tests and I've discovered that on Kali it prints offsets and on debian it prints names.  \nHere you can see how r2 behaves in Kali:\n\nIt is, for example, printing <pre><code>call 0x4ce645</code></pre> insted of <pre><code>call reloc.puts_WhatEver</code></pre>. When I inspect ELF properties, I can see that function names are indeed located at that offset.\n\nI don't really know what is making r2 behave that way. Here is some info about Kali environment I'm using.\n\nOn the other hand, when using r2 on Debian and debugging the exact same file I can prefectly see function names. \n\nHere is some info about Debian environment I'm using.\n\nThe file I'm debugging in both Kali and Debian is exactly the same.\n\n\nHow could I get r2 to behave in Kali exactly the same way it is behaving in Debian?\n",
    "votes": "1",
    "answers": 0,
    "views": "1k",
    "tags": [
        "radare2"
    ],
    "user": "Razvi",
    "time": "Jul 7, 2018 at 14:20",
    "comments": [
        {
            "user": "Megabeets",
            "text": "Do you use the latest version of radare2? To check, please share the output of <pre><code>r2 -v</code></pre>. The latest version is 2.6. Such bugs are sometimes caused by old version of r2. If this is the case, do not use radare2 version from your distribution's repositories (i.e <pre><code>apt-get install radare2</code></pre>), hence the differences you see. Use the latest version from git or at least the last release. See installation instructions here.\n",
            "time": null
        },
        {
            "user": "Razvi",
            "text": "Hello @Megabeets, turns out I have installed r2 2.7 version in Kali (missworking) and r2 2.4 version in Debian (properly working) IMG: ibb.co/dYL4mo\n",
            "time": null
        },
        {
            "user": "realtebo",
            "text": "I love when new version has regression not catched from dev team.\n",
            "time": null
        },
        {
            "user": "Megabeets",
            "text": "@Razvi so it might be a bug. Please open an issue in the radare2 Github repository, describing the problem.\n",
            "time": null
        }
    ],
    "answers_data": []
}