{
    "title": "How to bypass ZwContinue?",
    "link": "https://reverseengineering.stackexchange.com/questions/18738/how-to-solve-anti-patch-protection-involving-ntcontinue",
    "content": "During an analysis, I have found a call to <pre><code>ZwContinue</code></pre>. The executable file first gets the address of <pre><code>ntdll.NtContinue</code></pre> and stores it in the EAX register.\nAfter I step over the following assembly line, \n<pre><code>  CALL EAX      ; ntdll.ZwContinue\n</code></pre>\nthen OllyDbg (v1.10) terminates the process.\nI have found out that this is a kind of anti-debugging mechanism but I could not figure out how to defeat it.\nIs there any plugin which I can use or any other helpful trick?\n",
    "votes": "10",
    "answers": 2,
    "views": "8k",
    "tags": [
        "assembly",
        "anti-debugging"
    ],
    "user": "Reverto",
    "time": "May 7, 2015 at 16:37",
    "comments": [],
    "answers_data": [
        {
            "content": "ntdll!ZwContinue takes the same parameters than ntdll!NtContinue, that is the following :\n<pre><code>NTSTATUS NTAPI \nNtContinue (\n  IN PCONTEXT ThreadContext,\n  IN BOOLEAN  RaiseAlert\n);\n</code></pre>\nYou can read the \"Eip\" field in the PCONTEXT structure, put a breakpoint on this address, and press Run to reach your breakpoint and continue your analysis.\nIf you want to try Olly 2.01, it has a nice feature for this particular case : \"Decode as structure\" in the Dump Window.\n",
            "votes": "10",
            "user": "Community",
            "time": "Mar 10, 2017 at 9:42",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user3097712",
                    "text": "<span class=\"comment-copy\">thanks for your answer. To set a BP at EIP in PCONTEXT, do I have to find the EIP value in the hex window, or how can I achieve that in ollydbg v1.10 ?</span>",
                    "time": null
                },
                {
                    "user": "Spl3en",
                    "text": "<span class=\"comment-copy\">@user3097712 I don't know another way than doing it manually on OllyDBG 1.10.</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">ollydbg 1,10 alt+f1 -&gt; bp [[esp+4] + 0xb8 ] when broken on ntdll!Nt/ZwContinue will set a break on PContext-&gt;Eip in x86</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">From user mode <code>NtContinue</code> is in fact identical to <code>ZwContinue</code>. More of these <code>Nt*</code>/<code>Zw*</code> pairs exist and they are usually the primary system services. In kernel mode these functions also exist, but differ. One of them (don't remember which) will have access checks in place when called from user mode, whereas the other is meant to be used from a kernel mode caller exclusively.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Check the context argument to NtContinue (first arg). NtContinue works as an anti-debug by potentially clearing DR7 or breaking out of single stepping by clearing the trap flag, then returning to the IP specified in the context, after applying the register state.\n",
            "votes": "7",
            "user": "everdox",
            "time": "May 4, 2015 at 22:15",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">While the other answer describes how to get around it, this one explains much better what's going on under the hood.</span>",
                    "time": null
                }
            ]
        }
    ]
}