{
    "title": "What location is this and what does it signify - \"d:\\w7rtm\\minkernel\\ntdll\\ldrinit.c\" [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/18831/what-location-is-this-and-what-does-it-signify-d-w7rtm-minkernel-ntdll-ldrin",
    "content": "This question already has an answer here:\n                                \n                            \n\n\n\n\nAre those code snippets and file paths in a C++ binary some sort of standard debug information?\n\n                                (1 answer)\n                            \n\nClosed 6 years ago.\n\n\n\nCame across this while debugging a exe. Cant find much on it anywhere so thought I'll put it up here. Any ideas as to what this could be used for?\nCPU Disasm\nAddress   Hex dump          Command                                  Comments\n77887F10   .  64 3A 5C 77 3 ASCII \"d:\\w7rtm\\minkern\"                 ; ASCII \"d:\\w7rtm\\minkernel\ntdll\\ldrinit.c\"\n",
    "votes": "3",
    "answers": 1,
    "views": "3k",
    "tags": [
        "malware"
    ],
    "user": "Chuck Nurit",
    "time": "6 years ago",
    "comments": [
        {
            "user": "Chuck Nurit",
            "text": "how is it a duplicate? completely different path...\n",
            "time": null
        },
        {
            "user": "c00000fd",
            "text": "This is not malware. That is most certainly a path to the Windows source code files where that build of Windows was compiled from. For instance in the symbols for <pre><code>ntdll.dll</code></pre> for Windows 10 now, there's a lot of debugging strings that give the following folder as the location of their source files: <pre><code>\"minkernel\ntdll\\*****\"</code></pre>\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Looks like a path that you might find in a checked (== with assertions) build of Windows 7 as a source path in the output of failed assertions. However, it could be a fake to make something appear more legit. You're tagging the question as malware but I don't quite see the connection.\nGiven the path it would not be inconceivable to think that this is some code that uses an older version of <pre><code>ntdll.dll</code></pre> loaded by another name. Stranger things have happened, such as loading a second <pre><code>ntoskrnl.exe</code></pre> to dodge a possibly patched running kernel.\nAnyway the RTM in <pre><code>w7rtm</code></pre> means release to manufacturer and refers to the very first release version of a Windows. And given that this refers to Windows 7, this is several years old by now.\n",
            "votes": "0",
            "user": "0xC0000022L",
            "time": "Jul 18, 2018 at 6:13",
            "is_accepted": false,
            "comments": []
        }
    ]
}