{
    "title": "How to find start of .text section?",
    "link": "https://reverseengineering.stackexchange.com/questions/18840/how-to-find-start-of-text-section",
    "content": "i made a random console application and loaded into IDA. The start of .text section shown is 00BA1000. Then i loaded the application into CFF explorer. The address of entry point was 000110AA. Is it the offset to the function? If yes, is it the raw offset (in the exe file) or virtual offset (after the exe is loaded in memory) ? Then i saw there was a key named 'base of code'. Why isnt addressofentrypoint the same as base of code? I mean, they are start of the text section too right? With IDA , i can know the start of .text section is 00BA1000. But, how can i know it with CFF explorer? With CFF, i can know the virtual address of text section is 00011000. So when the program is loaded into memory, the start of the text section should be imagebase + 00011000 right? With ollydbg i can know its wrong. The calculated address isnt the correct one, but the one shown in IDA is. These questions messed me up. Hope you can help me !!!\nCFF explorer (basically helps you look into PE header) : https://ntcore.com/?page_id=388\nScreenshots:\nhttps://i.sstatic.net/Fj8vy.jpg\nhttps://i.sstatic.net/mOCHs.jpg\nhttps://i.sstatic.net/5rW6t.jpg\nThanks a lot for reading!\n",
    "votes": "3",
    "answers": 1,
    "views": "4k",
    "tags": [
        "ida",
        "disassembly"
    ],
    "user": "Mod Coc",
    "time": "Jul 19, 2018 at 0:41",
    "comments": [
        {
            "user": "sudhackar",
            "text": "When you open an application in IDA, it is automatically loaded to an address which is usually random. you can rebase it to a different address(edit->segments->rebase). To look at different segments go to view->open subviews->segments or press Shift+F7. I don't know if there's a rebase feature in CFF explorer.\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "there's a bit of chaos in your question. Would you mind rewriting it so it's more clear?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Base of code is where the code starts\nAddress of Entrypoint is Where the executable starts executing (the main function's first instruction) \nthey both can be same or different   \nhere is an example where they both are same   \n<pre><code>:\\>dumpbin /headers funadd.exe | grep -iE \"base of code|entry point\"\n            1000 entry point (00401000) _WinMain@16\n            1000 base of code\n</code></pre>\nthat is becasue the main function does not refer any other function   \nsuppose you have code like this   \n<pre><code>int main (void) { printf ( \"%x\n\" , dosomecrap() ); }   \n</code></pre>\nthen when compiling the main function needs to refer to the dosomecrap()   function  so the compiler will compile the dosomecrap() first and put the   code from base of code \nin this case main () comes later in the code section\nso they both wont be same   \nAddress of Entry Point will point to main()\nBase of code may point to start of dosomecrap()   \nin normal compiled executables   main is not the first code that is exceuted   \nit is cruntime init code like maincrtstartup() or WinMainCrtStartup()   \nthat is executed first    \nimport section can be  merged into text section \nin that case the resolved imports start at base of code \nyou can write code like this and merge data section into .text section in this case the embedded bytes would be the first bytes at base of code \n<pre><code>#include <windows.h>\n\nint p[] = { '\\x90\\x90\\x90\\x90' };\n\nint funAdd() {\n    int myvar = 2; \n    return myvar + p[0];\n}\n\nint CALLBACK  WinMain(_In_ HINSTANCE,_In_opt_ HINSTANCE,_In_ LPSTR,_In_ int) {\n    funAdd();\n}\n</code></pre>\nif you compile this with \n<pre><code>cl /Zi /W4 /analyze /EHsc /Od /nologo funadd.cpp /link /release /subsystem:windows /entry:WinMain /nologo /merge:.data=.text\n</code></pre>\nand check you can see bith base of code an address of entry point differ \nAddress of entry point has been shifted 16 bytes or 0x10 bytes (alignment requirement says code should be aligned to 16 byte boundary ) \n<pre><code>:\\>dumpbin /headers funadd.exe | grep -iE \"base of code|entry point\"\n            1010 entry point (00401010) _WinMain@16\n            1000 base of code\n</code></pre>\nyou can see the 0x90 as below \n<pre><code>:\\>dumpbin /disasm /range:0x401000,0x401016  funadd.exe\nMicrosoft (R) COFF/PE Dumper Version 14.14.26430.0\nCopyright (C) Microsoft Corporation.  All rights reserved.\n\n\nDump of file funadd.exe\n\nFile Type: EXECUTABLE IMAGE\n\n?p@@3PAHA:\n  00401000: 90 90 90 90                                      ....\n  00401004: 00 00 00 00 00 00 00 00 00 00 00 00              ............\n_WinMain@16:\n  00401010: 55                 push        ebp\n  00401011: 8B EC              mov         ebp,esp\n  00401013: E8 08 00 00 00     call        ?funAdd@@YAHXZ\n\n  Summary\n\n        1000 .text\n</code></pre>\n",
            "votes": "4",
            "user": "blabb",
            "time": "Jul 19, 2018 at 17:30",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Mod Coc",
                    "text": "<span class=\"comment-copy\">great explanation! but i have 2 questions here: 1. as you mentioned , data of variable p (\\x90\\x90\\x90\\x90) is located in .text section. But what should we do make it appear in the .idata section? i mean it should be more preferable to place in data section right? :) 2. Why should there be 400000 bytes of image base. Is there any purpose for it? According to msdn, it is the preferred address of the first byte of image when loaded into memory. But why is it needed to do that? Does it improve loading efficiency?</span>",
                    "time": null
                }
            ]
        }
    ]
}