{
    "title": "How debug process that not started with ida? [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/18874/how-debug-process-that-not-started-with-ida",
    "content": "This question already has an answer here:\n                                \n                            \n\n\n\n\nIDA Pro debugging: follow child process\n\n                                (1 answer)\n                            \n\nClosed 6 years ago.\n\n\n\nI am trying to debug two different exe files,in windows.\nThe first exe launches the second, and the second exe doesn't work well unless the first starts it.\nI want to be able to debug the second exe.\nI want to debug the begging of the exe, so attaching isn't an option.\nDoes IDA have a way to debug a process that's launched by another?\n",
    "votes": "2",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ida",
        "windows",
        "debugging"
    ],
    "user": "Jonert6544",
    "time": "6 years ago",
    "comments": [
        {
            "user": "Avery3R",
            "text": "The references to \"exe\" makes me think that this is about windows, and therefore not a dup\n",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "@Avery3R Although linked question seems to revolve around ELF files specifically, I believe the answer applies just the same regardless of OS.\n",
            "time": null
        },
        {
            "user": "Jonert6544",
            "text": "@Megabeets that not help, event I breakpoint in <pre><code>fork</code></pre> or<pre><code>execve</code></pre> I can't debug the new process in the beginning\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "In a similar way, windows services must also be started by a special process. Microsoft has documentation on how to debug these kinds of processes.\nThe applicable section is \"Configure a service to start with the WinDbg debugger attached\"\n\nLocate the following registry key <pre><code>HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options</code></pre>\nCreate a new subkey with the name of the executable\nWithin that subkey create a new string value named <pre><code>Debugger</code></pre>\nSet that value to the path to your debugger. See IDA's documentation for the needed command line flags.\n",
            "votes": "3",
            "user": "Avery3R",
            "time": "Jul 23, 2018 at 20:42",
            "is_accepted": false,
            "comments": []
        }
    ]
}