{
    "title": "What is the difference between IDA and OllyDbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/18885/what-is-the-difference-between-ida-and-ollydbg",
    "content": "When I want to debug an exe in Windows, what advantages does OllyDbg have over IDA?\nIn IDA, I'm using the WinDbg debugger back-end.\n",
    "votes": "5",
    "answers": 2,
    "views": "11k",
    "tags": [
        "ida",
        "windows",
        "ollydbg",
        "debugging"
    ],
    "user": "Keystone",
    "time": "Jul 25, 2018 at 0:27",
    "comments": [],
    "answers_data": [
        {
            "content": "To put it very simply, there are two primary methods of analysis:\nStatic Analysis: Analyzing an executable while it's not running.\nDynamic Analysis: Analyzing an executable while it's running.\nIDA is primarily geared towards static analysis (though it does have dynamic debugging functionality, as you've noted), where OllyDbg (and x32dbg/x64dbg, Immunity Debugger, WinDbg, Cheat Engine, etc.) is geared towards dynamic analysis.\nIt's not uncommon that you would run IDA and OllyDbg simultaneously. If you would like a great example of use cases to see both in action (individually and together), consider the following workshop: Reverse Engineering for Beginners (specifically, the final section regarding hacking Minesweeper)\n",
            "votes": "10",
            "user": "dsasmblr",
            "time": "Jul 25, 2018 at 0:36",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "OllyDbg is a debugger for Windows x32 and x64 and its only focus is dynamic analysis, although it can be also used for non deep static analysis.\nIDA is the de-facto tool for doing static analysis and also supports dynamic analysis (i.e.: debugging) for several architectures, backends and operating systems.\nOllyDbg doesn't have any real advantage over IDA other than, most of the time, the people using OllyDbg are used to use OllyDbg since long ago. Actually, it isn't maintained any more (or is it?) while IDA is actively maintained. One real advantage over IDA, however, is that OllyDbg is freeware while IDA is a commercial application and its freeware version lacks debugging capabilities.\n",
            "votes": "7",
            "user": "joxeankoret",
            "time": "Jul 25, 2018 at 6:14",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Elian Kamal",
                    "text": "<span class=\"comment-copy\">OllyDbg is also much more lightweight and portable than a full IDA installation, it doesn't even require installation</span>",
                    "time": null
                },
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">Neither IDA, copying the directory is enough.</span>",
                    "time": null
                },
                {
                    "user": "Elian Kamal",
                    "text": "<span class=\"comment-copy\">Oh nice I didn't know. However Olly is still significantly smaller, but I guess this is rarely relevant today unless it's ancient hardware that you need to reverse on.</span>",
                    "time": null
                },
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">Olly is much smaller because it doesn't have all the functionality that IDA has in it.</span>",
                    "time": null
                },
                {
                    "user": "Limina102",
                    "text": "<span class=\"comment-copy\">@joxeankoret and because it is written in the pre-XP era technique, when people don't grab the whole chromium for a simple app :P</span>",
                    "time": null
                }
            ]
        }
    ]
}