{
    "title": "How to use API monitor on specific process",
    "link": "https://reverseengineering.stackexchange.com/questions/19037/how-to-use-api-monitor-on-specific-process",
    "content": "I want to monitor specific process with API Monitor but I didn't understand how do I do it please.\nI will happy to understand that.\nBy the way, can I monitor process while I debugging it with ida?\n",
    "votes": "3",
    "answers": 2,
    "views": "6k",
    "tags": [
        "debugging",
        "process",
        "api"
    ],
    "user": "Keystone",
    "time": "Nov 11, 2018 at 17:50",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Given your last sentence: what is it you want to achieve? (as opposed to what step do you think should be next). Oftentimes others have had to solve similar problems and they may have developed techniques which are beyond the scope of your very narrow question but work well or better than what you're trying right now.\n",
            "time": null
        },
        {
            "user": "Keystone",
            "text": "I want to solve reverseengineering.stackexchange.com/a/19003/23993 so I want to see how my process call to another process, whitch buffer it send to it\n",
            "time": null
        },
        {
            "user": "Biswapriyo",
            "text": "Open the binary in any disassembler or decompiler. Check the import functions. With that you can get basic idea about which IPC method is used.\n",
            "time": null
        },
        {
            "user": "Keystone",
            "text": "@Biswapriyo I didnt find any function tgat explain which  ipc methode is used, so I looking to understand how to monitor process with api monitor\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Fire up API Monitor (with the correct architecture fitting your sample)\nSet the API hooks you need. This highly depends on what you are looking for. To see which APIs your exe is usually using you can use ApiLogger (https://www.aldeid.com/wiki/SysAnalyzer/ApiLogger)\n\n\nDon't forget to set the Breakpoints Before Call\n\nIn my example I set a filter on VirtualAlloc from Kernel32.dll\n\nOpen your sample you want to have a look at:\n\n\nIf you are seeing no results you may have to play with \"Attach Using\" which is by default set to \"Static Import\"\n\nRun your sample and if everything works well you'll hit your breakpoint and you can stat to edit (and dump) the corresponding memory:\n",
            "votes": "3",
            "user": "hariom",
            "time": "Aug 13, 2018 at 13:48",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Keystone",
                    "text": "<span class=\"comment-copy\">Thank you, is there a way only record all the api call that my exe do without set any breakpoint??</span>",
                    "time": null
                },
                {
                    "user": "hariom",
                    "text": "<span class=\"comment-copy\">Sure use Api Logger: <a href=\"https://www.aldeid.com/wiki/SysAnalyzer/ApiLogger\" rel=\"nofollow noreferrer\">aldeid.com/wiki/SysAnalyzer/ApiLogger</a></span>",
                    "time": null
                },
                {
                    "user": "Keystone",
                    "text": "<span class=\"comment-copy\">Is that show me api call from spesific process and the value? For example if my process write to file text: <code>abc</code>  withApiLogger will I see the <code>abc</code>?  Api monitor is for dynamic monitor and ApiLogger is for static monitor?  Thanks</span>",
                    "time": null
                },
                {
                    "user": "hariom",
                    "text": "<span class=\"comment-copy\">Not sure about API logger but with API Monitor you can see the parameters and buffers passed to a function (See Point 4 of my answer). You can even export the buffer to disk and proceed from there.</span>",
                    "time": null
                },
                {
                    "user": "Keystone",
                    "text": "<span class=\"comment-copy\">@harion , I don't see the process I want to monitor in the process list bellow even this process running</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Another option (although not as good a choice as API Monitor in this scenario) is to use SysInternals' Process Monitor. It will record (in great detail) all activity performed by your application. \n\nProcess Monitor is a free tool from Microsoft that displays file\n  system, registry, process, and other activities on the system. It’s an\n  invaluable tool for troubleshooting Windows problems as well as for\n  malware forensics and analysis tasks. The thoroughness of the tool is\n  also weakness, as the amount of data captured by Process Monitor can\n  easily overwhelm the analyst.\n\nFortunately, you can filter the output of Process Monitor, and some have even created filter-sets that you can download and load into Process Monitor, saving you the time of creating them yourself.\n",
            "votes": "0",
            "user": "Mick",
            "time": "Nov 11, 2018 at 17:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}