{
    "title": "How do i find the decryption key for a encrypted text file [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/19048/how-do-i-find-the-decryption-key-for-a-encrypted-text-file",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 6 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nSo context i have a game and a encrypted save file. My thoughts were how to find the decryption key in reverse engineering my game .I watched tuts but i think this topic isnt much detailed so i need advice guys.\n",
    "votes": "-2",
    "answers": 1,
    "views": "1k",
    "tags": [
        "encryption",
        "decryption",
        "cheat-engine",
        "game-hacking"
    ],
    "user": "RiseYx Saramoso",
    "time": "6 years ago",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Welcome to RE.SE! No idea how many games exist out there, but you need to add more details as this question is very broad as of now. Pretend for a minute that you have only the information you give in your \"question\" and then reflect on this.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I voted to close this question because it is, unfortunately, too broad to properly answer.\nOne has to gain some knowledge and experience in the reverse engineering world before one can tackle some of the real-world scenarios. you may want to start with learning assembly and doing a few crackmes, which are designed to improve one's reverse engineering skills.\nThen, you could use this Stack Exchange site to ask specific questions about difficulties and challenges encountered. Alternatively, you can edit this question or post a new one with what you've done so far and what prevents you advancing forward.\n",
            "votes": "1",
            "user": "realtebo",
            "time": "Aug 13, 2018 at 13:48",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user202729",
                    "text": "<span class=\"comment-copy\">\"this\" (i.e., <a href=\"https://reverseengineering.stackexchange.com\">Reverse Engineering</a>) is not a <a href=\"https://stackoverflow.com\">Stack Overflow</a> site, it's a <a href=\"https://stackexchange.com\">Stack Exchange</a> site.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Yes. I'm aware of the subtle difference. I often treat the two as synonyms... feel free to correct if this bothers you.</span>",
                    "time": null
                }
            ]
        }
    ]
}