{
    "title": "What are the first 16 bytes in .rodata section?",
    "link": "https://reverseengineering.stackexchange.com/questions/19127/what-are-the-first-16-bytes-in-rodata-section",
    "content": "What are the first 16 bytes in the <pre><code>.rodata</code></pre> section?\nFor example, I have the following code:\n<pre><code>#include <cstdio>\n\nvoid myprintf(const char* ptr) {\n        printf(\"%p\n\", ptr);\n}\n\nint main() {\n        myprintf(\"hello world\");\n        myprintf(\"\\0\\0\");\n        myprintf(\"ab\\0cde\");\n        static char hi[] = \"hi\";\n        myprintf(hi);\n}\n</code></pre>\nI compiled:\n<pre><code>$ g++ -Wall test_elf.cpp -o test_elf -O3 -std=c++17\n</code></pre>\nAnd then\n<pre><code>$ readelf -W -p .rodata test_elf \n\nString dump of section '.rodata':\n  [    10]  %p^J\n  [    14]  hello world\n  [    23]  ab\n  [    26]  cde\n</code></pre>\nAs you can see, there are 16 bytes before the first constant string literal.  I use <pre><code>elf.h</code></pre> to parse, and I also see there are 16 bytes before the first constant string literal.  14 bytes of them are just zero.  1 non zero byte is <pre><code>1</code></pre>.  Another is <pre><code>2</code></pre>.\n",
    "votes": "4",
    "answers": 1,
    "views": "2k",
    "tags": [
        "c++",
        "elf",
        "compilers"
    ],
    "user": "HCSF",
    "time": "Aug 25, 2018 at 19:48",
    "comments": [
        {
            "user": "user202729",
            "text": "Possible duplciate on Stack Overflow.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Trying to provide a more general answer that would hopefully complement this answer linked in the comments.\nTo those who are unsure, the <pre><code>.rodata</code></pre> section in an executable contains all read-only variables and constants with a global scope (i.e. will be defined for the entire duration of the program's execution) although the lines are becoming a little blurry and there are exceptions to the rules which are not actually enforced, the <pre><code>.rodata</code></pre> section usually hold all global and static variables that are read only. This is obviously the reason the strings you defined are there.\nAlthough your code does not directly define any constructs except those few string literals, the <pre><code>.rodata</code></pre> section will hold all data deemed globally scoped and read-only by the compiler and linker, regardless of whether it was defined in your code or an additional variable/object your program uses explicitly or implicitly.\nNow to your question; I mentioned additional objects can be explicitly and implicitly defined in your code, without you actually writing them. One explicit example is all the code <pre><code>#include</code></pre>ed in your program (<pre><code>cstdio</code></pre> in this case). Code implicitly included in your program is, for example, the code GCC adds that wraps and calls your defined <pre><code>main</code></pre> function and handles different operating system interfaces (setting up functions related stdin, stderr, stdout) as well as set up and teardown of program objects (that code is where globally scoped objects are initialized by calling their constructor in C++).\nAlthough this is explained in depth in the linked answer, the actual values (<pre><code>1</code></pre> and <pre><code>2</code></pre>) appear to be for a constant defined by GCC's <pre><code>init.c</code></pre>:\n<pre><code>const int _IO_stdin_used = 0x20001;\n</code></pre>\nThat file is part of GCC's initialization code mentioned above, and is used to control the version of a input/output library GCC implements input/output in programs with.\nit's worth noting that an hex-dump will help increase confidence in whether that is indeed the reason for the additional bytes you're seeing, as well as following the compilation and linking process, of course\nA difference worth mentioning between your example and the one in the SO question if the 14 zero bytes, which are of course padding to a boundary of 16 bytes, which is something compilers often do to optimize for execution time. Replacing the <pre><code>-O3</code></pre> with <pre><code>-Os</code></pre> (optimize for size) will probably drop the 14 null bytes, although that is not guaranteed and may depend on the version of GCC you're using.\n",
            "votes": "5",
            "user": "NirIzr",
            "time": "Aug 23, 2018 at 0:44",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user202729",
                    "text": "<span class=\"comment-copy\"><a href=\"https://tio.run/##bVBNa8MwDL3rVwiX0a6ZS3baYWn/wo49NGWotjMbXNvY2tYx@tuzEEoIrLrpfYind6Ji@14R79gUfje@26iUmmZpYreEhQvKf2qDjSqsXdwBfEWn8fyTsgvcrVQMhVFZymtMnB/xF/A2N4V4SG0QTyP7CleAAcUzubCai6eDwhrvI37H7LUYDP8Fbd3W9xk6tbXSZk4WJnZqDIjWHY64RWGduOO2bow3vA3wUVUo9@Q9zktBGacd5VtBOXSyVVX1/ALZkB7hPcoLbnLUxDSp@/4P\" rel=\"nofollow noreferrer\">No it doesn't</a>.</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Yes, I made clear that was just an assumption I made. Thanks for following it through with a test.</span>",
                    "time": null
                },
                {
                    "user": "HCSF",
                    "text": "<span class=\"comment-copy\">Thanks for expanding the answer in another post.  Just a side question -- is it possible to figure out programmatically (e.g. parsing with elf.h) whether a given virtual memory address/offset is a string literal instead of other constants?  Thanks!</span>",
                    "time": null
                },
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">That question might not be as simple as it sounds and additionally more about programing than reverse engineering, I suggest you open a new question over at stackoverflow.com</span>",
                    "time": null
                }
            ]
        }
    ]
}