{
    "title": "How can a Javascript file drop .exe written in Visual Basic without network communication?",
    "link": "https://reverseengineering.stackexchange.com/questions/19129/how-can-a-javascript-file-drop-exe-written-in-visual-basic-without-network-comm",
    "content": "I am analyzing a malicious JS file, which is obfuscated in a way that I could not de-obfuscate. When I executed it in a virtual machine and spectated process changes, I noticed that a new executable was created, which when acquired, turned out to be written in Visual Basic 6.\nI know that JS droppers often are written to download the secondary malware but in this case, the exe is created without any network communication. Does that mean that the VB6 exe was packed in the original JS file? On a high level, how can this be implemented?\n",
    "votes": "1",
    "answers": 2,
    "views": "220",
    "tags": [
        "unpacking",
        "javascript",
        "visual-basic"
    ],
    "user": "skooog",
    "time": "Aug 22, 2018 at 13:18",
    "comments": [],
    "answers_data": [
        {
            "content": "The executable is most likely embedded inside the javascript file itself, or of any accompanying files (say, an <pre><code>.html</code></pre> file that is downloaded with the javascript).\nAs Memo mentioned, the embedded executable can be encoded, obfuscated or even encrypted within the javascript file, where the javascript file will be required to decode, deobfuscate or decrypt it before writing it to disk and executing it.\n",
            "votes": "0",
            "user": "NirIzr",
            "time": "Aug 22, 2018 at 21:43",
            "is_accepted": true,
            "comments": [
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Downvoters, please share any issue with the answer</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Most probably the VB6 executable was base64 encoded and embedded as a string in the obfuscated code. Then decoded back into a binary at runtime.\nhttps://developer.mozilla.org/en-US/docs/Web/API/WindowBase64/Base64_encoding_and_decoding\n",
            "votes": "0",
            "user": "memo",
            "time": "Aug 22, 2018 at 14:09",
            "is_accepted": false,
            "comments": []
        }
    ]
}