{
    "title": "How to reach functions triggered by non-standard buttons?",
    "link": "https://reverseengineering.stackexchange.com/questions/19161/how-to-reach-functions-triggered-by-non-standard-buttons",
    "content": "I've already read related posts such as:\n\nlink1: https://stackoverflow.com/questions/24138087/how-can-i-set-a-breakpoint-for-a-button-click-using-ollydbg\nlink2: How can I set a breakpoint for a button click?\n\nUnfortunately, none of them helped me out to solve my doubts. My goal here is learning the most possible generic method to jump onto routines triggered by non standard buttons (created by any kind of UI framework).\nIn order to ilustrate my concern I've created a dummy crackme - (in a range 0-10 I'd say level -1 :))\nFor this exercise to be really useful let's assume:\n\nThe \"crackme\" doesn't contain any hardcoded serial you can use\nThe \"crackme\" doesn't contain any activation message you can use to inspect the code around\nBMSG such as WM_PARAM/WM_LBUTTONUP, BT_CLICK won't do it\n\nI've created this little mcve to ilustrate better my real concern, on the real-world case I'm working on I'd like to read the routine triggered by a button from the beginning to end in order to decode the algorithm used.\nSo yeah, the question would be, what are the methods to deal with this particular problem?\n",
    "votes": "1",
    "answers": 2,
    "views": "650",
    "tags": [
        "windows",
        "x64dbg",
        "crackme"
    ],
    "user": "BPL",
    "time": "Aug 27, 2018 at 2:26",
    "comments": [
        {
            "user": "user22970",
            "text": "I've also failed to break on buttons multiple times. a small workaround I usually take is breaking on GetDlgItemText and GetWindowText. It usually breaks when they read the input to verify it's content.\n",
            "time": null
        },
        {
            "user": "user22970",
            "text": "I remember doing something like that in olly. i manully added a conditional breakpoint of \"argument is not the one i'm looking for\" (something like [esp+4] != ADDR). that's a lot of manual work so i'd also like to know if someone has a better idea\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "open crackme in windbg set a bp on GetWindowTextW and run enter some fake \ndata and hot register button  on break go up to the next frame which called the function\n<pre><code>:\\>cdb crackme1.exe\n\nMicrosoft (R) Windows Debugger Version 10.0.16299.15 X86\n0:000> bp USER32!GetWindowTextW\n0:000> g\n\n\nBreakpoint 0 hit\n*** WARNING: Unable to verify timestamp for D:\\crackme1.exe\n*** ERROR: Module load completed but symbols could not be loaded for D:\\crackme1.exe\n\nUSER32!GetWindowTextW:\n772db8c5 6a08            push    8\n0:000> dd esp l4\n015ef760  005312bf 000603a8 000bb324 0000000c\n0:000> dc bb324 l8\n000bb324  00650052 00690067 00740073 00720065  R.e.g.i.s.t.e.r.\n000bb334  00690000 00000074 00000000 abababab  ..i.t...........\n\n0:000> gu\neax=0000000b ebx=00118988 ecx=772db928 edx=00000030 esi=015efa4c edi=015efa5c\neip=005312bf esp=015ef770 ebp=015ef7b0 iopl=0         nv up ei pl zr na pe nc\ncs=001b  ss=0023  ds=0023  es=0023  fs=003b  gs=0000             efl=00000246\ncrackme1+0x1312bf: <<<<<<<<<<<<<<<<<<\n005312bf 8945f4          mov     dword ptr [ebp-0Ch],eax ss:0023:015ef7a4=0000000b\n0:000> dc bb324 l8\n000bb324  00610079 006b006b 00200075 00610062  y.a.k.k.u. .b.a.\n000bb334  006b006b 00000075 00000000 abababab  k.k.u...........\n</code></pre>\n",
            "votes": "1",
            "user": "blabb",
            "time": "Aug 27, 2018 at 20:16",
            "is_accepted": false,
            "comments": [
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">it is not some kind of protection any super classed or subclassed routines always behave that way (they are called constantly for every message that is pumped in so your debugger breaks you can always add multiple conditions to breaks</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">use winspy or spy++ to find the window handle and set a condition with message</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">if it is an edit box the system needs to retrieve it with apis try WM_GETTEXT  get deep into system set a break in Translate / Dispatch Message Apis or inside ntdll win32k system services like ntUserOneParam  some where it needs to show up</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">so doesnt like extensded comments in your screen shot all the hwnd have one common WinProc 0x455578  set a break there and filter message in call stack</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "The problem here is not to solve the crackme, but to find the handler of the \"Register\" button. I describe what could be done to find the button handler. There is probably no \"generic\" standard procedure working in all similar cases.\nHowever, although this is a special case, I assumed normal \"generic\" windows message behaviour. In that case I can expect somewhere a <pre><code>WM_LBUTTONX</code></pre> message, X being <pre><code>UP</code></pre> or <pre><code>DOWN</code></pre>, with values <pre><code>0x201</code></pre> or <pre><code>0x202</code></pre>. Thus I searched statically for the value <pre><code>200h</code></pre> in Ida, this being the start  of the \"Mouse group\" in the Windows <pre><code>WM_</code></pre> messages set. \nThere are a number of locations found where a compare is made with <pre><code>0x200</code></pre>. On these I set a breakpoint. Two of these are hit on mouseclicks, and one of them investigates explicitely <pre><code>0x201 (WM_LBUTTONDOWN)</code></pre> and <pre><code>0x202 (WM_LBUTTONUP)</code></pre>:\n\nIf you step futher down the <pre><code>WM_LBUTTONUP</code></pre> path you come directly to the following location, with a call to <pre><code>f_someMsgHandler</code></pre> (as I called it):\n\nThis function is called on several occasions, but the one corresponding to the mouse event is easily found, e.g. by setting a selective breakpoint. In this function, the following location leads directly to the handler of <pre><code>WM_LBUTTONUP</code></pre> of the \"Register\" button, being located at address <pre><code>0x4fead0</code></pre> (that address unfortunately hidden in the tooltip):\n\nTo solve the crackme, it would possibly be easier to look for something like \"GetWindowText\".\nThis shows, that in contrast to the OP's remark, it is very well possible to follow the trace of the standard windows mouse messages in order to find the proper handler.\n",
            "votes": "1",
            "user": "josh",
            "time": "Aug 27, 2018 at 23:18",
            "is_accepted": false,
            "comments": []
        }
    ]
}