{
    "title": "How are images found inside DLLs accessed? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/19189/how-are-images-found-inside-dlls-accessed",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 6 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nSometimes a program displays images that don't exist as jpegs or bmps that come with the program so they have to be residing inside the exe itself or inside a DLL that comes with the program. So My question is, how does the program access the image in the DLL in assembly and in what format is the image typically stored there?\nI also have a question about text that the program displays but the text is nowhere to be seen either in the exe or dll, so where is that text stored or is it possibly encrypted?\nFor example the \"made with Unity\" splash screen in unity.\n",
    "votes": "0",
    "answers": 2,
    "views": "199",
    "tags": [
        "windows",
        "dll",
        "pe-resources"
    ],
    "user": "Robert Tattorn",
    "time": "6 years ago",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "it's too broad to be answered. Anyone can come up with their own encoding of both images and text and just decode them on the fly in memory and then display. Provide some specifics (maybe an example of such an app) then we can give you the details.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "Welcome to RE.SE. I agree with Paweł that the question is too broad as it stands (which means it will likely get closed). Are you talking about the PE resource section or what is the question about specifically? There's a myriad of ways such data could be stored, including obfuscated inside or outside the actual PE image.\n",
            "time": null
        },
        {
            "user": "Robert Tattorn",
            "text": "Yes the resources inside a PE / exe.  I want to know how to find the image data and its location inside the executable even if it is encrypted. Can I use a program such as ollydbg to back trace the image from it being displayed on screen to the decryption process to memory accessing it ?\n",
            "time": null
        },
        {
            "user": "Robert Tattorn",
            "text": "It is given above, there are many DLLs and It is unknown in which of them the image resides, but I'm thinking whether I can access and edit encrypted resources with 'resource hacker' or other similar program. If not, then can I at least find where they reside inside the exe/dll ?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "First find the DLL or EXE file that you want to access for that resource. THe main goal is to create a handle for that resource/image file, as everything in Windows has to accessed by an object/handle.\nProcedure\n\nGet a handle of that DLL/EXE file with <pre><code>LoadLibrary()</code></pre>:\n\n<pre><code>HMODULE hModule = LoadLibrary(\"FileName.dll\");\n</code></pre>\n\nDetermine the location of that resource with <pre><code>FindResource()</code></pre>:\n\n<pre><code>HRSRC hResInfo = FindResource(hModule, ResourceName, RT_ICON);\n</code></pre>\n\nRetrieves a handle of the resource in memory with <pre><code>LoadResource()</code></pre>:\n\n<pre><code>HGLOBAL hResData = LoadResource(hModule, hResInfo);\n</code></pre>\n\nRetrieves a pointer of the resource in memory with <pre><code>LockResource()</code></pre>:\n\n<pre><code>HANDLE lpBuffer = LockResource(hResData);\n</code></pre>\n\nRetrieves the size, in bytes, of the resource with <pre><code>SizeofResource()</code></pre>:\n\n<pre><code>DWORD dwSize = SizeofResource(hModule, hResInfo);\n</code></pre>\n\nOpen a handle of that resource with <pre><code>CreateFile()</code></pre>:\n\n<pre><code>HANDLE hFile = CreateFile(FileName, GENERIC_ALL, 0, 0, CREATE_ALWAYS, FILE_ATTRIBUTE_NORMAL, 0);\n</code></pre>\nChange <pre><code>RT_ICON</code></pre> flags with the Resource Type that you want to access. Now use the <pre><code>hFile</code></pre> handle with <pre><code>WriteFile()</code></pre> to make a file or <pre><code>ReadFile()</code></pre> to read that file.\nExample\nHere is an example of C code to extract the first icon from <pre><code>shell32.dll</code></pre> and save it as <pre><code>image.png</code></pre> file:\n<pre><code>#include <Windows.h>\n\nBOOL ExtractResource(PSTR ResName, PSTR FileName) {\n    HMODULE hModule = LoadLibrary(\"shell32.dll\");\n    HRSRC hResInfo = FindResource(hModule, ResName, RT_ICON);\n    HGLOBAL hResData = LoadResource(hModule, hResInfo);\n    HANDLE lpBuffer = LockResource(hResData);\n    DWORD dwSize = SizeofResource(hModule, hResInfo);\n    HANDLE hFile = CreateFile(FileName, GENERIC_ALL, 0, 0, CREATE_ALWAYS, FILE_ATTRIBUTE_NORMAL, 0);\n    BOOL result = WriteFile(hFile, lpBuffer, dwSize, 0, 0);\n    return result;\n}\n\nint main() {\n    ExtractResource(\"#1\", \"image.png\");\n}\n</code></pre>\n",
            "votes": "0",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "As the question is indeed very broad there isn't much we can tell. However, PE resources are often used to cary images and icons inside executable files. They are then loaded using APIs like <pre><code>LoadResource</code></pre> and <pre><code>LoadImage</code></pre>. You can read about resources, their type and formats over on MSDN.\nAs a side note, images can also be stored as files in other formats, other extensions, other encodings and even compressed or encrypted. So the fact you don't see a <pre><code>.bmp</code></pre> file does not necessarily mean there are no image resource files alongside the executable.\n",
            "votes": "1",
            "user": "NirIzr",
            "time": "Aug 29, 2018 at 19:28",
            "is_accepted": false,
            "comments": []
        }
    ]
}