{
    "title": "Understand hardware breakPoint option in ida",
    "link": "https://reverseengineering.stackexchange.com/questions/19256/understand-hardware-breakpoint-option-in-ida",
    "content": "When I set a hardware breakpoint I see the following dialog:\n\nI understand that Read/Write is meant to break into the debugger when the address that I choose for the breakpoint is read or written.\nI guess that the Break (in the Actions tab) means to break whenever the read/write happens.\nBut I don't understand what is the other options in the Actions tab mean (Trace, Refresh debugger memory, ...).\nCould you please explain these additional options?!\n",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "hardware",
        "breakpoint"
    ],
    "user": "Lolo9876",
    "time": "Sep 4, 2018 at 20:09",
    "comments": [],
    "answers_data": [
        {
            "content": "The options are explained in the help but I guess it could be a little laconic.\nThe actions in Actions group are performed whenever the breakpoint is triggered (also expressed as hit or fired), and the condition (if specified) is satisfied. The actions explained:\n\nBreak: Suspend the debugged application (default action). You might want to turn it off if you peform some work in the condition script and do not actually need to suspend the app (but a better approach would be to return 0 from the condition expression), or if you only need one of the other actions.\nTrace: Adds a new entry to the trace log\nRefresh debugger memory:\nBy default IDA does not refresh the memory config before evaluating\n    a breakpoint condition. This option enables the refresh.\n    To refresh it [manually] call <pre><code>refresh_debugger_memory()</code></pre>\nEnable tracing:\nEnable tracing when the breakpoint hits. This is different from the trace action (where only a new entry is added to the trace log).\nDisable tracing:\nDisable tracing when the breakpoint fires.\nTracing type:\nInstruction, Function and Basic block level tracing types can be selected for breakpoints if enable or disable tracing action has been selected.\n",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Sep 5, 2018 at 12:30",
            "is_accepted": false,
            "comments": []
        }
    ]
}