{
    "title": "Joysmade USB/WiFi microscope",
    "link": "https://reverseengineering.stackexchange.com/questions/19445/joysmade-usb-wifi-microscope",
    "content": "Short intro: I am building an electronics workbench, and I needed a microscope. This Joysmade USB/WiFi microscope was $45, and it would work with exception to the below issues.\nMy \"dumb\" TV was set above the workbench so that I could use it as the display for a microscope. The Joysmade USB/WiFi microscope has an app for Android and iOS as well as one for Windows. I don't have room for a real computer, so I have a Raspberry Pi Zero W hooked into the TV. I finally got the USB portion to work with Raspbian, but the speed is about 9 FPS.\nI have decompiled the Android APK, but might be too inept to understand how to trace through to determine how it is working. There are a few ARM binary libraries in there, one I am specifically interested in, but I can't find a decent tool to decompile that.\nI have used Wireshark to capture some UDP traffic, and I can't determine what to make of that one, either. This is probably some ineptitude here as well.\nI know that the WiFi module is an SSV7241 based on the link within the WiFi status page on the microscope itself, but can't figure out how to connect to the microscope using a regular media player like VLC. This is the ultimate goal, as Raspbian has VLC and the goal is to have it displayed wirelessly to the \"dumb\" TV through the Raspberry Pi. Also of note is that there is a TCP port open on 8081. I can't really figure out what to do to probe that port any further, though.\nThis thing can't be taken apart without breaking the casing. I've tried. Not much more can be figured out about the circuitry without sacrificing the unit.\nCan anyone give me a bit more of a shove in the right direction or offer up some guidance in getting this thing to bend to my will? I'm too cheap and cramped for space to get a real microscope.\nOnce again, I am trying to figure out how to connect to the WiFi stream on the microscope through VLC, MPlayer, or some other video player on the Raspberry Pi so that I can view it in HD glory on a 46\" television hanging above my bench. I think this will take some decoding of the UDP stream, but I'm not experienced enough to do this, and can't find a lot of help through a Google search.\n",
    "votes": "2",
    "answers": 0,
    "views": "263",
    "tags": [
        "android",
        "wireshark"
    ],
    "user": "indymaynard",
    "time": "Sep 27, 2018 at 17:39",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "Hi and welcome. The question is somewhat vague as-is. What exactly are you trying to achieve? Can you edit the question to make the actual problem clearer, and specify what parts you need help with?\n",
            "time": null
        },
        {
            "user": "indymaynard",
            "text": "I tried to clarify the purpose, but I basically just restated from a previous paragraph. Thanks for responding, and please let me know if the goal is still unclear.\n",
            "time": null
        }
    ],
    "answers_data": []
}