{
    "title": "Inversion of input parameters in ASM",
    "link": "https://reverseengineering.stackexchange.com/questions/19573/inversion-of-input-parameters-in-asm",
    "content": "the code is:\n<pre><code>.global asm0\nasm0:\n    push    ebp\n    mov ebp,esp\n    mov eax,DWORD PTR [ebp+0x8]\n    mov ebx,DWORD PTR [ebp+0xc]\n    mov eax,ebx\n    mov esp,ebp\n    pop ebp\n</code></pre>\nThe entry is: asm0(0x2a,0x4f)\nThe output is: 0x4f2a\nWhy is the input parameters reversed?\n",
    "votes": "2",
    "answers": 1,
    "views": "242",
    "tags": [
        "nasm",
        "assembly"
    ],
    "user": "Ricardo Prieto",
    "time": "Oct 8, 2018 at 18:11",
    "comments": [],
    "answers_data": [
        {
            "content": "Calling Conventions:\nYou may be referring to calling conventions and order of parameters being pushed. If so, here is an answer addressing as such. You can read more about calling conventions in general here.\nEndianness:\nYou may also be interested in reading about endianness from the NASM documentation:\n\n3.4.3 Character Constants\nA character constant consists of a string up to eight bytes long, used\n  in an expression context. It is treated as if it was an integer.\nA character constant with more than one byte will be arranged with\n  little-endian order in mind: if you code\n<pre><code>mov eax,'abcd'\n</code></pre>\nthen the constant generated is not 0x61626364, but 0x64636261, so that if you were then to store the value into memory,\n  it would read abcd rather than dcba. This is also the sense of\n  character constants understood by the Pentium's CPUID instruction.\n\nSource: https://www.nasm.us/doc/nasmdoc3.html\nMore research on your behalf to better understand this can be done by reading about the topic of endianness. It's confusing when you first run into it, but there are many charts like this one to help demonstrate it:\n\nImage source: https://agilescientific.com/blog/2017/3/31/little-endian-is-legal\nFinally, there's an excellent video from OpenSecurityTraining that does a great job of explaining endianness and order of parameters/arguments with calling conventions. Click here to view it.\n",
            "votes": "2",
            "user": "dsasmblr",
            "time": "Oct 8, 2018 at 18:43",
            "is_accepted": true,
            "comments": []
        }
    ]
}