{
    "title": "Has there been any success in using deep learning for reverse engineering?",
    "link": "https://reverseengineering.stackexchange.com/questions/19576/has-there-been-any-success-in-using-deep-learning-for-reverse-engineering",
    "content": "So has there been any success in using deep learning for doing reverse engineering?\ni couldn't find anything useful other than some theoretical papers, so was there any talk about this in recent security conferences, or actual success of doing so?\n",
    "votes": "2",
    "answers": 1,
    "views": "304",
    "tags": [
        "memory",
        "patch-reversing",
        "software-security"
    ],
    "user": "John P",
    "time": "Oct 8, 2018 at 19:21",
    "comments": [
        {
            "user": "pudi",
            "text": "Interesting topic. What do you want exactly to reach with deep learning? The disassembly process? Or classification of malware? Recognize obfuscation?\n",
            "time": null
        },
        {
            "user": "julian",
            "text": "Are you focused just on deep learning specifically or machine learning methods in RE in general?\n",
            "time": null
        },
        {
            "user": "John P",
            "text": "@pudi yes, building a \"program\" with the help of   deep learning that can disassemble any given program with a high accuracy rate, has there been any success in this field?\n",
            "time": null
        },
        {
            "user": "John P",
            "text": "@SYS_V deep learning would be preferable\n",
            "time": null
        },
        {
            "user": "perror",
            "text": "Possible duplicate of Can AI be used to write better decompilers/disassemblers?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I don't know about deep learning, but if you are looking for general results on using machine learning for reverse engineering, there was a paper called \"Evolving Exact Decompilation\" published at the Workshop on Binary Analysis Research 2018, where the researchers claimed to have learned/evolved the ability to decompile a C program. See the paper here.\n",
            "votes": "3",
            "user": "dingo_kinznerhook",
            "time": "Oct 11, 2018 at 20:33",
            "is_accepted": true,
            "comments": []
        }
    ]
}