{
    "title": "How to search for Opcode 0xFF25 in IDA Pro?",
    "link": "https://reverseengineering.stackexchange.com/questions/19649/how-to-search-for-opcode-0xff25-in-ida-pro",
    "content": "I want to search for opcodes in IDA Pro like the following:\n<pre><code>0xFF25\n</code></pre>\nHow can I do that?\n",
    "votes": "2",
    "answers": 3,
    "views": "7k",
    "tags": [
        "ida",
        "idapython"
    ],
    "user": "Michael",
    "time": "Oct 17, 2018 at 10:05",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "You're tagging this with IDAPython, so are you specifically looking for a scripted solution?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It depends on what do you exactly mean by opcode (not in all possible targets it starts with the start of the instruction, and it can be placed weirdly enough in it). Sometimes, however, simple binary searching (Search-->Sequence of bytes, or Alt B) is enough, and if you check \"Find all occurrences\" in the search  dialog IDA will open a window with, correspondingly, all occurrences. You also can try text search with the command mnemonics, such as searching for \"<pre><code>ADD</code></pre>\" in the main IDA window in same manner.\nIf this is not enough, you'll probably need to write IDC or IDAPython script that does one of the following things:\n\nPasses over all the instructions (for example with <pre><code>idautils.Heads()</code></pre> IDAPython function) and outputs everything where the command mnemonics fits to what you need (<pre><code>idc.print_insn_mnem</code></pre> DAPython function)\nPasses over all the instructions (for example with <pre><code>idautils.Heads()</code></pre> IDAPython function), extracts the opcode from the instruction data (<pre><code>idc.Byte(address)</code></pre> IDAPython function ) in the mode and order you need and checks if it fits.\n",
            "votes": "6",
            "user": "w s",
            "time": "Oct 17, 2018 at 10:49",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "ida_search.find_binary\nI suppose you're going to search for JMP instructions like:\n<pre><code>jmp     ds:__imp__DebugBreak@0\n</code></pre>\nThen ubinstr argument is a string like \"FF 25\", otherwise if you search for bytes 25 FF - specify \"FF25\". Space is needed to deal with byte order in the search string.\n",
            "votes": "2",
            "user": "Anton Kukoba",
            "time": "Oct 17, 2018 at 12:48",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I think the best way for that is under MENU:\nSearch > Sequence of bytes\n=== BE CAUTION: ==\nAlthough \"Search > Text\" option seems works, according Anton Kukoba, it seems not TRUE for every instruction.\nWhen I analysed an ELF file, searching for instruction \"endbr64\" , I figure out that ALL patterns for that instruction inside \"PLT\" section were missed.\nOnly when I used \"Search > Sequence of bytes\", gave it opcodes \"f3 0f 1e fa\" it worked.\n",
            "votes": "0",
            "user": "becauro",
            "time": "Sep 2, 2024 at 4:43",
            "is_accepted": false,
            "comments": []
        }
    ]
}