{
    "title": "gdb for main and input parameters",
    "link": "https://reverseengineering.stackexchange.com/questions/19655/gdb-for-main-and-input-parameters",
    "content": "I have one elf 32 application and not stripped, I use gdb info functions and it list only the memory address and function name, but there is no function name with \"main\", so any way to find the main function of the program?\nthe other problem is when using info functions, it didn't list of the input parameter of each function, if i want to list all input parameter of each function, which command should be use?\n",
    "votes": "0",
    "answers": 1,
    "views": "712",
    "tags": [
        "gdb"
    ],
    "user": "Jolin Wong",
    "time": "Oct 18, 2018 at 1:59",
    "comments": [
        {
            "user": "perror",
            "text": "Give, at least, the architecture you target. Saying '32-bit' is not enough!\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "The memory address of <pre><code>main()</code></pre> is a parameter of <pre><code>__libc_start_main</code></pre>:\n<pre><code>int __libc_start_main(int *(main) (int, char * *, char * *),    <-----pointer to main\n                      int argc, \n                      char * * ubp_av, \n                      void (*init) (void), \n                      void (*fini) (void), \n                      void (*rtld_fini) (void), \n                      void (* stack_end));\n</code></pre>\nThis means we can find the address of <pre><code>main()</code></pre> when <pre><code>__libc_start_main()</code></pre> is called in the <pre><code>_start</code></pre> routine (from <pre><code>crt1.o</code></pre>). \nIn x86 environments, the memory address of <pre><code>main()</code></pre> will be pushed onto the stack prior to calling <pre><code>__libc_start_main()</code></pre>, but the way arguments are passed to functions depend on the calling convention implemented by the compiler, and this can vary across compiler toolchains and CPU architectures (arguments may be passed in registers instead, for example). You did not give any information regarding the CPU family the object code in your ELF binary targets (beyond the fact that the architecture is 32-bit) or the compiler used to generate the binary, or any sample disassembly, so I can't be more specific.\nAs far as I know, information about function parameters is not stored in the symbol table, so there is no command to list them. \nAt runtime, you may use <pre><code>info args</code></pre> and <pre><code>info locals</code></pre> to inspect the values of function arguments and local variables if your binary has been compiled with the <pre><code>-g</code></pre> flag.\n",
            "votes": "1",
            "user": "julian",
            "time": "Oct 18, 2018 at 3:23",
            "is_accepted": false,
            "comments": []
        }
    ]
}