{
    "title": "Multiple decompilation failure with ntoskrnl",
    "link": "https://reverseengineering.stackexchange.com/questions/19767/multiple-decompilation-failure-with-ntoskrnl",
    "content": "IDA v7 shows decompilation failure in 64bit <pre><code>ntoskrnl.exe</code></pre> file of Windows 10 build 18262. Here is an example of that:\n\nI've loaded all the needed type libraries, PDB file, kernel mode header files (wdm.h, ntddk.h, ntdef.h etc.). But it doesn't change anything with that errors. The assembly is simple to translate. I found the error may be related to <pre><code>END OF FUNCTION CHUNK FOR NtQueryInformationProcess</code></pre> comment. Here is the example assembly in <pre><code>ntoskrnl.exe</code></pre> PAGE segment where IDA shows that warning:\n<pre><code>lea     rdx, cs:140000000h\nmov     eax, ds:(off_1405DF7E4 - 140000000h)[rdx+rbx*4]\nadd     rax, rdx\njmp     rax         ; failed here \n</code></pre>\nWhat can I do to remove this error? If you need any further information I can add that in this question.\n",
    "votes": "0",
    "answers": 1,
    "views": "510",
    "tags": [
        "ida",
        "decompilation"
    ],
    "user": "Biswapriyo",
    "time": "Feb 2, 2019 at 18:03",
    "comments": [
        {
            "user": "MazeGen",
            "text": "Hex-Rays Decompiler is not perfect and bug free. It sometimes fails even on unobfuscated code. Try to use older or newer version of the decompiler.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "As a generic, incomplete answer: switch analysis is a common source of failure in using Hex-Rays (and even IDA). You can fix these errors by manually editing the switch information using <pre><code>Edit->Other->Specify switch idiom</code></pre> with your cursor somewhere near the beginning. However, I can't give you complete instructions on how to do this. My best advice is to search the disassembly listing for the word 'switch' using <pre><code>Alt-T</code></pre>, and use the edit command just mentioned to view the switch information. For each one, copy the information into a text editor, and compare it against the disassembly listing. This will start to give you an idea of what the fields mean. From there, experiment with the failing switch. Does something you learned from the process I just describe seem not to fit well with the information presented for the failing switch? Change it and see what happens.\n",
            "votes": "2",
            "user": "Rolf Rolles",
            "time": "Feb 2, 2019 at 21:39",
            "is_accepted": true,
            "comments": []
        }
    ]
}