{
    "title": "How to use IDA Pro debug Android Application? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/19793/how-to-use-ida-pro-debug-android-application",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 6 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nAny person can give some examples or resources about how to use IDA Pro debug Android Application?\n",
    "votes": "-1",
    "answers": 1,
    "views": "11k",
    "tags": [
        "android"
    ],
    "user": "shizhen",
    "time": "6 years ago",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE! Please edit your question to include what you want to know specifically. As it stands your question is too broad. Once you edited your question you can then simply ask for it to be reopened (both are links right below your post).\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "(Although IDA lets you reverse <pre><code>.class</code></pre> files, there are tools that convert the Java byte code back to source code and are preferred for this)\nIt's pretty common nowadays to compile libraries and use NDK to develop a part of your app in C/C++.\nThose parts will be compiled to an <pre><code>.so</code></pre> files, which can be invoked using the java code.\nYou can reverse those files, they should even contain some symbols in a form of <pre><code>package_classname_method</code></pre> to know who can invoke them.\nOther than that, I don't think ida can offer something to reverse android apps.\nThe point is - Ida is not a general app reversing tool, it has a specific use.\nThat being said, here are examples: \n\nIDA Dalvik debugger: tips and tricks \nReverse-Engineering-and-Tampering \nRemote debugging using IDA Pro\n",
            "votes": "6",
            "user": "0xC0000022L",
            "time": "Nov 2, 2018 at 12:22",
            "is_accepted": true,
            "comments": []
        }
    ]
}