{
    "title": "Searching for a sequence of bytes in IDA",
    "link": "https://reverseengineering.stackexchange.com/questions/19807/searching-for-a-sequence-of-bytes-in-ida",
    "content": "Using an hardware breakpoint, I found with Ollydbg that a crackme was checking for the isDebuggerPresent flag. I'd like to find this part of the code using IDA now.\nI first looked in the import table, but couldn't find the function in the list and came to the conclusion that the crackme was doing it directly instead of using kernel32.dll. Then I tried to use the \"sequence of bytes\" search in IDA, using the bytes in OllyDbg's hex dump view corresponding to <pre><code>MOV EAX,DWORD PTR FS:[30]</code></pre> (64 A1 30 00 00 00), no chance here.\nI must be missing something very obvious here, this is the most basic anti-debugging technique so there must be a simple way to locate it using IDA, right?\nEdit: Screenshot in Ollydbg\n\nEdit: Where the check actually happens\n",
    "votes": "0",
    "answers": 1,
    "views": "987",
    "tags": [
        "ida",
        "anti-debugging"
    ],
    "user": "Stud",
    "time": "Nov 3, 2018 at 10:06",
    "comments": [
        {
            "user": "Stud",
            "text": "Yes it does. But my goal is to be able to find it using IDA too. The address where the code is in Ollydbg is not in the range of the code shown in IDA.\n",
            "time": null
        },
        {
            "user": "Stud",
            "text": "Sorry I though I uploaded a wrong screenshot. But this is actually where it breaks now.\n",
            "time": null
        },
        {
            "user": "joxeankoret",
            "text": "Can you share the binary? It's very hard to help only with that information.\n",
            "time": null
        },
        {
            "user": "Stud",
            "text": "Sure, here's the link to the crackme: crackmes.one/crackme/5b502da833c5d41c0b8ae514\n",
            "time": null
        },
        {
            "user": "user202729",
            "text": "@Biswapriyo Read crackmes faq...\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Of course you can't find it in the crackme, because the code isn't there. It's easy to determine which file the code belongs to:\n\nIt's <pre><code>KERNELBA</code></pre>, so it probably comes from a system dll (<pre><code>KERNELBASE.dll</code></pre>?). We expect to find code in module named <pre><code>crackme4</code></pre> or similar.\nLooking at the stack, it's easy to find the address:\n\nThat one is not prefixed with <pre><code><system_module_name>.</code></pre>, so I guess it's code from the crackme.\nIn case the stack is corrupted, it's possible to use Alt+F9 (execute until user code).\n\nAbout finding the corresponding address in IDA, it's described at this question:\n\nIf only the base is changed, but offsets are constant [...], you can just rebase the program in IDA. You can do so by edit->segments->Rebase program ... menu. Specifying the same starting base in IDA as is in Olly should help.\n\nand\n\n<pre><code>Base_Address_in_OllyDbg</code></pre>: The base address of the target module in OllyDbg. You can find this value by pressing Alt-E in OllyDbg (or by going to View --> Executable modules in OllyDbg's menu bar). Find your target module in the Executable modules window; the leftmost field (Base) is the <pre><code>Base_Address_in_OllyDbg</code></pre>.\n",
            "votes": "3",
            "user": "user202729",
            "time": "Nov 4, 2018 at 13:57",
            "is_accepted": true,
            "comments": []
        }
    ]
}