{
    "title": "Manually unpacking upx",
    "link": "https://reverseengineering.stackexchange.com/questions/19816/manually-unpacking-upx",
    "content": "As a first unpacking exercise, I decided to try to unpack the famous UPX (without using upx -d of course). I chose an executable I had somewhere, built from C++ code in debug mode. I packed it using the last version of upx <pre><code>upx algorithm.exe</code></pre> and tested it.\nI set a hardware breakpoint after PUSHAD and after I hit it, I dumped the process with OllydumpEx. Finally I used Scylla to rebuild the IAT.\nThere was no error during the whole process but my fixed dump terminate with a Segmentation Fault. What would you do to investigate what went wrong?\nThis picture shows the disassembly windows where I paused to dump, and the options used during the process.\n\nEdit:\nI just checked in the process memory and the IAT VA and size found b Scylla seem to be correct.\n",
    "votes": "4",
    "answers": 2,
    "views": "4k",
    "tags": [
        "unpacking",
        "dumping",
        "upx"
    ],
    "user": "Stud",
    "time": "Nov 4, 2018 at 17:28",
    "comments": [],
    "answers_data": [
        {
            "content": "You said that the base address changes so I assume your system and target executable have ASLR enabled. This sometimes causes problems when unpacking due to relocations not being fixed.\nEasiest solution is to disable ASLR and then unpack. If you want to disable ASLR on the packed executable, edit the <pre><code>IMAGE_DLLCHARACTERISTICS_DYNAMIC_BASE</code></pre> flag of the DLL Characteristics field using a PE editor of your choice. Another option is to disable ASLR on the system which is not recommended.\n",
            "votes": "8",
            "user": "0xC0000022L",
            "time": "Nov 6, 2018 at 22:37",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Stud",
                    "text": "<span class=\"comment-copy\">Disabling ASLR with a PE editor allowed to produce a working unpacked executable. Thanks a lot!</span>",
                    "time": null
                },
                {
                    "user": "Stud",
                    "text": "<span class=\"comment-copy\">Could you elaborate on why it affects relocation in this situation?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Just set a breakpoint in 0x00ef674c.\n\nPress F9. \nWhen it hit the breakpoint, press F7 to go the original Entrypoint of the unpacked file.\nJust make sure that the EIP is the OEP.\n",
            "votes": "3",
            "user": "ismael_akez",
            "time": "Nov 5, 2018 at 14:39",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Stud",
                    "text": "<span class=\"comment-copy\">I tried to follow the jump and set 00A8114A as the entry point as you suggested, it doesn't change anything. By the way, the jump leads to a jump table. It doesn't look like an entry point to me. Here is a screenshot: <a href=\"https://framapic.org/DlaGeM6XRrbL/zJbd2cEtYqr9.JPG\" rel=\"nofollow noreferrer\">framapic.org/DlaGeM6XRrbL/zJbd2cEtYqr9.JPG</a></span>",
                    "time": null
                },
                {
                    "user": "ismael_akez",
                    "text": "<span class=\"comment-copy\">@Stud The Original Entrypoint must be 0x00ed114a. Please see the screenshot. This is an example of packed calc.exe and original calc.exe. <a href=\"https://framapic.org/puYO0dYjWhiO/dZJfxKYwl0TF.png\" rel=\"nofollow noreferrer\">framapic.org/puYO0dYjWhiO/dZJfxKYwl0TF.png</a></span>",
                    "time": null
                },
                {
                    "user": "Stud",
                    "text": "<span class=\"comment-copy\">The base address must have changed between my tests, but I assure you that the jump on your screenshot leads to the screenshot in my first comment. According to all tutorials and to you I do this correctly, I still don't understand why it doesn't work...</span>",
                    "time": null
                }
            ]
        }
    ]
}