{
    "title": "Debugging a process running in a Virtual Machine with Radare2?",
    "link": "https://reverseengineering.stackexchange.com/questions/19827/debugging-a-process-running-in-a-virtual-machine-with-radare2",
    "content": "Is there anyway to debug a process running on a Virtual Machine (guest) with Radare2 from the host? I'm currently using VirtualBox. It provides a built in debugger. I'm not sure if it's possible for radare2 to integrate with it.\n",
    "votes": "4",
    "answers": 3,
    "views": "921",
    "tags": [
        "radare2",
        "virtual-machines"
    ],
    "user": "Evan Carroll",
    "time": "Nov 5, 2018 at 19:38",
    "comments": [
        {
            "user": "pudi",
            "text": "I'm not sure what your goal is, do you want to debug the process running inside the VM on your host system?\n",
            "time": null
        },
        {
            "user": "Evan Carroll",
            "text": "@pudi yes, clarified.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "i'm the developer of r2vmi, and found your topic by googling my own project.\nI have been working on an improved version by reimplementing a GDB stub:\nhttps://github.com/Wenzel/pyvmidbg\nThe README contains a demo if you want a quick look.\nI'm able to debug a Windows XP VMs, both kernel and userland, given you have the right symbols, with radare2.\nI presented the project at Insomni'Hack conference last week, if you want to take a look at the slides:\nhttps://drive.google.com/file/d/1ZMUszfwWDOljdDfPOJgkEfSabNy0UAJR/view\nHope this helps !\n",
            "votes": "4",
            "user": "Wenzel",
            "time": "Mar 28, 2019 at 20:02",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Radare is able to connect to gdb remote sessions. So if you use something like qemu for your virtualization you would be able to connect to this. The problem will be to find the desired process inside the whole memory. At first you need to understand how your guest operating system handles processes inside it's kernel and then you need to find the kernel inside this memory region.\nThere are two interesting projects about this topic: zdbg and r2vmi\n",
            "votes": "1",
            "user": "defragger",
            "time": "Nov 6, 2018 at 6:27",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Also make sure that to accurately reverse any sort of WindowsVM you make sure you point <pre><code>gdb</code></pre> to the proper <pre><code>.pdb</code></pre> so it can read the symbols for better debugging.\n",
            "votes": "0",
            "user": "user847763",
            "time": "Nov 7, 2018 at 0:35",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Evan Carroll",
                    "text": "<span class=\"comment-copy\">In this case the VM is a Linux live cd..</span>",
                    "time": null
                }
            ]
        }
    ]
}