{
    "title": "What different UPX formats exist and how do they differ?",
    "link": "https://reverseengineering.stackexchange.com/questions/198/what-different-upx-formats-exist-and-how-do-they-differ",
    "content": "Recently I asked a  question about detecting UPX compression. 0xC0000022L wanted to know if it was plain UPX. However until that point I only was aware of plain UPX. So my question is:\n\nWhat versions/modifications of UPX exist?\nHow do they differ? What features do they have?\n",
    "votes": "15",
    "answers": 3,
    "views": "2k",
    "tags": [
        "upx"
    ],
    "user": "qbi",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [],
    "answers_data": [
        {
            "content": "I will ignore that there's multiple compression algorithms in UPX and that there's been multiple versions of UPX. \nGenerally when people ask if it's plain or vanilla UPX it's because malware and other software likes to take UPX and modify it slightly so that it can't be unpacked with the standard UPX executable and so that anti viruses will have a harder time unpacking it. It's not very effective at counteracting reverse engineering.\n",
            "votes": "12",
            "user": "Peter Andersson",
            "time": "Mar 23, 2013 at 20:29",
            "is_accepted": true,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Spot on. You can't read minds, can you? ;)</span>",
                    "time": null
                },
                {
                    "user": "Lizz",
                    "text": "<span class=\"comment-copy\">Can you include any example(s)/site(s) of how it's modified? Such info might further build a strong answer. :)</span>",
                    "time": null
                },
                {
                    "user": "dyasta",
                    "text": "<span class=\"comment-copy\">And if a derivation of UPX is used as a protection mechanism, you can bet that it will yield false positives until you are blue in the face. UPX has been effectively classified as a malware tool by most security companies, a fate common to open source libraries and executable tools.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "First, let's see UPX structure.\nUPX Structure\n\nPrologue\n\nCMP / JNZ for DLLs parameter checks\nPushad, set registers\noptional NOP alignment\n\nDecompression algorithm\n\nwhether it's NRV or LZMA\n\nCall/Jumps restoring\n\nUPX transform relative calls and jumps into absolute ones, to improve compression. \n\nImports\n\nload libraries, resolve APIs\n\nReset section flags\nEpilogue\n\nclean stack\njump to the original EntryPoint\n\n\nFor more details, here is a commented IDA (free version) IDB of a UPX-ed PE.\nmodified UPX variants\nSimple parts like prologue/epilogue are easy to modify, and are consequently often modified:\n\nbasic polymorphism: replacing an instruction with an equivalent\nmoving them around with jumps\n\nComplex parts like decompression, calls restoration, imports loading are usually kept unmodified, so usually, custom code is inserted between them:\n\nan anti-debug\nan extra xor loop (after decompression)\na marker that will be checked further in the unpacked code, so that the file knows it was unpacked.\n\nfaking\nAs the prologue doesn't do much, it's also trivial to copy it to the EntryPoint of a non UPX-packed PE, to fool identifiers and fake UPX packing.\n",
            "votes": "16",
            "user": "0xC0000022L",
            "time": "Apr 17, 2013 at 4:44",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Some tools also rely on the default section names, in case of PE files.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I'm not sure if this is what you're asking, but UPX has multiple ways of compressing a given format. For example, an ELF \n - can be decompressed directly into memory\n - can be decompressed into /tmp and executed from there\nBy default the first option is preferred, but I don't think it's mandatory. See the UPX Manual for details.\n",
            "votes": "5",
            "user": "EfForEffort",
            "time": "Mar 24, 2013 at 0:11",
            "is_accepted": false,
            "comments": []
        }
    ]
}