{
    "title": "Analyzing and deobfuscating complex JS code [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/19980/analyzing-and-deobfuscating-complex-js-code",
    "content": "This question already has answers here:\n                                \n                            \n\n\n\n\nAnalyzing highly obfuscated JavaScript\n\n                                (9 answers)\n                            \n\nClosed 6 years ago.\n\n\n\nI am looking to reverse engineer a very ugly piece of JS found here. \nAs far as I can tell, this script generates and sets some cookies on my browser that identify it on the site. Deobfuscating it seems extremely difficult as it is encrypted by Jscrambler and it is so large that seemingly no site such as https://beautifier.io/ can do anything with it.\nThe goal is to be able to generate these cookies manually and post them to the site so that I do not need a browser to access the site.\nMy questions are: \n1) Is there a way to debug this code in such a s way as to identify which lines generate and set the cookies? I have tried setting breakpoints on cookie set which did not seem to help.\n2) Can this be deobfuscated easily by a JS noobie such as myself and what tools should I be using?\nEDIT: If anyone can get involved I would be willing to compensate.\n",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "debugging",
        "obfuscation",
        "javascript"
    ],
    "user": "Joxrox",
    "time": "6 years ago",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "You could always attempt to instrument one of the open source JS engines (V8 comes to mind) and debug it there ... of course if the JS script in question relies on the DOM being available, you may have to improvise.\n",
            "time": null
        },
        {
            "user": "user202729",
            "text": "The easier way would be to actually use a browser. Even if it's in a script, there are headless browsers.\n",
            "time": null
        },
        {
            "user": "Johann Aydinbas",
            "text": "Are you still interested in this question?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It requires only a huge amount of time, but there is no JavaScript code that cannot be deobfuscated.\nFor the first time here I see a piece of obfuscated js without any clear weakness.\nBut start point after beauty is to find basic var assignment and then accurately replace occurrences of the var with its value\nReiterate\nStep 1\nReplace every <pre><code>;</code></pre> with <pre><code>;\n</code></pre>. To fo it, you must use an editor capable of regexp replacing, like VSCode or Sublime Text (and a lot of others)\nI got one and only one instruction per line\nStep 2\nLook at first assignment\n<pre><code>T8jj.W4C=\"3421\";\n</code></pre>\nI will replace every occurence of <pre><code>T8jj.h6C</code></pre> in the following code with the value <pre><code>\"3063\"</code></pre>. But before, using regex search, I will ensure that there is only ONE occurrency of assignment, otherwise I will do a more delicate replacement.\nIn this case, only one assignment! Good, so use a regexp to replace\n<pre><code>\\bT8jj\\.W4C\\b\n</code></pre>\nwith \n<pre><code>\"3421\"\n</code></pre>\n\nNote !!!! we used word separator and entered the dot as escaped, because otherwiser you could mis-replace ASDAST8jjEW4CSDFSDFD and this will create bugs !\n\nThe first regexp avoid to change eventually future occurrency of new. Do not forget trailing <pre><code>\"</code></pre> because are syntattically important for js. <pre><code>3421</code></pre> is an integer, <pre><code>\"3421\"</code></pre> is a string.\nFor example, at roww 22233 this replaces\n<pre><code>I(g9L.r3y(+T8jj.W4C));\n</code></pre>\nwith\n<pre><code>I(g9L.r3y(+\"3421\"));\n</code></pre>\nSo string or numeric is very different !\n\nYou now think \"I can remove the first line, because there is no more need for it; every referring point has now got the litteral value.\"\n  Wrong ! Some obfuscator use string concatenation and other techs to keep you in a trap, so never remove code ! \n\nOnly 44042 rows remaining ! \nReiterate\n<pre><code>bx8jj.h8C \n</code></pre>\nhas more than one assignment, so must replace with \"3871\" only occurency before the next assignment, there same var receved assigned value of \"1964\"\nSuggestions\n\nUse trailing \\b and replace . with . when searching;\nIf you got only one result or no result at all, do not delete assignment; some point in the obfuscated code could use string concatenation or use unicode chars and evals to read the variable value;\nReplace occurrencies of unicode-only strings with their litteral value; this will speed up code deobfuscation; for example <pre><code>'\\x6e\\x65\\x73\\x74\\x65\\x64'</code></pre> is <pre><code>'nested'</code></pre>;\n",
            "votes": "0",
            "user": "realtebo",
            "time": "Dec 1, 2018 at 12:08",
            "is_accepted": true,
            "comments": []
        }
    ]
}