{
    "title": "How can one extract resources from a New Executable?",
    "link": "https://reverseengineering.stackexchange.com/questions/2000/how-can-one-extract-resources-from-a-new-executable",
    "content": "I'm trying to extract menus and other stuff from a New Executable (NE), i.e. the ones from Windows' 16-bit times. The tools I find (e. g. ResourceTuner) work for PEs only.\nAny idea for tools to facilitate the resource extraction? Could be several steps too, e.g.  one program extracting the raw resources, one displaying them in a proper form.\n",
    "votes": "9",
    "answers": 2,
    "views": "2k",
    "tags": [
        "tools",
        "ne"
    ],
    "user": "heinrich5991",
    "time": "May 4, 2013 at 1:33",
    "comments": [
        {
            "user": "heinrich5991",
            "text": "meta-question: why did it tell me my question was subjective, based just on the title? request: could someone retag \"pe-resources\" to \"resources\" or \"ne-resources\", because I don't have the reputation to do so (need 150, just upvote so I can do it myself ;) )\n",
            "time": null
        },
        {
            "user": "Ange",
            "text": "because it started with 'how can you' ?\n",
            "time": null
        },
        {
            "user": "heinrich5991",
            "text": "@Ange how is that subjective?\n",
            "time": null
        },
        {
            "user": "Ange",
            "text": "I don't know, but their subjectivity detector definitely triggers on 'how can you' ;)\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "@Ange: \"how can you\" and \"how can one\" are near synonymous. No? Fixed up the question a bit. It's great, because it touches a topic not too often found anymore these days.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You should try OpenWatcom's <pre><code>Resource Editor</code></pre>, and also Hiew and HT Editor albeit these 2 won't likely display them in proper form, as they are just NE-supporting hex editors.\nOpenWatcom includes a full toolchain for Win-16 and dos development.\n",
            "votes": "9",
            "user": "Justin Dearing",
            "time": "May 4, 2013 at 1:30",
            "is_accepted": true,
            "comments": [
                {
                    "user": "heinrich5991",
                    "text": "<span class=\"comment-copy\">I took a look at the OpenWatcom, looks very promising. Thanks</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Perhaps a bit more detail would be in order? Especially since you only mention OpenWatcom, not exactly which of the tools to use.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "A great resource for old tools is the SAC server. From a quick search Resource Grabber seems to support NE resources, though the UI is annoying to use.\nAnother options is eXeScope (shareware).\nAlso, long time ago I found somewhere a tool with the name <pre><code>dresplay.exe</code></pre>. I don't have it at hand right now and Google doesn't seem to know about it...\n",
            "votes": "6",
            "user": "Igor Skochinsky",
            "time": "May 3, 2013 at 21:50",
            "is_accepted": false,
            "comments": []
        }
    ]
}