{
    "title": "Sentinel HASP Hardlock - Where is the Secure Storage Located on disk",
    "link": "https://reverseengineering.stackexchange.com/questions/20199/sentinel-hasp-hardlock-where-is-the-secure-storage-located-on-disk",
    "content": "I have a provisional license for a program attached to a specific computer. The license according to hasp resides in the \"secure storage of your pc\" does anyone know where this is? If I reset the pc the license is not detected which makes me think the HASP Hardlock is located in the Windows directory. If I could wipe the  hardlock I could add a new provisional license and repeat this for an infinite 30 day trial.\n",
    "votes": "0",
    "answers": 1,
    "views": "588",
    "tags": [
        "software-security",
        "dongle"
    ],
    "user": "rob-DEV",
    "time": "Dec 26, 2018 at 14:09",
    "comments": [],
    "answers_data": [
        {
            "content": "For my knowledge , HASP has a USB pen with something inside and two different drivers running as a service to accept remote and local request of license verification... And the other one is something I do not recall .\nProbably you could sniff protocol (port 1943 for example) .\nSorry but I had not access to the phisical USB pen \nProbably you can also clone it and mount on a virtual machine, but I hadn't tried.\n",
            "votes": "1",
            "user": "realtebo",
            "time": "Dec 26, 2018 at 15:30",
            "is_accepted": false,
            "comments": [
                {
                    "user": "rob-DEV",
                    "text": "<span class=\"comment-copy\">I can install a provisional license without any dongle, it stores the license somewhere on disk just trying to find out where. I know it communicates through a driver with on disk secure storage, I just want to know how to wipe this.</span>",
                    "time": null
                },
                {
                    "user": "realtebo",
                    "text": "<span class=\"comment-copy\">Another idea is using thinapp. It is very elaborated . You must setup a clean environment, on a VM, launch thin app, launch setup, stop thin app. When you later launch the newly created setup for portable, it creates file on a subdirectory , and do not touches nothing on the machine. You can also see generated file after first run to understand what it creates.</span>",
                    "time": null
                }
            ]
        }
    ]
}