{
    "title": "Issue with debugger - black screen and freeeze after loading game executable",
    "link": "https://reverseengineering.stackexchange.com/questions/20241/issue-with-debugger-black-screen-and-freeeze-after-loading-game-executable",
    "content": "I have issue with debugging. When I try to load game executable to debugger and go to certain place in code, game window shows up but it is black and it looks freezed. I can't even go back to debugger to check what is wrong, I have to force closing of the debugger.\nThis happened while using Ollydbg and x32dbg.\nI'm using Windows 7 64bit. Game is CT Special Forces: Fire for effect.\n",
    "votes": "1",
    "answers": 2,
    "views": "309",
    "tags": [
        "ollydbg",
        "debugging",
        "game-hacking"
    ],
    "user": "westman379",
    "time": "Dec 30, 2018 at 15:47",
    "comments": [],
    "answers_data": [
        {
            "content": "I have found temporary solution to my issue. I have enabled option \"Stay on top\" (CTRL+F5) in x32dbg. This way I can go back to debugger to resume execution.\nIt would be better to also enable window mode in game, but it is not possible in this situation.\n",
            "votes": "1",
            "user": "westman379",
            "time": "Dec 31, 2018 at 11:36",
            "is_accepted": false,
            "comments": [
                {
                    "user": "mrexodia",
                    "text": "<span class=\"comment-copy\">Get a second screen, it will probably help with the window focusing error. You could also hook directx to try to avoid switching to full screen mode. DxWnd is a tool that does that.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "probably anti-debugger, try enabling trace+logging to text file, then start tracing to see the last assembly instructions recorded. Also, if the window of the game appears before the crash, try putting a breakpoint right after ShowWindow/CreateWindow/CreateWindowEx/other window functions, then step to see where it freezes, or start tracing after the breakpoint that shows the window.\n",
            "votes": "0",
            "user": "FabioM",
            "time": "Dec 30, 2018 at 21:33",
            "is_accepted": false,
            "comments": []
        }
    ]
}