{
    "title": "USB 3G Stick changing frequency bands [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/20334/usb-3g-stick-changing-frequency-bands",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 6 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI have 4 different types of USB 3G modems from Europe. They're not operator locked. I'm trying to use them on an American network for 3G connectivity.\nEven though they state \"850, 900, 1800, 1900 MHz\" bands in their specs, and my network supposedly has UMTS on 850 MHz, I can only get a 2G (EDGE) connection and furthermore, they all detect my SIM card as out of network and put me in \"roaming\" mode.\nI've found out that the radios in these things are usually universal but the band limits are only in software. Therefore I was wondering if there would be any way (through undocumented AT commands or firmware flashing) I could get either one of these modems to switch allowed bands and let me get 3G speeds in North America.\nAre there any resources where I can get AT command lists and/or different region firmware for these devices? Or is there anyone that could maybe point me in the right direction?\nThese are the devices I have:\n\nHuawei E3131\nHuawei E353\nZTE MF190\nD-Link DWM-156\n\nI tried flashing different versions of firmware and/or googling AT commands to change bands on some of these, but at the end, the moment I switch mode to 3G I get \"no service\"\nAny help would be greatly appreciated...\n",
    "votes": "1",
    "answers": 0,
    "views": "60",
    "tags": [
        "firmware",
        "usb"
    ],
    "user": "ozg",
    "time": "6 years ago",
    "comments": [],
    "answers_data": []
}