{
    "title": "how should i change an instruction to NOP in IDA?",
    "link": "https://reverseengineering.stackexchange.com/questions/20349/how-should-i-change-an-instruction-to-nop-in-ida",
    "content": "I am new with IDA assembler and i used to work with hopper app.\nthe problem is i can't change instruction in IDA from something like CBNZ to NOP.\nis there any button to do this? i can't find anything on the internet and I have been searching for it all day.\nI have tried many options from the edit menu.\n",
    "votes": "1",
    "answers": 1,
    "views": "9k",
    "tags": [
        "ida",
        "assembly",
        "arm",
        "ios"
    ],
    "user": "jimuty",
    "time": "Jan 14, 2019 at 9:43",
    "comments": [
        {
            "user": "shxdow",
            "text": "Have you tried this ?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "NOTE: I'm assuming you're using IDA 7.X, although this should work equally well for 6.X versions.\nThe option you're looking for is called <pre><code>Patch Program</code></pre>. For your specific question, you'd do the following:\n\nSelect the instruction you want to change\nGo to <pre><code>Edit -> Patch Program -> Assemble</code></pre>\nReplace the instruction in the text box with the instruction you'd like it to be.\nClick OK\n\nThe original instruction will now have been replaced with the new one.\nThis article has more info and examples of using the other options in the <pre><code>Patch Program</code></pre> submenu.\n",
            "votes": "6",
            "user": "hairlessbear",
            "time": "Jan 13, 2019 at 3:41",
            "is_accepted": true,
            "comments": [
                {
                    "user": "jimuty",
                    "text": "<span class=\"comment-copy\">thank you for your answer. I have tried that before. the program says: sorry, this processor module doesn't support the assembler, I am trying to patch an ios arm7 app.</span>",
                    "time": null
                },
                {
                    "user": "hairlessbear",
                    "text": "<span class=\"comment-copy\">Are you using the free version? If you are, this might be a side effect of that. It's also possible that the error message is accurate and that feature really isn't available for iOS binaries; I'm not sure. Regardless, here are two examples of people using alternative methods to patch iOS binaries; maybe one of them will help. <a href=\"https://www.zdziarski.com/blog/?p=2172\" rel=\"nofollow noreferrer\">zdziarski.com/blog/?p=2172</a> <a href=\"https://resources.infosecinstitute.com/ios-application-security-part-26-patching-ios-applications-using-ida-pro-hex-fiend\" rel=\"nofollow noreferrer\">resources.infosecinstitute.com/…</a></span>",
                    "time": null
                }
            ]
        }
    ]
}