{
    "title": "Z80 Absolute Jump to offset in middle of instruction",
    "link": "https://reverseengineering.stackexchange.com/questions/20366/z80-absolute-jump-to-offset-in-middle-of-instruction",
    "content": "I'm working on reverse engineering an embedded system which uses a Z80 processor. I'm using IDA as the disassembler. I ran upon an absolute jump (JP) that seems to jump to the middle of another instruction. I undefined and redefined the target location as code, and it disassembled into valid instructions, but they don't appear to do anything. I was wondering if I could get some help making sense of this or if I'm overlooking something.\nEdit: \nThis jump is an exit point for a loop. \nSource + Bin + IDB file can be found here\nJump code:\n\nJump target with IDA auto disassembly:\n\nJump target after undefining and redefining 121 as code:\n",
    "votes": "4",
    "answers": 2,
    "views": "516",
    "tags": [
        "ida",
        "embedded"
    ],
    "user": "Zman37",
    "time": "Jan 14, 2019 at 22:00",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. Please post the relevant code as actual text. This will ensure that it can be searched. Images are hard to search for keywords. Thanks.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "without any context we can only guess...\nHowever <pre><code>jp (hl)</code></pre> was commonly used for:\n\njump to pointer\nthis one is obvious <pre><code>hl</code></pre> points to a memory location that you want to jump to. You can do many things with this like for example you want to decide how to handle some input and you got more choices of handlers so you evaluate which to use in <pre><code>hl</code></pre> and at the end just jump to it. The same goes for <pre><code>mode</code></pre> of a program... For example you got more ways of rendering text or something and you want easily switch between them for the whole program ... then simply store the selected routine in some pointer and when needed jump to it...\nI do not have any context to your code but this is the most likely scenario:\n<pre><code>286Eh</code></pre> is the selected mode handler, <pre><code>hl</code></pre> read that position using <pre><code>ix</code></pre> and lastly routine jump to it. I am guessing the final <pre><code>ret</code></pre> is in the routine somewhere.\ncall/return to/from subroutine with non standard calling convention\nsometimes operands are passed to subroutines in non standard ways (not on stack) which prevent to use <pre><code>call</code></pre> or <pre><code>ret</code></pre> directly. In such cases <pre><code>jp (hl)</code></pre> can solve such issues.\nFor example take a look at this x86 example:\n\nGraphics mode in assembly 8086\n\nthe <pre><code>printl</code></pre> is expecting printed string directly after the call ...\n<pre><code>call printl\ndb  'SPEKTRA software & hardware',0\n</code></pre>\nthis spares the input data pointer setting and also its more comfortable as the printed text is directly where it is used (not in some table in data section) also you do not need labels. As you can see the <pre><code>printl</code></pre> can not ret directly to the address stored in stack. Instead it needs to jump after the text which is ideal usage of <pre><code>jp (hl)</code></pre> example (however my x86 code does it differently due to different instruction set).\nresolve self modify code issues\nconfigurable programs do not have static jump/call addresses so <pre><code>jp (hl)</code></pre> can be used for configurable jumps...\n\nNow getting back to jumping into middle of instruction\nThis might be or might not be true. If you use disassembler then it does not know where the <pre><code>ORG</code></pre> statement of each code segment is. So it instead translates from start of the file. When you are tracing then it takes the <pre><code>PC</code></pre> as the starting position and translates from it relatively so if you scroll the listing you might got wrongly disassembled other parts of code. However after few continuous single byte instructions the code is aligned again so most of the code would be translated correctly.\nBut there are also cases when we deliberately jump to middle of instruction. Sometimes time sensitive code needs exact number of <pre><code>[T]</code></pre> tacts to spend on some routine and jumping in the middle of some instruction can resolve missing <pre><code>[T]</code></pre> states after some conditional behavior.\n",
            "votes": "1",
            "user": "Spektre",
            "time": "Jan 14, 2019 at 8:24",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Zman37",
                    "text": "<span class=\"comment-copy\">In this case it is a #2 scenario, the jump is within a subroutine with no return instruction. I should have explained better in the original post, but 28e6 contains a memory address, which contains another memory address, which resolves to 0121h. 0121h is the jump target and is in the middle of another instruction. I attached the code and IDB file above for context.</span>",
                    "time": null
                },
                {
                    "user": "Spektre",
                    "text": "<span class=\"comment-copy\">@Zman37 I do not have Z80 disassembler other than my own emulator and too lazy to convert it to one. Anyway by context I mean what is the device for, what is the architecture, what memory location is ROM and RAM? As I mentioned its high likely the code should start at <code>121h </code> instead of <code>11Fh</code> which could be just cause of the linear translation from known start so the last listing is valid. Anyway you might also overlook self modification if the <code>28E6</code> and or <code>28D3</code> is in RAM and your listing is not tracing self modification changes (I do not know IDA) so the jump address might be different</span>",
                    "time": null
                },
                {
                    "user": "Spektre",
                    "text": "<span class=\"comment-copy\">@Zman37 the wrong start of code is usually caused by data sections between routines (disassembler can not distinct which BYTES are data and which instructions unless executed at least once) sometimes <code>ORG</code> directive is used so the routines and or data is at specific location and or align either to enable simpler math or due to HW relation ...</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Actually, JP (HL) is a misnomer; it doesn't jump to (HL) but it jumps to HL.\nThe code jumps to 28D3, which contains a 21 (LD HL, imm), which makes complete sense.\n",
            "votes": "1",
            "user": "Jurjen Bos",
            "time": "Dec 3, 2021 at 12:57",
            "is_accepted": false,
            "comments": []
        }
    ]
}