{
    "title": "Help to identify unknown IC from Microchip",
    "link": "https://reverseengineering.stackexchange.com/questions/20373/help-to-identify-unknown-ic-from-microchip",
    "content": "I am asking here hoping that someone may have experience identifying these kind of old chips. Googling the reference just shows some forums with people in same situation as me.\nIC reference: 25072478 REV D\n\nThis is an Opel LCD dashboard design from the mid 80s. So the chip should have been available at that time.\n8 of the pins are connected to the main controller, which is a known part:\nSAB80515\n\nI am also trying to get at least a part of the board schematic.\nThank you.\nEDIT 1: The chips connects this way, I have to check the other pins left blank at the moment.\n",
    "votes": "2",
    "answers": 1,
    "views": "619",
    "tags": [
        "integrated-circuit"
    ],
    "user": "p1ns",
    "time": "Jan 15, 2019 at 22:12",
    "comments": [],
    "answers_data": [
        {
            "content": "The small chip is probably a one off chip made for whoever manufactured this board. Your best best bet is examining what the pins connect to and analyzing what they may do. Since its a one off chip the chance of finding a datasheet is slim to none. \nThe big chip is a variation of the Intel 8051 which is common in 80's car technology. The datasheet can be found here.\n",
            "votes": "1",
            "user": "Zman37",
            "time": "Jan 14, 2019 at 22:33",
            "is_accepted": false,
            "comments": [
                {
                    "user": "p1ns",
                    "text": "<span class=\"comment-copy\">Thank you for answering, I found that the chip is listed in some online salers or similar webs but they don't provide the datasheet. I don't know if this chip would be based on a standard chip and then relabeled or maybe it is an independent development. I will update the original question showing the connections with the main controller.</span>",
                    "time": null
                }
            ]
        }
    ]
}