{
    "title": "Academic journals for latest RE/Malware/Exploitation research?",
    "link": "https://reverseengineering.stackexchange.com/questions/20403/academic-journals-for-latest-re-malware-exploitation-research",
    "content": "I am looking for journals to keep track of the latest advances in reverse engineering, binary analysis, malware, binary exploitation, etc.\n",
    "votes": "10",
    "answers": 3,
    "views": "656",
    "tags": [
        "malware"
    ],
    "user": "Chase Kanipe",
    "time": "Jan 17, 2019 at 20:00",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "IMO if you want \"latest advances\", you have to go beyond academia and into the field.\n",
            "time": null
        },
        {
            "user": "joxeankoret",
            "text": "In my opinion, academia is years behind the industry.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "This is an indirect answer to your question, but hopefully still useful. There are multiple conferences that feature state-of-the-art work in this space. If anyone knows of more, feel free to add on to this list.\n(links are to the archives of the conferences, whenever possible)\n\nOffensiveCon\n\nVideos are posted on their YouTube channel\n\n\nRECon\n\nFrustratingly, they don't have a consistent method of posting slides/recordings. The link above is to their archives, but some of its links are broken, and not all the available slides/videos are linked in there.\nGenerally, you can get to a year's contents by going to <pre><code>recon.cx/<year></code></pre> (e.g. https://recon.cx/2017). Most of the time those pages have links to the slides and/or recordings from that year.\n\nYou can sometimes find missing stuff by googling the name of the talk; often the author will have posted the slides themselves. There are also various YouTube recordings floating around of various talks from various years.\n\n\nMontreal 2018 is an exception to this rule. As they announced on Twitter, they decided to embed the slides in the schedule, for some reason.\nMontreal 2022 put the slides in the schedule again.\nMontreal 2023 put the slides in the schedule too; apparently this is what they're doing now\n\n\nUSENIX Workshop on Offensive Technologies (WOOT)\n\nFor some reason, since 2020, WOOT proceedings are no longer published via USENIX. You can find recordings/slides, but there's not an archive set up like USENIX. Here's 2021, 2022, and 2023\n\n\nUSENIX Security Symposium\nCanSecWest\n\nTheir archive only goes up to 2018; their current site removed all archives and they no longer post slides. That said, presenters often post slides themselves.\n\n\nInfiltrate (ended in 2019)\n\nThere are of course the juggernauts: DEF CON (full media archive, YouTube playlists of talks) and Black Hat (site archive with slides + white papers, YouTube playlists of talks). Neither is exclusively focused on what you asked about, but they both have plenty of good content on these topics.\nBonus: PoC||GTFO is a completely different style of research than any conference listed above, but it's full of great information and is lots of fun to read.\nBonus 2: InfoCon is the best archive of hacking conference content that exists.\n\nInfoCon is a community supported, non-commercial archive of all the past hacking related convention material that can be found.\n",
            "votes": "9",
            "user": "hairlessbear",
            "time": "Nov 3, 2023 at 0:42",
            "is_accepted": false,
            "comments": [
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">Ah! I thought it was only academic conferences!!! Sorry! Yes, Infiltrate, RECon and OffensiveCon are also well known! Good catch.</span>",
                    "time": null
                },
                {
                    "user": "karsten",
                    "text": "<span class=\"comment-copy\">Thenk you for the nice list!</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "You have a few academic workshops and conferences about the topic (or close to the topic). But, most of them are appearing and disappearing quite often unfortunately. So, it is difficult to come with a long lasting list of conferences. Anyway, here is an attempt:\nStill Alive Conferences\n\nRAID (International Symposium on Research in Attacks, Intrusions and Defenses) (21 years old)\nJournal of Computer Virology and Hacking Techniques (Springer) (15 years old)\nWOOT (Workshop on Offensive Technologies) (12 years old)\nSSPREW (Software Security, Protection, and Reverse Engineering / Software Security and Protection Workshop) (8 years old)\nCODASPY (ACM Conference on Data and Application Security and Privacy) (8 years old)\nBotConf (Botnet fighting Conference) (6 years)\nEuroS&P (IEEE European Symposium on Security and Privacy) (4 years old)\nROOTS (Reversing and Offensive-oriented Trends Symposium) (2 years old)\n\nDiscontinued Conferences\n\nWCRE (Working Conference on Reverse Engineering) \nSPRO (Workshop on Software PROtection)\n\nThese lists are definitely non-exhaustive, so feel free to tell me if I forget something!\n",
            "votes": "7",
            "user": "perror",
            "time": "Jan 17, 2019 at 19:58",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "There is also malware conference which has been running since at least 2011. \nhttps://www.malwareconference.org/\n",
            "votes": "3",
            "user": "TJ Nel",
            "time": "Jan 18, 2019 at 5:51",
            "is_accepted": false,
            "comments": []
        }
    ]
}