{
    "title": "Decompressing a .replay file",
    "link": "https://reverseengineering.stackexchange.com/questions/20466/decompressing-a-replay-file",
    "content": "Fortnite has a feature that records your gameplay and saves it as a .replay file, now I don't believe these files are encrypted, only compressed.\nI wasn't able to find a way online to decompress such files and I'd like to know how, and if there's a possibility of decompressing then re-compressing the files again. \nI'd like to also know if there's any suggestions to programs that does the job\nHere's the beginning of the file in HexEditor\n\nLink for the file (mediafire)\nI've done some testing (replacing values and checking if anything changes) and found a few things:\n\n(Not sure if they would be any useful but thought I'd still share)\nEDIT: I'm trying to end up with something like this\n",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "decompress"
    ],
    "user": "rhyminister",
    "time": "Jan 25, 2019 at 14:30",
    "comments": [
        {
            "user": "Nordwald",
            "text": "This file seems to be neither encrypted nor compressed, since it contains tons of ASCII strings - although binwalk indicates some parts of the file can be deflated in a valid way\n",
            "time": null
        },
        {
            "user": "rhyminister",
            "text": "Is there a way to make this type of files readable?\n",
            "time": null
        },
        {
            "user": "Nordwald",
            "text": "you'd most likely have to reverse the part of the game which parses this file format or make some pretty good assumptions about its structure. Since Fortnite is based on the unreal engine, heaving a look into this may help as well\n",
            "time": null
        },
        {
            "user": "NirIzr",
            "text": "This looks like a decent initial work on figuring out the format. Why have you stopped? were there any specific dificutlies you require assistance with? Right not it is unclear what's the actual question here. I would suggest you give a shot reverse engineering the code that either generates or parses the file format, too advance further.\n",
            "time": null
        },
        {
            "user": "ExQlusiv3_",
            "text": "I know that Fortnitetracker is able to unpack .replay files and read out its data. Here is an example fortnitetracker.com/replays/view/… I am not sure how they do it. You might be able to just ask them in their Discord server.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "This file does not seem encrypted (lots of ASCII).\nThis is most likely based on the Unreal Engine 4's replay mechamisms\nAccording to its documentation, is describes a starting state as well as any changes to this state in chronological order.\nhttps://docs.unrealengine.com/en-us/Engine/Replay/Streamers#replaydataformat\nhttps://docs.unrealengine.com/en-us/Engine/Replay\nhttps://wiki.unrealengine.com/Replay_System_Tutorial\nhttps://api.unrealengine.com/INT/Engine/Replay/index.html\nSince the source code of UE4 is available online, you could have a look at the sections writing and parsing those replays.\nhttps://www.unrealengine.com/en-US/ue4-on-github\n-> What exactly do you want to extract from these replays? If you want to generate videos, I recommend capturing the parts you want with third party software.\n",
            "votes": "1",
            "user": "Nordwald",
            "time": "Jan 25, 2019 at 11:49",
            "is_accepted": false,
            "comments": [
                {
                    "user": "rhyminister",
                    "text": "<span class=\"comment-copy\">I’d mostly be using this to see what exactly gets recorded/saved into the file- I would also like to mess around with whatever that’s saved (structures/player locations etc)</span>",
                    "time": null
                },
                {
                    "user": "Nordwald",
                    "text": "<span class=\"comment-copy\">@rhyminister Then you'll probably not get around writing a parser for this file format based on the UE4 code and related work such as <a href=\"https://www.reddit.com/r/RocketLeague/comments/88uj75/z/dwnfw21/\" rel=\"nofollow noreferrer\">reddit.com/r/RocketLeague/comments/88uj75/z/dwnfw21</a> <a href=\"https://github.com/jjbott/RocketLeagueReplayParser\" rel=\"nofollow noreferrer\">github.com/jjbott/RocketLeagueReplayParser</a></span>",
                    "time": null
                },
                {
                    "user": "rhyminister",
                    "text": "<span class=\"comment-copy\">seems like someone was able to decompress it quite recently <a href=\"https://i.imgur.com/U2LjoWF.jpg\" rel=\"nofollow noreferrer\">i.imgur.com/U2LjoWF.jpg</a> <a href=\"https://twitter.com/shpankus/status/1087884937448038400\" rel=\"nofollow noreferrer\">twitter.com/shpankus/status/1087884937448038400</a> unsure what method he used for that</span>",
                    "time": null
                }
            ]
        }
    ]
}