{
    "title": "ida pro issue debugging issues with ntdll [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/20464/ida-pro-issue-debugging-issues-with-ntdll",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 6 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI am using IDA pro to follow along a youtube video of RE from OALabs. https://www.youtube.com/watch?v=kdNQhfgoQoU&t=1575s\nI am facing a problem when i try to put a break point on functions in ntdll, when i double click c:\\windows\\system32\ntdll.dll in the modules windows I get warning saying \"Module c:\\windows\\system32\ntdll.dll has no names\". When i right click on c:\\windows\\system32\ntdll.dll in the modules window and select load debug symbols, it downloads something but I am still not able to see the functions i would like to put break point on like NtResumeThread.\nAppreciate any assistance or suggestions. Pic attached for reference.\n",
    "votes": "0",
    "answers": 1,
    "views": "983",
    "tags": [
        "ida",
        "malware"
    ],
    "user": "Ahmed NB",
    "time": "6 years ago",
    "comments": [
        {
            "user": "Nordwald",
            "text": "I'm voting to close this question as off-topic because this is better of at Hex Rays support (hex-rays.com/products/ida/support)\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. Wait, what's your problem here? From user mode the <pre><code>Zw*</code></pre> and <pre><code>Nt*</code></pre> functions are literally identical. Just their names differ, entry points to the kernel will be identical. And typically they are exported in pairs, so that's somewhat odd in your case. But still placing a bpx on <pre><code>ZwResumeThread</code></pre> should do the job. Also, your question lacks details such as what exact environment you were running in.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Simply set the breakpoint on <pre><code>ZwResumeThread</code></pre> (also shown in your screenshot). From user mode the only difference between <pre><code>NtResumeThread</code></pre> and <pre><code>ZwResumeThread</code></pre> is the name prefix. In kernel mode these functions (of <pre><code>ntoskrnl.exe</code></pre> instead of <pre><code>ntdll.dll</code></pre>) have implementation differences indeed.\nYou may want to brush up on Windows internals a bit. This article by Geoff Chappell may help.\n",
            "votes": "0",
            "user": "0xC0000022L",
            "time": "Jan 28, 2019 at 10:47",
            "is_accepted": true,
            "comments": []
        }
    ]
}