{
    "title": "Combine various sub routines into one sub routine (IDA Pro)",
    "link": "https://reverseengineering.stackexchange.com/questions/20520/combine-various-sub-routines-into-one-sub-routine-ida-pro",
    "content": "Currently I am analyzing a .so file and there is a function which is supposed to be large (high number of nodes and edges). However, IDA Pro identified it as a small function, with various parts of the code being treated as individual sub routines and some of them have attributes of \"no return\".\nI tried to use append_func_tail to combine the sub routines together but the function returns false.\nI am trying to do these\n\nCombine the various sub routines together into one main sub routine\nCalculate the cyclomatic complexity value of this big sub routine\n\nIs there a way to do the above?\n",
    "votes": "0",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ida",
        "binary-analysis"
    ],
    "user": "localacct",
    "time": "Feb 4, 2019 at 12:31",
    "comments": [
        {
            "user": "Nordwald",
            "text": "Hi and welcome to RE.SE! Can you provide an ida database of binary containing the function in question?\n",
            "time": null
        },
        {
            "user": "w s",
            "text": "If these function fragments are placed sequentially, manual fix is possible. Delete all the functions that IDA created instead of function fragments (AFAIR, Edit-->Functions-->Delete function). Select all the instructions that should be in the large function, and press P. This should create a large function from the selected instructions.\n",
            "time": null
        },
        {
            "user": "localacct",
            "text": "unfortunately, I cannot share the database because the file is proprietary and I am not allowed to share it. I see some suggestions below to try out, will try them.\n",
            "time": null
        },
        {
            "user": "localacct",
            "text": "I would like to add that the functions are not located sequentially but \"scattered\" throughout\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "If IDA has erroneously marked functions as \"noreturn\", you can manually edit this with <pre><code>Alt-P</code></pre>. \"Does not return\" is a checkmark that you can select. Once you've removed this attribute, IDA should properly disassemble the code following the function call -- though you may need to delete functions (as the comment said) if IDA is using obsolete information about the function boundaries.\n",
            "votes": "1",
            "user": "Rolf Rolles",
            "time": "Feb 2, 2019 at 22:08",
            "is_accepted": false,
            "comments": [
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Rerunning IDA's autoanalysis (Options-&gt;General-&gt;Analysis-&gt;Reanalyze program) will fix/adjust most of the incorrectly analyzed functions. That's worth trying before manually deleting functions.</span>",
                    "time": null
                },
                {
                    "user": "localacct",
                    "text": "<span class=\"comment-copy\">hey folks! Thanks for the reply, will try the suggestions.</span>",
                    "time": null
                },
                {
                    "user": "localacct",
                    "text": "<span class=\"comment-copy\">Hi folks, I unchecked the \"no return\" attribute, deleted the sub routines and ran analysis again but IDA Pro just identify those sub routines as individual sub routines as per its original analysis.  I was not able to manually highlight the code portions and indicate them as one big function as they were not located sequentially.  Anything else I can try?</span>",
                    "time": null
                }
            ]
        }
    ]
}