{
    "title": "Where can I, as an individual, get malware samples to analyze?",
    "link": "https://reverseengineering.stackexchange.com/questions/206/where-can-i-as-an-individual-get-malware-samples-to-analyze",
    "content": "It seems that a popular use of software reverse engineering skills is to reverse malicious code in an effort to build better protection for users.\nThe bottleneck here for people aspiring to break into the security industry through this path seems to be easy access to new malicious code samples to practice on and build heuristics for.\nAre there any good resources for a person unaffiliated with any organization to download malware in bulk to run analysis on?\n",
    "votes": "133",
    "answers": 14,
    "views": "127k",
    "tags": [
        "malware"
    ],
    "user": null,
    "time": "Apr 8, 2013 at 23:07",
    "comments": [
        {
            "user": "Gilles 'SO- stop being evil'",
            "text": "Some similar questions on Information Security: Finding Win32.Sality sample for malware analysis purposes; Malwares source repositories. Where?\n",
            "time": null
        },
        {
            "user": "SDsolar",
            "text": "cyberwarzone.com/…\n",
            "time": null
        },
        {
            "user": "SDsolar",
            "text": "zeltser.com/malicious-ip-blocklists\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There's a number of interesting resources you can get malware from\n\nThe premier Malware sample dump Contagio\nKernelMode.info (Focuses on Win32 and novel rootkit techniques)\nDamageLab.org (People occassionally will post their unpacked executables here, which differ from 'in the wild' executables they are seeking to drop on victim's computers, but interesting none the less, many many rips of more well known techniques and software ranging from TDL to Zeus can be found at sites like this) \nThe multitude of malware dump sites such as MalwareBlacklist\nAs qbi kindly pointed out, Malware.lu (You have to register for the samples)\n\nIn addition to these, you can always live dangerously and click on shady affiliate marketing ads or find various signatures for the multitude of \"BEPs\" (Browser Exploit Packs) that malware authors frequently use to get installs and analyze the payload to try to find what they are trying to download and exec.\n",
            "votes": "94",
            "user": "zetavolt",
            "time": "Jan 21, 2014 at 20:43",
            "is_accepted": true,
            "comments": [
                {
                    "user": "mrduclaw",
                    "text": "<span class=\"comment-copy\">That's fantastic, I've been loving checking out DamageLab.org.</span>",
                    "time": null
                },
                {
                    "user": "JZeolla",
                    "text": "<span class=\"comment-copy\">Also there is VirusShare.com</span>",
                    "time": null
                },
                {
                    "user": "Mellowcandle",
                    "text": "<span class=\"comment-copy\">I Suggest turning this into community wiki, it will allow easy access for the info in all the answers.</span>",
                    "time": null
                },
                {
                    "user": "hololeap",
                    "text": "<span class=\"comment-copy\">I just wanted to add one that I have run across: <a href=\"http://vxheavens.com/\" rel=\"nofollow noreferrer\">VX Heaven</a>. It includes forums, virus archives, and a bunch of interviews with old-school virus writers.</span>",
                    "time": null
                },
                {
                    "user": "GuitarPicker",
                    "text": "<span class=\"comment-copy\">Don't forget grandma's computer.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "There are many great options to get malware samples in all the comments but, also, I want to point you to 2 more options:\n\nOpen Malware. This is the new site for the old Offensive Computing.\nI used to host a MalwareURLs list on My Blog but it seems to be down ATM. I'll update with a new URL as soon as it's back up.\n",
            "votes": "36",
            "user": "2 revs, 2 users 74%joxeankoret",
            "time": "Mar 25, 2019 at 21:02",
            "is_accepted": false,
            "comments": [
                {
                    "user": "mrduclaw",
                    "text": "<span class=\"comment-copy\">MalwareURLs is pretty awesome!  Can I ask where you get the URLs from?</span>",
                    "time": null
                },
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">Crawlers, sandboxes, 3rd party public &amp; private URL feeds, etc...</span>",
                    "time": null
                },
                {
                    "user": "mrduclaw",
                    "text": "<span class=\"comment-copy\">Thanks, I guess I was hoping more for a list of URL feeds that I can walk as well.</span>",
                    "time": null
                },
                {
                    "user": "learnerX",
                    "text": "<span class=\"comment-copy\">Both of these seem to be down now.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I use VirusShare.com, which has about 5.6 million samples. You will need to request access, but I just explained the research I was doing (as a person unaffiliated with any organisation) and they let me in.\nYour question mentioned downloading in bulk. The site says:\n\nWant more than a few samples? Want to download really large samples of malware? Want to download almost the entire corpus? No problem.\n\nThe site provides torrents, each consisting of over 100k samples (ranging in size from 13GB to 85GB). Each torrent is a single zip file. You can also download individual files, but if you don't want to download them in bulk, you may be better off looking at one of the other excellent answers.\n",
            "votes": "32",
            "user": "Dougall",
            "time": "Apr 9, 2013 at 0:28",
            "is_accepted": false,
            "comments": [
                {
                    "user": "polym",
                    "text": "<span class=\"comment-copy\">Update: <a href=\"http://virusshare.com\" rel=\"nofollow noreferrer\">virusshare.com</a> has as of now 20,395,749 samples. Edit: Now it has 20,395,769...</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "You may start to look from your junk email folder and antivirus quarantine.\nIf you need something in particular, you may try to grab them live, from URLs posted by other researchers, and after you find something you want to share, add there too.\nHere is a list I created once for my readers:\n\nMalware Domain List\nURL Query\nMalekal.com list of malware\nVX Vault\nSite Inspector (by Comodo)\nScumware.org\nMalc0de Database\nSucuri Malware Labs\nClean-MX Realtime database\nSourcefire Vulnerability Research Team Labs\nZeus Tracker\nNovCon Minotaur Analysis System\n\nCredit goes to: http://ondailybasis.com/blog/?p=1188\n",
            "votes": "25",
            "user": "Denis Laskov",
            "time": "Apr 2, 2013 at 10:58",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I'd suggest Malware.lu. The website writes (as of 2013-03-23):\n\nCurrently the database contains 5,356,052 samples. \n\nFirst you have to request an account. The website lists an email address. You can send a few words why you want to have an account there. After some time they send you your login data.\nYou can access the data through the website, but they also provide an API. See example Python code.\n",
            "votes": "24",
            "user": "qbi",
            "time": "Jan 21, 2014 at 19:37",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "There is also the option of putting out your own HoneyPot to capture live malware. This does take a bit of effort and some resources (purchasing Internet addressable IP address). However, the advantage of this method is that you are virtually guaranteed to capture malware that are actively being used currently in the wild. There is the possibility that you might hit a jackpot and also get infected with a brand new malware that might even exploit 0-day vulnerabilities. This approach is very helpful for people who are already well-versed in the field of reversing. I have used Dionaea (http://dionaea.carnivore.it/) in the past to set up my own honeypot with very good results. It's replete with instructions, background, and references.\nFor beginners and for people who don't want to put too much effort gathering samples, I would advise taking the route of downloading the malware from the sites the other posters have indicated.\n",
            "votes": "12",
            "user": "rev",
            "time": "Apr 6, 2013 at 17:42",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "There are a couple options when it comes to getting samples for analysis.\nScraping\nThis one is extremely common and is what is used by a lot of researches to build sample databases.\nRecommendation: You could build your own scraper of common sources or build upon ones like:\nhttps://github.com/technoskald/maltrieve\nMalware Farms\nOther researches will at times allow access to their collections. An example of this is malware.lu\nRecommendation: Try requesting access to malware.lu and similiar repos. Check the list at the bottom for more. This is a great way to get access to a lot of samples fast.\nHoneypots\nResearchers can use server and client side honeypots to try and collect malware.\nRecommendation:\nCheckout http://dionaea.carnivore.it/ for a server side honeypot. These are great for collecting self propagating malware.\nCheckout https://github.com/buffer/thug for a client side honeypot.\nManually\nYou can browse the shady portions of the internet and look for samples yourself.\nThis is pretty much the standard list of sample sources:\nhttp://www.kernelmode.info/forum/viewtopic.php?f=16&t=308\nEach one of the above samples has its own pros and cons. Recommend you play with each to find out which produces what you need.\n",
            "votes": "11",
            "user": "atorrrr",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "If you ask nicely, you may be able to get researcher access to VirusTotal.\n",
            "votes": "8",
            "user": "user1307",
            "time": "Mar 29, 2013 at 19:27",
            "is_accepted": false,
            "comments": [
                {
                    "user": "mrduclaw",
                    "text": "<span class=\"comment-copy\">Would that work even though I'm just some random guy on the Internet that wants to learn with no credentials?</span>",
                    "time": null
                },
                {
                    "user": "harley",
                    "text": "<span class=\"comment-copy\">There's only one way to find out :-)</span>",
                    "time": null
                },
                {
                    "user": "qwerty",
                    "text": "<span class=\"comment-copy\">Yes you should give a try</span>",
                    "time": null
                },
                {
                    "user": "asheeshr",
                    "text": "<span class=\"comment-copy\">While this link may answer the question, it is better to include the essential parts of the answer here and provide the link for reference. Link-only answers can become invalid if the linked page changes. Why do you recommend this? What does it offer?</span>",
                    "time": null
                },
                {
                    "user": "Daniel",
                    "text": "<span class=\"comment-copy\">Even though this is an old post, I feel that I should say that I contacted VIrusTotal last year about gaining access and they just gave me a price list.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I like to run Kyle Maxwells Maltrieve https://github.com/technoskald/maltrieve, which will collect malware from various resources.\nAdditionally, I have some samples up for download on my site TekDefense.com http://www.tekdefense.com/downloads/\nLegend of random: https://tuts4you.com/download.php?view.3554 \nThe last is for those who want to begin from scratch.I think it's great for you to get start with Ollydbg.Unluckily it's main website already down right now.So you can get only PDF.Grab it before it's gone!\n",
            "votes": "7",
            "user": "user1399",
            "time": "Jul 16, 2015 at 6:52",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I just wanted to add one that I found on reddit, just so it's here:\nhttp://www.malshare.com\nThe nice thing about this place is that there is absolutely no sign-up or anything.\n",
            "votes": "5",
            "user": "mrduclaw",
            "time": "Apr 3, 2013 at 21:26",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Related Reddit topic.\n[Edit]Here is the content of the page :\n\n\"Search youtube for facebook, msn, gmail, yahoo etc password hacking tools or things like xbox points generators and your guaranteed to find a few RATs.\"\n   --ashtrae\n\n-\n\n\"Try browsing through the recent results at urlquery.net\n  If you see any recent searches/scans that were tagged as malicious, chances are they haven't been fixed yet. There are plenty of other sites out there where you can download samples packed in password protected .zips, but I'm assuming you're looking for something live, like a drive by exploit in this case? If that's true, urlquery should help.\" -- NattyBroh\n\n-\n\n\"On top of what is already mentioned. Your spam folder. Some malware is spread via email campaigns.\n  Torrents/Usenet - many pirated apps come bundled with a little extra. new unverified torrents on public trackers is a good place to start.\n  Small sketchy ad networks. Even big guys, like adwords, get malware ads once in a while, small companies don't have resources to scan everything thoroughly. ... Check ads for various blackhat services, click links, you'll find some fun stuff. Bad guys are not above infecting each other.\n  Generally, What Would Black Hat Do? is a good motto to stick by. If you were distributing malware, how would you go about it?\" --choleropteryx\n\nhttps://malwr.com/ // posted by highentropy1337\nhttp://malwaretips.com/forums/virus-exchange.104/ // posted by Websly  http://contagiodump.blogspot.in/ // posted by bhumish\nhttp://www.kernelmode.info/forum/ // posted by idkbtc\nPosted by loualbano:  \n\nhttp://www.scumware.org/reports.scumware\nhttp://minotauranalysis.com/malwarelist.aspx (might be dead)\nhttp://www.malc0de.com/database/\nhttp://www.malwareblacklist.com/showMDL.php \nhttp://cybercrime-tracker.net/ \nhttps://zeustracker.abuse.ch/monitor.php?browse=binaries \nhttp://vxvault.siri-urz.net/ViriList.php \nhttps://palevotracker.abuse.ch/ \nhttps://spyeyetracker.abuse.ch/monitor.php?browse=binaries \nhttp://www.sacour.cn/m/\n(part chinese and part english, click around to find .exe links)\nhttp://www.nothink.org/viruswatch.php \nhttp://www.blade-defender.org/eval-lab/ (dead?)\nhttp://www.malwaredomainlist.com/forums/index.php?topic=3270.0\nhttp://www.malwaredomainlist.com/update.php \nhttp://malwaredb.malekal.com/ \nhttp://avcaesar.lu/ \nhttp://malwareurls.joxeankoret.com/normal.txt   (dead?)  \nhttp://virusshare.com/ \nhttp://contagiodump.blogspot.com/ \nhttp://www.kernelmode.info/forum/viewforum.php?f=16 \nhttp://malshare.com/ \nhttp://www.malwareblacklist.com/showMDL.php  (dead?)\nhttp://openmalware.org/ \nhttp://secuboxlabs.fr/  (dead?)\nhttp://support.clean-mx.de/clean-mx/viruses.php \nhttp://www.offensivecomputing.net/ \nhttps://forums.malwarebytes.org/index.php?s=fab929606b2191a7ecc31194dec7118f&showforum=51 \nhttp://jsunpack.jeek.org/?list=1 \nhttp://malwared.ru/database.php?page=1\n",
            "votes": "5",
            "user": "Dominik Antal",
            "time": "Jan 21, 2014 at 20:25",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">While this link may answer the question, it is better to include the essential parts of the answer here and provide the link for reference.  Link-only answers can become invalid if the linked page changes.</span>",
                    "time": null
                },
                {
                    "user": "Dominik Antal",
                    "text": "<span class=\"comment-copy\">@0xC0000022L Corrected.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">and thanks for reacting to it and of course +1.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Here a website I like which wasn't mentioned before\n\nmalwaretips.com - \"Virus Exchange\" forum with active community sharing samples, also contains references to other malware sharing sites.\n",
            "votes": "4",
            "user": "VCollect",
            "time": "Apr 17, 2013 at 14:35",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Ange",
                    "text": "<span class=\"comment-copy\">Please give us more details - why are these sites worth mentioning?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I give a good one: http://www.virussign.com/downloads.html, It also contains a behavior analysis report.\n",
            "votes": "4",
            "user": "Bright",
            "time": "Jul 11, 2013 at 9:49",
            "is_accepted": false,
            "comments": [
                {
                    "user": "asheeshr",
                    "text": "<span class=\"comment-copy\">While this link may answer the question, it is better to include the essential parts of the answer here and provide the link for reference. Link-only answers can become invalid if the linked page changes. Why do you recommend this? What does it offer?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "theZoo\ntheZoo is a project created to make the possibility of malware analysis open and available to the public. Since we have found out that almost all versions of malware are very hard to come by in a way which will allow analysis we have decided to gather all of them for you in an available and safe way. theZoo was born by Yuval tisf Nativ and is now maintained by Shahak Shalev.\nMalware Source\nMalware Binaries\n",
            "votes": "3",
            "user": "AminM",
            "time": "Mar 12, 2016 at 8:45",
            "is_accepted": false,
            "comments": []
        }
    ]
}