{
    "title": "1990s non windows software keys [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/20720/1990s-non-windows-software-keys",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 6 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nHi I am a Service Engineer on some very old ASML stppers that run a system called PAS (Philips automated steppers), these steppers are obsoleted by the manufacturer and no longer supported by anyone.  I have the install software but it requires a software key that I dont have.  What I do have is 6 software keys from a previous version of software(I dont have) and would like to try and see how these keys are generated so I can generate new ones.\nI am not very good at software issues but I can manage if I can get some ideas what way to go, I recently talked with the manufacturer and since they no longer support these are free to do with what we want.\nThis is a non standard system, neither windows or unix can view the file structure, I am able to use Acrius software to image the hard drives successfully, now I just need to be able to install software.\nAnyone have any suggestions? Is there a way to use the old keys and info the tool asks for to decode the old keys?\n",
    "votes": "1",
    "answers": 0,
    "views": "63",
    "tags": [
        "decryption"
    ],
    "user": "JOHN",
    "time": "6 years ago",
    "comments": [
        {
            "user": "Johann Aydinbas",
            "text": "Can you give some more information? Where do you run the \"install software\", on the machine itself? From what I understand the setup (install software) asks for a key so the algorithm to verify the key will be found in there. So you'd have to reverse engineer that.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. We seriously need more information here. While old keys may help, they're more likely to distract. You first need to tell us what it is rather than what it's not (at least as long as your list of what it's not is so small). What CPU are we talking about? Is it running bare-metal or on some OS?\n",
            "time": null
        }
    ],
    "answers_data": []
}