{
    "title": "Likely places to look to find cheap sources of FPGA? Which devices should I open first? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/2076/likely-places-to-look-to-find-cheap-sources-of-fpga-which-devices-should-i-open",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it's on-topic for Reverse Engineering Stack Exchange.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI have a large group of new and old devices and I would like to find a FPGA to start poking around on. What products or types will be likely to have FPGAs in them?\n",
    "votes": "4",
    "answers": 0,
    "views": "106",
    "tags": [
        "fpga"
    ],
    "user": "Spencer",
    "time": "11 years ago",
    "comments": [
        {
            "user": "cb88",
            "text": "you should ask this on electronics.stackexchange.com .\n",
            "time": null
        },
        {
            "user": "FarhadA",
            "text": "What do you mean by \"devices\"? What kind of devices and the best way to find out is just open the case and see, of course you still can't use them unless they have a JTAG interface which I doubt they would.\n",
            "time": null
        },
        {
            "user": "cb88",
            "text": "looking in \"Devices\" is pointless as those FPGAs are probably locked down.. possibly even programmed with a locked down rom. Also devices with big FPGAs are going to be useless since you won't be able to get inexpensive tooling for them. Your best bet is to just buy a board with a Spartan-6 LX75 on it since that is the biggest the no added cost tools support. Alternatives aren't worth much consideration unless you want cheap over performance. If it isn't an FPGA board designed for reprogramming it probably isn't worth your time.\n",
            "time": null
        },
        {
            "user": "Spencer",
            "text": "I asked the question on the other exchange site and added a link to the youtube video that got me inspired to start looking. I would be pleased if you would find the time to look at my new question: electronics.stackexchange.com/questions/70325/…\n",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "Please do not cross post across multiple sites. If you do, then flag your own question for Moderator attention so that it can be closed. Cross posting is highly discouraged, unless you do not get responses on the original post for an extended period of time.\n",
            "time": null
        }
    ],
    "answers_data": []
}