{
    "title": "Recommended way to modify assembler instructions in IDA",
    "link": "https://reverseengineering.stackexchange.com/questions/20760/recommended-way-to-modify-assembler-instructions-in-ida",
    "content": "What is the easiest way (or is there any) to modify an instruction\ninside a binary opened inside IDA and save the changes to the original? \nIs there a builtin assembler who's output I can place at a certain offset? How can I save back a binary after having edited the hex view?\n",
    "votes": "2",
    "answers": 1,
    "views": "6k",
    "tags": [
        "ida",
        "assembly"
    ],
    "user": "Konrad Eisele",
    "time": "Mar 3, 2019 at 18:37",
    "comments": [],
    "answers_data": [
        {
            "content": "This is quite easy with IDA Pro:\nWith the cursor at the first instruction you want to modify go to Edit | Patch Program | Assemble\n\nChange the instruction(s) as required until you are done, then press OK\n\nFinally choose Edit | Patch Program | Apply patches to input file (and optionally make a backup).\nHere is an example: https://www.remkoweijnen.nl/blog/2013/05/23/application-compatibility-fixing-to-the-extreme/\nFrom the Help:\n\nEdit|Patch core submenu   This submenu allows you to patch the image\n  of the input file. More precisely, IDA never modifies the input file.\n  The image of the input file which was loaded to the database will be\n  modified.  You can modify the image of the input file: \n<pre><code>    - change a byte\n    - change a word\n    - enter an assembler instruction (only for IBM PC)\n</code></pre>\nIDA will display the original value, the current value and file\n  offset. If the file offset is equal to 0xFFFFFFFF then the current\n  byte comes from a compressed page (LX/LE/NE iterated pages, for\n  example) and/or it is not possible to tell the file position.  You can\n  create a difference file and use an external tool to apply the patches\n  or you can apply the patches directly to the file using IDA. \nThe following commands are availabe: \nPatch byte or word  Assemble...  Apply patches to input file...\nSee also:   Produce EXE file  Produce DIF file  Edit submenu.\n",
            "votes": "4",
            "user": "Remko",
            "time": "Mar 3, 2019 at 22:21",
            "is_accepted": true,
            "comments": []
        }
    ]
}