{
    "title": "Trace back function call",
    "link": "https://reverseengineering.stackexchange.com/questions/20776/trace-back-function-call",
    "content": "I'm learning reverse engineering and I'm trying to find where an error message is called.\nI want to get in the part of the code, in the main module, where it decides to display the error message or the succeed message, but I'm having problems tracing back to the function call because I get in a point of nowhere.\nThis is what I do:\n\nSet breakpoint on MessageBoxW\nBreakpoint on MessageBoxW\nSee the stack for the return address or run till return\n\nBut the address I get is something like: system.windows.forms.ni.123456.\nIf I keep tracing back I get in a point of nowhere (somewhere in user32.dll).\nHopefully someone has a better way to trace back this function or its familiar with \"system.windows.forms\" and can explain me how it works.\n",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "disassembly",
        "x64dbg"
    ],
    "user": "Francisco Linan",
    "time": "Mar 4, 2019 at 15:19",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "system.windows.forms suggest that this is a .net executable. Maybe use dnSpy instead of x64dbg\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It may be easily done using OllyDbg. Just load the executable and press <pre><code>F9</code></pre> - execution should be passed to the main module of application. Then, in the panel where the instructions are displayed, right click, then select <pre><code>Search for</code></pre>-><pre><code>All intermodular calls</code></pre> like below:\nYou should see the window looking similar to this:\n\nAfter that click the <pre><code>Destination</code></pre> tab (that will sort the list alfabetically) and search for <pre><code>MessageBoxW</code></pre> function. Then choose any of the references to this function and double click on it - you will see a call to it in the main window highlighted on grey. Then press <pre><code>F2</code></pre> to set a software breakpoint there, then click <pre><code>View</code></pre>-><pre><code>Call stack</code></pre> and finally <pre><code>F9</code></pre> to continue execution to that breakpoint.\nWhen the execution hits it, the <pre><code>Call stack</code></pre> window will contain the list of subsequent function calls that led to <pre><code>MessageBoxW</code></pre> call.\n",
            "votes": "1",
            "user": "bart1e",
            "time": "May 31, 2019 at 14:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}