{
    "title": "How to export a working elf binary from Ghidra?",
    "link": "https://reverseengineering.stackexchange.com/questions/20877/how-to-export-a-working-elf-binary-from-ghidra",
    "content": "When patching a program and then using the export binary function, it turns the elf headers are corrupt. \nIs there any way to work around this problem?\n",
    "votes": "7",
    "answers": 1,
    "views": "12k",
    "tags": [
        "elf",
        "ghidra"
    ],
    "user": "ghidra",
    "time": "Mar 14, 2019 at 7:39",
    "comments": [
        {
            "user": "Dor00tkit",
            "text": "Yes, this is a known problem, here is an explanation of how to fix it: github.com/NationalSecurityAgency/ghidra/issues/19\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Ghidra Export Binary Feature\nUPDATE AS OF June 2021:\nThe preliminary release notes list this as a feature for Ghidra 10, which should be released \"mid to end of June 2021\":\n\nNew exporters that write programs imported with the PE and ELF loaders back to their original file layout have been added.\nAny file-backed bytes that were modified by the user in the program database will be reflected in the written file.\nBytes that are part of the import process such as relocations or modified Memory Maps are not currently handled.\n\nhttps://github.com/NationalSecurityAgency/ghidra/blob/Ghidra_10.0_build/Ghidra/Configurations/Public_Release/src/global/docs/WhatsNew.html#L421-L424\nAs soon as Ghidra 10 is released this answer can be edited with the details of the process, but most likely it will just be similar to the current \"exporter\" that doesn't produce valid binary files.\nOriginal (Outdated)\n\nNote that the Binary export is not broken, it is simply misunderstood. This exporter simply dumps the initialized memory blocks defined within Ghidra in binary form. The blocks are appended sequentially. It was never intended to recreate a loadable/executable binary. While this is certainly a desirable feature, it does not yet exist within Ghidra.\n\n\"Official\" Statement at https://github.com/NationalSecurityAgency/ghidra/issues/19#issuecomment-591596603\nPatching and exporting a working executable\nThis is currently (April 2020) not supported in Ghidra itself and requires some external scripts/forks with some tradeoffs because in the most general sense you can't just turn an address space back into an executable file. But for the common case of patching instructions there are options:\nPR/Fork that will possibly be upstreamed\nThere is a PR that is currently being worked on at https://github.com/NationalSecurityAgency/ghidra/pull/1505 that aims to implement binary patching\nGhidra Script\nIf building a custom fork is too much effort for a quick patch, another easier option is to use a script like https://github.com/schlafwandler/ghidra_SavePatch\n",
            "votes": "8",
            "user": "Florian Magin",
            "time": "Jul 30, 2021 at 12:59",
            "is_accepted": false,
            "comments": [
                {
                    "user": "D4l3k",
                    "text": "<span class=\"comment-copy\">Hello, any update regarding this?</span>",
                    "time": null
                },
                {
                    "user": "Florian Magin",
                    "text": "<span class=\"comment-copy\">Yes, Ghidra 10 has been released, but I haven't used that feature myself yet</span>",
                    "time": null
                }
            ]
        }
    ]
}