{
    "title": "Where can I go to learn about decryption? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/20888/where-can-i-go-to-learn-about-decryption",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 6 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI understand the basics of encryption and decryption, but I don't know where to go to talk to people and learn more. Are there any forums or resources to look at to learn more?\nFor example, I was given two Hex strings and told that the second was modified, but originally a ~90% match of the first:\n[3E 02 2D 06 7E 31 00 00 04 2A 7E 30 00 00 04 2A] \nand\n[5A E1 78 F3 72 2C 90 D3 07 4A 10 41 49 4B 0D C4 F7 5D 9E 32 7C 01 F5]\nI know the second one is encrypted because a simple statistical analysis shows a balanced distribution of values, but I don't know the process for trying to de-encrypt it.\n",
    "votes": "0",
    "answers": 1,
    "views": "123",
    "tags": [
        "encryption"
    ],
    "user": "user3814158",
    "time": "6 years ago",
    "comments": [
        {
            "user": "dingo_kinznerhook",
            "text": "Honestly, the best start for you might be to read the Wikipedia article on cryptography and purchase a college-level textbook on Cryptography. Look for texts like \"Introduction to Cryptography\" and \"Applied Cryptography\" because those may answer some of the questions you're asking.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There are two separate questions there:\n\nWhat communities can I go to to learn more about decryption?\n\nTwo quickly come to mind: Reddit and Cryptography Stack Exchange.\n\nWhere do I go to find people to decrypt my specific problems?\n\nYou could try Stack Exchange, but there is also a small community on Reddit called decoders that will try to decode things if they think it's interesting.\n",
            "votes": "2",
            "user": "theTheodidact",
            "time": "Mar 15, 2019 at 17:57",
            "is_accepted": true,
            "comments": []
        }
    ]
}