{
    "title": "Opinions and suggestions regarding malware sandboxes [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/2091/opinions-and-suggestions-regarding-malware-sandboxes",
    "content": "As it currently stands, this question is not a good fit for our Q&A format. We expect answers to be supported by facts, references, or expertise, but this question will likely solicit debate, arguments, polling, or extended discussion. If you feel that this question can be improved and possibly reopened, visit the help center for guidance.\n                                \n                            \n\n\n\nClosed 11 years ago.\n\n\n\nI'm relatively new in the field of automatic malware analysis and I'd like to ask about hands-on opinions about sandboxes in the following aspects:\n\nextensibility of the product - adding your own modules, interfere in the analysis process, ease of the process inself.\ndepth of report generation\nmalware detection evasion and if it is possible to change this logic\nperformance issues\n\nTill now I've been able to check cuckoobox system and it looks quiet promissing. I'd be glad to heir someones opinion (from personal experience) about that product too.\nThanx in advance.\n",
    "votes": "2",
    "answers": 0,
    "views": "86",
    "tags": [
        "malware",
        "automation"
    ],
    "user": "PhoeniX",
    "time": "11 years ago",
    "comments": [
        {
            "user": "asheeshr",
            "text": "Hi! Welcome to Reverse Engineering. Opinion based questions and product reviews are generally not constructive. If you have a specific problem that you faced, then you can ask for solutions and suggestions about that. Stack Exchange differs from forums specifically because the platform is suited to objective oriented Q&As. See tour and faq for more.\n",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "If you want to ask about the effectiveness of a specific software/tool/plugin for a specific task/area, then you are welcome to do so.\n",
            "time": null
        }
    ],
    "answers_data": []
}