{
    "title": "Program with no dependencies",
    "link": "https://reverseengineering.stackexchange.com/questions/2092/program-with-no-dependencies",
    "content": "while reading the answers to Can I statically link (not import) the Windows system DLLs? I came up with another question. So: \n\nIs there a way to write a program that has no dependencies (nothing is statically compiled too - it has only my code) and everything is resolved during run-time assuming that <pre><code>kernel32.dll</code></pre> will be loaded/mapped into the process no matter what?\nIs my assumption about <pre><code>kernel32.dll</code></pre> correct?\n\nDuring run-time, I mean using the <pre><code>PEB</code></pre> structure.\n",
    "votes": "7",
    "answers": 4,
    "views": "2k",
    "tags": [
        "windows",
        "malware",
        "development",
        "winapi"
    ],
    "user": "PhoeniX",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Keep in mind that the rules about <pre><code>kernel32.dll</code></pre> only apply to the NT platform. Not that I expect anyone to still use 9x/Me, but just in case ;)\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "If you're asking about PE files, and by \"no dependencies\" you mean \"no statically imported DLLs\", then yes.\nSee <pre><code>\\yoda\\NoImports.exe</code></pre> in https://corkami.googlecode.com/files/BinaryCorpus_v2.zip as an example.\n",
            "votes": "9",
            "user": "Jason Geffner",
            "time": "May 24, 2013 at 22:22",
            "is_accepted": true,
            "comments": [
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">Thanks, this is nice and interesting solution and he indeed assumes that the stack has return address into somewhere in <code>kernel32</code> space (which he explored here) and from there the way is \"straightforward\" :)</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">the more common way these days to resolve the base address of kernel32.dll is to walk the InMemoryOrderModuleList list, since the DLL order hasn't changed even in Windows 7.  Technically, you don't need to resolve anything but GetProcAddress(), if you have an export table, because you can use forwarded references to the DLLs of interest, and GetProcAddress() on your own exports will cause Windows to load the DLLs for you.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "This isn't a very portable trick, but kernel32.dll is always loaded at the same address when the executable is launched, that means LoadLibraryA and GetProcAddress are always at the same address. You could hard-code those offsets and go from there.\n",
            "votes": "3",
            "user": "Avery3R",
            "time": "May 24, 2013 at 22:02",
            "is_accepted": false,
            "comments": [
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">So, <code>kernel32.dll</code> will be always loaded into the processes event if the PE image does not reference it anywhere in the code?</span>",
                    "time": null
                },
                {
                    "user": "Avery3R",
                    "text": "<span class=\"comment-copy\">@ph0sec yep, the windows loader always loads in kernel32.dll as well, and always at the same address.</span>",
                    "time": null
                },
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\"><code>@MMavipc</code> regarding the same address is not always right as in the Vista and Win 7 family, the <a href=\"http://en.wikipedia.org/wiki/Address_space_layout_randomization\" rel=\"nofollow noreferrer\">ASLR</a> was introduced to brake this assumption.</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">@MMavipc that behavior was introduced in Windows XP, to avoid the crashing problem when a process did not import from kernel32.dll, and so it was not loaded explicitly.@ph0sec that's not exactly correct, either - ASLR applies only to the first time that kernel32.dll (and ntdll.dll, too) is loaded.  After that, it is at a common address across all processes.</span>",
                    "time": null
                },
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\"><code>@peter ferrie</code> of cause as it is loaded only once and mapped to other processes after that. The thing I was referring here is that you cannot (should not) hard code the <code>kernel32.dll</code> base address into the executable itself.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Yes, a program that has no dependencies is possible. \nTo imports APi, it needs first to locate kernel32 (via stack+<pre><code>MZ</code></pre> scanning, or <pre><code>PEB</code></pre>) then locate exports (via exports parsing or hard-coded values).\n",
            "votes": "2",
            "user": "Ange",
            "time": "May 25, 2013 at 16:33",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Yes.  \n\nFind the address of kernel32 using anyone of the known tricks (PEB or any other way)  \nImplement a simple export section parser and find the address of <pre><code>LoadLibrary</code></pre> and <pre><code>GetProcAddress</code></pre>.  \nUse those to load any other API you want.\n",
            "votes": "2",
            "user": "perror",
            "time": "May 26, 2013 at 8:18",
            "is_accepted": false,
            "comments": []
        }
    ]
}