{
    "title": "QEMU fpu mode error when attempting to run MIPS binary",
    "link": "https://reverseengineering.stackexchange.com/questions/20938/qemu-fpu-mode-error-when-attempting-to-run-mips-binary",
    "content": "I have unpacked a firmware binary using binwalk and have identified the architecture as MIPS by running file bin/busybox . When I try to run the binary with the proper static version of qemu, i get an error with FPU mode ex:\n<pre><code> chroot . ./qemu-mips-static bin/busybox\n qemu: Unexpected FPU mode \n</code></pre>\nI can't find anything on this error.  I have tried this on several different firmwares and i keep getting the same error. \nThe OS is Kali linux with qemu-user-static installed and the qemu-mips-static static binary place in the root directory of the unpacked firmware.\n",
    "votes": "1",
    "answers": 2,
    "views": "792",
    "tags": [
        "firmware",
        "qemu",
        "emulation"
    ],
    "user": "Lexicon",
    "time": "Mar 21, 2019 at 20:23",
    "comments": [],
    "answers_data": [
        {
            "content": "According to the source code, the EABI from your ELF is not compatible. It seems to be specific to MIPS, you can find the structure here, this structure is stored inside a specific ELF segment, the code in charge to read it is here. I suggest you to make sure this segment is present and if it contains correct values. I think you can dump this information with <pre><code>readelf(1)</code></pre>.\n",
            "votes": "2",
            "user": "wisk",
            "time": "Mar 21, 2019 at 21:01",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Lexicon",
                    "text": "<span class=\"comment-copy\">How do I indentify the proper segment in readelf? what am I looking for?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "This could be a bug of qemu. I had a similar issue and managed to resolve it by recompiling qemu with the patch suggested in qemu mailing list\n",
            "votes": "0",
            "user": "VePe",
            "time": "Apr 27, 2019 at 23:30",
            "is_accepted": false,
            "comments": []
        }
    ]
}