{
    "title": "IDA Pro - Remote debugging suse enterpris server 10 (glibc2_10 required)",
    "link": "https://reverseengineering.stackexchange.com/questions/20945/ida-pro-remote-debugging-suse-enterpris-server-10-glibc2-10-required",
    "content": "I have a Suse enterprise server 10 on VMWare. I want to remote debug an application in this VM using IDA pro, I already tried these:\n\nCopied linux_server form IDApro into this VM and tried to run it, but it gives this error: linux_server : /lib/libc.so.6 : version 'GLIBC_2.7' not foundn (required by ./linux_server)\nDownloaded and extracted glibc2.7 near linux_server and modified Library search path (environment value) and then tried to run linux_server, but it failed with another error.\n\nI think the problem is that linux_server has been compiled using newer versions of glibc, but that version of suse is using older versions.\nso I think the question is: How can I remote debug an application in old-linux machines? Is there exists an older version of debugger that runs is such scenarios?\n",
    "votes": "1",
    "answers": 0,
    "views": "120",
    "tags": [
        "ida",
        "debugging",
        "debuggers"
    ],
    "user": "Mahdi",
    "time": "Mar 23, 2019 at 9:08",
    "comments": [
        {
            "user": "Chris Stratton",
            "text": "\"it failed with another error.\" Please describe the error.\n",
            "time": null
        },
        {
            "user": "Chris Stratton",
            "text": "And as for your actual task, have your tried just using gdb, either locally or with its remote capability?\n",
            "time": null
        },
        {
            "user": "dingo_kinznerhook",
            "text": "Also, what version of glibc is available on SUSE Enterprise server 10? You have a good question; you just need to provide us some details. Like Chris Stratton said above, you may be able to just set up gdbserver and connect to it using IDA Pro.\n",
            "time": null
        },
        {
            "user": "Mahdi",
            "text": "@ChrisStratton: 1-if I extract glibc-2.7-12.2mnb1.i586.rpm and put the extracted lib folder in LD_LIBRARY_PATH, It shows error requiring glibc2.10 and glibc2.11, and if I extract glibc-2.11.1-8.3mnb2.i586.rpm and repeat above steps, it show this error: Error while loading shared libraries: /root/ida68/lib/i686/libc.so.6: ELF file OS ABI invalid        2- I haven't tried gdbserver, I'll try it and let you know the result.\n",
            "time": null
        },
        {
            "user": "Mahdi",
            "text": "@dingo_kinznerhook : 1- glibc-2.4 is available on this version of suse.   2- I'll try and let you know. Thanks\n",
            "time": null
        }
    ],
    "answers_data": []
}