{
    "title": "How to debug programs that load from another one? with radare2/gdb",
    "link": "https://reverseengineering.stackexchange.com/questions/21060/how-to-debug-programs-that-load-from-another-one-with-radare2-gdb",
    "content": "I'm reversing engendering a plugin. This plugin is loaded into memory by the main program. \nI disassemble the plugin with radare2 but I don't know how to debug it.\nI try with gdb but same problem. \nI know is possible because I have done it in Hopper but I don't know to to do it with radare2 or gdb.\none of the obstacles is, I load the plugin with radare2 to disassembler it but I can't put any breakpoint because is not set it in debug mode. Also, I can't set the debug mode because the plugin can't start by it self. Maybe I need I command that will start my main program before the debug? is there anything like that in radare2? I was reading about rarun2 but I can't make it work for something like this \nAny ideas?\nThanks\n",
    "votes": "0",
    "answers": 0,
    "views": "122",
    "tags": [
        "debugging",
        "radare2",
        "gdb",
        "debuggers"
    ],
    "user": "Ricardo",
    "time": "Apr 7, 2019 at 17:57",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "how does the additional code loaded and/or executed? What about putting a breakpoint there and follow the execution?\n",
            "time": null
        },
        {
            "user": "Ricardo",
            "text": "Let's say is a Firefox plugin... I don't know where to put a breakpoint in Firefox. With Hopper I would open the plugin set the breakpoints (to the plugin) then in the debugger options instead of execute the plugin a execute Firefox then the program stop when gets to the plugin breakpoint\n",
            "time": null
        },
        {
            "user": "Ricardo",
            "text": "@PawełŁukasik any other info i can give you. Looks like you know a lot about radare2. I would appreciated a lot\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "it would be great if you would have a specific example (code) for someone (not only me) to try and see the issue and propose a solution. I don't have that much time and preparing something from scratch and then seeing that it might not be exactly what you wanted is a potential stopper for me.\n",
            "time": null
        }
    ],
    "answers_data": []
}