{
    "title": "Help determining pinout for communications port",
    "link": "https://reverseengineering.stackexchange.com/questions/21116/help-determining-pinout-for-communications-port",
    "content": "I have a Panasonic air conditioner that has a header on the mainboard that various optional (expensive) addon communications modules can connect into eg wifi\nThe unit is a Panasonic Split system from the CU/CSZ20TKR range (however this connector is common across many of the panasonic series)\nI am wanting to see if I can connect to this port and control it over serial or similar once I determine what protocol it is using. RS232?, RS485?\nI have been trying to determine what protocol this port uses to communicate with the addon modules that can be plugged into it and what the correct connections are. Once I have determined the correct pins and protocol I should be able to write a script that will do the communication. \nI have done some research and probing with multimeter (I don't have an oscilloscope currently) and located a circuit diagram for the header on the mainboard,\nWhat i have determined so far:\n\nPin 1 5v\nPin 2 5v\nPin 3 5v\nPin 4 12v\nPin 5 Gnd\n\n\nSome of the modules available to plug into this port are:\n\nCZ-TACG1 Wifi kit: http://www.panasonic.hk/usm.ashx/e/7zt1rwYXAiWEX1X3Hkyy9Naxy7NSnBFA89YBELQe-2L0J2RMcxQSCsgXytHbtm7ZBFLpQZ8phzb451XTOV_fX3-xb7Vrxt1ft7KR-ODzZh6hNYcPgXEggCffw1CXZUluSh5e~UC~0Hc00GxCOL1ctdmAe6NNFvzxYL30cW-4zk8o/CZ-TACG1-WiFi-adapter-users-maunal.pdf\nIntesisBox PA-AC-BAC-1: https://www.intesisbox.com/intesis/product/media/intesisbox_pa-ac-bac-1_installation_manual_en.pdf?v=2.1\nPanasonic PAW-SERVER-PKEA -\nhttps://www.panasonicproclub.com/uploads/IE/catalogues/II_PAW-SERVER_PKEA_v44_EN_2013.pdf\n",
    "votes": "3",
    "answers": 1,
    "views": "562",
    "tags": [
        "serial-communication"
    ],
    "user": "Andrew B.",
    "time": "Apr 11, 2019 at 4:57",
    "comments": [
        {
            "user": "Chris Stratton",
            "text": "You'd have a lot more luck if you had one of the options and could plug it in while watching with a scope or a cheap logic analyzer (be mindful of course of making any electrical connection to line powered appliances - you don't know that the low voltage internals are not riding on lethal mains voltage!). The two signals with the 10K pullups could be an I2C bus but the PAW-SERVER doc implies they are a distinct transmit and receive.  Maybe you'll be lucky and those, or the one with no components will see some \"is anything there\" polling during startup.\n",
            "time": null
        },
        {
            "user": "Andrew B.",
            "text": "Thanks for the advice, I have a logic analyzer on order. It would be great if I could get one of the devices, but they are out of my budget for now.\n",
            "time": null
        },
        {
            "user": "Andrew B.",
            "text": "Not sure if this helps, I have received the cheap logic analyzer and attached to the 3 5v lines. There does appear to be something being output when the device is powered on and also continuously while the device is on and in standby i.imgur.com/Pmi1rC3.png\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I think the pinout is the following according to Server Back-Up PC Board manual:\n",
            "votes": "1",
            "user": "ttt",
            "time": "Apr 15, 2021 at 8:52",
            "is_accepted": false,
            "comments": []
        }
    ]
}