{
    "title": "How can I follow virtual function calls in IDA?",
    "link": "https://reverseengineering.stackexchange.com/questions/21201/how-can-i-follow-virtual-function-calls-in-ida",
    "content": "I'm trying to reverse a video game that was made with the CryEngine 5 game engine. CryEngine 5 source code is available on GitHub, so I can look at the CryEngine source code and cross reference with the game in IDA to find a lot of information.\nHere is a snippet of code from the CryEngine source code:\n\nAs you can see, there is a class called ISystem, and it has a virtual method GetIPhysicalWorld which is being called. I have found the same virtual function call in IDA within the specific game that I'm trying to reverse:\n\nMy question is: in IDA, how can I find the address of the virtual function that is being called (GetIPhysicalWorld)? Also, how can I find the vtable of the ISystem class in IDA?\n",
    "votes": "0",
    "answers": 1,
    "views": "3k",
    "tags": [
        "hexrays"
    ],
    "user": "psyfl",
    "time": "Apr 22, 2019 at 18:54",
    "comments": [
        {
            "user": "Biswapriyo",
            "text": "Try to import the header file of that class. There may be some inheritance (512/8 is big). this and this may help.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "How can I find the address of the virtual function that is being\n  called (GetIPhysicalWorld)?\n\nI guess you want to do that statically? If so, you first need to identify how the object was allocated to find the call of the constructor. In this case, since there's a <pre><code>g_</code></pre> prefix, I assume this is a global object. The constructor is called by <pre><code>_initterm</code></pre> and `dynamic initializer for ...', you can find it using the xref. You should see something like this (it could be located inside a sub function):\n<pre><code>lea rcx, <vtable>\nmov [obj], rcx\n</code></pre>\nAnd a call to <pre><code>atexit</code></pre>.\nOnce you have the <pre><code>vtable</code></pre>, simply do the math. :)\n\nAlso, how can I find the vtable of the ISystem class in IDA?\n\nYou can try to use <pre><code>class informer</code></pre> plugin. It'll give you the name of the class and its virtual methods. However, you won't have the name of methods since this information is lost during compilation(, unless you have symbols).\nSince you have the source, you can also try to generate code signature (<pre><code>FLIRT</code></pre> or <pre><code>Rizzo</code></pre>) to retrieve the names.\nIf you want to rename the offset during the call, this is a different problem. You have to create a new structure. I don't think IDA support parsing of C++ class, you can either transform the C++ class to a C structure or script it.\n",
            "votes": "1",
            "user": "wisk",
            "time": "Apr 22, 2019 at 13:42",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Avery3R",
                    "text": "<span class=\"comment-copy\">Class informer is no longer needed. IDA 7.x has native support for RTTI.</span>",
                    "time": null
                },
                {
                    "user": "Trass3r",
                    "text": "<span class=\"comment-copy\">The comments it inserts are still useful and it also recognizes global constructors in addition.</span>",
                    "time": null
                }
            ]
        }
    ]
}