{
    "title": "Help reverse engineering a small (60kb) .exe file used for extracting .tga images from a custom container",
    "link": "https://reverseengineering.stackexchange.com/questions/21228/help-reverse-engineering-a-small-60kb-exe-file-used-for-extracting-tga-image",
    "content": "The executable grabs the specified container format and extracts .tga images from it. It was community-made to satisfy a certain niche, unfortunately I cannot get into contact with the original creator/programmer and I have no way to re-compile the .tga images to the original container. Basically I want to reverse the procedure.\nI'm not overly familiar with SE, if this post is considered low-effort or anything, please let me know and I will edit accordingly.\nEdit:\nGoogle Drive: https://drive.google.com/drive/folders/1_mdCW5w3GS7fXgSuISOlUDumLXeKJ9TE?usp=sharing\nIn the provided link the included files are\n1) the extractor\n2) one of the .mda containers\n3) a .bat file that is used to make the extractor run. Will be edited later on to batch extract all the containers.\n",
    "votes": "0",
    "answers": 0,
    "views": "113",
    "tags": [
        "disassembly",
        "windows"
    ],
    "user": "Ligkonakos",
    "time": "Apr 28, 2019 at 10:49",
    "comments": [
        {
            "user": "Bruce Abbott",
            "text": "\"I have no way to re-compile the .tga images to the original container. Basically I want to reverse the procedure.\" - Images don't get 'de-compiled' or 're-compiled'. Exactly what do you want to do?\n",
            "time": null
        },
        {
            "user": "Biswapriyo",
            "text": "Provide the binary file link if you can or allowed.  And yes, show us some effort.\n",
            "time": null
        },
        {
            "user": "Ligkonakos",
            "text": "@BruceAbbott Sorry for the misunderstanding, I'm new to the whole scene of file development and the sort. Basically, there is an .mda container containing 8-12 .tga images that form an animation that is used on a certain graphical engine. I have the original extractor to extract said images, but I have no way to arrange them in an .mda container that is readable by said engine. On the last paragraph you will find the link to the Google Drive with the extractor and an example .mda file. I have also included a .bat file which is used in-conjunction with the extractor to make it run.\n",
            "time": null
        },
        {
            "user": "Ligkonakos",
            "text": "@Biswapriyo I will provide the link to the google drive below. Details about a better explanation was made to my previous comment to Bruce Abbott.  Google Drive: drive.google.com/drive/folders/…\n",
            "time": null
        },
        {
            "user": "Johann Aydinbas",
            "text": "I had a look at the binary and it seems really simple. Googling for a string found in there I found this: forum.xentax.com/viewtopic.php?t=9598 - someone else (or you?) also looking for a tool to create .mda files from .tga - and the top post gives a rough file format description. Do you need help with the problem or someone to do the whole thing? If it's the latter this SO is the wrong place I'm afraid.\n",
            "time": null
        }
    ],
    "answers_data": []
}