{
    "title": "How can I extract resource images from Visual Basic 6 Malware",
    "link": "https://reverseengineering.stackexchange.com/questions/21271/how-can-i-extract-resource-images-from-visual-basic-6-malware",
    "content": "I am reverse engineering some malware that is written in VB6. I found this tool which tried to decompile the .exe, but I noticed that the image that is being loaded by the .exe is suspicious and I want to extract it for further analysis.\nSomeone mentioned resource extractor would work, but that only pulls the ICON from the file, not the image below. \nIs there a technique or tool that will extract this image?\n\nHere is some somewhat related topics that have brought me thus far. \nHow to disassemble VBX files?\n",
    "votes": "1",
    "answers": 0,
    "views": "292",
    "tags": [
        "malware",
        "visual-basic",
        "pe-resources"
    ],
    "user": "LUser",
    "time": "May 4, 2019 at 15:05",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "If this tool provides any info about the offset(there are some that looks like that in the bottom two) at which this \"image\" is located you can just write a simple script that will copy bytes from that offset and save them into a separate file.\n",
            "time": null
        },
        {
            "user": "LUser",
            "text": "Yeah I might have to do that. I would like to avoid it though . I dint think this tool tells this information though. The pro edition of this tool allows swapping of images so maybe I can swap images and the do a bindiff... Just thinking though.\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "I would say this way is preferred. You don't know what kind of processing the tool might do when extracting the bitmap.\n",
            "time": null
        },
        {
            "user": "LUser",
            "text": "I just need to find the image point if it is an image or posing as one\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "it's a common practice to hide some code this way only xor'ed with a key.\n",
            "time": null
        }
    ],
    "answers_data": []
}