{
    "title": "Determine what architecture a piece of shellcode targets",
    "link": "https://reverseengineering.stackexchange.com/questions/21507/determine-what-architecture-a-piece-of-shellcode-targets",
    "content": "After some personal research I didn't find any possible way or a paper to explain how to determine what architecture a given piece of shellcode may targets. The only obvious way I found would be to disassemble it for various architectures and check for which one of those the assembly code makes any sense. But this way demands that an actual person has to study the assembly code every time. So is there any other way that we can use to be certain that a piece of shellcode targets a certain architecture? Thank you in advance!\n",
    "votes": "2",
    "answers": 0,
    "views": "190",
    "tags": [
        "disassembly",
        "assembly",
        "malware",
        "shellcode"
    ],
    "user": "game0ver",
    "time": "Jun 18, 2019 at 16:45",
    "comments": [
        {
            "user": "0xec",
            "text": "A possible way can be to train neural net on various pieces shellcode classifying them as per their architecture. There are some research paper based on this idea.\n",
            "time": null
        },
        {
            "user": "camp0",
            "text": "You can check shell-storm.org/shellcode and take some of the samples that they have and see the differences, you can see that some of them are easy to spot.\n",
            "time": null
        },
        {
            "user": "game0ver",
            "text": "@camp0 yes that would work but that's what I'm trying to avoid. I'm looking for a general and automatic way to do that!\n",
            "time": null
        },
        {
            "user": "game0ver",
            "text": "@0xec that sounds very interesting, could you please provide some links to such papers?\n",
            "time": null
        },
        {
            "user": "0xec",
            "text": "Recognizing Functions in Binaries  with Neural Networks and Neural Nets Can Learn Function Type  Signatures From Binaries\n",
            "time": null
        }
    ],
    "answers_data": []
}