{
    "title": "Is miasm working on 64bits architecture? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/2152/is-miasm-working-on-64bits-architecture",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI am trying to use Miasm to reverse some binaries in i386 and amd64 instruction sets, but I encounter a few problem when using it.\nFirst, the installation phase went nice. I managed to install <pre><code>tinycc</code></pre> with the small modification of the <pre><code>Makefile</code></pre> and the installation script did not complain.\nBut, once I tried to use the script <pre><code>miasm/example/disas_and_graph.py</code></pre>, the CFG stop suddenly shortly after the entrypoint.\nStrangely, I installed Miasm on a 32bits virtual machine and it worked fine and displayed the whole CFG properly. So, did I miss something about a restriction or a bug on amd64 architecture ?\n",
    "votes": "2",
    "answers": 1,
    "views": "216",
    "tags": [
        "amd64"
    ],
    "user": "perror",
    "time": "11 years ago",
    "comments": [
        {
            "user": "asheeshr",
            "text": "This question appears to be off-topic because it is a bug report about a specific software package.\n",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "I undeleted and closed this because such posts can act as signposts for new users to the community to understand the scope of what we cover. My personal opinion is that deletion of posts should be restricted to only actively bad content such as spam, or very low quality content. This, however, is a good quality question and answer, albeit off-topic.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Ok, I had a few e-mails with Fabrice Desclaux (aka serpilliere), one of the main contributor of miasm.\nIn fact, miasm (version 1) cannot disassemble amd64 opcodes (but do not issue any error if such executable is encountered). What is really misleading, is that the elf-64 is handled but the disassembler fail to recognize the amd64 opcodes.\nSo, this behavior is \"normal\" even if no error message is issued.\nThe good news, is that the main contributor of miasm is working on a second version of the software (<pre><code>miasm2</code></pre>) which is handling amd64 (and with a lot of new features).\n",
            "votes": "1",
            "user": "perror",
            "time": "May 31, 2013 at 22:38",
            "is_accepted": true,
            "comments": []
        }
    ]
}