{
    "title": "How to create executable (create build) from original decompiled exe?",
    "link": "https://reverseengineering.stackexchange.com/questions/21548/how-to-create-executable-create-build-from-original-decompiled-exe",
    "content": "I have reverse engineered exe file using pyinstxtractor.py script.\nThere were around 1120 files in PYZ archive.\n<pre><code>F:\\Python Test>python pyinstxtractor.py test.exe\n[*] Processing test.exe\n[*] Pyinstaller version: 2.1+\n[*] Python version: 27\n[*] Length of package: 4992914 bytes\n[*] Found 11 files in CArchive\n[*] Beginning extraction...please standby\n[+] Possible entry point: pyiboot01_bootstrap\n[+] Possible entry point: pyi_rth_multiprocessing\n[+] Possible entry point: pyi_rth_pkgres\n[+] Possible entry point: pyi_rth_win32comgenpy\n[+] Possible entry point: pyi_rth__tkinter\n[+] Possible entry point: gui\n[*] Found 1120 files in PYZ archive\n[*] Successfully extracted pyinstaller archive: test.exe\n\n</code></pre>\nI have found the entry point that is gui file , and decompiled that file to source code after update of header bytes in hex editor.\nNow my question is when i try to repack using this command\n<pre><code>pyinstaller gui.py \n</code></pre>\n, the resultant exe doesn't have those 1120 files in its PYZ archive ( becoz i again extracted the contents of my final exe file).\nHow can i embed that PYZ folder into this exe?\n",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "python",
        "exe"
    ],
    "user": "RS Gamer",
    "time": "Jun 25, 2019 at 18:01",
    "comments": [
        {
            "user": "RS Gamer",
            "text": "My question is similar to this one : stackoverflow.com/questions/45074603/… but it doesn't solve the problem. Any pointers help will be appreciated.\n",
            "time": null
        },
        {
            "user": "0xec",
            "text": "There's pyinstaller exe rebuilder for this exact task. However its out of date and may not work.\n",
            "time": null
        },
        {
            "user": "RS Gamer",
            "text": "I did try Pyinstaller Exe Rebuilder but it gives error as: Failed to load Test.exe. It is not a pyinstaller exe.  Source code says:  # Python bytecode 2.7 (62211) # Decompiled from: Python 2.7.16 (v2.7.16:413a49145e, Mar  4 2019, 01:30:55) [MSC v.1500 32 bit (Intel)]  Admire your work at  tuts4you.com/e107_plugins/download/download.php?view.3541 Rest of steps are working fine, to get to code from exe; but i am facing problem while generating exe file.\n",
            "time": null
        },
        {
            "user": "RS Gamer",
            "text": "I have also installed other dependencies like pip install Pillow pip install opencv-python pip install rsa pip install pycryptodome pip install filedict pip install pywin32 pip install python-telegram-bot  When i compile with this ```\n",
            "time": null
        },
        {
            "user": "0xec",
            "text": "One thing you can try is compile to <pre><code>gui.py</code></pre> to pyc, and check its size. If its smaller than the original <pre><code>pyc</code></pre> you can replace the corresponding bytes in the exe.  However its a bit more work as pyinstaller stores the pyc, zlib compressed. You have to edit the pyinstxtractor script and comment out the statements which does the zlib decompression Line 239: <pre><code>if entry.cmprsFlag == 1:</code></pre>. So original <pre><code>gui.pyc</code></pre> get replaced with your modified pyc. Do note that both have pyc header removed and are zlib compressed.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You cannot simply make pyinstaller gui.py. You should resolve all dependencies: or installing packages using pip, or pulling them from extracted PYZ archive folder. In the PYZ folder you can find all files, but you need to rename it and rearrange to modules.\n",
            "votes": "1",
            "user": "van9petryk",
            "time": "Jan 13, 2020 at 11:32",
            "is_accepted": false,
            "comments": [
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">Hi van, and welcome to RE.SE! Although your answer does seem to cover most of the question, I think it could quite benefit additional information and details, if you feel like doing that. Regardless, thanks for sharing your knowledge and I hope we see you more :)</span>",
                    "time": null
                }
            ]
        }
    ]
}