{
    "title": "Downgrade HTTPS (strip SSL ) to HTTP on Windows (if possible) [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/21649/downgrade-https-strip-ssl-to-http-on-windows-if-possible",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 5 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nLong Question: I have an Android app: https://transfer.sh/mY240/com.phonegap.voyo.apk\nwhich connects to an API: http://www.24ur.com/lbin/WebApp/Popplus/Android.php\nthe problem is the api authors are now forcing everyone (with 302 redirect) to connect to https version of that endpoint (the endpoint is used by the new app so it still works) the problem is that they use TLS1.2 which Android 4.0 doesn't support (I think you have to enable it but I am not sure how to do that in an app that I did not write (I can dissasemble/reassemble the app so changing endpoints in it is not a problem, but enabling TLS1.2?))\nend the new app requires Android 5 or later so if I want to use the service which I pay for (Voyo) I have to eather upgrade my tabled (which I don't want to do) or downgrade HTTPS to HTTP so my android 4.0 will be able to connect to the API endpoint again\nShort question: How to strip SSL on Windows so non-https clients (my old android 4.0 ICS tablet) can connect to the HTTPs service again?\nThanks for Anwsering and Best Regards\n",
    "votes": "1",
    "answers": 0,
    "views": "160",
    "tags": [
        "windows",
        "android",
        "proxy"
    ],
    "user": "user3368585",
    "time": "5 years ago",
    "comments": [
        {
            "user": "peter ferrie",
            "text": "I'm voting to close this question as off-topic because this is not related to reverse-engineering but rather software operation.\n",
            "time": null
        },
        {
            "user": "user3368585",
            "text": "so which stack exchange should I post it to then? It kinda is reverse engeneering as I would like to turn on TLS1.2 on an app that I didn't write\n",
            "time": null
        }
    ],
    "answers_data": []
}