{
    "title": "Can a device be forced to stop using SSL? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/21647/can-a-device-be-forced-to-stop-using-ssl",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 5 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nLately I’ve become interested in reverse-engineering the APIs used by the Nintendo Switch Online (NSO) services (especially to see if it would be plausible for me to access their Mario Maker 2 API directly due to the lack of a bookmark site) and have been looking for various methods to access the original requests sent.\nThe first thing I did was fire up Fiddler to try and read the requests. Obviously, they were sent using HTTPS and there is no reasonable way (that I can find) for me to get the Switch to trust my computer without hacking the Switch (ultimately banning me from the very services I’d like to examine, according to most hacking guides).\nI was ready to give up when I stumbled upon this post on the GBATemp Forums about someone else attempting to read traffic (except from a 3DS), where one member brought up that there are:\n\nvarious tools and methods created to force devices to stop using SSL without access to them at all\n\nDo such tools/methods actually exist that would force my Switch to send plaintext requests that I could read from my proxy? Otherwise, is there anything else I’m not seeing here?\n",
    "votes": "3",
    "answers": 0,
    "views": "87",
    "tags": [
        "networking"
    ],
    "user": "JBagel",
    "time": "5 years ago",
    "comments": [
        {
            "user": "Avery3R",
            "text": "I'm voting to close this question as off-topic because this question is about network security, not reverse engineering\n",
            "time": null
        }
    ],
    "answers_data": []
}