{
    "title": "Dumping and reprogramming the firmware of DarenWaves",
    "link": "https://reverseengineering.stackexchange.com/questions/21661/dumping-and-reprogramming-the-firmware-of-darenwaves",
    "content": "I have the following blue color lamp that can move, play music and do a few other things.\n\nI'm quite sure it has a Firmware and it's reprogrammable. I'm looking for guidance on where should I look for it and how to do it. Here is a picture of the mainboard.\n\n\nThe chips on the board are:\nIC 1 says:\n74HC4051D\n?85HYC06D\n?UnG1336L\nProbably an 8 Channel Analog Multiplexer\n\nIC 2 says:\n8002B\nCG0920F\nProbably Audio Power Amplifier\n\nAnd IC 3 which don't have any writing on it. This one seems like the MCU.\n\nDoes anyone see a UART, JTAG or SPI on the board and could guide me on how to find and connect to it?\nBackside pictures:\n",
    "votes": "1",
    "answers": 1,
    "views": "161",
    "tags": [
        "hardware"
    ],
    "user": "Pagefault",
    "time": "Jul 15, 2019 at 15:01",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "Any markings in the other side?\n",
            "time": null
        },
        {
            "user": "Pagefault",
            "text": "The other side of the board or the other side of the Chip? I will have to unsolder it to check.\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "The other side of the board. I doubt chip will have any markings on the bottom.\n",
            "time": null
        },
        {
            "user": "Pagefault",
            "text": "Yeah, that sounded a bit strange. The other side of the board doesn't have much writing. I'll add more pictures to the original post.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Not likely to have a programming port on this class of device. Chances are it's a Chinese 8051 or PIC clone, possibly OTP or mask ROM, probably read protected so getting firmware out it may require 'decapping' the package and probing directly onto the chip (not practical for an amateur, and risks destroying the chip). \nSome older MCUs can be broken into with simple non-destructive techniques. But first you need to know which MCU you have. Trace out the circuit and try to figure out the function of each pin. Then match it up with known MCUs that have the same number of pins. The package shape (size and position of the 'pin 1' dot etc.) can also be a clue. You could remove the chip from the board and look on the underside for markings, but this may not tell you much.\nHaving a full understanding of the circuit and how it operates could allow you to develop your own code for another MCU (bonus if it has the same pinout and can be a drop-in replacement). You may find this is quicker, easier, and more enjoyable than a (probably futile) attempt to extract and reverse-engineer the original firmware.\n",
            "votes": "2",
            "user": "Bruce Abbott",
            "time": "Jul 14, 2019 at 3:38",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Pagefault",
                    "text": "<span class=\"comment-copy\">+1 I've traced most of the connections already, so I guess I'll do that. Thanks.</span>",
                    "time": null
                }
            ]
        }
    ]
}