{
    "title": "How to wire up a rotary encoder with a \"0v\" connection?",
    "link": "https://reverseengineering.stackexchange.com/questions/21913/how-to-wire-up-a-rotary-encoder-with-a-0v-connection",
    "content": "I have a servo motor with rotary encoder salvaged from an old scanner. I'm trying to figure out how to re-use it in a DIY CNC machine.\nBy reading through the engineering manual from the original device (Hooray for  uncle Google!) I have established that the servo was run on PWM'ed 24.5v DC and the encoder was run on 5v DC. The power supplies were on the same board, but the voltages were generating from separate transformers. (I am in NZ, so it is 230v 50Hz mains here.) Regretfully I do not have the original mainboard/motherboard so I cannot trace any circuits that the encoder once ran to.\nThe wiring is run from a parallel port connector up to the motor and the encoder - but the servo lines and the encoder lines are run in separate, independently 'screened' cables inside the outer cable liner. So it's two bundles, each with a metal woven tube around them and plastic over that, traveling inside the same larger diameter plastic outer sheath.They emerge from the outer sheath about 200mm from the servo and encoder and finish the distance as independent cables.\nAside from figuring out a drive for the servo, I have to figure out how to read the encoder. I sort of understand the basics of how it works, with +/- A and +/- B and +/- index... those will tell me the 'start' point (indexes) and the pulses to count. I think. But that there are chips on the encoder  weirds me out... but that's not this question.\nDue to my embarrassingly low level of electronics knowledge I'm stuck on the fact that it has something called \"0v\" (on pin 20 of the pinout below), AND it has a ground through the mesh cable liner.\nSo, if anyone can, please let me know how I can safely wire and power up the encoder to to begin looking for signals on the other wires. \nIf \"0v\" is really separate and different from GND, then please include how I might create a \"0v\" from any of the many power supplies I have around. I've played with so many PSUs and other power bricks, but have never seen this 0v thing?\nI am posting pictures of it and also the only reference I have for the pinout of the connector. Thanks in advance.\n",
    "votes": "0",
    "answers": 2,
    "views": "772",
    "tags": [
        "hardware",
        "encodings"
    ],
    "user": "111936",
    "time": "Aug 19, 2019 at 7:41",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "I think this might be better suited for Electrical Engineering SE, we don’t do much electronics here...\n",
            "time": null
        },
        {
            "user": "111936",
            "text": "But they say questions like this are about reverse engineering and tell me to come here.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There are two possibilities:\nYour GND is actually safety ground. Which is usually used when electronics (or motor) is directly (without transformer) connected to 120/230V electrical grid.\nOther reasons is that motor need high current which introduce voltage drop and electrical noise on power supply lines. This could glitch or damage encoder. This problem can be solved by separating power supply for power and logic circuits. In your case you should use different power supply for encoder (pin 7 and 20 and its outputs) and Brush servo phase pins (if you will use them).\nI would say option 2 is more likely, but cant be sure your pictures.\nEDIT:\nIf your mesh in cable is actually connected to pin 21 or 22 then it is screen to prevent electrical interference, in that case it should be connected to appropriate GND at one (and only one) point.\n",
            "votes": "1",
            "user": "Rok Tavčar",
            "time": "Aug 19, 2019 at 7:42",
            "is_accepted": true,
            "comments": [
                {
                    "user": "111936",
                    "text": "<span class=\"comment-copy\">Added info to the question re: voltages.</span>",
                    "time": null
                },
                {
                    "user": "Rok Tavčar",
                    "text": "<span class=\"comment-copy\">@111936 You mention that only DC is used so in that case option 1 isn't relevant to you.</span>",
                    "time": null
                },
                {
                    "user": "111936",
                    "text": "<span class=\"comment-copy\">Great info, but to the question - what do I do about that \"0v\"? Treat it as GND_AKA_5vReturn_aka \"-\" on the 5v circuit? And send the mesh GND to actual case GND?</span>",
                    "time": null
                },
                {
                    "user": "Rok Tavčar",
                    "text": "<span class=\"comment-copy\">@111936 0V is definitely return for 5V for encoders. If mesh is screen (for encoder) then it should be connect to 0V in one point. In other cases it should not be (if it is connected it wont damage encoders, but could glitch them). Point is that you should use separate power supply for logic.</span>",
                    "time": null
                },
                {
                    "user": "in70x",
                    "text": "<span class=\"comment-copy\">0v would be common ground. So I would imagine you wire it to ground.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Most of it is gibberish to me, but this page seems to mention that 0V pin is used as the base for the encoding output and is separate from the ground for the power supply.\n",
            "votes": "0",
            "user": "Igor Skochinsky",
            "time": "Aug 18, 2019 at 13:34",
            "is_accepted": false,
            "comments": []
        }
    ]
}