{
    "title": "Getting started with RE, with eventually goal being able to make a keygen [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/22008/getting-started-with-re-with-eventually-goal-being-able-to-make-a-keygen",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 5 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI want to get started in RE and eventually want to be able to figure out how to calculate a serial from a username/license number from program number, etc... (meaning the software tests the serial entered vs an algorithm-generated key resulting from another number or username that is entered).\n\nWhat is the best software for this? I feel I am most comfortable with x64dbg, but I heard IDA is better and OllyDbg seems to be the popular choice out there. What should I start with? Is x64dbg a \"fully-featured\" solution that will have everything I need?\nWhat is a good crackme (that comes with a walkthrough/solution) for just this sort of situation?\n",
    "votes": "1",
    "answers": 1,
    "views": "298",
    "tags": [
        "ida",
        "windows",
        "ollydbg",
        "x64dbg"
    ],
    "user": "McTimsky",
    "time": "5 years ago",
    "comments": [
        {
            "user": "julian",
            "text": "\"What is a good/the best XYZ ?\" - type questions are opinion-based and therefore not a good fit for this site. Many crackmes at crackmes.one are keygen-type challenges and have solution write-ups provided, so you can look at those if you like. You can also look through this list of crackme sites to find exactly what you are looking for.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "1) ollydbg and x64dbg are debuggers (with limited functionality to annotate knowledge).Their strength is dynamic reverse engineering.\nIDA and Ghidra are reverse engineering tools (IDA with some functionality for debugging). They are for static reverse engineering.\nBoth kinds of tools are useful, both have their places. Generally, the more complex a target is, the more you need IDA/Ghidra in addition to a debugger.\n2) I would actually start out by writing  your own crackme, starting close to „hello world“, and then gradually increasing the difficulty. First get to know the tools and concepts without additional complexity.\n",
            "votes": "0",
            "user": "manduca",
            "time": "Aug 30, 2019 at 19:40",
            "is_accepted": false,
            "comments": []
        }
    ]
}