{
    "title": "Ollydbg: How to set a conditinal breakpoint for a register gets special value",
    "link": "https://reverseengineering.stackexchange.com/questions/22036/ollydbg-how-to-set-a-conditinal-breakpoint-for-a-register-gets-special-value",
    "content": "I read this question about \"set conditional break point on a register value\" ; but its about setting a bp on special address!\nI want to set a bp when for example <pre><code>ECX == 12345678</code></pre> , i can do this on specific address with this condition , but i want do this on whole module, that when any where in a module <pre><code>ECX</code></pre> is equal to <pre><code>12345678</code></pre> , the debugger stops the procedure.\nIs there any solution for my question? Or is there any scripts that do the same thing i told?\n",
    "votes": "1",
    "answers": 2,
    "views": "1k",
    "tags": [
        "ollydbg",
        "breakpoint",
        "register",
        "ollyscript"
    ],
    "user": "Moshtaba",
    "time": "Sep 4, 2019 at 6:36",
    "comments": [],
    "answers_data": [
        {
            "content": "(Not exactly an answer but too long for a comment)\nThis sounds like a simple problem but technically it isn't! I'd like to explain why and how if there is a solution for it, it is probably going to be very very slow.\nA debugger does not actually know all the register values at every single point in the program. It doesn't know any register values until a debug break. So if any breakpoint triggers, it will be able to read those values and act on them (hence conditional breakpoints on a specific address).\nThat means if you want to know if a register has a certain value at any time during execution, you will probably have to single step the whole program. That is, execute one instruction, break, read values, execute one instruction, break, read values, ...\nThat's what a run trace usually does but I never used them due to speed. You may want to look around OllyDbg's trace features to see if it offers what you need but know it's probably going to be really slow.\n",
            "votes": "2",
            "user": "Johann Aydinbas",
            "time": "Sep 5, 2019 at 8:50",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "ctrl+t ->  Set Trace Condition\ncheckmark condition is true check box and enter the condition\nin your case ecx == 12345678\nand start tracing with either ctrl+f11 or ctrl+f12 \nsnap shot shows trace record for condition ecx == eip\n",
            "votes": "2",
            "user": "blabb",
            "time": "Sep 5, 2019 at 15:50",
            "is_accepted": false,
            "comments": []
        }
    ]
}