{
    "title": "IDA 7.0 (free) fails to load symbols with message \"DWARF: Cannot determine location of DWARF info\" during debugging",
    "link": "https://reverseengineering.stackexchange.com/questions/22181/ida-7-0-free-fails-to-load-symbols-with-message-dwarf-cannot-determine-locat",
    "content": "Here's the steps to repro. Just installed IDA (free) v.7.0 on a brand-new installation of Windows 10 (x64) in a VM:\n\nThen loaded a test PE file and started debugging it (using <pre><code>Local Windows Debugger</code></pre>):\n\nSo now I want to load symbols from the Microsoft server, say for <pre><code>ntdll.dll</code></pre> (or any other Windows module for that matter):\n\nThis fails with the following message in the output window:\n\n<pre><code>DWARF: Cannot determine location of DWARF info for \"C:\\Windows\\System32\ntdll.dll\".\nCould not load debug info for module: \"C:\\Windows\\System32\ntdll.dll\"\n</code></pre>\nAny idea what am I doing wrong?\n",
    "votes": "1",
    "answers": 2,
    "views": "2k",
    "tags": [
        "ida",
        "symbols",
        "debugging-symbols"
    ],
    "user": "c00000fd",
    "time": "Sep 24, 2019 at 19:45",
    "comments": [
        {
            "user": "Biswapriyo",
            "text": "IDA > File > Load file > PDB file...\n",
            "time": null
        },
        {
            "user": "c00000fd",
            "text": "@Biswapriyo oh, I see. Thank you. I also noticed that in the menu for that command, it says, <pre><code>\"... you can specify .dll or .exe. In that case IDA will try to find and load PDB specified in its debug directory.\"</code></pre> How do I configure that <pre><code>debug directory</code></pre>? I know in WinDbg one needs to provide a URL to Microsoft public symbols. Do I need to do the same for IDA?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I fixed it by\n\nSetting the environment variable\n<pre><code>_NT_SYMBOL_PATH=srv*c:\\pdb_cache*http://msdl.microsoft.com/download/symbols</code></pre>\nthen tick the \"auto load PDB files\" in Debugger Options\n",
            "votes": "2",
            "user": "0xC0000022L",
            "time": "Apr 6, 2021 at 7:10",
            "is_accepted": false,
            "comments": [
                {
                    "user": "c00000fd",
                    "text": "<span class=\"comment-copy\">That is really cool. I need to try it. One clarification: by setting an environment variable, do you mean in Windows?</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@c00000fd yes, this is a Windows environment variable. It also affects WinDbg, Visual Studio and other tools that make <i>some</i> use of the debug helper API to fetch symbols. You can fine-tune what location to use as cache and thereby keep your own local network share for your local symbols (e.g. of own products) but also consult the Microsoft servers and cache those symbols. If you have a VS subscription there's a chance you can also still access symbol packages for older Windows versions, if needed. But the symbol servers are reasonably fast, I find.</span>",
                    "time": null
                },
                {
                    "user": "c00000fd",
                    "text": "<span class=\"comment-copy\">@0xC0000022L I still can't make it work. Is there https btw?</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Don't think there are HTTPS URLs for the symbols, no. What exactly is it you can't make work?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "you must load pdb file when you pause this application, it must be paused state.\n",
            "votes": "1",
            "user": "boo",
            "time": "Jul 1, 2022 at 6:46",
            "is_accepted": false,
            "comments": [
                {
                    "user": "NirIzr",
                    "text": "<span class=\"comment-copy\">This looks like the start of a good answer but I feel it lacks some details and assumes a bit of knowledge that would better be explicit in the answer</span>",
                    "time": null
                }
            ]
        }
    ]
}