{
    "title": "Extracting instruction and operand information in IDA Python",
    "link": "https://reverseengineering.stackexchange.com/questions/22265/extracting-instruction-and-operand-information-in-ida-python",
    "content": "I am writing an IDA python plugin to identify the operands that are defined and used by every instruction. For now, I am using the canonical feature for an instruction to identify if an operand to the instruction is being used or defined. \nWhile it works for the most part, I'm not sure how to extract information for the following cases\n\nPush/Pop/Retn/Call instructions that modify/use <pre><code>esp</code></pre> \nCompare and branching instructions that modify the <pre><code>eflags</code></pre> registers\n\nI could write \"if\" conditions to handle these cases but I'm wondering if there is a better way to extract information.\nThanks\n",
    "votes": "2",
    "answers": 1,
    "views": "958",
    "tags": [
        "ida",
        "idapython",
        "idapro-sdk",
        "ida-plugin"
    ],
    "user": "Ranganatha Rao",
    "time": "Oct 8, 2019 at 0:08",
    "comments": [
        {
            "user": "Avery3R",
            "text": "For #1 are you just trying to figure out how much it changes the stack pointer by?\n",
            "time": null
        },
        {
            "user": "Vitalii",
            "text": "I think the only way is <pre><code>if</code></pre>. Personally me have some private IDA plugins for catching execution events (including memory or register modifications),and IDA doesn't have powerful enough command parser for that. IDA has not to have it actually. <pre><code>Capstone</code></pre> will unlikely help much here. <pre><code>if</code></pre> is your friend for this very specific tasks (i. e. detection of command that modifies anything as \"side effect\" not obvious from operands and opcode).\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I also had this question. The only solution I've found involves using the Capstone Python bindings in conjunction with IDA. The method call is <pre><code>regs_access</code></pre> https://www.capstone-engine.org/op_access.html\n",
            "votes": "2",
            "user": "Trey Keown",
            "time": "Oct 24, 2019 at 21:13",
            "is_accepted": false,
            "comments": []
        }
    ]
}