{
    "title": "How to change the title of a windows GUI app when patching? (the title that usually writes the application name)",
    "link": "https://reverseengineering.stackexchange.com/questions/22327/how-to-change-the-title-of-a-windows-gui-app-when-patching-the-title-that-usua",
    "content": "So I'm trying to patch a binary (its a GUI app), and i want to patch the title of it as well when I'm patching it, and by title i mean the text that appears on top of the app that usually is the application name\nHow can i achieve this? should i break on a certain API and modify it or...? (I'm using x32dbg but can use Olly as well), i know there might be many ways, but what is the most common way? i just want some lead to go after\nsorry if this is a newbee question, tried googling and came up with some windows APIs but don't know how to patch it to change the title, tried changing some of them but didnt work\n",
    "votes": "0",
    "answers": 1,
    "views": "2k",
    "tags": [
        "debugging",
        "ollydbg",
        "patching",
        "crackme"
    ],
    "user": "Mery Ted",
    "time": "Oct 17, 2019 at 5:32",
    "comments": [
        {
            "user": "Olvin Roght",
            "text": "Have you tried to scan app for text of window caption?\n",
            "time": null
        },
        {
            "user": "Mery Ted",
            "text": "@OlvinRoght yes but it has more than 200 occurances of the name of application (window caption) in strings search!\n",
            "time": null
        },
        {
            "user": "Remko",
            "text": "Can you share the binary?\n",
            "time": null
        },
        {
            "user": "Mery Ted",
            "text": "@Remko its IDM's main binary aka IDMan.exe, you can download it from their website (latest version) and obviously I'm doing this for learning reversing, not actually cracking the software\n",
            "time": null
        },
        {
            "user": "Remko",
            "text": "If it's a c(++) application, you can often change (static) window titles with a tool such as Resource Hacker, for Delphi with PE Explorer (or another tool that can edit the embedded DFM) etc. So a first step would be to determine what compiler/runtime was used...\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There Are many possible means to change Window caption   \neasiest of them being using a spy app like winspy and use the inbuilt functionality to change     \ntake a look at this answer i wrote a few days back  which shows how a title is change \nchange window title\nor if you prefer you can code a simple FindWindow() , SetWindowText() that can do the job\nyou can also break on wnd proc in ollydbg / x32dbg and code a detour to \nuse SetWindowText()\nusing ollydbg v2  (32 bit win 7 )\nopen calc.exe and hit f9 to run and f12 to break\nhit alt+w to open List Of Windows\nand locate the Window Handle of CalcFrame   As below\n<pre><code>List of windows, item 3\n  Handle = 000206C0  <<<<<<<<<<<<<<<<<<\n  Text = Calculator  <<<<<<<<<<<<<<<\n  Parent = Topmost\n  WinProc =\n  ID/menu = 0136046D (menu)\n  Type = UNICODE\n  Style = 14CA0000 WS_OVERLAPPED|WS_MINIMIZEBOX|WS_CAPTION|WS_SYSMENU|WS_VISIBLE|WS_CLIPSIBLINGS\n  ExtStyle = 00000100 WS_EX_WINDOWEDGE\n  Thread = Main\n  ClsProc = 00361EDE WndProc\n  ClsName = CalcFrame\n</code></pre>\nnow go to some blank space \ntype in a new title and note the address where you typed the title \ncode in blank space \npush offset the address you noted\npush window handle as found  above  {this is variable use what you find not what i type in demo}\ncall SetWindowTextA\nmake a note of existing  eip\nchange the eip to the newly patched in code\nstep three times \nand change back to the noted eip\n",
            "votes": "0",
            "user": "blabb",
            "time": "Oct 18, 2019 at 18:57",
            "is_accepted": true,
            "comments": []
        }
    ]
}