{
    "title": "How do I figure out the which CPU the Sony DPF C-1000 has?",
    "link": "https://reverseengineering.stackexchange.com/questions/2233/how-do-i-figure-out-the-which-cpu-the-sony-dpf-c-1000-has",
    "content": "Recently I received a Digital Photo Frame (Sony C-1000) and since I'll never use it as it is, I thought of playing with it and reprogram it. Anything like managing to print out to screen \"Hello world\" would be a win.  \nI'm trying to understand which CPU is used; next step would be how to access it. Any hint would be great, because I'm not experienced with hardware.\nI opened the device thinking I'd see the CPU, with its model written on top. I think I identified the processor, but the code written on its top did not help me.\nThanks for any pointers.\nOn top of what it looks like the CPU reads:\n<pre><code>G+ SPMF2892A M0023520 1124</code></pre>\nA piece that I could identify is the RAM:\n<pre><code>EtronTech EM639165TS-6G\nN48AG05AGB640.12ZQ</code></pre>\n",
    "votes": "6",
    "answers": 2,
    "views": "391",
    "tags": [
        "hardware"
    ],
    "user": "CuriousMind",
    "time": "Jun 12, 2013 at 2:08",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "What is written on top of it?\n",
            "time": null
        },
        {
            "user": "CuriousMind",
            "text": "@IgorSkochinsky I added info in the main post. Is it legal/allowed to post a picture of the circuit? If yes, I guess this might help.\n",
            "time": null
        },
        {
            "user": "cb88",
            "text": "@CuriousMind it is a SunPlus Multi Media SPMF-2800 ... shows up in a few forums and you can buy them on a few trade sites. Nothing on a datasheet for you but I highly suspect it is Arm.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Ok.. so here is what I gather. Which leads me to this GeneralPlus link.\nLooks like it has these interfaces: \nJPEG codec, 6-in-1 card I/F and digital panel I/F\nOn that generalplus page if you click on the title of the chip you get a blank frame. The source for that frame has a bit of content in it. After looking through the html code of thier site I found spec listings that failed get filled out as well as php generated datasheet download links that also are messed up.\nI imagine if you email them they might possibly send you the link worth a shot at least.\nbroken html 1\nbroken spec table\n",
            "votes": "4",
            "user": "cb88",
            "time": "Jun 11, 2013 at 22:34",
            "is_accepted": false,
            "comments": [
                {
                    "user": "CuriousMind",
                    "text": "<span class=\"comment-copy\">Thank you very much! It's going to be a long way (for me at least), but this is a good starting point.</span>",
                    "time": null
                },
                {
                    "user": "CuriousMind",
                    "text": "<span class=\"comment-copy\">Do you think theoretically it can be reprogrammed? Or the only way is to access it via JPEG inputs?</span>",
                    "time": null
                },
                {
                    "user": "cb88",
                    "text": "<span class=\"comment-copy\">oh its definitly an mcu I poked around the HTML of thier site a bit... its quite broken</span>",
                    "time": null
                },
                {
                    "user": "cb88",
                    "text": "<span class=\"comment-copy\">It looks like there is supposed to be downloads for the ROM and Datasheet... but well its borked.</span>",
                    "time": null
                },
                {
                    "user": "cb88",
                    "text": "<span class=\"comment-copy\">I think this is their email <a class=\"__cf_email__\" data-cfemail=\"e28592818d8687a285878c8790838e928e9791cc818d8f\" href=\"/cdn-cgi/l/email-protection\">[email protected]</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "From looking at firmware updates for some other Sony frames, the processor seem to be mostly 8051 derivatives. A couple of them expect files with names like <pre><code>ISP.vup</code></pre> and <pre><code>VISP.vup</code></pre>. You could try putting such files on a card and seeing if you can trigger the firmware update mode (but don't update it!). If this works, you can investigate the firmware update and try to write some simple code that would run instead.\n",
            "votes": "3",
            "user": "Igor Skochinsky",
            "time": "Jun 12, 2013 at 10:40",
            "is_accepted": false,
            "comments": []
        }
    ]
}