{
    "title": "J2ME games obfuscator - Spyro and Tekken 5",
    "link": "https://reverseengineering.stackexchange.com/questions/22429/j2me-games-obfuscator-spyro-and-tekken-5",
    "content": "While reversing some J2ME games like Spyro or Tekken 5 Mobile I have encountered a weird obfuscation where all fields, methods and classes have names like A, a, B, b, Aa, Bb etc.\nIt's really hard to read source code like that. Example method can look like this:\n<pre><code>     public static void a(final boolean b) {\n        f.b = b;\n        if (!b && f.a != null) {\n            try {\n                f.a.stop();\n            }\n            catch (Exception ex) {}\n            f.a = null;\n        }\n    }\n</code></pre>\nIs there a way to restore original names or at least make this code more readable? I would be grateful for any tips.\n",
    "votes": "1",
    "answers": 2,
    "views": "392",
    "tags": [
        "obfuscation",
        "java",
        "game-hacking"
    ],
    "user": "westman379",
    "time": "Oct 30, 2019 at 21:44",
    "comments": [
        {
            "user": "lordchrome",
            "text": "Do you still have tekken 5 java including spyro. I want to study each game and try to disect it like i'm doing with each tekken game. I know this is not the answer you wanted to here but I can't message you privately. You can email me at [email protected]\n",
            "time": null
        },
        {
            "user": "lordchrome",
            "text": "I might be able to help you. In order for me to do so I need to have the game so I can examine everything. I'll try my best to help you. Do you still have it by any chance?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "No there isn't. You'll have to assign meangingful names yourself while reverse engineering.\nJust be glad that even with names stripped, Java is far easier to reverse engineer than native binaries.\n",
            "votes": "3",
            "user": "Antimony",
            "time": "Oct 30, 2019 at 23:18",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "Maybe. If the Source File of the Classes are present you can reverse the Class names.\nUnfortunatly there are no ways to retrieve Methods and Fields names. The only thing that you can do for that is renaming the fields and methods with unique names to make the code more readable.\n",
            "votes": "1",
            "user": "Princekin",
            "time": "Oct 29, 2020 at 10:02",
            "is_accepted": false,
            "comments": []
        }
    ]
}