{
    "title": "x64dbgpy: application unresponsive when trying to automate inside breakpoint callback",
    "link": "https://reverseengineering.stackexchange.com/questions/22506/x64dbgpy-application-unresponsive-when-trying-to-automate-inside-breakpoint-cal",
    "content": "When a breakpoint callback is triggered trying to automate the debugger inside the callback causes the application to become unresponsive. <pre><code>x64dbg</code></pre> continues functioning but the application itself doesn't resume execution.\nThis is only happening when the functions are called inside the BP callback.\nScript:\n<pre><code>from x64dbgpy import *\n\ndef handle():\n    pluginsdk.Run()\n\n\nBreakpoint.add(0x81755, handle)\n</code></pre>\nCalling any function such as <pre><code>pluginsdk.StepOver</code></pre>, etc also causes the freeze.\nDoes x64dbgpy not support automating the debugger inside breakpoint callbacks? Or am I doing something wrong? Suggestions would be great.\n",
    "votes": "0",
    "answers": 1,
    "views": "231",
    "tags": [
        "binary-analysis",
        "python",
        "dynamic-analysis",
        "x64dbg",
        "automation"
    ],
    "user": "user3238415",
    "time": "Nov 11, 2019 at 9:43",
    "comments": [],
    "answers_data": [
        {
            "content": "Currently it is not supported to do debug automation in callbacks. This is related to the threading model and is further explained at https://x64dbg.com/blog/2016/10/20/threading-model.html, which links to some older resources.\nRecently there was an interesting development though, because it became possible to automate in the debug callbacks with x64dbg’s built in scripting language (which I do not recommend). The idea now is to port this idea to a C api, which can then be used by plugins like x64dbgpy or x64dbgPlaytime.\n",
            "votes": "1",
            "user": "mrexodia",
            "time": "Nov 12, 2019 at 4:50",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user3238415",
                    "text": "<span class=\"comment-copy\">Thank you for your answer and the work you do. Is there somewhere I can read about the recent developments? I looked around on GitHub but nothing stood out</span>",
                    "time": null
                }
            ]
        }
    ]
}