{
    "title": "Dumping USB firmware [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/22528/dumping-usb-firmware",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions asking for help reverse-engineering a specific system are off-topic unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem.\n\n\nClosed 5 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nHow do I dump the firmware of a USB stick? What are the steps and what tools do I need?\nI understand that I may have to take the USB stick apart.\n",
    "votes": "2",
    "answers": 1,
    "views": "838",
    "tags": [
        "firmware"
    ],
    "user": "Jason",
    "time": "5 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "Most USB sticks use a special-purpose microcontroller, most likely based on a 8051 core. To save costs and space, the board rarely includes a separate flash chip for the firmware, instead it is either written to the internal MCU flash, or, more commonly, to a reserved area of the main NAND storage. In the latter case you can try to dump the raw  NAND and look for the firmware there, but in the former it won't be possible. However, to save costs and increase rate of production and QA, the firmware is usually accessible via undocumented vendor-specific commands via USB. There are tools used for testing, configuration and firmware updates at each vendor and sometimes they leak. \nNote that these tools usually do not have 'get current firmware' functionality as this is not something they need during production, however most of them ether include full firmware updates or code snippets that are uploaded into the MCU's RAM to perform the more intensive testing or formatting procedures which are not necessarily included in the production firmware. If you analyze their working, you can probably upload a snippet which would dump the current firmware for you.\nFor the SD cards firmware (which have a similar situation), check investigation by bunnie and xobs from 30C3.\n",
            "votes": "4",
            "user": "Igor Skochinsky",
            "time": "Nov 13, 2019 at 11:26",
            "is_accepted": false,
            "comments": []
        }
    ]
}