{
    "title": "Deconstructing Unity games",
    "link": "https://reverseengineering.stackexchange.com/questions/22564/deconstructing-unity-games",
    "content": "Note: I only want to edit/mod the games not trying to steal things etc.\n\nI'm trying to deconstruct some Unity games from both PC and Android platforms and already extracted assets with uTinyRipper successfully, but having the some issues at the script part. \nWhat exactly should i do to export scripts correctly from a compiled Unity game to editor?\n\nFirstly I deobfuscate everything in data\\managed with de4dot\nSecondly I extract the code from these .dlls with dnSpy\nThen I import all the .cs files to Unity editor\nAfter that, Unity gives hundreds/thousands of errors, when i fix all of them, it gives another hundreds of errors. So it doesn't stop giving more errors.\n",
    "votes": "0",
    "answers": 0,
    "views": "2k",
    "tags": [
        "decompilation",
        "game-hacking"
    ],
    "user": "plzhelp",
    "time": "Nov 18, 2019 at 11:59",
    "comments": [
        {
            "user": "MazeGen",
            "text": "Do you have exactly the same Unity version that was used to build the game? Did you switch to the right platform in Build settings?\n",
            "time": null
        },
        {
            "user": "plzhelp",
            "text": "Yes i tried using the same version that was used to build the game. Hadn't touched build settings though\n",
            "time": null
        },
        {
            "user": "MazeGen",
            "text": "Have you tried building a Unity project and deconstruct the build back to Unity project? That could help you learn how to fix common issues.\n",
            "time": null
        },
        {
            "user": "plzhelp",
            "text": "Thats a very good idea, i will try that. Thanks\n",
            "time": null
        },
        {
            "user": "Avery3R",
            "text": "Does this answer your question? Recover source code for C# .exe\n",
            "time": null
        }
    ],
    "answers_data": []
}