{
    "title": "Cant see mnemonics on ollydbg 2.01",
    "link": "https://reverseengineering.stackexchange.com/questions/22586/cant-see-mnemonics-on-ollydbg-2-01",
    "content": "Im reverse engineering an exe, but i get locked on a specific location, i suppose this is a jump to the same location, when im on this \"obfuscated\" addresses i cant see any instruction, but the actions looks like be JMP and RDTSC.\nIts bad configured OllyDBG ?\nBug ?\nSome type of protection like VirtualProtect from MSDN ?\nIm using Windows 7 on VirtualBox.\n",
    "votes": "1",
    "answers": 1,
    "views": "111",
    "tags": [
        "x86",
        "assembly"
    ],
    "user": "deon cagadoes",
    "time": "Nov 20, 2019 at 23:47",
    "comments": [
        {
            "user": "blabb",
            "text": "7f fe is jg eip  if  either zero flag or signed flag is set /unset this  will keep on jumping to the same location  and also specify which version of ollydbg you are using 2 or1\n",
            "time": null
        },
        {
            "user": "deon cagadoes",
            "text": "@blabb yes i know, the opcodes are easy to get here ref.x86asm.net/coder32.html#x7F, but my question is why happens that, why doesn't show me the instructions, on some parts happen this and search instruction by instruction for 30000 lines its hard too. If i have instructions i can fully understand, but search by opcodes.. and the version used is 2.01, i wrote on title.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Sometimes OllyDbg analysis of the code is incorrect and it shows data bytes instead.\nThis may happen if the segment of code you are looking at has no direct call/jmp into.\nIf you right-click in the CPU window and select \"Remove analysis from module\" it will force everything in the disassembly window show as instructions.\n",
            "votes": "3",
            "user": "Yotamz",
            "time": "Nov 21, 2019 at 8:23",
            "is_accepted": true,
            "comments": []
        }
    ]
}