{
    "title": "CPU support by ghidra",
    "link": "https://reverseengineering.stackexchange.com/questions/22676/cpu-support-by-ghidra",
    "content": "Where can I see all the CPUs supported by Ghidra?\nDoes Ghidra support more CPUs than IDA Pro?\n",
    "votes": "7",
    "answers": 2,
    "views": "5k",
    "tags": [
        "ida",
        "ghidra"
    ],
    "user": "Ghji",
    "time": "Dec 6, 2019 at 8:06",
    "comments": [],
    "answers_data": [
        {
            "content": "The supported processors are listed in the publicly available source code on GitHub.\nGhidra and IDA Pro both support quite a wide variety of architectures and processors. It's hard for me to tell which one supports more, and I am not sure how meaningful that kind of comparison is. \nFor more information, see this presentation and associated materials:\nhttps://github.com/0xAlexei/INFILTRATE2019\nIt should be noted that adding support for a new processor in Ghidra can be done via Sleigh. Here is an example: Implementing a New CPU Architecture\nfor Ghidra\n",
            "votes": "5",
            "user": "0xC0000022L",
            "time": "Dec 6, 2019 at 9:18",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Quoting the Ghidra Wiki,\n\nWhat processors are currently supported?\nX86 16/32/64, ARM/AARCH64, PowerPC 32/64/VLE, MIPS 16/32/64/micro,\n  68xxx, Java / DEX bytecode, PA-RISC, PIC 12/16/17/18/24, Sparc 32/64,\n  CR16C, Z80, 6502, 8051, MSP430, AVR8, AVR32, and variants of these\n  processors.\n\nThe latest IDA pro supports more than 60 families of processors. IDA does seem to have the upper hand but that gap is quickly closing in as Ghidra being an open-source tool has the community support. IDA though closed source has been around for a longer time so you would also find plenty of user developed processor modules.\n",
            "votes": "4",
            "user": "0xec",
            "time": "Dec 7, 2019 at 11:03",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">The last sentence is not totally correct: there are plenty of user-developed processor modules for IDA</span>",
                    "time": null
                },
                {
                    "user": "0xec",
                    "text": "<span class=\"comment-copy\">@IgorSkochinsky Yes I'do agree with that. Updated the answer.</span>",
                    "time": null
                }
            ]
        }
    ]
}