{
    "title": "Trying to identify Renesas custom SoC through CPU die inspection",
    "link": "https://reverseengineering.stackexchange.com/questions/22744/trying-to-identify-renesas-custom-soc-through-cpu-die-inspection",
    "content": "Was wondering if someone could help me identify which series a Renesas Custom SoC belongs to within the super-H family by looking at optical images of the die circuitry layout of the device, and by reviewing the other documents. PDF of die analysis. (It's the part # R8A02021ABG) The device is mounted to a Roland GR-55 synthesizer, and what I'm trying to do is properly setup the unit's debugger so I can try to create simple patches for the firmware, like changing string names.\nSo far I've been able to identify that its a custom SoC by noticing that the unique part number which is written on the device is present in the die marking which is part of the metal layers. I was wondering if by looking someone could tell what functional blocks are on the die or the size of the memory/cache. I've identified it's in the super-H family by reviewing the GR-55 schematics\n (PG.34) and seeing the port for the E10A-usb debugger/emulator. Also when reviewing the schematics for other Roland devices that use the same custom SoC like the Roland aerophone ae10, and Jupiter 80, I could see the debug port was labled E10A-usb. E10a-usb supported devices.\nSo with this info gathered i'm still unsure which series it belongs to. Super-H series. I believe its most likely based off the SH-3-DSP or SH-4-DSP devices. I only say this because I know Roland is using DSP technology on the GR-55, and only devices in those series are using DSP. So from here I've been trying to see if there is a device in these series with a superset of features that are included in the GR-55 like DSP. I've also looked for A/D and D/A converters which the GR-55 states it has at 24 bit. (pg.3 GR-55 schematics) and none of the devices in this family have converters that go as high as 24 bit. when reviewing the schematics for the Roland Jupiter-80 I came across a note that looks like it states the clock speed of the custom SoC at 192MHz/64MHz but I don't know if it's stating the maximum clock speed or somthing els. I don't know how to interpret this note, and was wondering if someone could explain what it's saying. A similar note can be seen in the GR-55 schematics.  \nAlso I was wondering if it's common for debuggers to provide any info on the devices they're connected to. Maybe the E10A-usb emulator can provide some info on my device.\nsuper-H devices specifications\n",
    "votes": "4",
    "answers": 0,
    "views": "395",
    "tags": [
        "debugging",
        "hardware",
        "integrated-circuit"
    ],
    "user": "Dukes Mayonnaise",
    "time": "Sep 1, 2020 at 7:11",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "what is your final goal? This looks like an XY problem so far.\n",
            "time": null
        },
        {
            "user": "yaspr",
            "text": "forum.pianoworld.com/ubbthreads.php/topics/2385759/… - SH7700?\n",
            "time": null
        },
        {
            "user": "yaspr",
            "text": "SH 7727 if you check the OS :)\n",
            "time": null
        },
        {
            "user": "Dukes Mayonnaise",
            "text": "I have also previously reviewed that post. I think the website is stating the OS supports the SH 7727 but does't specify if that is the processor in the BK-9. I think μITRON supports all the processors in the 7700 series.\n",
            "time": null
        }
    ],
    "answers_data": []
}