{
    "title": "How did Kaspersky replicate UAC overlay on Windows XP [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/22785/how-did-kaspersky-replicate-uac-overlay-on-windows-xp",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 5 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nHow did Kaspersky replicate UAC overlay on Windows XP? Here is the screenshot to what I relate to, \n\nUpon encountering the overlay,\n\nIf you click outside the \"attention\" Window, system will beep and flicker the \"Attention\" window\nAll shortcuts, such as \"Win+R\", \"Ctrl+Shift+Esc\" or \"Ctrl+Q\" are disabled\n(seemingly) the system won't process on doing anything until you \"Continue\" or \"Cancel\"\n\nHere is how to replicate the behaviour,\n\nGet a Windows XP VM\nDownload Kaspersky suite compatible with XP. I worked on the following version, download\nInstall the app onto XP VM.\n[Possibly optional] After installation, request a trial licence\nGo to Settings (bottom-right corner) -> General (first tab) -> Protection - Untick . You should get the same Windows as in the screenshot\n",
    "votes": "1",
    "answers": 1,
    "views": "156",
    "tags": [
        "windows"
    ],
    "user": "TAbdiukov",
    "time": "5 years ago",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. SuRun is an open source application for a wide range of Windows versions and it does something similar. So you could inspect its source. It opens its settings dialog (or the prompt for credentials) on a separate desktop. This is meant to prevent other entities (such as certain window hooks) from having an effect. It's similar to the SAS desktop. But this doesn't appear to be about reverse engineering, does it?\n",
            "time": null
        },
        {
            "user": "TAbdiukov",
            "text": "@0xC0000022L misread your message initially, thanks for the heads-up\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Sounds like you want to reproduce a system modal dialog box on a more modern Windows OS. It looks like someone took the steps to reproduce this behavior as closely as possible. Not sure about keyboard accelerators, etc though.\nhttps://developex.com/blog/system-modal-back/\n",
            "votes": "2",
            "user": "Kurtis",
            "time": "Dec 20, 2019 at 0:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}