{
    "title": "I want to modify the data [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/22812/i-want-to-modify-the-data",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 5 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI am so newbie about this matter. \nI have a file XXXX.record file that contains a data. \nWhen I open the file \n\nHow can I read this data and modify the values? \nthanks.\n",
    "votes": "1",
    "answers": 1,
    "views": "68",
    "tags": [
        "debugging",
        "hex"
    ],
    "user": "jlc488",
    "time": "5 years ago",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. How did you get from your input (top) to the representation shown at the end of your question? Evidently you have more information than you are giving us. We need all the information we can get in order to help. Voting to close for now. Please edit your question to add those details and then vote to reopen. Thanks.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "The first line of your file contains device information - it seems you are reading HT DataLogger's data. From the quick glance, I conclude, this device measures temperature.\nSubsequent data looks like an array of floats - one can deduce it from <pre><code>41</code></pre>'s and <pre><code>42</code></pre>'s in each <pre><code>4</code></pre>-byte block (\"reasonable\" float numbers usually start with them when written in hex).\nTo read the data, just take any <pre><code>4</code></pre>-byte, block starting with an address divisible by <pre><code>4</code></pre> and use this site. However, as you may notice, the order of bytes in each <pre><code>4</code></pre>-byte block has to be different than just \"left to right\", that is, so-called big endian.\nKnowing that each number has to start with either <pre><code>41</code></pre> or <pre><code>42</code></pre> (otherwise resulting numbers would be too high or too low to reflect the temperature), you can conclude that, in  fact, number <pre><code>ABCD</code></pre> really means <pre><code>BADC</code></pre>, so it's little endian encoding with respect to each <pre><code>2</code></pre> bytes.\nFor example, if you want to decode <pre><code>01 41 33 33</code></pre>, you want to convert the number <pre><code>41 01 33 33</code></pre> to decimal format (that is ~<pre><code>8.075</code></pre> Celcius degrees).\nModifying data is rather straightforward - hex editors provide very easy way to do it; just highlight relevant bytes and start typing.\nEdit: it is also possible (and more likely) that the numbers are stored in little endian encoding, assuming that the first one begins at address <pre><code>0012h</code></pre>. In such a case, <pre><code>0x421</code></pre> (<pre><code>21 04 00 00</code></pre>) is probably the size of the float array.\n",
            "votes": "3",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": true,
            "comments": [
                {
                    "user": "jlc488",
                    "text": "<span class=\"comment-copy\">yes, you are correct. it is data from a device that measures temperatures and humidity. If I read the data using the viewer it shows excel results like that but I need to adjust certain values. I will follow and try with your instructions. Thanks a lot.</span>",
                    "time": null
                }
            ]
        }
    ]
}