{
    "title": "HIEW Sharing Violation On Edit",
    "link": "https://reverseengineering.stackexchange.com/questions/22881/hiew-sharing-violation-on-edit",
    "content": "I'm still very new to the whole reverse engineering field. I wanted to start learning by bypassing an activation code prompt. I found the line in OllyDbg, and moved the EXE to HIEW (Hacker Eye View) to crack it. However, whenever I press F3 in HIEW to edit, it says Sharing Violation. (R)etry (A)bort\nI've tried modifying the Security in the properties of the EXE I'm cracking, so that all users have full permissions. It didn't work.\nI've also tried running HIEW as admin, and still to no avail. Help!\n",
    "votes": "1",
    "answers": 1,
    "views": "223",
    "tags": [
        "ollydbg"
    ],
    "user": "ZyadS29",
    "time": "Dec 31, 2019 at 16:50",
    "comments": [
        {
            "user": "fpmurphy",
            "text": "Have you closed OllyDbg before attempting to open the executable in Hiew?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You're trying to save edits to a file that is already opened by another program - in this case, OllyDbg. In fact, not only is it open by OllyDbg, but it has a debugger attached. This is the same reason why when you are programming, you cannot edit source code and rebuild the same executable while it's being debugged; You have to stop debugging in order for the compiler to overwrite the output executable file. You need to kill the process in OllyDbg first, then you can patch the binary in a program such as Hiew, 010 Editor, HxD, and so on.\nThis is why Hiew gives you a \"Sharing violation\" - you're trying to share a resource between Hiew and the debugger when the debugger has priority already.\nAnother option is to make a copy of the executable, open one in the debugger, and then use that to reference when editing the second one. However, the copy opened in the debugger then will not reflect any changes you've made until you kill it and load the modified version.\n",
            "votes": "1",
            "user": "the_endian",
            "time": "Jan 3, 2020 at 21:09",
            "is_accepted": false,
            "comments": []
        }
    ]
}