{
    "title": "Is it possible to completely reverse this code?",
    "link": "https://reverseengineering.stackexchange.com/questions/22956/is-it-possible-to-completely-reverse-this-code",
    "content": "i have this code i'm trying to deobfuscate\nhttps://pastebin.com/g5mHpWE4\nI used\nhttps://beautifier.io/ and\nhttp://www.jsnice.org/\nbut the result is still not good, current code:\nhttps://pastebin.com/whfqanxx\nmuch remains coded\nexample: <pre><code>window [$ (\" 0x128 \")] [$ (\" 0x11 \")] [$ (\" 0x7 \")]</code></pre>\nIs it possible to leave this code 100% clean?\n",
    "votes": "1",
    "answers": 1,
    "views": "309",
    "tags": [
        "obfuscation",
        "deobfuscation",
        "javascript"
    ],
    "user": "Bruno Andrade",
    "time": "Jan 9, 2020 at 14:39",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "do you really need to make it clean or your goal is to understand the code?\n",
            "time": null
        },
        {
            "user": "Bruno Andrade",
            "text": "My goal is to understand the code but with it obfuscated I can not.\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "yes, I agree but to understand the code you don't need 100% cleanness.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Having such code the first thing to do is to analyze what part is the obfuscation algorithm and what's the actual code. Here' it's not that difficult as all the code is on top. So let's analyze it step by step:\n<pre><code>var norm = [\"cookie\", \"toUTCString\",...\n</code></pre>\ndefines an array with string that will be used in the application. Having them in an array and not in the code makes the code more difficult for human to understand but the machine will still managed to parse the code correctly. \nSo we have an array...\nWhat's next? Following the array there's this function\n<pre><code>(function(value, count) {\n var fn = function(selected_image) {\n   for (; --selected_image;) {\n     value[\"push\"](value[\"shift\"]());\n   }\n };\n fn(++count);\n})(norm, 144);\n</code></pre>\nWhat it does it creates a function that can shuffle an array and in the last line <pre><code>(norm, 144)</code></pre> it is being executed with our aforementioned array of strings and the constant value of <pre><code>144</code></pre> that will be used to count the number of rounds of the shuffling (<pre><code>+1</code></pre> -> <pre><code>fn(++count)</code></pre>). \nSo after this we no longer know the order of string in our defined array <pre><code>norm</code></pre>. In order to know it we would have to execute those two instructions (it might be dangerous if you don't understand what your are doing) or mimic similar behavior in another language and get the result. (<pre><code>[\"object\", \"exports\", \"./IPv6\",...]</code></pre>).\nSo now comes the third part of the obfuscation - this function:\n<pre><code>var $ = function(i, fn) {\n  i = i - 0;\n  var id = norm[i];\n  return id;\n};\n</code></pre>\nIt simply defines a function named <pre><code>$</code></pre> that, when passed an argument <pre><code>i</code></pre> returns the string from our shuffled array <pre><code>norm</code></pre>.\nNow comes the actual code part. Whenever you see code like this <pre><code>$(\"0x1b1\")</code></pre> you would have to replace it by running (or simulating) the call to function <pre><code>$</code></pre> with the argument and get the result. In this case it would be for <pre><code>0x1b1 = \"hxxps://www.bitonclick.com/jump/next.php?r=1967903\"</code></pre> (without xx - a proper address) and for example for <pre><code>$(\"0x114\") = \"FuckAdBlock\"</code></pre>. And so on...\nDoing this of all the calls you would get all of the code extracted, but going over this manually can be mundane and error prone so it would be nice to have some kind of automated way of performing this activities.\nDoing that (not even for the whole file) would allow to more easily understand the code but from parts of it, it looks like it might be injecting some ads on the page (it might not be the only purpose of it) - as one can see in the strings \"Ad\", \"FuckAdBlock\" and some <pre><code>iframes</code></pre>.\n",
            "votes": "3",
            "user": "Paweł Łukasik",
            "time": "Jan 13, 2020 at 7:56",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Bruno Andrade",
                    "text": "<span class=\"comment-copy\">Thank you so much this gave me a great insight into how everything works.</span>",
                    "time": null
                }
            ]
        }
    ]
}