{
    "title": "Byte-patch a JMP",
    "link": "https://reverseengineering.stackexchange.com/questions/23136/byte-patch-a-jmp",
    "content": "I have an address and I want to byte-patch it because there is a JMP that I want to block. But when I NOP it, the game just crash because it corrupt the function. So, I don't know what to do for block the JMP with a byte-patch.\nThere is a screen of the address below.\nThanks in advance !\n",
    "votes": "1",
    "answers": 2,
    "views": "1k",
    "tags": [
        "disassembly",
        "assembly",
        "c++",
        "memory"
    ],
    "user": "Beebey",
    "time": "Jan 28, 2020 at 17:24",
    "comments": [
        {
            "user": "bart1e",
            "text": "Have you patched all <pre><code>5</code></pre> bytes of <pre><code>JMP</code></pre> opcode?\n",
            "time": null
        },
        {
            "user": "Beebey",
            "text": "Yes, I do. But if I NOP the JMP the game crash because it corrupt the function. So I need to find an other byte/way to patch the JMP but idk\n",
            "time": null
        },
        {
            "user": "bart1e",
            "text": "Could you show the code that <pre><code>JMP</code></pre> jumps to?\n",
            "time": null
        },
        {
            "user": "Beebey",
            "text": "Yes, of course. The JMP jump into an address and the address jump into and address too. Here's a screen of the second jump result : prnt.sc/qu53i8 (if I don't bypass the JMP I'm banned ^^)\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "I think it would help to have a bit more context. It's looks like the JMP where the actual code gets executed so maybe the whole function call is not needed? But that's difficult to tell from such limited view of the code. Show more code\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Your problem is that you change the expected flow of the program - By patching the <pre><code>JMP</code></pre> you completely change the flow - it's not a <pre><code>call</code></pre> so the original flow doesn't get back to the <pre><code>push rdi</code></pre> instruction, but after patching it does, so the behavior is not expected. Try to look for what happens in <pre><code>7FFCAE2A0F13</code></pre>, and maybe to patch inside.\n",
            "votes": "1",
            "user": "macro_controller",
            "time": "Jan 29, 2020 at 7:46",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "There are two issues here.  One, as macr0controller notes, is that the jump might be to essential code that runs before the routine.\nThe second is that the jump might not be a fixed address, meaning that there's a relocation item that points to it, so any NOPs that you write will be replaced with what becomes garbage instructions if you replace the 0xE9 instruction with a NOP as well.\nInstead, you could change the 0xE9 (JMP) to an instruction of equivalent length such as 0x3D (CMP EAX, imm32) which alters no registers and will not be affected by the following values.\n",
            "votes": "0",
            "user": "peter ferrie",
            "time": "Jan 31, 2020 at 22:22",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Beebey",
                    "text": "<span class=\"comment-copy\">Hello ! Thanks for the answer. I tried 0x3D but the game still crash (cmp eax, 100) ... So, I've to patch inside the JMP or replace by something else than CMP EAX, imm32 ?</span>",
                    "time": null
                }
            ]
        }
    ]
}