{
    "title": "OllyDbg - change loaded file name - Fix error caused by renamed file",
    "link": "https://reverseengineering.stackexchange.com/questions/23531/ollydbg-change-loaded-file-name-fix-error-caused-by-renamed-file",
    "content": "There is a tool called LuteBot which is used in the game Mordhau to be able to make the player play midi files with the in game lute.\nIn the tool you need to specify the location of the file DefaultInput.ini from the game.\nHowever, the tool does not work anymore since the game was updated and renamed the file \"DefaultInput.ini\" to \"Input.ini\". The tool still listens for the file \"DefaultInput.ini\" and if you try to add the location of \"Input.ini\" then you see an error message saying \n\nPlease select the file \"DefaultInput.ini\n\n\nIs there a way to change the .exe to make it look for Input.ini instead of DefaultInput.ini?\nI only found the text \"DefaultInput\" two times, it looks like those are methods:\n\n<pre><code>openDefaultInputiniToolStripMenuItem\nsetDefaultInputiniLocationToolStripMenuItem\n</code></pre>\nI figured it out by doing this:\n\npress Alt + E\nfind your exe file. select it <pre><code>right click</code></pre> and select <pre><code>View executable file</code></pre>.\npress CTRL + B and searched for \"DefaultInput\"\n",
    "votes": "0",
    "answers": 1,
    "views": "267",
    "tags": [
        "ollydbg"
    ],
    "user": "Black",
    "time": "Mar 25, 2020 at 16:36",
    "comments": [
        {
            "user": "shebaw",
            "text": "First of all, try the easiest approach, run <pre><code>strings</code></pre> on the executable and <pre><code>grep</code></pre> for the string (<pre><code>strings lutebot.exe | grep -i defaultinput.ini</code></pre>). If you can't find it, then the text is probably obfuscated. Place a break point on <pre><code>CreateFile</code></pre> or other file opening functions and look for where the string is being passed from. You can also backtrack using the stack when the message box gets displayed to see from where it branched from, place a break point, restart the program and keep on doing that till you find from where it passes the string.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Googling it, it's actually an opensource software. Here is the link. Path resolution is done at line 90 in <pre><code>LuteBot/IO/Files/SaveManager.cs</code></pre>. Change the name of the <pre><code>ini</code></pre> file there.\nIf you just want to patch the string in the binary, make sure you search for unicode strings since C# will use unicode strings by default.\n",
            "votes": "1",
            "user": "shebaw",
            "time": "Mar 26, 2020 at 4:50",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Black",
                    "text": "<span class=\"comment-copy\">Good to know, but im still interested if this would be possible by using a debugger, since not every software is open source. Thanks!</span>",
                    "time": null
                },
                {
                    "user": "shebaw",
                    "text": "<span class=\"comment-copy\">Checkout the comment I made in your question then.</span>",
                    "time": null
                }
            ]
        }
    ]
}