{
    "title": "Resource hacker and Resource tuner don't change taskbar and window icons",
    "link": "https://reverseengineering.stackexchange.com/questions/23543/resource-hacker-and-resource-tuner-dont-change-taskbar-and-window-icons",
    "content": "I wanted to change a icon of a programs. I tried both Resource Tuner and Resource Hacker programs. When i opened the program there were multiple icons sizes, but when i tried to replace one icon, it generated multiple icons of a single ico file. After that, it looked like the exe icon has been  changed, but only in the file manager, When i opened the programs, the icon on the window and taskbar was not changed. Why is this and how can i change it?\n",
    "votes": "0",
    "answers": 1,
    "views": "1k",
    "tags": [
        "game-hacking",
        "pe-resources"
    ],
    "user": "LetFan623",
    "time": "Mar 27, 2020 at 13:09",
    "comments": [
        {
            "user": "Robert",
            "text": "Have you removed the other icon images of different size you have not changed? When an icon is loaded the best fitting image is loaded, depending on the size and color depth. Therefore if you only modify one icon image it can happen that the other images are still shown at different positions in the application.\n",
            "time": null
        },
        {
            "user": "LetFan623",
            "text": "You don't undestand. I want to replace all of the 9 images seperately, but when i replace one, all of them are replaced and some more sizes than the original exe had are added. How do i manually replace them, and is this why the window and taskbar icons are not changing?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There's a How-to tutorial on how to replace icons at once or separately, you can hardly go wrong\nhttp://www.heaventools.com/rt-how-to-change-icon-in-exe-file.htm\n",
            "votes": "-1",
            "user": "codevert",
            "time": "Mar 9, 2021 at 9:20",
            "is_accepted": false,
            "comments": [
                {
                    "user": "multithr3at3d",
                    "text": "<span class=\"comment-copy\">Please include the relevant content from the link in your post.</span>",
                    "time": null
                }
            ]
        }
    ]
}