{
    "title": "Are there any free disassemblers for the NEC 78K0R family of processors?",
    "link": "https://reverseengineering.stackexchange.com/questions/2354/are-there-any-free-disassemblers-for-the-nec-78k0r-family-of-processors",
    "content": "Another slightly esoteric microcontroller in a product I'm looking at - the NEC 78K0R microcontroller. This is a 16-bit extension of the 78K0. The 78K0 can be disassembled in IDA Pro, but not the 78K0R.\nRenesas Cubesuite allows viewing of disassembly of code compiled/assembled through it, as does IAR Workbench, but I can't see a way of loading a bin or hex file into these for disassembly.\nKPIT GNU binutils has support for the RL78, which has a lot in common with the 78K0 instruction set, but is still very different.\nIs there a free disassembler for these microcontrollers?\n",
    "votes": "5",
    "answers": 1,
    "views": "2k",
    "tags": [
        "tools",
        "disassembly",
        "nec-78k0r"
    ],
    "user": "Cybergibbons",
    "time": "Jun 27, 2013 at 16:43",
    "comments": [
        {
            "user": "Cybergibbons",
            "text": "I think I have worked out how to do this, at least to a certain extent in Cubesuite.\n",
            "time": null
        },
        {
            "user": "Jonathon Reinhart",
            "text": "You can always take on writing a processor module for IDA, too :-)\n",
            "time": null
        },
        {
            "user": "Cybergibbons",
            "text": "Indeed - been looking at this today as the Cubesuite one isn't great in comparison. Looks like something I might be better trying on a less complex instruction set.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Cubesuite+ can disassemble hex files.\n1) Download and install Cubesuite+ from Renesas. V2.0.0 was used in this instance.\n2) Start Cubesuite+\n3) Go to Project -> Create New Project\n\n4) Change the Microcontroller to the correct one.\n5) Change the Kind of Project to \"Debug Only\".\n\n6) Once the project has been created, in the Project Tree, right click on Download files and go to Add\n7) Find your hex or bin file and load it.\n\n8) Go to Debug -> Build and Download\n9) The 78K0R simulator starts and the disassembly is visible.\nI have yet to work out how to denote instruction and data segments.\n",
            "votes": "6",
            "user": "Cybergibbons",
            "time": "Jun 28, 2013 at 21:07",
            "is_accepted": true,
            "comments": []
        }
    ]
}