{
    "title": "How do I convert a byte array to bitmap for a dot matrix LCD?",
    "link": "https://reverseengineering.stackexchange.com/questions/2357/how-do-i-convert-a-byte-array-to-bitmap-for-a-dot-matrix-lcd",
    "content": "The device I'm using uses a Dot Matrix LCD and I would like to find the bmp it's using to draw things on the screen.  I've checked for a standard bmp header but didn't see it.\nIs there any tool out there that will do this conversion for me so I can see what's stored.\nI don't know if the data is compressed or not nor do I know how to figure that out.  First time dealing with one of these.\n",
    "votes": "1",
    "answers": 3,
    "views": "2k",
    "tags": [
        "disassembly"
    ],
    "user": "gigawatt",
    "time": "Jun 28, 2013 at 2:39",
    "comments": [],
    "answers_data": [
        {
            "content": "You leave a lot of questions unanswered. What architecture of microprocessor is this?  Is everything in one binary firmware blob, or is there storage with a filesystem?\nMost likely the image data is in a raw format embedded in the firmware binary. For a small embedded system, I would be surprised to find a \"BM\" header. What I would do, is disassemble the firmware, and look for references to large \"blobs\" of data. They could be drawing smaller sprites, or it could be copying a large image (you haven't really specified.)\nThe details about the LCD will be helpful here also. Most likely a datasheet will tell you what format the LCD expects its data in (how many bits/pixel, etc.) If you can figure out (electrically) how the LCD is connected, then you can possibly figure out what I/O ports the firmware will access to write to the LCD. Then you can work backwards to see how it is transforming the image data (if at all) before writing it to the LCD.\n",
            "votes": "1",
            "user": "Jonathon Reinhart",
            "time": "Jun 28, 2013 at 5:29",
            "is_accepted": false,
            "comments": [
                {
                    "user": "gigawatt",
                    "text": "<span class=\"comment-copy\">Thanks. I have the data sheets for the LCD (122x32) and driver and know how it is connected. It's connected to a PIC and it has some stored data but I also have a nearby flash that has some unknown data stored on it so I'm not really sure where the bmp would be stored. I was hoping I could just display the data as a bmp somehow without having the header. I was hoping there was a tool that could go from data-&gt;bmp since there are ones the go bmp-&gt;data. I think you are right though, working backwards from the pins connected on the PIC may be the best thing to do. Unfortunately this PIC isn't supp</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "As for converting to a byte array, you can use a tool like this: http://code.google.com/p/bmp2txt/ to get the pixel data and then convert the output to a byte array using a bin2hex . \nbmp2txt is a fairly old app I made while learning c and it only works on 24bit bitmaps and it's coded pretty poorly, it's just an example to show you how to rip the bytes.\n",
            "votes": "1",
            "user": "Tox1k",
            "time": "Jul 3, 2013 at 19:22",
            "is_accepted": false,
            "comments": [
                {
                    "user": "gigawatt",
                    "text": "<span class=\"comment-copy\">Thanks, I ended up just messing around with it by hand in excel and got it figured out.  It wasn't sexy but it's done and it worked.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I am the editor of the bitmap2lcd shareware tool for Dot Matrix LCD programming.\nIt converts images/fonts to arrays , but unfortunately not arrays to images ...\nRecently a customer asked me if it is planned in the future to implement this kind of reverse conversion and now I read this article...\nI begin to question myself if I finally should code this feature ?\nAny comments ?\nregards \nBernie\n",
            "votes": "1",
            "user": "Bernie",
            "time": "Aug 27, 2013 at 4:06",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Gilles 'SO- stop being evil'",
                    "text": "<span class=\"comment-copy\">Welcome to Stack Exchange. This is a <a href=\"http://reverseengineering.stackexchange.com/about\">questions and answers site</a>, not a discussion forum. Please do not use the answer section for tangential discussions, only to answer the question. This isn't the type of question you could ask here, either, as we focus on objective, answerable questions (though judging by this question you'd have at least one potential customer). Once you get 20 reputation points from questions and answers participation, you can join us in <a href=\"http://chat.stackexchange.com/\">chat</a> for such discussions.</span>",
                    "time": null
                },
                {
                    "user": "gigawatt",
                    "text": "<span class=\"comment-copy\">@Bernie  I believe I downloaded your software at some point to see if it had this feature but had to uninstall it since my IT department found that it was 'calling home' each time it was used.  Needless to say, they didn't like that.  Anyways, I ended up just doing the translation myself and will soon have a Python script that will do it automatically.  I'll try to remember to post it here once it is finished.</span>",
                    "time": null
                }
            ]
        }
    ]
}