{
    "title": "How do I identify the content management system used by a website?",
    "link": "https://reverseengineering.stackexchange.com/questions/236/how-do-i-identify-the-content-management-system-used-by-a-website",
    "content": "If I go to a random blog or informational website say, having pages with information, a sidebar with an overview of the archives. I know that this website is built with a CMS. How can I get to know which CMS was used?\nSo I'm looking for basic, general typicals of common CMSs, so that we can get to know the working power behind any informational website or blog.\nFor example, a typical might be that WordPress adds such a line to the HTML:\n<pre><code><meta name=\"generator\" content=\"WordPress 3.5.1\" />\n</code></pre>\n",
    "votes": "3",
    "answers": 1,
    "views": "219",
    "tags": [
        "websites",
        "cms"
    ],
    "user": null,
    "time": "May 14, 2013 at 13:11",
    "comments": [
        {
            "user": "Anton Kochkov",
            "text": "This is a question for IT Security site, not for Reverse Engineering.\n",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "This question is on-topic as per the discussion here\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Install Wappalyzer for Chrome or Firefox. If you want to know how it works, the source code is available.\n",
            "votes": "7",
            "user": "Mick",
            "time": "May 14, 2013 at 14:52",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user187",
                    "text": "<span class=\"comment-copy\">Thanks! I'm looking for the typicals, not for a program. So could you include the/some typicals in your answer?</span>",
                    "time": null
                },
                {
                    "user": "Mick",
                    "text": "<span class=\"comment-copy\">What do you mean when you say \"typicals\" ?</span>",
                    "time": null
                },
                {
                    "user": "user187",
                    "text": "<span class=\"comment-copy\"><i>Technical</i> stuff, like the one example I mentioned. So you can get that from the source code, but without some code here this is link-only... :(</span>",
                    "time": null
                },
                {
                    "user": "amccormack",
                    "text": "<span class=\"comment-copy\">@CamilStaps Looks like <a href=\"https://github.com/ElbertF/Wappalyzer/blob/master/drivers/chrome/apps.json\" rel=\"nofollow noreferrer\">this part</a> of the source code should help. I've also never heard the word \"typicals\" used as you're using it. I think people will often say \"indicator\" or \"identifier\" instead.</span>",
                    "time": null
                },
                {
                    "user": "Mick",
                    "text": "<span class=\"comment-copy\">@CamilStaps - Please see amccormack's comment above. The source code containing the identifiers is 2,600 lines long. You will need to click the link to find the information that you are looking for.</span>",
                    "time": null
                }
            ]
        }
    ]
}