{
    "title": "Where can I get reliable tools for RE?",
    "link": "https://reverseengineering.stackexchange.com/questions/2427/where-can-i-get-reliable-tools-for-re",
    "content": "I am looking for a reliable source to download RE tools such as:\n\nLordpe\nImprec\nPeid\n\nbut it seems all the links in google are not safe, where can I buy or download it from a reliable not malwared source. Can I trust http://www.woodmann.com/ ?\n",
    "votes": "8",
    "answers": 3,
    "views": "2k",
    "tags": [
        "tools"
    ],
    "user": "0x90",
    "time": "Dec 3, 2013 at 1:12",
    "comments": [
        {
            "user": "PhoeniX",
            "text": "Hi,  I've been using woodmann resources for some time and I find it one of the most valuable places not only for RE tools but also for its vast knowledge database of many aspects of RE. So, I think you can trust this resource and use it solve you problems and enrich your knowledge.\n",
            "time": null
        },
        {
            "user": "Stolas",
            "text": "Little note: there is a known POC Denial of Service for PEiD. As PEiD is no longer being developed and this issue won't get patched I'd recommend to look for another tool that does the same thing. It's just a matter of time till this public DoS Exploit gets used in the wild. exploit-db.com/exploits/26413\n",
            "time": null
        },
        {
            "user": "alexanderh",
            "text": "I have been using Woodmann for years and I have never had issues. Most of these tools you should be running a VM or safe environment anyways. The RCE tools has a large woodmann.com/collaborative/tools/index.php/Category:RCE_Tools\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Tools archived on http://www.woodmann.com/ should be safe.\nI've personally met and trust most of the people who run the site (Woodmann, dELTA, etc.), and can vouch for their integrity.\n",
            "votes": "20",
            "user": "Jason Geffner",
            "time": "Jul 7, 2013 at 22:01",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "Want to improve this post? Provide detailed answers to this question, including citations and an explanation of why your answer is correct. Answers without enough detail may be edited or deleted.\n                                \n                            \n\n\n\n\n\n\nThere is also the option of tuts4you. They have an extensive download page there.\n",
            "votes": "7",
            "user": "gandolf",
            "time": "Jul 9, 2013 at 16:24",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Want to improve this post? Provide detailed answers to this question, including citations and an explanation of why your answer is correct. Answers without enough detail may be edited or deleted.\n                                \n                            \n\n\n\n\n\n\nThere is also http://www.openrce.org/downloads/\nThough it does not have specific tools you are looking for, it has lots of plugins for IDA and OllyDbg. It is trustworthy source as well.\n",
            "votes": "4",
            "user": "PSS",
            "time": "Jul 10, 2013 at 14:12",
            "is_accepted": false,
            "comments": []
        }
    ]
}