{
    "title": "Where are program resources stored in a CIL assembly?",
    "link": "https://reverseengineering.stackexchange.com/questions/2433/where-are-program-resources-stored-in-a-cil-assembly",
    "content": "In a CIL assembly, where are resources stored?\nI am trying to reverse engineer a sample that appears to be protected by a .NET crypter.\nThe CIL assembly for the sample does a SHA256 decryption on a blob that is retrieved using System.Resources.ResourceManager::GetObject, but I am unsure where in the binary those resources are.  I loaded the binary into Resource Hacker, but all it can see is something called Version Info that has metadata about the binary in it.  I'm assuming there's some kind of segment or something that isn't an actual PE segment, but is a CLI segment?\nFor reference, it is on malwr.com, MD5: 891905810486c6dee6d246f9845fb5cd\nAny help appreciated.\n",
    "votes": "6",
    "answers": 1,
    "views": "203",
    "tags": [
        "windows",
        "dumping",
        "pe-resources"
    ],
    "user": "bobby_analog",
    "time": "Jul 8, 2013 at 17:23",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "Try CFF Explorer, it knows about .NET file format.\n",
            "time": null
        },
        {
            "user": "bobby_analog",
            "text": "For anyone that is curious, the author of CFF Explorer wrote a few blog posts on codeproject about the .NET and the .resource file format:    codeproject.com/Articles/12585/The-NET-File-Format codeproject.com/Articles/12096/NET-Manifest-Resources\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": ".Net files store their resources in the COM Data Directory substructures. I did several resources that might help you to understand, such as a hand-made .Net file, and a poster that covers the basic of Net data structures.\nOtherwise, you should definitely look at your binary in PE insider (the successor of CFF Explorer, same author), and check the author's extensive documentations on the .NET format.\n",
            "votes": "2",
            "user": "Ange",
            "time": "Sep 25, 2013 at 7:00",
            "is_accepted": false,
            "comments": []
        }
    ]
}