{
    "title": "How to scan the ECU Delphi MT05?",
    "link": "https://reverseengineering.stackexchange.com/questions/24629/how-to-scan-the-ecu-delphi-mt05",
    "content": "The ECU (Engine Control Unit) MT05 from Delphi is used today in many motorbikes and ATV's:\n\nRegal Raptor (Raptor, Daytona and Spider 350)\nAJP (PR7)\nBenelli (BN600)\nCFmoto (Terralander X8)\nZongshen (RX3)\nZhejiang (TR125)\nHyosung (GT650RC)\nScomadi scooters\nRiya scooters\nQuadro scooters\nand more... \n\nBut this ECU is not OBD2 compliant and so all current OBD2 scanner software will fail to read even the most basic parameters like \"Engine speed\".\nI want to read the current fault code (DTC).\nHow can I do this?\n",
    "votes": "5",
    "answers": 1,
    "views": "19k",
    "tags": [
        "ecu"
    ],
    "user": "Elmue",
    "time": "Apr 6, 2020 at 18:04",
    "comments": [
        {
            "user": "Xebastien",
            "text": "Bud, you are a genius!! With you software can reprogram the ecu or is only for read?\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "@Elmue valid point, but there's a minimum reputation requirement for comments 😉\n",
            "time": null
        },
        {
            "user": "Ravinder kashyap",
            "text": "I need your help for MT05 ECM. I need CAN matrix of this ECM for showing these value on display with CAN communication. It appreciate if you could provide me MT05 ECM CAN messages ID's and other data. Thanks and Regards, Ravinder\n",
            "time": null
        },
        {
            "user": "Elmue",
            "text": "This is wrong place for this type of questions. Please send me an email. You find my email in the Help at the bottom or on my homepage.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "After investigating a lot I found that there is only one software able to communicate with this ECU.\nIt is the ancient PCHUD from Delco which is mentioned in the manual of the Delphi MT05.\nBut this program has been written in 1993 for Windows 3.\nIt does not run on a 64 bit Windows which is the standard nowadays.\nIt is quite primitive and does not support ELM 327 adapters (which did not exist in 1993)\nSo I began to reverse engineer this old software (which was difficult to find) and wrote my own program which now replaces it: HUD ECU Hacker\nI designed HUD ECU Hacker as \"community software\".\nThis means that the program is 100% configurable by the user in an XML file.\nThis \"parameter file\" contains the commands sent to the ECU and how to interpret the responses.\nThis allows to adapt HUD ECU Hacker also to other ECU's.\nMeanwhile also the Liteon MC21, Lifan EFI 9 and Yeson 28S ECUs have been added. Also support for CAN bus (OBD2 scanning and sniffing) has been added. Supported protocols: ISO9141, ISO14230, ISO15765, CAN Raw.\nThe program is still growing. I added lots of new features in the last months.\nNow it can also download the flash memory from the MT05 ECU with the calibration tables, correct the checksum and program the flash memory (tuning).\nHUD ECU Hacker finds calibration tables automatically in a flash memory file. It finds approx 170 tables and 500 scalar values.\nCalibration tables can also be displayed as 3D model.\nDownload and detailed description here:\nhttps://netcult.ch/elmue/HUD%20ECU%20Hacker/\n",
            "votes": "11",
            "user": "Elmue",
            "time": "Aug 2, 2022 at 21:44",
            "is_accepted": true,
            "comments": [
                {
                    "user": "M-sAnNan",
                    "text": "<span class=\"comment-copy\">hey @elmune, great software. I am self-learning and wanted to know from which setting I can adjust the rev limiter.  I tried adjusting \"hi-low limit OSFCO\" but I am not getting anywhere.  My bike has an NC450 engine with an MT05.2 ECU. Stock Ecu is wantao, similar to mt05 but not tuneable by this software.</span>",
                    "time": null
                },
                {
                    "user": "Elmue",
                    "text": "<span class=\"comment-copy\">This is not the right place to discuss your problem. And with that sparse information it is impossible to give any useful answer.</span>",
                    "time": null
                }
            ]
        }
    ]
}