{
    "title": "Which value is used for verifiying Zip password?",
    "link": "https://reverseengineering.stackexchange.com/questions/24803/which-value-is-used-for-verifiying-zip-password",
    "content": "I am studying the way that can be used to check if a given password for an encrypted zip file is correct or not. I see this link:\nHow does a zip file detect a correct password?\nIn the answer of this question, it said CRC is used to check if a password is correct. It also paste a code snippet from Info-zip to prove this.\nHowever, after carefully studying the Info-zip source code, as below:\n<pre><code>    if ((ush)(c | (b<<8)) != (GLOBAL(pInfo->ExtLocHdr) ?\n                           ((ush)GLOBAL(lrec.last_mod_dos_datetime) & 0xffff) :\n                           (ush)(GLOBAL(lrec.crc32) >> 16)))\n</code></pre>\nI find when there is ExtLocHdr in the zip item, the lower 2 bytes of last_mod_dos_datetime, instead of the CRC, will be used to verify the password. But this is not mentioned in the file format specification in https://pkware.cachefly.net/webdocs/casestudies/APPNOTE.TXT at all.\nWhy?\n",
    "votes": "2",
    "answers": 0,
    "views": "112",
    "tags": [
        "encryption",
        "crc"
    ],
    "user": "alancc",
    "time": "Apr 23, 2020 at 9:36",
    "comments": [
        {
            "user": "schroeder",
            "text": "I'm not sure this has anything to do with security. This is either a coding question or a reverse engineering question. This is a \"how does this program work?\" question. You might want to use the answer to make your own bruteforcer, but that doesn't make this a security question.\n",
            "time": null
        },
        {
            "user": "alancc",
            "text": "@schroeder, Thank you. I ask in security site since the post I mentioned is also posted on security site, i.e., security.stackexchange.com/questions/199545/…\n",
            "time": null
        }
    ],
    "answers_data": []
}