{
    "title": "How does this levitating clock work?",
    "link": "https://reverseengineering.stackexchange.com/questions/24964/how-does-this-levitating-clock-work",
    "content": "I came across the Flyte STORY clock recently (link) and I’m stumped as to how it works.\nDoes anyone know how it holds the ball against gravity when it’s vertically upright?\n\nI asked Physics but they closed the question immediately. Hopefully this is the right place to ask!\nThis article touches on the subject, but provided only speculation and no detail.\n",
    "votes": "2",
    "answers": 1,
    "views": "517",
    "tags": [
        "hardware"
    ],
    "user": "Michael Finn",
    "time": "Feb 7, 2023 at 9:28",
    "comments": [
        {
            "user": "auspicious99",
            "text": "Sorry, I don't think this is the right place to ask, either.\n",
            "time": null
        },
        {
            "user": "Michael Finn",
            "text": "@auspicious99 Can you suggest a different forum?\n",
            "time": null
        },
        {
            "user": "hippietrail",
            "text": "@MichaelFinn: You can try Quora, they don't have the stringent rules of Stack Exchanges, but sometimes some questions don't get noticed.\n",
            "time": null
        },
        {
            "user": "Michael Finn",
            "text": "@hippietrail Thanks for the advice! I’ll leave this up in case a kind stranger feels like imparting wisdom, but no hard feelings if it needs to be closed.\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "Flyte uses Magnetic levitation in other products. Hence most likely it is used here, too. There is a thesis (German language) describing it (scroll to \"Flyte\" section)\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Briefly:\ninside the clock:\n\nFull manufacturing instructions:\nhttps://www.instructables.com/Mesmerizing-Magnetic-Wall-Clock/\nwebarchived\n",
            "votes": "2",
            "user": null,
            "time": "Dec 25, 2022 at 23:05",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Michael Finn",
                    "text": "<span class=\"comment-copy\">Unfortunately this DIY project does not appear to levitate the ball, but rather holds it magnetically against the side of the clock face. I do appreciate the answer attempt almost three years later, though!</span>",
                    "time": null
                }
            ]
        }
    ]
}