{
    "title": "Is there documentation on the Ghidra 9.1 SleighDevTools?",
    "link": "https://reverseengineering.stackexchange.com/questions/25070/is-there-documentation-on-the-ghidra-9-1-sleighdevtools",
    "content": "I am working on adding a processor to Ghidra (I have no idea what I'm doing, just working my way through based off the documentation).\nI've seen SleighDevTools mentioned in the 9.1 release as being \"support of processor module development\", which sounds like it would be helpful to me. However, I can't find any documentation on what it does or how to use it. All, I've found is the source code for it in the Ghidra repo (no readme), and a single mention of it on reddit.\nIs there documentation on SleighDevTools? \nIf so, where is it? \nIf not, are there any good resources for processor development besides the official Ghidra docs?\nThank you!\n",
    "votes": "7",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ghidra"
    ],
    "user": "Heiko",
    "time": "May 20, 2020 at 2:35",
    "comments": [
        {
            "user": "hippietrail",
            "text": "I believe there is no documentation for this yet, but I was reading a blog post/README/forum comment from somebody a day or two ago who had added a few processors or microcontrollers who gave some explanation of what they went through. I'll add a link if I find at again.\n",
            "time": null
        },
        {
            "user": "auspicious99",
            "text": "@hippietrail Look forward to seeing the link if you find it again and add it here, thanks\n",
            "time": null
        },
        {
            "user": "auspicious99",
            "text": "Thanks @hippietrail . I had previously found that one (linked it in my answer too), and was hoping you might have seen another one.\n",
            "time": null
        },
        {
            "user": "auspicious99",
            "text": "No problem, thanks for looking. Look forward to future discussions with you regarding Ghidra and reverse engineering on this site!\n",
            "time": null
        },
        {
            "user": "Heiko",
            "text": "BTW. The reddit post that I was referring to was this. It sounds like it could be the one that @hippietrail was looking at.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "In the SleighDevTools folder, there is a <pre><code>pcodetest</code></pre> folder, with a README.txt (which is unfortunately very brief).\nThe documentation on SLEIGH can be found in <pre><code><ghidra install dir>/docs/languages/index.html</code></pre>, which explains what goes in the .slaspec file for your new processor.\nSome documentation on what goes in the other files like .cspec, .ldefs, .., can be found in <pre><code><ghidra install dir>/Ghidra/Framework/SoftwareModeling/data/languages</code></pre>.\nThere is also an Eclipse plugin, GhidraSleighEditor, that is currently (Ghidra 9.1.2) separate from the GhidraDev eclipse plugin and must be manually installed. It can be found at <pre><code><ghidra install dir>/Extensions/Eclipse/GhidraSleighEditor/</code></pre>, and has some documentation in the <pre><code>GhidraSleighEditor_README.html</code></pre> in that folder.\nAs for your question on good documentation besides the Ghidra docs:\n\nHere is the original paper on SLED, which later in modified form became SLEIGH.\n\nThese slides go through an example of adding a processor to Ghidra\n\nThere's also this high level guide to adding a processor.\n\n(thanks to mumbel for pointing this out) This reddit post provides valuable details on adding a processor.\n\n(thanks to Heiko) This blog contains tutorials on how to put together SLEIGH, pcode, and related concepts.\n",
            "votes": "8",
            "user": "auspicious99",
            "time": "Aug 17, 2020 at 18:04",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Heiko",
                    "text": "<span class=\"comment-copy\">Thanks! That gives me quite a few more things to work off of.</span>",
                    "time": null
                },
                {
                    "user": "mumbel",
                    "text": "<span class=\"comment-copy\">feel free to ask questions in that thread, I can maybe expand on anything that's lacking (oops posted in wrong comment chain)</span>",
                    "time": null
                },
                {
                    "user": "auspicious99",
                    "text": "<span class=\"comment-copy\">Oh! I see, you were the author of that reddit article?</span>",
                    "time": null
                },
                {
                    "user": "mumbel",
                    "text": "<span class=\"comment-copy\">Yup, Wrote that (tricore, risc-v, and 80960 modules and a few various fixes across the ghidra code base)  this acct is same mumbel as <a href=\"https://www.reddit.com/user/mumbel\" rel=\"nofollow noreferrer\">reddit.com/user/mumbel</a> and <a href=\"https://github.com/mumbel\" rel=\"nofollow noreferrer\">github.com/mumbel</a></span>",
                    "time": null
                },
                {
                    "user": "Heiko",
                    "text": "<span class=\"comment-copy\">I just found a good general sleigh tutorial at <a href=\"https://spinsel.dev/\" rel=\"nofollow noreferrer\">spinsel.dev</a></span>",
                    "time": null
                }
            ]
        }
    ]
}