{
    "title": "Why use MOV R0, R3 and then MOV R3, R0 (thus back and forth)",
    "link": "https://reverseengineering.stackexchange.com/questions/25072/why-use-mov-r0-r3-and-then-mov-r3-r0-thus-back-and-forth",
    "content": "I have a static library archive which I try to understand.  \nFirst I use 'ar' to extract the object files.\nThe object files ar \"ELF 32-bit LSB relocatable, ARM, EABI5 version 1 (SYSV), not stripped\"\nThen I use 'objdump -D' to get the assembly instructions.\nNow I'm observing the assembly listing and find some curious (to me) instructions.\nApparently, after a branch with link (bl), R0 is moved into R3, and the next instruction moves R3 to R0.\n<pre><code>23c:    e1a00003        mov     r0, r3\n240:    ebfffffe        bl      0 <atoi>\n244:    e1a03000        mov     r3, r0\n248:    e1a00003        mov     r0, r3\n</code></pre>\nThis happens multiple times in different object files within the archive.\nIn the end both R0 and R3 are set to the value of R0 when returning from the branch.\nWhat could be a good explanation for this behaviour?\n",
    "votes": "9",
    "answers": 2,
    "views": "513",
    "tags": [
        "disassembly",
        "arm"
    ],
    "user": "JoHu",
    "time": "May 20, 2020 at 21:33",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE! Could you show the surroundings of the code you gave? Perhaps four more lines before and after ...\n",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "The interface to external library functions needs <pre><code>r0</code></pre> to contain the data to process, and it returns its result in <pre><code>r0</code></pre> as well. The compiler doesn't know (or doesn't care), so it sets up the call, calls the library function, then restores the registers to resume what it was doing. It's just some not optimized stuff.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "This is most likely code that was compiled without optimizations (<pre><code>-O0</code></pre> ). In such code redundant operations are very common as the compiler faithfully translates individual statements to machine code but does not try to perform optimizations to remove or simplify redundant ones.\n",
            "votes": "6",
            "user": "Igor Skochinsky",
            "time": "May 21, 2020 at 11:41",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "There can be hidden requirements that affect what code is written. Sometimes weird code is written to obtain a certain timing, like a new massively parallel 144 core microcontroller from GreenArrays, which may require a no-op before or after a branch, and the two moves may provide just the right timing. Also, special kinds of RAM like FRAM or the early core memory, may have needed \"constant refresh\". Furthermore, sometimes instructions have to be aligned to be on a certain word-multiple boundary (like a multiple of 4 or 8 or 16 or 32 or 64...) and two moves achieves that. These reasons (or other interesting answers I don't know about) might or might not be the reason (I don't really know), but that code isn't probably just \"unoptimized\"; writing a register one direction, then immediately back again has some kind of hidden logic to it.  Code is never just code. It interacts with the laws of physics, peripherals, magnetism, timing, etc. And how may hours over the 60 per week the developer was. ;-)\n",
            "votes": "1",
            "user": "MicroservicesOnDDD",
            "time": "Nov 4, 2022 at 23:43",
            "is_accepted": false,
            "comments": []
        }
    ]
}