{
    "title": "what are modern hooking techniques? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/25090/what-are-modern-hooking-techniques",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 4 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\ni was looking at interesting anti malware roles (malware analysis and prevention) and among the required skills they mentioned that \"modern hooking techniques\" should be well acquainted with. i was wondering what are modern hooking techniques?\ncan anybody reference me to examples of \"modern hooking techniques\" and examples of them with code to make understanding easier?\nwhen referring to hooking, malware researchers usually use manual hooking or use frameworks such as pintools/frida?\nplease elaborate on what you think is modern hooking and please share references or code samples, as it can greatly help me and i believe a lot of other people interested in becoming better at reversing/malware analysis.\nthank you for your efforts\n",
    "votes": "1",
    "answers": 0,
    "views": "145",
    "tags": [
        "function-hooking",
        "dll-injection",
        "injection",
        "hooking"
    ],
    "user": "beginner",
    "time": "4 years ago",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. This question could really use some clarification. For starters, answers to this question are likely going to be opinion-based (not a good fit for this site). Also, what a recruiter/HR person will list as a requirement is - unfortunately - often filtered down from a list they got from the techies. So why don't you ask them which ones they deem modern? Also, hooking refers to so many loosely related techniques that I wonder what exactly could be meant. In the realm of malware I'd also expect some sort of kernel-land hooking techniques to be a requirement.\n",
            "time": null
        }
    ],
    "answers_data": []
}