{
    "title": "What should I look for when building a malware lab on a budget? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/2512/what-should-i-look-for-when-building-a-malware-lab-on-a-budget",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nWhat should I look for when building a malware lab on a budget?  $800 USD or less. I'm talking about hardware and virtualization capabilities, or alternatives (e.g. FOG Server).  Not user programs that load the actual malware for analysis (Olly, IDA, etc.).\nESXi seems popular with virtualization, but does that have any advantages over a malware lab with VirtualBox, aside from performance?\n",
    "votes": "0",
    "answers": 1,
    "views": "435",
    "tags": [
        "malware"
    ],
    "user": "zer",
    "time": "11 years ago",
    "comments": [
        {
            "user": "asheeshr",
            "text": "This question appears to be off-topic because it is about a product recommendation. Have a look at why shopping questions are off-topic.\n",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "Please raise any concerns you may have regarding the site on Reverse Engineering Meta. The purpose of the meta site is to discuss exactly such issues.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "ESXi can be useful if you want to try the sample on a number of systems. And let it run for a while. Due to TimeLocks, timebomb etc etc.\nI'd go for a good Laptop(16GB RAM sort of thing) and Vmware workstation / virtualbox.\n",
            "votes": "2",
            "user": "Stolas",
            "time": "Jul 22, 2013 at 6:23",
            "is_accepted": false,
            "comments": [
                {
                    "user": "zer",
                    "text": "<span class=\"comment-copy\">Thanks.  Does the free version of ESXi support snapshots?  I plan on having the infected VM, Security Onion VM, Remnux VM, and a firewall VM to block some traffic route the allowed through Tor.  Is 16 GB RAM enough to run those VMs at the same time?</span>",
                    "time": null
                },
                {
                    "user": "Stolas",
                    "text": "<span class=\"comment-copy\">Not sure about the snapshots, I do think it does. And 16 MB Ram is more than enough. REMNUX runs fine with 512Mb</span>",
                    "time": null
                },
                {
                    "user": "adric",
                    "text": "<span class=\"comment-copy\">Yes to both, generally. ESX(i) can snap though I'm not certain about cloning.</span>",
                    "time": null
                },
                {
                    "user": "zer",
                    "text": "<span class=\"comment-copy\">What kind of hard drive am I going to need?  If I use VirtualBox there will be my main OS, and 4 or more VMs running at the same time.  Am I going to need an SSD for the VMs?</span>",
                    "time": null
                },
                {
                    "user": "PSS",
                    "text": "<span class=\"comment-copy\">I am afraid you won't be able to find quad core 16Gb laptop with SSD drive for around $800 you wanted to spend.</span>",
                    "time": null
                }
            ]
        }
    ]
}