{
    "title": "x64dbg throwing exception",
    "link": "https://reverseengineering.stackexchange.com/questions/25199/x64dbg-throwing-exception",
    "content": "I have been working on finding an overflow in WordPad and I was able to run an exception with an undefined behavior (my point of view).\nI am using x64dbg (I am not a pro x64dbg) and it shows unexpected HRESULT and almost all registers filled with random values (they don't get filled when a non-corrupted file is loaded).\nI am new to x64dbg — how would I go saying this is vulnerable? How do I analyze the exception and the behavior? How do I exploit it?\nI have so many questions. Please help. The memory dump is too big, so it is impossible to identify anything. What steps should I follow? Sometimes shows <pre><code>unexpected HRESULT</code></pre> on R8 register as well.\n",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "debugging",
        "x64dbg",
        "buffer-overflow"
    ],
    "user": "Ahmed Can Unbay",
    "time": "Jul 2, 2021 at 19:09",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "Please don’t use “x64” as abbreviation of x64dbg, it’s a separate term on its own.\n",
            "time": null
        },
        {
            "user": "Ahmed Can Unbay",
            "text": "@IgorSkochinsky why do registers get random values even tho this is not an overflow ? How do I analyze the exception\n",
            "time": null
        },
        {
            "user": "morsisko",
            "text": "why do you think these values are random?\n",
            "time": null
        },
        {
            "user": "Ahmed Can Unbay",
            "text": "apparently they are not. but why @morsisko\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "The exception shown in status bar (CPP_EH_EXCEPTION) is a special exception code used to implement C++ exceptions (throw/catch) and usually does not indicate a bug or vulnerability. In most cases it can be passed to the program which expects it and will handle it.\n",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Jun 4, 2020 at 20:28",
            "is_accepted": true,
            "comments": []
        }
    ]
}