{
    "title": "Can Ghidra currently be used to disassemble Tandy Color Computer binaries? Are the 6805 and 6809 opcode compatible?",
    "link": "https://reverseengineering.stackexchange.com/questions/25232/can-ghidra-currently-be-used-to-disassemble-tandy-color-computer-binaries-are-t",
    "content": "I'm working on some Ghidra loader and filesystem modules for 80s microcomputers.\nI started work on a Loader for .cas tape image files for the TRS-80 CoCo because Ghidra suports the 6805 CPU. (It also supports the M68HC05TB and MC68HC908QY4)\nI never used the CoCo or anything with a 6809 back in the day so wasn't accustomed to its instructions. I am used to a few other instruction sets though. Anyway I assumed 6805 and 6809 would be quite that using Ghidra for CoCo and Dragon 32 binaries would be useful.\nBut when I got my loader module to the point it was ready to test I found it did not produce code for the CoCo's ROM that matched disassemblies on the Internet. Many bytes could not be decoded into instructions at all.\nBut when I search for the 6805 I can't find information saying the instruction sets are substantially different, though they only give the impression it should be quite close to the 6809 rather than outright saying it.\nSo have I made a wrong assumption, have I mixed something up on Ghidra, or do the two similarly named chips have totally different instruction sets? Should I be able to disassemble code for these '80s machines using Ghidra if I set it properly?\n(I'm sure there are other disassemblers but I'm only working with Ghidra for this project.)\n",
    "votes": "2",
    "answers": 1,
    "views": "382",
    "tags": [
        "disassembly",
        "ghidra",
        "motorola"
    ],
    "user": "hippietrail",
    "time": "Jun 8, 2020 at 3:19",
    "comments": [],
    "answers_data": [
        {
            "content": "Ghidra currently does not support the 6809 and there is not yet a feature request for it.\nThe 6805 and 6809 do have related instruction sets and opcodes but are neither forward nor backward compatible at a binary level.\nIn particular, the 6809 has two prefix opcodes: <pre><code>$10</code></pre> \"page 1\" and <pre><code>$11</code></pre> \"page two\". These are very common in 6809 code.\nBut on the 6805 and many of the chips ending in a smaller number the opcodes <pre><code>$10</code></pre> and <pre><code>$11</code></pre> are used for other instructions. On the 6805, <pre><code>$10</code></pre> is <pre><code>BSET</code></pre> and <pre><code>$11</code></pre> is <pre><code>BCLR</code></pre>.\nThere seem to be quite a few other differences but a side-by-side list of opcodes is not easy to find. In general, both chips have variable length instructions with some same opcodes used for different length instructions, so any attempt to use a tool for one chip on binary code for the other will get out of sync very quickly.\nHOLD THE PRESSES!\nAbout one minute after posting this answer as a result of a few hours of research I made a confusing discovery:\nAccording the the Ghidra source on GitHub, 6809 support was added in November 2019. You can see in the directory for the 6805 support:\nhttps://github.com/NationalSecurityAgency/ghidra/tree/master/Ghidra/Processors/6805/data/languages\n\n<pre><code>6809.cspec    Support Motorola M6809  7 months ago  \n6809.pspec    Support Motorola M6809  7 months ago  \n6809.slaspec  GT-3483: fixed sleigh error in 6x09 language spec.  5 months ago\n</code></pre>\n\nI'm using Ghidra version 9.1.12, released in February 2020 so this functionality should be there. Either it's missing due to a bug or I simply can't find the way to use it. It does not appear in the list of \"languages\" and there is no related option if you choose 6805 as the language.\nI've filed issue #1958 on Ghidra: https://github.com/NationalSecurityAgency/ghidra/issues/1958\n",
            "votes": "2",
            "user": "hippietrail",
            "time": "Jun 8, 2020 at 3:20",
            "is_accepted": false,
            "comments": []
        }
    ]
}