{
    "title": "How to retrieve name of a variable defined in the data segment in IDA when no process is attached?",
    "link": "https://reverseengineering.stackexchange.com/questions/25268/how-to-retrieve-name-of-a-variable-defined-in-the-data-segment-in-ida-when-no-pr",
    "content": "I have disassembled an old DOS application with IDA. It run in 16-bit real mode. Some instructions are referencing variables defined in the data segment (DS). \n<pre><code>push    word ptr ds:8401h\n</code></pre>\nSince I have imported debug symbols, I can display variable name by simply putting mouse over the <pre><code>ds:xxxxh</code></pre> part.\nThe problem is this only works when IDA is running in debug mode (eg: a DOSBox process is attached to it). Otherwise nothing is shown.\nOne possible explanation is that the data segment register (DS) is only set when application is running so IDA as no clue what value it is. In fact, the very first instructions of the program are dedicated to initializing the data segment : \n<pre><code>; entry point\nmov   dx, seg dseg \n...                     \n...                      ; a few instruction later\nmov   ds, dx\n</code></pre>\nI think this is how IDA is able to guess where the data segment is (which is reported as dseg in the Segments view). \nIn that application, DS is set once for good and never changed over the time. Is there a way to tell IDA it should assume DS is equal to a given value in the whole disassembly ? (so hovering those variables will give proper name even when no process is attached).\n",
    "votes": "0",
    "answers": 2,
    "views": "456",
    "tags": [
        "ida",
        "debugging",
        "symbols",
        "dos",
        "segmentation"
    ],
    "user": "tigrou",
    "time": "Jun 10, 2020 at 22:36",
    "comments": [],
    "answers_data": [
        {
            "content": "You need to set <pre><code>ds</code></pre> to the actual segment value used by the program. Usually it's one of the segments near the end. I suggest you to check which of the segments has something fitting at 8401h, or try to see how ds is set up in the calling function (you may need to go several levels up). You can also try to map the value you see in DOSBox debugger back to one of the segments in IDA (e.g. check what is at ds:0 and find it in database).\nIn the Alt-G dialog, you can enter the selector (paragraph) value of the segment (database, not runtime) or simply the segment name.\nIf all accesses in the current code segment use the same data segment, you can set it as the default in Edit-Segments-Set Default Segment Register Value...\n",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Jun 11, 2020 at 20:29",
            "is_accepted": true,
            "comments": [
                {
                    "user": "tigrou",
                    "text": "<span class=\"comment-copy\">The last part is exactly what I wanted. Thanks</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "You can press <pre><code>Ctrl+G</code></pre> and check the different settings of the segment registers.\nYou can press <pre><code>Alt+G</code></pre> to edit the segment registers.\n",
            "votes": "1",
            "user": "macro_controller",
            "time": "Jun 11, 2020 at 7:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "tigrou",
                    "text": "<span class=\"comment-copy\"><code>Ctrl+G</code> is indeed very useful. Thanks for the tip.  If I press <code>Alt+G</code>, select ds and enter some value (eg: 294C) nothing happen. All I have is \"assume ds:nothing\" added where the cursor is.</span>",
                    "time": null
                }
            ]
        }
    ]
}