{
    "title": "How to reverse engineer apks? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/25321/how-to-reverse-engineer-apks",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions asking for help reverse-engineering a specific system are off-topic unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem.\n\n\nClosed 4 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nis it possible to reverse engineer an apk just to unlock hidden/unreleased features?\n",
    "votes": "-2",
    "answers": 1,
    "views": "244",
    "tags": [
        "decompilation",
        "android",
        "malware",
        "patch-reversing",
        "apk"
    ],
    "user": "hanan",
    "time": "4 years ago",
    "comments": [
        {
            "user": "Robert",
            "text": "Note that developer can decide to deliver different app versions based on country, device  manufacturer, device model, ... Additionally beta versions can be released to a small percentage of users. Hence that someone is able to use a dark mode in an app does not have to mean that the app on your device has this feature, too. Usually reverse engineering an app takes you longer than it takes for the features you are looking for to be released on all phones. Especially Facebook apps are heavily obfuscated generated code that takes days or weeks to understand just the basics.\n",
            "time": null
        },
        {
            "user": "hanan",
            "text": "there are methods to start the features which are in the development phase. Well, of course, you will not get full fledged features as they are work in progress but it’s still fun to use them.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Try to learn the structure of the apk, learn SMALI, understand how the apk works, after understanding what your calls are like and learning smali, it is essential to be able to make calls from resources, but stay tuned for apk protections , even considering a somewhat rare factor, there are also several online tools to assist in this factor, with a simple search for smali studio you will find, good luck;\n",
            "votes": "1",
            "user": "Happy",
            "time": "Jun 17, 2020 at 11:57",
            "is_accepted": false,
            "comments": [
                {
                    "user": "hanan",
                    "text": "<span class=\"comment-copy\">could you please clarify \"make calls from resources\"?</span>",
                    "time": null
                },
                {
                    "user": "Happy",
                    "text": "<span class=\"comment-copy\">look for calls to methods, which in your \"analysis\" refer to the resource you want to search for, modify any constant using the operator \"const v0, 0\", to modify or release the resource, also check the application traffic, which it is entering and leaving, through a proxy, these are just some ideas that I hope will be useful to you.</span>",
                    "time": null
                },
                {
                    "user": "hanan",
                    "text": "<span class=\"comment-copy\">I believe your suggestions are generic! for instance monitoring app traffic is trivial IMO.</span>",
                    "time": null
                }
            ]
        }
    ]
}