{
    "title": "Segmentation fault after export binary file in Ghidra even without any changes [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/25427/segmentation-fault-after-export-binary-file-in-ghidra-even-without-any-changes",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 4 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI trying solve some https://crackmes.one/ simple quests. I newbie on it. But after export binary file (even without any changes), when I run the program in the terminal, I get the message \"segmentation fault\".\nI use ghidra 9.1.2 in Kali Linux in VBox with 5 CPUs and 8 Gb RAM. Host: Ryzen 5 3600, 16 Gb DDR4.\nI have record a video with demo of reproducing this issue: https://www.youtube.com/watch?v=M4RKXHRBNM8\\\nBut I don't have such problems when I try solve windows <pre><code>exe</code></pre> crackmes on my host Windows 10 machine.\nAlso I note that after analysis in bookmarks appeared message with description: <pre><code>Non-Returning Function Identified</code></pre> with any crackmes.\n",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ghidra",
        "crackme"
    ],
    "user": "Michael",
    "time": "4 years ago",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "Ghidra's export is not working as you would expect - it's not producing valid file. It's a knows issue (but as I was looking for the issue number I can see you've already went there) - link\n",
            "time": null
        },
        {
            "user": "Michael",
            "text": "@PawełŁukasik yes. And in related issue github.com/NationalSecurityAgency/ghidra/issues/… I found related python script for ghidra that helps solve this issue. Also it's looks like that issues like this tracked and should be resolved with related PR: github.com/NationalSecurityAgency/ghidra/pull/1505\n",
            "time": null
        },
        {
            "user": "Michael",
            "text": "According to many comments in related issues community around ghidra are waiting for this functionality allowing patching binaries\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "If you found a reliable solution I would recommend writing it here as an answer for future seekers.\n",
            "time": null
        },
        {
            "user": "peter ferrie",
            "text": "I’m voting to close this question because this is application-specific behaviour, not reverse-engineering.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "While searching solution for my question I found related issue in GitHub repository of project: NationalSecurityAgency/ghidra#issue-19.\nAccording to many comments, community around ghidra are waiting for this functionality allowing patching binaries.\nIn this comment: NationalSecurityAgency/ghidra/issue-19#issuecomment-560485351 @schlafwandler offers own Python script that should solve the issue and it is works for me on Kali Linux. On Windows 10 I still did not get such problems, so I don't need to use additional tools like this.\nAlso issue closed with link to related open PR: https://github.com/NationalSecurityAgency/ghidra/pull/1505 (ElfExporter and PeExporter)\n",
            "votes": "2",
            "user": "Michael",
            "time": "Jul 2, 2020 at 7:41",
            "is_accepted": false,
            "comments": []
        }
    ]
}