{
    "title": "PDB v2.0 File Format documentation",
    "link": "https://reverseengineering.stackexchange.com/questions/2548/pdb-v2-0-file-format-documentation",
    "content": "Where I can find such information? I've already read the undocumented windows 2000 secrets explanation of it but it isn't complete. For example the 3rd stream format isn't explained. I have looked at this, where some general info about the streams is given but nothing more.\n",
    "votes": "7",
    "answers": 4,
    "views": "5k",
    "tags": [
        "file-format",
        "pdb"
    ],
    "user": "sasho648",
    "time": "Jul 31, 2013 at 16:55",
    "comments": [
        {
            "user": "sasho648",
            "text": "Thanks for your answers! I looked at the links given. It really seems that this file format isn't very documented. I read this article and I'm wondering where this \"allocation bit array\" is stored in the file?\n",
            "time": null
        },
        {
            "user": "Jonathan Dickinson",
            "text": "If anyone is still looking for information I've nailed down reading and writing PDB 7.0 (MSF 7.00). The code is much clearer than other projects so you might want to refer to it: github.com/jcdickinson/symblr/tree/master/Symblr.Core/Symbols/…\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can find some information about PDB on the blog of PDBParse's author:\n\nhttp://moyix.blogspot.fr/2007/08/pdb-stream-decomposition.html\nhttp://moyix.blogspot.fr/2007/10/types-stream.html\n\nThis article is a good resource about PDB :\n\nhttp://www.debuginfo.com/articles/debuginfomatch.html\n\nOther link on the subject :\n\nhttp://www.informit.com/articles/article.aspx?p=22685\nhttp://www.informit.com/articles/article.aspx?p=22429&seqNum=5\nhttp://www.wintellect.com/blogs/jrobbins/pdb-files-what-every-developer-must-know\n\nI hope you will find your happiness in these links ;)\n",
            "votes": "7",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "Here is something directly from Microsoft.\nhttps://github.com/Microsoft/microsoft-pdb\n",
            "votes": "9",
            "user": "user1961213",
            "time": "Oct 30, 2015 at 20:20",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">Straight from the horse's mouth, as the saying goes: \"Open source, from Microsoft with love\". Well found! (How did you come across it?)</span>",
                    "time": null
                },
                {
                    "user": "phuclv",
                    "text": "<span class=\"comment-copy\">@usr2564301 probably he read some news about that when <a href=\"https://arstechnica.com/gadgets/2018/03/chrome-on-windows-ditches-microsofts-compiler-now-uses-clang/\" rel=\"nofollow noreferrer\">Google started working on switching to Clang</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Since the format is internal to Microsoft you likely won't find any official documentation. The best bet is various reverse engineering efforts on the format:\n\nPDB Parser (the one you found)\nPDBparse (in Python)\nWine project has a partial implementation of dbghelp.dll, including PDB parsing.\n\nP.S. I just remembered that there is an open-source Microsoft project called \"CCI Metadata\" which does provide some C# code for reading and writing PDB files. Not sure about the legality of using it to make your own PDB parser, but it does provide information which is probably as the close to official docs as you can get.\n",
            "votes": "4",
            "user": "Igor Skochinsky",
            "time": "Jul 28, 2013 at 19:24",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "This is what I've found:\n\nExploring Symbol Type Information with PdbXtract - from Mendiat.\n\n\nPdbXtract is not a pure PDB parser. It only extracts type information using Microsoft’s DebugInterface Access (DIA) COM.  If you are interested in just parsing/dumping raw PDB information, there are a few alternatives out there to DIA, including Volatility’s open source pdbparse (http://code.google.com/p/pdbparse/) or the PDB utility that comes with the Undocumented Windows 2000 Secrets book.  However, most of the practical tools I have seen that operate on PDB’s use DIA, including Microsoft’s own Dia2dump, this one http://www.codeproject.com/Articles/37456/How-To-Inspect-the-Content-of-a-Program-Database-P and this one http://www.ishani.org/web/articles/obsolete/pdb-cracking-tool/, to name a few.  To reiterate, PdbXtract does not parse or capture the wealth of other information available in a PDB, including:  functions, debug streams, modules, publics, globals, files, section information, injected sources, source files, OEM specific types, compilands, and others.  \n\n\nHelp me to read .pdb file - from stackoverflow\n",
            "votes": "4",
            "user": "0xC0000022L",
            "time": "Jul 5, 2018 at 9:38",
            "is_accepted": false,
            "comments": []
        }
    ]
}