{
    "title": "strange results with IDA (some function different Pseudo Code)",
    "link": "https://reverseengineering.stackexchange.com/questions/25511/strange-results-with-ida-some-function-different-pseudo-code",
    "content": "After show the pseudo code in IDA I see different results:\n\n\nThe function 4436C0 show different pseudo code.\nFor example:\n<pre><code>result = sub_4376C0(\"vvcbb3.wav\",v8,0);\n</code></pre>\nand\n<pre><code>result = sub_4376C0((int)\"vvcbb3.wav\",v8,0);\n</code></pre>\nHave you never seen a similar situation?\nIt is a IDA bug ?\n",
    "votes": "0",
    "answers": 0,
    "views": "78",
    "tags": [
        "ida",
        "disassembly",
        "assembly"
    ],
    "user": "user3449922",
    "time": "Jul 17, 2020 at 7:28",
    "comments": [
        {
            "user": "sudhackar",
            "text": "Hi! A couple of points you need to mention to make this question better 1. Post code as text instead of pictures 2. Please add more details on what's the exact \"result\" that you were expecting and what's happening. Also add more context to the problem if you can.\n",
            "time": null
        },
        {
            "user": "sudhackar",
            "text": "If you open a function in decompile view in IDA, IDA will try to guess the type of the function args based heuristics such as the operations that are performed over them. You might have decompiled <pre><code>sub_4376C0</code></pre> after you took the first screenshot and then return back to <pre><code>sub_4436C0</code></pre>\n",
            "time": null
        },
        {
            "user": "user3449922",
            "text": "Thank you !!!I have hook correct the function sub_4376C0 and work fine. but the first parameter is a integer and I need get the real string value passed \"vvcbb3.wav\" inside this function:  result = sub_4376C0((int)\"vvcbb3.wav\",v8,0);   sub_4376C0(int a1, int a2, int a3)  Do you known how I can get the string passed of the first parameter ?\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "You can modify the function definition at any time in IDA. by doing so you can change the type of every parameter or even add/remove parameters that have been detected incorrectly (assuming you know the exact function definition).\n",
            "time": null
        },
        {
            "user": "user3449922",
            "text": "thank you Robert, if possible I like to avoid to update the game exe. For your opinion is possible get the string value by modify my hook.dll c++ source code ?\n",
            "time": null
        }
    ],
    "answers_data": []
}