{
    "title": "how to deobfuscate to java zkm?",
    "link": "https://reverseengineering.stackexchange.com/questions/25608/how-to-deobfuscate-to-java-zkm",
    "content": "I will have a question for you, dear forum residents. I have a .jar file encrypted with ZKM which I think will work for me. I don't know how to decrypt this, can you help me?\n",
    "votes": "-3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "java",
        "jar"
    ],
    "user": "SONIC NIX",
    "time": "Aug 4, 2020 at 22:50",
    "comments": [
        {
            "user": "Robert",
            "text": "ZKM (Zelix KlassMaster) by default obfuscates code, not encrypts it (exception: strings). Therefore there is no decryption. The names that have been obfuscated are gone unless ZKM forgot some identifier which can be used to reconstruct the original class name (but I don't think that the ZKM authors made such a mistake).\n",
            "time": null
        },
        {
            "user": "SONIC NIX",
            "text": "So we can't remove it from this software?\n",
            "time": null
        },
        {
            "user": "peter ferrie",
            "text": "I’m voting to close this question because not related to reverse-engineering.\n",
            "time": null
        },
        {
            "user": "ikaerom",
            "text": "I also vote to close this question. In case the OP wanted to know how to decompile the JAR file, I suggest benf.org/other/cfr with obfuscation mapping files.\n",
            "time": null
        },
        {
            "user": "Col-E",
            "text": "I don't agree with closing the issue. OP made a grammatical mistake, using \"decrypt\" instead of \"deobfuscate\". There clearly exist solutions for this sort of problem and I don't see how this could possibly be justified for closure under the premise of \"not related to reverse-engineering\" aside from the lack of awareness of the subject matter.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There are a few open source tools that make removing obfuscation patterns quite easy. Some have explicit support for ZKM. Here are are the two popular ones:\n\nhttps://github.com/java-deobfuscator/deobfuscator\nhttps://github.com/GraxCode/threadtear\n\nAnd here is one specifically for android:\n\nhttps://github.com/CalebFenton/simplify\n",
            "votes": "1",
            "user": "Col-E",
            "time": "Aug 18, 2020 at 17:40",
            "is_accepted": false,
            "comments": []
        }
    ]
}