{
    "title": "What are these pads called, what can I solder to them and could I do any damage?",
    "link": "https://reverseengineering.stackexchange.com/questions/25648/what-are-these-pads-called-what-can-i-solder-to-them-and-could-i-do-any-damage",
    "content": "I am wondering what this is called (those are 1 and 2 cm marks, divided into 1 mm segments):\n\nI'm fairly certain it's not JST. I think the two larger pads are used to hold whatever connector is soldered to the ten smaller ones. Similar to a USB-A female jack. Pin header could be, but the two larger pads make less sense then. Maybe a 9-pin D-Sub could go there (the RX/TX can also be accessed from the reverse at about the same location), but then there is one soldering pad too much. I've looked for a number of SMD components which may be a match, but came up empty-handed.\nSometimes when looking at an item I lack the correct terminology. This is such a case. What is this called? What sort of connector can I solder on and is there any chance (as long as I get the soldering right) that merely soldering something to it will damage it, i.e. without connecting/shorting anything? ...\n\nThe location where the ruler is, also happens to be the edge of the board. The PCB is out of an automative entertainment system. It was built in 2014 or 2015, but designed probably around 4-5 years before, by all accounts I could find. And to my knowledge its design is actually based on even earlier designs. This side of the PCB is labeled \"TOP\" somewhere at the edge.\n\n\nThe pads in question are on the edge shown at the bottom of the photo. This photo shows the top-side of the PCB. You can see there are two locations with this configuration of soldering pads. The photo at the top is from the right one.\nThe board is a SMEG+ from Magneti Marelli as built into PSA cars.\n",
    "votes": "2",
    "answers": 0,
    "views": "177",
    "tags": [
        "hardware"
    ],
    "user": "0xC0000022L",
    "time": "Aug 11, 2020 at 14:32",
    "comments": [
        {
            "user": "Chris Stratton",
            "text": "My guess would be a socket for a relatively low density flat flex cable, but determining the context in the equipment would help.  If it's only the tape measure giving a false impression of being at the edge of the board then I'd consider various card sockets.  The question really needs more supporting information.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "@ChrisStratton this is the edge of the board. Sorry, this was actually clear from the previous image (I replaced it after figuring that the measurements may be of relevance). What more supporting information could I give? Perhaps the edit clarifies enough. Let me know what else I could add. It's the issue with asking about a domain you know little of, because sometimes you don't even know what info would be valuable.\n",
            "time": null
        },
        {
            "user": "Chris Stratton",
            "text": "A picture of the board overall would be really key to identifying the purpose.   For the specific part, work out the pin center to center spacing and that of the mounting pads, then go on digikey and look for ffc connectors with the right pin count and spacing.   Depending in the goal 30 AWG silicone insulated wire could be an option to a connector if you just need a few of the signals.  While it might be an AUX input or CD changer control it might also be an alternate display or control panel, alas it may be nothing without different firmware.\n",
            "time": null
        },
        {
            "user": "Chris Stratton",
            "text": "If it's for some accessory I wouldn't be surprised if there's some sort of digital communication channel in addition to possible audio, but I don't know that it would be a UART.  Is that nearby LQFP by any chance a recognizable MCU?  I'd also try to figure out what the small surface mount IC nearby is and if it is connected, if it's some sort of line driver/receiver that would be a clue.   Your best bet to doing something useful with this though may be to either get into the software such that you can do things, or find a comparable product where this port was used.\n",
            "time": null
        },
        {
            "user": "Remko",
            "text": "It's quite common for these type of devices (I've looked at VAG & BMW in the past) to have a serial/console port. However I'd expect tx,rx,gnd and you have more connections\n",
            "time": null
        }
    ],
    "answers_data": []
}