{
    "title": "Trying to decode the Ontario Driver's License #",
    "link": "https://reverseengineering.stackexchange.com/questions/25693/trying-to-decode-the-ontario-drivers-license",
    "content": "<pre><code>**The Ontario Driver's License follows the below format:**\n</code></pre>\nLXxxx-FFFMY-YMMDD\nWhere:\n\nL is the first letter of your last name\n\nX is a numeric encoding of the last name (See Chart 1 below)\n\nxxx is a numeric coding of the last name. it appears no one has been able to decipher xxx (At this point in time) Some sort of soundex variation. That being said from my research every last name matching will have the exact same code here. For example, the last name of Smith will always be 778 (or S5778 if you include L & X). If you have access to a number of DL #'s and can pick out a large number of Last name's with their designated codes, you will over time be able to properly track the full driver's license combination.\n\nFFF is a numeric encoding of the first name. It follows a similar coding to the first name 3 digits, however, is a totally separate string of numbers. From my research I have found that these 3 numbers will also always be the same on a driver's license of someone matching the same first name. If you have access to collect a large number of first names you will be able to connect those with the collected last name code in order to guess the full proper driver's license # values.\n\nM is a numeric encoding of the middle name (See Chart 2 below)\n\nYY is the last 2 digits of year of birth\n\nMM is the month of birth, ranges 01-12 for males, 51-62 for females (add 50 to the month for females)\n\nDD is the day of birth\n\nChart 1\n\n0 - A\n1 - B,C,D\n2 - E\n3 - F,G,H\n4 - I,J,K\n5 - L,M,N\n6 - 0\n7 - P,Q,R\n8 - S,T\n9 - U,V,W,X,Y,Z\n\n\nChart 2\n\n1 - A\n2 - C,D\n3 - E,F,\n4 - G,H,\n5 - J,K,\n6 - L,M,N\n7 - P,Q,R\n8 - S,T,\n9 - W\n0 - Y,Z,\n\n\n\nI still have not found where B,I,O,U,V, or X falls on this chart. If you know anyone whose middle name starts with one of these letters please ask them what the 9th digit of their license is, this will give you that specific value for the chart. Also, I will mention that if a license has no middle name, the 9th digit is always a 0.\nI guess at this point I am looking for some additional direction on how digits 3-8 are calculated using an actual formula instead of tracking all possible outcomes as I come across them.\nOn a side note if anyone needs some explanation on how to decode Quebec License #'s I have some additional information available.\n",
    "votes": "6",
    "answers": 2,
    "views": "27k",
    "tags": [
        "encryption",
        "encodings"
    ],
    "user": "DTS",
    "time": "May 6, 2023 at 20:42",
    "comments": [
        {
            "user": "mkst",
            "text": "I see a fun codegolf challenge once this is decoded... not sure it's right for RE though?\n",
            "time": null
        },
        {
            "user": "confused",
            "text": "can some one please explain how does this chart works. like its hard for me to comprehend how does smith will be 778 NOT 86484(CHART2) any input is appriciated. i have spent last 4 hours looking for the answer\n",
            "time": null
        },
        {
            "user": "AlexR",
            "text": "I know it's been 2 years since this post, but can you share the info for Quebec? Do you know if it also has a control digit at the end (checksum)? (I can't comment, new profile).\n",
            "time": null
        },
        {
            "user": "wifizak",
            "text": "any news ? im working in a project at school about this ? i was able to find how quebec works but i need ontario now\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "@wifizak the two answers don't help?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Just let you know, anyone with same last name will have same first 4 numbers regardless of what their first name is.\nYou can see this with Chinese last names. Anyone with last name Chen, by the way, it will ALWAYS be C3344.\nExample:\n\nCHEN, Jian-Bo: C3344 - 40108\nCHEN, Meng: C3344 - 53908\nCHEN, Yuan C3344 - 49008\n\nThe same goes for people with a last name like ZHEN.\nZ3344.\nNow to compare two very similar names:\n\nCHEN, Meng:  C3344 - 53908\nCHEN, Ming: C3344 - 55608\n<pre><code>*note that the last digit, 8, should be ignored as the 8 is part of the last 6 digits, which is a series of numbers that represent your birthdate. It is not associated with your name and therefore can be disregarded</code></pre>\n\nBut then for Last name CHAN, it is\nC3175\n\nCHAN, Kingsley: C3175 43598\n\nCompare a similar name:\n\nCHAN, Kimberly: C3175 43568\n\n<pre><code>*again, the last digit for both names is associated with birth date, and can be disregarded.</code></pre>\nfor the last names WANG, TANG &\nYANG it is the same.\n\nWANG, xuan: W0418 - 78908\nYANG, zhenfei: Y0418- 79608\nTANG, jiasheng: T0418 40109\n\n<pre><code>(^ Note the similarities between Wang, Xuan and Yang, Zhenfei. Last digit 8 can be disregarded )</code></pre>\nI have heard that first numbers are indeed last name but only maybe the first 2 (starting from your 2nd letter) and then the last 2 letters.)\nI've heard that the middle numbers are the first names but might exclude certain letters or all vowels of the alphabet, or have some letters may have two digits, and m vowels. And that a single number can represent multiple letters, of course.\nI've also heard it might get even more complex - with things like if a letter in the name is followed by a specific  letter, then both letters become a different number.\n<pre><code>(*i read somewhere that new jersey uses the same system for coding licenses. You can find the actual new jersey license coding information online however idk if this is still how its done, I wouldn't bet on it.)*\n</code></pre>\n\nhowever  despite this, the middle numbers are very difficult to correctly code because of the simple reason: there is the case where 2 or more people may have the exact same name, and same birthday, and are of same sex. These people will still have at least 1 or 2 numbers of the middle sequence that are different. This may actually be randomized.\n\nAnyways, moving on. More examples.\nFor the last name\n\nZHANG , Jiwei: Z3187 20408\nZHANG  Shuyu: Z3187 70909\n\n2 letter last names will have many zeros. Double or triple Zeros seem to appear when there is a lack of letters for the code. L\n\nOU, min chun: O9001- 55528\nMA, wen-bo: M0001 - 78009\nHA, somang: H0001 71808\nLI, L4001\nYU, Y9001\n\nAlso, I'm sure u know the last digits are birthday but for females, you add +50 to the month number. If you're a girl born in January, which is 01, the code will put 51. (Because 01+50=51. Then  followed by ur day of birth at the end.\n",
            "votes": "2",
            "user": "user43371",
            "time": "Mar 8, 2023 at 1:03",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Chart 2\n\n\n\n\nCode\nEncode\n\n\n\n\nA\n1\n\n\nB\n1\n\n\nC\n2\n\n\nD\n2\n\n\nE\n3\n\n\nF\n3\n\n\nG\n4\n\n\nH\n4\n\n\nI\n4\n\n\nJ\n5\n\n\nK\n5\n\n\nL\n6\n\n\nM\n6\n\n\nN\n6\n\n\nO\n7\n\n\nP\n7\n\n\nQ\n7\n\n\nR\n7\n\n\nS\n8\n\n\nT\n8\n\n\nU\n8\n\n\nV\n8\n\n\nX\n9\n\n\nY\n9\n\n\nZ\n9\n\n\n\n\nNOTE: This data was empirically determined.\n",
            "votes": "2",
            "user": "0xC0000022L",
            "time": "Aug 10, 2023 at 22:16",
            "is_accepted": false,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">Where did you find this information or how did you come up with it?</span>",
                    "time": null
                },
                {
                    "user": "Batak",
                    "text": "<span class=\"comment-copy\">Ask few volunteers to crosscheck it and came correct so thought to share.</span>",
                    "time": null
                }
            ]
        }
    ]
}