{
    "title": "Deobfuscating Unknown C# obfuscator?",
    "link": "https://reverseengineering.stackexchange.com/questions/25705/deobfuscating-unknown-c-obfuscator",
    "content": "Hello,\nI am having an exe file that I am trying to deobfuscate and debug using dnspy. The exe file was written in C# and obfuscated with unknown deobfuscate according to de4dot! I tried to all my known methods to procced but still I was not able to fully deobfusticated it.\n\nAnalysing the File\n- Exeinfo PE\nI tried to analysie the file with exeinfope to check which obfustactor was used but I only got [obfus/crypted].\nMicrosoft Visual C# / Basic.NET / MS Visual Basic 2005 [ Obfus/Crypted- StrongName set ]  - EP Token : 06000080 ,\nOverlay : 403900... Nothing discovered\n\n- Dnspy\nOpening the file in dnspy but the code wasn't readable, especially the methods and the functions name are in unicode form.\n\n\nMy Attempts:\n\nTried to deobfustace the file with de4dot, but I get \"Detected Unknown Obfuscator\" followed by an error.\nTried a modded version of de4dot, and I was able to deobfustacte the exe,but all functions shown as \"delegate\". The exe file was detected as \"Unkown Obfustactor\" as well, but managed to cleaned it.\n\nTried to debug the cleaned verison but when I start dnspy I get an exception (System.NullReferenceException)\n\n\n\nMy Questions:\n\nWhich obfustactor was used ?\nWhy all functions are defined as \"delgate\"?\nWhy did I get the null exception while debugging\n\nThanks...\n\nUPDATE 20/08/2020\nWhile looking through the code, I found that all \"delegate\" calls are referred to a function which takes an intger but I couldn't find any obvious return from this function, what I do think it returns the function and method name but... HOW!!\n",
    "votes": "5",
    "answers": 0,
    "views": "15k",
    "tags": [
        "deobfuscation",
        ".net",
        "c#"
    ],
    "user": "mo5br",
    "time": "Aug 20, 2020 at 20:23",
    "comments": [
        {
            "user": "Col-E",
            "text": "I do not know which one specifically, but perhaps one of the deobfuscators aside from de4dot can help? - github.com/NotPrab/.NET-Deobfuscator\n",
            "time": null
        },
        {
            "user": "mo5br",
            "text": "Thanks, but still I haven't accomplished anything with the list, but it's a really good list to keep.. I appreciate it.\n",
            "time": null
        },
        {
            "user": "mike bria",
            "text": "I have the same problem, I have tried many tools, but after deobfuscation, the program doesn't work\n",
            "time": null
        },
        {
            "user": "Mastercodeon",
            "text": "This looks like a crypto obfuscator assembly, get in touch with me and i might be able to run a tool i developed to deob this kind of obfuscated code.\n",
            "time": null
        },
        {
            "user": "chentiangemalc",
            "text": "Can you take a TTD trace of the app launching? docs.microsoft.com/en-us/windows-hardware/drivers/debugger/… This could be used to analyze what is going on, but it may or may not work, and needs some familiarity with windbg and the sos/sosex extensions to use effectively\n",
            "time": null
        }
    ],
    "answers_data": []
}