{
    "title": "How are strokes stored in the Goodnotes file format?",
    "link": "https://reverseengineering.stackexchange.com/questions/25731/how-are-strokes-stored-in-the-goodnotes-file-format",
    "content": "I have been trying to reverse engineer the .goodnotes file format (a note taking app for iOS devices) and so far have discovered this:\n\nA .goodnotes file is simply a zip archive, an example file extracted has the following hierarchy:\n\n<pre><code>attachments/\n    1AF85389-413A-4C21-8EF5-C0603033CBF8\nindex.attachments.pb\nindex.events.pb\nindex.notes.pb\nindex.search.pb\nnotes/\n    30F8BBBA-710B-4BEC-A90B-49DFCEF05035\nsearch/\n    1AF85389-413A-4C21-8EF5-C0603033CBF8\nthumbnail.jpg\n</code></pre>\n\nIt is likely the strokes are stored within the notes/ directory and separated by page (if an empty page is added the corresponding notes file is zero bytes)\nThe files named by ID could be binary protobuf files, though I'm not sure and all efforts to reverse engineer the protobuf schema has failed\n",
    "votes": "1",
    "answers": 0,
    "views": "772",
    "tags": [
        "file-format",
        "ios"
    ],
    "user": "Jake Davis",
    "time": "Aug 25, 2020 at 8:23",
    "comments": [
        {
            "user": "perror",
            "text": "What is your question ?\n",
            "time": null
        },
        {
            "user": "Ian Cook",
            "text": "Sharing exactly what you've tried and ruled out might help others avoid wasting time ?\n",
            "time": null
        },
        {
            "user": "alessionossa",
            "text": "I wrote about it reddit.com/r/RELounge/comments/jvutht/…\n",
            "time": null
        },
        {
            "user": "Martin L.",
            "text": "I just hopped in this thread because I was searching for a possibility to reuse GoodNotes Files on my Linux Machine ... The reddit-Thread referenced above ends around March 2021 with no real conclusion and has been archived in the meantime. There is an IMHO related question on askubuntu from July '18 but no real progress as far as I could find. Does anyone have news on this subject?\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. I understand it takes some getting used to, but this is no forum. We are a Q&A site and that means no discussion outside of comments (which, I get that, you cannot yet write on account of your reputation points). So I converted your \"question\" into a comment as it is commentary.\n",
            "time": null
        }
    ],
    "answers_data": []
}