{
    "title": "Get a networkx graph from the the function call-graph of the file using IDApython?",
    "link": "https://reverseengineering.stackexchange.com/questions/25848/get-a-networkx-graph-from-the-the-function-call-graph-of-the-file-using-idapytho",
    "content": "Is there any easy way to get a function call graph of a binary program using IDApython then convert it to a networkx graph other than going through every function and constructing the call-graph ourselves?\nBasically i want to have a call graph that i can tell which nodes are library calls and which are locals, and not including functions that are called by libraries ( so i dont go deep into nested library functions calling each other)\ni tried gen_simple_call_chart() but there are two big problems :\n\nthere is no difference between library nodes and local nodes in the generated DOT file (no color or anything)\n\nCHART_IGNORE_LIB_FROM doesnt work, i dont want to include nodes that are called by library calls :(\n\n\nFor example all the nodes are black no matter library or local :\n<pre><code>\"205\" [ label = \"sub_40AF20\", pencolor = black ];\n\"206\" [ label = \"ShellExecuteW\", pencolor = black ];\n</code></pre>\n",
    "votes": "1",
    "answers": 1,
    "views": "617",
    "tags": [
        "ida",
        "idapython",
        "idapro-sdk",
        "ida-plugin"
    ],
    "user": "OneAndOnly",
    "time": "Sep 11, 2020 at 16:09",
    "comments": [
        {
            "user": "sudhackar",
            "text": "Did you try sark? It's built on top of networkx and idapython.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can generate graphs in the DOT format by calling <pre><code>gen_flow_graph()</code></pre> with the <pre><code>CHART_GEN_DOT</code></pre> flag.\nThe DOT file can then be imported into networkx using the <pre><code>from_pydot()</code></pre> function.\n",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Sep 11, 2020 at 14:15",
            "is_accepted": true,
            "comments": [
                {
                    "user": "OneAndOnly",
                    "text": "<span class=\"comment-copy\">Thanks for answer! (although for function call graph it seems to be gen_simple_call_chart), but there are two big problems : 1. there is no difference between library nodes and local nodes in the generated DOT file (no color or anything), 2. CHART_IGNORE_LIB_FROM  doesnt work, i dont want to include nodes that are called by library calls :(</span>",
                    "time": null
                },
                {
                    "user": "OneAndOnly",
                    "text": "<span class=\"comment-copy\">i edited to question to include part of the .dot file, as you can see all the nodes are black and it also includes nodes that are even called by libraries even tho i used CHART_IGNORE_LIB_FROM, i tried CHART_IGNORE_LIB_TO as well just to check but no luck.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">I’ve answered the question as originally asked (get networkx graph from IDA). The graph being different from what you need is another issue. I suggest you contacting Hex-Rays support to confirm if issues you found are a bug and/or get a fix.</span>",
                    "time": null
                }
            ]
        }
    ]
}