{
    "title": "Ransomware Source Codes [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/25885/ransomware-source-codes",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 4 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nHave been searching ransomware source codes for analysis(as much as possible). I have already checked with sites like Any.Run but most of their samples are .exe and binary files. Does any one have any leads to a place I can get the source codes especially for ransomware?\n",
    "votes": "-1",
    "answers": 2,
    "views": "232",
    "tags": [
        "malware",
        "ransomware"
    ],
    "user": "Stanley Canrold",
    "time": "4 years ago",
    "comments": [
        {
            "user": "peter ferrie",
            "text": "I’m voting to close this question because we're not a VX site.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "In addition to Peter's remark there is nothing that has to do with reverse engineering in this question. It's more along the lines of software development, even though you claim it's just for analysis.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Here are some links you may find helpful:\n\nhttps://github.com/goliate/hidden-tear\nhttps://github.com/mauri870/ransomware\nPDF, containing some interesting links\n\nYou can also look for MSIL binaries, deobfuscate using de4dot and decompile using dnSpy. If sample is not strongly protected, you will get output as readable as the source code.\n",
            "votes": "0",
            "user": "bart1e",
            "time": "Sep 21, 2020 at 15:44",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "Nobody is going to publish their source code for active ransomware, there are various reasons for that:\n\nIts a business and the author makes money from it, and by giving away the source code there is a competitor. Of course that is not wanted\nIt is possible that someone will find weaknesses, obviously that is possible for binaries aswell but usually it's easier with the source code, that could allow decryption without paying\nIf it's \"only for educational purposes\" it will get abused. I'm 100% sure on that one, so this has to be considered aswell\n\nA few years ago I saw a sample ransomware on GitHub, maybe that is a good starting point.\n",
            "votes": "1",
            "user": "Richi",
            "time": "Sep 17, 2020 at 9:57",
            "is_accepted": false,
            "comments": []
        }
    ]
}