{
    "title": "How to open new window of decompiler or resize the decompiler of Ghidra?",
    "link": "https://reverseengineering.stackexchange.com/questions/25910/how-to-open-new-window-of-decompiler-or-resize-the-decompiler-of-ghidra",
    "content": "This is very small and inconvenient to read. How do i open new Window (any shortcut key) or resize it, for some reason i cant resize.\nAny help?\nEDIT: Oh thanks Shane Riley, i clicked the blue button and suddenly it opened a new dialog box this is what i wanted. Then when i clicked closes, the Ghidra looks like this and i got my answer, the blue Cf like thing opened new dialog box\n",
    "votes": "1",
    "answers": 1,
    "views": "5k",
    "tags": [
        "debugging",
        "elf",
        "ghidra",
        "binary",
        "decompiler"
    ],
    "user": "Machine Yadav",
    "time": "Sep 16, 2020 at 16:17",
    "comments": [
        {
            "user": "Machine Yadav",
            "text": "My mouse pointer turns sth else when going to top left corner or botoom left corner but pulling it doesnt resize\n",
            "time": null
        },
        {
            "user": "Shane Reilly",
            "text": "Click on the top part (the part that turns blue when active) and hold and you can drag it out of the screen to make it a pop up or place it in a different section.\n",
            "time": null
        },
        {
            "user": "Machine Yadav",
            "text": "Thanks @ShaneReilly i got my answer now how to bring that box back as you see in my new pic there is no decompiler box\n",
            "time": null
        },
        {
            "user": "Shane Reilly",
            "text": "If you closed it, you can reopen it by clicking <pre><code>Window</code></pre> and then <pre><code>Decompiler</code></pre>. If it is off the screen and you want to drag it back, click and hold the bar at the top of the window, and drag it back in the main Ghidra screen.\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "Someone please add a proper answer\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can click on the top part of the desired window (which is blue in color when selected, and which has the title of the window written in it). You can then hold and drag it out of the screen.\nAt this point, it may appear weird that only this title bar is moving with your mouse, but try releasing the mouse button while this title bar is someone outside the ghidra screen, e.g., on another monitor even. You'll find that the window pops out and you can resize it, etc., as you please.\nIf on the other hand, you release it somewhere else within the ghidra screen, that repositions the window, possibly opening another tab to share the space with existing window(s) in that location.\n",
            "votes": "1",
            "user": "auspicious99",
            "time": "Jan 6, 2021 at 14:55",
            "is_accepted": true,
            "comments": []
        }
    ]
}