{
    "title": "Decode lua scripts for cocos2d based game / frida, android",
    "link": "https://reverseengineering.stackexchange.com/questions/25921/decode-lua-scripts-for-cocos2d-based-game-frida-android",
    "content": "I'm trying to decrypt LUA scripts from cocos2dx game (for wiki).\nIn most cases, it's XXTEA based, but not in this case.\nThe game itself:\nhttps://apkpure.com/might-magic-era-of-chaos/com.ubisoft.might.magic.heroes.fantasy.rpg\nI'm tried to use Frida. Works fine in Android emulator, not a problem to attach and check some methods calls with parameters.... but some methods are not detected, looks like protection hides them.\nInteresting, but all lua files are starting with \"16c652b86b5b0bc516920e6cd3c3a074\" (16 bites) prefix, but it's not a key for XXTEA algo.\n",
    "votes": "2",
    "answers": 2,
    "views": "3k",
    "tags": [
        "android",
        "frida",
        "lua"
    ],
    "user": "user3347749",
    "time": "May 6, 2021 at 15:09",
    "comments": [
        {
            "user": "morsisko",
            "text": "What is your current progress on reversing the game?\n",
            "time": null
        },
        {
            "user": "user3347749",
            "text": "Hi morsisko, some part are funny... due bugly + android emulation frida is not able to attach to some methods... would be easy to get lua content via hooks in \"lua_loadx\", \"luaL_loadfilex\" and \"luaL_loadbufferx\". this game has another (looks like AES based) encription for files for cocos2d engine, correcly to say for resources (.lua and .png files).\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "use ida pro or ghidra to find the decryption function.\nif you attach to the process on a real phone you can hook the xxtea function and the 16 bytes at the 3rd argument pointer will be the key.\n",
            "votes": "1",
            "user": "guest",
            "time": "Apr 6, 2021 at 11:17",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "i have done something similar with another game before where i use frida to hook the function <pre><code>luaL_loadbuffer</code></pre> and dump the decrypted lua files from there.\ni wrote about it here https://github.com/chrisli-03/cocos2dx-game-reverse-engineer on step 6. you cant use emulator for this, must be a real device (at least its like that for me).\ncant guarantee it will work but might give you some clues.\n",
            "votes": "1",
            "user": "Chris Li",
            "time": "Mar 2, 2023 at 3:19",
            "is_accepted": false,
            "comments": []
        }
    ]
}