{
    "title": "Statically Reverse Engineering Shellcode - IDA to Ghidra",
    "link": "https://reverseengineering.stackexchange.com/questions/26047/statically-reverse-engineering-shellcode-ida-to-ghidra",
    "content": "I'm trying to follow along with this tutorial which is using IDA in it's example. https://0ffset.net/reverse-engineering/malware-analysis/common-shellcode-techniques/\nHash: 9d7e34250477acf632c6c32fc2c50d3b\nIn the example, after decryption of the stage 2 this is the result:\n\n\nWhen I repeat the same steps with Ghidra I get the following result:\n\n\nI've been following the assembly trying to see if I could figure out what when wrong or what is going on with no results yet.\nWhile searching, I came across these references:\nhttps://c9x.me/x86/html/file_module_x86_id_139.html\nhttps://en.wikipedia.org/wiki/HLT_(x86_instruction)\nIt would be appreciated if someone could point me in the right direction.\nEDIT:\nAfter Paweł Łukasik pointed out my error, it works:\n",
    "votes": "1",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ida",
        "disassembly",
        "binary-analysis",
        "ghidra",
        "shellcode"
    ],
    "user": "Elfwig",
    "time": "Oct 4, 2020 at 19:44",
    "comments": [],
    "answers_data": [
        {
            "content": "Starting from address <pre><code>0x56</code></pre> all your instructions seems to be off. And if you look closely it there is a pattern how much off they are from the original.\nFor example, at offset <pre><code>0x58</code></pre>, there's supposed to be <pre><code>push edx</code></pre> so the byte should be <pre><code>0x52</code></pre>, but you have <pre><code>push esp</code></pre> which is <pre><code>0x54</code></pre>. Since the article mentions that this part is encrypted with a xor (with a single digit key), let's see how those values are off\n<pre><code>In [7]: 0x52 ^ 0x54\nOut[7]: 6\n</code></pre>\nSo this is exactly the key mentioned in the article. If we compare the rest of those off instruction we will notice that they are off by the same value.\nConclusion - this part of code shown in Ghidra was not decrypted and should be preprocessed before analysis.\n",
            "votes": "2",
            "user": "Paweł Łukasik",
            "time": "Oct 4, 2020 at 19:12",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Elfwig",
                    "text": "<span class=\"comment-copy\">ugh, thanks, I totally overlooked that. I even went back but it did not clue in to me that I had included the key until your response.</span>",
                    "time": null
                }
            ]
        }
    ]
}