{
    "title": "Advice for retrieving functions and tables from Intel 8061/8065 bin file (reverse engineering) from Ford EECV ECU",
    "link": "https://reverseengineering.stackexchange.com/questions/26187/advice-for-retrieving-functions-and-tables-from-intel-8061-8065-bin-file-revers",
    "content": "I have under my disposal some Ford EECV bin files and my goal for the next few weeks is to retrieve the functions and tables, and plot them out before going onto DIY hardware.\nDoes anyone know which platforms to use to analyze Ford/Intel 8061/8065 bin files, or possibly disassemble them? I checked into the bin files today using Notepad++ hex editor plugin, and didn't get many strings except for 'Ford copyright 2002', but I do see some hex patterns floating around…  Thus, would I find a disassembling platform, or hack it with the 8061 manual?\nAlso, pardon my ignorance, but how do you regulars retrieve bin files? I know you can stick the ROM into the ROM reader, but intuitively I feel that people also get bin files from the OBD port upon KOEO and get the 'ROM dump' from the RAM in the ECU. Is that the 'frontdoor' way of getting live data?\nP.S.: Excuse me for my use of semantics.\n",
    "votes": "2",
    "answers": 0,
    "views": "191",
    "tags": [
        "binary-analysis",
        "firmware",
        "binary",
        "binary-format",
        "ecu"
    ],
    "user": "Jt90",
    "time": "Jul 9, 2021 at 20:34",
    "comments": [
        {
            "user": "mumbel",
            "text": "ghidra has support for MCS-96 (ghidra-sre.org) and based on en.wikipedia.org/wiki/Intel_8061 you may decent success with it for 8061\n",
            "time": null
        },
        {
            "user": "Jt90",
            "text": "thanks. I'll try that later. I wanted a more general platform so I was checking out binwalk and radare2 before trying out binwalk since the learning curve is less steep. But the file signatures disappear after the first 'binwalk' of the file. If you could advise me that would be great, since I thought I had something going and had to just -dd the block of lzma compressed files more precisely in bytes so I can open them.\n",
            "time": null
        },
        {
            "user": "Jt90",
            "text": "Dirk on Retrocomputing mentions IDAPro by Hex Rays has 8065 support too. how did he come to the conclusion? I wasn't able to comment as I didn't have enough reputation\n",
            "time": null
        },
        {
            "user": "Adam Morton-Grant",
            "text": "i'm interested in you idea i am doing a similar thing i am toying around with eec-iv & ecc-v ecus , i am really intrested in trying to dump the contents of the 8061 microcontroller. its quite difficult to actually do. i was planning a way of dumping the info via the J3 port on the rear of the ecu. if that didn't work removing the chip completely and then dumping its contents that way. but so far I haven't been able to get a straight answer from anywhere.\n",
            "time": null
        }
    ],
    "answers_data": []
}