{
    "title": "Alternative to BinDiff that works on Linux x86_64 binaries (and preferably does not require IDA Pro)",
    "link": "https://reverseengineering.stackexchange.com/questions/26196/alternative-to-bindiff-that-works-on-linux-x86-64-binaries-and-preferably-does",
    "content": "Is there alternative to\nhttps://www.zynamics.com/bindiff.html\nthat works for Linux x86_64 binaries, works on Linux, (and preferably does not require IDA Pro, however if needed it seems that IDA can run on Linux so it may be fine)?\n",
    "votes": "1",
    "answers": 2,
    "views": "1k",
    "tags": [
        "binary-analysis",
        "bin-diffing",
        "tool-bindiff"
    ],
    "user": "Grzegorz Wierzowiecki",
    "time": "Oct 29, 2020 at 12:47",
    "comments": [
        {
            "user": "Grzegorz Wierzowiecki",
            "text": "Related: BinDiff works with Ghidra reverseengineering.stackexchange.com/q/22372/3934\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "VBinDiff at http://www.cjmweb.net/vbindiff/\n\nBelow is the same message as above. But with details if you're interested in those.\nVBinDiff (Visual Binary Diff) code at https://github.com/madsen/vbindiff\nVBinDiff displays files in hexadecimal and ASCII (or EBCDIC). It can also display two files at once, and highlight the differences between them.\nVBinDiff is CLI only though (Command Line Interface)\n",
            "votes": "1",
            "user": "Francewhoa",
            "time": "Aug 8, 2021 at 23:16",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "As answered in similar questions, the only IDA-dependent part of BinDiff is the exporter.\nOther than BinDiff or Diaphora (which might not meet your constraints), Quarkslab's qbindiff (at https://github.com/quarkslab/qbindiff) is pretty good on posix-y platforms.\nIt supports emitting your results in either CSV or BinDiff's format (for viewing).\nIts input, however, is either quokka (which is IDA-only) or BinExport (ghidra, binja, ida). I find quokka to be fairly decent (performance-wise) in terms of exporting, but BinExport might suffice if you're limited by not having IDA.\nOnce you have the databases exported, you can diff with qbindiff to get your results, and then render your results to something that is easy to process.\nSomething like the following, with <pre><code>$format</code></pre> set to \"bindiff\" or \"csv\" should work for diffing. There are also options (listed in the help) to allow you to pick and choose the features you wish to use for matching.\n<pre><code>$ python -m qbindiff -ff $format -o /path/to/results.$format -e1 /path/to/binary/1 -e2 /path/to/binary/2 /path/to/export/1 /path/to/export/2\n</code></pre>\n",
            "votes": "0",
            "user": "Ali Rizvi-Santiago",
            "time": "Jul 26, 2024 at 1:05",
            "is_accepted": false,
            "comments": []
        }
    ]
}