{
    "title": "How to attach IDA Window back to be part of the IDA main window",
    "link": "https://reverseengineering.stackexchange.com/questions/26209/how-to-attach-ida-window-back-to-be-part-of-the-ida-main-window",
    "content": "I accidently maximized the functions Window and now it is de attached from the main window:\n\nHow can I attach it back to be part of the main window? I tried to drag it but it doesn't work. Also re opening IDA didn't help.\n",
    "votes": "1",
    "answers": 2,
    "views": "2k",
    "tags": [
        "ida",
        "windows"
    ],
    "user": "E235",
    "time": "Nov 1, 2020 at 12:50",
    "comments": [],
    "answers_data": [
        {
            "content": "You can reattach your window by placing your mouse on the thin gray bar, as in this screenshot :\n",
            "votes": "2",
            "user": "Guillaume",
            "time": "Nov 1, 2020 at 20:21",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "In your screenshot, you can see a thin strip of gray between the title of the window (<pre><code>Functions window</code></pre>) and the column headers (e.g. <pre><code>Function name</code></pre>). If you hover your mouse in that gray area, it will expand and the title text (<pre><code>Functions window</code></pre>) will appear again, as in the following screenshot:\n\nOnce that happens, hold down the left click button and move the window. You will see a number of icons appear around the edges, and in the center of the IDA window, as follows:\n\nYour first option is to ignore those icons, and drag the window into the area with the tabbed window names (e.g <pre><code>IDA View-A</code></pre>, <pre><code>Pseudocode-A</code></pre>, etc). The window will become an ordinary tab again. This is probably what you want.\nAlternatively, you can drag your mouse onto one of the aforementioned icons to get a split-screen view. I recommend playing with them to get an intuitive feel for what the icons do, but here's a textual description:\n\nLeftmost/center-left icon : the current tab will now be split into two panes, with the one you dragged in on the left, and the active one on the right\nRightmost/center-right icon: ditto, except the one you dragged will be on the right\nTopmost/center-top icon: the screen is split into two panes; the existing tabs will be in the bottom pane, and the current window will be in the top pane by itself\nBottommost/center-bottom icon: ditto, except the one you dragged will be at the bottom\n",
            "votes": "0",
            "user": "Rolf Rolles",
            "time": "Nov 1, 2020 at 20:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}