{
    "title": "How to turn .pyd files generated by pyinstaller into source?",
    "link": "https://reverseengineering.stackexchange.com/questions/26255/how-to-turn-pyd-files-generated-by-pyinstaller-into-source",
    "content": "I have decompiled a pyinstaller exe and then decompiled the .pyc source inside it. only problem is the source is this\n<pre><code>import secretmodule\nsecretmodule.main()\n</code></pre>\nAnnoying, I know. i found secretmodule but it is a .pyd and the decompiler I use only decompiles pyo or pyc. I searched how to decompile a pyd but it said it was almost impossible and I assumed pyinstaller makes pyd's differently so I continued.\nHow do I decompile a pyd file made specifically by pyinstaller\n",
    "votes": "1",
    "answers": 1,
    "views": "17k",
    "tags": [
        "python"
    ],
    "user": "user14118720",
    "time": "Nov 5, 2020 at 20:20",
    "comments": [],
    "answers_data": [
        {
            "content": "This could prove to be much harder than converting pyc to equivalent python code\nAccording to python docs\n\nYes, .pyd files are dll’s, but there are a few differences. If you have a DLL named foo.pyd, then it must have a function PyInit_foo(). You can then write Python “import foo”, and Python will search for foo.pyd (as well as foo.py, foo.pyc) and if it finds it, will attempt to call PyInit_foo() to initialize it. You do not link your .exe with foo.lib, as that would cause Windows to require the DLL to be present.\nNote that the search path for foo.pyd is PYTHONPATH, not the same as the path that Windows uses to search for foo.dll. Also, foo.pyd need not be present to run your program, whereas if you linked your program with a dll, the dll is required. Of course, foo.pyd is required if you want to say import foo. In a DLL, linkage is declared in the source code with __declspec(dllexport). In a .pyd, linkage is defined in a list of available functions.\n\nSo you now have to reverse the native code in the pyd file assuming its a DLL and start from the exports.\n",
            "votes": "2",
            "user": "sudhackar",
            "time": "Nov 11, 2020 at 11:30",
            "is_accepted": false,
            "comments": [
                {
                    "user": "not2qubit",
                    "text": "<span class=\"comment-copy\">Here is another <a href=\"https://stackoverflow.com/a/62222595/1147688\">interesting answer</a>. Not sure what he suggests though.</span>",
                    "time": null
                }
            ]
        }
    ]
}