{
    "title": "What is copy_block struct in Tricore Arch?",
    "link": "https://reverseengineering.stackexchange.com/questions/26289/what-is-copy-block-struct-in-tricore-arch",
    "content": "Recently I work on Tricore Arch to reverse an algorithm. But I had a problem to find a constant value(4 byte). the line of code shown below:\n<pre><code>ld32.w          d4, [a0]-0x68D4\n</code></pre>\nI know <pre><code>a0 = 0xD00032E0</code></pre> but it seems I need to find the equivalent <pre><code>copy_block</code></pre> that tells I where <pre><code>d000032e0</code></pre> was copied to.\n1- basically what is Copy_Block in tricore?\n2- How I can find copy_block?\nThanks\n",
    "votes": "0",
    "answers": 1,
    "views": "201",
    "tags": [
        "ida",
        "disassembly",
        "memory",
        "address"
    ],
    "user": "Unicornux",
    "time": "Nov 11, 2020 at 11:48",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "Where did you see this term?\n",
            "time": null
        },
        {
            "user": "Unicornux",
            "text": "Recently I saw this issue in some forum like :nefariousmotorsports.com/forum/…\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "So, the term copy_block seems to be an invention of the  forum poster. It is not  specific to Tricore but a general approach used in many embedded firmwares to solve the following problem:\nThe firmware runs from read-only flash memory, but in some situations you need parts of it in RAM, either because you need writable data, or for speed (often code in RAM runs much faster than from flash).\nTo solve this, usually there is some code which performs copying of blocks of data from flash to RAM, and it can us either hardcoded addresses or a separate table. Generally, such table would consist of multiple records (which are called <pre><code>copy_block</code></pre> by the poster) with the following information:\n\nSource address (address of original data in flash)\n\nTarget address (destination in RAM)\n\nSize of data to copy\n\n\nThere is no standard procedure to find such routines; basically you need to look for functions that copy data around and possibly get the addresses and size from a table. Usually such functions are called early in the firmware initialization process.\nAfter identifying the routine you can simulate its behavior by copying the bytes from FLASH to RAM segments using information from the table. A script similar to memcpy.idc shipped with IDA could be used for this.\n",
            "votes": "2",
            "user": "Igor Skochinsky",
            "time": "Nov 16, 2020 at 14:50",
            "is_accepted": true,
            "comments": []
        }
    ]
}