{
    "title": "Getting started with malware research [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/2630/getting-started-with-malware-research",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI followed some reverse engineering tutorials and they got me really interested.\nAnd I heard that you could make a career out of it, mostly from malware research.\nSo... how can I learn about malware research and get a job doing it?\nP.S. What are other fields of professional reverse engineering (which aren't malicious) are there?\n",
    "votes": "-1",
    "answers": 1,
    "views": "878",
    "tags": [
        "career-advice"
    ],
    "user": "aclowkay",
    "time": "11 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "As for getting experience analyzing malware, see the following two posts:\n\nHow can I analyze a potentially harmful binary safely?\nWhere can I, as an individual, get malware samples to analyze?\n\nThe Art of Computer Virus Research and Defense is a bit outdated, but at the very least it will give you some history on malware research.\nAs for other professional reverse engineering jobs:\n\nVulnerability research and exploit development (consulting, independent research, etc.)\nDesigning and developing anti-reversing technologies (commercial packers, DRM, etc.)\nEducation industry (academia, conference training)\nGovernment work\n\nAlso see How do I move from RCE being a hobby to RCE being a profession?\n",
            "votes": "2",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}