{
    "title": "Parsing IDA Pro .asm files",
    "link": "https://reverseengineering.stackexchange.com/questions/2632/parsing-ida-pro-asm-files",
    "content": "Does anyone know of projects that parse the disassembly from IDA Pro using a lexer and/or parser generator library? But I would also totally be fine with JSON or XML format. So far, I have been able to produce HTML from the GUI, but I am looking for a command line tool that will parse disassembly files produced by IDA Pro.\n",
    "votes": "8",
    "answers": 1,
    "views": "2k",
    "tags": [
        "disassembly",
        "ida"
    ],
    "user": "turnersr",
    "time": "Aug 12, 2013 at 21:39",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "This sounds like an XY problem. What are you actually trying to do?\n",
            "time": null
        },
        {
            "user": "turnersr",
            "text": "I am moving to IDA Pro disassembly in order to do my own static analysis. I had used Distorm in the past, but I want to experiment with IDA Pro. I am parsing asm files produced by IDA Pro disassembler to interface with an IR translator. It's that not that big of a deal I just do not want to reinvent the wheel here. What's a XY problem?\n",
            "time": null
        },
        {
            "user": "turnersr",
            "text": "I am actually trying to do this: \"First, the binary file is disassembled. toil currently interfaces with two disassemblers: IDA Pro, a commercial disassembler, and a linear sweep disassembler built on top of GNU libopcodes.  Interfacing with other disassemblers is straight-forward.\" (Very old BAP documentation).\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "You're going at it backwards. Instead of parsing assembler text, you should use IDA scripting or native APIs to get the instructions in nice, broken down representation.\n",
            "time": null
        },
        {
            "user": "David",
            "text": "Welcome to RE.SE. If you have a different query that is not answered here then please ask a new question.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You'd be better off using IDC functions like GetMnem(), GetOpType(), GetOperandValue(), etc. to extract IDA's disassembly than exporting to JSON/XML.\nYou can use command-line switches to run IDA in batch-mode with your IDC script to automate the entire process.\n",
            "votes": "5",
            "user": "Jason Geffner",
            "time": "Aug 13, 2013 at 14:32",
            "is_accepted": true,
            "comments": [
                {
                    "user": "turnersr",
                    "text": "<span class=\"comment-copy\">Thanks! I did not know you could do that in IDA Pro. This is differently the right approach for me.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">I would recommend <code>DecodeInstruction()</code> which gives the most detail.</span>",
                    "time": null
                }
            ]
        }
    ]
}