{
    "title": "Need help with ZTE router config.bin file decryption and encryption",
    "link": "https://reverseengineering.stackexchange.com/questions/26365/need-help-with-zte-router-config-bin-file-decryption-and-encryption",
    "content": "bin file extracted from a ZXHN H168N V3.1. RouterPassView is able to decrypt the file successfully but the tool can't re-encrypt the file, it gave me some info about the method used to decrypt here they are\nFile Type: 29\nEncrypted Data Start Position: 227\nEncryption Algorithm: AES-128\nEncryption Key: 34303263333864653339626564363635\nCompression: zlib/deflate\nam a noob when it comes to this stuff so idk how to code my own tool does anyone know a tool that i could use to decrypt and re-encrypt the file\n",
    "votes": "0",
    "answers": 2,
    "views": "5k",
    "tags": [
        "tools",
        "encryption",
        "decryption"
    ],
    "user": "Luser",
    "time": "Nov 24, 2020 at 20:31",
    "comments": [
        {
            "user": "Jason S",
            "text": "They use zlib encryption in the firmware, have you tried encrypting it with zlib and repack it with binwalk squashfs? Edit: would you mind sharing decrypted firmware? So, I’ll have a look into it.\n",
            "time": null
        },
        {
            "user": "Alvi Guy",
            "text": "@Alex811 can yoU HELP Me to decrypt my router config Model number is ZTE ZXHN H168N V2.2 .. I TRIED ALL THE WAYS ITS SIGnature is speedport 2i . i also have mdsum of tapgram_m file ... d0e615736322e6bc91fdb4e044bcdb20 .... but cannot get the key.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can use the zcu module (written by Mark Streetster) to decrypt/encrypt your config.bin file.\n",
            "votes": "3",
            "user": "user2017",
            "time": "Nov 24, 2020 at 23:44",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Luser",
                    "text": "<span class=\"comment-copy\">i tried that but it didn't work even when i specified the key it gave me an error that i can't remember what type/version should i use</span>",
                    "time": null
                },
                {
                    "user": "user2017",
                    "text": "<span class=\"comment-copy\">@Ammar Yasser If you want to upload a copy of your config.bin file I will check it out.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I'd comment but I don't have rep.\nIf you're still looking into it or anyone else comes across this, zcu\nindeed seems to be the way to go. I've managed to use it for a router that uses the same encryption key (ZXHN H267A V1.0) and the re-encrypted file seems byte-perfect.\nIt's not instantly obvious (at least with this particular key), but the answer is quite simple: RouterPassView gives you the key's hex representation, whereas zcu wants it in plain text. If you convert the key you wrote into text you get: <pre><code>402c38de39bed665</code></pre>\nBtw, since I saw people ask for the config.bin, before you share it, keep in mind that the file probably contains a bunch of sensitive info (passwords used by the router and potentially your phone number if it supports VoIP).\nGood luck, have fun!\n",
            "votes": "1",
            "user": "Alex811",
            "time": "Sep 1, 2021 at 21:56",
            "is_accepted": false,
            "comments": []
        }
    ]
}