{
    "title": "modern instrumentation for reversing and researching [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/26421/modern-instrumentation-for-reversing-and-researching",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 4 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\ni am really glad i found this great site and wanted to ask from your expertise regarding the following issue:\ni have been doing malware analysis and researching for a few years, and i want to learn something new; a new tool to deepen my understanding while utilizing it for mundane tasks.\ni want to learn modern dynamic instrumentation. i searched the web and literacy and found a couple of suggestions: dynamorio, pin/pintools, frida(familiar with already), lief, triton, angr and manticore.\ni need the \"tool\" to have a lowest overhead(i know it depends also on the way i implement the scripts), and it will mainly be used for reverse engineering, pe research and mostly for exploit development.\nwhat should i learn in order to gain the benefits for what i mentioned? i didn't specify architecture as i will be using it on windows,linux,arm and mips (if there are other tools or better ones, i would really love to learn from your input to improve myself and gain new skills).\non a side note, i know that dynamorio is being used on winafl and other fork, but it seems quite old, so i was wondering if there's something newer with lower overheads for vulnerability research/malware analysis purposes.\non a side note, i tried to check several conferences for notes and talks regarding the issue, but i saw that every year there seems to be something new, and a few months later something newer, so i am wondering, what is the current \"cool toy\" of 2020?\nwould love to learn from your inputs and study what you mentioned to improve my knowledge base. thank you very much\n",
    "votes": "0",
    "answers": 1,
    "views": "299",
    "tags": [
        "tools",
        "function-hooking",
        "instrumentation",
        "injection"
    ],
    "user": "journey",
    "time": "4 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "Some may favor miasm over other frameworks (see for instance the Advanced Binary Deobfuscation  material). Examples:\n\nAnalyzing Shellcodes with Miasm for Fun and Profit\nZeusVM analysis\n\nThe Qiling emulator has been used for binary analysis and in conjunction with AFL++. Examples:\n\nMoving From Dynamic Emulation of UEFI Modules To Coverage-Guided Fuzzing of UEFI Firmware\nPE Emulation With Code Coverage Using Qiling and Dragon Dance\n",
            "votes": "1",
            "user": "julian",
            "time": "Dec 2, 2020 at 22:40",
            "is_accepted": false,
            "comments": []
        }
    ]
}