{
    "title": "Miasm VS Triton - which to choose? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/26469/miasm-vs-triton-which-to-choose",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 4 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nHello and thank you for reading my question,\nI was wondering, which is the right tool for me to choose according to the following:\nI will be using it mainly for Malware analysis and for exploit development, fuzzing and research. It should have as low overhead as possible when instrumenting, can be integrated with angr/qiling or provide similar capabilities at low/lower overhead, hopefully easy to use and understand and has decent documentation and examples, and hopefully can be extended for custom needs if functionality is not available.\nWhen I researched about them, even though their github seems quite recent, both frameworks(triton and miasm) seem to be quite old, while triton is a bit newer. I came across miasm in regards to deobfuscation and it seemed great, but I am looking for something more extensive and faster(lower overhead if such thing exists). If you know of a newer tool/framework that can aid me, please post its name as it can help me a lot instead of reviewing papers for different conventions and betting on projects \"randomly\"(without any disrespect, just hoping for practicality).\nThank you for your help.\nIf you can write the advantages or disadvantages for each tool, it will be help me to make a wise decision. I am sure others will fun your answers lucrative and learn a lot from them as well.\n",
    "votes": "1",
    "answers": 0,
    "views": "656",
    "tags": [
        "tools",
        "function-hooking",
        "instrumentation"
    ],
    "user": "journey1",
    "time": "4 years ago",
    "comments": [],
    "answers_data": []
}