{
    "title": "automatically find the object \"this\" refers to in js",
    "link": "https://reverseengineering.stackexchange.com/questions/26509/automatically-find-the-object-this-refers-to-in-js",
    "content": "Im quite new to javascript and sometimes I find it really hard to find what object a keyword 'this' refers to. Is there a code editor that is able to do that for me? Or any other advice that could help me :)\nThanks!\n",
    "votes": "2",
    "answers": 1,
    "views": "91",
    "tags": [
        "javascript"
    ],
    "user": "Hukei",
    "time": "Dec 11, 2020 at 14:44",
    "comments": [
        {
            "user": "pythonpython",
            "text": "Paste some code you're having trouble with. That will make it easier for people to help you.\n",
            "time": null
        },
        {
            "user": "R4444",
            "text": "I think your are looking for <pre><code>alert(this.constructor.name);</code></pre>\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There's a great resource on W3Schools.\nIn summary:\nIt (this) has different values depending on where it is used:\n\nIn a method, this refers to the owner object.\n\nAlone, this refers to the global object.\n\nIn a function, this refers to the global object.\n\nIn a function, in strict mode, this is undefined.\n\nIn an event, this refers to the element that received the event.\n\nMethods like call(), and apply() can refer this to any object.\n\n\nAnswered with regard to getting function name here and with regard to getting function body here\n",
            "votes": "1",
            "user": "pythonpython",
            "time": "Dec 13, 2020 at 1:44",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Hukei",
                    "text": "<span class=\"comment-copy\">Hi, thanks for your answer, but I know how it is used and what i'm looking for is an automatic way to reveal the corresponding object in a long and hard (obfuscated) code. Sorry if I wasn't clear.</span>",
                    "time": null
                },
                {
                    "user": "pythonpython",
                    "text": "<span class=\"comment-copy\">It's evaluated at runtime, so looking at the code won't tell you anything. The code needs to be executed to understand what <b>this</b> means. Functions are mutable in javascript and can be defined (created) at runtime. You can have a function which creates functions through lambdas. To say ' I wan't to know what <b>this</b> means in a program ' is to say ' I want to know how the program is evaluated up to the point where this line of code is called.' The only way to know that is to evaluate the code.</span>",
                    "time": null
                }
            ]
        }
    ]
}