{
    "title": "Reverse engineer compressed iOS app file",
    "link": "https://reverseengineering.stackexchange.com/questions/26588/reverse-engineer-compressed-ios-app-file",
    "content": "I want to find out the compression method used by an iOS app used for music notation to store its files. The files of its OSX counterpart are zipped files. You cannot create files in the iOS app, but you can upload them using the desktop application to the application's cloud server and from there download them to your iOS device for offline viewing. My findings so far:\n\nThe header of the files is <pre><code>58 54 5A 00</code></pre>, which isn't listed in any file signatures table I have searched in\nThe usual suspects, commands <pre><code>file</code></pre> and <pre><code>binwalk</code></pre>, do not identify the format\nThe entropy histogram is flat\nEach time I download the same file from the server to the iOS device, a file of the exact same size but with different content (apart from the header 58 54 5A 00`) gets saved.\nAltering hex values\n\nlast two bytes: file is read normally by the iOS app\nthird byte from the end: app becomes unresponsive when opening the folder the file is in. Since each file is shown as a thumbnail of the musical score I suspect this byte has something to do with the thumbnail.\nAny other random byte: thumbnail is shown correctly, app doesn't crash, but a blank page appears when the file is opened\n\n\n\nThe following files are actually all the same file downloaded from the server 4 times.\n\nVersion_1\nVersion_2\nVersion_3\nVersion_4\n\n\nI have produced three files, the first contains \"A\", the second \"AA\", the third \"AAA\". The first set of files comes from iOS, the second from OSX.\n\nFileA_iOS\nFileAA_iOS\nFileAAA_iOS\nScreenshot_iOS\nFileA_OSX\nFileAA_OSX\nFileAAA_OSX\nScreenshot_OSX\n\n.\n",
    "votes": "7",
    "answers": 1,
    "views": "364",
    "tags": [
        "file-format",
        "ios",
        "decompress",
        "unknown-data"
    ],
    "user": "Dimitris",
    "time": "Dec 25, 2020 at 18:14",
    "comments": [
        {
            "user": "pythonpython",
            "text": "Screen shot of the app where you're inputting the text. 9k for one sentence is pretty big.   Try creating a file with only the letter 'a' as input, and then create another file with 'aa' as the input. How much do the two files differ in size? Then create a file with 'aaa', does it vary from file 'aa' by the same amount?\n",
            "time": null
        },
        {
            "user": "Dimitris",
            "text": "I have edited the question with more information and a different set of files with screenshots . All three iOS files are exactly 4400 bytes.\n",
            "time": null
        },
        {
            "user": "pythonpython",
            "text": "If you create another file with only A in it, are the byte values in that file the same as the earlier file with only A in it?\n",
            "time": null
        },
        {
            "user": "pythonpython",
            "text": "First 3 bytes decode to XTZ. Is that meaningful?    The byte value 0x82 (Decimal 130) occurs 16 times in each file.    Can you explain the relation of these files to this app: apps.apple.com/us/app/musescore-sheet-music/id835731296   You are uploading the OSX files into the IOS App and the IOS App stores them in the mscze format?\n",
            "time": null
        },
        {
            "user": "Dimitris",
            "text": "- No the byte values are not the same. I guess there is a timestamp in the file saved  - The header XTZ is not meaningful, neither the byte value you mentioned  - It is indeed the musescore app these files belong to  - The desktop application uploads the files to  musescore's servers and from there they are downloaded to the iOS device\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I think these files are encrypted rather than compressed.\nI've run <pre><code>file</code></pre> at all offsets from start and found format consistent across the files at the same offset.\nThe files have only a constant value in the first 4 bytes. The rest is high entropy.\nThe same content saved at different times produces a different binary file each time.\nFile sizes are similar in previous instances when content was different in size, indicating padding of some sort.\nI think this is may how IOS handles file security for some apps\n",
            "votes": "2",
            "user": "pythonpython",
            "time": "Dec 27, 2020 at 20:25",
            "is_accepted": false,
            "comments": []
        }
    ]
}