{
    "title": "Chip Identification in Push Button Toy",
    "link": "https://reverseengineering.stackexchange.com/questions/26668/chip-identification-in-push-button-toy",
    "content": "I have a toy that simply consists of a button which plays a variety of phrases when activated. My intention is to replace the sounds with my own. However, I have been unable to identify the chip and therefore cannot interface with it.\nHere is a picture and schematic of the board, developed using a multimeter in continuity mode.\n\n\nHere is a closeup of the chip.\n\nI believe the markings are as follows:\n<pre><code>JFK8-4\nP04003\n</code></pre>\nThere is also a \"triforce\" logo, for a company which I have not identified yet.\nPins 1 and 8 are particularly interesting, as they are not connected to anything. I assume they were used to program the chip, but am not able to identify a protocol if any exists.\nIt would be appreciated if anyone can locate a datasheet. I would also be happy with advice on identifying the function of the unconnected pins.\n",
    "votes": "2",
    "answers": 2,
    "views": "377",
    "tags": [
        "hardware",
        "embedded",
        "integrated-circuit"
    ],
    "user": "Q3El58",
    "time": "Dec 30, 2020 at 2:06",
    "comments": [
        {
            "user": "Chris Stratton",
            "text": "A single chip solution strongly suggests that the samples are in mask ROM and not something you're going to be able to change.  You're better off replacing the module with something you can customize.\n",
            "time": null
        },
        {
            "user": "Q3El58",
            "text": "@ChrisStratton Well that's a shame, I don't have the facilities to do such a thing. Thanks for your attention.\n",
            "time": null
        },
        {
            "user": "Chris Stratton",
            "text": "Sure you do - find some other gadget, module, or DIY solution which can have the sound files changed, and stuff it back into the toy.  Recordable greeting cards are a thing, you can do things with a small MCU and a flash chip, etc...\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It is from this family. The pinout may vary slightly:\nhttp://en.waytronic1999.com/m/ProductsStd_171.html\nhttp://n.waytronic1999.com/m/ProductsStd_115_00100.html\n\nIn short:\nyou can change the sounds if you just buy a new chip. it will be cheaper.\nOr a new toy that can not only play but also record sounds.\nrecordable sound chips:\nhttps://www.alibaba.com/showroom/postcard-recordable-sound-chips.html\nhttps://www.alibaba.com/showroom/sound-chip-for-postcard.html\n",
            "votes": "2",
            "user": "0xC0000022L",
            "time": "May 1, 2023 at 20:21",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I am working on the same project right now. Just buy one of these:\nhttps://wiki.dfrobot.com/DFPlayer_Mini_SKU_DFR0299\nDfb mini mp3 player costs 3bucks\nAnd you can load some aufio files via a sdcard\n",
            "votes": "1",
            "user": "Marvin",
            "time": "Dec 16, 2022 at 6:29",
            "is_accepted": false,
            "comments": []
        }
    ]
}