{
    "title": "Rebuild IAT after manually unpacking DLL",
    "link": "https://reverseengineering.stackexchange.com/questions/26667/rebuild-iat-after-manually-unpacking-dll",
    "content": "I've been trying to unpack this dll and I'm pretty sure that <pre><code>0x7c3ea902</code></pre> or <pre><code>0x1007A9D2</code></pre> (ASLR disabled) or simply <pre><code>0x7A9D2</code></pre> is OEP.\n\nBut after dumping with OllyDumpEx and trying to fix IAT with ImpREC it just doesn't work.\n\nHere are the results from ImpREC\n\nMy question is, why are there invalid imports detected when the OEP is most likely correct?\n",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "dll",
        "unpacking",
        "dumping",
        "import-reconstruction"
    ],
    "user": "majidarif",
    "time": "Jan 8, 2021 at 10:16",
    "comments": [
        {
            "user": "bart1e",
            "text": "Can you share the dll (packed version)?\n",
            "time": null
        },
        {
            "user": "majidarif",
            "text": "@bart1e I can but not sure if it's safe to do so.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I solved this by manually fixing each missing import API.\nFirst I did a text dump of the unpacked dll using BinText where I found a list of imported API's.\n\nI then compared it to the list of API detected by ImpRec and I noticed that the calls are in the same order on the text dump.\n\nSo I just double clicked the line of the invalid import on ImpRec and manually input the correct API (based on the order shown on the text dump) as seen here:\n\nI repeated this for every invalid API and fixed the dump and this time it all worked.\nTo sum it all up from the original question. The OEP was correct. The detected API's were correct. It just needed a little intervention to fix the invalid imports detected.\nThank you!\n",
            "votes": "2",
            "user": "majidarif",
            "time": "Jan 7, 2021 at 23:29",
            "is_accepted": true,
            "comments": []
        }
    ]
}