{
    "title": "dnSpy: how to start 32 bit version",
    "link": "https://reverseengineering.stackexchange.com/questions/26688/dnspy-how-to-start-32-bit-version",
    "content": "I am very unsure if this is the right place to as or if I need to ask this at another forum, but here it goes.\nI am trying to reverse engineer a .NET program with the use of dnspy. I installed dnspy with <pre><code>choco install dnspy</code></pre>. I was then able to start dnspy in by calling it in pwsh, but when debugging the program I get the following error <pre><code>Could not start the debugger. Use 32-bit dnSpy to debug 32-bit applications</code></pre>. I then found this link that said to restart the debugger with <pre><code>dnspy-x86</code></pre>. But still the debugger is 64 bit. I also tried to run dnspy by running <pre><code>dnspy -x86</code></pre>.\nI see here  in chocolatey.org that the 32 bit is checked in virustotal. But I am unsure if the 32-bit version is included. I also cant find any information on flags or parameters dnspy is able to take.\nMy question is if dnspy 32 bit is installed by using choco or if one has to install the 32-bit manually. And if dnspy 32 bit is installed with choco, how do I start it in 32 bit.\n",
    "votes": "0",
    "answers": 1,
    "views": "3k",
    "tags": [
        ".net",
        "dnspy"
    ],
    "user": "Mr Krisey",
    "time": "Jan 3, 2021 at 0:53",
    "comments": [],
    "answers_data": [
        {
            "content": "By default choco doesn't want to install 32bit if you are on 64bit system. But, with a little bit of effort, I found that to install 32bit you will need to add either add: --x86 or --forcex86 to force x86 (32bit) installation on 64 bit systems.\nTo download dnspy 32 bit you would run: <pre><code>choco install dnspy --x86</code></pre>\nAlternatively, you can go to dnSpy github and download it from there.\nFor next time please refer to choco install docs and read the entire help section\nI hope you learn something new today ☺\n",
            "votes": "3",
            "user": "BadSugar",
            "time": "Jan 3, 2021 at 2:57",
            "is_accepted": true,
            "comments": []
        }
    ]
}