{
    "title": "Ghidra + IDA cant detect a string but Radare2 can",
    "link": "https://reverseengineering.stackexchange.com/questions/26780/ghidra-ida-cant-detect-a-string-but-radare2-can",
    "content": "Im new to reverse engineering, and ive trying Ghidra, IDA (Freeware) and Radare2 with a simple CrackMe, the problem is, both Ghidra and IDA couldnt detect a string while Radare2 (Using Cutter GUI) could figure out the name.\nI used default analysis for all 3.\nIs there something im missing ? because even the 'strings' command can actually find the string im looking for.\nGhidra:\n\nIDA:\n\nRadare2 (Cutter):\n",
    "votes": "5",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "radare2",
        "ghidra"
    ],
    "user": "RedZ",
    "time": "Jan 15, 2021 at 4:29",
    "comments": [],
    "answers_data": [
        {
            "content": "I don't know the exact length of string. But, few things to note here are as follows:\n\nGhidra and IDA has a minimum bound on size of string to recover correct type (ghidra has a limit - or lower bound of 5).\nThis is necessary to avoid any false positives or conflicting types. And recover correct types without marking a pointer as a string. Check out this figure for your reference. Generated using Ghidra automated analysis.\n\n\nIn Ghidra you can change this limit (minimum is 4) in analysis section.\n\n\n<pre><code>Strings</code></pre> command outputs printable characters with minimum size 4 (plus it doesn't use sophisticated type recovery algorithms like ghidra or Ida). I believe that you have a string with length less than 5 and my guess is that it must be 4 to be precise.\nstrings are usually defined in <pre><code>.rodata</code></pre> section. If you doubleclick on DAT_xxxx, it will take you to the location where that string is defined. There, you will see consecutive bytes bunched together by Ghidra or IDA (as shown in image-1). But, the type is not resolved as a \"string\".\nIn Ghidra a quick way to fix this by changing data type of DAT_xxxx label:\nRight click -> Data -> Choose Data Type -> choose string\n\n\nRereferences:\n\nSee my question here - https://github.com/NationalSecurityAgency/ghidra/issues/2274\nstrings manual - https://linux.die.net/man/1/strings\nida pro - How can I make IDA see a string reference?\n",
            "votes": "8",
            "user": "R4444",
            "time": "Jan 15, 2021 at 15:05",
            "is_accepted": true,
            "comments": [
                {
                    "user": "RedZ",
                    "text": "<span class=\"comment-copy\">Thank you for taking the time to write such a detailed answer, i changed the data type to string and it worked perfectly and i now also understand how the minimum string's length can effect the analysis, Thank you again!</span>",
                    "time": null
                }
            ]
        }
    ]
}