{
    "title": "finding a not-so-straightforward game's function",
    "link": "https://reverseengineering.stackexchange.com/questions/26899/finding-a-not-so-straightforward-games-function",
    "content": "I am working on Mad Max game [ APEX engine ]\nI do my best to explain the situation.\nso my target executes function like this:\nthere are commands like \" call [eax+XX] \" or \" call RX \" and these execute all functions.\nI was able to find some functions by referenced string but this particular function, I just can't, any name I guess ends up wrong.\nI want to unlock upgrades. I tried Cheat Engine's Ultimap and found nothing ( except the saving function which saves when a different addon/upgrade is selected ). it seems the checking function is run constantly maybe with different arguments.\nso as the calling routine is like this I cant trace back. it's so confusing. there was another game by this engine ( Just Cause 4 ) where I could trace back a string like \" X is locked\" and reach the deciding code but this one is just driving me crazy.\nI think the game uses Vtable but can't find it (i think even if I do, I need leaked SDK and symbols to recognize functions) I tried the IDA pro 7.5+ plugins with no luck.\nthere are also strings like \" bla-bla\\bla-bla\\XXX_unlock_condition.gsr\" and i don't know if they are packed within exe (denuvo protected) or packed within .arc and .tab files. and if it's possible to dump them.\n",
    "votes": "0",
    "answers": 0,
    "views": "103",
    "tags": [
        "binary-analysis",
        "functions",
        "function-hooking",
        "game-hacking",
        "virtual-functions"
    ],
    "user": "shetal",
    "time": "Jan 30, 2021 at 4:05",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "It sure is allowed to name your RCE target.\n",
            "time": null
        },
        {
            "user": "shetal",
            "text": "@0xC0000022L thanks\n",
            "time": null
        },
        {
            "user": "morsisko",
            "text": "But what is the question? If it's called like [eax+XX] then there is high probability that it's virtual function, and no, you don't need symbols to push this work further. It's all about your RE skills\n",
            "time": null
        },
        {
            "user": "shetal",
            "text": "@morsisko well, the question here is i need some help as i lack the experience you are referring to. every tool i use is not working to get the Vtable.\n",
            "time": null
        }
    ],
    "answers_data": []
}