{
    "title": "Grundfos Firmware",
    "link": "https://reverseengineering.stackexchange.com/questions/26933/grundfos-firmware",
    "content": "I am trying to understand the firmware of a Grundfos CIM 500 product.\nThe CIM 500 is a control module for grundfos pumps which uses a web interface.\nFrom binwalk I have found that it is running eCos, but I have a very hard to to extract any information, file structure, ram file, disk images or anything of that matter.\nI was hoping someone here with more experience with firmware analysis could give some help with what this firmware is, if it is compressed/encrypted, what kind of architecture the module is running, and how i could get more information from it.\nI have viewed it in a hex editor and found traces of HTML, but no files or informative file headers.\nThe firmware is available on the Grundfos software page (https://www.grundfos.com/dk/support/software), or directly here:\nhttps://www.grundfos.com/content/dam/local/da-dk/page-assets/support/software/documents/firmware-CIM500-V06.18.07-gdk-da.zip\n",
    "votes": "0",
    "answers": 1,
    "views": "213",
    "tags": [
        "firmware",
        "binwalk"
    ],
    "user": "Thue Iversen",
    "time": "Feb 3, 2021 at 14:33",
    "comments": [],
    "answers_data": [
        {
            "content": "Looking at the entropy of a file's contents is a good way to understand whether some/all of it is compressed or encrypted.  Any good compression or encryption will result in entropy in the region of 95% or higher.\nFor this firmware, <pre><code>binwalk -E</code></pre> shows large areas with entropy in the 70-85% range (probably code), with other much lower (likely data) and only small areas with higher (the surrounding data suggests this is certificates.)\nTo identify the architecture, <pre><code>binwalk -A</code></pre> can sometimes help.  However, in this case, it doesn't find anything it can identify.\nHowever, looking through the data I found, at offset <pre><code>0x1F4134</code></pre>, a list of opcodes. Googling for some of the more unusual looking ones (FLUSHDA, MULXUU, CALLR) returns a list of results all mentioning the Nios II architecture.  This architecture is for Altera FPGAs.\nSimilarly, googling for an decent quality image of a CIM 500 shows a chip with what looks very much like an Altera FPGA's markings (albeit mostly covered with a sticker.)\n\nEdit: I've done a further check to confirm the architecture.\nNios II encodes the <pre><code>ret</code></pre> (return) instruction as <pre><code>F800283A</code></pre>.\nThe appears many times through the firmware file (in little-endian byte order.)\nThe first occurrence is at offset <pre><code>0009D3B8</code></pre>, with offset <pre><code>0009D100</code></pre> being a plausible start for the code.\n",
            "votes": "1",
            "user": "Ian Cook",
            "time": "Feb 5, 2021 at 14:47",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Thue Iversen",
                    "text": "<span class=\"comment-copy\">Thank you so much, this give a lot of further research we could perform.</span>",
                    "time": null
                }
            ]
        }
    ]
}