{
    "title": "Why compiler is doing this?",
    "link": "https://reverseengineering.stackexchange.com/questions/26988/why-compiler-is-doing-this",
    "content": "While I was disassembling my own C code for practice I saw an interesting point which I want to share with you guys and needs to know the answer as I always get from here. Now, the interesting point is when I'm disassembling for switch cases when I'm making cases for one-digit numbers like 1, 2, etc. the disassembler is using jump-table for them but when I'm making cases for digits with zeroes like 10, 200, 300, etc. I'm seeing the disassembly with no jump-table but only a bunch of CMPs and JCCs one after another. I can't figure out why it's doing this but it's very interesting, can anyone tell me why? My two codes...\n<pre><code>int number=5;\nswitch (number) {\ncase 1:\ncase 2:\ncase 3:\n printf(\"One, Two, or Three.\n\");\n break;\ncase 4:\ncase 5:\ncase 6:\n printf(\"Four, Five, or Six.\n\");\n break;\ndefault:\n printf(\"Greater than Six.\n\");}}\n</code></pre>\nand disassembly for it...\n\nnow the code but with cases with numbers like 200, etc.\n<pre><code>int number=500;\nswitch (number) {\ncase 100:\ncase 200:\ncase 300:\n printf(\"100, 200, or 300.\n\");\n break;\ncase 400:\ncase 500:\ncase 600:\n printf(\"400, 500, or 600.\n\");\n break;\ndefault:\n printf(\"Greater than Six.\n\");}}\n</code></pre>\nand disassembly for it...\n\nit seems so chatty.\nThanks in advance!\n",
    "votes": "0",
    "answers": 1,
    "views": "92",
    "tags": [
        "disassembly",
        "assembly",
        "debugging",
        "binary-analysis",
        "c"
    ],
    "user": "Ramesses II",
    "time": "Feb 10, 2021 at 12:50",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "You mean “the compiler is” (doing this or that). The disassembler is just showing you the result.\n",
            "time": null
        },
        {
            "user": "Ramesses II",
            "text": "Whoops! Got it!\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "This topic has been explored by Rolf Rolles in this OpenRCE article (reposted here).\nBriefly, when the cases are close together, the compiler can use the switch variable to index a jump table. However, when cases are further apart, it would have to generate a huge table with many empty cases which would blow up the binary size. Although the sequence of cmp and conditional jumps may look silly and verbose, in most cases it's not noticeably slower and certainly uses less space (which would further improve performance by fitting into the instruction cache).\nAt high optimization levels, advanced compilers can even split a switch into several small ones that do have cases grouped closely and then use a couple of comparisons to decide which of them to use.\n",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Feb 10, 2021 at 12:55",
            "is_accepted": false,
            "comments": []
        }
    ]
}