{
    "title": "Identifying hosts on a network with no DHCP",
    "link": "https://reverseengineering.stackexchange.com/questions/27029/identifying-hosts-on-a-network-with-no-dhcp",
    "content": "I have a router with an unknown IP address with no functioning DHCP server.\nI have to connect to the router using a static (non-DHCP) IP (I have tried several including 192.168.1.10). The link LED suggests that I do have a wired ethernet link.\nI want to find out the IP (v4) and subnet that the router responds to.\nI have tried using a netmask of 0.0.0.0 and pinging the broadcast address but no response has been received from the router.\nnmap scanning would probably take a very long time as I don't have any idea what subnet the router is on - it could be 10.x.x.x or 172.x.x.x or 192.168.x.x\nAre there any other ways to discover hosts' IP addresses when very little is known about the network topology and the subnet could be anything?\n",
    "votes": "1",
    "answers": 2,
    "views": "679",
    "tags": [
        "networking"
    ],
    "user": "moo",
    "time": "Feb 17, 2021 at 12:45",
    "comments": [
        {
            "user": "pythonpython",
            "text": "Is the router installed? or is this a router which you need to configure? What is the make and model of this router?\n",
            "time": null
        },
        {
            "user": "moo",
            "text": "It's a ubiquiti edgerouter X sfp which I bricked whilst updating openwrt. I'm getting a link light when I plug in Ethernet, suggesting it's not completely dead and I was hoping I could get some response from the box, if I could ascertain the correct network address. But no DHCP or response to any broadcast packets and the arp table remains empty. Reset doesn't seem to do much. Going to try to get working serial today\n",
            "time": null
        },
        {
            "user": "pythonpython",
            "text": "And you've tried setting your client machine to have a static IP on 192.168.1.X? and tried hitting 192.168.1.1?\n",
            "time": null
        },
        {
            "user": "moo",
            "text": "Yes-no response on 192.168.1.1 unfortunately. I think the flash may have failed during the upgrade as serial is not producing any output. Might be time to give up :( thanks for your help, upvoted\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Connect a machine to the network / router. Run wireshark or tcpdump to capture packets. Look at captured packets to see what addresses and subnets are used.\nTry going in on serial: reset instructions. Docs say it'll come up on 192.168.1.1:\n",
            "votes": "2",
            "user": "pythonpython",
            "time": "Feb 19, 2021 at 16:20",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "This is more of a netsec question but I think dumping the ARP table (<pre><code>arp-a</code></pre>) could work.\n",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Feb 18, 2021 at 20:03",
            "is_accepted": false,
            "comments": []
        }
    ]
}