{
    "title": "How do I analyze a .apk file and understand its working?",
    "link": "https://reverseengineering.stackexchange.com/questions/2703/how-do-i-analyze-a-apk-file-and-understand-its-working",
    "content": "I am an Android app developer, and recently I encountered a problem with in-app purchase. I discovered that in some apps, in-app purchases can be done for free using this application.\nI know this app generates free cards but the proportion of free cards being generated is very high.\nHow do I analyze the <pre><code>.apk</code></pre> file? What basic steps should I follow to reverse engineer the <pre><code>.apk</code></pre> and get an idea of the application logic?\n",
    "votes": "25",
    "answers": 6,
    "views": "37k",
    "tags": [
        "android"
    ],
    "user": "Tirath",
    "time": "Aug 28, 2013 at 9:43",
    "comments": [
        {
            "user": "Antimony",
            "text": "The first step is to try something like dex2jar followed by disassembly or decompilation. That will work as long as it's not heavily obfuscated or using native code.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Basic steps to analyse an android APK\nAnalysing a APK is like any reverse engineering process. If there is no-prior knowledge I do assume you know Java and like to puzzle. Lets have a look at the most basic steps of reversing an APK.\n\nThe first and most important rule in Reverse Engineering is, you want to know what makes it tick. This requires research, thus first research how APK works.\nFirst I would read the basic information about the file format, use Wikipedia ( APK on Wikipedia\nAfter having an idea what I want to reverse I'll look for known tooling, either use Google or recommended Woodmann\nOk, so Wikipedia said it was a zip file. So first unzip it, then pick-up the file and tooling that you are interested in ( classes.dex )\nA quick Google resulted produced a stackoverflow question\nAfter that you got Java, so woodmann has some Java decompilation tools. Java Decompilation at Woodmann\n\nGood luck, don't give up and remember if it's hard it is worth it. If it is too hard, try harder. :)\n",
            "votes": "15",
            "user": "A P",
            "time": "Apr 4, 2020 at 9:32",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Antimony",
                    "text": "<span class=\"comment-copy\">The list of decompilers at Woodman is out of date. It's missing all the best ones.</span>",
                    "time": null
                },
                {
                    "user": "Stolas",
                    "text": "<span class=\"comment-copy\">Feel free to tell mister woodmann, or share the best decompilers here.</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">@tirath feel free to upload or create an entry at Mr Woodmann :) or update an outdated entry with latest ones for the repository is collaborative and it needs collaborators like you  :P</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Steps to Reverse Engineer an APK\n\nUse an APK Extractor tool to filter out the APK file.\nCreate a new directory and copy the APK file there.\nChange the extension of the file from .apk to .zip \nUnzip the file.\nDownload dex2jar from http://sourceforge.net/projects/dex2jar/\nExtract the file into the same directory and copy the classes.dex file      from the .zip file into the extracted file.\nUse terminal or command prompt to navigate the directory and type sh d2j-dex2jar.sh classes.dex\nYou will have a folder containing the source code \nList item\n",
            "votes": "3",
            "user": "Hariharan jayaraman",
            "time": "Jan 7, 2016 at 21:58",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Many people here aren't including the important information... If you decompile to \"Java\", you will likely lose information in the process and recompiling will not work. However it is much easier to read. Here's a link:\nhttps://www.decompiler.com/\nIf you want to be able to edit the APK and recompile, use \"ApkTool\" and edit the SMALI code. You'll need to jar sign the APK and use zipalign before reinstalling the APK to your phone.\nYou can also use IDA Pro to help analyze the code, however I don't know anything about IDA Pro.\n",
            "votes": "2",
            "user": "Leo",
            "time": "Dec 6, 2021 at 5:15",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "A decompiler and more of a suite as far as i can understand (my friend recommends it at least) is http://www.virtuous-ten-studio.com/index.php/downloads which seems to do dex2jar at least. Hope it's an alternative at the very least.\n",
            "votes": "1",
            "user": "lfxgroove",
            "time": "Aug 30, 2013 at 19:33",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Okay!!!...so need to follow this much steps for decompilation and no need to download dex2jar and follow this much steps....here's one simple soultion..\nhttps://www.decompiler.com/jar/07e53b681fff4e9cb3e734353adc7307/com.ednamos.bluetoothlive.apk\njust go through this link and upload your apk file...it will convert your apk file into whole project..and you can download that project in zip format directly .....\nso simple!..Happy coding!!\n",
            "votes": "1",
            "user": "Leo",
            "time": "Dec 6, 2021 at 5:16",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">are you affiliated with the site?</span>",
                    "time": null
                },
                {
                    "user": "Android Geek",
                    "text": "<span class=\"comment-copy\">Yes i am affliated with this site!</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">please check <a href=\"https://reverseengineering.stackexchange.com/help/promotion\">rules on promotion</a></span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Lot of tools and documentation can be found here https://github.com/ashishb/android-security-awesome\n",
            "votes": "-1",
            "user": "Maijin",
            "time": "Jan 10, 2016 at 19:25",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Glorfindel",
                    "text": "<span class=\"comment-copy\">Whilst this may theoretically answer the question, <a href=\"//meta.stackoverflow.com/q/8259\">it would be preferable</a> to include the essential parts of the answer here, and provide the link for reference.</span>",
                    "time": null
                }
            ]
        }
    ]
}