{
    "title": "Why won't Radare2 display main's paramethers of a 32bit ELF on a 64 bit machine?",
    "link": "https://reverseengineering.stackexchange.com/questions/27138/why-wont-radare2-display-mains-paramethers-of-a-32bit-elf-on-a-64-bit-machine",
    "content": "I am new to reversing and currently trying to follow this tutorial, in which the binary provided was compiled on a 32 bit machine hence the file is a \"ELF 32-bit LSB executable\". It runs correctly on my 64bit ubuntu machine however when I load it into radare2 I don't get the same disassembly result as the tutorial.\nAn example is this portion of the \"main\" function:\nOn my machine the argc and envp are not displayed as main's arguments:\n<pre><code>int main (char **argv);\n           ; var uint32_t var_ch @ ebp-0xc\n           ; var int32_t var_4h @ ebp-0x4\n           ; arg char **argv @ esp+0x34\n           0x08048424      8d4c2404       lea ecx, [argv]\n           0x08048428      83e4f0         and esp, 0xfffffff0\n</code></pre>\nWhile on the tutor's version not only are those parameters displayed, but the effective address loaded into ecx is that of the \"argc\" instead of \"argv\" as is the case on my code:\n<pre><code>main (int argc, char **argv, char **envp);\n           ; var unsigned int local_ch @ ebp-0xc\n           ; var int local_4h @ ebp-0x4\n           ; arg int arg_4h @ esp+0x4\n           ; DATA XREF from entry0 (0x8048327)\n           0x08048424      8d4c2404       lea ecx, [arg_4h]           ; 4\n</code></pre>\nMy question is, how can I fix this issue and get the correct disassembled code on radare2 and why won't radare2 find the main's parameters?\n",
    "votes": "0",
    "answers": 0,
    "views": "189",
    "tags": [
        "radare2",
        "patch-reversing",
        "crackme"
    ],
    "user": "Yuran Pereira",
    "time": "Mar 2, 2021 at 12:59",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "was those two analyzed in the same matter (the same function were run?)\n",
            "time": null
        },
        {
            "user": "Yuran Pereira",
            "text": "yes, I followed all the same instructions and used the same commands\n",
            "time": null
        },
        {
            "user": "Yuran Pereira",
            "text": "@PawełŁukasik I just installed r2 yesterday by following the instructions on their website(by downloading it from their git repo) so I guess it should be the latest version\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "yes, it should. I'll check the binary later on my system to see if I can repro this\n",
            "time": null
        },
        {
            "user": "R4444",
            "text": "the output is the same on my machine as well (it is may or may not be correct - these tools predict these variables and types which could be untrue). But I don't think this will hinder your progress in the tutorial. Also, the source code is given by the author. You can always recompile and play with it.\n",
            "time": null
        }
    ],
    "answers_data": []
}