{
    "title": "Totally unknown file analysis approaches",
    "link": "https://reverseengineering.stackexchange.com/questions/2723/totally-unknown-file-analysis-approaches",
    "content": "I guess this is the worst case. I have a file which was initially base64 encoded. This step was easy. But now all I can see is a bunch of rubbish. No structure, nearlly a maximum of entropy, no periods nothing. I have no more information except:\n\nthe size of 5120 KByte\nthere is more than one file inside of this\nthey are all of the same type\nthe used encryption or compression or whatever algorithm is used is some \"standard\" one\n\nI tested so many things ... Does anyone of you has a clue on how to go forward? I am running out of ideas.\nEdit: The histogram which has been now deleted was not correct. Anyway I have no idea how to go on further. Trying to open it with truecrypt to be sure it is not a container didn't work. Do you have any more tips on how to find the files in this?\n",
    "votes": "13",
    "answers": 3,
    "views": "9k",
    "tags": [
        "binary-analysis",
        "encryption",
        "decryption",
        "encodings"
    ],
    "user": "Andre",
    "time": "Sep 1, 2013 at 12:33",
    "comments": [
        {
            "user": "PhoeniX",
            "text": "Can you please explain, what do you want to achieve with this analysis - what files does, it's structure, etc. ?\n",
            "time": null
        },
        {
            "user": "Andre",
            "text": "It is something like a test. And I do not have any other information except the ones I already told. All I can say is that the file was initially a base64 attachment within an email. I extracted it and decoded it to this ... No more information. I am sorry.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "There are programs to find TrueCrypt volumes, but that only works in some cases. Normally they should be indistinguishable. Also, normally you'd have the program to which that data belongs for analysis. Looks like a tricky case. Assuming this is strong cryptography, you are out of luck entirely.\n",
            "time": null
        },
        {
            "user": "Andre",
            "text": "Thank you for the comments. Well it is a test and I'm running out of ideas. It could be truecrypt but any software like tchunt or tchead says: it is not a truecrypt container.\n",
            "time": null
        },
        {
            "user": "dcaswell",
            "text": "Every 76th character is a NewLine in formatting emails with Base 64 encoding. github.com/wildbit/postmark-dotnet/issues/11 If newLines are being changed to periods <pre><code>0x2E</code></pre> maybe that gives you some information. Without seeing more of the file -- hard to be more help -- sorry.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can try to use binwalk. It can be used in various ways:\n\nEmbedded file identification and extraction\nExecutable code identification\nEntropy analysis and graphing (useful for compression and encryption identification)\n\"Smart\" strings analysis \n\nYou could also try to open your file with 7zip, since it supports a shitload of compression formats.\n",
            "votes": "9",
            "user": "jvoisin",
            "time": "Sep 4, 2013 at 16:39",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Andre",
                    "text": "<span class=\"comment-copy\">thank you for your comment. 7zip wasn't able to decompress it. I will give it a try again to binwalk and experiment with it.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I would start with checking the first bytes of a file after base64 decoding. Those would indicate what file format is. \n\nMZ(5A4D) - meaning this is an executable file and you can start with executing it in save (virtual) environment with SysInternals utilities open - ProcMon and Process explorer. In addition, calculate its MD5 value and look it in the Net, VirusTotal. If you have reversing/low tech skills, I also recommend to download a free copy of IDA 5.0 and try to check it there.\nOther file format, then try to look for it's first bytes in hex format in the Net too. One of the good places is FILE SIGNATURES TABLE\nTry to load the decoded file in hex editor and check if there any strings, that might look familiar or with some meaning.\n",
            "votes": "5",
            "user": "PhoeniX",
            "time": "Sep 1, 2013 at 14:02",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Andre",
                    "text": "<span class=\"comment-copy\">Those are the first four (magic) bytes: C9 DE F2 43</span>",
                    "time": null
                },
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">Are you sure it was encoded with base64?</span>",
                    "time": null
                },
                {
                    "user": "Andre",
                    "text": "<span class=\"comment-copy\">Yes. Within the initial file was an e-mail with a base64 attachment. Propably created by Outlook. I also found the correct syntax for sending attachments so I am pretty sure. Every 76 character was a . but afaik this shouldn't be helpful here.</span>",
                    "time": null
                },
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">check the original file for magic number, just in case.</span>",
                    "time": null
                },
                {
                    "user": "Andre",
                    "text": "<span class=\"comment-copy\">It is this: 0E 27 AC 8A but I do not find anything useful. \"file\" under linux isn't also successful.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "You could give a shot at dynamic binary visualization. There's an excellent presentation given by Christopher Domas at REcon as well at BlackHat 2013. The deck for REcon is available here. \nI believe the tool is out now in beta so you could give a try at it.\n",
            "votes": "4",
            "user": "perror",
            "time": "Sep 4, 2013 at 8:24",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Andre",
                    "text": "<span class=\"comment-copy\">at least it is not available or i didn't find anything. I used the 3d visualization of cryptool and it doesn't show any structures. only random data. i also could not compress the file.</span>",
                    "time": null
                },
                {
                    "user": "PhoeniX",
                    "text": "<span class=\"comment-copy\">@LuckyB56, can you please explain, how will this help to solve the issue with the unknown file?</span>",
                    "time": null
                },
                {
                    "user": "LuckyB56",
                    "text": "<span class=\"comment-copy\">@ph0sec To at least figure out if it's executable file at all. It should not happen that after banging your head for few days you realize it's a part of png file or anything of that sort. Since I haven't had chance to try the tool yet, but the presentation describes about it.</span>",
                    "time": null
                }
            ]
        }
    ]
}