{
    "title": "Is is possible to get versioncode and version number of an app in Google Play?",
    "link": "https://reverseengineering.stackexchange.com/questions/27240/is-is-possible-to-get-versioncode-and-version-number-of-an-app-in-google-play",
    "content": "I want to get version code and version number of an app via API from Google Play, but some apps don't have it via google play website. You have to enter via Google Play app and then you can get version number. I suppose it use device id to supply this info because version varies with device sometimes.\nI know there are APIs like aptoide or 42matters to get this info but it's not updated in the moment, so it could be not real info.\nCould anyone help me?\nThanks.\n",
    "votes": "3",
    "answers": 1,
    "views": "4k",
    "tags": [
        "android"
    ],
    "user": "leomark",
    "time": "Mar 14, 2021 at 23:10",
    "comments": [],
    "answers_data": [
        {
            "content": "By reverse engineering Google Play Store app some projects have been created that support the unofficial protobuf based API that is also used by Google Play Store app itself. Using this API it is possible to retrieve meta data of an app not installed.\nHowever as the API is designed for being used on a device you will get only get results \"filtered\" respectively adapted for that device: e.g. if an app is available in different variants for different types of devices (e.g. armv7/arm64 or one for older and one for newer Android versions) you will get only the data of the variant for your device.\nSee for example the following projects:\n\nRaccoon4 (Java)\nGoogle Play Crawler JAVA API\nGooglePlay API C++\nGoogle play python API\n\nNote that Google permanently changes parts of this API, therefore older projects may not (fully) work. Also the supported protobuf data objects are different, depending on the focus of the project. But meta data calls for version code -/name should work on all projects once you managed to sign-in. Authentication got a bit problematic since about one year. Google is very restrictive which clients to accept to use the old authentication API. The new authentication system requires a full web view with JavaScript support like it is used inside Android itself  which makes authentication pretty complicated.\n",
            "votes": "4",
            "user": "Robert",
            "time": "Mar 28, 2023 at 21:14",
            "is_accepted": false,
            "comments": []
        }
    ]
}