{
    "title": "How to debug DLL imported from an application?",
    "link": "https://reverseengineering.stackexchange.com/questions/2728/how-to-debug-dll-imported-from-an-application",
    "content": "I want to debug a DLL when it is called from an application. For example, when Firefox calls <pre><code>nss3.dll</code></pre> \"NSS Builtin Trusted Root CAs\" to check HTTPS Certificates, I want to catch the <pre><code>nss3.dll</code></pre> and debug all its transactions with a known debugger like OllyDBG or any other. \nHow to trace threads created and debug them ?\n",
    "votes": "9",
    "answers": 1,
    "views": "11k",
    "tags": [
        "debuggers",
        "debugging"
    ],
    "user": "studentofmp",
    "time": "Sep 6, 2013 at 8:27",
    "comments": [],
    "answers_data": [
        {
            "content": "In OllyDBG and ImmunityDbg, in Options->Debugging Options-> Events you have an option \"Break on new module\". If this option is set, whenever a new DLL is loaded, Olly/Immdbg will break and let you do your business. \nIn Windbg follow Debug-> Event Filters, in the list you will find Load module, on the side set the options to \"Enabled\" and \"Handeled\" which will achieve the same result as above.\nIf on the other hand you want to break on the specific function, you can check the DLL exports which lists all the functions exported by DLL. After the DLL is loaded, and the debugger breaks as per previously mentioned settings, you can then proceed to set the breakpoints on individual functions.\n",
            "votes": "11",
            "user": "0xea",
            "time": "Sep 2, 2013 at 21:22",
            "is_accepted": true,
            "comments": [
                {
                    "user": "studentofmp",
                    "text": "<span class=\"comment-copy\">using process explorer i see a new dll module is called but with ollydbg nothing happends</span>",
                    "time": null
                }
            ]
        }
    ]
}