{
    "title": "How to decompile a unity apk to a project?",
    "link": "https://reverseengineering.stackexchange.com/questions/27419/how-to-decompile-a-unity-apk-to-a-project",
    "content": "I have tried to decompile a variety of APK's built with unity, but the tools i have used (uTinyRipper, iLSpy, some others) give me some files which give me errors and incomplete code/assets. I see DevX-Unpacker Magic Tools recommended frequently, but I would prefer to avoid paying hundreds of dollars just to decompile some games. Does anyone know a tool which would let me decompile a compiled unity game into a editable project? Preferably one with no cost, or one in the double digits? (I am new to the reverse-engineering scene, sorry if this is a dumb question)\n",
    "votes": "0",
    "answers": 0,
    "views": "7k",
    "tags": [
        "android"
    ],
    "user": "Zopolis4",
    "time": "Apr 8, 2021 at 8:44",
    "comments": [
        {
            "user": "Robert",
            "text": "Decompile to what? Unity can make use of native C code via NDK, such code can never be fully decompiled. Use apktool to decompile to smali code, if that fails because of some resources skip resource decompilation. Then you still have the smali code that can be changed and later apktool can rebuild the modified APK. Free decompiling of an APK to Java code is only possible with simple apps. For those Jadx may work.\n",
            "time": null
        },
        {
            "user": "burrito",
            "text": "You can't, its impossible to do that.\n",
            "time": null
        },
        {
            "user": "FF_Dev",
            "text": "Have you tried github.com/Perfare/Il2CppDumper ?\n",
            "time": null
        },
        {
            "user": "FF_Dev",
            "text": "@burrito having some native code does not mean it cannot be reverse engineered. 1°) binary executable can be converted into a more readable C code (variable names would be lost) and 2°) in some cases there are sourcemaps for error tracking purpose which can be used to recover more details about the source code (file names, lines, and some time class, variable & method names).\n",
            "time": null
        }
    ],
    "answers_data": []
}