{
    "title": "How to mark data as pointer to external functions in ghidra",
    "link": "https://reverseengineering.stackexchange.com/questions/27410/how-to-mark-data-as-pointer-to-external-functions-in-ghidra",
    "content": "I'm examining a piece of malware with Ghidra, and like most malware it uses LoadLibrary and GetProcAddress to dynamically load libraries and functions. GetProcAddress stores the function addresses in an area of memory. I have figured out what functions are stored at what addresses and I would like ghidra to reflect this.\nThat is, i'd like it to say, for example, <pre><code>Call MPR.DLL::WNetOpen</code></pre> rather than <pre><code>Call qword ptr [some_address]</code></pre>. I kind of achieved this by going to the place where the address is stored and adding an external reference, however, this does not propagate the parameters of the reference, and in the disassembled view it looks different from an external function call that ghidra figured out at analysis time. Here are some pictures to help.\nThe first picture is an image of what I know to be LoadLibraryA through analysis. Notice I had to name it LoadLibraryB to avoid an error due to conflicting labels with the originally imported LoadLibraryA.\nThe second image is of the actual LoadLibraryA that was imported at the beginning of analysis, notice it has the correct parameters and return value.\nI just want them to look the same.\n",
    "votes": "2",
    "answers": 1,
    "views": "1k",
    "tags": [
        "malware",
        "ghidra",
        "dll"
    ],
    "user": "Petrarch",
    "time": "Apr 6, 2021 at 21:59",
    "comments": [],
    "answers_data": [
        {
            "content": "You have a external reference (presumably created via right click > References > Add/Edit...) with LoadLibraryB, while the default imported LoadLibraryA is an external function. You can convert the location to a function. From the Ghidra Help Contents:\n\nFrom either the Symbol Table or Symbol Tree, an existing External Location may be converted to a function using the Create External Function popup action on the selected node. The resulting External Function may be converted back to a simple External Location by deleting the function node. To really remove the function and its location will require a second delete on the External Location.\n\nAnd the awkwardness of this seems to be acknowledged too:\n\nCreating an External Reference is currently the only mechanism within the Ghidra GUI to establish an External Location. Once an External Location has been established, it can be converted to a function (see above). This limitation should hopefully be resolved in a future release of Ghidra.\n\nSo in summary: find the symbol in the symbol tree, right click > Create Function (F shortcut)\n",
            "votes": "1",
            "user": "byteit101",
            "time": "Jan 8, 2022 at 2:54",
            "is_accepted": false,
            "comments": []
        }
    ]
}