{
    "title": "Set a breakpoint before WriteFile operation in OllyDbg [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/2754/set-a-breakpoint-before-writefile-operation-in-ollydbg",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions asking for help reverse-engineering a specific system are off-topic unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nIn the process monitor, I see a <pre><code>WriteFile</code></pre> operation. How can I set a breakpoint and view everything about this operation in OllyDbg?\nIf this is not possible with OllyDbg, what other tools can I use?\n",
    "votes": "-4",
    "answers": 1,
    "views": "5k",
    "tags": [
        "windows",
        "debuggers",
        "ollydbg"
    ],
    "user": "studentofmp",
    "time": "11 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "From http://www.ollydbg.de/faq.htm -\n\nHow can I set breakpoint on a call to API function, like MessageBoxA?\nThis is very simple now. Either open command line (Alt+F1) and type \"BPX MessageBoxA\", or search for all itermodular calls in\nDisassembler, click on any call to MessageBoxA and set breakpoint on\nevery call to this function.\nIf you are a happy owner of Windows NT,\n2000 or XP, you can set breakpoint directly on the API function in\nsystem DLL. Name window contains special menu item \"breakpoint on\nimport\". In many cases, logging breakpoint that writes call arguments\nto the log file is a good alternative to ordinary break.\n",
            "votes": "4",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "studentofmp",
                    "text": "<span class=\"comment-copy\">@JansonGreffner yes thanks for ur answer i saw this but i cant found the writefile on ollydbg</span>",
                    "time": null
                },
                {
                    "user": "Dr Deo",
                    "text": "<span class=\"comment-copy\">@jason this has landed me in a very interesting switch statement. Thanks</span>",
                    "time": null
                }
            ]
        }
    ]
}