{
    "title": "Decoding Malware javascript [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/2757/decoding-malware-javascript",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nMy .php and .js files have been attacked twice in a month with some JavaScript code.\nAfter going through this similar thread, I ran the JavaScript code posted there and found this decoding result.\nNow there is 1 URL specified in the result. Could it possible that someone associated with that URL is the one who is injecting code in my files?\nI've already restored files with clean backup and changed my FTP password - which, according to my hosting provider, was being used to inject code into the files.\nAny tips on how to avoid future attacks?\n",
    "votes": "2",
    "answers": 1,
    "views": "582",
    "tags": [
        "malware",
        "javascript",
        "deobfuscation"
    ],
    "user": "403 Forbidden",
    "time": "11 years ago",
    "comments": [
        {
            "user": "Stolas",
            "text": "This question appears to be off-topic because it is about Security.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Yes, the domain is owned (or pwned, they could have hacked a site and use that to stay under the radar) by the group / individual that has attacked you. To avoid future attacker review your code, secure your passwords and check on this every one and then.\nBut, this is very much off-topic. You want the Security Stack Exchange and not this one. This one is about reverse engineering, so if the question would have been about the javascript decoding you did visit the right SE.\nGood luck with securing your server\n",
            "votes": "4",
            "user": "Stolas",
            "time": "Sep 6, 2013 at 10:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "403 Forbidden",
                    "text": "<span class=\"comment-copy\">Hmm..that's what I thought. Thanks for your insights.</span>",
                    "time": null
                }
            ]
        }
    ]
}