{
    "title": "What does the assembly instruction 'REPNE SCAS BYTE PTR ES:[EDI]'?",
    "link": "https://reverseengineering.stackexchange.com/questions/2774/what-does-the-assembly-instruction-repne-scas-byte-ptr-esedi",
    "content": "I disassembled a file with OllyDbg and it had the following instruction:\n<pre><code>REPNE SCAS BYTE PTR ES:[EDI]\n</code></pre>\nWhat does that exactly mean ?\n",
    "votes": "19",
    "answers": 1,
    "views": "34k",
    "tags": [
        "assembly",
        "ollydbg"
    ],
    "user": "aclowkay",
    "time": "Sep 9, 2013 at 20:14",
    "comments": [],
    "answers_data": [
        {
            "content": "The <pre><code>SCAS</code></pre> instruction is used to scan a string (<pre><code>SCAS</code></pre> = SCan A String). It compares the content of the accumulator (<pre><code>AL</code></pre>, <pre><code>AX</code></pre>, or <pre><code>EAX</code></pre>) against the current value pointed at by <pre><code>ES:[EDI]</code></pre>.\nWhen used together with the <pre><code>REPNE</code></pre> prefix (REPeat while Not Equal), <pre><code>SCAS</code></pre> scans the string searching for the first string element which is equal to the value in the accumulator. \nThe Intel manual (Vol. 1, p.231) says:\n\nThe SCAS instruction subtracts the destination string element from the contents of the EAX, AX, or AL register (depending on operand length) and updates the status flags according to the results. The string element and register contents are not modified. The following “short forms” of the SCAS instruction specify the operand length: SCASB (scan byte string), SCASW (scan word string), and SCASD (scan doubleword string).\n\nSo, basically, this instruction scan a string and look for the same character than the one stored in <pre><code>EAX</code></pre>. It won't touch any registers other than ECX (counter) and EDI (address) but the status flags according to the results.\n",
            "votes": "24",
            "user": "peter ferrie",
            "time": "Sep 11, 2013 at 17:37",
            "is_accepted": true,
            "comments": [
                {
                    "user": "aclowkay",
                    "text": "<span class=\"comment-copy\">The value pointed by EAX, or the value of EAX? Also, what accumulators does it update? what should look after a REPNE SCAS ?</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">The value of EAX and pointed at by ES:[EDI]. The address where the string differ from the character stored in the accumulator is the one currently stored in <code>ES:[EDI]</code>.</span>",
                    "time": null
                },
                {
                    "user": "user2797",
                    "text": "<span class=\"comment-copy\">Shouldn't a REPNE SCAS be repeat until a match of the value of EAX is found? So i thought it should be \"look for a character that <b>is the same</b> from the one stored in EAX.\"?</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">@guestme: Yes. Sorry, I did write the opposite of what I meant. I edit the text.</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">@dnivra: but that's not all it can do.  Specifically, repnz scasb is the equivalent of memchr().</span>",
                    "time": null
                }
            ]
        }
    ]
}