{
    "title": "C# Console Application can't load file or assembly, but needs a dll which doesn't exists?",
    "link": "https://reverseengineering.stackexchange.com/questions/27816/c-console-application-cant-load-file-or-assembly-but-needs-a-dll-which-doesn",
    "content": "I have a strange error. I created for testing purposes a normal Console Application and run my own Tracer which is written with the help of Mono.Cecil on this application. I embedd a Stopwatch at the entry and exit of every method.\nAfter I embedd it (the IL doesn't have any errors or warnings in it, when I inspect it with ILSpy) and try to run the Console Application it throws:\n\nUnhandled Exception: System.IO.FileNotFoundException: Could not load file or assembly   'System.Runtime\n.Extensions, Version=4.2.2.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a' or one of its depende\nncies. The system cannot find the file specified.\n\nWhich is really strange, because Version = 4.2.2.0 doesn't even exists? Does anybody have a idea how this could be solved?\nSo when I try to give that Application any other Version of System.Runtime.Extensions this is thrown:\n\nUnhandled Exception: System.IO.FileLoadException: Could not load file or assembly 'System.Runtime.Ext\nensions, Version=4.2.2.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a' or one of its dependencie\ns. The located assembly's manifest definition does not match the assembly reference. (Exception from\nHRESULT: 0x80131040)\n\nI'm stuck and would be thankful for every help or idea to resolve this problem.\n",
    "votes": "1",
    "answers": 0,
    "views": "1k",
    "tags": [
        "assembly",
        ".net",
        "c#",
        "error"
    ],
    "user": "programming_is_bae",
    "time": "Jun 7, 2021 at 20:02",
    "comments": [
        {
            "user": "R4444",
            "text": "this looks very similar - stackoverflow.com/questions/10878602/…\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "Is your problem with the non-existing version or the reference itself? <pre><code>System.Diagnostics.StopWatch</code></pre> resides in <pre><code>System.Runtime.Extensions</code></pre> for .net core so I guess it makes sense that the app tries to load it.\n",
            "time": null
        },
        {
            "user": "programming_is_bae",
            "text": "The main problem is the version it asks, because version=4.2.2.0 doesn't even exists. I have no idea why it would ask me for this kind of version. I could solve it a little bit with Mono.Cecil, by loading System.Runtime.Extensions and change the Version to '4.2.2.0'. But I think it is not a good idea to do it this way.\n",
            "time": null
        }
    ],
    "answers_data": []
}