{
    "title": "How do I get adb to work on a Rockchip RK3288 based android device running Lollipop 5.1.1?",
    "link": "https://reverseengineering.stackexchange.com/questions/27872/how-do-i-get-adb-to-work-on-a-rockchip-rk3288-based-android-device-running-lolli",
    "content": "Lollipop 5.1.1 based device.  OLD ES File Manager installed.  (Yes, the exploitable one).  I can copy to/from the device.  I tried Kingo Root, Root Genius, Towel root, etc.  None of those work.  \"7 taps\" doesn't enable Developer mode, nor does 10, 20, or 100.  I can't install a new image, and the device doesn't have volume buttons, so I can't get to recovery.  Does anyone know what I need to do to enable adb?\n",
    "votes": "1",
    "answers": 1,
    "views": "720",
    "tags": [
        "android"
    ],
    "user": "FrankRizzo",
    "time": "Jun 21, 2021 at 23:38",
    "comments": [],
    "answers_data": [
        {
            "content": "The device is ROCKCHIP based.  That being the case, there are PLENTY of tools that will allow you to dump the device ROM, then you can pick through it, and won't actually NEED adb.\nrkDumper is a very good one.  Get it here:  rkDumper\n",
            "votes": "0",
            "user": "FrankRizzo",
            "time": "Aug 11, 2021 at 1:01",
            "is_accepted": true,
            "comments": [
                {
                    "user": "xdevs23",
                    "text": "<span class=\"comment-copy\">This does not answer the question and should not be the accepted answer. Whether or not someone needs adb is not relevant here.</span>",
                    "time": null
                },
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">@xdevs23 since the answer was given by the person who asked, just on different days, I reckon the scope of the question (or the insights into what the person wanted) grew. It's unfortunate the question and answer don't match, but downvoting is the appropriate measure if you feel it's wrong. Flagging it is not.</span>",
                    "time": null
                },
                {
                    "user": "xdevs23",
                    "text": "<span class=\"comment-copy\">@0xC0000022L despite the answer being from the person asking, I still believe that this should be a comment and not an answer. It promotes a tool unrelated to the question. I understand that a downvote is the appropriate measure and thus will follow up with just that (however, it won't be visible since I don't have enough rep to downvote)</span>",
                    "time": null
                }
            ]
        }
    ]
}