{
    "title": "HTTPS post request not showing up in http debuggers",
    "link": "https://reverseengineering.stackexchange.com/questions/27889/https-post-request-not-showing-up-in-http-debuggers",
    "content": "There is this program I'd like to debug of which I already have the source code.\nWhen I run the program, it sends a post request to a specific URL with JSON data, but it doesn't show up in http debuggers. I have tried Fiddler 4 and HTTP Debugger Pro so far. It also doesn't connect to any proxies. Also, the debuggers capture everything else, so they probably work.\nHere is the C# code responsible for the request (the code itself works, but I may have modified some parts to post it here):\n<pre><code>WebRequest webRequest = WebRequest.Create(\"url\");\nwebRequest.Method = \"POST\";\nwebRequest.ContentType = \"application/json\";\nbyte[] bytes = Encoding.UTF8.GetBytes((\"JSON DATA\"));\nusing (Stream requestStream = webRequest.GetRequestStream())\n{\n  requestStream.Write(bytes, 0, bytes.Length);\n  requestStream.Close();\n}\nWebResponse response = webRequest.GetResponse();\nwebRequest.GetRequestStream();\nStream responseStream;\nusing (responseStream = response.GetResponseStream())\n{\n  string end = new StreamReader(responseStream).ReadToEnd();\n}\n</code></pre>\nWhy are none of the http debuggers capturing the request? Any help is appreciated!\n",
    "votes": "0",
    "answers": 0,
    "views": "192",
    "tags": [
        "c#",
        "https-protocol"
    ],
    "user": "Nqndi",
    "time": "Jun 24, 2021 at 5:56",
    "comments": [
        {
            "user": "Robert",
            "text": "Sorry but I am a bit confused because you call a proxy like Fiddler a debugger which is very unusual. Fiddler is an Man-in-the-Middle proxy or you can call it an HTTPS intercepting proxy but it is never a debugger. Debuggers connect directly to the process and allow to set break points on certain code points. So are you also using a real debugger to check the program or are you just talking about proxies?\n",
            "time": null
        },
        {
            "user": "Nqndi",
            "text": "Well, I am talking about proxies in this case, but http debugger pro isn't a proxy, so I don't know what to call it. I am not using debuggers that connect to the process, but rather these requests/network debuggers that check where applications make requests to.\n",
            "time": null
        }
    ],
    "answers_data": []
}