{
    "title": "Patching PE File - Adding data",
    "link": "https://reverseengineering.stackexchange.com/questions/2790/patching-pe-file-adding-data",
    "content": "After opening a PE file with  a disassembler, I know which instructions I have to patch. And if I have to add some data I can adjust the PE file structure manually so that it gets parsed correctly and executes.\nExample,\nReplace <pre><code>EB 1C</code></pre> with <pre><code>E9 1C FD</code></pre>\nNow, the question. I have to modify multiple locations and manually adjusting values is killing me. Can I do this with code.google.com/p/pefile from python, which I am assuming will help in adjusting? Or is there any other module I can use? Some sample code I can find?\n",
    "votes": "7",
    "answers": 1,
    "views": "1k",
    "tags": [
        "pe"
    ],
    "user": "Zingaro",
    "time": "Sep 15, 2013 at 3:39",
    "comments": [
        {
            "user": "Zingaro",
            "text": "Two changes have been done by editors, which I think are wrong. One changed pefile to PEfile, the other added space and it became PE file. I am referring to code.google.com/p/pefile So, it should be all small and one single word.\n",
            "time": null
        },
        {
            "user": "Karsten Hahn",
            "text": "LordPE is able to rebuild a PE based on your changes: woodmann.com/collaborative/tools/index.php/LordPE\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It is not that easy, or it is rather error prone. If you are going to insert 3 bytes in place of 2 bytes, you would be better off if you do a <pre><code>trampoline</code></pre>: jump to some other place, do what you want, then jump back to the next instruction. By employing trampolining, you can also save the registers.\nA small sample could be like this:\n<pre><code>jmp SomePlace  <---destroy old bytes and insert an unconditional jump  \nNextInst:      <----|_________________________  \n ..                                           |    \nSomePlace:                                    |   \n\"dancing with wolves\"                         |  \njmp NextInst <------- this will jump back to->|  \n</code></pre>\nIn the case, if you are interested in replacing two bytes with two bytes, then almost all hex editors have some form of search and replace functionality.\nOr you can write a simple script in your favorite utility.\nA simple windbg example script for replacing all the <pre><code>push XXXX</code></pre> <pre><code>68 XXXXXX</code></pre> bytes to <pre><code>EB FE</code></pre>. This example is a prototype, you need to tweak it based on the pattern you get:\n<pre><code>.foreach /pS4 /ps 9 ( place { # 68?? 401000 l?0x20} ) {u place L1;ew place feeb;u place L1 } \n</code></pre>\nAll what this does is <pre><code>search</code></pre> the disassembly for the <pre><code>pattern 68??</code></pre> (blind search can alter unintended data, use with caution).\nWhen it is found, it uses the address where it was found to replace the two bytes <pre><code>68XX</code></pre> with <pre><code>EB FE</code></pre>.\nIt does this for all the bytes that are found in a given range. In addition to this, it also prints out the assembly prior to modification and after modification:\n<pre><code># 68??  pattern search command in windbg \n401000 l?0x20  start search from 0x401000 end at 401020 \nu place l1 disassemble one instruction when pattern found\new place feeb  write word 0xfeeb at found address  \ndis assemble again\nloop with foreach where ps and pS are skip before and skip after bytes \n</code></pre>\nA sample output of the above script:\n<pre><code>0:000> .foreach /pS4 /ps 9 ( place { # 68?? 401000 l?0x20} ) {u place L1;ew place feeb;u place L1 } \nmsgbox!start+0x2 [msgbox.asm @ 17]:\n00401002 6800304000      push    offset msgbox!MsgCaption (00403000)\nmsgbox!start+0x2 [msgbox.asm @ 17]:\n00401002 ebfe            jmp     msgbox!start+0x2 (00401002)\nmsgbox!start+0x7 [msgbox.asm @ 17]:\n00401007 6819304000      push    offset msgbox!MsgBoxText (00403019)\nmsgbox!start+0x7 [msgbox.asm @ 17]:\n00401007 ebfe            jmp     msgbox!start+0x7 (00401007)\n</code></pre>\n",
            "votes": "10",
            "user": "peterh",
            "time": "May 26, 2020 at 23:30",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Zingaro",
                    "text": "<span class=\"comment-copy\">I understand the part of replacing equal number of bytes but Trampoline is probably what I am looking for then.</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">there was an old utility called code snippet creator by iczelion which i remember was useful in adding masm snippets and was able to patch the exe (dont remember if it supported multiple patches or not give it a try and see if it solves your problem  should be available in woodmann's tool repository</span>",
                    "time": null
                }
            ]
        }
    ]
}