{
    "title": "Tapping into Ford SCP BUS",
    "link": "https://reverseengineering.stackexchange.com/questions/27916/tapping-into-ford-scp-bus",
    "content": "I'm looking to tap into the Ford SCP BUS to display text onto my dashboard on my '01 Jaguar S-Type.\nThis car has a two row screen that displays the odometer, average fuel consumption - amongst other things. The radio also can display to this; when changing radio stations from the steering wheel controls it displays the frequency and (if supported by the radio station) the name of the station.\n(not my photo, but this shows the cluster for reference. The screen is at the bottom in the middle.)\n\nFrom what few things I have read online (as information about this infotainment system, or any from Ford in regards to this system), this uses the SCP BUS to communicate to the dashboard. Reading the electrical wiring manual for it, it shows all the possible codes that the SCP system can support, and it does show that command number 90 is \"Download block to display command\" sent from \"AUDIO\" (\"Radio Head Unit\" in the manual) to \"MC\" (\"Message Center (part of instrument cluster)\" in the manual).\nMy question is; how would I go about intercepting this data stream/command (using a Raspberry Pi, as this will be used in the final solution). Can I just splice two cables onto the existing harness and have them attach to the Pi, or would I have to include the Pi in the chain and forward any commands to and from the head unit to the rest of the network. Or,  better yet, does anyone know of any resources that I can find to construct these messages myself to save me from interpreting these messages and just directly attaching the Pi to the network, like it will be in the final setup.\n(also don't be confused about me mentioning a Ford system in a Jaguar, this car was manufactured when Ford owned them, and it has a Ford motor, sound system etc.)\n",
    "votes": "1",
    "answers": 0,
    "views": "430",
    "tags": [
        "serial-communication"
    ],
    "user": "rileyhayes_",
    "time": "Jun 29, 2021 at 9:46",
    "comments": [
        {
            "user": "user42221",
            "text": "I am also interested in sniffing & decoding the Ford Instrument cluster SCP bus traffic. Were you able to find a way to do this, if so, could you share what you found? Thx, Ron\n",
            "time": null
        }
    ],
    "answers_data": []
}