{
    "title": "Is it possible to Direct3D 9 debug DLL in an app using the release version",
    "link": "https://reverseengineering.stackexchange.com/questions/27918/is-it-possible-to-direct3d-9-debug-dll-in-an-app-using-the-release-version",
    "content": "I have an application using d3d9.dll, but I want to figure out which functions it calls to gain insight.\nSince online tools I have found are incompatible with my app (32-bit d3d9),\nis it instead possible to use the d3d9d.dll (debug version), or somehow wrap the calls?\n",
    "votes": "0",
    "answers": 0,
    "views": "96",
    "tags": [
        "disassembly",
        "windows"
    ],
    "user": "Maxim van Dijk",
    "time": "Jun 29, 2021 at 11:00",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. Have you considered Frida? What have you tried at all so far?\n",
            "time": null
        },
        {
            "user": "Maxim van Dijk",
            "text": "Thank you:) I don't quite understand how Frida can help. I am using x32dbg to label each function and variable of the application, I have extensive knowledge of it's inner workings  except for the rendering part, which is because Direct3D uses vtables. I have run apitrace with some success, but I want to find the addresses of the calls aswell, so that I can label them (manually).\n",
            "time": null
        },
        {
            "user": "SSpoke",
            "text": "I Recommand using this tool rohitab.com/gallery/api-monitor-2-0/main-window.png works for d3d9.dll and other DLL's you will see all the calls and what information is called inside the CALL's too.\n",
            "time": null
        },
        {
            "user": "SSpoke",
            "text": "If you want to see the Call Address of each function in d3d9.dll when it's called there is a tool for that too its also a API Monitor but a better more scientific check this out: d3.alternativeto.net/dist/s/… (WinAPIOverride), it has call address and return address and more.\n",
            "time": null
        },
        {
            "user": "Maxim van Dijk",
            "text": "Thanks a lot :)\n",
            "time": null
        }
    ],
    "answers_data": []
}