{
    "title": "What is imagebase word means used in Lena151 RE tutorial?",
    "link": "https://reverseengineering.stackexchange.com/questions/27966/what-is-imagebase-word-means-used-in-lena151-re-tutorial",
    "content": "In part 3 of lena RE tutorial, i see a word : imagebase\nCan anyone tell me more about this and better meaning of this word?\n",
    "votes": "0",
    "answers": 1,
    "views": "205",
    "tags": [
        "pe"
    ],
    "user": "Jason",
    "time": "Jul 7, 2021 at 17:24",
    "comments": [],
    "answers_data": [
        {
            "content": "From Microsoft docs:\n\nThe preferred address of the first byte of image when loaded into memory [...] The default for DLLs is 0x10000000.\n[...] The default for Windows NT, Windows 2000, Windows XP, Windows 95, Windows 98, and Windows Me is 0x00400000\n\nSo, in case of exe, you can usually expect that it will be loaded at <pre><code>0x400000</code></pre> address and when you load the dll, it is loaded at <pre><code>0x10000000</code></pre> by default. All these values correspond only to particular process' virtual memory.\nPE files may have different image bases than the default ones. So if a dll has <pre><code>ImageBase = 0x20000000</code></pre>, you can expect it to be loaded at this address instead. Note however, that it is only the preferred address - it may be changed if, for example, second dll that is loaded into the same process already occupies this space.\nIf you have any more doubts regarding PE format, you can either follow the docs linked above or slightly more compact description here.\n",
            "votes": "2",
            "user": "bart1e",
            "time": "Jul 7, 2021 at 18:05",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jason",
                    "text": "<span class=\"comment-copy\">Nice, Thank you for Complete explanations.  But what is image bases means? My English is weak. i don't know What is the meaning of this word. What does it refer to?</span>",
                    "time": null
                },
                {
                    "user": "bart1e",
                    "text": "<span class=\"comment-copy\">It's just the address where the first byte of PE file is loaded into memory when the process is started.</span>",
                    "time": null
                },
                {
                    "user": "Jason",
                    "text": "<span class=\"comment-copy\">Thank you very much. Does this word have another synonym? (imagebase) I know this word only means photo. My English is weak</span>",
                    "time": null
                },
                {
                    "user": "bart1e",
                    "text": "<span class=\"comment-copy\">“ImageBase” is just a name of a member of a structure (‘OptionalHeader’ to be precise). It consists of two words: image and base. The word “image” here refers to the executable loaded into memory.</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">well when windows loads a file into memory it creates a map or in other words an image of the file the base address where it started mapping is the image base address  like the fourth photo on the wall from left side is photo of my xyz like wise</span>",
                    "time": null
                }
            ]
        }
    ]
}