{
    "title": "Detailed description of malware content [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/2887/detailed-description-of-malware-content",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI have just started my journey into the vast and intersting field of malware analysis. I would like to know if there is any website/book or another resource that explains what a particular block of assembly code does. A detailed description of the code would be well appreciated. I know assembly language to some extent and is familiar with all the concepts,function call procedure etc. But i have very little knowledge on how all these applies when it come to windows. like what happens when a dll is used,etc... I would be very glad if someone could tell me where to find a resource that provides a step by step detailed analysis of any malware or any program for that matter.\nI have already a considerable experience in reverse engineering windows applications, most of the knowledge been taken from the 'legend of r4ndom' and woodman websites. I need something that clearly explains how a particular assembly code interacts with windows dlls, resources like menu bars text boxes, etc..\n",
    "votes": "3",
    "answers": 1,
    "views": "241",
    "tags": [
        "malware"
    ],
    "user": "Ray",
    "time": "11 years ago",
    "comments": [
        {
            "user": "DCoder",
            "text": "Sounds like you need something like \"Programming Windows\" or \"Windows Internals\" rather than reverse engineering-specific information.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I recommend You to start from basics, so:\n\n\"Windows Internals\" by Mark Russinovich and David Solomon is a good start for hard copy book.\nOpenSecurityTraining - start from Beginner's courses by interest\n\nWhen You done with those - I am sure You'll be able to ask more specific questions and get more detailed and sophisticated answers.\nGood luck!\n",
            "votes": "2",
            "user": "Denis Laskov",
            "time": "Oct 6, 2013 at 8:46",
            "is_accepted": true,
            "comments": []
        }
    ]
}