{
    "title": "Modify framework.dex which is in boot.oat?",
    "link": "https://reverseengineering.stackexchange.com/questions/29079/modify-framework-dex-which-is-in-boot-oat",
    "content": "I pulled down <pre><code>boot.oat</code></pre> from an API22 Android phone. It's Android 5.1 Lollipop which brought the change from Dalvik to ART and is a bit mistified.\nAs far as I understand, modifying boot.oat is not easy, and permanent, as this file is regenerated whenever a package installation is happening.\nNow, I have a class which I need to modify (just a very tiny bit of it), which resides in <pre><code>framework.dex</code></pre> which was the part of <pre><code>boot.oat</code></pre>.\nI have two questions:\n\nHow can I repack <pre><code>boot.oat</code></pre>? Taking into account that I haven't touch <pre><code>boot.art</code></pre>?\nHow can I make my change in <pre><code>boot.oat</code></pre> permanent? It's very well possible that I will install some new packages onto this system later, which will (might?) ruin my modification.\n\nThanks!\n",
    "votes": "0",
    "answers": 0,
    "views": "342",
    "tags": [
        "android"
    ],
    "user": "Daniel",
    "time": "Aug 1, 2021 at 14:28",
    "comments": [
        {
            "user": "Robert",
            "text": "Are you sure that <pre><code>boot.oat</code></pre> is regenerated when a package is installed? I would have assumed that it is only regenerated after a system update has been installed.\n",
            "time": null
        },
        {
            "user": "Daniel",
            "text": "I might misunderstood something, and yes, <pre><code>boot.oat</code></pre> might only be replaced during system update, which is unlikely for these old devices. Can you help me on Q1 please?\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "As far as I remember the original dex file is completely included in the oat file (or was it in the art file? don't really remember that). If it is use a hex editor, search for the DEX_FILE_MAGIC and extract the dex file. Then decompilation should not be a problem.\n",
            "time": null
        },
        {
            "user": "Daniel",
            "text": "Original DEX is in <pre><code>boot.oat</code></pre> (framework.dex). I need to modify a class in <pre><code>framework.dex</code></pre>, and put it back to <pre><code>boot.oat</code></pre>. But I've various information on rewriting header hash, or CRC or whatever.\n",
            "time": null
        },
        {
            "user": "Soma Mhoud",
            "text": "Start to deodex with any kitchen, after that you can modify th framework.jar\n",
            "time": null
        }
    ],
    "answers_data": []
}