{
    "title": "Can't figure out a crash in IDA \"The memory could not be read -> 00000710 (exc.code c0000005, tid 20612)\"",
    "link": "https://reverseengineering.stackexchange.com/questions/29075/cant-figure-out-a-crash-in-ida-the-memory-could-not-be-read-00000710-exc-c",
    "content": "I'm trying to debug out a game. Basically, the Steam version works perfectly but the GOG version (which is 8kb smaller) has an annoying problem where for some people (which happen to be me) the game will simply not work. It's gonna crash and there's no known solution so I thought about trying to debug it (I'm fairly new to debugger even though I've used IDA for a while). When I load the game in the debugger, I get an error from IDA saying:\n\n\"The memory could not be read -> 00000710 (exc.code c0000005, tid 20612)\"\n\nI'm not even sure if it's because of anti-debugging protections or if it's from the crash itself. I guess that it's the crash's fault because when I try to follow up through this error, IDA stops the process.\nAt this point I'm not sure what to do, hence why I've came to ask here. Thanks to everyone who takes their time to even try to help me!\nThank you all. Please ask if I missed something (as I said I'm fairly new to this haha), I'll answer really quick.\nImage of the assembly when crashing:\n\nPseudocode of the function that gives the error.\n",
    "votes": "1",
    "answers": 2,
    "views": "2k",
    "tags": [
        "ida",
        "windows",
        "binary-analysis",
        "x86",
        "debuggers"
    ],
    "user": "TensionRising",
    "time": "Jul 31, 2021 at 18:14",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "could you please add the textual dump of the assembly in addition to the screenshot?\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "also, what is the value of <pre><code>eax</code></pre>?\n",
            "time": null
        },
        {
            "user": "TensionRising",
            "text": "hey, I'm really sorry for the time I took to answer. Here's a textual dump of the assembly: pastebin.com/ArHeTZra also EAX has 000006E8 as a value\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I can't make comments yet, so will try to submit this as an answer, hopefully that helps:\nYou can try to pass that exception to the application and see if it is capable of dealing with it.\nTo do this you go to Debugger -> Debugger Options -> Edit exceptions... (button on the bottom of the Options dialog).\nThen select your exception, RMC on it and choose Edit. Then uncheck Suspend Program option and check Pass to application checkbox.\n",
            "votes": "2",
            "user": "Irbis77",
            "time": "Aug 16, 2021 at 11:37",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "It is crashing because [EAX+28h] does not refer to a valid readable memory location. EAX = 6E8h + 28h = 710h which is not referencing a valid location.\nEAX is retrieved from memory location dword_19BA9E8, you will need to work out why that is not being populated with the correct value. Essentially the value at dword_19BA9E + 28h must reference a valid readable memory location to avoid the crash.\n",
            "votes": "1",
            "user": "chentiangemalc",
            "time": "Aug 17, 2021 at 6:47",
            "is_accepted": false,
            "comments": []
        }
    ]
}