{
    "title": "Cannot load pdb in IDA Free 7.6",
    "link": "https://reverseengineering.stackexchange.com/questions/29081/cannot-load-pdb-in-ida-free-7-6",
    "content": "I am new to reverse engineering. I am following a tutorial for Windows Reverse Engineering and IDA is a pretty good software for this approach.\nI have just installed the last version of free IDA (7.6) on my Kali linux.\nA have an .exe and .pdb. The exe is correctly loaded.\nIf I ask to load the pdb file, I have an error just after clicking on the button:\n\nAnd in the output console:\n\nCan someone help me please ?\nI have tested with \"root\" user, same problem. Apparently the plugin is integrated to IDA now so no download is available.\nThanks\n",
    "votes": "3",
    "answers": 0,
    "views": "489",
    "tags": [
        "ida"
    ],
    "user": "cactuschibre",
    "time": "Aug 1, 2021 at 19:07",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. Igor is probably better equipped to answer this, but I think the error message says it all. You'll need to have dbghelp.dll (part of the Windows SDKs and WinDbg redistributable packages) and it's unlikely that this exists on any Linux (unless running IDA under Wine). I may be wrong about this, since MS has made some info available about the PDB format and so generally it's possible to make sense of it without dbghelp.dll, but I don't know if IDA has any home-brew implementation of this which would work natively on Linux.\n",
            "time": null
        },
        {
            "user": "cactuschibre",
            "text": "Wonderful... Thank you :) I had to use IDA on a separate Windows machine (I like to separate analysis machine/ test subject hosting machine), because not fully working on Linux apparently. A shame that it was no warned before opening .exe file ... for beginners it could be a little bit frustrating (Any way: first Buffer Overflow exploit for me today :D).\n",
            "time": null
        }
    ],
    "answers_data": []
}