{
    "title": "Why the disassembled code in IDA is different from in xcode? And How to solve unk_xxxx in IDA View?",
    "link": "https://reverseengineering.stackexchange.com/questions/29142/why-the-disassembled-code-in-ida-is-different-from-in-xcode-and-how-to-solve-un",
    "content": "I have built an executable file (the architecture is ARMv7, the base SDK is iOS), which depended on an <pre><code>xxx.a</code></pre> file in xcode; I don't have the source code of the<pre><code>xxx.a</code></pre>.\nI want to check some logic in `xx. So I copy the final executable  file to my Windows PC, use IDA 7.5  to disassemble it. At the same time, I debug this file in xcode using lldb.\nThe pictures show some strange thing. There is an <pre><code>unk_xxx</code></pre> in IDA but in xcode there is some other ARM instructions.\nQuestion one: Why there is an unknow flag in IDA views?\nI searched this on Google but there is nothing valuable. Can there is a possibility IDA 7.5 can not support adrp instruction. So it treats instruction as adrl ,so some error happens.\nQuestion two: Is there  any way to fix it?\nAs there is an <pre><code>unk_xxx</code></pre> in IDA text view, I found some content missing in pseudocode. This blocked me to read the whole logic of this function. I hope someone can give me some insight, so I can push on.\nThanks very much!\nWhen ADRL is been detected, <pre><code>unk_xxxx</code></pre> appears, then pseudocode of disassembling code  of this function are missing.\n",
    "votes": "0",
    "answers": 1,
    "views": "502",
    "tags": [
        "disassembly",
        "arm",
        "ios",
        "lldb"
    ],
    "user": "KHacker",
    "time": "Aug 19, 2021 at 8:11",
    "comments": [],
    "answers_data": [
        {
            "content": "ADRL is a pseudo instruction and is normally encoded as two instructions according to documentation\nso probably it is a different convention being followed by both those tool\nida is probably showing the pseudocoded ADRL\nwhile the other one is showing a split double instruction adrp,add\nalso note ida's dispaly does not have the ...c8 while the other has it\n",
            "votes": "1",
            "user": "blabb",
            "time": "Aug 16, 2021 at 14:32",
            "is_accepted": false,
            "comments": [
                {
                    "user": "KHacker",
                    "text": "<span class=\"comment-copy\">Think you, blabb. Ida detect adrl ,  I do think it's fine . I add some descritions to the answer. Ida shoudn't miss some presudo code . If ida can not treat adrl ,it may detect it as two spit double instruction adrp and add. Now it treat it as adrl ,  not only the pseudocode of this instruct is missing ,and the pseudocode after the this instruction also missing . This is really unacceptable, and I can't carry on my analysis . I think this may be a bug of Ida.  Can you give me some advice how to handle this situation ? Thanks very much!</span>",
                    "time": null
                },
                {
                    "user": "KHacker",
                    "text": "<span class=\"comment-copy\">Hi, Blabb. I think Adrl is affected by alsr. so ida can't get the real jump address . The real address is caculated at runtime. So the behaviour of ida is in expectations . Am I right?</span>",
                    "time": null
                },
                {
                    "user": "KHacker",
                    "text": "<span class=\"comment-copy\">I think I have made some mistake on my last comment . Although Adrl is affected by alsr, the disaccemble code should be adrl lable_offset, it shouldn't be unk_xxxx.   There is another possibilty . Ida can't get the real jump address (offset of instruction to jump). The real address is caculated at runtime. So the behaviour of ida is in expectations .</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">aslr shouldn't matter post relevent text instead of image see what or where x9 is initialzed the last add has a18 in both so both representations seems right  i am not that well versed in arm what i posted is an observation it was not about the quality of either tool</span>",
                    "time": null
                },
                {
                    "user": "Michael Karcher",
                    "text": "<span class=\"comment-copy\">You can disable the recognition of pseudo-instructions in the analysis options, if you require to see the raw adrp/add instructions.</span>",
                    "time": null
                }
            ]
        }
    ]
}