{
    "title": "How to find file compression or obfuscation type",
    "link": "https://reverseengineering.stackexchange.com/questions/2916/how-to-find-file-compression-or-obfuscation-type",
    "content": "The program I'm trying to decompile uses several supporting files:\n\nsomesound.mp3\nsomeimage.jpg\netc..\n\nThe files are all located in the file system, not embedded into the exe. The files are used at runtime for the game images and sounds.\nIf I try and open one of the mp3s or jpgs directly windows will give me an error, the files are obviously packed/encrypted/obfuscated/compressed.\nHow can I determine the obfuscation type of the files?\nI have determined that the first 4 bytes are the same in each file, 43 46 31 30 (CF10 in ASCII). Maybe this information would be useful.\n",
    "votes": "7",
    "answers": 2,
    "views": "7k",
    "tags": [
        "unpacking",
        "deobfuscation",
        "decryption"
    ],
    "user": "Drahcir",
    "time": "Oct 15, 2013 at 18:18",
    "comments": [
        {
            "user": "Jongware",
            "text": "If those bytes are added to the original files, that's already enough to make them unusable with regular software. Check what's directly after them; does that data look like a JPEG, MP3, etc.?\n",
            "time": null
        },
        {
            "user": "Drahcir",
            "text": "@Jongware No, there's no normal JPEG data after CF10. I found this question, it explains that CF10 means compression factor of 10 - stackoverflow.com/questions/113641/file-format-of-cf10-jpg\n",
            "time": null
        },
        {
            "user": "nrz",
            "text": "What OS you are using?\n",
            "time": null
        },
        {
            "user": "Drahcir",
            "text": "@nrz using windows 8\n",
            "time": null
        },
        {
            "user": "Till",
            "text": "Why don't you link a few example files or show us more than just the first four bytes. Somebody with a lot of experience with file formats might be able to spot the encoding.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can give a try to binwalk. This tool is able to do a wild guess about the encryption/compression routine used, with the <pre><code>-BE</code></pre> option.\n",
            "votes": "7",
            "user": "0xC0000022L",
            "time": "Nov 28, 2013 at 15:20",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "(After finally being able to examine 2 examples)\nThey are regular files, obfuscated with a simple XOR encoding. See https://stackoverflow.com/questions/26442162/decryption-of-png-and-jpg-files for a longer description.\nThe file extension may or may not be the original one.\n",
            "votes": "1",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Drahcir",
                    "text": "<span class=\"comment-copy\">Wow, thanks for the response, looks good! I will test tomorrow and see if it works for my files as well.</span>",
                    "time": null
                }
            ]
        }
    ]
}