{
    "title": "Extract text data from a encrypted .DAT file of a game",
    "link": "https://reverseengineering.stackexchange.com/questions/29230/extract-text-data-from-a-encrypted-dat-file-of-a-game",
    "content": "I want to read a text .DAT file, but it's \"encrypted\". The file is from the a smartphone game. There are several .dat files stored on the smartphone, I would like to decode them to know the dates of the events in the game etc.\nThe files are on .dat & do xx ko, i don't found how i can open it good. I test open with libre calc, word, notepad++, sublim text, 7zip etc.\nWhen i open it with notepad++ i have this :\n\nA link of the .dat file : https://easyupload.io/gc967e\nPlease can you help me find a solution ?\nThanks in advance\n",
    "votes": "0",
    "answers": 1,
    "views": "4k",
    "tags": [
        "decryption"
    ],
    "user": "Random999",
    "time": "Aug 29, 2021 at 15:43",
    "comments": [
        {
            "user": "brother_j",
            "text": "was anyone able to figure this out? im also trying to edit a game i love playing\n",
            "time": null
        },
        {
            "user": "raspiduino",
            "text": "I would suggest RE the game, instead of this DAT file.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Notepad++ returns this illegible mess because the file is not meant to be interpreted as human-readable text. That doesn't necessarily mean it's encrypted (but that's a possibility).\nI'm assuming that it's a savegame file and you are probably looking to change some value (like the amount of money your character has). You could try opening this file in a hex editor (I like hexed.it). That way you will be able to read some values from this file instead of getting those weird symbols you get in N++.\nFurthermore you should read up on endianness and encoding to better understand what you are seeing.\n",
            "votes": "1",
            "user": "bosendorfer",
            "time": "Aug 30, 2021 at 15:13",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Random999",
                    "text": "<span class=\"comment-copy\">I am not trying to cheat I like this game a lot and I do not want to take any interest away from it by cheating. But I understand better why the files are not easily readable (in fact it makes sense). But I don't say the name of the game, it's not for nothing.  I love this game and my goal is just to know about future events to better save my resources when needed.</span>",
                    "time": null
                },
                {
                    "user": "Random999",
                    "text": "<span class=\"comment-copy\">I already tried HxD to see if there were magic bits (to know the file format) but it doesn't work. I tested your software online it is the same result, understandable series of characters.  I saw on another topic a software to find in which language it is encrypted, but I am not able to use it (not enough knowledge in programming).  Excellent XorSearch tool by Didier Stevens: <a href=\"https://blog.didierstevens.com/programs/xorsearch/\" rel=\"nofollow noreferrer\">blog.didierstevens.com/programs/xorsearch</a></span>",
                    "time": null
                }
            ]
        }
    ]
}