{
    "title": "How to found signature XTEA for Lua",
    "link": "https://reverseengineering.stackexchange.com/questions/29438/how-to-found-signature-xtea-for-lua",
    "content": "I found an dynamic link library, which is available for download at the following link:\n[libgame.so] (https://easyupload.io/oh94nx)\nI found the function responsible for decrypting xtea:\n(https://pastebin.com/PVS8YXyV)\nI found the function responsible for the encryption of xtea:(https://pastebin.com/jgreUAkj)\ni would like to find try to find the key to xtea, can someone recommend a tool to me or have you already had experience with xtea and can help me find the xtea key?\ni have tried and cannot get a valid signature for lua xtea implementation.\n",
    "votes": "1",
    "answers": 1,
    "views": "502",
    "tags": [
        "decryption",
        "cryptography",
        "lua"
    ],
    "user": "Kdo plane",
    "time": "Oct 29, 2021 at 7:31",
    "comments": [
        {
            "user": "Happy",
            "text": "do you want to make sure your binary uses xtea, or do you want to find the xtea key?\n",
            "time": null
        },
        {
            "user": "Happy",
            "text": "I can improve your question and answer if you provide this information to me.\n",
            "time": null
        },
        {
            "user": "Kdo plane",
            "text": "I want find xtea key\n",
            "time": null
        },
        {
            "user": "Happy",
            "text": "I improved your question a little to try to help you find your answer, do you by any chance know what the architecture is? is it armbi or equivalent?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can try using the plugin:\n\nFindCrypt\nAvailable for free on the Hex-Rays website, there is also an implementation that uses yara\nfindcrypt-yara\n\nI have tested both and they do the job very well, with them it is possible to find possible encryption key in addition to the most common cryptographic patterns used by developers, assuming that the key may be in the dynamic link library, consider also doing an analysis in the main software that calls, and in the last case try:\n\nHooking this xtea function and intercepting the parameters of its call will make it easy to find the key.\n\nI recommend you try SubHook for this task, maybe if you provide the architecture I can specifically help hook it.\n",
            "votes": "1",
            "user": "Happy",
            "time": "Oct 22, 2021 at 11:37",
            "is_accepted": true,
            "comments": []
        }
    ]
}