{
    "title": "Int64 parsing from args in Frida-trace for iOS binaries",
    "link": "https://reverseengineering.stackexchange.com/questions/29474/int64-parsing-from-args-in-frida-trace-for-ios-binaries",
    "content": "I'm using frida-trace to log some methods and I've come across the following.\n<pre><code> onEnter(log, args, state) {\n    log(`-[Somefunction somefield64:${args[2]}]`)\n }\n</code></pre>\n<pre><code>somefield64</code></pre> returns what I believe to be an int64 like <pre><code>0x81008d000101e7</code></pre>.\nI'm not sure how to see the value behind this, all read methods (readU64/S64) complain it's not a valid address (access violation), so I assume I need to change the format.\nLooking at the method in a disassembler and its references show it just takes a string like\n<pre><code>extern _some_field_constant\n</code></pre>\nwith the call as\n<pre><code>[Somefunction somefield64:**_some_field_constant]\n</code></pre>\nSo I know how to get to the constant with\n<pre><code>Module.getExportByName('SomeModule',\"_some_field_constant\") \n</code></pre>\nAnd I can see the address.\nI'm just not seeing the reference to how to retrieve the field from <pre><code>args[2]</code></pre> via frida-trace.\nI had a similar method with similar functionality (no int64) returned a <pre><code>__NSCFConstantString</code></pre> and just managed to do\n<pre><code>onEnter(log, args, state) {\n    log(`-[SomeOther someField:${args[2]}]`);\n    log(ObjC.classes.NSString.stringWithString_(args[2]))                                                                                           \n}\n</code></pre>\nWhat do I need to do (or read in terms of technical documentation, excuse my incomplete understanding/explanation for experienced reverse engineering folks out there) to parse the int64 into a <pre><code>NativePointer</code></pre> so I can get the address in memory.\n",
    "votes": "1",
    "answers": 0,
    "views": "302",
    "tags": [
        "ios",
        "hopper",
        "frida"
    ],
    "user": "phwd",
    "time": "Oct 30, 2021 at 2:44",
    "comments": [
        {
            "user": "phwd",
            "text": "Thanks all, I figured it out. The similar method was just super easier it seemed to be the same but it wasn't at all  🙈 had to follow the internal assembly which pointed to a function via br x4 and loads another function from another framework the int64 field matches some conditionals there, so it seems I never was meant to parse it? 🙈 . Thank you again and please vote to close this question as I am satisfied :)\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "If you found the answer, please post it below so others can benefit.\n",
            "time": null
        }
    ],
    "answers_data": []
}