{
    "title": "How to call a func in an executable binary?",
    "link": "https://reverseengineering.stackexchange.com/questions/29542/how-to-call-a-func-in-an-executable-binary",
    "content": "I have a binary with a func that I can disassemble.  What are simple ways for me to call it with arbitrary args and observe its return val and behavior?\nIdeally, I'd like to do this:\n\nWithin gdb (or gdb-peda)\nFrom C (ie linking to the executable as if its a lib)\nVia Python scripts (I recall reading about a Python script to do this, but can't find it)\n\nI'm operating on Linux, but this question is relevant to other OS as well.\n",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "disassembly",
        "binary-analysis",
        "dynamic-analysis",
        "libraries",
        "call"
    ],
    "user": "SRobertJames",
    "time": "Nov 11, 2021 at 21:17",
    "comments": [],
    "answers_data": [
        {
            "content": "LIEF\nIf the binary is a PIE, exporting functions via the LIEF binary instrumentation framework should allow you to call the function you are interested in as if it was a function in a shared object.\n\nExample: LIEF - Transforming an ELF executable into a library\n\nLD_PRELOAD\nIf the binary is dynamically linked and contains code for setting up the standard C runtime environment e.g. <pre><code>__libc_start_main</code></pre> calling <pre><code>main()</code></pre>, you can hook these functions with LD_PRELOAD and interpose your own code via shared library injection which calls the target function directly with arguments of your choosing.\n\nExample: Modern Vulnerability Research Techniques on Embedded Systems\nExample: Hook main() using LD_PRELOAD \n\nQiling emulator\nUsing the Qiling emulator, you can record the state of the program and then replay the target function in GDB. Since the code is being emulated, it is straightforward to manipulate any aspect of the process' state (registers, memory, etc.)\n\nExample: qiling/examples/hello_x8664_linux_part_debug.py\n\nDBI\nUsing Frida, Pin, DynamoRIO etc. you can basically make the program do what you want at run time, in this case hook a function, manipulate its arguments and observe the subsequent behavior.\n\nExample: Getting Started with Frida : Hooking a Function and Replacing its Arguments\nExample: Pin 3.21 User Guide: Finding the Value of Function Arguments\n\nTrampolining with e9patch\ne9patch is a static binary rewriting tool that allows one to change/insert code prior to run time.\n\nExample: e9tool user guide\nExample: e9afl\n\nThere are probably even more ways to do this, such as process snapshotting with ptrace and /proc and then manipulating registers and memory with ptrace, emulation with PANDA, emulation with Unicorn, emulation with QEMU, possibly even ELF parasite code or inserting code that calls the target function using LD_PRELOAD together with <pre><code>__attribute__ ((constructor)) injected_function()</code></pre>. You have a lot of options.\n",
            "votes": "5",
            "user": "sudhackar",
            "time": "Dec 21, 2022 at 20:34",
            "is_accepted": true,
            "comments": []
        }
    ]
}