{
    "title": "QR-Codes of Temial-Teamachine",
    "link": "https://reverseengineering.stackexchange.com/questions/29595/qr-codes-of-temial-teamachine",
    "content": "I have a tea-machine that reads QR-Codes and brews the tea accordingly. I want to generate my own codes.\nI have the following codes (and more):\n\nCopy/Paste of the C-Column\n<pre><code>L7UMQRQCQAZBD\nOYXPVAANAB4ZE\nK4BCLQEFABBRE\nF5IKJLYGABSJE\n</code></pre>\nI tried a few different decoding mechanisms, but I didn't get any readings that would make sense to me.\nI expect to get numbers for the time and temperature brewing. The name of tee. The number of times the same tee can be used to brew…\nEdit:\nAll the codes as text:\n<pre><code>VORWERK2AE4L7UMQRQCQAZBDERMYRTHWFKD7CM7PKMBOVEAUNE5WNISNWAIZT74WOLVSSHNSRUIHUWGKFUWKTNXXKI\nVORWERK2AE4OYXPVAANAB4ZEER3V2QO4WL6DZGBPBIJWY3AOLKJRXNICEWXVGO6CEKNCKJHFPUPTB3R3EG5YTFTQQE\nVORWERK2AE4K4BCLQEFABBREESWJ5KYBTINVAZWZ4SQ5AQUWFAZO3UPYAKOLO2HRIJNFNGXENAW3QU5IXRSKO5BFMI\nVORWERK2AE4F5IKJLYGABSJEETKQTQVEY73L4SOLWW5P5NLB355G6BVHINON755S6ADUEBXUV3AFW2JQOWGCHT6CME\n</code></pre>\n",
    "votes": "0",
    "answers": 0,
    "views": "259",
    "tags": [
        "encodings"
    ],
    "user": "NDDT",
    "time": "Nov 28, 2021 at 19:26",
    "comments": [
        {
            "user": "NirIzr",
            "text": "Hi, and welcome to RE.SE! Please include all text as text (styled as code if needed) instead of as an image, it'll be easier to manipulate and work with samples that way.\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "For reverse engineering without inspecting the software you need more samples. But even with more samples you may need a lot of tries before you are able to identify the correct algorithms and parameters. Check also reversing projects of devices from the same manufacturer. But in the end having a real firmware for reversing will save you much time.\n",
            "time": null
        },
        {
            "user": "StephanUn",
            "text": "exactly what I'm looking for: D I only scanned a 10 pack of red berry tea and you can see that even the marked area is always a bit different. NNX, NLX, NJX ..... here a variety as codes VORWERK2AE4NNXNZLQOABOZKETESBPTW3HNXITX55IXE4KQ7BT2I6Q5V2BDN7AOLUMWSQVLRI7WWWS4XSHANQZCO3M VORWERK2AE4NLXNZLQOABOZKESRYZSM4ZIUIVBUUDE6SBIVRNAFULFXBLLM7GNRZHL7EVWLOFHVWXVEBBEIBH3XCDA VORWERK2AE4NJXNZLQOABOZKEROUGUS7AMCX7557OJOEDQUHYZ4RPFAAIXW257QTULKSTP254FYP3HRDX5HR66MDQM VORWERK2AE4NHXNZLQOABOZKERFXN7N\n",
            "time": null
        },
        {
            "user": "Dan Tonics",
            "text": "I can provide you with \"used\" sample data if you want\n",
            "time": null
        },
        {
            "user": "NDDT",
            "text": "I still don't know how to do this. I tried all algos I could find.\n",
            "time": null
        }
    ],
    "answers_data": []
}