{
    "title": "identify the functions of stripped binaries",
    "link": "https://reverseengineering.stackexchange.com/questions/29676/identify-the-functions-of-stripped-binaries",
    "content": "As far I know that stripped binaries when we decompile it we can't know what most of functions (<pre><code>sub_XXXXXX</code></pre>) really do becuase they are not part of the binary's symbol table, so the names are automatically generated by IDA which called Dummy names\n<pre><code>Dummy names are automatically generated by IDA. They are used to denote subroutines, program locations and data.\n>> https://www.hex-rays.com/products/ida/support/idadoc/609.shtml\n</code></pre>\nYesterday I reverse-engineered a program and I used IDA Decompiler to see how the program works and i notices the dummy (functions) names, one of them after many hours trying to spot the implementation\n\nI found out (accidentally) that it was strtol's implementation\nhttps://code.woboq.org/gcc/libiberty/strtol.c.html\nhttps://www.tutorialspoint.com/c_standard_library/c_function_strtol.htm\n\nSo is there a tricks/tips or tools maybe like FIRST (https://talosintelligence.com/first) to let us know what these functions are ?\nP.S: The question is not exclusive to IDA\n",
    "votes": "2",
    "answers": 1,
    "views": "489",
    "tags": [
        "ida",
        "decompilation"
    ],
    "user": "K. John Michel",
    "time": "Dec 6, 2021 at 5:01",
    "comments": [
        {
            "user": "R4444",
            "text": "did you look @ this question? reverseengineering.stackexchange.com/questions/175/…\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "The solution to this problem would probably be the use of function signatures. Most common re tools like IDA (FLIRT), ghidra and r2 (zignatures) support this. The only problem is that if the signatures for the libraries your executable was compiled against don't exist in the community you have to create them yourself\n",
            "votes": "1",
            "user": "leongross",
            "time": "Mar 4, 2023 at 14:39",
            "is_accepted": false,
            "comments": []
        }
    ]
}