{
    "title": "How do I find a function and find out what it does using reverse engineering?",
    "link": "https://reverseengineering.stackexchange.com/questions/29749/how-do-i-find-a-function-and-find-out-what-it-does-using-reverse-engineering",
    "content": "I am attempting to find a function in a specific game. Is there any way that, using the assembly code I get from decompiling the game in either IDA or x64dbg, I can locate a function I am specifically looking for?\n",
    "votes": "0",
    "answers": 1,
    "views": "785",
    "tags": [
        "ida",
        "x64dbg",
        "functions",
        "game-hacking"
    ],
    "user": "CoolNite",
    "time": "May 20, 2022 at 10:00",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. That's exactly one of the biggest issues with RCE/SRE you have there. Every target is pretty much unique and so is the strategy. Sure, you'll reuse strategies over the years, but the problem is that there is no general answer for very specific problems. And since you don't even provide any details, I'm afraid this question will probably get closed. Please edit the question to add at least a minimum of information. Also, please give us a goal rather than your idea of what the path to the goal should look like (limitations like tools to be used are fine, though).\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I'm kinda new to reverse engineering, but I'll tell you what I know.\nFirst things:\nThe code is not decompiled, it is just a machine code, but a readable one.\nIf you have an older version of that function, you can scan for it to get the updated version.\nSo to get a function, you need to get the closest thing from it, for example, if you want to get the function that kills your player, you should start to search for a dead state/health/etc. in your player object, get what writes to it, and that should be connected to the kill function somehow, and you go from that function.\nNow let's say you want to find a GUI or something close, use strings they are the best you can use, by finding a string, for example “Health:”, you could find a reference from it to what draws the GUI.\nRemember, strings may be obfuscated and/or their references may be obfuscated, too.\nI recommend you learn more about reverse engineering before posting, there are tons of articles and videos about it.\nHopefully, this helps you.\n",
            "votes": "1",
            "user": "MarianD",
            "time": "Dec 21, 2021 at 2:26",
            "is_accepted": true,
            "comments": []
        }
    ]
}