{
    "title": "Windows UI freezes except the debugger itself when a breakpoint is hit in every debuggers I tried on a particular application",
    "link": "https://reverseengineering.stackexchange.com/questions/29780/windows-ui-freezes-except-the-debugger-itself-when-a-breakpoint-is-hit-in-every",
    "content": "I'm trying to \"trace\" (just setting breakpoint, step in, step over to know how certain things work) an application. But if the application enters suspended state by using breakpoint, every things on the screen are unresponsive, I can't click anything on the taskbar to switch to another application, I can't even press Alt+Tab to switch app. The only  thing still working is the debugger.\nWindbg is the worst case that it isn't even react to my mouse click when a breakpoint is hit, I have to use Task Manager to terminate the debugger along with the target app.\nSo, it's maybe some kind of anti-debugging technique? Does anyone know about this?\nDebuggers that I use:\n\nVisual Studio 2019 (works but everything else freeze)\nx64dbg (works but everything else freeze)\nWindbg (freezes along with the rest)\nIDA Pro (freezes along with the rest).\n",
    "votes": "2",
    "answers": 1,
    "views": "438",
    "tags": [
        "windows",
        "debuggers",
        "anti-debugging",
        "windows-10"
    ],
    "user": "Meigyoku Thmn",
    "time": "Dec 27, 2021 at 14:43",
    "comments": [],
    "answers_data": [
        {
            "content": "I've had this with a few apps and found having the debuggee on a virtual desktop means I can just go back to the other virtual desktop and things are 100% normal\nEDIT after re-reading, I'm not getting exactly that result (often with something like old versions of directx the screen can freeze and this helps)\nTry debugging with ScyllaHide and a bunch of options turned on, AFAIK a lot of the anti debugger tricks will just crash outright but it's possible they've used a combination of NtSetInformationThread to block your debugger and then set up their own debugger to catch the int3 and freeze the system\n",
            "votes": "1",
            "user": "Sam Russell",
            "time": "Dec 27, 2021 at 14:34",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Meigyoku Thmn",
                    "text": "<span class=\"comment-copy\">Can you elaborate about \"virtual desktop\"? This is the first time I hear it.</span>",
                    "time": null
                },
                {
                    "user": "Sam Russell",
                    "text": "<span class=\"comment-copy\">Push windows key + tab and it opens up all your windows to choose from, there's a + button in the corner that creates another desktop and you can swap between them</span>",
                    "time": null
                }
            ]
        }
    ]
}