{
    "title": "Which instrument is effective in discovering carrier frequency?",
    "link": "https://reverseengineering.stackexchange.com/questions/2984/which-instrument-is-effective-in-discovering-carrier-frequency",
    "content": "If two devices have wireless interconnection, how to detect carrier frequency?\nRange may vary in all radio, from FM, GSM to Wi-Fi and WiMax. Which tools are effective for doing this? Which one is economical to use?\nThis question like a first part of my another question: Attack on wireless interconnection\nFor example, list of devices:\n\nHackRF - a project to build a low cost software radio platform.\nBladeRF - the USB 3.0 Superspeed Software Defined Radio. ( work from 300Mhz, thereby it can not get telemetry of satellites, but HackRF can )  \nRed Pitaya Initial set includes: oscilloscope, spectrum analyzer, arbitrary signal generator, frequency response analyzer, PID controller\nMyriad-RF 1 - is a multi-band, multi-standard RF module.\nHDSDR - High Definition Software Defined Radio.\n",
    "votes": "7",
    "answers": 2,
    "views": "600",
    "tags": [
        "tools",
        "hardware",
        "radio-interception"
    ],
    "user": "polar bear on the white snow",
    "time": "Apr 13, 2017 at 12:49",
    "comments": [
        {
            "user": "perror",
            "text": "You may take a look at the Aircrack-ng compatibility drivers page. But, my guess is that it's only one part of your question.\n",
            "time": null
        },
        {
            "user": "Cybergibbons",
            "text": "I find this and the other question are very confusing. The idea of a \"carrier frequency\" is useless on a lot of modulation schemes. You can find the band in which they operate. But what can you do with this? If you don't know the modulation type or anything else, all you know is the band.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "If this a commercial device sold in United States, it must be FCC certified and so must have a label with the FCC ID mentioned somewhere. You can use this page to search for any documents FCC has on file for this device. They should mention the frequencies on which the device operates.\n",
            "votes": "6",
            "user": "Igor Skochinsky",
            "time": "Oct 30, 2013 at 14:25",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "How to detect:\n\nobtain Spectrum Analyzer Rigol makes cheap ones. RTLSDR dongle will also work with\nhttp://eartoearoak.com/software/rtlsdr-scanner\nget close to transmitting radio (extra points for touching it)\nrun RF sweep, log RSSI\nrepeat above until you are sure you found your guy\n\nFrequency hopping might be little annoying, but shouldn't be a problem if you log enough data over time.\nAlternatively you can try one of those cheap Chinese Frequency Counters, for example \n\"GY560 Frequency Counter Meter for Two Way Radio Transceiver GSM 50 MHz-2.4 GHz\" ~$20 on auction sites.\n",
            "votes": "3",
            "user": "Rasz_pl",
            "time": "Nov 9, 2013 at 9:48",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Cybergibbons",
                    "text": "<span class=\"comment-copy\">Those little frequency counters are fine on AM/FM modulation at lower frequencies when there is a clearly strong signal. Useless for much else.</span>",
                    "time": null
                }
            ]
        }
    ]
}