{
    "title": "Game Hacking Prevention - General Question",
    "link": "https://reverseengineering.stackexchange.com/questions/29869/game-hacking-prevention-general-question",
    "content": "So I'm in a middle of developing an online video game for Windows and was wondering, how does games' hacking is even possible?\nI mean, assuming I calculate the HP and the location of every player in the backend, it's impossible for the user side to manipulate those values.\nWhat seems to happen in most games is that the implementation of crucial components like players' health bar has been done on the user side.\nMy question is why, and wouldn't it be better in general and particularly for big companies to implement those things in the backend?\n",
    "votes": "0",
    "answers": 0,
    "views": "154",
    "tags": [
        "patch-reversing",
        "crackme",
        "game-hacking",
        "cheat-engine"
    ],
    "user": "NewGuy",
    "time": "Jan 18, 2022 at 7:49",
    "comments": [
        {
            "user": "dcom-launch",
            "text": "If low latency matters (for example in an FPS game), there could be significant problems if everything must be double-checked by the server.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. Question is if you want/need to develop your own solution or whether something like Punkbuster suits your needs. Matter of the fact is that any hackers/crackers can only be deterred and delayed, not prevented, unless there is some part (of the logic) which doesn't reside on the client side. That said, this form of protection should not be your first and foremost thought. I've seen products (not necessarily games) whose authors spent considerable time in \"protecting\" their code, and neglected overall software quality.\n",
            "time": null
        },
        {
            "user": "Sam Russell",
            "text": "Tons of hacks are about the user either viewing info they shouldn't or automating the game (aimbots or farming) that gives them an unfair advantage over other players. They don't need to change any values to accomplish this and it's just as damaging\n",
            "time": null
        }
    ],
    "answers_data": []
}