{
    "title": "Trying to reverse web application connection, but the network tab shows nothing",
    "link": "https://reverseengineering.stackexchange.com/questions/29899/trying-to-reverse-web-application-connection-but-the-network-tab-shows-nothing",
    "content": "I've been checking out metaverse-sensation Decentraland (play.decentraland.org) and I'm interested in how they've implemented the massive multiplayer netcode to work well for tens of players at the same screen. So I decided to monitor the network.\nI logged in with 2 browsers, got both on the same game screen looking at each other, and monitored the network tab on my browser to see what was being sent. To my surprise, when I move the character on one window, the other one sees the movement, but no data is sent over Chrome's network tab.\nI'm surely missing something. How can I see what data it's sending and where it's sending to? Are there some types of connections on browser that do not trigger the network tab? How can I debug them?\n",
    "votes": "2",
    "answers": 2,
    "views": "109",
    "tags": [
        "networking"
    ],
    "user": "sigmaxf",
    "time": "Jan 20, 2022 at 0:49",
    "comments": [
        {
            "user": "Robert",
            "text": "The network tab sees only HTTP(S) and may be WebSocket connections (see also this question on WebSocket traffic).\n",
            "time": null
        },
        {
            "user": "raspiduino",
            "text": "I suggest using Fiddler or Wireshark\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can use Wireshark tool which is available here: https://www.wireshark.org\nRepeat all your steps while you're sniffing network connections, see if it solves the problem\n",
            "votes": "1",
            "user": "bob",
            "time": "Jan 20, 2022 at 1:58",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "The web application may use the browser's raw socket API or something similar  for TCP and/or UDP protocol (extensions, java stuff, etc.)\nThe browser's HTTP(s) debugger - actually any HTTP(s) debugger - won't and can't display such connections and traffic which are not HTTP compliant.\nAs the other answer: You'd need an entire network sniffer such as Wireshark\n",
            "votes": "1",
            "user": "Ben",
            "time": "Jan 26, 2022 at 16:21",
            "is_accepted": false,
            "comments": []
        }
    ]
}