{
    "title": "Why does Ghidra show no references to any strings?",
    "link": "https://reverseengineering.stackexchange.com/questions/30006/why-does-ghidra-show-no-references-to-any-strings",
    "content": "I'm attempting to compare this binary bootloader to a slightly different C version of some boot code. My initial approach is to look at the <pre><code>msg()</code></pre> calls and the strings they use. I can dump the strings, and most of the strings in the binary are also in the C code. However, Ghidra shows only one or two strings as being referenced anywhere.\nDisassembly seems to be working since it's matching relatively closely between the binary and the repository code.\nBinary\n\nRepository Code\n\nNote that the file in question isn't an ELF or PE/COFF. It's a boot loader image where the very first address is the first instruction (that jumps down past some header info to 00000338). Supposedly it gets loaded into SRAM at address 0x00000000. I believe that since the jump at address 0x00 does seem to go to the correct location (0x00000338).\nI suppose as part of the setup code, the strings could get copied elsewhere...\n",
    "votes": "4",
    "answers": 1,
    "views": "6k",
    "tags": [
        "ghidra",
        "strings"
    ],
    "user": "watkipet",
    "time": "Feb 9, 2022 at 1:13",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "Did you use any loader for this binary? It might be that the sections are not correctly constructed and thus memory addresses do not match for it to be correctly referenced.\n",
            "time": null
        },
        {
            "user": "watkipet",
            "text": "No. I didn't use a loader. This file isn't an ELF or PE--it's some proprietary format. I'll add more information to the question.\n",
            "time": null
        },
        {
            "user": "Paweł Łukasik",
            "text": "Are you sure it should start at <pre><code>0x0</code></pre>? In the linked source code you can find lines like this <pre><code>#define  UBOOT_BASE  0x4a000000</code></pre> and similar that defines much higher addresses.\n",
            "time": null
        },
        {
            "user": "watkipet",
            "text": "Yes. I'm sure it starts at 0x0. At 0x0, you can see a jump to the instructions in my screenshot. U-boot gets loaded after this code (boot0).\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "My problem was that the boot loader code gets loaded into SRAM, which has a base address of 0x20000. So that means the code can access data based at 0x0 and also the same data starting at offset 0x20000 (which it does for strings). So I added an entry, \"SRAM A\", to my Memory Map:\n\nAs you can see, the source of the data comes from the same binary file.\nThen I went hunting for all the pointers to the strings which pointed out past 0x20000 and converted them to string pointers. Here's one:\n\nHere's the string in SRAM (it's referenced):\n\nHere's the same string based at 0x0 (it has no references):\n\nI suspect there are many other reasons that strings won't show up as referenced in Ghidra--this is just one possible reason.\n",
            "votes": "3",
            "user": "watkipet",
            "time": "Feb 10, 2022 at 1:28",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Paweł Łukasik",
                    "text": "<span class=\"comment-copy\">This is exactly what a custom loader should do. Build memory maps.</span>",
                    "time": null
                }
            ]
        }
    ]
}