{
    "title": "What Honeypots are recommended to capture malwares (for analysis)? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/3003/what-honeypots-are-recommended-to-capture-malwares-for-analysis",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI want to operate honeypots for malware analysis purpose and packet capture.\nWhat honeypots are recommended for beginners ? And, what is the best to set-up an honeypot, should it be in a real machine or in a virtual machine ? Finally, does this technique really work for malware capture or is there a better way to get real malware ?\n",
    "votes": "3",
    "answers": 1,
    "views": "859",
    "tags": [
        "malware"
    ],
    "user": "hucuhy",
    "time": "11 years ago",
    "comments": [
        {
            "user": "ixje",
            "text": "This seems to fit better on security.stackexchange.com\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You should take a look at the honeynet project as it's probably the most well known implementation of a honey pot, and it includes plenty of tools and instructions to set up the honey pot and properly set up logging information. You can also see this thread as the accepted answer here provides a lot of detail and perspective about what you should think about when you're setting up a honeypot.\nAny time you're doing any kind of analysis or interaction with malware you should be running it inside of a Virtual Machine. Security procedures aside you never know what you're going to run into when you're doing analysis. \nThat being said, there is plenty of malware that operates differently if it detects it's running inside of a virtual machine vs. a real system but if you're just getting started I would recommend doing your analysis inside of a VM.\n",
            "votes": "2",
            "user": "Community",
            "time": "Mar 17, 2017 at 10:46",
            "is_accepted": true,
            "comments": []
        }
    ]
}