{
    "title": "IDA: String referenced in Assembly, but not shown in string view",
    "link": "https://reverseengineering.stackexchange.com/questions/30040/ida-string-referenced-in-assembly-but-not-shown-in-string-view",
    "content": "I was looking for a spcific string in IDA, but there were no hits in the \"string view\". Now after browsing the disassembly for a while I realize that not only does the string exist, IDA did in fact find this string. It was referenced by assembly code, IDA prints it as a comment next to the assembly, even the location of the string is named with the first characters of the string!\nVery annoying! How come it is not listed in the string view, then? How would I go about finding referenced text strings by string?\nedit: an example:\n<pre><code>and     [rsp+18h+var_10], 0\nlea     rax, aSettextfromsrc ; \"settextfromsrc\"\nmov     [rsp+18h+var_18], rax\nmov     r9, [rsp+18h+var_1A]\n...\n text \"UTF-16LE\", 'settextfromsrc',0\n</code></pre>\nmaybe bc of the UTF-16LE?\n",
    "votes": "1",
    "answers": 1,
    "views": "696",
    "tags": [
        "ida",
        "strings"
    ],
    "user": "bernd feinman",
    "time": "Feb 14, 2022 at 23:50",
    "comments": [
        {
            "user": "Rolf Rolles",
            "text": "Is it a very short string? Perhaps it's in the middle of another string? You should edit your post to include a snippet of the surrounding context (both the reference from the assembly language, and the string itself).\n",
            "time": null
        },
        {
            "user": "bernd feinman",
            "text": "No, rather it's quiet a long string. I will add an example later. Not the first time this happens though, before i just assumed i mistyped the string or something...\n",
            "time": null
        },
        {
            "user": "bernd feinman",
            "text": "@RolfRolles I added an example to the question. maybe bc it's a weird UTF-16LE string?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Right-click in the strings window, choose \"Setup\", and ensure that, under \"Allowed string types\", \"Unicode C-style (16 bits)\" is enabled:\n",
            "votes": "2",
            "user": "Rolf Rolles",
            "time": "Feb 15, 2022 at 1:34",
            "is_accepted": true,
            "comments": []
        }
    ]
}