{
    "title": "What is the best approach to reverse a custom TCP Application Layer?",
    "link": "https://reverseengineering.stackexchange.com/questions/30357/what-is-the-best-approach-to-reverse-a-custom-tcp-application-layer",
    "content": "I have recorded a TCP Stream using Wireshark, so I have Client/Server Communication as a hex dump.\nWhat is the best approach to reverse the custom application layer?\nSome data seems to be ascii encoded, some data isn't.\nThere is no SSL encryption present.\nWhat kind of structure can I expect/look out for in a custom protocoll.\nWhat (free) tools can I use?\n",
    "votes": "1",
    "answers": 2,
    "views": "197",
    "tags": [
        "hex",
        "protocol",
        "networking",
        "wireshark"
    ],
    "user": "Leander",
    "time": "May 2, 2022 at 17:27",
    "comments": [],
    "answers_data": [
        {
            "content": "at first you need to gather all - and i mean ALL information you can get about everything around the paket producing software/device\nsome questions:\n\nhow big are the pakets - are we talking about +-100 bytes or megabytes of unknown data\nwhat applications using that TCP data? automative, medicine, logging/tracing, control commanding,... what is the purpose of the communication?\nare multiple features inside those pakets? control-commands, logging data, reading data etc.\nhave you the ability to change the paket content - with a vendors tool or something to invoke function A, B, C...\nwhat is the vendor/name of the device/software that produces the pakets\nexample wireshark logs, at least a screenshot or text-dump of a part would be very helping\n\nall this can give hints what is the content and how its stored/ciphered... there is no standard how the pakets should look like - its totaly open to the original developer\nyou need to be way more informative if you want to make progress\n",
            "votes": "1",
            "user": "llm",
            "time": "May 3, 2022 at 11:16",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "A useful tool for this is Scapy. You can import a <pre><code>pcap</code></pre>, and it's quite easy to add custom protocols.\nhttps://scapy.readthedocs.io/en/latest/\nhttps://scapy.readthedocs.io/en/latest/build_dissect.html\nWhat you need to to is define the length of each field, and document their possible values (and their meaning).\nLook up for any documentation that could help you in your quest. And send your own packets to see if it works !\n",
            "votes": "0",
            "user": "Olivier Lasne",
            "time": "May 13, 2022 at 17:18",
            "is_accepted": false,
            "comments": []
        }
    ]
}