{
    "title": "Password encryption when transferring from master to PLC",
    "link": "https://reverseengineering.stackexchange.com/questions/30369/password-encryption-when-transferring-from-master-to-plc",
    "content": "So, there is a PLC and a SoftMaster program to work with it. The PLC works according to the XGFenet protocol.\nWhen connecting to the PLC for the first time in SoftMaster, a password must be entered. And I caught this whole process using Wireshark.\nAt the very beginning, we send a message like this to the PLC:\n\nwhere 41 44 is a request for a specific session key.\nWith the next package we get:\n\nThe PLC sent us a set of bytes. It is these bytes that are causing this question. More details further.\nWe enter the password qwerty and it will be converted to\n\nObviously, the bytes sent in the second packet encrypted our password in this form.\nAnd after that we get correct password\n\nQuestion: how did the bytes sent in the second packet encrypt our password to this form?\nI experimented and wrote a script to request this session key multiple times. All the bytes sent differed by about 1000 units, respectively, something like a time or a countdown is sent to us and the password is encrypted based on it.\nIf you do not know the answer, advise what other experiments can be done to understand what it is or in what direction to study. Thank you.\nUPD\nThe password length is limited by SoftMaster and you cannot enter more than 8 characters. But, even if the password consists of one character, the encrypted password does not differ in length from eight characters. Similar to hashing.\nHere are some examples:\nPassword A\n\nPassword AA\n\nPassword AAA\n\nAnd here is the same password qwerty entered with a difference of a couple of seconds\n\n\nBut there is nothing strange here. Before each entry, a new session key is requested and these two identical passwords are encrypted with different keys.\nUsing ProcessMonitor, I checked the services that are called during password entry and validation. Maybe there's a hint here\n",
    "votes": "0",
    "answers": 0,
    "views": "82",
    "tags": [
        "encryption",
        "protocol",
        "wireshark"
    ],
    "user": "Pigeoncatcher",
    "time": "May 11, 2022 at 10:01",
    "comments": [
        {
            "user": "masterX244",
            "text": "I think you need to poke around in the SoftMaster tool. the bytes sent look like a key thats used to encrypt the password with and the algorithm used sits somewhere in the software.\n",
            "time": null
        },
        {
            "user": "Pigeoncatcher",
            "text": "@masterX244 Thanks, I had the same thought. i will check that\n",
            "time": null
        },
        {
            "user": "sudhackar",
            "text": "Can you provide some more (password, encrypted password) tuples? Also does the data length change if you change password length. Try A, AA, AAA, AAAA... etc and share those ? What happens if the password is same but sent at different times?\n",
            "time": null
        },
        {
            "user": "Pigeoncatcher",
            "text": "@sudhackar updated my question\n",
            "time": null
        }
    ],
    "answers_data": []
}