{
    "title": "How do I reverse engineer an Electron compiled file?- a JSC Bytenode file",
    "link": "https://reverseengineering.stackexchange.com/questions/30434/how-do-i-reverse-engineer-an-electron-compiled-file-a-jsc-bytenode-file",
    "content": "I have a bytenode JSC file - which is described as:\n\nThis tool truly compiles your JavaScript code into V8 bytecode, so\nthat you can protect your source code. It can be used with Node.js, as\nwell as Electron and NW.js (check examples/ directory).\n\nIt obfuscates your Electron app. How do I go about decompiling it? x64dbg/Ollydbg won't recognize the file. Is it possible?\nThere used to be a Ghidra plugin for this called <pre><code>ghidra_nodejs</code></pre> but it has been removed from Github (Wayback machine link).\n",
    "votes": "2",
    "answers": 0,
    "views": "5k",
    "tags": [
        "ghidra",
        "deobfuscation",
        "decompile",
        "unknown-data"
    ],
    "user": "MendelG",
    "time": "May 26, 2022 at 0:12",
    "comments": [
        {
            "user": "user22363",
            "text": "PositiveTechnologies {the owner of that github repo) has an excellent article about this subject.    swarm.ptsecurity.com/…\n",
            "time": null
        },
        {
            "user": "MendelG",
            "text": "@user22363 I saw that before but it doesn’t help since the Ghidra plugin doesn’t exist anymore. Thanks\n",
            "time": null
        },
        {
            "user": "user22363",
            "text": "You can find the plugin at Natalya Tlyapova's github [1], she co-authored that blog and work as Security Researcher at Positive Technologies.      Positive Technologies is one of these Russian companies that the US sanctioned, that why their GitHub account was removed.     [1]github.com/ntlyapova/ghidra_nodejs\n",
            "time": null
        },
        {
            "user": "MendelG",
            "text": "@user22363 thanks! Have you installed the plugin before? I'm having trouble with building the plugin (step 4 of the readme file). Would you be able to build the plugin and send me the Zip file? And I'll reward the bounty\n",
            "time": null
        },
        {
            "user": "user22363",
            "text": "No, I didn't use it before. I tried to compile it multiple times but apparently it refuse to work properly, I even compiled Ghidra from the source following Ghidra's DevGuide and eclipse still throw errors left and right.\n",
            "time": null
        }
    ],
    "answers_data": []
}