{
    "title": "TP-Link Manual Installation",
    "link": "https://reverseengineering.stackexchange.com/questions/30486/tp-link-manual-installation",
    "content": "Before starting my researches, i was just curious about how my router could work. I found some posts about reversing and emulating TP-LINK routers, so i bought one.\nFirst, i successfully extracted the .bin firmware, i have the rootfs and access to all files of the firmware. (i used the firmware-mod-kit to extract)\nI tried to modify the web server and install php on it.\nFirmware : https://www.tp-link.com/en/support/download/tl-wr841n/#Firmware\nSo i had a lot of questions (and i'll do others posts for them) but one of them was simply : can I manually 'install' anything inside the firmware/inside the router/inside the rootfs. For example, to install php, you would do :\n<pre><code>sudo apt install php<version>\n</code></pre>\nBut at the time i can't have a shell and a router don't have a package manager, can i manually install PHP, nmap or any other package. I know every packages are not installed the same way, but how can I know which i can install, and which i cannot ?\nAnd how to know the way to install them manually ?\nThanks everyone before everything!\n",
    "votes": "2",
    "answers": 1,
    "views": "259",
    "tags": [
        "firmware"
    ],
    "user": "le_pabo",
    "time": "Jun 9, 2022 at 1:19",
    "comments": [
        {
            "user": "raspiduino",
            "text": "I have just checked and found that OpenWRT support your device. So if you want to get a shell, install OpenWRT (the easiest way I can think of). But the problem is, PHP is big and may not fit your router's internal storage. Nmap might be OK\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "Commercial router firmware usually don't come with apt or dpkg support so you won't find a package manager there because they are not designed to be changed at run-time. Embedded devices are usually shipped with a firmware that does not change, if you get an update then this update updates the whole firmware. If you want to install something you have to do it manually by replacing binaries and dependent files.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "If and when you can get shell on the device, you will probably not be able to use <pre><code>apt</code></pre> to install software. <pre><code>apt</code></pre> is a package manger that several Linux distributions include, namely Debian and its derivatives like Ubuntu. <pre><code>apt</code></pre> has a configuration file that points to servers that contain software built for your distribution. For example, Ubuntu uses the file <pre><code>/etc/apt/sources.list</code></pre> to find the servers containing software that will work on specifically your version of Ubuntu.\nDynamically linked software must be linked against your existing (on your machine) libraries in order to work properly. There's a team of people behind the scenes making this happen. Many of them them are doing it just for the love of the sport.\n<pre><code>apt</code></pre> is simply a package manager. It looks at some servers you've told it to look at, then downloads and attempts to install some software you ask it to. On most common distributions like Debian or Ubuntu, that list of servers has been preconfigured. If you run <pre><code>apt</code></pre> with the same configuration on a different distribution, the software downloaded will fail to run because that machine doesn't have the same libraries (or architecture).\nThere may be some exceptions.\nMaybe a source that you can configure that downloads and installs static builds of software. Static builds don't require you to have a specific library, only a specific architecture. This requires that you install a static build of <pre><code>apt</code></pre> or another package manager and are actually able to find one of these sources. I'm personally not aware of any, but haven't looked.\nDD-WRT and friends (completely custom firmware for routers -- none of the original firmware remains) have their own package managers. These can be used to install a limited range of software. This is not what you are asking about, but I thought it was good to  include.\nAll of the above is informational.\nTake it in, but ignore it in regards to your main question.\n\ncan I manually 'install' anything inside the firmware/inside the router/inside the rootfs.\n\nThere are 2 ways I can think of to \"install\" or run a program on your router.\n1: Get a shell, upload to /tmp/ or external storage\nGet a shell. Preferably a root shell.\nMaybe there's an existing vulnerability that will help you get a shell.\nMaybe you can crack open the router and discover a serial connection that prompts you with a login or a straight up shell?\nIf you can get a shell on the router, you can probably download some statically linked software to <pre><code>/tmp/</code></pre>. A tool like curl, wget, an ssh server supporting scp, tftp, ftp, or a mechanism present on the web interface to upload a file may help you.\nOnce you get a file on the system, you can hope the tool that helped you get it there made it executable. See chmod. The command <pre><code>ls -la</code></pre> will help you determine if your file is executable. If you can run <pre><code>chmod +x YOUR_FILE</code></pre>, you're in business. Run the program.\nThis approach has the limitation that you must store your file in RAM. Statically linked binaries are large. SOHO routers don't have much RAM beyond what they need. If your router has a USB port, put your binary (program) on a flash drive and plug it in. With the right formatting, your router should see it. You may need to do some more research to figure out where it is or how to mount it. Even this way, you may run in to RAM limitations. It probably won't be obvious if this is the case. There typically isn't a simply massage stating as much.\n2: Modify and flash the firmware\nThis is a very big rabbit hole.\nIt usually involves rebuilding the filesystem archive format.\nSometimes companies use custom variations of <pre><code>squashfs</code></pre>.\n<pre><code>sasquatch</code></pre> in conjunction with <pre><code>binwalk</code></pre> is often used to extract from these filesystems.\nYou'll have a harder time putting the filesystems back together.\nAfter that You'll have to repackage in to the (most likely) proprietary firmware format.\nThis will be at a minimum checksummed and possibly signed.\nIn its most simplistic form, signing means that the vendor can prove that they provided the firmware and that you didn't.\nIf you can modify the firmware, you either have to upload it through some interface (web server, tftp, etc), or flash it directly. The former presents a high risk of bricking your device.\n3: Conclusion\n\nCompile a static binary for the router's architecture\nTry to get a shell\nFigure our how to upload a binary\n\nHope there's enough RAM for it\n\nA simple \"Hello World\" would be a good start\n\n\nMake it executable\nExecute your binary\n\nIf you have a shell, you might even be able to see it\n\n\n\n\n\nFuture Askings (asked or researched)\n\nHow does one search for existing vulnerabilities that provide shell on a platform?\n\nWhat mechanisms prevent one from downgrading firmware on a router?\n\n\nHow is it possible to determine the architecture of my machine?\nHow can a program be statically linked in Linux?\n\nCan statically linked programs be reduced in size?\n",
            "votes": "2",
            "user": "Matthew Tingum",
            "time": "Jun 8, 2022 at 7:59",
            "is_accepted": false,
            "comments": [
                {
                    "user": "le_pabo",
                    "text": "<span class=\"comment-copy\">Hello Matthew, first of all thanks for taking your time to answer me. I tried to inject a reverse shell inside the firmware by modifying it and it did not work and now, thanks to you, i know why. I just checked and they were all dynamically linked. And i'm sure at 70% that one of the lib could be missing. I'll now look for static linked binaries.</span>",
                    "time": null
                },
                {
                    "user": "Matthew Tingum",
                    "text": "<span class=\"comment-copy\">How did you inject the reverse shell? It's possible that this may have failed for additional reasons. I'm interested to know the model of the device you're working on to better help.</span>",
                    "time": null
                },
                {
                    "user": "le_pabo",
                    "text": "<span class=\"comment-copy\">I did not really injected it, I added it to the /bin/ folder and rebuilt the firmware to upload it. I use a TL WR841N, you can find the firmware [here](tp-link.com/en/support/download/tl-wr841n/#Firmware).  I downloaded netcat <a href=\"https://github.com/darkerego/mips-binaries\" rel=\"nofollow noreferrer\">from this repo</a>.  After adding netcat, I edited the 'rcS' script in '/etc/init.d/' folder and added a netcat command, but bot listener  (-lvnp) and reverse shell (connect to my listener) seems to be ignored. I'll try to check if my command are executed by using echo or something else</span>",
                    "time": null
                },
                {
                    "user": "Matthew Tingum",
                    "text": "<span class=\"comment-copy\">I think we're far apart on our mutual understanding of <i>how</i> the firmware was rebuilt and re-flashed. My biggest concern is that your code isn't actually running. Maybe you flashed through the web interface. It could have given you a success message but actually failed. IPTables rules could be standing in your way. Maybe an exercise for you is figuring out how to write a program that will discard all IPTables rules. I don't think that's your problem but its a start.</span>",
                    "time": null
                },
                {
                    "user": "Matthew Tingum",
                    "text": "<span class=\"comment-copy\">Try to find a simple success indicator for your reflash. Change a letter in a static HTML page. Verify that it changes.</span>",
                    "time": null
                }
            ]
        }
    ]
}