{
    "title": "windbg shows different instruction at address when you set the breakpoints in 2 different breaks but not the same break (nvd3d9wrapx thunk in user32)",
    "link": "https://reverseengineering.stackexchange.com/questions/30596/windbg-shows-different-instruction-at-address-when-you-set-the-breakpoints-in-2",
    "content": "In the first example I only set a breakpoint on <pre><code>user32!CreateWindowExW</code></pre>\n\nIn the second example, I set 2 breakpoints at the same time on  <pre><code>user32!CreateWindowExW</code></pre> and <pre><code>notepad!WinMain</code></pre>\n\nIn the 3rd example I place a breakpoint on <pre><code>notepad!WinMain</code></pre>, wait for it to break, and then I place the breakpoint on <pre><code>user32!CreateWindowExW</code></pre>, and this time it shows the jump instruction.\n\nI confirmed that it does indeed jump to that address by stepping through, and I confirmed that the jump isn't there in the first 2 examples by unassembling as well as stepping to the next instruction. The callstack is identical in all 3 scenarios.\nIt reproduces every time. This is Windows 7 btw Windbg x64 10.0\nWhat is going on ?\n",
    "votes": "1",
    "answers": 0,
    "views": "100",
    "tags": [
        "windows",
        "windbg"
    ],
    "user": "Lewis Kelsey",
    "time": "Jul 5, 2022 at 11:47",
    "comments": [
        {
            "user": "Paweł Łukasik",
            "text": "what's mapped at this <pre><code>0x6fff00340</code></pre> address? This looks like some hooking and <pre><code>jmp</code></pre> trampoline\n",
            "time": null
        },
        {
            "user": "Lewis Kelsey",
            "text": "@PawełŁukasik from !address: + 06fff0000 070000000 000010000 MEM_PRIVATE MEM_COMMIT PAGE_EXECUTE_READ <unknown> [dtrR............]. It's clearly some trampoline block allocated by the nvd3d9wrapx  because it then injects the jump instruction to the trampoline but I do not know why windbg is behaving like that\n",
            "time": null
        },
        {
            "user": "Lewis Kelsey",
            "text": "It's not a trampoline function exactly. What it jumps to is just a single rip-relative memory indirect jump to an address, the address is stored with it. This is an address of a procedure  loc_7FEFA2C3E40 in nvd3d9wrapx that I haven't got the symbols for\n",
            "time": null
        }
    ],
    "answers_data": []
}