{
    "title": "Reverse Engineering SCARA Style Robot - USB Protocol",
    "link": "https://reverseengineering.stackexchange.com/questions/30619/reverse-engineering-scara-style-robot-usb-protocol",
    "content": "I am new to the topic of reverse engineering software (not new to hardware reverse engineering), so this question is more of a \"lets ask people's opinion\" type of thing.\nI have a robot arm that my biology research lab wants to use for more than the companies software will let it. So I was tasked with writing our own code for controlling the robot so it can do more things.\nUsing Wireshark I can see it is made up of 1 USB hub that controls two cameras and two usb-serial converters. I would imagine that the USB-Serial converters are controlling the motors, but when I look at the data passing through those devices, I see a lot more than just data being sent when the robot arm moves.\nThe struggle is that the original software doesn't have a way to move individual arms so I can't simply move and arm and see what data is sent. It only completes compound movements and I am struggling to parse it all out.\nAny advice for how to filter out some of the background noise and focus in on the actual control protocol?\nThank you!\nEdit:\n\nThis is a screenshot of what Wireshark says the robot contains inside of it. I would think that the communication to the joints would go through the USB-Serial converter\n",
    "votes": "1",
    "answers": 0,
    "views": "51",
    "tags": [
        "wireshark"
    ],
    "user": "bcarroll14",
    "time": "Jul 13, 2022 at 19:08",
    "comments": [
        {
            "user": "Mega Tonnage",
            "text": "Can you get access to the software that drives the arm? I don't do any hardware fiddling, but I would guess you need simple movements to map the control codes?\n",
            "time": null
        },
        {
            "user": "bcarroll14",
            "text": "@MegaTonnage Hey! Thank you for replying. And yeah I have access to the software that drives the robot and I do need simple movements to map the control codes, but the software only drives it in complicated compound movements that I cannot control. It only allows you to set up preconfigured compound movements and piecing that out is hard by just watching the Wireshark data I don't have the experience to decompile the .exe files that drive the arm, but I have looked into it.\n",
            "time": null
        },
        {
            "user": "Mega Tonnage",
            "text": "No problems, maybe someone more hardware oriented will reply.\n",
            "time": null
        },
        {
            "user": "llm",
            "text": "1. what is the name of the robot/robot software? 2. try to come up with some test \"complicated compound movements\" that only change a single axis - what does change in the protocol, try to stabilize as much as possible - then some movements that only change a different axis - compare these two test-sets\n",
            "time": null
        },
        {
            "user": "bcarroll14",
            "text": "@llm you can find the user manual at andrew-alliance.intercom-attachments-1.com It is a Generation 1 Andrew Pipetting Robot from AndrewAlliance.com. The simplest action I can make with the robot is tell it to move liquid from one tube to the one next to it. Then it runs its self through a setup phase, executes the movement and stops. So I will definitely try setting up two different motions and seeing what changes.\n",
            "time": null
        }
    ],
    "answers_data": []
}