{
    "title": "How Does ARM64 EOR with Shift Work?",
    "link": "https://reverseengineering.stackexchange.com/questions/30660/how-does-arm64-eor-with-shift-work",
    "content": "I'm reverse engineering an ARM64 binary and I came across the following instruction\n<pre><code>48 05 48 4A    eor w8, w10, w8, lsr #1\n</code></pre>\nI looked up the definition of ARM64's <pre><code>eor</code></pre> instruction here: https://developer.arm.com/documentation/dui0473/m/arm-and-thumb-instructions/eor\nUnfortunately, the information in that documentation doesn't directly address the optional <pre><code>lsr #1</code></pre> part of the instruction.\nI understand this instruction would generally perform a Bitwise Exclusive OR between registers w10 and w8, storing the result in register w8. What I'm unsure about is the Logical Shift Right portion. Does this shift occur on the result of the EOR, or does it first shift one of the registers and then perform the EOR?\nAlso, if anyone can recommend a good tool for testing this I would be appreciative.\nThank you.\n",
    "votes": "1",
    "answers": 2,
    "views": "645",
    "tags": [
        "arm64",
        "aarch64"
    ],
    "user": "h0r53",
    "time": "Jul 19, 2022 at 18:27",
    "comments": [],
    "answers_data": [
        {
            "content": "It's the 2nd operand (i.e. <pre><code>w8</code></pre> in your example) that is shifted before the relevant calculation is done.\nYou can see the explanation in the same document you linked to in the section Syntax of Operand2 as a register with optional shift.  This is pulled out separately in the documentation as this <pre><code>Operand2</code></pre> feature applies to multiple different instructions, not just <pre><code>EOR</code></pre>.\n",
            "votes": "5",
            "user": "Ian Cook",
            "time": "Jul 19, 2022 at 20:26",
            "is_accepted": true,
            "comments": [
                {
                    "user": "h0r53",
                    "text": "<span class=\"comment-copy\">Thank you. I was unable to initially find this information since it was not directly included with the <code>EOR</code> documentation. This explanation confirms my previous conclusion regarding how the EOR with shift works.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I found a simple online ARM emulator here: https://wunkolo.github.io/OakSim/\nI crafted an example and it appears that the instruction works by first performing the Logical Shift Right on register <pre><code>w8</code></pre>, then the result of that operation is EOR'd with register <pre><code>w10</code></pre>, and finally the result is stored in register <pre><code>w8</code></pre>.\nSo the sequence of events is:\n\nShift register\nEOR\nStore result\n",
            "votes": "1",
            "user": "h0r53",
            "time": "Jul 19, 2022 at 18:39",
            "is_accepted": false,
            "comments": []
        }
    ]
}