{
    "title": "x64 Windows: Why is ExAllocatePool stepping on the caller's stack?",
    "link": "https://reverseengineering.stackexchange.com/questions/30736/x64-windows-why-is-exallocatepool-stepping-on-the-callers-stack",
    "content": "I am playing around with windbg on a 64-bit machine and noticed something interesting:\n<pre><code>nt!ExAllocatePool:\n    ...\n    sub rsp, 0xd0\n    ...\n    mov qword ptr [rsp+0xf8], rbx\n</code></pre>\nWindows only allocated 0xd0 bytes for locals but then it decides to step on the callers stack since 0xf8 is > 0xd0! What am I missing here? This HAS to be a bug in Windows.\n",
    "votes": "2",
    "answers": 0,
    "views": "115",
    "tags": [
        "windows",
        "x86-64"
    ],
    "user": "Yolo41251263",
    "time": "Aug 4, 2022 at 15:46",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. This is lacking a little information. So you're saying this was built with frame pointer omission active? What exact build? I'd like to have a look myself.\n",
            "time": null
        },
        {
            "user": "Yolo41251263",
            "text": "This is Windows, I didn't build anything, I just attached a kernel debugger and looked at ntoskrnl\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "At what point did I write anything about you built anything? Thing is, you don't provide enough context, so I was asking a very pointed question. And I was also asking about what exact build you are looking at. In my version of <pre><code>ntoskrnl.exe</code></pre> <pre><code>ExAllocatePool()</code></pre> encompasses 5 instructions including a <pre><code>sub rsp, 28h</code></pre> which clearly doesn't match whatever you have. The <pre><code>ExAllocatePoolWithTag()</code></pre> it calls takes merely one more argument, meaning everything fits into registers anyway and stack is used only for locals. But none of what I see matches what you got. So what exact version of ntoskrnl?\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "What are the instructions before sub rsp? and does the rsp change afterwards? Please post a longer snippet or tell us where to find this code.\n",
            "time": null
        }
    ],
    "answers_data": []
}