{
    "title": "Reversing Games like Manfred dis",
    "link": "https://reverseengineering.stackexchange.com/questions/30813/reversing-games-like-manfred-dis",
    "content": "I've looked at as many resources on Manfred and Manfred's work\nI've watched the DEFCON 25 Live talk about what he hacked.\nHere\nI've also looked, listened and read the dark net diaries Part One -\nYouTube\nDark net diaries part one\nPart Two -\nYouTube\nDark net diaries part two\nFrom what my understanding is to bypass the HWID bans he ran the game and did a full memory dump, he also captured the packets sent off the game and started reverse engineering the game and started reversing the routines within a game. I've tried for a few month now to figure out how he managed to do things like this but their is no clear method on how Todo so. I figured the best place to ask would be here.\nQuestions\n<pre><code>- How did Manfred do it?\n - What can I do to get started in this field of game hacking?\n - What was the method Manfred had used?\n - Is their any resources on this?\nAny help is appreciated. TL;DR - How did Manfred hack so many online games\n</code></pre>\nThank you.\n",
    "votes": "0",
    "answers": 1,
    "views": "134",
    "tags": [
        "assembly",
        "game-hacking",
        "binary-editing",
        "api-hacking"
    ],
    "user": "Silence",
    "time": "Aug 23, 2022 at 20:54",
    "comments": [],
    "answers_data": [
        {
            "content": "Manfred has 20+ years of experience and many skills, so don't expect to get there overnight. As a starting point:\n\nRead Beej's guides: https://beej.us/guide/bgnet/\nWrite a client and server, use a standard protocol like HTTP.\nPractice intercepting/modifying traffic between your client and server. Try  OWASP ZAP, BurpSuite or similar.\nWrite a dll\nRead up on dll injection\nInject your dll into your client program\nUse your dll to intercept/modify client/server traffic\nModify your server to have a fake inventory/stats/store system.\nAttempt to use integer overflows to modify the results of inventory/stats/store actions.\nAdd encryption to your client/server communication\nDoes your dll still intercept/modify traffic? If not, fix it\n\nThis should give you plenty of learning without having to jump straight into the deep end with a real game. I find that attempting something without the prerequisite knowledge can result in you being sidetracked reading/learning and/or giving up.\n",
            "votes": "1",
            "user": "Mega Tonnage",
            "time": "Aug 24, 2022 at 2:27",
            "is_accepted": true,
            "comments": []
        }
    ]
}