{
    "title": "Visual Arm64 Emulator",
    "link": "https://reverseengineering.stackexchange.com/questions/30812/visual-arm64-emulator",
    "content": "I have an arm64 binary that I've been reversing and I've reached a point where it would be immensely useful to visually emulate / debug a section of code. I have the full binary and I can also find a way to dump the memory of the process at the particular code segment I'm interested in.\nWhat would be nice is some emulator that I could load my binary into along with the registers and stack values. Then I would like to emulate the instructions step by step until the routine is complete. I'm mostly wanting to know how the code is manipulating data step by step.\nI'd like access to the full instruction set but at a minimum I'd need an emulator that supports all the x and w registers. Here is a very useful tool I've found but it only emulates a small subset of arm.\nhttps://github.com/Wunkolo/OakSim\nDoes anyone have any recommendations for an arm64 emulator that suits my needs? Thank you!\n",
    "votes": "1",
    "answers": 1,
    "views": "461",
    "tags": [
        "debugging",
        "emulation",
        "arm64"
    ],
    "user": "h0r53",
    "time": "Aug 23, 2022 at 13:59",
    "comments": [
        {
            "user": "Raymond W. Farris",
            "text": "The best one µVision IDE - Keil from Intel / ARM Inc The µVision IDE combines project management, run-time environment, build facilities, source code editing, and program debugging in a single powerful environment. µVision is easy-to-use and accelerates your embedded software development. µVision supports multiple screens and allows you to create individual window layouts anywhere on the visual surface. www2.keil.com/mdk5/uvision\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "visual2\nMaybe this? https://tomcl.github.io/visual2.github.io/\nGUIDE https://tomcl.github.io/visual2.github.io/guide.html#content\nSource https://github.com/ImperialCollegeLondon/Visual2\nRelated info: https://azeria-labs.com/arm-on-x86-qemu-user/\n",
            "votes": "1",
            "user": "fquinto",
            "time": "Aug 23, 2022 at 22:31",
            "is_accepted": false,
            "comments": [
                {
                    "user": "h0r53",
                    "text": "<span class=\"comment-copy\">This looks like a cool tool with a nice user interface for ARM emulation and debugging. However, it looks like it doesn't support ARM64 and it only supports a subset of ARM.</span>",
                    "time": null
                }
            ]
        }
    ]
}