{
    "title": "how to hide all export functions in a elf so library?",
    "link": "https://reverseengineering.stackexchange.com/questions/30855/how-to-hide-all-export-functions-in-a-elf-so-library",
    "content": "I have this game I want to patch, the game server executable loads a elf so library with functions. I want to add new functions into this library so I patched the game server executable with elfpatch and now it loads a duplicated of the elf library.\nwith the identical 2 libraries loaded the game is crashing on start, and I want to remove the export property of all the functions in the duplicated elf library so I can start the game with no errors.\nI duplicated because my intention is to rename some of the funcions with new names so the game server can use them. They are all game skills.\n",
    "votes": "1",
    "answers": 0,
    "views": "128",
    "tags": [
        "elf",
        "shared-object"
    ],
    "user": "Alvaro Hernandorena",
    "time": "Sep 6, 2022 at 4:13",
    "comments": [
        {
            "user": "Mega Tonnage",
            "text": "You might be better off adding a new library with your functions, the game could be verifying that the existing library hasn't been modified.\n",
            "time": null
        },
        {
            "user": "Alvaro Hernandorena",
            "text": "yeah the thing is I don't know how to write the functions for the game to acept them.\n",
            "time": null
        },
        {
            "user": "Alvaro Hernandorena",
            "text": "Have just made simple test, with hex, edited all ocurrences in the library of \"skill6412\" which exists to skill 9412 , just to test, now the game server says: ./gs: symbol lookup error: libskill.so : undefined simbol: _ZN4GNET16_stub_skill9412E. But searching in gs (game server) there is no 6412 there, so why that is giving that error if gs have no reference to 6412 or any other skill number...\n",
            "time": null
        },
        {
            "user": "Mega Tonnage",
            "text": "I'm not sure that hex editing library function names is going to work. Part of RE is working out what the high level code looks like.. so analyse the library functions then write your replacement functions with the same arguments and return values, etc.\n",
            "time": null
        },
        {
            "user": "Alvaro Hernandorena",
            "text": "long time since this question, I ended making the second shared library from scratch in c++ and it was the best route to take. I had to learn c++ but also learned that security in software is an ilussion lol.\n",
            "time": null
        }
    ],
    "answers_data": []
}