{
    "title": "Is there any way to get old Windows kernel drivers?",
    "link": "https://reverseengineering.stackexchange.com/questions/30903/is-there-any-way-to-get-old-windows-kernel-drivers",
    "content": "I'm working through \"Practical Reverse Engineering\" and absolutely loving it so far. However, some of the exercises involve \"decompiling\" some Windows kernel files (like KeInitializeDpc, KeInitializeApc, ObFastDereferenceObject, etc) and I don't run Windows.\nI haven't been able to find any of the drivers online nor have I found any reliable sites from which I can get a Windows (anything between XP and 7) iso. Is there anywhere that I could get either of these things?\n",
    "votes": "1",
    "answers": 0,
    "views": "68",
    "tags": [
        "windows",
        "kernel"
    ],
    "user": "superzero",
    "time": "Sep 20, 2022 at 15:31",
    "comments": [
        {
            "user": "Robert",
            "text": "In a lot of countries it is legal to \"unbundle\" MS software from the hardware it came with. If you live in such a country you can simply buy an old Windows version on eBay or else where they sell them for a few bucks.\n",
            "time": null
        },
        {
            "user": "dingo_kinznerhook",
            "text": "Obviously, this isn't a solution for everyone but with an MSDN/Visual Studio Professional subscription (?$500ish/year?) you can download isos for XP/Vista/7/8.1/10/11. Downloading from Microsoft and verifying the hash is the safest way to get those files. You might be able to get the \"Windows XP mode\" VM for free - it was a big marketing point when they released it.\n",
            "time": null
        },
        {
            "user": "Mega Tonnage",
            "text": "You can get 7/8.1/10 from here: developer.microsoft.com/en-us/microsoft-edge/tools/vms .. no account required\n",
            "time": null
        },
        {
            "user": "superzero",
            "text": "@MegaTonnage thanks so much!\n",
            "time": null
        }
    ],
    "answers_data": []
}