{
    "title": "How find all kernel functions called by a driver in windows 11",
    "link": "https://reverseengineering.stackexchange.com/questions/30980/how-find-all-kernel-functions-called-by-a-driver-in-windows-11",
    "content": "I am working on a highly obfuscated driver that is virtualized. In an attempt to work on this driver I asked a question about some python scripts which turned out not to be effective at all so I decided to delete that question and ask my question directly by explaining all the details so maybe I can find a better solution for my problem.\nDriver size is about <pre><code>3mb</code></pre> and it is packed and when it's loaded on memory it gets around <pre><code>6mb</code></pre> which shows how much garbage code is actually there, it used anti static analysis methods like jumping to different locations by register, calling <pre><code>API</code></pre> functions using <pre><code>push</code></pre> and <pre><code>ret</code></pre> instructions and getting <pre><code>API</code></pre> addresses using brute force and many more methods that I am not aware.\nNow when I am using <pre><code>windbg</code></pre> to analyze the driver I tried the <pre><code>ta</code></pre> instruction which was suggested in the previous question about python script, even 6 hours was not enough to get to that address. As a result I thought about the ideas below but I am not sure if they are working or if there is any open source tool for these ideas so I would really appreciate it if anyone can give me a solution to this problem.\n\nUsing <pre><code>DTrace</code></pre> is one of the ideas that I tried, the problem is, driver detecting both\ndebugger and my virtual machine so when I am using <pre><code>sc</code></pre> command to run the driver, its getting\nclosed immediately so I do not know how can I use <pre><code>DTrace</code></pre> since I am not familiar that much\nwith the tool.\n\nUsing or writing an <pre><code>IRP</code></pre> tracker so I can find out what functions get called when I am using <pre><code>sc</code></pre> command. I found out\nOSR has a tool for this purpose but sadly it is not working for windows 11 but maybe there\nis an open source tool for this idea.\n\n\nTldr; Working on a virtualized and heavily mutated driver with tons of fake calls that hide all import functions and getting addresses using brute forcing memory I need a way to find all those functions.\n",
    "votes": "3",
    "answers": 0,
    "views": "254",
    "tags": [
        "windows",
        "windbg",
        "obfuscation",
        "kernel-mode",
        "virtualizers"
    ],
    "user": "user19819208",
    "time": "Oct 10, 2022 at 15:01",
    "comments": [
        {
            "user": "Mega Tonnage",
            "text": "You might be better off working on the driver when it isn't loaded, maybe copy the binary to another system and analyse it statically so that you can disable the debugger detection. I say driver but this sounds like a rootkit or endpoint security product.\n",
            "time": null
        }
    ],
    "answers_data": []
}