{
    "title": "How to change the Equations in string format to normal equations in Python?",
    "link": "https://reverseengineering.stackexchange.com/questions/30986/how-to-change-the-equations-in-string-format-to-normal-equations-in-python",
    "content": "I have a set of equations in string format as given below. Need to assign some value to the left-hand side variable (In the below example: rsp, esp). Then have to calculate and store the results on the right-hand side variable (i.e., rax, esp, rsp).\nExample:\n<pre><code>rax = rsp</code></pre>\n<pre><code>esp = esp - 0x4</code></pre>\n<pre><code>rsp = rsp - 0x30</code></pre>\nThough I have used the <pre><code>eval</code></pre> function in python, it is throwing me an error message as it won't support <pre><code>=</code></pre>. Could someone please help me to find the answer?\n",
    "votes": "0",
    "answers": 1,
    "views": "69",
    "tags": [
        "python"
    ],
    "user": "okokok hack",
    "time": "Oct 17, 2022 at 17:25",
    "comments": [
        {
            "user": "Rolf Rolles",
            "text": "The answers to this question are not quick and easy. Time to read up on abstract syntax trees, parsers, and interpreters. I have a reading list on my website: msreverseengineering.com/program-analysis-reading-list You can expect to spend at least weeks studying these subjects before you feel comfortable doing what your question asks.\n",
            "time": null
        },
        {
            "user": "okokok hack",
            "text": "@RolfRolles, thank you for your comment. I have found the solution to the question which I posted. With the help of \"locals\" and \"globals\" in python programming, this can be solved\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "With the help of \"locals\" and \"globals\" in python programming, this can be solved\n",
            "votes": "0",
            "user": "okokok hack",
            "time": "Oct 14, 2022 at 6:21",
            "is_accepted": true,
            "comments": []
        }
    ]
}