{
    "title": "Malware application in Android",
    "link": "https://reverseengineering.stackexchange.com/questions/31050/malware-apk-in-android",
    "content": "Is there some website that give us the possibility to download malware APK in order to study it? I’m interested to study the abuse of android.permission.RECORD_AUDIO in Android 8.\n",
    "votes": "0",
    "answers": 1,
    "views": "139",
    "tags": [
        "android",
        "malware",
        "dynamic-analysis",
        "apk",
        "audio"
    ],
    "user": "Gregor",
    "time": "Oct 6, 2022 at 7:48",
    "comments": [
        {
            "user": "w s",
            "text": "bazaar.abuse.ch/browse.php?search=file_type%3Aapk\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Koodous has a huge collection of apks, searching in \"detected\" category may give you what you wanted.\nVirusShare is a general malware collection, requires registration, as far as I remember they have torrent tracker here and there are android-specific sample collection per year. I never tried to download something from there, but you can try.\nThere are some collections on github, for example here\nmalware bazaar - not too large collection, but better than nothing.\nPithus - requires registration via github, allows apk search by permission, allows download when logged in.\n\nKoodous requires to pay for access, most basic access that includes downloading costs around EUR 60 for month.\nGood luck.\n",
            "votes": "2",
            "user": "0xC0000022L",
            "time": "Nov 1, 2022 at 22:18",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Rohit Gupta",
                    "text": "<span class=\"comment-copy\">Why are you helping him? Do you want yet another malware released to the world?</span>",
                    "time": null
                },
                {
                    "user": "the_endian",
                    "text": "<span class=\"comment-copy\">@RohitGupta getting samples is how people learn to defeat malware... I used to be a malware researcher and I started this way, then worked at several anti-malware companies. Don't make assumptions, plus if that's his intent, he'll figure out a way to do it regardless... not every gun owner is a murderer. I'd be more worried if he was looking for Android 13.</span>",
                    "time": null
                }
            ]
        }
    ]
}