{
    "title": "Are there websites for reverse engineering challenges similar the programming challenges? [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/31079/are-there-websites-for-reverse-engineering-challenges-similar-the-programming-ch",
    "content": "This question already has answers here:\n                                \n                            \n\n\n\n\nCrack Me Material\n\n                                (3 answers)\n                            \n\nClosed 2 years ago.\n\n\n\nAs a developer, reverse engineering has always fascinated me. It amazes me to see what some people can figure out just from a dump of assembly code, and I would like to become better at doing the same.\nThere are many websites that specialize in helping developers become better at writing code and solving problems through small challenges. An example of what I mean are websites like LeetCode, Codewars, etc. What websites are available with challenges that are specific to reverse engineering?\n",
    "votes": "1",
    "answers": 1,
    "views": "480",
    "tags": [
        "decompilation"
    ],
    "user": "Entangled Superposition",
    "time": "2 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "The best way to learn is really 4 things:\n\nSearch up \"Crackme\" and \"reverseme\" on your favorite search engine\n\nGo to CTFTime.org, https://www.picoctf.org/ and similar sites, and work on the Reverse Engineering challenges there\n\nTry reverse engineering actual software you are interested in learning\n\nLearn about interaction between the operating system and the application you are reverse engineering interact. For example on Windows, learning the WinAPI would be useful, and on Linux the Linux programming interface. The reason is that you will know simply by a program's imported functions on those operating systems what it is likely doing in a broad sense. Like, if it imports networking and cryptography OS APIs, well, you can surmise what it might be doing, etc...\n\n\nYou could also look at YouTube videos. Other than that, it's basically trial and error, there aren't really many \"official courses\" on it tbh. AFAIK, there isn't an equivalent to something like leetcode or AlgoExpert aside from that I suggested.\n",
            "votes": "1",
            "user": "the_endian",
            "time": "Nov 5, 2022 at 7:48",
            "is_accepted": true,
            "comments": []
        }
    ]
}