{
    "title": "I am reverse engineering SkiFree, where is the code for the Abominable Snowman's movement?",
    "link": "https://reverseengineering.stackexchange.com/questions/31123/i-am-reverse-engineering-skifree-where-is-the-code-for-the-abominable-snowmans",
    "content": "I have been trying to reverse engineer the classic game SkiFree just to know how the Yeti moves but I found nothing.\nhttp://ski.ihoc.net/ski32.exe\nI used many tools but they do not show the encrypted code for it's movement.\n",
    "votes": "0",
    "answers": 1,
    "views": "243",
    "tags": [
        "game-hacking"
    ],
    "user": "Picaboo3",
    "time": "Nov 10, 2022 at 17:05",
    "comments": [],
    "answers_data": [
        {
            "content": "Is the source encrypted? I took a quick look and appeared disassembly worked ok. No function names (debug strings stripped) but we got 2 versions at-least I got my hands on, the older msdos/win3.11 version and a newer 32bit version. The last one seems to disassemble a bit more easily.\nHave you tried asking \"The Cheese\" himself? apparently he found the sourcecode he had a few years back and maybe if you ask him, he love to tell you the wonderfull story of the abominable snow monsters movements?\nAnother way might be to hook a debugger and step over code untill you spot the monster and see what functions gets called. or get caught and see what last functions where called. Im fairly sure both IDA and Ghidra support debugging this way. with pure code looking we dont get far, unless you find that message you get when caught. Maybe a function connects to that message or a draw function for the monster may lead you to the piece of code that calls for him to appear?\nThe cheese can be contacted here: https://www.ihoc.net/hola.html\nLater addition: Found some reddit post from someone gotten an answer wich includes some intresting monster facts:\n\nThere are four monsters, each guarding one side of an imaginary rectangle with boundaries at 2000m down, 125m up, 1000m left, and 1000m right. The slope \"wraps around\" from 2048 to -2048 in any direction. (There are 16 pixels to a meter, and object co- ordinates are kept in 16 bit signed integers which overflow from 32767 to -32678.)\n\nsource: In 2005 I emailed Chris Pirih, creator of SkiFree. He responded. Here is our exchange.\n",
            "votes": "3",
            "user": "CodeAsm",
            "time": "Nov 11, 2022 at 11:13",
            "is_accepted": false,
            "comments": []
        }
    ]
}