{
    "title": "Unusual datetime format",
    "link": "https://reverseengineering.stackexchange.com/questions/31188/unusual-datetime-format",
    "content": "I am looking at the registry keys created for three programs from a now defunct company, one of which is trial software. One entry of interest is the REG_BINARY key InstallTime. I have an idea of what the dates are supposed to be based on program install times. Actually, more curiously, it has different values under HKLM\\SOFTWARE\\WOW6432Node\nFirst line is under HKCU\\SOFTWARE, second is under HKLM\\SOFTWARE\\WOW6432Node\n11/30/16\nCBHome\n<pre><code>46 f2 f7 39 8d 4b d2 01\n46 f2 f7 39 8d 4b d2 01\n</code></pre>\n7/1/01\nCBPro\n<pre><code>85 53 c1 13 18 3a c1 01\n7d 49 8e f1 93 02 c1 01\n</code></pre>\n11/2/22\nCWViewer\n<pre><code>94 01 d7 b8 37 ef d8 01\n94 01 d7 b8 37 ef d8 01\n</code></pre>\nIt wasn't until I put this together that I realized that they match except for the second one. Not sure why.\n",
    "votes": "3",
    "answers": 1,
    "views": "222",
    "tags": [
        "binary"
    ],
    "user": "DoomTay",
    "time": "Nov 27, 2022 at 22:31",
    "comments": [],
    "answers_data": [
        {
            "content": "Interpreting the values as unsigned long 64 bit integers and comparing to your dates suggests that these are date/time stamps with 100ns resolution and with a  base around January 1601.\nThis would be consistent with the values returned by the windows function <pre><code>GetSystemTimePreciseAsFileTime</code></pre>. This returns a <pre><code>FILETIME</code></pre> structure containing the UTC date & time with a base date of 1 January 1601.\nTreating your values as <pre><code>FILETIME</code></pre>s and formatting appropriately (using <pre><code>SHFormatDateTime</code></pre>) gives the following values -\n<pre><code>01D24B8D39F74246 => 01 December 2016, 04:41:48\n\n01C13A1813C15385 => 10 September 2001, 17:46:02\n01C10293F18E497D => 02 July 2001, 02:11:37\n\n01D8EF37B8D70194 => 03 November 2022, 03:52:41\n</code></pre>\nThe dates are the day after you quoted. I'd surmise that this is because your dates are local time and that you are 5 or more hours behind UTC and installed the programs in the evening.\nIn your 2nd example which has 2 dates, perhaps one is an initial installation date and the other is some form of update date ?\n",
            "votes": "2",
            "user": "Ian Cook",
            "time": "Nov 27, 2022 at 21:26",
            "is_accepted": true,
            "comments": [
                {
                    "user": "DoomTay",
                    "text": "<span class=\"comment-copy\">\"The dates are the day after you quoted. I'd surmise that this is because your dates are local time and that you are 5 or more hours behind UTC and installed the programs in the evening\". Sounds about right. I live in EST timezone  How did you find this out? Did you guess a unit and subtract the number from the given dates?</span>",
                    "time": null
                },
                {
                    "user": "Ian Cook",
                    "text": "<span class=\"comment-copy\">The first one was installed at 0441 on 1 December.  You need at least a 5 hour offset behind UTC to match the date you gave of 30 November (5 hours would be 2341 on 30 November local time.) Your use of American date formatting in the question supported my conclusion.</span>",
                    "time": null
                },
                {
                    "user": "DoomTay",
                    "text": "<span class=\"comment-copy\">The second one is the trial software in question. Funny thing is, it has a hard-coded expiration date of Sept 30, 2001, a whopping 20 days after that first date in its registry keys. Also, the first date key for this one stayed the same when I uninstalled the software and reinstalled on a later date</span>",
                    "time": null
                }
            ]
        }
    ]
}