{
    "title": "Is it possible to work with 'marked positions' in IDA from idapython, and if so, how?",
    "link": "https://reverseengineering.stackexchange.com/questions/31255/is-it-possible-to-work-with-marked-positions-in-ida-from-idapython-and-if-so",
    "content": "I'm working on an IDA script in which I'd like to iterate through addresses that have been marked (with Alt-M).\nLooking at the idapython documentation, it looks like maybe I can do this via the <pre><code>bookmark_t</code></pre> proxy class and related functions, but it's not clear to me how to make this work.  For example:\n<pre><code>def find_index(*args) ‑> uint32\n    find_index(e, ud) -> uint32\n    e: lochist_entry_t const &\n    ud: void *\n</code></pre>\n<pre><code>e</code></pre> is obviously a lochist_entry_t, but I can't tell from the context what <pre><code>ud</code></pre> is supposed to represent, or how I would pass it as a void pointer to the call.  (For giggles, I tried to pass <pre><code>None</code></pre> in place of a NULL pointer, and it actually crashed ida.  Oops.)\nI've searched the web for examples of using this api, but haven't found anything helpful.\nIs what I'm trying to do possible? If so, can someone please provide a working example, or a reference/doc/blogpost somewhere that I missed, or even just a nudge the right direction?\nThanks in advance.\nEdit:\nDigging through more idapython documentation (in unrelated areas) leads me to believe that <pre><code>ud</code></pre> is user-defined context data, but it's not yet clear how to create this (since passing NULL/None seems to be a no-go) or pass it to the functions.\nEdit 2:\nFurther research has led me to trying to use <pre><code>ctypes</code></pre> to create pointers to various data types, but even when using <pre><code>c_void_p</code></pre> to create a void pointer, I'm still getting a <pre><code>TypeError</code></pre> for the <pre><code>void*</code></pre> argument.\nI also found some mention of using SWIG's <pre><code>cdata</code></pre> and similar functions, which would seem to make sense, since it appears idapython uses SWIG.  However, I can't seem to figure out what/how to import to get access to that in python.   Looking at various docs leads me to believe that those functions would be exposed via the SWIG interface definitions, and a quick look through the idapython SWIG interface definitions and the IDA SDK doesn't reveal anything I can actually import to give me access to those SWIG functions.\nEdit 3:\nI did manage to find <pre><code>uchar_array(size_t)</code></pre> which returns a character array pointer, so I tried to pass that to <pre><code>bookmark_t_size(e, ud)</code></pre> and again IDA crashed.  So at this point, I'm not sure what to try next.\n",
    "votes": "3",
    "answers": 1,
    "views": "119",
    "tags": [
        "ida",
        "idapython"
    ],
    "user": "Bill B",
    "time": "Dec 10, 2022 at 21:44",
    "comments": [],
    "answers_data": [
        {
            "content": "To clarify, location history and marked positions are two different things...but it's not surprising that you wandered into that API and got stuck since that's the SWIG wrapper around the SDK itself and is hence not too user-friendly.\nHowever, there's <pre><code>get_mark_comment</code></pre> and <pre><code>get_marked_pos</code></pre> over at https://www.hex-rays.com/products/ida/support/idapython_docs/ida_idc.html which is much easier and straightforward to use. Your mark limit is <pre><code>MAX_MARK_SLOT</code></pre>, so you can use this with those idc functions to iterate through all of the possible marks in the database.\n",
            "votes": "1",
            "user": "Ali Rizvi-Santiago",
            "time": "Feb 8, 2023 at 0:40",
            "is_accepted": false,
            "comments": []
        }
    ]
}