{
    "title": "When reverse engineering a piece of electronics that uses a \"chip on board\", what are some good resources for finding out what the chip is?",
    "link": "https://reverseengineering.stackexchange.com/questions/31488/when-reverse-engineering-a-piece-of-electronics-that-uses-a-chip-on-board-wha",
    "content": "Example: I have an old digital organizer, a Royal DS 2260.\nI want to find out what SoC it uses. Numbers marked on the PCB are just repeats of the model number or don't lead to anything, and I don't want to decap the IC as that would be destructive (and there might not even be any useful markings on the silicon anyway).\nAre there any good resources I'm missing? I know of all the datasheets, but sometimes that doesn't help.\nIdeally, I could use some of the \"clues\" I picked up by taking the thing apart: An SOC that has an RTC, raw LCD controller, external SRAM bus, etc.\nThe problem is that I have no idea of the state of embedded controllers for LCD electronics from the 90s to the early 2000s.\n",
    "votes": "3",
    "answers": 1,
    "views": "120",
    "tags": [
        "embedded"
    ],
    "user": "qwerty keyboard",
    "time": "Feb 14, 2023 at 14:30",
    "comments": [
        {
            "user": "Rohit Gupta",
            "text": "You could post some photos\n",
            "time": null
        },
        {
            "user": "qwerty keyboard",
            "text": "Yeah, but that would be specific to THAT device. I want some good resources to refer to when reverse engineering almost any chip on board.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "To identify the System-on-a-Chip (SoC) used in the Royal DS 2260 digital organizer, you can start by examining the device's printed circuit board (PCB) for any markings or labels that could indicate the manufacturer or model of the SoC. If no markings are present, you can also try cross-referencing the specifications and features of the device, such as an RTC, raw LCD controller, and external SRAM bus, with known SoCs of the time period.\nIf this information is not available on the PCB, you can try using various online resources such as datasheet databases, forums, and forums focused on reverse engineering and vintage electronics. You can also try reaching out to communities dedicated to vintage digital organizers or other relevant fields to see if they have any information on the Royal DS 2260.\nIn some cases, RE'ing the firmware or software of the device can also provide information about the SoC used, such as the processor architecture or peripheral interfaces. However, this can be a more advanced and time-consuming approach, and may require specialized knowledge and tools.\nI would recommend the following steps to identify the SOC used in your Royal DS 2260 digital organizer:\n\nUtilize online resources, such as forums and websites dedicated to vintage electronics, to gather information about similar devices. You may find information on the SOC used in similar devices or information that would lead you to the manufacturer.\n\nSearch for datasheets and documentation related to the device's components. While datasheets for the SOC itself may not be available, datasheets for other components, such as the LCD controller, may include information about the SOC's capabilities and features.\n\nConsider analyzing the firmware or software running on the device. This may reveal information about the SOC, such as the manufacturer or the architecture used. You may need to disassemble the firmware to obtain this information.\n\nUse the \"clues\" gathered from disassembling the device, such as the presence of an RTC and external SRAM bus, to narrow down the potential options. Cross-reference this information with the data found from your research to identify the SOC used.\n\n\n\nyou can use the following resources:\n\nOnline forums and communities dedicated to vintage electronics or digital organizers: Retro Computing, Vintage Computer Forums, and Old-Computers.com.\n\nDatasheet databases: Datasheets.com, Alldatasheet.com, and DatasheetArchive.com.\n\nReverse engineering and firmware analysis resources: REWiki, Firmware.Re, and Gitorious.org.\n",
            "votes": "2",
            "user": "0xC0000022L",
            "time": "Feb 5, 2023 at 16:26",
            "is_accepted": false,
            "comments": [
                {
                    "user": "qwerty keyboard",
                    "text": "<span class=\"comment-copy\">This is excellent, thank you!</span>",
                    "time": null
                },
                {
                    "user": "r0xdeadbeef",
                    "text": "<span class=\"comment-copy\">it's my pleasure!</span>",
                    "time": null
                }
            ]
        }
    ]
}