{
    "title": "I am having problems while modifying router firmware and uploading it",
    "link": "https://reverseengineering.stackexchange.com/questions/31496/i-am-having-problems-while-modifying-router-firmware-and-uploading-it",
    "content": "So, I have an Edimax BR-6208ac V2 router and I would like to modify the firmware to enable telnet on it. However, when I repack the firmware and upload it I get an error of it being the wrong file type. I know my repacking code works as when I didn't unsquash then squash the squashfs filesystem then packed it and uploaded it, it updated properly. But if I don't unsquash it I can't modify it.\nMy current theory is that it is because of the md5 checksum as it has a different md5 sum after doing that. I have tried recreating the uImage header with mkimage, I don't know how to recreate the csys header. When recreating the uImage header my firmware binary ends up with the uImage header before the csys header, it is the opposite way around in the original firmware.\nThe original firmware has a CSYS Header, a uImage header, LZMA compressed data and then the squashfs filesystem.\nCould someone give suggestions on how to get it working properly?\n",
    "votes": "4",
    "answers": 1,
    "views": "147",
    "tags": [
        "firmware"
    ],
    "user": "0x12B90A1",
    "time": "Mar 1, 2023 at 2:32",
    "comments": [],
    "answers_data": [
        {
            "content": "If you search for Edimax csys header you find several older posts from OpenWrt and similar forums where people have reverse engineered the header.\nOpenWrt has a tool (called edimax-header) to create the header. So maybe give that a try.\nhttps://forum.archive.openwrt.org/viewtopic.php?id=67192\nhttps://github.com/openwrt/openwrt/blob/6f6d24a00ad43d82a52580d2610a1fd90cedd60a/target/linux/ramips/image/mt7620.mk\nThe exact command depends on the router model and your model is not (yet) listed.\nSo maybe you still need some additional customization.\n",
            "votes": "1",
            "user": "secfren",
            "time": "Mar 1, 2023 at 14:39",
            "is_accepted": false,
            "comments": []
        }
    ]
}