{
    "title": "Windows kernel debugging using IDA & WinDbg",
    "link": "https://reverseengineering.stackexchange.com/questions/31542/windows-kernel-debugging-using-ida-windbg",
    "content": "I am currently trying to set up WinDbg with IDA 7.7 to perform kernel debugging. My host machine is Windows 11 22H2 64-bit, the target is a Windows 10 22H2 64-bit VM (VMware). Connection method is KDNET.\nI have mostly followed this guide: https://thecyberdung.blogspot.com/2018/10/kernel-debugging-with-windbg-and-idapro.html\nI've noted that a lot of stuff isn't working properly:\n\n<pre><code>net:port=<port number>,key=<enter_key_here></code></pre> works, but when appending <pre><code>,remote</code></pre>, IDA responds with \"invalid connection string\". That should work, though, according to IDA docs, if you choose \"Kernel mode debugging with reconnect and initial break\" in the debugger options. Choosing \"Kernel mode debugging\" and leaving the original connection string works fine.\n\nAfter attaching and browsing modules, IDA does not correctly recognize some functions as code. If I force to interpret as code (pressing C) or manually define the function using \"P\", it messes up the whole control flow graph (every instruction becomes a basic block).\n\nDecompilation does not work for some functions: either not able to convert to microcode or \"stackframe is too big\". It works fine when loading the module statically from disk.\n\nThe stack and memory dump windows only show \"FFFFFFFFFFFFFFFFh\" and I'm not able to synchronize them with any register (say RSP). Manual \"go to address\" does not work either. Locals window is always empty, no matter what function I currently breaked in. However, the general registers window shows the correct values consistently.\n\nStepping over a single instruction takes about ~6 seconds.\n\n\nDid anyone encounter similar problems before?\n",
    "votes": "2",
    "answers": 0,
    "views": "721",
    "tags": [
        "ida",
        "windbg",
        "kernel-mode"
    ],
    "user": "millionmilesaway",
    "time": "Feb 14, 2023 at 2:01",
    "comments": [],
    "answers_data": []
}