{
    "title": "How do I reverse engineer a file uploading api?",
    "link": "https://reverseengineering.stackexchange.com/questions/31563/how-do-i-reverse-engineer-a-file-uploading-api",
    "content": "The API is pretty old and is written in C#, I tried debugging the API calls with mitmproxy.\nThis is the successful API call (manually uploading file)\nbut when I tried curling it, it gave me this error which is apparently a common error from the C# language (that's how I'm able to know that the API is written in C#) \"Sequence contains no element\" im not sure but i think it's got something to do with SQL\n\nI also tried insomnia and postman but it came to the same ending\n\nso what is it that I can do to reverse engineer this file uploading API? It'd be perfect if you could briefly explain it so that I may understand and do better for the next API reverse engineering that I might do THANK YOU!!!!\nsources: https://products.aspose.app/video/compress\nplease ask for more sources, I don't know what screenshot is necessary for me to put here.\n",
    "votes": "1",
    "answers": 0,
    "views": "105",
    "tags": [
        "file-format",
        "c#",
        "binary-format",
        "api",
        "mssql"
    ],
    "user": "bd023",
    "time": "Feb 19, 2023 at 8:33",
    "comments": [
        {
            "user": "bd023",
            "text": "please do point out if there are any mistakes that I did so that I may correct them for my future questions.\n",
            "time": null
        },
        {
            "user": "Rup",
            "text": "This is .NET LINQ, yes, which can be used for SQL but almost certainly isn't here. You're giving the API an empty list when it's not expecting one, or e.g. it's generating an empty list from the data you've POSTed because you've left something out. Could that be the actual file upload? I don't know the tool, but it looks like you're actually posting a file upload in the first one but sending no data for the other two.\n",
            "time": null
        },
        {
            "user": "bd023",
            "text": "I found out I did actually miss something out, apparently I didn't pay enough attention to the successful call (manual), I've fixed it, but I don't know how to close this post.\n",
            "time": null
        }
    ],
    "answers_data": []
}