{
    "title": "Flashed \"compatible\" firmware onto two generic Allwinner A50 tablets",
    "link": "https://reverseengineering.stackexchange.com/questions/31578/flashed-compatible-firmware-onto-two-generic-allwinner-a50-tablets",
    "content": "I'm already at least 3 days on this and can't find a way out. I'm still unsure if it fits here, but here we go!\nI have 3 A50 Allwinner tablets (HOW HT-705XT) that I wanted to root. Since the only way was patching a <pre><code>boot.img</code></pre> obtained from the web, I found one that someone suggested that was apparently \"compatible\" with this tablet, with minor issues, so I did.\nI flashed the firmware using PhoenixSuit with the checkbox \"multiple\" partitions disabled and it in fact flashed the whole system. It booted with another logo, into another Android version and even Magisk was patched, meaning that the bootloader was flashed too.\nOn the second tablet I wanted to preserve the original ROM, so I did all of it again but selected \"multiple partitions\" and checked only \"BOOTLOADER\" and \"BOOT\".\n\nTo my surprise, the tablet restarted with the screen completely gray-ish, as if the resolution or sync were mismatched.\nI flashed the firmware again using the default option, which doesn't use the \"multiple partitions\" checkmark, like I did on tablet 1, but it restarted with a gray screen again. At this point I knew I messed up.\nStrange thing is: The tablet with the bricked screen is still starting up. It reacts to button presses and luminosity changes. It is probably booted up, I just can't see it.\nAt this point I have:\n\nA working, rooted tablet\nA screen with a bricked screen\nA new, unmodified, tablet\n\nI can't simply restore the original firmware, since it is not available on the internet. The only one available is this \"compatible\" firmware. Both are for the A50 chip, and one worked, so...\nI tried to backup all partitions using the rooted tablet using <pre><code>dd if=/dev/block/by-name/boot of=/sdcard/boot.img</code></pre> and all others, shown below:\n<pre><code>ML-SO06-M7sLite:/dev/block/by-name # ls\nUDISK bootloader dto   env media_data misc    recovery vendor\nboot  cache      empty frp metadata   private system\n</code></pre>\nI repacked boot and bootloader into the extracted firmware on my PC and repacked it using imgRePacker. After that I tried to flash it, but it still didn't fix the screen.\nAt this point I was convinced that the file <pre><code>sys_config.fex</code></pre> or <pre><code>config.fex</code></pre> contain an invalid lcd_driver entry and therefore it doesn't work, shown below:\n<pre><code>[lcd0]\nlcd_used            = 1\n\nlcd_driver_name     = \"fx070\"\nlcd_if              = 0\nlcd_x               = 1024\nlcd_y               = 600\n</code></pre>\nThe problem is that I cannot find those files, for comparison, on the running system. Furthermore, the <pre><code>config.fex</code></pre> appears to be a binary representation of the first file, which (afaik) must also be changed, and I wouldn't even know how. I tried reading /dev/block and grepping \"lcd\", but at certain blocks the  device simply rebooted.\nI shut the device down and tried to enter FEL mode and built the <pre><code>sunxi-tools</code></pre> binaries to attempt and read the whole NAND, which also didn't succeed. FEL gives read errors at certain adressess and I don't know which ones to skip, since I don't have a partition reference. I tried to enter FES mode but also failed due to missing pointers.\nThe goal here is just to trying to fix the screen, and, at this point any clue to what is going wrong is greatly appreciated. All info above is greatly shortened to avoid a page-long question, but I think most of the important informations were given. If something is missing, just let me know.\nAnd yes, at this point all my links on Google are already purple (and my head, too)\n",
    "votes": "3",
    "answers": 0,
    "views": "586",
    "tags": [
        "android"
    ],
    "user": "Fusseldieb",
    "time": "Feb 23, 2023 at 19:59",
    "comments": [
        {
            "user": "Fusseldieb",
            "text": "Update after 6mo: I wasn't able to unbrick it, so I just gave it into warranty and they \"miraculously\" fixed it. Yea, having the original image probably helps, which I don't have. Don't buy from sellers who don't give you the original ROM image. Lesson.\n",
            "time": null
        },
        {
            "user": "Corky",
            "text": "good read, and good advice. I'll never buy a brand that doesn't offer their firmware or root capabilities for that matter. I still wish I knew which files you found, I need something for my a50\n",
            "time": null
        }
    ],
    "answers_data": []
}