{
    "title": "Reverse engineer DPC Latency Checker tool to fix high Windows kernel timer latency",
    "link": "https://reverseengineering.stackexchange.com/questions/31622/reverse-engineer-dpc-latency-checker-tool-to-fix-high-windows-kernel-timer-laten",
    "content": "I need help with something very Windows/kernel-specific.\nI'm working on a fix for the high Kernel Timer Latency in Windows 10 2004 and higher. This problem was introduced between Insider Build 18950 and 18970.1001.\nYou can test this with a software called LatencyMon. Just make sure to go into the setting and switch to \"kernel timer latency\". If you are on Windows 10 2004 or higher, you will notice that your latency is constantly around 12000 microseconds. Before it used to be at around 1000 microseconds, sometimes even lower, sometimes a bit higher (depending on the system).\nMany people are affected by this (gamers, music creators), as this is ruining Windows real-time performance. The problem is absolutely unrelated to any kind of different hardware or additional software than Windows itself, it also can't be fixed with timer resolution or bcdedit changes of all kind! Processes in user space are probably not directly affected by that (as the kernel doesn't run on all processes at once afaik). Only when a process needs real-time access to something through the kernel (Audio Hardware), this gets problematic.\nNow the phenomenon I need help with:\nOnly if the software DPC Latency Checker is opened, the Kernel Timer Latency goes down to somewhat normal. When the software gets closed, the Kernel Timer Latency goes up to constantly 12000 microseconds again.\nTo further investigate this problem, I need to reverse engineer what DPC Latency Checker is doing, to make the Kernel Timer Latency go down. I tried finding something with x64dbg, Procmon and Process Explorer, but honestly, I never got into deep reverse engineering, especially kernel related stuff.\nAs this is easy, quick and freely reproducable in every modern Windows version (don't forget to switch to Kernel Timer Latency in LatencyMon settings ;D), maybe someone wants to help me to fix this problem once and for all.\n",
    "votes": "4",
    "answers": 1,
    "views": "758",
    "tags": [
        "windows",
        "kernel-mode"
    ],
    "user": "SilverLPs",
    "time": "May 4, 2023 at 11:57",
    "comments": [],
    "answers_data": [
        {
            "content": "this programm use ExSetTimerResolution\nhttps://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/wdm/nf-wdm-exsettimerresolution\nbut only from driver.\nim make it but it unsigned.\nanyway we need to find C++ without driver timercall, because this method is very old and maybe not accurate\n",
            "votes": "1",
            "user": "Slender MID",
            "time": "May 25, 2023 at 6:42",
            "is_accepted": false,
            "comments": []
        }
    ]
}