{
    "title": "What are the prerequisite knowledge needed to start solving crackmes?",
    "link": "https://reverseengineering.stackexchange.com/questions/31638/what-are-the-prerequisite-knowledge-needed-to-start-solving-crackmes",
    "content": "I started by reading a book on C language and then moved on to \"Programming From Ground Up,\" which teaches basic programming in x86.\nSchool just ended, I'm working on cracking a game called PwnAdventure Sourcery, which has been tough. I had to look up solutions and found that some involved buffer overflow and bruteforcing algorithms. It took me around 30 minutes to finally look up for a solution, and I feel like I'm so stupid :(\nIf possible, can you give a rough roadmap for reverse engineering along with some great resources?\n",
    "votes": "2",
    "answers": 1,
    "views": "270",
    "tags": [
        "disassembly",
        "assembly",
        "debugging",
        "crackme",
        "game-hacking"
    ],
    "user": "buffednerdkid",
    "time": "Mar 7, 2023 at 3:56",
    "comments": [],
    "answers_data": [
        {
            "content": "There are innumerable paths... but for some getting started material:\n\nhttps://p.ost2.fyi/ :: Open Security Training 2, Xeno has rebooted the project and has tons of great, free, in-depth courses.\nhttps://beginners.re/ :: Denis Yurichevs on-line book (or PDF)\nhttps://github.com/crackmes/crackmes :: a crackmes.de mirror, start at level 1, some are very easy but the variety of compilers makes it a good way to build up your tool set\nhttp://www.binary-auditing.com/ :: The Binary Auditor course teaches binary analysis and some C at the same time\n\nThere is literally tons of material available, some holds it's own over the years and some doesn't... but this list is some that I remember being very accessible, enjoy the journey!\n",
            "votes": "0",
            "user": "Mega Tonnage",
            "time": "Mar 7, 2023 at 12:27",
            "is_accepted": true,
            "comments": []
        }
    ]
}