{
    "title": "RE internship possibilities",
    "link": "https://reverseengineering.stackexchange.com/questions/31669/re-internship-possibilities",
    "content": "I am currently studying computer science and I have to do a mandatory internship (6 months) soon. I am really enjoying re and I would love to get an internship in that area. My problem is that the number of re internship jobs I found on various job search engines is extremely limited to quite non existing.\nDo you have any ideas where I could look for jobs instead? I am living in germany but I also wouldnt mind to move to a nearby country.\nThank you very much!\n",
    "votes": "1",
    "answers": 0,
    "views": "82",
    "tags": [
        "idc"
    ],
    "user": "Paranoia",
    "time": "Mar 13, 2023 at 18:45",
    "comments": [
        {
            "user": "WhatsUp",
            "text": "There are very few legitimate reasons for a normal company to do any sort of reverse engineering. Analyzing virus/malwares is probably the main one. So maybe you can try browsing the homepages of some companies that sell antivirus products/services to see if they provide such jobs, or even contact them directly.\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "@WhatsUp verifying the security of a product is also a legitimate or better legal reason at least in the EU or Germany. Otherwise you would have to trust everything a manufacturer says without a chance to verify it. Also verifying security of products e.g. software is much easier than reversing malware.\n",
            "time": null
        },
        {
            "user": "joxeankoret",
            "text": "Please disregard what @WhatsUp said, there are a myriad of legitimate reasons for companies to do reverse engineering, like these ones: reverseengineering.stackexchange.com/questions/6455/…\n",
            "time": null
        },
        {
            "user": "WhatsUp",
            "text": "@joxeankoret Well, you can post an answer to this question if you are so confident about the information you gave.\n",
            "time": null
        }
    ],
    "answers_data": []
}