{
    "title": "What is the ELF .got section used for?",
    "link": "https://reverseengineering.stackexchange.com/questions/31717/what-is-the-elf-got-section-used-for",
    "content": "I'm trying to learn how GOT/PLT works in ELF binaries. The way I see it - there's three sections; <pre><code>.got</code></pre>, <pre><code>.plt</code></pre> and <pre><code>.got.plt</code></pre>.\nWhen the program tries to call an imported function which is lazy binded, it does so by calling the plt procedure. In case the entry has not yet been resolved, the jump in the plt section jumps to the address pointed by in the <pre><code>.got.plt</code></pre> section, which points back to the <pre><code>.plt</code></pre> section, where arguments are set up for the dlresolve (an index to the JMPREL, among other things, if I'm understanding correctly). The <pre><code>.plt</code></pre> then resolves the address of the function and calls it with the provided arguments. In the next call, when the function has already been resolved, the <pre><code>.plt</code></pre> section jumps again to the address pointed to by the <pre><code>.got.plt</code></pre> section, which now contains the resolved address of the function (so that it doesn't jump back to the <pre><code>.plt</code></pre> section).\nIt seems that in both cases only the <pre><code>.plt</code></pre> and <pre><code>.got.plt</code></pre> sections are involved, so I'm struggling to understand what's the purpose of the <pre><code>.got</code></pre> section. I read somewhere that it contains the global variables, but that seem to reside in the <pre><code>.data</code></pre> section, so I don't think that's really it.\nThanks!\n",
    "votes": "3",
    "answers": 1,
    "views": "461",
    "tags": [
        "elf",
        "plt",
        "got"
    ],
    "user": "synack",
    "time": "Mar 27, 2023 at 1:24",
    "comments": [
        {
            "user": "hairlessbear",
            "text": "Does this answer your question? What is PLT/GOT?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "<pre><code>.got.plt</code></pre> contains the addresses of the external functions used by the program. Previously that task was fulfilled by the common <pre><code>.got</code></pre> section, but nowadays it  got split, so <pre><code>.got</code></pre> contains only pointers to the external data symbols (if any).\n",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Jul 14, 2023 at 22:55",
            "is_accepted": false,
            "comments": []
        }
    ]
}