{
    "title": "How do i set these tricky boolean values to true in Smali-Dalvik?",
    "link": "https://reverseengineering.stackexchange.com/questions/31754/how-do-i-set-these-tricky-boolean-values-to-true-in-smali-dalvik",
    "content": "These would allow me to make the input text field clickable and editable but the thing is how to do this.\nInstance field\n<pre><code>.field private g:Z\n</code></pre>\n1 -\n<pre><code> invoke-virtual {p1, p2, v0}, Landroid/content/res/TypedArray;->getBoolean(IZ)Z\n\nmove-result p2\n\ninvoke-virtual {p0, p2}, Lcom/google/android/material/textfield/TextInputEditText;->setTextInputLayoutFocusedRectEnabled(Z)V\n</code></pre>\n2 - Which call this one:\n<pre><code>.method public setTextInputLayoutFocusedRectEnabled(Z)V\n.locals 0\n\niput-boolean p1, p0, Lcom/google/android/material/textfield/TextInputEditText;->g:Z\n\nreturn-void\n</code></pre>\n.end method\n",
    "votes": "3",
    "answers": 1,
    "views": "393",
    "tags": [
        "android",
        "dalvik"
    ],
    "user": "user43636",
    "time": "Apr 5, 2023 at 7:03",
    "comments": [
        {
            "user": "Robert",
            "text": "That depends on the way how the developer of the app prevents editing of the field. Therefore I would first start by checking stackoverflow.com how to make a field non-editable (you may end up e.g. here: stackoverflow.com/q/4297763/150978). Then check the app code if it uses this way of making the field non-editable and thus you know what to change. BTW: There was a very similar question yesterday: reverseengineering.stackexchange.com/q/31748/1848 If it wa screated by you please don't create a new account every day...\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "BTW: The description of <pre><code>setTextInputLayoutFocusedRectEnabled</code></pre> sounds more like an \"style option\" without an effect of the ability to focus a field or not. It is just if there is a rectangle drawn if the field is focused.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I don't really think that's the correct section that decides if element is clickable or not. But since you're confident here, I'll assume it as correct for now.\nAfter line\nmove-result p2\nWrite this:\nconst/4 p2, 0x1\nTry it out. Replace it with 0x0 & try again.\nIf it doesn't work, then wrong point.\n\nTo actually find out source of a button, I'll recommend using some frida script to log clicks & the calls that click event triggered, or use SimpleHook LSPosed Module, as it has that hook inbuilt.\nIf it isn't clickable, or if you want to dig statically, then:\nI'll recommend to use \"Developer Assistant\" from play store, & find out the button ID.\nIf they're obfuscated for some reason, then search for the button text string on res/ and note down the ID of that instead.\nAfter that, you're suppose to look for id's address. Search for it in res/value/public.xml and note down the address which should be in format of 0x7fxxxxxx . Find the address on smali code & the class that calls for it, those should be the class that initializes the button, and from there you should be digging the code.\nYou must call that button resource to make it clickable/unclickable, for example look for setEnabled call around it.\n\nReference, try compiling the code with ProGuard obfuscation is turned off and analyze the smali code:-\nhttps://www.geeksforgeeks.org/how-to-enable-disable-button-in-android/\n",
            "votes": "0",
            "user": "Vansh Santoshi",
            "time": "Jul 22, 2024 at 14:08",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Vansh Santoshi",
                    "text": "<span class=\"comment-copy\">App link : <a href=\"https://play.google.com/store/apps/details?id=com.appsisle.developerassistant\" rel=\"nofollow noreferrer\">play.google.com/store/apps/…</a></span>",
                    "time": null
                }
            ]
        }
    ]
}