{
    "title": "Where is the XOR operation?",
    "link": "https://reverseengineering.stackexchange.com/questions/31820/where-is-the-xor-operation",
    "content": "I am doing TryHackMe REloaded room, level 3.\nWhen I got stuck I followed this tutorial which mentions an XOR by 7 operation being performed on a string, however I cannot see it anywhere.\nWhere is it happening in the below image from IDA Free?\n\nThe call highlighted in yellow above:\n",
    "votes": "1",
    "answers": 1,
    "views": "243",
    "tags": [
        "ida",
        "assembly",
        "breakpoint",
        "crackme",
        "xor"
    ],
    "user": "securityauditor",
    "time": "Apr 24, 2023 at 17:26",
    "comments": [
        {
            "user": "Jester",
            "text": "Maybe they are using a different version of the program. Couldn't find a link in that tutorial to the files. Or in your question.\n",
            "time": null
        },
        {
            "user": "securityauditor",
            "text": "Turns out I was looking at the wrong function.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "@securityauditor if you were looking at the wrong function, you could correct your question or even close/delete it. Although -- as you can see -- time was already invested in answering your question. If the answer is acceptable to you as is (despite having looked at the wrong function etc.), please also ensure to accept it by using ✔️ icon below the vote count indicator. Thank you.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Please read the tutorial carefully.\nMoreover, the pictures you provided don't say anything. As correctly noted in the comments -- without the file itself being investigated -- we have no way to help you.\nHere's another picture for you\n\n\nGist: TryHackMe - REloaded (Writeup by Isira Adithya)\nLink to the Room\n",
            "votes": "0",
            "user": "0xC0000022L",
            "time": "Apr 27, 2023 at 19:48",
            "is_accepted": true,
            "comments": []
        }
    ]
}