{
    "title": "How can I extract the password from an installer/self-extracting archive?",
    "link": "https://reverseengineering.stackexchange.com/questions/31982/how-can-i-extract-the-password-from-an-installer-self-extracting-archive",
    "content": "I have an installer/self-extracting archive. The executable file has an embedded ZIP archive into it (like many other installers). The ZIP archive is encrypted with a password.\nThe installer DOES NOT ask for a password in order to install, it just proceeds with the installation. The installer has an embedded encrypted archive in it, but if started by double-clicking the installer, no password is requested from the user.\nUpon trying to \"open\" it with 7-Zip as an archive, bypassing the executable part of the file and just trying to open the ZIP archive part, it asks for a password. This question is NOT about bypassing or cracking the encryption, but about finding out an already available password/encryption key. Since the password/encryption key is embedded inside the executable, this encryption serves the purpose of obfuscation for the archived files and not for actual confidentiality.\nHow can I find that password? Since the installer is local and doesn't need an internet connection, the password must be in the .exe file and somehow passed as an argument to the ZIP decryption module.\nHere are some similar examples of self-extracting without the user having to input the password themselves; my goal is to extract that password:\n\nArchive Sidestepping: Self-Unlocking Password-Protected RAR\nAttackers switch to self-extracting password-protected archives to distribute email malware\n\nFor reference and continuity:\n\nHow can I extract the password from an installer/self-extracting archive?: Deleted\n\nHow can I extract the password from an installer/self-extracting archive? [closed]: Closed\n",
    "votes": "1",
    "answers": 1,
    "views": "799",
    "tags": [
        "windows",
        "encryption",
        "deobfuscation"
    ],
    "user": "ARGYROU MINAS",
    "time": "Jun 24, 2023 at 5:05",
    "comments": [
        {
            "user": "ARGYROU MINAS",
            "text": "Here are some similar examples of self-extracting without the user having to input the password themselves; my goal is to extract that password: Archive Sidestepping: Self-Unlocking Password-Protected RAR, Attackers switch to self-extracting password-protected archives to distribute email malware\n",
            "time": null
        },
        {
            "user": "ARGYROU MINAS",
            "text": "For reference and continuity:   How can I extract the password from an installer/self-extracting archive?: Deleted  How can I extract the password from an installer/self-extracting archive?: Closed\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "Before trying some of the advanced approaches like decompiling the installer or loading into a tool like IDA would be to use a ZIP password cracker and feed the output of <pre><code>strings</code></pre> on the installer to it. As the ZIP payload is encrypted you should more or less only get strings from the installer section.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Well, you need to analyze the installer for the password. This usually involves decompiling. Static analysis is a good place to start. You may find the password stored as a string in the installer or the logic of the password through static analysis. Otherwise, you will need to perform dynamic analysis and try to capture the password by debugging specific regions of memory as the installer operates as the installer passes the password to the encrypted file.\nThis is a very general answer because you provided no context to the type of installer you are working with.\n",
            "votes": "3",
            "user": "Nick",
            "time": "Jun 18, 2023 at 18:14",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ARGYROU MINAS",
                    "text": "<span class=\"comment-copy\">The installer was created with NSIS. Can you suggest some tools for the decompilation, static and dynamic analyses, etc.?</span>",
                    "time": null
                }
            ]
        }
    ]
}