{
    "title": "Need help trying to analyse this file [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/31990/need-help-trying-to-analyse-this-file",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions asking for help reverse-engineering a specific system are off-topic unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem.\n\n\nClosed 1 year ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI’m new to all this Linux and reverse engineering and want to learn, I got this android firmware bin file read from a emmc and I wanted to mount it but couldn’t figure out how to but after 2 days I managed to figure out how to extract it, it was a 16gb file but I run out of space after it extracted 330gb which I used binwalk, there’s a small file named key which I just wanted to examine to see what data it has or if there’s a key of some sort, I checked with byte code and it shows as the picture which I don’t understand, so I tried to check Entropy but nothing is shown on the graph but it says falling entropy edge, so I need some help to try to find out what’s inside this file and if it’s encrypted but I’m stuck, here’s the pictures and I’ll upload the file aswell \nLink for the file I’m working on below\nhttps://www.mediafire.com/file/vcj41cac6fxrld1/key/file[enter link description here]3\n",
    "votes": "1",
    "answers": 0,
    "views": "60",
    "tags": [
        "binary"
    ],
    "user": "Imran Ali",
    "time": "1 year ago",
    "comments": [
        {
            "user": "secfren",
            "text": "What is this file and its purpose on the system?\n",
            "time": null
        },
        {
            "user": "Imran Ali",
            "text": "It’s meant to be a key for app, but I’m trying to find out and learn in the same process if it is encrypted and if does contain a key\n",
            "time": null
        },
        {
            "user": "Imran Ali",
            "text": "So no one can help me with this file if it is encrypted and how to tackle this ?\n",
            "time": null
        }
    ],
    "answers_data": []
}