{
    "title": "How can I extract the timestamp from this bytestring?",
    "link": "https://reverseengineering.stackexchange.com/questions/32024/how-can-i-extract-the-timestamp-from-this-bytestring",
    "content": "I am missing a piece of the puzzle that is the TCP protocol the Battlefield Bad Company games use to transfer dogtag records to/from the FESL backend. The general packet structure is quite clear and I know the meaning of most of the 24 character bytestring sent for each record. However, the game shows a timestamp for each record, which I so far fail to extract from the data.\n<pre><code>b'MIK813\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00E\\xb0\\xeb\\xe1\\x00\\x01\\x0e\\x00'\n</code></pre>\n\nplayer name, often but not always followed by a bunch of null bytes\n4 bytes, meaning unknown (I suspect this is the timestamp)\n2 bytes, number dogtags taken from player\n1 byte, player rank (at time of [last?] dogtag taken)\n1 byte, meaning unknown (seems to always be \\x00, so it may just be an end marker)\n\nBased on this structure, the timestamp would be this\n<pre><code>b'E\\xb0\\xeb\\xe1'\n</code></pre>\nHowever, unpacking that as an unsigned int (Big Endian) gives me <pre><code>1169222625</code></pre>. That would be some time in January of 2007. But I know that this was today. The game shows <pre><code>July 2nd 2023, 12:38</code></pre> for this record. The Unix timestamp for that would be around <pre><code>1688301494</code></pre>. Other records unpacked as unsigned int result in values that are not even valid as a Unix timestamp. Based on how different the values are, it also does not seem like an offset from a common timestamp.\nSo, how is the timestamp encoded? What am I missing here?\nSome more examples:\n<pre><code># July 3rd 2023 12:48\nb'Brain Wrought\\x00\\x00\\x00E\\xb0\\xeb\\xef\\x00\\x01\\x19\\x00'\n# July 3rd 2023 12:48\nb'lemenkool\\x00\\x00\\x00\\x00\\x00\\x00\\x00E\\xb0\\xeb\\xef\\x00\\x01\\t\\x00'\n# July 3rd 2023 12:23\nb'FauxNameless\\x00\\x00\\x00\\x00E\\xb0\\xeb\\xcc\\x00\\x01\\x19\\x00'\n# July 3rd 2023 12:17\nb'Darklord90xx\\x00\\x00\\x00\\x00E\\xb0\\xeb\\xc4\\x00\\x01\\x00\\x00'\n</code></pre>\n",
    "votes": "1",
    "answers": 0,
    "views": "187",
    "tags": [
        "python",
        "encodings",
        "protocol",
        "networking",
        "game"
    ],
    "user": "cetteup",
    "time": "Jul 3, 2023 at 18:17",
    "comments": [
        {
            "user": "sudhackar",
            "text": "Can you send these packets at set intervals and see how the supposed time changes and provide more samples here? It could just simply be xored with some value for example.\n",
            "time": null
        },
        {
            "user": "cetteup",
            "text": "@sudhackar I can't easily generate the data. A record is generated each time a player kills another player with a knife. I'll try to get someone to hop in game with me to try and generate more data. I also just added the timestamps to the known examples I have, of which to are shown with the same timestamp in game.\n",
            "time": null
        },
        {
            "user": "mimak",
            "text": "Old games often used custom formats for datetime, i think it'd be easier to decompile and analyse the data-unpacking code rather than guessing the pattern\n",
            "time": null
        }
    ],
    "answers_data": []
}