{
    "title": "How to version control an IDA project?",
    "link": "https://reverseengineering.stackexchange.com/questions/32035/how-to-version-control-an-ida-project",
    "content": "I'm a git addict. Whenever I develop a C++, Python application, I need to version control it. For example, the csproj file managed by Visual Studio holds the compiling configurations for a C# project, and I put the file into git.\nNow, as a newbie in reverse engineering, I'm using IDA. I like IDA's abilities to rename functions and variables, add comments, etc. I find an IDA project has a database, but it's not plain text.\nHow would I save my reverse engineering progress in git? How would I share my comments, notes, renamings to others so that they can pick up and continue studying the same executable?\n",
    "votes": "2",
    "answers": 2,
    "views": "279",
    "tags": [
        "ida"
    ],
    "user": "Gqqnbig",
    "time": "Jul 5, 2023 at 4:14",
    "comments": [
        {
            "user": "Ali Rizvi-Santiago",
            "text": "If you're starting out and you want git, you're definiltely looking for binsync. It supports the artifacts you mentioned by serializing them to TOML, and is available for the other major disassemblers too.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There's IDArling plugin made just for this purpose, it allows for real-time syncing and remote snapshot storage. IDB files of large binaries can reach gigabytes in size hence git storage could get a little awkward.\n",
            "votes": "2",
            "user": "mimak",
            "time": "Jul 5, 2023 at 22:15",
            "is_accepted": true,
            "comments": [
                {
                    "user": "hairlessbear",
                    "text": "<span class=\"comment-copy\">You can use <a href=\"https://git-lfs.com/\" rel=\"nofollow noreferrer\">git lfs</a> effectively track IDBs via git.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "There is another project available (I have no affiliation), which may also fit the bill: BinSync\nThe GitHub organization can be found here.\n",
            "votes": "1",
            "user": "0xC0000022L",
            "time": "Jul 6, 2023 at 20:46",
            "is_accepted": false,
            "comments": []
        }
    ]
}