{
    "title": "How to pass an SVD file as an argument to IDA Pro in the command line (batch mode)?",
    "link": "https://reverseengineering.stackexchange.com/questions/32110/how-to-pass-an-svd-file-as-an-argument-to-ida-pro-in-the-command-line-batch-mod",
    "content": "I am trying to disassemble a few Arm Cortex-M3 .elf binaries and run a custom IDAPython script (script.py) from the command line (in batch mode). I have been able to do that with the following command:\n<pre><code>/path_to_idapro/idat -B -parm:ARMv7-M -logfile.log -S\"/path_to_script/script.py arg1\" elf_to_disassemble\n</code></pre>\nHowever, I need to load an SVD file before running script.py so that my analysis will be complete. In IDA Pro GUI, I do the following:\n\nEdit > Plugins > SVD file management\nSelect the SVD file\n\nHow can I pass the SVD file (e.g., /path_to_SVD/STM32F103.svd) as an argument to my previous command?\nI have already searched the command line switches of IDA Pro https://www.hex-rays.com/products/ida/support/idadoc/417.shtml, and to my understanding, there isn’t such an option.\nI am currently using IDA Pro v7.6 in Ubuntu 20.04.3 LTS.\n",
    "votes": "1",
    "answers": 1,
    "views": "348",
    "tags": [
        "ida",
        "disassembly",
        "binary-analysis",
        "idapython",
        "arm"
    ],
    "user": "Konstantinos",
    "time": "Jul 30, 2023 at 20:00",
    "comments": [],
    "answers_data": [
        {
            "content": "You can run plugins from a script as follows:\n<pre><code>import ida_loader\n\narg = 0\nida_loader.load_and_run_plugin(\"svdimport\", arg)\n</code></pre>\nWhere <pre><code>arg</code></pre> has <pre><code>size_t</code></pre> type. This normally allows you to select plugin modes, but does not allow you to pass strings to your plugin.\nThus, I think there are two not-so-pleasant options:\n\ngenerate idb manually and only then analyse it in batch mode (doesn't make much sense when analysing at scale)\nuse a custom SVD Loader Plugin with a hardcoded file value or passed through configuration file (check out this and this as an input pointers)\n",
            "votes": "0",
            "user": "y_v",
            "time": "Jul 30, 2023 at 22:41",
            "is_accepted": false,
            "comments": []
        }
    ]
}