{
    "title": "Simple Question About Reversing a Python",
    "link": "https://reverseengineering.stackexchange.com/questions/32197/simple-question-about-reversing-a-python",
    "content": "So, detect it easy, shows that the .exe is a python 3.9 compiled on visual studio and the compiler was MS Visual C/C++. Trying to unpack it using <pre><code>pyinstxtractor</code></pre> fails, and shows me the error of\n\ncookie missing etc.\n\nThat happens when you are trying to unpack a .NET application, but I'm kind of confused now. I can't unpack it and it's a python. How is that? Even on <pre><code>DnSpy</code></pre>, it only shows me the header. What should I do now?\n",
    "votes": "0",
    "answers": 1,
    "views": "255",
    "tags": [
        "disassembly",
        "idapython",
        "python"
    ],
    "user": "Roy Guzman",
    "time": "Sep 3, 2023 at 22:09",
    "comments": [],
    "answers_data": [
        {
            "content": "If the executable is indeed a pyinstaller binary, then you generally need to make sure that you're running <pre><code>pyinstxractor</code></pre> inside the same version of python as produced the executable. Try to verify that is the case.\nThe executable might not be a pyinstaller binary, as there are multiple python \"compiler\" options. The other major one is <pre><code>py2exe</code></pre> (https://pypi.org/project/py2exe/), and there's another project <pre><code>unpy2exe</code></pre> for dealing with that format(https://pypi.org/project/unpy2exe/) Like pyinstxractor, I've found that it's generally better to run this project with the same python version.\nIf you want to ID what version of python it's using, you can use <pre><code>strings</code></pre>\nDnSpy won't help you with python binaries. It only decompiles .NET CIL. Instead, once you've got the python executable unpacked into its requisite .pyc files, you'll want to run a separate decompiler utility like <pre><code>uncompyle6</code></pre>(https://pypi.org/project/uncompyle6/) or <pre><code>decompyle3</code></pre> (https://github.com/rocky/python-decompile3). Then you can open the produced .py files in your favorite editor.\n\nHere's another reference that's helpful if you aren't familiar with analyzing python:\nhttps://betterprogramming.pub/analysis-of-compiled-python-files-629d8adbe787\n",
            "votes": "1",
            "user": "mayahustle",
            "time": "Sep 11, 2023 at 9:24",
            "is_accepted": false,
            "comments": []
        }
    ]
}