{
    "title": "Figuring out the algorithm for an NFC reader, which displays values increased by 1.52 times",
    "link": "https://reverseengineering.stackexchange.com/questions/32252/figuring-out-the-algorithm-for-an-nfc-reader-which-displays-values-increased-by",
    "content": "I have two NFC readers, reader A reads card ID numbers according to the ISO standard and the algorithm is publicly available. Reader B is from a Canon printer. The card numbers read by reader B are 1.52 times larger than those read by reader A for the same card.\nIs there a genius who can help me figure out the encryption algorithm of the NFC reader B?\n\nHere are some card data for reference.\n\ncard1:\nreader A：0565932061\nreader B：0863528701\ncard2:\nreaderA：0100347102\nreaderB：0153111486\ncard3:\nreaderA：1816830668\nreaderB：2772241676\ncard4:\nreaderA：1530064599\nreaderB：2363059447\ncard5:\nreaderA：3783796822\nreaderB：5773610326\n\nmy card is standard mifare m1 card.\nreader B is from cannon c5560i printer.\nAccording to the ISO14443-a standard：The first four bytes of my card is 1D 70 BB 21, reversing the orde gives 21 BB 70 1D which is the value 565932061 in decimal.\nso:\nreader A：0565932061 ：ISO standard\nreader B：0863528701 ：unknown\nAs you can see the value B shows is approximately 1.52 times more，So I think it's possible to find an algorithm compared to those with irregular encryption.\nWho can help me figure out the encryption algorithm of the NFC reader B?\n",
    "votes": "2",
    "answers": 0,
    "views": "65",
    "tags": [
        "encryption",
        "xor"
    ],
    "user": "张星星",
    "time": "Sep 3, 2023 at 16:36",
    "comments": [
        {
            "user": "ESkri",
            "text": "Ratio in all cases except 4 (does case 4 contain a typo?) are close to constant <pre><code>0.65536</code></pre> which is easy to divide by in a microcontroller (multiplying by <pre><code>10^5/2^16</code></pre>).  Probably this is a way to hide a card no from you :-)\n",
            "time": null
        },
        {
            "user": "sudhackar",
            "text": "Does this answer your question? Figuring out the algorithm for an NFC reader, which displays values increased by 1.52 times\n",
            "time": null
        },
        {
            "user": "张星星",
            "text": "Thank you for your answer, I have found the algorithm\n",
            "time": null
        }
    ],
    "answers_data": []
}