{
    "title": "Need help understanding why Netflix prevents me from downloading with VPN",
    "link": "https://reverseengineering.stackexchange.com/questions/32294/need-help-understanding-why-netflix-prevents-me-from-downloading-with-vpn",
    "content": "When using Netflix via the Windows desktop app with a VPN, streaming movies works fine but downloading does not. The download gets automatically paused, and after a minute it shows error code DL1-W80072EFD. This is strange because if streaming works, why wouldn't downloading? Also, downloading with VPN works on my phone, so why not on PC? Something is making Netflix decide to block downloads, and I'm on a mission to figure out what.\nSo I dug around in the AppData folder <pre><code>%LOCALAPPDATA%/Packages/4DF9E0F8.Netflix_mcm4njqhnhss8/</code></pre>, inspected some files and came up with this little bash script:\n<pre><code>cd ~/AppData/Local/Packages/4DF9E0F8.Netflix_mcm4njqhnhss8/\nrm -rf LocalState/{onlineInfo,offlineInfo/json}\nsed -Ei 's/\"home\":/\"anything_else\":/g' LocalState/resumeInfo\n</code></pre>\nThis just deletes/modifies files which seemed to cache data belonging to the previous region, while not touching anything that would cause Netflix to ask me to sign in again. Running this script whenever I switch regions helps; it solves an issue where Netflix shows movies belonging to the previous region. But it doesn't solve the issue of not being able to download anything.\nI tried deleting the entire Netflix AppData (sans a few files that didn't give me permission), tried resetting the app in Windows settings, tried disabling Windows location services, no luck.\nSo now I'm here asking for help. I guess my question is: how does Netflix know to prevent my download, or what can I do to figure it out on my own. Thanks.\n",
    "votes": "0",
    "answers": 0,
    "views": "195",
    "tags": [
        "windows",
        "tools",
        "script",
        "gps"
    ],
    "user": "Verpous",
    "time": "Sep 16, 2023 at 13:56",
    "comments": [
        {
            "user": "doge guide",
            "text": "maybe it compares your ping with other pings related to vpns? or a list of common ips you could download a tool that records all the GET/POST requests if windows doesnt have one already\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. Downloading would request the data much faster, while a stream would only cache a few seconds or minutes ahead. That's quite a notable difference from the hoster's perspective. Equally, the ASN for each provider will enable them to figure out if you belong to a known VPN provider. Cloudflare has the ability to block individual AS and thereby also block those coming through a VPN. Several shady websites use that to collect the real IP addresses or otherwise privacy-conscious block visitors. Last but not least each Windows instance has uniqueness which may be transmitted\n",
            "time": null
        }
    ],
    "answers_data": []
}