{
    "title": "Are these for controlling the heat pumps with Wifi",
    "link": "https://reverseengineering.stackexchange.com/questions/32298/are-these-for-controlling-the-heat-pumps-with-wifi",
    "content": "We have 3 heat pumps (all ducted).  Yesterday I found 3 of these in the attic space.  Since they say Mitsubishi and Wifi, I am assuming that are Wifi controllers for the heat pumps.\nThe question is, are they really Wifi controllers.  And how do they work ?  They need to be wired to something.  Do they need additional hardware on the heat pump ?  Do they work with no indoor highwall unit ?\n\n\nI just found an online installation manual to install it inside a wall unit.  I would still like to know if they can be used with the outdoor unit or the ducted system in the attic space.\n",
    "votes": "0",
    "answers": 1,
    "views": "69",
    "tags": [
        "untagged"
    ],
    "user": "Rohit Gupta",
    "time": "May 12, 2024 at 3:16",
    "comments": [
        {
            "user": "blabb",
            "text": "Reading the manual i think you should first locate the port if it exists in any place if they exist then it should be a simple matter of running some jumper wires from this port To the controller and check if it flashes or connectible to router then you can probably double tape it somewher\n",
            "time": null
        },
        {
            "user": "Remko",
            "text": "I have similar looking WiFi interface for my Mitsubishi aircon. It connects to the indoor unit, not the outdoor unit\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It appears that they are generic Wifi controllers for Mitsubishi Heatpumps (ACs).  I sold them to someone who just slotted them into his units and they worked.\n",
            "votes": "0",
            "user": "Rohit Gupta",
            "time": "Jun 12, 2024 at 10:57",
            "is_accepted": true,
            "comments": []
        }
    ]
}