{
    "title": "GWT: Deserialize objects sent/received via websocket",
    "link": "https://reverseengineering.stackexchange.com/questions/32411/gwt-deserialize-objects-sent-received-via-websocket",
    "content": "I would like to analyze the authentication function of a given GWT web application. When authenticating with my credentials, I could identify that my credentials are sent via websocket in form of a binary blob. This most certainly is a serialized GWT object. The authentication seems to follow a protocol that involves 3-4 messages exchanged with the server-side.\nHence, I strive to understand how the client-side transforms my textual credentials (username / password) into this binary blob. Subsequently, I would like to understand how I can deserialize messages coming from the server in order to get a better idea of the messages exchanged and hence the protocol.\n",
    "votes": "0",
    "answers": 1,
    "views": "92",
    "tags": [
        "untagged"
    ],
    "user": "user1192748",
    "time": "Oct 20, 2023 at 12:21",
    "comments": [
        {
            "user": "Steffen Ullrich",
            "text": "I’m voting to close this question because it is basically asking how to reverse engineer an application or protocol - and it just happens that the protocol is used to transport credentials. There is Reverse Engineering for this.\n",
            "time": null
        },
        {
            "user": "user1192748",
            "text": "Is there a way to transfer the question over there or should I open it there from scratch?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "After further investigation of the protocol, it seems like there is no pbject serialization involved. Instead, the application creates a websocket and establishes a AES-CBC encrypted channel. Hence, the binary blobs that I was seeing are encrypted messages.\n",
            "votes": "0",
            "user": "user1192748",
            "time": "Oct 22, 2023 at 12:52",
            "is_accepted": false,
            "comments": []
        }
    ]
}