{
    "title": "Freeware x86 decompilers for Windows with debug? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/32574/freeware-x86-decompilers-for-windows-with-debug",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 1 year ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm searching for a software that is capable of decompiling x86 code in C-like code and run a debug session within it with the possibility to see the content of the variables.\nThat above was a quick summary, let me explain better here.\nI'm trying to recreate a master server for an old game that will have its master server taken down (and now its not working good because it uses deprecated TLS technologies, you have to enable some option in windows). Because of this, I sniffed all the traffic that I was able to make (running trough mitmproxy) and already having a full playable server.\nOne functionality is still not working, because the master server is not sending back data (is a \"news\" section of the in-game browser).\nThe only thing I would like to know reverse engineering the executable of the game is the format how that response should be sent by the master server to have it shown in the game. I know for sure it should be not encrypted (nothing between the communication is, is in ASCII plaintext, encrypted in a lower level via SSL). Once I will be able to know how the format of the response was, the data should not be a problem. I've tried bruteforcing like other response from the server, but checking a decompiler, it seems it parses in a different way.\nI've tried some disassemblers, but following assembly code is not the easiest thing to do. Also following a C pseudocode without debugging is not the easiest, I'm not C expert (I'm more a high-level programmer), altough I know the theory behind both x86 assembly and C.\nI've tried\n*IDA freeware: it starts debugging perfectly, but cannot understand the memory structure inside it, so I could not understand why the conditions that make the game failing to read the response are behaving like that.\n*Binary Ninja Debugger demo: good C like code, but can not start the debugger at all.\n*Cutter debug: good C code, but the breakpoints are not stopping by.\nI don't need to modify the code, or recompile it. I hope my question is clear :)\nThank you\nAlby87\n",
    "votes": "1",
    "answers": 0,
    "views": "84",
    "tags": [
        "debugging",
        "x86",
        "decompilation"
    ],
    "user": "Alby87",
    "time": "1 year ago",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. This is an opinion-based question, not a good fit for our Q&A site. I suggest you take it to our peer site \"Software Recommendations\".\n",
            "time": null
        },
        {
            "user": "Alby87",
            "text": "Hi! I have published the question also in that Stack Exchange. I hope to find a solution here, this little \"roadblock\" seems a lot difficult to resolve for an inexperienced user 😅\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "Hey, cool. I am closing it here, but I edited your comment to refer to the other question by hyperlink.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "I’m voting to close this question because it's not a good fit on this site. However, the user already asked the question over at softwarerecs.stackexchange.com/questions/88545/… which is a better fit.\n",
            "time": null
        }
    ],
    "answers_data": []
}