{
    "title": "VxWorks flat binary file",
    "link": "https://reverseengineering.stackexchange.com/questions/32594/vxworks-flat-binary-file",
    "content": "VxWorks has a \"flat binary file\" format in which the initial 8 byte values are <pre><code>45 53 54 46 42 49 4E 52</code></pre> (<pre><code>ESTFBINR</code></pre> if interpreted as ASCII).\nI know very little about their content except:\n\nbinwalk recognizes the magic bytes ESTFBINR and is able to find and extract and expand a zlib file from such flat binary files.\nThe flat binary files that I have, all include an ASCII text copyright notice from Wind River.\nThe \"EST\" in the signature is associated with a company called Embedded Support Tools that Wind River bought in about 2000.\nAn old post to the u-boot mailing list stated that the format is associated with an old development tool from EST called VisionClick. I've confirmed this with a few google searches.\n\nBut additional searching has failed to yield an additional details about this format, so I'm hoping someone here may know more or be able to find additional information that I haven't turned up. (To my total lack of surprise, the AI chat bots have given me nothing else.)\n",
    "votes": "1",
    "answers": 1,
    "views": "213",
    "tags": [
        "binary-analysis",
        "file-format"
    ],
    "user": "g1l1t1",
    "time": "Dec 22, 2023 at 4:30",
    "comments": [
        {
            "user": "Ali Rizvi-Santiago",
            "text": "When you're looking for history, check web.archive.org for press releases, EDGAR, and USENET archives. Specifically comp.os.vxworks which has this post: groups.google.com/g/comp.os.vxworks/c/i91b43VyBEQ/m/…. The names of people who worked on it during that time might also be helpful.\n",
            "time": null
        },
        {
            "user": "Ali Rizvi-Santiago",
            "text": "There's also this post which might be relevant as it mentions the signature you suggested: groups.google.com/g/comp.os.vxworks/c/AfMQ3lDVKM0/m/…\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "Sorry, what is your actual question? I can't seem to find it in the text...\n",
            "time": null
        },
        {
            "user": "g1l1t1",
            "text": "I'm just looking for more information about what is inside a VxWorks flat binary file. The thread in comp.os.vxworks that Ali posted confirmed what I already knew about the initial 8 bytes, but the other details from that post don't appear to apply. There's no room to post any detail within the character limit here, and I'm out of time for now, but I will post again later about that thread, or edit my original post, when I have more time.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It seems there is no defined structure besides the header - the rest of the file is basically raw binary, containing whatever data is necessary for the device to operate. I could find an example firmware here and the file simpy contains PPC code for the VxWorks bootloader with the compressed kernel. My quick RE notes:\n<pre><code>https://www.elspec-ltd.com/support/release-notes/g4k-release-notes/\n\nG4k_0.4.12.73.48C7.fw\n\nload data from 0x20 to 0xFFF00100\n\ncompressed data starts at 62A8 (08 78 9C) with zlib stream at 62A9 (w=15)\n</code></pre>\n",
            "votes": "0",
            "user": "Igor Skochinsky",
            "time": "Feb 21, 2024 at 21:47",
            "is_accepted": false,
            "comments": []
        }
    ]
}