{
    "title": "Is learning assembly enough to become a malware analyst? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/3261/is-learning-assembly-enough-to-become-a-malware-analyst",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI am a C/C++ developer and I have started learning assembly language programming with the goal to become a malware analyst. \nI know it is not enough to just know how to read assembly to become a malware analyst. But won't it help a lot and make the remaining things easier?\n",
    "votes": "5",
    "answers": 3,
    "views": "4k",
    "tags": [
        "malware",
        "assembly",
        "binary-analysis",
        "vulnerability-analysis"
    ],
    "user": "Pranit Kothari",
    "time": "11 years ago",
    "comments": [
        {
            "user": "0xec",
            "text": "Assembly is definitely important but the the key is your patience, not to loose your mind. Some reversing ventures may last for days.\n",
            "time": null
        },
        {
            "user": "Devolus",
            "text": "@ExtremeCoders, only days? ;)\n",
            "time": null
        },
        {
            "user": "Devolus",
            "text": "You may google for <pre><code>crack me</code></pre> and you can find sites where you can find sample programs for reversing, which is a good way to learn the basic stuff.\n",
            "time": null
        },
        {
            "user": "asheeshr",
            "text": "This question appears to be off-topic because it is about career advice and development.\n",
            "time": null
        },
        {
            "user": "BraveNewCurrency",
            "text": "The answer to your question is \"NO\". Assembly Language is just one little tool in the toolbox. In fact, Assembly is much easier to learn than C/C++.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "To be a malware analyst, the minimum knowledge typically needed is:\n\nAssembly language\nOperating system internals\nDeobfuscation and anti-anti-debugging techniques\n\nObviously, there are other useful areas of knowledge for malware analysis (like an understanding of network protocols, exploit analysis techniques, knowledge of VB P-code and JavaScript and .NET languages, etc.), but it looks like you're making progress ;)\nMost of the things you'll need to know you'll learn along the way. For example, you may come across a malware sample that exploits Adobe Flash player. This will give you the opportunity to learn about the SWF file format, ActionScript source and bytecode, etc.\n",
            "votes": "14",
            "user": "Jason Geffner",
            "time": "Dec 22, 2013 at 17:01",
            "is_accepted": true,
            "comments": [
                {
                    "user": "AminM",
                    "text": "<span class=\"comment-copy\">how security research find malware?? how detect that system has infected??</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "FROM SANS.ORG\nWhen discussing malware analysis, There is 3 main phases of the process: behavioral analysis, code analysis and memory analysis.\nHere's a brief outline of each phase:\n\nBehavioral analysis\nexamines the malware specimen's interactions with its environment: the file system, the registry (if on Windows), the network, as well as other processes and OS components. As the malware investigator notices interesting behavioral characteristics, he modifies the laboratory environment to evoke newcharacteristics. To perform this work, theinvestigatortypically infects the isolated system while having the necessary monitoring tools observe the specimen's execution. Some of the free tools that can help in this analysis phase are Process Monitor, Process Explorer, RegShot and Wireshark. Several free on-line tools can automate some aspects of behavioral analysis; there are also several free frameworks you can use to script the analysis process in a local lab.\nCode analysis\nreverse-engineers the malicious program to understand the code that implements the specimen's behavior. When looking at compiled programs, this process involves using a disassembler, a debugger and, perhaps, a decompiler to examine the program's low-level assembly or byte-code instructions.A disassembler converts the instructions from their binary form into the human-readable assembly form. A decompiler attempts to recreate the original source code of the program. A debugger lets the analyst step through the most interesting parts of the code, interacting with it and observing the effects of its instructions to understand their purpose. OllyDbg and IDA Pro Freeware are popular free disassembler/debuggers that can handle Windows programs.\nMemory analysis\nexamines memory of the infected system to extract artifacts relevant to the malicious program. In the context of reverse-engineering malware, memory analysis can help identify malicious code that is trying to hide itself (i.e., rootkits), can clarify the program's run-time dependencies, and can explain how the specimen was used on the victim's system. Memory analysis saves time and allows theinvestigatorto take shortcuts when studying the specimen's behavior or code. Free tools for performing memory analysis are The Volatility Framework and its malware-related plugins, as well as Memoryze and the associated Audit Viewer program.\n\nI Hope this would be an added Value to the above response\n",
            "votes": "4",
            "user": "kamil",
            "time": "Dec 23, 2013 at 12:35",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "When I started with Malware Analyses at some anti-virus vendor. I only had reversed a couple of aspects of video games and created a number of tools to extract graphics etc. I also knew a fair bit of malware culture etc.. Read a lot of Malware source code (vxheavens) and all that jazz.\nI however, didn't know about Obfuscation, unpacking, shellcode etc. This is something I learned over the course of a few years while on the job.\nHowever, a SOLID understanding of x86 and your debugging / dis-assembler is required!\n",
            "votes": "4",
            "user": "Stolas",
            "time": "Dec 23, 2013 at 15:34",
            "is_accepted": false,
            "comments": [
                {
                    "user": "the_endian",
                    "text": "<span class=\"comment-copy\">So should someone just start applying when they've gotten these basics down? The field definitely seems to be niche so there's not a lot of mainstream career advice out there on it.</span>",
                    "time": null
                },
                {
                    "user": "Stolas",
                    "text": "<span class=\"comment-copy\">Times have changed most av analysts I know rely on behavoral analyses now</span>",
                    "time": null
                }
            ]
        }
    ]
}