{
    "title": "Executable Opcodes of Windows Image File Seem Offset from My Calculations",
    "link": "https://reverseengineering.stackexchange.com/questions/32611/executable-opcodes-of-windows-image-file-seem-offset-from-my-calculations",
    "content": "Background:\nI'm trying to manually disassemble a practice executable file for practice.\nhttps://github.com/stryker2k2/dbg-demo/blob/master/assem/assem_0x00.asm\nIssue:\nWhen I take a look at what I think should be the start of the executable code in the image file, the assembly instructions don't match the source assembly. Instead the opcodes that match the source assembly are located 0x140 further down in the file.\nWhat I Did:\nLooking at the headers I determined the .text section virtual address to be 0x1000 at the file pointer 0x400. The size of the .text section is 0x3000. The entry point is 0x12D0. Knowing this I should be able to do 0x12D0 - 0x1000 + 0x400 to find the file pointer of the entry point as 0x6D0. My analysis with a disassembler says that the assembly from the source file actually starts at 0x810.\nWhat did I miss?\n",
    "votes": "0",
    "answers": 0,
    "views": "55",
    "tags": [
        "disassembly",
        "windows",
        "pe"
    ],
    "user": "Liam Hanrahan",
    "time": "Jan 2, 2024 at 8:48",
    "comments": [
        {
            "user": "Ali Rizvi-Santiago",
            "text": "If you're following the directions listed in that linked .asm source and then trying to identify the code that's listed in that same source as your pattern, there's a small discrepancy between what you say you're looking for and where you're expecting it to be. Essentially, the directions suggest to link with a CRT, and the linked asm code exports its logic via the symbol <pre><code>_main</code></pre>. Hence, you won't find <pre><code>_main</code></pre> at the entrypoint, but rather the CRT which is directly responsible for calling <pre><code>_main</code></pre>.\n",
            "time": null
        },
        {
            "user": "Ali Rizvi-Santiago",
            "text": "You can find MinGW's CRT initialization in its source as <pre><code>crtexe.c</code></pre> and see if that matches your entrypoint, as it's that code should eventually be responsible for dispatching to <pre><code>_main</code></pre>.\n",
            "time": null
        },
        {
            "user": "Liam Hanrahan",
            "text": "I haven't been able to verify the assembly code but I noticed mingw32 is referenced in a string in the file so I think you are right.\n",
            "time": null
        }
    ],
    "answers_data": []
}