{
    "title": "Router shadow password generation",
    "link": "https://reverseengineering.stackexchange.com/questions/32647/router-shadow-password-generation",
    "content": "I'm reverse engineering a router, I'm fairly new to embedded devices and how Linux boots up, but I have a root UART shell, there's already a password hash in the <pre><code>/etc/shadow</code></pre> file, these passwords/hashes must be set somewhere right? How do devices like this usually do it, is there a script that is run during boot, or would it be in a binary in the /lib folder or something? I'm guessing it does this on the first boot up only?\nWould it also be as simple as searching for a <pre><code>mkpasswd</code></pre> string in all the above? I really want to see if I can find what/how the password hash is generated, or hopefully some plaintext hardcoded string somewhere, but not really sure of where to start looking.\nThe modem is running OpenWrt. I've searched in <pre><code>/etc</code></pre>, <pre><code>/lib</code></pre>, <pre><code>/sbin</code></pre>, <pre><code>/sbin/lib</code></pre>, checked in other partitions.\nAny tips or guidance on this stuff would be great, thanks!\n",
    "votes": "0",
    "answers": 1,
    "views": "162",
    "tags": [
        "linux",
        "hardware",
        "router"
    ],
    "user": "spergy",
    "time": "Jan 16, 2024 at 3:46",
    "comments": [],
    "answers_data": [
        {
            "content": "UPDATE: I found out there's a custom binary, which sets the root pw to an md5 hash, the literal hash is the root pw, but now I want to find out what that is an md5 hash of exactly, out of curiosity. I've heard it can be a checksum of something to do with the firmware, but I don't really know how to check that. I've tried an <pre><code>md5sum</code></pre> on most firmware/device details I can find but no luck.\nI've also searched the filesystem for <pre><code>md5sum</code></pre> and the name of the custom binary, as well as the actual md5 hash itself, but no luck with any of those either. Last resort is now reverse engineering the custom binary that displays the md5 hash, figured maybe it was doing the hashing in that binary.\n",
            "votes": "0",
            "user": "spergy",
            "time": "Jan 16, 2024 at 8:25",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jon",
                    "text": "<span class=\"comment-copy\">Have you tried searching for the hash? There are sites like crackstation and hashes that have a large number of pre-computed/ \"cracked\" hashes that you can search for, or even just google it?  Or was there any other relevant information that could help where you heard it could be a checksum?</span>",
                    "time": null
                },
                {
                    "user": "spergy",
                    "text": "<span class=\"comment-copy\">@Jon Yeah tried both of those and just Googling it, no luck. No more information around the checksum thing. I guess I'll try my luck reversing some binaries.</span>",
                    "time": null
                }
            ]
        }
    ]
}