{
    "title": "Changing instruction that was misidentified in IDA Pro",
    "link": "https://reverseengineering.stackexchange.com/questions/32809/changing-instruction-that-was-misidentified-in-ida-pro",
    "content": "I am trying to compare a source code to a disassembled version of a Sega Genesis (68000 processor) game. I ran the binary through IDA Pro 7.7 to disassemble it, and when I was going through the code and comparing it to the source code, I noticed that IDA Pro's disassembler labeled some instructions improperly. Is there a way to manually correct it? As it is, I cannot compile the disassembled code, because an error regarding that instruction will come up.\nIDA Pro identifies the code as the following:\n<pre><code>ROM:00005CA6 013C                                        d0              ; start of messed up disassembly\nROM:00005CA8 00F0 4E75\nROM:00005CAC\nROM:00005CAC                     _1:                                     ; CODE XREF: Findhittype+10↑j\nROM:00005CAC 013C                                        d0\nROM:00005CAE 001E 4E75                           ori.b   #$75,(a6)+ ; 'u' ; end of messed up disassembly\n</code></pre>\nThe source code shows it as follows:\n<pre><code>    btst    d0,#%11110000\n    rts\n.1\n    btst    d0,#%00011110\n    rts\n</code></pre>\nChecking the opcode, it looks like the 68k disassembler does not recognize this instruction.\nHere is a description of the BTST instruction:\n\n\nIs there a way to change this? Thanks!\n",
    "votes": "2",
    "answers": 0,
    "views": "61",
    "tags": [
        "ida",
        "disassembly"
    ],
    "user": "John G",
    "time": "Mar 15, 2024 at 20:02",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "Hi and welcome to RE.SE. By undefining (<pre><code>u</code></pre>) and then defining as code (<pre><code>c</code></pre>) pieces of code, based on the offset from where you say it wrongly identified it, should theoretically do the job. You can also manually set the instructions, but I don't remember the shortcuts for that (and don't know if the decompiler, for example, would heed those changes).\n",
            "time": null
        },
        {
            "user": "John G",
            "text": "Thanks, sorry for the slow reply. I did try this. I did \"analyze\" when asking after highlighting and pressing C, still displaying wrong. Not sure if there is a bug in the disassembler, it looks like this is not a common way to use the BTST instruction\n",
            "time": null
        }
    ],
    "answers_data": []
}