{
    "title": "Deodex Android 5 system app",
    "link": "https://reverseengineering.stackexchange.com/questions/32967/deodex-android-5-system-app",
    "content": "Speaking of Qualcomm, their phones have the ability to expose a diagnostic/programming port, something many Qualcomm BREW feature phones do.\nWell, as it turns out, that Alcatel supports the same thing! But because capitalism and self interests, it's locked behind a system app named \"DiagProtector\" (com.diagprotector). Now, what does it do? Yes! It protects the diagnostic port! If the 20 digit \"USB unlock key\" (I'm guessing it's the network unlock key) is correct, it allows you to enable/disable the serial and diagnostic ports. (It also misspells \"disabled\".)\n\nI want to cover more of my bases when it comes to figuring this phone out, so I want to reverse engineer that system app!\nUnfortunately, the program's code is outside the APK and inside an ODEX file. Fortunately, something like \"baksmali\" can convert it to a DEX file! Unfortunately, HISTORY.\nThe Android historians among you may recall that Android Lollipop was the first version to use the ART vm by default. Many others may recall that first releases of software tend to involve weird compatibility issues.\nIt seems like the nonexistent gods have forsaken me, because I CAN'T GET THIS THING TO CONVERT! At all.\nModern smali only touches Android 6.0 and above, this website (https://www.naldotech.com/how-to-deodex-applications-on-android-5-0-lollipop/) has DEAD LINKS, and just... AWFUL.\nSo if anyone knows how to decompile odex'ed android 5 programs, please help me.\n",
    "votes": "1",
    "answers": 2,
    "views": "58",
    "tags": [
        "android"
    ],
    "user": "qwerty keyboard",
    "time": "Jun 23, 2024 at 1:01",
    "comments": [],
    "answers_data": [
        {
            "content": "You can try dumping the dex using frida or LSPosed. Perhaps, the original dex is being loaded dynamically & that's probably why you can't see it inside the apk.\nIt'll be cool if you can attach the target apk in your post.\nFor frida scripts:\nhttps://github.com/apkunpacker/FridaScripts\nLSPosed module for dumping dex:\nhttps://modules.lsposed.org/module/com.zhenxi.fundex2\n",
            "votes": "1",
            "user": "Vansh Santoshi",
            "time": "Jul 22, 2024 at 7:59",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "So, after trying \"oat2dex.jar\" from this source: https://xdaforums.com/t/tool-utility-joeldroid-lollipop-batch-deodexer-v-2-5-updated-18-apr-2015.2980857/#post57678832\nIt actually \"converts\" the file.\nAlso, the property \"dev.jrdcom.spctrycount\" is wiped when the phone restarts. Nice.\n",
            "votes": "1",
            "user": "qwerty keyboard",
            "time": "May 13, 2024 at 20:03",
            "is_accepted": false,
            "comments": []
        }
    ]
}