{
    "title": "Need Help Reverse Engineering this \"main.pak\" Archive from a Nintendo DS Game",
    "link": "https://reverseengineering.stackexchange.com/questions/32972/need-help-reverse-engineering-this-main-pak-archive-from-a-nintendo-ds-game",
    "content": "I hope I am in the correct place, so to start I have extracted this archive named \"main.pak\" from the 2008 Nintendo DS game titled, \"SpongeBob SquarePants Featuring Nicktoons - Globs of Doom\" and need help figuring out how to extract it or at least understand how to make a tool to extract it. I also have Googled every possible term to find information on this archive and have come up with nothing as I understand .pak is a common and specific to the format extension and could be anything.\nAnyway, upon opening the file in a hex editor, it has the magic header \"50 41 4B 00\" or \"PAK0\", and has multiple of these \"PAK0\" headers within it like other PAKs inside of the main archive? or directories perhaps? There even seems to be filenames of assets in this archive! Below are some hex editor screenshots of this.\n\nI believe the archive is LZ77Wii compressed or maybe even uncompressed! So, here is a link to a sample of the archive for if anyone can look at it and help me determine its format. Thanks very much in advance! 😊\nlink to the file: https://drive.google.com/file/d/1YwThV6YzKrzuijTJ9rBlWpnCfgQmCXQ_/view?usp=sharing\n",
    "votes": "0",
    "answers": 0,
    "views": "94",
    "tags": [
        "game-hacking"
    ],
    "user": "PMarie_2024",
    "time": "May 19, 2024 at 3:47",
    "comments": [
        {
            "user": "jsotola",
            "text": "have you tried opening it with 7zip?\n",
            "time": null
        },
        {
            "user": "PMarie_2024",
            "text": "@jsotola Yes, I have. I have also tried every possible tool to extract or open it, and they all throw an error of some sort due to this format being what it is. It isn't a Quake PAK, it isn't any of the PAK formats I see online, so I believe it's a specific proprietary format.\n",
            "time": null
        },
        {
            "user": "Rup",
            "text": "When you say filenames do you mean the strings like <pre><code>c201_</code></pre> ? I don't see anything else obvious. There's also the string \"CellAnime\" but it's never in one piece, and the byte splitting it is in different places, so that does look like there's some compression here (but not one that obscures bytes like LZW), but then I don't recognise the just-one-bytes here. You could try picking one of those and treating the byte in the middle as a Wii LZ77 control byte and seeing if you can unpick the compression before and after.\n",
            "time": null
        },
        {
            "user": "PMarie_2024",
            "text": "@Rup Yes, those are strings for assets in the game, and the \"CellAnime\" string is actually names of animation banks used in the game as NANR \"Nintendo Animation Resource\" files. I have also through hex found that there is many openable DS formats like that. if it helps any, this archive seems to respond well to \"LZ77Wii\" compression, using that I can get some files understandable from it, but not what I believe should or could be extracted.\n",
            "time": null
        }
    ],
    "answers_data": []
}