{
    "title": "How to find what are all the third party apps used in an android app manually by decompiling an apk",
    "link": "https://reverseengineering.stackexchange.com/questions/33013/how-to-find-what-are-all-the-third-party-apps-used-in-an-android-app-manually-by",
    "content": "How to find all the Third Party Libraries (TPLs) used in an android app after de-compiling apk using jadx? I have looked at this answer but this is too vague.\nI can use tools such as Libradar etc. but these tools require that I provide a database of all the TPL's to find whether the TPL is existing in the app. Any other manual way to find all the TPL's which exist in the Android app as I'm interested only in finding the TPL's in a single app.\n",
    "votes": "1",
    "answers": 2,
    "views": "98",
    "tags": [
        "decompilation",
        "android",
        "java",
        "libraries"
    ],
    "user": "Vamsi",
    "time": "Jun 7, 2024 at 10:06",
    "comments": [
        {
            "user": "Robert",
            "text": "If the APK obfuscated or not? If not you can simply look at the package names of the classes and search for them in the internet. Additionally the <pre><code>R</code></pre> classes (see Jadx) often contain a library name and sometimes even the version.\n",
            "time": null
        },
        {
            "user": "Vamsi",
            "text": "@Robert the apk is obfuscated, also how do I know which library is requesting a specific android permission in the case of normal apk.\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "It doesn't matter which library is requesting a permission. Once you grant it the whole APK has access. Therefore a library could simply wait for the permissions requested by other parts of the app and then access the data without requesting the permission itself. Therefore you should search for API methods that require specific permission rather than code parts that request a permission.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can use AppManager to look for libraries in apk.\nApp link: https://f-droid.org/en/packages/io.github.muntashirakon.AppManager/\nOpen any apk or installed app on it, and choose \"Scanner\" to fetch libraries, trackers & other information.\nI'll also recommend using APKiD:-\nhttps://github.com/rednaga/APKiD\nIt'll help you to figure out what protection, obfuscation, etc the app uses.\nSome protection hide the original dex files/load it only on runtime (Example-Jiagu360 ) in that case, you'll have to dump the dex using frida or through some other way, and after that you can move on to analyze the original dex.\nSome protections also randomize the file name of .so libraries, and decrypt the original library on runtime. In that case, you'll have to look for a way to remove those protections\nfirst, and APKiD will help you in first step of figuring out what exactly you're fighting against.\n",
            "votes": "0",
            "user": "Vansh Santoshi",
            "time": "Jul 22, 2024 at 7:49",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Vansh Santoshi",
                    "text": "<span class=\"comment-copy\">Also, you can decompile using jadx and check for interesting/specific decompiled code on <a href=\"https://grep.app/\" rel=\"nofollow noreferrer\">grep.app</a> to find out if it belongs to some open source library.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Use the package manager to query third party APKs by passing third party flag.\nThis must be done with shell privileges using shizuku APK or adb.\n",
            "votes": "0",
            "user": "PhantomThreads",
            "time": "Jun 16, 2024 at 1:22",
            "is_accepted": false,
            "comments": []
        }
    ]
}