{
    "title": "Issue opening executable module in OllyDBG",
    "link": "https://reverseengineering.stackexchange.com/questions/3304/issue-opening-executable-module-in-ollydbg",
    "content": "I am running windows 8.1 and OllyDBG 2.0. When I attach to a process and view the executable modules, I want to open one. However, when I double click on one of the modules, it won't open in the main OllyDBG window, which it should. Has anyone else had a similar issue or have a solution? I run OllyDBG as administrator and I even tried running it in compatibility mode for XP. I can provide more information if it is needed to fully answer my question.\n",
    "votes": "8",
    "answers": 1,
    "views": "7k",
    "tags": [
        "ollydbg"
    ],
    "user": "Chris Altig",
    "time": "Dec 28, 2013 at 0:48",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "Press <pre><code>Alt</code></pre>+<pre><code>L</code></pre> to open the Log window. What does the log say?\n",
            "time": null
        },
        {
            "user": "Chris Altig",
            "text": "The log is saying: <pre><code>\"Different PE headers in file and in memory (System update is pending?)\"</code></pre>\n",
            "time": null
        },
        {
            "user": "Chris Altig",
            "text": "Strangely enough though, it works just fine in OllyDBG 1.1\n",
            "time": null
        },
        {
            "user": "0xec",
            "text": "Most probably it is due to antivirus . Are you running Avast ? Also try to use the most recent version of ollydbg, version 2.01 released on september 2013\n",
            "time": null
        },
        {
            "user": "0xec",
            "text": "Well the error happens due to the fact that certain (overcautious) antivirus hook/modify the system dlls in memory and this causes a mismatch of the dll between disk and memory.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "This has been  lying unanswered for year now\nhit enter \nor right click and follow code in cpu if double clicking doesnt work\n",
            "votes": "1",
            "user": "blabb",
            "time": "Apr 19, 2018 at 12:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}