{
    "title": "Where can I find obfuscated ELF binaries to practice reverse engineering techniques specifically for obfuscated binaries?",
    "link": "https://reverseengineering.stackexchange.com/questions/33076/where-can-i-find-obfuscated-elf-binaries-to-practice-reverse-engineering-techniq",
    "content": "I’m trying to get better at reverse engineering obfuscated code (and malware in general) and I’m looking for already obfuscated binaries with increasing levels of difficulty. I’ve looked a bit on crackmes.one (not extensively), but was hoping for some kind of level-based resource specifically for obfuscated binaries (preferably ELF)\n",
    "votes": "0",
    "answers": 2,
    "views": "137",
    "tags": [
        "elf",
        "deobfuscation",
        "obfuscation",
        "crackme"
    ],
    "user": "tallestllama",
    "time": "Jul 12, 2024 at 2:41",
    "comments": [],
    "answers_data": [
        {
            "content": "The French ANSSI organizes a reverse engineering contest covering different fields: crypto, forensics, hardware, ... It's a good start.\nBinaries and other challenges are available here: https://hackropole.fr/en/challenges/\nI would also recommend playing around and trying to reverse real life malware (in a sandboxed VM of course). You can find plenty of binaries here:\n\nhttps://bazaar.abuse.ch/browse\nhttps://github.com/Endermanch/MalwareDatabase\n\nHappy hacking!\n",
            "votes": "0",
            "user": "yaspr",
            "time": "Jul 12, 2024 at 14:07",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I would add that you can also:\n\nSearch on blogs of cybersecurity companies - they often provide writeups on some malware and add the hash of related executables/files.\nLook for those hashes on VirusTotal. You can download a sample and then deal with a real malware and you'll have a writeup on what it does to help you.\nDo the flareon challenge, it's a nice reversing challenge that can help you learn and get better: https://flare-on.com/\n\nSome additional references:\n\nhttps://virustotal.com\nhttps://www.welivesecurity.com/en/our-experts/eset-research/\n",
            "votes": "0",
            "user": "yaspr",
            "time": "Jul 13, 2024 at 9:36",
            "is_accepted": false,
            "comments": []
        }
    ]
}