{
    "title": "How to manual copy mp4 file?",
    "link": "https://reverseengineering.stackexchange.com/questions/33086/how-to-manual-copy-mp4-file",
    "content": "I have tried using some popular editors like: sublime text, notepad++ to open mp4 file and after copy content of it. After copy, I added the mp4 extension to the newly copied file. As a result, the new mp4 file cannot be opened even though it has the same content as the old file, so what did I miss when copying it, a header for example?\n",
    "votes": "0",
    "answers": 1,
    "views": "58",
    "tags": [
        "file-format",
        "windows-10",
        "filesystem"
    ],
    "user": "QChí Nguyễn",
    "time": "Jul 14, 2024 at 6:27",
    "comments": [
        {
            "user": "Robert",
            "text": "Bad idea. Editors are text editor. MP4 are binary files. Opening and saving binary file in a text editor very often ends up in changes to the content because of charset de-/encoding. Why don't you simply copy the file? If you want to manually edit a file use a hex editor.\n",
            "time": null
        },
        {
            "user": "jsotola",
            "text": "maybe the new file does not have the mp4 extension\n",
            "time": null
        },
        {
            "user": "QChí Nguyễn",
            "text": "The problem is that I have an external ssd drive, but when I copy data from there, I check its content as an old file, but when I open it, it is damaged, it is similar to the above case when I need to copy the content with the editor.\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "Then may be the files have been downloaded e.g. via FTP in text mode (instead of binary mode).\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It is unclear what you are trying to achieve. If you want to copy mp4 or any binary non-printable content as if it was a text file then the closest option is to open the file using a hex editor (ex. HxD for Windows), instead of a text editor like Notepad++.\nThis will not help if the file is damaged in any way.\n",
            "votes": "1",
            "user": "Yotamz",
            "time": "Jul 15, 2024 at 7:41",
            "is_accepted": false,
            "comments": []
        }
    ]
}