{
    "title": "reverse engineering 1MBaud/s HID over I2C follower with misbehaving SCL line",
    "link": "https://reverseengineering.stackexchange.com/questions/33130/reverse-engineering-1mbaud-s-hid-over-i2c-follower-with-misbehaving-scl-line",
    "content": "I am currently reverse engineering a keyboard that utilises a proprietary HID over I2C protocol. I would assume this keyboard to be a follower on the I2C bus. As soon as it is supplied with just power however it sends data on the SDA line. an SCL line is not routed out. i have found the SCL signal that is internally used on the PCB to generate the SDA signal but it is not routed out. This led me to believe that the internal SCL is just used as a fallback to communicate error codes or something. When providing a SCL signal externally the SDA does not synchronise with the provided SCL signal however. Soldering to the internally used SCL would certainly be possible however i would like to avoid that as that requires disassembly that is risky in terms of damaging the product(glue,epoxy etc.).\nThe keyboard uses a 6 pin interface which i assume to be: (SDA,GND,+5V,NRST,SCL,no clue)\nthough i am unsure about the NRST pin as i have not been able to verify continuity to the controller ICs NRST pin due to the markings on the IC having been removed.\nThings i tried so far:\n\nbegin reverse engineering on a dead board i previously broke.\nuse a function generator to manually generate a valid clock signal that was supposed to be synchronised to the SDA line so i can read that out. Failed due to insufficient frequency stability of the SDA line.\nhook up a logic analyzer from the mesozoic era to the circuit. frequency limitations of that logic analyzer.\nsoldering to the dead boards internal SCL and try to fix that board. failed\ntrying to use the SCL line from the dead board as a SCL for the working one by soldering the CLK_ENABLE of the working board to the dead boards SCL generator\nwrite up some code to analyze the traffic on the bus without presence of a SCL signal. failed.\ntry to use the trigger output of my oscilloscope to synchronise my function generator to my SDA line. failed. no clue why.\n\nany help would be greatly appreciated thank you so much for your time!\nPS: i prefer to use follower/conductor instead of master/slave so sorry for the confusion\n",
    "votes": "0",
    "answers": 0,
    "views": "14",
    "tags": [
        "hardware",
        "serial-communication"
    ],
    "user": "user338269",
    "time": "Jul 28, 2024 at 17:15",
    "comments": [],
    "answers_data": []
}