{
    "title": "Dynamic analysis of Android applications' interaction",
    "link": "https://reverseengineering.stackexchange.com/questions/33199/dynamic-analysis-of-android-applications-interaction",
    "content": "There are two or even more Android applications that somehow interact with each other:\nApplication A invokes application B or sends request to it directly or via third application C. I don't have the source code for any of these applications.\nAre there any tools that I can use to perform dynamic analysis of this interaction. Preferably on Windows. I'd like to understand how these application interact.\nI'm thinking about the following scenario.\n\nConnect a physical Android device to a PC\nInitiate the function which involves interaction between the applications\nUse some tool which can show which application/view is currently active on the device\n\nHow is this done? How do I find out which part of application A initiates this interaction. And which part of application B is responsible for serving the request from the application A.\n",
    "votes": "1",
    "answers": 1,
    "views": "51",
    "tags": [
        "debugging",
        "android",
        "dynamic-analysis"
    ],
    "user": "Max",
    "time": "Sep 3, 2024 at 8:13",
    "comments": [],
    "answers_data": [
        {
            "content": "If apps communicate they usually use the <pre><code>Intent</code></pre> system of Android (see Google example Send simple data to other apps).\nOn a rooted device you can hook those calls using Frida and hook the method <pre><code>startActivity</code></pre>/<pre><code>startActivities</code></pre> methods of the Context class in all three apps.\nI would try this command:\n<pre><code>frida-trace -U -f <app package name> -j \"android.content.Context!startActi*\"\n</code></pre>\nfrida-trace will create for each hooked method a .js file in the subdirectory <pre><code>__handlers__</code></pre>. This file contains the logging code that is executed when the method is executed. If the intent argument is not correctly printed you can modify the .js file(s) and change the logging code for e.g. printing sub-elements that are not covered by the standard .toString() implementation. Even modifications are possible.\n",
            "votes": "1",
            "user": "Robert",
            "time": "Sep 4, 2024 at 9:20",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Andrew T.",
                    "text": "<span class=\"comment-copy\">If I'm not mistaken, a standard <code>logcat</code> also lists the fired <code>Intent</code>s, although probably not that detailed.</span>",
                    "time": null
                }
            ]
        }
    ]
}