{
    "title": "In Ghidra, how do I add AddressSpaces, both through the UI and via a Java extension?",
    "link": "https://reverseengineering.stackexchange.com/questions/33221/in-ghidra-how-do-i-add-addressspaces-both-through-the-ui-and-via-a-java-extens",
    "content": "I'm working on Java loaders for the old TI-99/4A microcomputer. As well as the CPU's RAM/ROM address space it has a separate address space for a special TI kind of serial ROM called GROM. (It's actually more complicated than this).\nI want to add the GROM address space for file formats which include bytes that belong in the GROM but I don't understand enough about how Ghidra address spaces work.\nThe docs say multiple address spaces are supported so you can have multiple address <pre><code>0x0000</code></pre> each in their own address space for instance. I have used the \"other\" address space to load file format headers but haven't yet added custom address spaces.\nThere are also overlays. But these are to do with memory blocks, which are parts of an address space. Intuitively this is to me a second way to have multiple blocks of memory that would live in the same address range, but not at the same time. Many OSes supported overlays until roughly the early 32-bit era I think. I believe some platforms also use Ghidra's overlay support for banked RAM and ROM.\nBut are Ghidra's overlays also the way to achieve additional address spaces? What am I missing?\n\nUpdate\nOne thing I was missing is that I don't usually program Java and the constructors are not members of <pre><code>AddressSpace</code></pre>, which is an <pre><code>interface</code></pre>, but are members of its implementations, <pre><code>GenericAddressSpace</code></pre>, <pre><code>OverlayAddressSpace</code></pre>, <pre><code>ProtectedAddressSpace</code></pre>, and <pre><code>SegmentedAddressSpace</code></pre>.\nBut I haven't figured out how to use them yet. I've tried\n<pre><code>AddressSpace addressSpace = new GenericAddressSpace(\n  \"GROM\", // name of the address space\n  16,     // size - number of bits for the address space\n  AddressSpace.TYPE_CODE,\n  0x994);       // a unique ID for the address space (0 to 32767)\n</code></pre>\nBut when I try to add a memory block to it the usual way:\n<pre><code>Address loadAddress = addressSpace.getAddress(0x6000);\n\nprogram.getMemory().createInitializedBlock(\n  entryName,\n  loadAddress,\n  inputStream,\n  size,\n  monitor, false);\n</code></pre>\nresults in the error <pre><code>Block may not be created with unrecognized address space</code></pre>, which doesn't make sense to me. So I'm obviously still missing something.\n\nUpdate 2\nWhile <pre><code>AddressFactory</code></pre> doesn't have a way to add the new <pre><code>AddressSpace</code></pre>, there is also <pre><code>DefaultAddressFactory</code></pre> which has <pre><code>protected void addAddressSpace(AddressSpace space)</code></pre>, but since it's <pre><code>protected</code></pre> I can't call it.\n",
    "votes": "0",
    "answers": 0,
    "views": "37",
    "tags": [
        "ghidra"
    ],
    "user": "hippietrail",
    "time": "Sep 13, 2024 at 8:38",
    "comments": [
        {
            "user": "hippietrail",
            "text": "It seems that in Ghidra, address spaces are a property only of the processor, not of the program or file. I don't know what this implies for platforms with multiple CPU architectures that run simultaneously.\n",
            "time": null
        }
    ],
    "answers_data": []
}