{
    "title": "What is this 2D vector image (file) format?",
    "link": "https://reverseengineering.stackexchange.com/questions/33243/what-is-this-2d-vector-image-file-format",
    "content": "Context: I'm currently re-engineering an old (2015) E-paper display tag just for the fun of it. For the curious ones, I'm using Ghidra to disassemble and decompile, and trying to make up some sense of the results. The tag uses an ARM Cortex M0 based MCU and a 1.44 inch EPD, and receives its display content via NFC.\nAfter receiving some (RLE compressed) KB of data and inflating that data, the application interprets the data. This is my current knowledge about the contents:\n\nThere is potentially a header of 16 bytes ignored by the application.\n\nAfter the header there is an undetermined number of elements. The application stops at the end of the received data.\n\nEach element is marked with a single byte (byte 0 in the table), followed by a length byte (byte 1 in the table, counted without these first two bytes)\n\nAfter these two bytes more bytes can follow, depending on the element's type:\n\n\n\nMy finding so far\nbyte 0(elementtype)\nbyte 1(# of bytesto follow)\nbyte 2\nbyte 3\nbyte 4\nbyte 5\nbyte 6\nbyte 7 ...\n\n\n\n\nset geometry\n0x01\n3\nx offset\ny offset\nrotation(0..3 = 0째/ 90째/ 180째/ 270째)\n-\n-\n-\n\n\ndefine colors\n0x02\n2\ncolor1\ncolor2\n-\n-\n-\n-\n\n\nfill completelywith background color\n0x03\n0\n-\n-\n-\n-\n-\n-\n\n\ninvert image\n0x04\n0\n-\n-\n-\n-\n-\n-\n\n\ndraw line\n0x11\n4\nx1\ny1\nx2\ny2\n-\n-\n\n\ndraw text\n0x12\n#\nx\ny\nfont\nopaque\ncentered\ntext...\n\n\ndraw pixels\n0x13\n#\nx\ny\nw\nh\nbits per pixel\ndata...\n\n\ndraw rectangle\n0x14\n5\nx1\ny1\nx2\ny2\nfilled\n-\n\n\ndraw circle\n0x15\n4\nx\ny\nradius\nfilled\n-\n-\n\n\nstamp image\n0x17\n3\nx\ny\nindex\n-\n-\n-\n\n\nprepare pixel data\n0x20\n#\ndata...\n-\n-\n-\n-\n\n\n\n\n\n\nElement type 0x20 is special. Each data chunk is appended to a buffer. When finally element type 0x13 is used, its data are also appended, and then the whole buffer is the image to draw.\nI spent several hours in web research but could not find any hint. The \"usual suspects\" like CGM, EMF, EPS, SVG, WMF or Gerber do not match. I looked into few others, too.\nWhat (file) format of a (simple) vector graphic is this?\nThe application is a mix of apparently assembler, C, and C++ code. Specifically all drawing functions receive the same pointer, which is certainly <pre><code>this</code></pre>. There is also a function pointer table in the structure pointed to, known as vtable. This makes me conclude that libraries are used.\nCurrently I'm at a bit-block transfer function that supports 16 colours. It can be that this is a proprietary format, but it makes no sense to support more than the two colours of EPDs of that time. That's why I think it is some more generic format.\n",
    "votes": "0",
    "answers": 0,
    "views": "82",
    "tags": [
        "file-format",
        "graphics"
    ],
    "user": "the busybee",
    "time": "Oct 10, 2024 at 19:00",
    "comments": [
        {
            "user": "jsotola",
            "text": "could be custom file format\n",
            "time": null
        },
        {
            "user": "Yotamz",
            "text": "(These are only assumptions). Since the device has a simple display and that basic shapes are specified by a single byte of the protocol I would try to find a correlation between packet bits and the actual visual result. This may be as simple as 1/0 to paint/clear pixel. Expect a checksum of the packet and/or parity bits inbetween.\n",
            "time": null
        },
        {
            "user": "the busybee",
            "text": "@jsotola Thanks for your hint, it's true, however, even though I'm in CS for decades and always learning, I cannot know all file formats. :-D If it is a known file format, it would make my reengineering a lot simpler. Currently I need to interpret each element type's function in detail.\n",
            "time": null
        },
        {
            "user": "the busybee",
            "text": "@Yotamz Thanks for your suggestions, I will surely verify my findings with experiments. Currently the device is still in its code-readout fixture and I still need to find a way to communicate with NFC.\n",
            "time": null
        },
        {
            "user": "Yotamz",
            "text": "True. I meant to say that it may be a common format for this type of embedded device - but not necessarily a well known graphics file format that is seen in PCs (for reducing overhead, memory use etc.). It makes identifying them harder, for lack of headers/magic values and so on\n",
            "time": null
        }
    ],
    "answers_data": []
}