{
    "title": "IDA and hex editor different values",
    "link": "https://reverseengineering.stackexchange.com/questions/33265/ida-and-hex-editor-different-values",
    "content": "Initially I have in IDA value in hex:\n<pre><code>0003EF9B  A1 DC F3 12 00\n</code></pre>\nBut the I looked in hex editor same offset and its different:\n<pre><code>A1-DC-F3-06-00\n</code></pre>\nBut it is half problem.\nIn hex editor I trying change the values:\n<pre><code>0003EF9B  A1 DC F3 12 00\n</code></pre>\nto:\n<pre><code>B8 80 02 00 00\n</code></pre>\n(i.e. I need load to eax value 0x280)\nAfter editing in hex editor, I opened corrected file in IDA, and have difference:\n<pre><code>0003EF9B  B8 DC F3 12 00\n</code></pre>\nWhere 0003EF9B its address in IDA.\nI.e. same values (same address) is different in hex editor and IDA.\nIts ms dos code and uses dos4gw. Program run under dosbox.\nWhy there is difference?\nUPDATED\n1)BEFORE changes\nBefore I made changes in hex editor:\nhttps://i.ibb.co/gjRxW9g/hex1.jpg\nBefore I made changes in IDA (disassembled view):\nhttps://i.ibb.co/qxVhZrN/ida11.jpg\nBefore I made changes in IDA (hex view):\nhttps://i.ibb.co/Qp0qc8M/ida12.jpg\n2)AFTER changes\nAfter I made changes in hex editor:\nhttps://i.ibb.co/NVCd34M/hex2.jpg\nAfter I made changes in IDA (disassembled view):\nhttps://i.ibb.co/TYytDjL/ida21.jpg\nAfter I made changes in IDA (hex view):\nhttps://i.ibb.co/zJ1fcNK/ida22.jpg\n",
    "votes": "0",
    "answers": 0,
    "views": "62",
    "tags": [
        "ida"
    ],
    "user": "black4joss",
    "time": "Oct 18, 2024 at 18:23",
    "comments": [
        {
            "user": "blabb",
            "text": "You are probably looking at different addresses............. have you considered the section alignment versus page alignment  differences into account  ..... Have you checked if all prior and post bytes match  apart from these 5 bytes...... .......if the address is correct in  both. And relocations are accounted for then the bytes MUST be same\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "Which version of IDA do you use? If you want to modify a binary you can do that directly in IDA, no need to use an external hex editor.\n",
            "time": null
        },
        {
            "user": "blabb",
            "text": "In the hexeditor 1st screen shot address is 3xxxxx and in after change address is 5ddxxx. So you mean to say both are same\n",
            "time": null
        },
        {
            "user": "Max",
            "text": "Do you work with LE executable (for exampe, DOS4GW extender used this format). If so, the bytes could be changed by IDA (and dos4gw when it loads application) according to fixup table. More info in documention for LE format, like here: edm2.com/index.php/…\n",
            "time": null
        },
        {
            "user": "Max",
            "text": "I think, you should edit Fixups Record Table. For you task you probably should remove one entry from it.  As for you second IDA screenshots - did you created new IDA database after editing file in hex-editor? As long as I know IDA will not automatically reflect changes - it creates database and later works only with it, you can even delete source EXE file - no problem for IDA.\n",
            "time": null
        }
    ],
    "answers_data": []
}