{
    "title": "Functional CD / DVD / Blueray from Observable Universe Image?",
    "link": "https://reverseengineering.stackexchange.com/questions/33275/functional-cd-dvd-blueray-from-observable-universe-image",
    "content": "I don't personally know enough about CD / DVD / Blueray writers to know how this might be accomplished.  However, I was looking at Wikipedia's article on the Observable Universe and found this image:\nhttps://upload.wikimedia.org/wikipedia/commons/e/e7/Observable_universe_logarithmic_illustration.png\nPersonally, it looks at lot like a CD or DVD.  Does anybody know how that might be scribed onto such media while guaranteeing it could at least be Read available (music, video, or data, whatever might work), just to see if there was anything interesting?  Listen to the Observable Universe spinning on a CD player (or at least an artists high-quality rendering concept).\n",
    "votes": "0",
    "answers": 1,
    "views": "38",
    "tags": [
        "encodings",
        "unknown-data"
    ],
    "user": "G. Putnam",
    "time": "Oct 22, 2024 at 18:46",
    "comments": [
        {
            "user": "Robert",
            "text": "Sorry but I don't see where the relation between your post and Reverse Engineering ist. The posted PNG link is also normal, so so unknown data format is present here.\n",
            "time": null
        },
        {
            "user": "G. Putnam",
            "text": "Ok.  Maybe it's not the correct part of StackExchange.  Was not sure where to post, and trying turn a PNG into a data file on a CD seemed like a Reverse Engineering question at the time.  Maybe try a different forum.\n",
            "time": null
        },
        {
            "user": "Robert",
            "text": "I still don't understand what you want to do. If you want to save an image make an ISO image that contains it and then burn it. If you want to print the image onto the CD  use a CD label and print the image on it.\n",
            "time": null
        },
        {
            "user": "G. Putnam",
            "text": "Nvm.  I found an Instructables article.  This is what I was trying to do, just with the image above.  instructables.com/Burning-Pictures-on-a-Compact-Disc-Surface\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I discovered the answer in an Autodesk Instructable's article on CD burning images.\nBurning Pictures on a Compact Disc Surface\nhttps://www.instructables.com/Burning-Pictures-on-a-Compact-Disc-Surface/\n",
            "votes": "0",
            "user": "G. Putnam",
            "time": "Oct 25, 2024 at 17:55",
            "is_accepted": true,
            "comments": []
        }
    ]
}