{
    "title": "Decrypt PPPoE password of Huawei ONT EG8245H5",
    "link": "https://reverseengineering.stackexchange.com/questions/33296/decrypt-pppoe-password-of-huawei-ont-eg8245h5",
    "content": "i have following model of ISP router and would like to decrypt password so that i can use it on OpenWRT router.\nAs password is encrypted i need a tool to decrypt password so that i can use it as pppoe connection.\nI got similar post here:\nDecrypt PPPoE password of Huawei ONT HG8145V5\nBut there is not tool available online to decode it.\nHere is example password taken from above link:\nbe5ea9e2094a958af22b0110ef2b6899398e2d3122b8cd61b069eac793b13f06\nIt is encoded and have 64 digits, someome in that post have say that decrypted password is: VBEYS03037\nIs there any online tool to enter 64 digits as above example and then when you click button DECODE you get decoded your password?\nIf not, is there script in any programming language that do that?\nThanks!\nP.S. I give above example as i got my password in same 64 digit number so i cant publish encrypted password here so i need tool to decrypt it, above is example so skilled programmers can write script using above example to get desired output and put script here.\n",
    "votes": "1",
    "answers": 0,
    "views": "50",
    "tags": [
        "decryption"
    ],
    "user": "user1949029",
    "time": "Oct 29, 2024 at 16:50",
    "comments": [
        {
            "user": "the busybee",
            "text": "Welcome to SE/RE! Please take the tour to learn how this site works, and read \"How to Ask\" and other pages of the help center. Then come back and edit your question to clarify: Are you aware of hash functions? A 64 digit encoding is most probably the hash of the respective password.\n",
            "time": null
        },
        {
            "user": "the busybee",
            "text": "While you're doing your research, learn how difficult (in terms of effort) it is to find a password with the same hash. These functions are invented to make this as hard as possible, to make it impracticable.\n",
            "time": null
        },
        {
            "user": "user1949029",
            "text": "I found a website that takes as argument hashed password and then using brutal force from Axxxxxxxxxxx to Zxxxxxxxxxx, but it uses GPU as power device that takes 500k hashes per second, if there is 8 letters with digits in passwords it will take 5,5years to find correct hash....huawei hash passwords is sha256(MD5(PASSWORD)), as there is easy to get MD5 to string and real password, hard part is to decode sha256 to md5 as this is the way that password is obtailed. Real question is: HUAWEI router can decrypt this password or send this hashed password throught PPPoE protocol to ISP and then compar\n",
            "time": null
        }
    ],
    "answers_data": []
}