{
    "title": "What is the Win32 function that displays Microsoft \"Pick an account\" popup window?",
    "link": "https://reverseengineering.stackexchange.com/questions/33309/what-is-the-win32-function-that-displays-microsoft-pick-an-account-popup-windo",
    "content": "Which Windows API shows this popup, asking to select Windows user account?\n",
    "votes": "1",
    "answers": 1,
    "views": "122",
    "tags": [
        "windows",
        "winapi"
    ],
    "user": "c00000fd",
    "time": "Nov 18, 2024 at 21:49",
    "comments": [
        {
            "user": "the busybee",
            "text": "Is this the right SE site to ask? How is this connected to reverse engineering?\n",
            "time": null
        },
        {
            "user": "c00000fd",
            "text": "@thebusybee I'm trying to understand what API does this. How else would one do it other then RE it?\n",
            "time": null
        },
        {
            "user": "the busybee",
            "text": "Well, my first stop would be Microsoft's documentation. If I invested some hour without success, I would next use my web search skills. And only if I did enough research, I would consider asking at a SE site, but in this case Stack Overflow, where software and programming questions are welcome.\n",
            "time": null
        },
        {
            "user": "the busybee",
            "text": "Finding the API for a function is not reverse-engineering, it is the daily task of each engineer. So please edit your question to clarify this aspect.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "This is from Microsoft Identity Platform, typically implemented using Microsoft Authentication Library (MSAL).  The oauth or openid process uses tokens and web requests and MSAL makes it simpler to implement these authentication methods.\nThe login popup is embedded webview or can be external browser.\nThis is the function in .net: PublicClientApplication.AcquireTokenInteractive Method\nHere is more info about identity platform: https://learn.microsoft.com/en-us/entra/identity-platform/\nMSAL documentation: https://learn.microsoft.com/en-us/entra/identity-platform/msal-overview\n",
            "votes": "0",
            "user": "jonk",
            "time": "Dec 18, 2024 at 15:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">While this link may answer the question, it is better to include the essential parts of the answer here and provide the link for reference.  Link-only answers can become invalid if the linked page changes. - <a href=\"/review/late-answers/24645\">From Review</a></span>",
                    "time": null
                },
                {
                    "user": "jonk",
                    "text": "<span class=\"comment-copy\">Fair enough.  I will edit the answer to be more specific, my apologies.</span>",
                    "time": null
                },
                {
                    "user": "c00000fd",
                    "text": "<span class=\"comment-copy\">@perror this does not answer my question. It's the technology used, but not the function that is invoked to show that window &lt;- what I was asking.</span>",
                    "time": null
                },
                {
                    "user": "jonk",
                    "text": "<span class=\"comment-copy\">@c00000fd I was the one who answered,  I updated my answer to include AcquireTokeInteractive method.  I put api docs because you had said api in your description, but now i realize the title says specific function.  What are you trying to reverse engineer?  This authentication process is well documented, what is your primary objective?</span>",
                    "time": null
                }
            ]
        }
    ]
}