{
    "title": "How to unlock the ISP-blocked 4th Ethernet port on a 812Gv2 device",
    "link": "https://reverseengineering.stackexchange.com/questions/33318/how-to-unlock-the-isp-blocked-4th-ethernet-port-on-a-812gv2-device",
    "content": "I have a Calix 812Gv2 modem to with an optical \"input\" and 4 Ethernet ports. When my house was built, the ISP agreed with an external supplier that they will route all home's energy consumption in the area to a 3rd party company for data collection + planning. When I moved in, I disconnected the power monitoring MODBUS device from the blocked Ethernet port, and connected it to another LAN port. This way I could access my energy consumption from my Home Assistant on LAN instead of this data being sent out to an unknown company.\nSince then, I wanted to change my network topology and I asked my ISP to unblock this extra Ethernet port so that I wouldn't need to buy an extra switch. However, they unfortunately refused as they are contractually obliged to the 3rd party to keep this port directly routed to them.\nI was looking through the Modem's settings but I could not found obvious routing settings that I could change to free up this port. I have a feeling that this may be blocked in the firmware that I cannot really access. I have not tried factory resetting the device, but I have a feeling that it will simply just default back to the same routing settings. Is there anything I could try to free that port up?\n",
    "votes": "0",
    "answers": 0,
    "views": "49",
    "tags": [
        "router"
    ],
    "user": "davidanderle",
    "time": "Nov 25, 2024 at 20:47",
    "comments": [
        {
            "user": "Robert",
            "text": "My guess is that all packets sent to that port get a special VLAN ID assigned. All packets with that VLAN ID in your ISP network are routed to the 3rd party company.\n",
            "time": null
        },
        {
            "user": "jsotola",
            "text": "you could try flooding the 3rd party port ... send them lots of garbage data\n",
            "time": null
        }
    ],
    "answers_data": []
}