{
    "title": "How to find what app is doing when I press a certain button in the unpacked APK",
    "link": "https://reverseengineering.stackexchange.com/questions/33367/how-to-find-what-app-is-doing-when-i-press-a-certain-button-in-the-unpacked-apk",
    "content": "I will first try to explain what I am trying to accomplish, and then relate that to the question.\nThere is a certain Android app in which you are able to 'plan a trip' (set a start and end point) and then press 'share', which uploads the directions to a server, and then generates a URL that you can share. Now, this company also has a 'web app' that you can use. So if I send you a share link from the app, on a phone (for example if you have the app installed on your phone and click on the link after I text it to you) this URL will open on the app, and on a browser this URL will redirect to another URL in the format the format that the web app uses, but still display the info.\nYou can also generate a link to 'share a trip' on the web app, however unlike the share link on the Android app which does not store any data but rather corresponds to the file where the data is stored on the server, this link has the parameters (longitude, latitude, etc) in the URL. And, share URLs from the web app do not open in the Android app.\nWhat I am trying to do is figure out what happens (i.e. what info is uploaded where) when you press 'share' on the Android app, to see if I can make a script (probably in Python) to generate 'share' links that can open in the Android app (basically, so I can generate a share link for directions from anywhere to anywhere).\nTherefore, my question is, how/where can I find this in an unpacked APK?\n",
    "votes": "1",
    "answers": 1,
    "views": "58",
    "tags": [
        "android",
        "apk",
        "api",
        "api-hacking"
    ],
    "user": "Kovy Jacob",
    "time": "Jan 23 at 15:32",
    "comments": [
        {
            "user": "Andrew T.",
            "text": "On Android.SE: android.stackexchange.com/q/259519/44325\n",
            "time": null
        },
        {
            "user": "the busybee",
            "text": "Even if you find the part in the executable that reacts on the button event, you will have a lot of work to follow the control flow until the URL is generated. Don't you think it would be simpler to watch the IP traffic directly?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I’d suggest starting by decompiling the APK using tools like Apktool or JADX. Then, check the AndroidManifest.xml to identify the activity handling the share action. Look for keywords such as “share”, “Intent.ACTION_SEND”, or “Uri.Builder” in the code to locate the function that builds the URL. Good luck with your script!\n",
            "votes": "0",
            "user": "Jamil Rodriguez Aguilar",
            "time": "Apr 4 at 14:21",
            "is_accepted": false,
            "comments": []
        }
    ]
}