{
    "title": "Should I switch from WinDbg to OllyDbg?",
    "link": "https://reverseengineering.stackexchange.com/questions/3430/should-i-switch-from-windbg-to-ollydbg",
    "content": "I am fairly familiar with WinDbg and didn't know about OllyDbg before. From the statistics in this forum, it seems that OllyDbg is twice as popular as WinDbg. Sometimes WinDbg can be frustrating, so I wonder whether I should switch.\nTo make this question less opinion based, these are my requirements:\n\nbe able to debug .NET. From my research it seems that OllyDbg might not be as good as WinDbg with SOS and SOSEX\ndo scripting. Here it seems OllyDbg is better. There are many scripts archived in a single place, which is not the case for WinDbg.\nanalyze mini dump files. This could be a blocker: while the OllyDbg website states something about post mortem dump, I was unable to find an option to open a dump immediately (File/Open).\nrecord logs of what I'm doing to be able to give it to the customer. From the Google picture search I only see screenshots from registers, memory etc. I have not seen something similar to the WinDbg command output window.\n\nGiven these core requirements, should I give OllyDbg a try?\nVersion information: OllyDbg 2.01\n",
    "votes": "13",
    "answers": 2,
    "views": "3k",
    "tags": [
        "tools",
        "ollydbg",
        "windbg"
    ],
    "user": "Thomas Weller",
    "time": "Jan 11, 2014 at 6:22",
    "comments": [
        {
            "user": "TDKPS",
            "text": "Although this question has already been answered, I believe it's worth mentioning that WinDBG has a python extension called PyKD which might make it easier to automate the desired task -- assuming your problem is also with the scripting interface. It won't solve the existing problem of the availability of scripts, which are more easily available - and in greater quantity - for OdbgScript but that shouldn't keep you away from WinDBG. As already said by Mr. Geffner, it's not enough of a reason to make the change.\n",
            "time": null
        },
        {
            "user": "Thomas Weller",
            "text": "It's true, some tasks can just not be automated good enough, so I'm always looking for extensions or write extensions on my own. Thanks for the suggestion. I downloaded and installed PyKD. Looks promising. I guess Stackoverflow is the place to ask questions about PyKD if I'm in trouble.\n",
            "time": null
        },
        {
            "user": "Polynomial",
            "text": "Third potential: IDA's debugger. Both 32-bit and 64-bit debugging, cross platform, has internal and Python scripting support, and probably does .NET too (I didn't check), and a bunch of other features.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Given your requirements, you'd be much better off sticking with WinDbg.\nOllyDbg doesn't do .NET, nor is it capable of directly analyzing minidumps. It does have the ability to log its run traces, but this is likely not the type of logging that you need.\nOdbgScript is nice, but it sounds like that's not enough of a reason for you to make the change.\n",
            "votes": "10",
            "user": "Jason Geffner",
            "time": "Jan 10, 2014 at 3:00",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "OllyDbg is nice, and it has some cool features but it still doesn't support x64 native debugging on Window (it is in Alpha though!)\nIf you want to debug x64, then WinDbg seems to be the way to go.\n",
            "votes": "1",
            "user": "fileoffset",
            "time": "Jan 13, 2014 at 3:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}