{
    "title": "What other public firmware/reverse engineered alternatives are available to replace stock firmware? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/3437/what-other-public-firmware-reverse-engineered-alternatives-are-available-to-repl",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nRecently I have taken an interested in learning about Linux and the Unix family of operating systems.\nIn my quest to do so I found that my simple home router contained hardware capable of much more than I thought. It was a fully fledged computer running Linux!\nI was able to load both Openwrt and then DD-wrt allowing experimentation with a mini Linux computer.\nIm also aware that there are many other possiblities for router/modem firmware:\nhttps://en.wikipedia.org/wiki/List_of_wireless_router_firmware_projects\nOther projects that give this possibility are:\n\nCyanogenmod (plus many more) for many Android based mobiles  \nFreemyiPod for Apple iPods  \nRockbox for other Mp3 players including iPods\n\n\nWhat other popular projects are available that provide customized firmware or an alternative to proprietary software that can be loaded on to a device?\nIs anyone able to provide a link to any lists of such projects?\n",
    "votes": "1",
    "answers": 0,
    "views": "425",
    "tags": [
        "firmware"
    ],
    "user": "suit",
    "time": "11 years ago",
    "comments": [
        {
            "user": "ekse",
            "text": "This question does not really belong here, you should probably look on the superuser stack overflow, there are already topics about like this one : superuser.com/questions/316177/openwrt-vs-ddwrt?rq=1\n",
            "time": null
        },
        {
            "user": "ekse",
            "text": "This question appears to be off-topic, would be more relevant on the superuser stack exchange\n",
            "time": null
        },
        {
            "user": "suit",
            "text": "Basically I'm looking for other devices I can load reverse engineered/alternative firmware on. I figured the reverse engineering community would have a good idea of current projects. If it is off topic is there a way I can move it?\n",
            "time": null
        },
        {
            "user": "drewbug",
            "text": "@suit There's the Canon Hack Development Kit.\n",
            "time": null
        }
    ],
    "answers_data": []
}