{
    "title": "How do you manage/backup your IDA database? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/3452/how-do-you-manage-backup-your-ida-database",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nRecently I lost an important IDA database. Up until now, I manually made a copy of my work IDB every day, but that's obviously not a good backup technique. I was wondering how do you manage/backup your IDB. Like make a copy of the current IDB every minute or something like that.\n",
    "votes": "8",
    "answers": 1,
    "views": "3k",
    "tags": [
        "ida"
    ],
    "user": "Dominik Antal",
    "time": "11 years ago",
    "comments": [
        {
            "user": "0xC0000022L",
            "text": "AFAIK you'd have to write a plugin for this, although there is a crude (IMO) autosave feature (<pre><code>AUTOSAVE</code></pre> in <pre><code>cfg/idagui.cfg</code></pre>) to make this a meaningful autosave. Simply using an external tool without previously writing the IDB will likely result in a similar situation you're encountering with the IDB from the crashed VM.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "The recently added database snapshot feature allows you to set up periodical snapshots of your database.\n",
            "votes": "10",
            "user": "Igor Skochinsky",
            "time": "Jan 13, 2014 at 17:40",
            "is_accepted": true,
            "comments": [
                {
                    "user": "0xC0000022L",
                    "text": "<span class=\"comment-copy\">how (if at all) is this related to the feature controlled by the <code>AUTOSAVE</code> setting in <code>idagui.cfg</code>? Also, is the hierarchical snapshot feature that Ero suggested implemented? Starting with which version of IDA?</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\"><code>AUTOSAVE</code> only flushes in-memory changes to disk, it does not create a complete database copy. Hierarchical snapshots were in the initial release (6.2).</span>",
                    "time": null
                }
            ]
        }
    ]
}