{
    "title": "64 bit Pseudocode decompiler",
    "link": "https://reverseengineering.stackexchange.com/questions/3594/64-bit-pseudocode-decompiler",
    "content": "I have a 64 bit program im debugging. \nI found the function i need to learn more about to potentially \"fix\" the problem (there is no source code available for the program).\nTo speed  things up, i wanted to decompile and go over it in pseudocode  as my assembler is still quite weak.\nHowever i did not find any working solutions that would work with x64.\nI am using only x64 windows platform so linux/mac solutions wont work (hopper is only 32 bit on windows).\nHex-rays is x86 as well.\nThere was ida-decompiler python scripts that i didn't get to work no matter what i did ( no output or pseudocode was generated).\nIs there any other solutions i could try that does support x64 and has pseudocode support?\n",
    "votes": "4",
    "answers": 2,
    "views": "19k",
    "tags": [
        "tools",
        "decompiler",
        "x86-64"
    ],
    "user": "Agony",
    "time": "Feb 2, 2014 at 3:40",
    "comments": [
        {
            "user": "Agony",
            "text": "Hopper only provides x86 version for windows which is no good for decompiling x64. Im using pseudo code together with assembler.\n",
            "time": null
        },
        {
            "user": "mrexodia",
            "text": "Try x64dbg with snowman. The output isn't always great though, especially on bigger functions...\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Try C4Decompiler and REC Studio 4.\n",
            "votes": "5",
            "user": "CassOnMars",
            "time": "Dec 12, 2016 at 7:23",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Agony",
                    "text": "<span class=\"comment-copy\">Indeed Rec Studio worked. C4Decompiler however  failed - it started to cause insane mounts of ram, which end up with some serious user account corruption that forced me to clone my account to a new one.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Meanwhile Hex Rays does have an x64 Decompiler (adding this answer for people reading now, at the time of Jason's answer the decompiler was not yet available), see the news page:\n\n2014/06/04    The x64 decompiler has arrived!\n\nAnd from the order page:\n\nThe Decompiler software is available for 5 platforms: x86, x64, ARM32,\n  ARM64, and PowerPC. While x64, ARM64, and PowerPC decompilers can run\n  only on top of IDA Pro, the x86 and ARM32 decompilers can run on top\n  of both IDA Starter or IDA Pro\n",
            "votes": "2",
            "user": "Remko",
            "time": "Dec 13, 2016 at 9:28",
            "is_accepted": false,
            "comments": []
        }
    ]
}