{
    "title": "How to use cycript to investigate a mach-o x86_64 binary?",
    "link": "https://reverseengineering.stackexchange.com/questions/3668/how-to-use-cycript-to-investigate-a-mach-o-x86-64-binary",
    "content": "I recently found out about a tool called cycript that apparently does runtime analysis of binaries written with Objective-C.  I have a Mac OS X binary that is compiled as x86_64 and is intended to run on Intel Macs.  I know cycript is intended to for iOS applications but I wouldn't mind using it on this binary to poke around and see what is going on inside the binary.  Most instructions I see for cycript state to start off with UIApp, and then investigating further objects from there.\nMy problem is when I try to investigate UIApp with cycript I get the following error message,\n<pre><code>ReferenceError: hasProperty callback returned true for a property that doesn't exist.</code></pre>\nI am assuming I am getting this error message because the binary does not have a UIApp class / method in it because it is a Mac OS X binary and not an iOS.\nWhere would be a good starting point for using cycript with a Mac OS X binary?\n",
    "votes": "2",
    "answers": 1,
    "views": "1k",
    "tags": [
        "osx"
    ],
    "user": "ipatch",
    "time": "Feb 12, 2014 at 17:11",
    "comments": [],
    "answers_data": [
        {
            "content": "<pre><code>UIApp</code></pre> is a shorthand for <pre><code>[UIApplication sharedApplication]</code></pre>.\nAs this is not an iOS app, but an OS X app you need to use <pre><code>[NSApplication sharedApplication]</code></pre> instead.\n",
            "votes": "3",
            "user": "Tyilo",
            "time": "Feb 13, 2014 at 4:51",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Charlton P",
                    "text": "<span class=\"comment-copy\">Similarly to <code>UIApp</code>, You can also use <code>NSApp</code> as shorthand for <code>[NSApplication sharedApplication]</code> <a href=\"https://developer.apple.com/documentation/appkit/nsapplication/nsapp\" rel=\"nofollow noreferrer\">developer.apple.com/documentation/appkit/nsapplication/nsapp</a></span>",
                    "time": null
                }
            ]
        }
    ]
}