{
    "title": "How to force IDA to analyze a packed exe after the program has unpacked itself?",
    "link": "https://reverseengineering.stackexchange.com/questions/3689/how-to-force-ida-to-analyze-a-packed-exe-after-the-program-has-unpacked-itself",
    "content": "I know it is a very newbie question and sorry about that, but I can't really find any way how to make IDA analyze the code after the unpacking was done. What I mean is that when I unpack an exe and dump it to a new exe file (using another software, not IDA), and then load the unpacked exe in IDA, everything works fine (all the API calls are recognized etc). But when I load the unpacked exe in IDA and put a bp on OEP, I just finish with \"unscanned\" code and don't know how to ask IDA to scan it and recognize the API calls. Thank you in advance for any help and tips.\n",
    "votes": "3",
    "answers": 2,
    "views": "18k",
    "tags": [
        "ida",
        "unpacking"
    ],
    "user": "Krzysztof Bracha",
    "time": "Feb 15, 2014 at 11:25",
    "comments": [
        {
            "user": "w s",
            "text": "Did you try Options-->General-->Analysis-->Reanalyze program ?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "After you have finished unpacking the program and get to the OEP\nFile --> Plugins --> Universal Unpacker Manual Reconstruct\nFill in the info if its not correct :)\nOk, edit for free version:\nHeres what I have done to get the program re-analyzed:\nUPX packed notepad.exe (easy to unpack)\n\nloaded packed file into freshly installed IDA Pro Free 5.0\n\nunpacked via debugger till got to OEP\n\nOnce unpacked click: Debugger --> Take memory snapshot --> All memory?(maybe not all is needed, i used all, as i wanted to see if it would work)\n\nTerminate process\n\nGo to OEP and pressed \"c\" to create some of the code\n\nOptions-->General-->Analysis-->Reanalyze program (As suggested above)\n\nWait forever to reanalyze\n\nOEP is of course not recognized, but the unpacking is done and some? / all? of the code is recognized by IDA.\nprobably not the best way to do it, but free edition seems a bit limited. probably best do it via olly and load a dump into ida.  :(\n",
            "votes": "8",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Krzysztof Bracha",
                    "text": "<span class=\"comment-copy\">Thanks for answer, that would definitely solve the problem if I had Ida Pro. So I guess there isn't any solution for Ida Pro Free? It's quite annoying, OllyDbg doesn't have any problems to comment the code after reaching the OEP, so why couldn't Ida automatically do this? Btw. I don't need any unpacking support/plugins, just would like to make Ida reanalyzing the code..</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "For me, just clicking\n<pre><code>Options - General - Analysis - Reanalyze program\n</code></pre>\nbutton solved problem.\n",
            "votes": "1",
            "user": "lartist",
            "time": "Feb 19, 2019 at 3:21",
            "is_accepted": false,
            "comments": []
        }
    ]
}