{
    "title": "Patch a Java class inside a jar using C# [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/3741/patch-a-java-class-inside-a-jar-using-c",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions on software development are off-topic here, but can be asked on Stack Overflow.\n\n\nClosed 11 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nBeing a beginner in C# I wonder if it is possible to patch a .class file inside a .jar?\nSince jar files tend to act like \"zip\" files, the approach I think might work is to decompress the jar, patch the hex offset in the *.class then zip back the jar and overwrite the original.\nAny examples or tutorials showing how to do this? is there a better approach?\n",
    "votes": "1",
    "answers": 2,
    "views": "992",
    "tags": [
        "java",
        "hex",
        "patching",
        "jar",
        "c#"
    ],
    "user": "numediaweb",
    "time": "11 years ago",
    "comments": [
        {
            "user": "Antimony",
            "text": "I don't think that makes much sense. Just extract the data, modify, and reinsert it.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "Where is the connection between Java and C# in this question? And if this is a C# question, how is it RCE-related?\n",
            "time": null
        },
        {
            "user": "numediaweb",
            "text": "@0xC0000022L If I understood you comment; the connection is that I need to patch a class inside a jar file! not an exe file nor an image file... why C# because the app I'm developing is written in C#. Why; because I want to learn C# :). Second thing; It is related to RCE because I'm \"patching\" an offset adress rather than modifying the original code.. maybe I should have put it in the main stackoverflow forum but I taught it belong to this forum.\n",
            "time": null
        },
        {
            "user": "0xec",
            "text": "If you were writing the app in Java you could have used the BCEL library. However, you could use IKVM to use the java library from C#\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "There are three ways to do this:\n\nDecompile the content of the JAR, make your changes to the decompiled source code, recompile the sources, and rebuild the JAR. This works well if the CLASS files aren't obfuscated or overly complex.\nAs you answered in your question, you could extract the CLASS, hex edit it to make your changes, and add it back into the JAR with a tool like WinZip, WinRAR, or 7-zip.\nUse the Java Virtual Machine Tools Interface to dynamically patch the program at runtime.\n\nUnclear from your question what this has to do with C#, though.\n",
            "votes": "2",
            "user": "Jason Geffner",
            "time": "Feb 22, 2014 at 22:24",
            "is_accepted": true,
            "comments": [
                {
                    "user": "numediaweb",
                    "text": "<span class=\"comment-copy\">In the title; Patch a Java class inside a jar using C#. Maybe I should have posted this question in another forum.. Anyway I found the solution. Thanks</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">After reading your answer at <a href=\"http://reverseengineering.stackexchange.com/a/3744/1562\">reverseengineering.stackexchange.com/a/3744/1562</a>, it sounds like your question was a software development question, not a reverse engineering question.</span>",
                    "time": null
                },
                {
                    "user": "numediaweb",
                    "text": "<span class=\"comment-copy\">I think that too, I was mislead by the forum titles.. Anyway, thanks for the answer.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">No problem. I'll leave the answer up in case someone in the future asks the question I thought you were asking ;)</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "After some more research I found this tutorial and this answer about patching class files inside jars using the SharpZipLib library.\n",
            "votes": "0",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}