{
    "title": "Transfer function names from one IDA DB to another",
    "link": "https://reverseengineering.stackexchange.com/questions/3806/transfer-function-names-from-one-ida-db-to-another",
    "content": "Do anyone know about an automatic way to transfer function names from one IDA file to another while:\n\nFirst IDA file is based on version 1 of the executable.\nSecond IDA file is based on the updated, version 2, of the same executable.\n\nI'm aware of Zynamics BinDiff. I'm looking for alternatives.\n",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "code-modeling"
    ],
    "user": "PhoeniX",
    "time": "Mar 8, 2014 at 12:05",
    "comments": [
        {
            "user": "PhoeniX",
            "text": "FYI in \"Tools to work cooperatively on the same binary\" there are only tools list, but no explicit information regarding the asked question. If you think differently, please point where specifically in the \"Tools to work cooperatively on the same binary\" there is the answer to my question.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can use MyNav. In this video you can check how it can be done with this tool.\n",
            "votes": "2",
            "user": "joxeankoret",
            "time": "Mar 6, 2014 at 13:14",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Anton Kukoba",
                    "text": "<span class=\"comment-copy\">Hello Joxean Koret,  could you update your plugin <a href=\"https://github.com/joxeankoret/mynav\" rel=\"nofollow noreferrer\">github.com/joxeankoret/mynav</a> to make it work in IDA 7.x. Because currently it doesn't run:  mynav.py: undefined function __plugins__mynav.PLUGIN_ENTRY</span>",
                    "time": null
                },
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">There is no need anymore to use MyNav as almost every part of the functionality is integrated into IDA, especially the Differential Debugging part. Actually, I added it myself. Take a look to <a href=\"https://www.hex-rays.com/products/ida/support/tutorials/replayer/trace_replayer.pdf\" rel=\"nofollow noreferrer\">this</a>. If what you want is to port symbols, use Diaphora (<a href=\"https://github.com/joxeankoret/diaphora\" rel=\"nofollow noreferrer\">github.com/joxeankoret/diaphora</a>) or YaDiff.</span>",
                    "time": null
                },
                {
                    "user": "Anton Kukoba",
                    "text": "<span class=\"comment-copy\">I need to transfer symbols from one IDA database into another IDA database with the same module. I have IDA database for the exe file and a crash dump which I load to IDA. So I would like to load symbols for that exe, which I already reversed in a separated database into crash dump analysis in another IDA. Seems like diaphora can't do that: diaphora_import.py just loads structures, not the function names. :(</span>",
                    "time": null
                },
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">You need to export both databases and diff them... Take a look to this blog: <a href=\"http://www.alex-ionescu.com/?p=271\" rel=\"nofollow noreferrer\">alex-ionescu.com/?p=271</a></span>",
                    "time": null
                },
                {
                    "user": "Anton Kukoba",
                    "text": "<span class=\"comment-copy\">so I can't just simply move the names, I need to export all the assembler instructions and meta and then make a diff just to transfer the names... For 300 mb idb file just exporting to sqlite takes 30 minutes.</span>",
                    "time": null
                }
            ]
        }
    ]
}