{
    "title": "How to find SPI pads (4 of them) on a logic board?",
    "link": "https://reverseengineering.stackexchange.com/questions/3814/how-to-find-spi-pads-4-of-them-on-a-logic-board",
    "content": "I have a logic board with 20 pads accessible on it.  I know 2 of the 20 pads are UART (TX / RX) and one pad appears to reset the device when connecting a multi meter to it, so I presume that has something to do with JTAG.  From what I have read to interface with an SPI bus it requires 4 wires.  The 4 wires being,\n\nMOSI (Master Out Slave In) \nMISO (Master In Slave Out)\nSCLK (Serial Clock)\nSS (Slave Select)\n\nNow with that understanding, how would one determine which of the remaining pads on the device correspond to the 4 wires of the SPI bus?  I am assuming that there is a SPI bus interface amongst these 17 remaining pads.  How would I determine which four of seventeen remaining pads are associated with the SPI bus?  I have access to a logic analyzer if that helps :/\n",
    "votes": "2",
    "answers": 2,
    "views": "1k",
    "tags": [
        "hardware",
        "spi"
    ],
    "user": "ipatch",
    "time": "Mar 9, 2014 at 0:27",
    "comments": [
        {
            "user": "nneonneo",
            "text": "Is it an SPI slave or an SPI master?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "If the board is a functional unit and not just a board with a single SOC on it, your best bet is probably to find small pin-count devices such as serial EEPROMs or an SDCard connector that have a SPI interface and known pinout and trace back from there.  \nAlternatively, you can proceed by process of elimination since there are 17 pins, and you can probably figure out which ones are power and ground and clock, which probably leaves about 13 pins.  If you can power the device and observe it in action, simply checking for activity on the lines may help if you can assure that the SPI bus is actually active.  It's also frequently true that the four pins are in close proximity, so that may help as well.\n",
            "votes": "2",
            "user": "Edward",
            "time": "Jun 7, 2014 at 12:17",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "You could try to find the clock line first, but only if connected and used by something. Then you go to Google Images and look how data is correlated to clock etc. Alternatively you can try to find the lines on the other \"end\" which are perhaps fewer.\nMuch better idea is to tell us what device you have or upload a picture if you don't know. Btw. On what basis did you make that assumption? \nPS. This was meant as a comment, but I don't have the required Rep.\n",
            "votes": "0",
            "user": "not2qubit",
            "time": "Mar 8, 2014 at 2:38",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ipatch",
                    "text": "<span class=\"comment-copy\">What assumption are you talking about?</span>",
                    "time": null
                },
                {
                    "user": "not2qubit",
                    "text": "<span class=\"comment-copy\">About there actually being an SPI present among the 17...</span>",
                    "time": null
                },
                {
                    "user": "ipatch",
                    "text": "<span class=\"comment-copy\">Oh, because there's 17 pads, and I read some of the datasheet for the SoC</span>",
                    "time": null
                }
            ]
        }
    ]
}