{
    "title": "IDA Can't load symbols \"DIA: No such interface supported\"",
    "link": "https://reverseengineering.stackexchange.com/questions/3836/ida-cant-load-symbols-dia-no-such-interface-supported",
    "content": "I'm trying to load symbols for a dll with IDA pro.\n<pre><code>My _NT_SYMBOL_PATH is SRV*c:\\symbols*http://msdl.microsoft.com/download/symbols .\n</code></pre>\nI put <pre><code>DBGTOOLS = \"C:\\\\Program Files (x86)\\\\Windows Kits\\\\8.1\\\\Debuggers\\x86\\\\\"</code></pre> in my <pre><code>ida.cfg</code></pre> \nI modified IDA's <pre><code>symsrv.dll</code></pre> and <pre><code>symsrv.yes</code></pre> so as to put the one of the WinDbg folder instead.\nThe problem is that if I load my dll, I see no symbols and get this error message : \n<pre><code>\"PDB: could not process file D:\\Dangerous\\Share\\Direct2D x86\\d2d1.dll with DIA: No such interface supported\"\n</code></pre>\nThere is no way to get symbols from the server. However, I load some symbols manually using the symbols that I can download on my msdnaa account. The problem is that I've got several different version of d2d1.dll. My symbols are for the dll present just after the OS installation. As I update my OS and then remove some specific update so as to diff dll that were changed, my symbols are not the correct one anymore. \nWhat did I do wrong? How could I get the correct symbols for each version?\n",
    "votes": "4",
    "answers": 1,
    "views": "4k",
    "tags": [
        "ida",
        "debugging-symbols",
        "pdb"
    ],
    "user": "MPX",
    "time": "Mar 16, 2014 at 15:33",
    "comments": [],
    "answers_data": [
        {
            "content": "I finally solved my problem. \nDIA stands for Debug Interface Access and is the component used to correctly read PDB files. \nThe msdia90.dll used doesn't seem to have been installed with the VS 2013 redistributables. \nI had to install the 2008 redistributables to get the correct dll. \nI solved my problem thanks to http://download.tuxfamily.org/overclokblog/PDB%20ain%27t%20PDD/0vercl0k_pdb_aint_pdd.pdf\n",
            "votes": "4",
            "user": "MPX",
            "time": "Mar 12, 2014 at 22:22",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Simon Mourier",
                    "text": "<span class=\"comment-copy\">IDA is pretty dumb as it doesn't know how to use more recent DIA SDK that ship with Visual Studio 2017, 2019, etc. It absolutely requires the old version that ships with VS 2008 redist <a href=\"https://www.microsoft.com/en-US/download/confirmation.aspx?id=15336\" rel=\"nofollow noreferrer\">microsoft.com/en-US/download/confirmation.aspx?id=15336</a></span>",
                    "time": null
                }
            ]
        }
    ]
}