{
    "title": "Editing a Mach-O x86_64 binary with 0xED results in a app crash",
    "link": "https://reverseengineering.stackexchange.com/questions/3872/editing-a-mach-o-x86-64-binary-with-0xed-results-in-a-app-crash",
    "content": "I created a simple Cocoa app (Mac 64bit) in Xcode, and in it I created a string object, and then outputted the contents of the string in a NSLog statement.\n\nThen I decided to see if I could modify the contents of the binary (exe) in the .app directory of the application.  I used 0xED to change, This is my string. to This is my new string.  I did this by typing the word new in the right portion of the 0xED editor.\n\nFinally, I saved the file, then tried to launch it, but it appears to crash.  The crash report appears somewhat cryptic to me, so I am not exactly sure why the app is crashing.\n",
    "votes": "3",
    "answers": 1,
    "views": "1k",
    "tags": [
        "mach-o",
        "patch-reversing"
    ],
    "user": "ipatch",
    "time": "Feb 11, 2021 at 19:41",
    "comments": [
        {
            "user": "SSpoke",
            "text": "Maybe you didn't modify the string by pressing <pre><code>Insert key</code></pre> first..\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Code before <pre><code>This is my string</code></pre> relies on addresses/offsets of data (and possibly code) after <pre><code>This is my string</code></pre>. When you insert the string <pre><code>new</code></pre>, you're effectively shifting the code/data after <pre><code>This is my string</code></pre> to the right by 4 bytes. When code before <pre><code>This is my string</code></pre> tries to access that content, it access the wrong content since the location has been shifted.\n",
            "votes": "3",
            "user": "Jason Geffner",
            "time": "Mar 14, 2014 at 21:25",
            "is_accepted": true,
            "comments": [
                {
                    "user": "ipatch",
                    "text": "<span class=\"comment-copy\">Is there a proper a way to insert bits using a hex editor to prevent the crash from happening?</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">In this context, no. You can likely overwrite data here without incurring any problems. But if you want to make larger changes to the text, you'd need to add the new text to the end of the program (or write it into an unused area) and then patch the code so that it references the new text instead of the old text.</span>",
                    "time": null
                },
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">.. or, alternatively, create a much larger string -- large enough to be edited without these problems. Note, however, that some executable formats do some sort of self-check with a checksum. Can't recall if Mac OS/Macho/ELF files do this, though.</span>",
                    "time": null
                }
            ]
        }
    ]
}