{
    "title": "Is there a good reference for COM object signatures?",
    "link": "https://reverseengineering.stackexchange.com/questions/3/is-there-a-good-reference-for-com-object-signatures",
    "content": "When doing RE on some Microsoft binaries I run across COM object references all the time.  Is there a good central place to translate some of the GUID's that I find to some sort of object type without having to follow it back to some known parent (if I am lucky?).  Would there be interest in establishing such a repository?\n",
    "votes": "15",
    "answers": 2,
    "views": "419",
    "tags": [
        "windows"
    ],
    "user": "Modoc",
    "time": "Mar 27, 2013 at 17:50",
    "comments": [],
    "answers_data": [
        {
            "content": "There is such a list here:\nhttp://mikolajapp.appspot.com/uuid/uuidmap\nIf you use IDA, consider enabling the COM Helper plugin. When you create an instance of a <pre><code>GUID</code></pre> structure, it checks the list loaded from cfg/clsid.cfg and, if a match found, renames the location automatically and tries to import \"<pre><code><Classname>Vtbl</code></pre>\" structure from the loaded type libraries, so you can start using that structure to identify called methods.\nHere's a short demo:\n",
            "votes": "16",
            "user": "Igor Skochinsky",
            "time": "Mar 19, 2013 at 21:17",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Modoc",
                    "text": "<span class=\"comment-copy\">Thanks for the reply Igor.  Do you know if there are any type libraries out there for some of the COM objects not typically public in the Microsoft Symbols (such as IE and some of the more specialized Win32k and Office objects).  I have RE'd a lot of them the hard way and it would be nice if there was somewhere that I could give back so that other people wouldn't have to go through the same pain.</span>",
                    "time": null
                },
                {
                    "user": "Igor Skochinsky",
                    "text": "<span class=\"comment-copy\">Nope, never heard of anything like that.</span>",
                    "time": null
                },
                {
                    "user": "SamB",
                    "text": "<span class=\"comment-copy\">Unfortunately, <a href=\"http://mikolajapp.appspot.com/\" rel=\"nofollow noreferrer\">mikolajapp.appspot.com</a> seems to have broken at some point: it still responds to HTTP requests, but seems to give 404 no matter what you ask for.  (It gives me the distinct impression that it got wiped and never re-deployed.)  There's a slight possibility that some archive service managed to snag a copy of the downloadable version, but I did not manage to discover one.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I don't know of any repository but the Ole/COM Object Viewer (oleview.exe) does a lot of the dereferencing in a reasonably convenient way. I think it comes with most Visual Studios and is in various Windows resource kits.\n",
            "votes": "7",
            "user": "Jim Wasson",
            "time": "Mar 19, 2013 at 20:32",
            "is_accepted": false,
            "comments": [
                {
                    "user": "SamB",
                    "text": "<span class=\"comment-copy\">Um, could you be more specific? Where do I a paste the GUID for which to search?</span>",
                    "time": null
                }
            ]
        }
    ]
}