{
    "title": "Ollydbg breakpoint causing application to perform differently without BP being hit",
    "link": "https://reverseengineering.stackexchange.com/questions/4008/ollydbg-breakpoint-causing-application-to-perform-differently-without-bp-being-h",
    "content": "For the sake of this question I am going to simplify things. Basically I have a CMP that is comparing a memory address to a constant value. I want to change the constant value to force a match.\nI tried changing the constant value by hex editing and changing the value in ollydbg. Both methods cause the application to behave in an undesirable way so there must be a double check which checks the constant value. I have not found this second check yet.\nNow this is where it gets interesting, if I set a BP with ollydbg on the CMP command without changing anything the application behaves as if there was a change. I have confirmed this multiple times, I do not even have to stop or restart the application, once a BP is set the application behaves in a very distinguishable way and then returns to normal as soon as I remove the BP. This BP is never being hit! I have done some further testing and this only happens if the BP is set on the CMP command or the following 2 commands which are a JE and a MOV\nSo I am wondering what does ollydbg write to memory to set a BP? and is this detectable?\n",
    "votes": "1",
    "answers": 1,
    "views": "422",
    "tags": [
        "ollydbg",
        "memory"
    ],
    "user": "GuYY",
    "time": "Apr 2, 2014 at 16:29",
    "comments": [],
    "answers_data": [
        {
            "content": "So I am wondering what does ollydbg write to memory to set a BP? and\n  is this detectable?\n\nBy default, OllyDbg overwrites the beginning of an instruction with <pre><code>INT 3</code></pre> (machine code <pre><code>0xCC</code></pre>) for a software breakpoint (though it hides this from your view in order to simplify things). This is configurable in OllyDbg v2, which allows you to instead use <pre><code>INT 1</code></pre>, <pre><code>HLT</code></pre>, <pre><code>CLI</code></pre>, etc. for software breakpoints.\nBoth OllyDbg v1 and OllyDbg v2 allow you to use hardware breakpoints or memory breakpoints instead of software breakpoints. All three types of breakpoints are detectable by the debuggee.\n",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Apr 2, 2014 at 16:38",
            "is_accepted": true,
            "comments": []
        }
    ]
}