{
    "title": "Tools to show the registers and memory locations in use during execution?",
    "link": "https://reverseengineering.stackexchange.com/questions/4203/tools-to-show-the-registers-and-memory-locations-in-use-during-execution",
    "content": "I am looking for something that is like <pre><code>gdb</code></pre> but maybe with a GUI that can show all registers current values ans the current values of memory and things on the stack?  Freeware is preferred.  I have a free version of IDA and anything that comes with Kali Linux.  It is an ELF file that is stripped.\n",
    "votes": "4",
    "answers": 4,
    "views": "2k",
    "tags": [
        "ida",
        "disassembly",
        "decompilation",
        "binary-analysis",
        "gdb"
    ],
    "user": null,
    "time": "Jul 25, 2014 at 15:25",
    "comments": [],
    "answers_data": [
        {
            "content": "Perhaps you should try <pre><code>DDD</code></pre>. It's a <pre><code>GUI</code></pre> for <pre><code>GDB</code></pre> with lots of great features that simplify debugging for beginners & experts too. I have to warn you though, if your binary is stripped what matters most is the methodology. Most debuggers are extremely efficient if debug symbols are present (in case of an <pre><code>ELF</code></pre>, the <pre><code>DWARF</code></pre> is what you need to check). Without debug symbols all you can do is go through the code step by step, setting breakpoints at locations where the assembly code seems to be interesting. \nYou must know that reverse engineering is a challenge, not an easy task, and that there's no such thing as a magic tool. All the tools rely on algorithm which are not, unfortunately, flawless. Disassemblers can fail, decompilers can stumble upon patterns they can't turn into high-level code, and so on and so forth.\nYou have to develop a methodology which you'll have to adapt with experience. That's how you'll be able to forge good reversing skills. Meanwhile, the forum is open for questions, hopefully as precise & concise as the answers.\n",
            "votes": "3",
            "user": "yaspr",
            "time": "Apr 29, 2014 at 21:09",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user4466",
                    "text": "<span class=\"comment-copy\">Thanks. This is a project our digital forensics teacher gave us and he obfuscated everything so the decompiling didn't help me.  Is there anyway we could communicate so I could pitch you ideas etc besides stackexchange?  I am looking for a mentor/guide for this project I do not need or want someone to give me answers I just want someone who I could bounce ideas off of. williamDOTkochATusmaDOTedu or could you point me to a good forum or google group or something where I could get help?</span>",
                    "time": null
                },
                {
                    "user": "yaspr",
                    "text": "<span class=\"comment-copy\">There's a chat on stackexchange but you need at least 20 reps to join !</span>",
                    "time": null
                },
                {
                    "user": "user4466",
                    "text": "<span class=\"comment-copy\">want to vote up some of my stuff so I can get reputation points.  I got banned from asking stackoverflow questions and I only asked 3 or 4 and even after fixing up my posts I was still blocked!</span>",
                    "time": null
                },
                {
                    "user": "yaspr",
                    "text": "<span class=\"comment-copy\">Well, there are rules &amp; some people are tight ! I sent you an email.</span>",
                    "time": null
                },
                {
                    "user": "gandolf",
                    "text": "<span class=\"comment-copy\">You can also try out radare.org Its a full reverse engineering suite equipped with a debugger, and its open source.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "gdb has a \n<pre><code>text user interface \n</code></pre>\ncan be activated with <pre><code>layout</code></pre> command in a running instance of gdb or with <pre><code>--tui</code></pre> command line switch while starting\nwill show registers and assembly  \nthis would be the most cheapest option i guess:)  \nthe following commands should provide an over view tui\nlayout split ; layout regs ; layout asm ; layout src ;layout next; layout prev;\napart from the already mentioned DDD\nEDB with Qt framework can be checked out EDB (EVANS Debugger)\n",
            "votes": "2",
            "user": "blabb",
            "time": "Apr 29, 2014 at 21:39",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "PEDA is a gdb plugin that can display the current process status:\n\nstack content\nregister content\ninstructions near the program counter\n\nThe output is pretty and colored.\n\nThere are loads of other features such as finding ROP gadget, showing elf headers, showing the enabled mitigations (ASLR, DEP, RELRO, ...)\n",
            "votes": "2",
            "user": "toasted_flakes",
            "time": "Jul 25, 2014 at 18:50",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "cgdb is a curses based gdb interface that may be worth looking at: \nhttps://cgdb.github.io/\n",
            "votes": "1",
            "user": "Fred Concklin",
            "time": "Jul 30, 2014 at 3:15",
            "is_accepted": false,
            "comments": []
        }
    ]
}