{
    "title": "Need help with how I am going to make a usb microprocessor work",
    "link": "https://reverseengineering.stackexchange.com/questions/4224/need-help-with-how-i-am-going-to-make-a-usb-microprocessor-work",
    "content": "I have a really big question... It will be pretty straightforward.\nFirst the problem:\nI attend a class for programming, and my teacher one day brought in a usb cannon bearing a close resemblance to this http://www.thinkgeek.com/product/8a0f/#tabs . He said that if we can make it fire, he will award me .5 bit coins, and I'm still in High school, and a fairly new programmer at that. I only know the basics of C#, and I'm not that far into the total world of programming.\nNow what I need:\nSo far I was wondering how I will make it fire?\nI need to know how to access the cannon through USB (What programs to use),\nhow will I program it ( or interact with it. Not sure if I program it to fire, because it already has the firmware in the cannon, but I need to know how to activate it), and I overall need to know how to overcome this challenge, even though I am a newer person.\nAt first, I looked at this as a way to get a few quick dollars, but now I'm seriously interested. It's a challenge, and it's really fun to try to find out how to do it. However, I don't know where to go from here. I researched to the best of my ability, and tried to understand how chips work, and even how USB's work. I still have yet to find a way to do this though.\nCan you help me by providing me the basics of how to program/initiate the codes; tell me what software I will need, how I will communicate with the firmware, and try to make this thing fire?\n",
    "votes": "0",
    "answers": 1,
    "views": "130",
    "tags": [
        "assembly"
    ],
    "user": "Jack",
    "time": "May 1, 2014 at 4:22",
    "comments": [
        {
            "user": "Ange",
            "text": "\"I want to earn .5 BTC - please do my homework\"\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You can use existing libraries in many languages. For example, many open-source projects are available on these sites :\n\n<pre><code>C#</code></pre> : https://code.google.com/p/thunder-missile-api/\n<pre><code>Python</code></pre> : http://www.rkblog.rk.edu.pl/w/p/controlling-usb-missile-launchers-python/\n\nEnjoy!\n",
            "votes": "3",
            "user": "ixje",
            "time": "May 2, 2014 at 5:16",
            "is_accepted": false,
            "comments": []
        }
    ]
}