{
    "title": "OllyDBG causes executables saved by it to ask for administrator privileges when run",
    "link": "https://reverseengineering.stackexchange.com/questions/4381/ollydbg-causes-executables-saved-by-it-to-ask-for-administrator-privileges-when",
    "content": "Whenever I save an executable in OllyDBG (Right-click, Copy to executable, All modifications then Save File), the saved executable asks for administrator privileges when I run it.\nI tried opening OllyDBG as a regular user and then saving the file, but no luck. I also tried manipulating the file's permissions, but no luck either.\nIs there a way to save a file so that regular users can run it?\n",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ollydbg",
        "executable"
    ],
    "user": "LmnICE",
    "time": "May 20, 2014 at 3:56",
    "comments": [
        {
            "user": "DOD",
            "text": "Does this binary before modification need administrator privileges when you run it?\n",
            "time": null
        },
        {
            "user": "helloworld",
            "text": "Maybe target executable is located in C:\\ or other place with RW access only for administrators?\n",
            "time": null
        },
        {
            "user": "Dominik Antal",
            "text": "Is is possible you patched something, that will cause this?\n",
            "time": null
        },
        {
            "user": "LmnICE",
            "text": "@DOD, no, it's a program that is supposed to be run by any user.\n",
            "time": null
        },
        {
            "user": "LmnICE",
            "text": "@helloworld, indeed it is (Program Files directory), but I tried changing the save path to the Desktop, and it still asks for admin privileges before running.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "UAC has certain heuristics that will cause a file to request elevation unless a manifest exists that states otherwise. Such heuristics include files that seem to be setup programs for some software. But there are more heuristics and other situations where elevation is assumed to be required.\nIf the executable has no manifest, you need to add one. Otherwise you may have to modify the existing one.\nYou can tell by loading it into a resource editor or resource viewer such as:\n\nhttp://www.angusj.com/resourcehacker/\nhttp://www.resedit.net/\n\n... and so on. Check out the answers to this question: Freely available resource hacking applications ...\nWorkarounds are:\n\nthis can be done by setting the value <pre><code>level=\"asInvoker\"</code></pre> in element <pre><code>requestedExecutionLevel</code></pre> of the manifest (see here and more generally here and here)\nor if you don't have the requirement that the file be saved and can instead provide a script to launch it, you can set an environment variable (<pre><code>set __COMPAT_LAYER=RUNASINVOKER</code></pre>) as explained here\n\nUnfortunately this is somewhat of a science to get right.\n",
            "votes": "1",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": [
                {
                    "user": "LmnICE",
                    "text": "<span class=\"comment-copy\">This is very helpful, thank you. Setting the level attribute in the requestedExecutionLevel element worked. There was a much easier fix though: the filename of the binary was original_patched.exe, which tripped the UAC heuristics you mentioned. So all I had to do was rename the file. Interestingly, setting the manifest correctly trumped the UAC heuristics.</span>",
                    "time": null
                }
            ]
        }
    ]
}