{
    "title": "IDA Pro 6.4 android_server processattach failed",
    "link": "https://reverseengineering.stackexchange.com/questions/4383/ida-pro-6-4-android-server-processattach-failed",
    "content": "I would like to ask if anyone knows how to solve the above mentioned problem I encounter. I was reverse engineering an apk, and met a part where static analysis with IDA Pro is not enough, so I thought that I could use the android_server provided by IDA Pro to debug the .so library during runtime. However, I kept getting an error from IDA Pro when trying to attach to any process within my emulator: 'The debugger could not attach to the selected process. This can perhaps indicate the process was just terminated, or that you don't have the necessary privileges.' I used adb to push the android_server to my emulator, and then used adb shell and executed the script as root, but I'm still having this error. Any ideas on what am I doing wrong? Thanks in advance!\n",
    "votes": "6",
    "answers": 2,
    "views": "3k",
    "tags": [
        "ida",
        "debugging",
        "android"
    ],
    "user": "csharpnewbie",
    "time": "May 20, 2014 at 8:35",
    "comments": [],
    "answers_data": [
        {
            "content": "As mentioned, you have pushed the android_server to your emulator and executed it. So I guess you may forget forward your data from your development machine to your emulator.\nAs you executed the android_server, you can see <pre><code>Listening on 0.0.0.0:23946...</code></pre> in your emulator, which means android_server could kown what it should do by getting information from the emulator's port 23946.\nNow, you need transfer the information from IDA to your emulator.\nTo do this, you need:\n\nIn IDA, click <pre><code>Debugger</code></pre> -> <pre><code>Select Debugger</code></pre>, choose a debugger accroding to your condition. For me, I choose Remote Linux Debugger.\n\nClick  <pre><code>Debugger</code></pre> -> <pre><code>Process Options</code></pre>, and set hostname to 127.0.0.1, then set  port to 23946 or some other port you want, which your IDA could use to send information.\n\nIn your development machine, as Windows, open cmd or powershell, enter <pre><code>adb forward tcp:23946 tcp:23946</code></pre>, so that your IDA can send data to your android_server. For more details for adb forward, please see https://developer.android.com/studio/command-line/adb#forwardports\n\nIf fortunately, now, in IDA, click <pre><code>Debugger</code></pre> -> <pre><code>Attach to process</code></pre>, you may see the processes list, which means success.\n",
            "votes": "2",
            "user": "C JT",
            "time": "Sep 13, 2022 at 1:11",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I saw such issue in following situations:\n\nWhen you run <pre><code>android_server</code></pre> as non-root user (without prior call to <pre><code>su</code></pre>).\nWhen you run it with wrong working directory (as '/data/local/tmp/android_server<pre><code>instead of</code></pre>cd /data/local/tmp/ && ./android_server`).\n\nSo, please make you sure that you do everything exactly in correct way:\n<pre><code>su\ncd /data/local/tmp\n./android_server\n</code></pre>\nOtherwise it may not work.\n",
            "votes": "0",
            "user": "Vitalii",
            "time": "Dec 3, 2018 at 20:53",
            "is_accepted": false,
            "comments": []
        }
    ]
}