{
    "title": "HASP implementation details [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/4441/hasp-implementation-details",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 10 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI realize this is a huge question but any insight you can provide will be much appreciated. OK, let's consider a file protected/wrapped by HASP.\nWhat's the general layout of said file? There's a HASP API that's embedded. Is it easily identifiable, i.e. more or less a full module, or is it cut up and distributed throughout the file?\nWhen the file is started, is it decoded in its entirety or does it employ a decode/re-encode scheme? How does it move between layers in the decoder?\nWhat are the passive protections of HASP (e.g. import redirection)?\nWhat are the active protections of HASP (e.g. IsDebuggerPresent())?\n",
    "votes": "0",
    "answers": 1,
    "views": "597",
    "tags": [
        "unpacking",
        "anti-debugging"
    ],
    "user": "ows",
    "time": "10 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "i was involved in black-box identification of HASPs some years back (actually when i was  student). What we supposed to do was \"sniff\" the ports to see what data went back-n-forth between the application and the dongle, then try to simulate it or maybe model some function after it. However the basic task was to check the data transference. i remember there were software (HASP testers) which could already do much of this job.\nWhen you have the data map and where in the api these are processed (using a debugger) it could make it easier.\nEach applicatioon can use its own way of communicating with the HASP (although there are canned routines and modules also)\nDoes this help you?\n",
            "votes": "1",
            "user": "Nikos M.",
            "time": "May 25, 2014 at 2:14",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ows",
                    "text": "<span class=\"comment-copy\">MITM is more of a general approach and doesn't really answer any of my questions. Also, I'd imagine it would be difficult to map the entire set of queries/answers by just passively listening in. You would probably need to provoke the more rare queries into being sent to have some decent progress?</span>",
                    "time": null
                },
                {
                    "user": "Nikos M.",
                    "text": "<span class=\"comment-copy\">yes true, as i said this was many years back, maybe someone can post a better answer</span>",
                    "time": null
                },
                {
                    "user": "Nikos M.",
                    "text": "<span class=\"comment-copy\">There was a book some years back called \"Hacking the Xbox\", i presume (havent read it) that some techniques there might be useful as it deals with both hardware and software. i am almost sure there are other books on similar topics</span>",
                    "time": null
                }
            ]
        }
    ]
}