{
    "title": "What implications has the low alignment mode of a PE file?",
    "link": "https://reverseengineering.stackexchange.com/questions/4457/what-implications-has-the-low-alignment-mode-of-a-pe-file",
    "content": "I only found this term \"low alignment mode\" in the corkami wiki.\n\n\nstandard mode: 200 <= FileAlignment <= SectionAlignment and 1000 <= SectionAlignment\nlow alignment: 1 <= FileAlignment = SectionAlignment <= 800\n\n\nThe numbers are hex values.\nSome possible implications are described by ReversingLabs \nIt seems low alignment is necessary to make the PE Header writable. However, FileAlignment and SectionAlignment have to be lower than or equal to 200h, which is more restrictive than the low alignment mode above. So I am not sure if this is really a consequence of low alignment or if low alignment mode is just one part of that trick.  \nIn addition it seems that the virtual addresses have to be equal to the physical ones.\nI would like to understand this better.\nMy questions are: What implications has the low alignment mode? How is the way changed the loader loads the PE? Why is it that way?\n",
    "votes": "3",
    "answers": 1,
    "views": "720",
    "tags": [
        "pe"
    ],
    "user": "Karsten Hahn",
    "time": "May 27, 2014 at 7:27",
    "comments": [],
    "answers_data": [
        {
            "content": "A writable header is a side-effect of the low alignment.  More interestingly, an executable header is possible, too, bypassing DEP restrictions even when set to enable for all processes.  That allows code to execute directly from the header, which would normally not be allowed.  When used for a DLL, the ImageBase can become the entrypoint (i.e. call LoadLibrary; call eax), which might be a bit unexpected.\nOther implications include that some tools cannot disassemble or dump such files properly.  A low alignment allows for the creation of very small files (as small as 268 bytes on 64-bit or 255 bytes on 32-bit Vista and later systems (XP allows the file to be 233 bytes long)), by overlapping the tables, and even removing all of the sections.  This small size has been proven to be sufficient for a downloader.\n",
            "votes": "2",
            "user": "peter ferrie",
            "time": "May 28, 2014 at 16:15",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Karsten Hahn",
                    "text": "<span class=\"comment-copy\">What is the purpose of low alignment mode? Why does it exist?</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">it exists to reduce the memory footprint for drivers, in particular, by allowing more sections to fit into a single page, with less padding.</span>",
                    "time": null
                }
            ]
        }
    ]
}