{
    "title": "How can force free part of memory in process? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/4502/how-can-force-free-part-of-memory-in-process",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions on software development are off-topic here, but can be asked on Stack Overflow.\n\n\nClosed 10 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI need to allocate in Special address. How can I force free parts of the memory to be allocated in the process ?\n<pre><code>ZwFreeVirtualMemory(0,(LPVOID*)&(ImageBase),&(SizeOfImage),MEM_RELEASE );\n</code></pre>\n",
    "votes": "1",
    "answers": 1,
    "views": "99",
    "tags": [
        "memory",
        "pe"
    ],
    "user": "user2522767",
    "time": "10 years ago",
    "comments": [
        {
            "user": "peter ferrie",
            "text": "This question appears to be off-topic because it is about a primarily malware-specific development technique, of unmapping the original process entirely in order to replace it with a new one.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You could do that by attaching a debugger to the process and call the function from within the debugger. But, as this would invalidate all pointers from your application into that force-free'd area, your application would crash as soon as it tries to dereference one of that pointers.\nThe only way to make sure you can allocate a specific memory location is allocating it as soon as possible in your program, before anything else takes it away.\nPlease, when you post, tell us a bit more about what you want to do and why you want to do it. There's generally no good reason to allocate a specific address in virtual memory, but there might be reasons to have a map for a specific physical address if there's hardware at that address.\nSo i assume your question is an X-Y Problem, and your real question is \"How can i allocate a chunk of virtual memory that maps to a certain physical address\". But without any context, it's impossible to know how to help you.\n",
            "votes": "1",
            "user": "Guntram Blohm",
            "time": "Jun 2, 2014 at 9:07",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user2522767",
                    "text": "<span class=\"comment-copy\">in need this work in my program and i cant doing in another process.</span>",
                    "time": null
                }
            ]
        }
    ]
}