{
    "title": "Reversing .Net CLR exceptions handlers chain",
    "link": "https://reverseengineering.stackexchange.com/questions/4519/reversing-net-clr-exceptions-handlers-chain",
    "content": "I investigating .Net Framework JITter compilation results and I want to get programmatically exceptions handlers chain. May be somebody can help me with this investigation? \nTo make task easier, I debug following code:\n<pre><code>class Program\n{\n    static void Main(string[] args) { MethodA(); }\n\n    static void MethodA() { MethodB(); }\n\n    static void MethodB() \n    {\n        try { MethodC(); } \n          catch (Exception exception)  { MethodC(); }\n    }\n\n    static void MethodC() { MethodD(); }\n\n    static void MethodD()\n    {\n        try { MethodE(); }\n          catch (Exception exception) { MethodE(); }\n    }\n\n    static void MethodE() { throw new Exception(); }\n}\n</code></pre>\nWhat's found?\n\nJITter uses standart way to build stack frames (locals, <pre><code>EBP</code></pre>, <pre><code>EIP</code></pre>, params)\nFirst parameters moves to method via registers (fastcall)\nWhere is try-catch-finally ? I have no idea. Really. Method have no any code to deregister last handler from chain.\nStatic methods pushes to stack only <pre><code>EBP</code></pre> and <pre><code>EIP</code></pre>. This means, stack cannot contain chain and chain is out of stack.\n\nWhat I use: MS Visual Studio 2010, SOS extension for resolving .Net objects and metadata by address. VMMap to understand, what type of memory page by given address and (hehe) MS OneNote to mark memory dump with different colors to mark as resolved (that means, I understand what I found)\nI'll be happy to understand where is this chain, but I have no experience to do it.\nImportant note: CLR don't uses SEH for exceptions (many articles, where authors write about SEH in CLR lies. CLR only wraps SEH to translate its exceptions into CLR types)\n",
    "votes": "8",
    "answers": 1,
    "views": "528",
    "tags": [
        "disassembly",
        ".net"
    ],
    "user": "Alexus",
    "time": "Jun 4, 2014 at 7:36",
    "comments": [
        {
            "user": "mikalai",
            "text": "I assume stackoverflow.com/q/19111108/731115 could help you.\n",
            "time": null
        },
        {
            "user": "Alexus",
            "text": "Thx, but I looking for complex answer. Like in SEH (Structured Exceptions Handling): to obtain chain head, we need to read FS:0, where we will find.......\n",
            "time": null
        },
        {
            "user": "mikalai",
            "text": "As it's a very narrow domain, I'd suggest searching at clr-relared resources - there is a very little chance you'll get the answer here..\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I can't tell you straight up how it works but maybe this will help find the answer.\nFirstly you want to be debugging on the CLR level - this is all about the CLR instructions that correspond to your code and how they install new exception handlers. Once you can do it in the debugger you can automate using the CLR debugging API.\nhttp://msdn.microsoft.com/en-gb/library/vstudio/bb397953(v=vs.100).aspx\n\"The CLR debugging services provide several ways to control the execution of a program. These include breakpoints, single stepping, exception notification, function evaluation, and other events that relate to the startup and shutdown of a program.\"\nBasically if you can understand the mechanisms of installing a new handler and looking up the handler when an exception is raised, then you can expand from there. Maybe this api will help maybe not.\n",
            "votes": "1",
            "user": "offbyseveral",
            "time": "Jun 26, 2014 at 22:45",
            "is_accepted": false,
            "comments": []
        }
    ]
}