{
    "title": "Corpus Distillation",
    "link": "https://reverseengineering.stackexchange.com/questions/4568/corpus-distillation",
    "content": "Anyone know of any tools or scripts that can help in corpus distillation ? I know of Peach Minset, but not other than that. Appreciate if anyone could share.\n",
    "votes": "4",
    "answers": 2,
    "views": "1k",
    "tags": [
        "tools",
        "fuzzing"
    ],
    "user": "d123",
    "time": "Jun 9, 2014 at 22:01",
    "comments": [],
    "answers_data": [
        {
            "content": "Some time ago I wrote minblox for that exact purpose. It relies on DynamoRIO. Compared to minset which uses pin tool, there isn't much of a difference. Tho I think actual set minimization part works faster than minset. \nMinblox tool is comprised of two parts.\n\nA DynamoRIO instrumentation part (libbbcoverage) tasked with recording all basic block executed during application execution.\nminblox.py - Python script that runs the DynamoRIO instrumentation and analyzes the log files to minimize the sample set.\n\nThough, do bear in mind that I've only tested this for a specific case I needed it, so your mileage might vary.\n",
            "votes": "3",
            "user": "0xea",
            "time": "Jun 9, 2014 at 17:29",
            "is_accepted": true,
            "comments": [
                {
                    "user": "joxeankoret",
                    "text": "<span class=\"comment-copy\">Why you didn't use the DrCov tool and then parse the (text format) log files? Just out of curiosity.</span>",
                    "time": null
                },
                {
                    "user": "d123",
                    "text": "<span class=\"comment-copy\">Sweet Thanks 0xea! Will definitely have a look at that :)</span>",
                    "time": null
                },
                {
                    "user": "d123",
                    "text": "<span class=\"comment-copy\">What about using Valgrind with Call grind to look at basic blocks? Have either of you tried this method?</span>",
                    "time": null
                },
                {
                    "user": "0xea",
                    "text": "<span class=\"comment-copy\">@joxeankoret no particular reason, wrote it as a test...</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "As far as I know, there is nothing like this public. However, you can use DrCov and do yourself the same thing as Minset does and even more powerful things. Indeed, I commonly use this DynamoRIO's tool, DrCov, for doing this exact same thing and others.\n",
            "votes": "1",
            "user": "joxeankoret",
            "time": "Jun 9, 2014 at 16:45",
            "is_accepted": false,
            "comments": [
                {
                    "user": "d123",
                    "text": "<span class=\"comment-copy\">Thanks joxean! ps. shout out from Syscan '14. Great talk :)</span>",
                    "time": null
                }
            ]
        }
    ]
}