{
    "title": "Storing a value by using the ADD and SUB assembly operation. Why?",
    "link": "https://reverseengineering.stackexchange.com/questions/4587/storing-a-value-by-using-the-add-and-sub-assembly-operation-why",
    "content": "I have the following assembly line(I also added a C code implementation how I would do it in C):\n<pre><code>     .................\nA:   MOVSX EAX, BYTE PTR DS:[ECX]     |   while(ecx != NULL){\n     ADD EDX, EAX                     |   \n     INC ECX                          |   char *eaxPtr = *ecx;\n     CMP BYTE PTR DS:[ECX], 0x0       |   int  edxValue += *(int *)eaxPtr;\n     JNZ SHORT A                      |   ecx++;\n     ADD EDX,0xB                      |\n     MOV EAX,EDX                      |   }\n     SUB EAX,0xB                      |   int eaxValue = edxValue;\n     RETN                             |\n</code></pre>\nThe thing is that I have stored the string \"30;,;1,73,:2\" in the register ECX. What the routine above does is to go through the string and add the components of the string like 30 or the ANSCII representation of for example ; and so on in the register EDX. \nAs result, I have the value 00000264 in EDX. \nWhat I do not understand is the end of the assembly line. Especially the lines: \n<pre><code>     ADD EDX,0xB                      \n     MOV EAX,EDX                      \n     SUB EAX,0xB \n</code></pre>\nWhy we first add 0xB to the register edx, then store it to eax, and then subtract 0xB from eax ?\nThe whole is equivalent to the line: \n<pre><code>     MOV EAX,EDX\n</code></pre>\nDoes somebody know why the compiler do it like that ? Because of optimization ? Or there any other reasons?\nBy the way: Is my C code implementation correct ?\n",
    "votes": "2",
    "answers": 2,
    "views": "1k",
    "tags": [
        "assembly"
    ],
    "user": "user3097712",
    "time": "Jun 10, 2014 at 17:45",
    "comments": [],
    "answers_data": [
        {
            "content": "The assembler code you posted is a do-while loop, not a while loop. I guess there's a few instructions in front of it that belong to the function but which you didn't post.\nUnfortunately, you didn't post the preceding instructions, so we can just assume there was something there. For example, the programmer might have wanted to return -11 as an error code for an empty string, as in:\n<pre><code>int sum=0;\nif (*ecx) {\n    do {\n        sum+=*ecx;\n        ecx++;\n    } while (*ecx != '\\0');\n    sum+=11;\n}\nreturn sum-11;\n</code></pre>\nHowever, this is guesswork, because your code doesn't show the if condition.\nHow anyone would want to write his sourcecode like this, i don't know.\nI could think of three reasons for the compiler to produce this code:\n\nNo optimizations at all, and source code like mine above\nIntelligent avoidance of a conditional jump (these are evil because the processor instruction pipeline must be cleared if branch prediction fails), although i can't imagine a source code that would use it here.\nOptimization for space. Replace, in my example above, the <pre><code>sum+=11</code></pre> with <pre><code>return sum</code></pre>. This would translate into a <pre><code>MOV EAX, EDX</code></pre> and <pre><code>RETN</code></pre>. <pre><code>ADD EDX, 0XB</code></pre> needs a byte less and accomplishes the same.\n\nEdit: I just tested it: <pre><code>MOV EAX, EDX</code></pre> and <pre><code>RETN</code></pre> need 3 bytes, <pre><code>ADD EDX, 0xB</code></pre> needs 3 bytes as well. So Optimization for space is not an issue here.\n",
            "votes": "1",
            "user": "Guntram Blohm",
            "time": "Jun 10, 2014 at 18:40",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "The other answer is good and relatively complete, but there may be one other reason such code is used, and that is to obfuscate the code for the purpose of helping to prove future patent infringement or copyright violation.  Because it's certainly not a usual way to do this operation, any code which duplicates it verbatim would likely be used in a court of law as evidence of copying.  \nSee this article on software watermarking for a survey of current techniques and motivations for using them.\n",
            "votes": "1",
            "user": "Edward",
            "time": "Jun 11, 2014 at 14:45",
            "is_accepted": false,
            "comments": []
        }
    ]
}