{
    "title": "Automatically convert x86 assembly to C",
    "link": "https://reverseengineering.stackexchange.com/questions/4642/automatically-convert-x86-assembly-to-c",
    "content": "Just started out with x86 assembly and slowly getting the hang of it. IDA produces nice graphs that make it much easier to follow all the jumps and function calls and stuff.\nI've looked at examples of arithmetics, control flow, loops, and function calls, and feel that I could reasonably take a chunk of instructions and reproduce the same logic in Java or C.\nAre there tools that will automatically take assembly and convert it to, say, C? I imagine for some people that at some point it becomes more of a chore than an exercise after doing it for years.\n",
    "votes": "5",
    "answers": 2,
    "views": "28k",
    "tags": [
        "disassembly",
        "x86"
    ],
    "user": "MxLDevs",
    "time": "Jun 19, 2014 at 21:16",
    "comments": [
        {
            "user": "MxLDevs",
            "text": "An example I saw before is a simple XOR encryption algorithm that used a 64 KB key for some reason. That's not something you want to type out manually...\n",
            "time": null
        },
        {
            "user": "perror",
            "text": "Decompilation is not that simple, the most complex thing is about rebuilding the high-level structures of the program that have been lost during the compilation process (variables, functions, modules/classes, ...).\n",
            "time": null
        },
        {
            "user": "MxLDevs",
            "text": "@perror I'm thinking more along the lines of subroutines and low-level structures. For example, after digging around with a debugger I've pinpointed the exact set of subroutines that perform a certain operation, and that is all that I need. Oh except there are a million instructions involved.\n",
            "time": null
        },
        {
            "user": "Paul",
            "text": "You can use decompiler in IDA to produce a C file. It's not included in free version of IDA though.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Yes, that type of tool is called a decompiler\nSeveral examples below:\n\nHex-Rays Decompiler\nHopper\nREC Studio\nSmartDec\nRetargetable Decompiler\n",
            "votes": "12",
            "user": "Vladislav Ivanov",
            "time": "Mar 8, 2017 at 17:26",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "There's also asm2c that works on assembly source code instead of executables or objects files.\n\nSwift tool to transform DOS/PMODEW 386 TASM Assembly code to C code\n",
            "votes": "0",
            "user": "franck",
            "time": "Mar 8, 2017 at 9:39",
            "is_accepted": false,
            "comments": []
        }
    ]
}