{
    "title": "Exploit Development with python",
    "link": "https://reverseengineering.stackexchange.com/questions/4651/exploit-development-with-python",
    "content": "Are there any libraries to help developing exploits in python, like representing hex string or assembling/disassembling x86 instructions?\n",
    "votes": "1",
    "answers": 3,
    "views": "8k",
    "tags": [
        "exploit"
    ],
    "user": "user3286303",
    "time": "Jun 23, 2014 at 13:12",
    "comments": [
        {
            "user": "Ange",
            "text": "this is a very broad question... (representing hex or disassembling just takes a few lines)\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "if you want to develop exploits in Python, this book may help: \nhttp://my.safaribooksonline.com/book/-/9781597497299/chapter-9-exploitation-scripting/building_exploits_with_python\nIf you need to generate big chunks of asm PeachPy might help: \nPeachPy https://github.com/Maratyszcza/PeachPy\nYou can also compile python to C, and use a C compiler to get things down to assembly\nhttps://stackoverflow.com/questions/10660266/python-program-into-a-standard-assembly\nOr you could write most of your program in Python, and use a variety of methods to get inline assembly in: \nhttps://stackoverflow.com/questions/6040932/executing-assembler-code-with-python\nThat means less asm for you.\nTo be honest, you will be better of rolling with the punches and properly learning ASM. It is hard, but well worth the trouble. Try starting with NASM, or writing inline assembly with your visual studio programs. \nAlso: This question is a little too broad for this site.\n",
            "votes": "4",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user3286303",
                    "text": "<span class=\"comment-copy\">I already intermeddate and basic asm but i don't program in in it</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "There is a bunch of python libraries that can aid you in exercising exploitation:\n\nPeda - Python Exploit Development Assistance for GDB\n\nPeda has this nice option for generating exploit skeletons. Everything is already set up for you for making a basic exploit, either local or remote. And it serves as a rather nice gdb extension.\n\nBlasty's moneyshot is also a set of rather useful utilities. \n\nA collection of python scripts to aid you in the final steps of binary exploitation or during the construction of buffers.\n\nHellman's libformatstr is a nice format string automation exploitation library and it already comes embedded in previous two.\n\nAlso, if all you really need is packing/manipulating binary data, python's struct library is a must. \nThere's also Pyhton Arsenal For RE list of libraries covering many more useful libraries.\n",
            "votes": "2",
            "user": "0xea",
            "time": "Jun 20, 2014 at 16:27",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user3286303",
                    "text": "<span class=\"comment-copy\">Thanks guys for libaries really made life easier for me when pwning binarys</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I've been using pydbg for the last 2+ years to great success. Its used by various popular fuzzing suites such as Sulley, PaiMei, etc. \nAlso, the capstone disassembly framework is highly suggested, especially the op_access functionality as it helps with taint analysis. Keep in mind the application binary interface (ABI) of the platform you're developing exploits on. If its x86/x64, remember certain instructions will flag different unecessary registers as read/written to.\nAs an example, \n<pre><code>rep movs* \n</code></pre>\nIs used by various functions, especially on WindowsXP+. \nThe capstone disassembly framework will state that ecx, edi and esi are ALL read and written to, which means you'll have to write logic to deduce if certain instructions like the aforementioned ACTUALLY read/write to registers. Obviously, ESI and ECX aren't written to in that instruction. Usually compilers will specify the number of bytes to read in the previous insruction, e.g.\n<pre><code>mov ecx, 0x##\n</code></pre>\nHowever, for ~80% of instructions it will give accurate information (EFLAGS not withstanding).\nIt should take a few days or a week depending on free time to write logic to determine if a register is actually accessed. \nI'm only assuming the basic instruction set is what you need, not FPU, SIMD, SSE, etc. If you RE malware, packed or optimized binaries, you will need to add logic for the aforementioned and more instruction sets\n",
            "votes": "0",
            "user": "grepNstepN",
            "time": "Jun 25, 2016 at 19:24",
            "is_accepted": false,
            "comments": []
        }
    ]
}