{
    "title": "Win7 ASLR bypass",
    "link": "https://reverseengineering.stackexchange.com/questions/4703/win7-aslr-bypass",
    "content": "The conditions: say one patched programm has hardcoded address of <pre><code>printf()</code></pre> from dynamically loaded <pre><code>msvcrt80.dll</code></pre>. It works just fine on XP, but Win7 randomizes address space (ASLR), so this trick become impossible and program crashes with call of my hardcoded <pre><code>printf()</code></pre> address.\nWhat should I do to retrieve IAT RVA of this <pre><code>printf()</code></pre> in win7 to make this work?\n",
    "votes": "2",
    "answers": 1,
    "views": "862",
    "tags": [
        "windows",
        "exploit"
    ],
    "user": "see ya",
    "time": "Jul 26, 2014 at 2:43",
    "comments": [
        {
            "user": "Stolas",
            "text": "Are you looking for ASLR bypassing by finding User32.dll and load GetProcAddr + LoadLibrary or do you want to walk your import table to find the already imported printf function?\n",
            "time": null
        },
        {
            "user": "see ya",
            "text": "No, I dont need GetProcAdress. Both addresses considered known, but this dont help much. After <pre><code>call RVA(IAT+function)</code></pre> for some reason execution goes on, interpreting <pre><code>RVA(IAT+function)+4</code></pre> as opcode and here is application crash.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "If you can patch the program's image, you don't actually need to hardcode the address. you can simply add another import entry to the already existing import tables and have it patched in automatically by the loader.\nSee Iczelion's tutorial on import tables to guide you further.\nOf course, if you're trying to do that from shellcode, you'll need to walk the loader data, locating the DLL image. The <pre><code>Ldr</code></pre> member in PEB should help you with that.\nIf you'd be so kind to provide more details on what exactly you are trying to do, I'll update the answer; there is no simple answer to the \"how to defeat ASLR\" question.\n",
            "votes": "5",
            "user": "Dmitry Janushkevich",
            "time": "Jun 27, 2014 at 7:02",
            "is_accepted": true,
            "comments": []
        }
    ]
}