{
    "title": "Can EiNSTeiN \"ida-decompiler\" be linked into The IDA Free version?",
    "link": "https://reverseengineering.stackexchange.com/questions/4729/can-einstein-ida-decompiler-be-linked-into-the-ida-free-version",
    "content": "Is it possible to change the configuration of IDA Free so that Python may be\nlinked into it to allow Python plugins to be used also?\nAnd, does anyone know if the EiNSTeiN ida-decompiler works under IDA Free?\nI read that ida-decompiler is for versions of IDA \"without hex-rays\" decompiler.\nI found reference on the web that IDA Free is \"version 5.0\" however when\nstarted, the IDA Free startup logo says IDA v6.1 at the bottom.\n",
    "votes": "4",
    "answers": 1,
    "views": "722",
    "tags": [
        "decompiler"
    ],
    "user": "user4069",
    "time": "Jun 28, 2014 at 19:02",
    "comments": [
        {
            "user": "Willem Hengeveld",
            "text": "EINSTeiN did not write a decompiler, he wrote a python wrapper for the decompiler api. so you can script the hex-rays decompiler from idapython\n",
            "time": null
        },
        {
            "user": "Simeon Pilgrim",
            "text": "@Willem it sure appears to be a simple decompler verse a wrapper to Hex-rays. At least the section talking about SSA seemed real to me.\n",
            "time": null
        },
        {
            "user": "Willem Hengeveld",
            "text": "ah, you are right, i thought you referred to github.com/EiNSTeiN-/hexrays-python,  while you are talking about a different project: github.com/EiNSTeiN-/ida-decompiler\n",
            "time": null
        },
        {
            "user": "Willem Hengeveld",
            "text": "idapython can be installed with the ida66 demo version.   the ida-decompiler script needs pyside,  so you may need to install that in your python installation.\n",
            "time": null
        },
        {
            "user": "Willem Hengeveld",
            "text": "idapython binaries can be downloaded here: code.google.com/p/idapython\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I have spoken to people that have rewritten the DLL export table of plugins to make them work with the IDA Free 5.0. As it runs plugins but the dll import is via ordinal not name and the name ordinal table has been mixed up. You can see this by looking at them in DependencyWalker. \nIMHO this goes against the spirt of the free version.\n",
            "votes": "2",
            "user": "Simeon Pilgrim",
            "time": "Jun 29, 2014 at 1:51",
            "is_accepted": false,
            "comments": []
        }
    ]
}