{
    "title": "Any guides on modern assembly? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/4734/any-guides-on-modern-assembly",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions on software development are off-topic here, but can be asked on Stack Overflow.\n\n\nClosed 10 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI am trying to understand assembly and buffer overflows on a 64bit Intel i7 machine. I am having a lot of questions. I asked on SO but I don't have any satisfactory answers. I also don't get why there are <pre><code>MOV</code></pre> instructions to EEDI, ESI and EDI instead of <pre><code>PUSH</code></pre> instructions. Perhaps I should understand assembly on modern architectures first. Can anyone answer my qustions and point me to right learning resources for modern architectures? (I am asking here because people doing REing do have knowledge about assembly and are more targeted audience as compared to the broader audience on SO)\n",
    "votes": "0",
    "answers": 2,
    "views": "183",
    "tags": [
        "assembly"
    ],
    "user": "Pervy Sage",
    "time": "10 years ago",
    "comments": [
        {
            "user": "Simeon Pilgrim",
            "text": "They answers seemed good to me on SO. I think you just failed to understand them.\n",
            "time": null
        },
        {
            "user": "Simeon Pilgrim",
            "text": "I'm down voting at it's not really a RE question and you got answers on SO and you could have asked for clarification over there.\n",
            "time": null
        },
        {
            "user": "Pervy Sage",
            "text": "Ok. Thanks. I'll try to understand it. But I asked a lot of questions and I was told only about what's CFI and CFA. :-/\n",
            "time": null
        },
        {
            "user": "Simeon Pilgrim",
            "text": "The general point is to ask a question at a time not seventeen. This way people can answer and know the question is done.\n",
            "time": null
        },
        {
            "user": "blabb",
            "text": "in x64 the first four arguments are passed via registers so the argument 1,2,3 are moved to the registers  do a function that is function (a,b,c,d,e,f,g) and you might see e being pushed into stack or moved into stack\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Assembly Language for x86 Processors by Kip Irvine\nOptimization manuals by Agner\nUnder the Hood article by Matt Pietrek  \nSkull Security Assembly Summary\nAssembly Language Step By Step for Linux by Jeff Duntemann\nIntroduction to x64 Assembly\nIntel Manuals \nTutorials Point\n",
            "votes": "4",
            "user": "alexanderh",
            "time": "Jun 30, 2014 at 21:04",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "I think PC Assembly Language from Paul Carter is a good starting point:\nhttp://www.drpaulcarter.com/pcasm/\nKind regards\n",
            "votes": "3",
            "user": "Dirk",
            "time": "Jun 30, 2014 at 8:06",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Stolas",
                    "text": "<span class=\"comment-copy\">I gave a colleague <a href=\"http://win32assembly.programminghorizon.com/tutorials.html\" rel=\"nofollow noreferrer\">win32assembly.programminghorizon.com/tutorials.html</a> and that worked for him. + a lot of easy crackmes.</span>",
                    "time": null
                }
            ]
        }
    ]
}