{
    "title": "Decompiling/disassembling lua bytecode",
    "link": "https://reverseengineering.stackexchange.com/questions/5827/decompiling-disassembling-lua-bytecode",
    "content": "I've been experimenting with decompiling Lua bytecode and found useful tools like unluac, and LuaAssemblyTools. Unluac seems to do the trick with lua scripts compiled with luac giving me almost the exact source code, however when I convert lua script to bytecode using the code:\n<pre><code>file:write(string.dump(loadfile(filename)))\n</code></pre>\nI get a different output than with luac, however they are very much the same being only a byte extra at (a lot of) different places. Now this new file will give me an <pre><code>IllegalState exception</code></pre> from unluac and when I try to run the bytecode file (created by the code line above) in luac with the -l option I get:\n<pre><code>C:\\MyDir>luac -l stringdumped.txt\nluac: stringdumped.txt: bad integer in precompiled chunk\n</code></pre>\nSo there is clearly a difference between <pre><code>string.dump</code></pre> and luac, even though it is suggested here: http://lua-users.org/wiki/LuaCompilerInLua to use <pre><code>string.dump</code></pre> as an emulator for luac.\nCould anyone explain the difference to me, and suggest how I would go about reversing a <pre><code>string.dump</code></pre> \"compiled\" script?\n",
    "votes": "5",
    "answers": 1,
    "views": "9k",
    "tags": [
        "disassembly",
        "decompile",
        "byte-code"
    ],
    "user": "Dennefyren",
    "time": "Apr 28, 2017 at 12:53",
    "comments": [],
    "answers_data": [
        {
            "content": "There is virtually no difference between the bytecode emitted by <pre><code>loadfile</code></pre> and <pre><code>luac</code></pre>.\nThe only possible reason for the error you are getting is that you are opening the file stringdumped.txt in text mode. Try the following code and see if there are any errors\n<pre><code>f = io.open(\"stringdumped.txt\", \"wb\") --Note that file is opened in binary mode\nf:write(string.dump(loadfile(\"sample.lua\")))\nf:close()\n</code></pre>\nSince there is no difference, the output file stringdumped.txt can both be run by the lua interpreter as well as decompiled by unluac. The reversing steps too are exactly similar as you would do with any other compiled lua scripts.\n",
            "votes": "3",
            "user": "0xec",
            "time": "Jul 12, 2014 at 18:22",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Dennefyren",
                    "text": "<span class=\"comment-copy\">Aha, but how can one disassemble the output of string.dump? Wrapping loadstring or loadfile around would just give the instruction to load the filename or byte-string.</span>",
                    "time": null
                },
                {
                    "user": "0xec",
                    "text": "<span class=\"comment-copy\">@Dennefyren Forget the previous answer, see the updated one.</span>",
                    "time": null
                },
                {
                    "user": "Dennefyren",
                    "text": "<span class=\"comment-copy\">Oh wow I am such an idiot! Didn't realize I needed binary mode. Thank you!</span>",
                    "time": null
                }
            ]
        }
    ]
}