{
    "title": "How to identify functions in a stripped binary on x86 32bit?",
    "link": "https://reverseengineering.stackexchange.com/questions/5830/how-to-identify-functions-in-a-stripped-binary-on-x86-32bit",
    "content": "I am trying to generate a coarse-grained Call Graph based on some assembly code disassembled from binary on x86 32 bit platform.\nIt is very hard to generate a precise Call Graph based on asm code, thinking of various indirect control flow transfer, so right now I only consider direct control flow transfer.\nSo firstly I am trying to identify <pre><code>functions</code></pre> (begin and end addresses) in the disassembled assembly code \nfrom a stripped binary on x86, 32bit.\nRight now, my plan is somehow like this:\nAs for the begin addresses, I might conservatively consider any assembly code looks like this\n<pre><code>    push %ebp\n</code></pre>\nindicates the beginning address of a function.\nand also, I might scan the whole problem, identifying all the <pre><code>call</code></pre> instruction with the destination, the consider these function call's destinations as all the function begin address\nThe problems are:\n\nsome of the functions defined in a binary might never be called.\nsome of the <pre><code>call</code></pre> has been optimised as <pre><code>jump</code></pre> by compiler (thinking of tail recursive call)\n\nAs for the end address, things become more tricky because multiple <pre><code>ret</code></pre> could exist in one single function...\nSo I am thinking that I might conservatively consider the range between any nearest function begin addresses, as one function..\nAm I right? Is there any better solution..?\n",
    "votes": "5",
    "answers": 2,
    "views": "4k",
    "tags": [
        "disassembly",
        "assembly",
        "binary-analysis",
        "static-analysis"
    ],
    "user": "lllllllllllll",
    "time": "Jul 11, 2014 at 18:30",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "The easiest way would probably be to get IDA 5.0 (the free version) and let it do the work.\n",
            "time": null
        },
        {
            "user": "perror",
            "text": "You may also consider using radare2. See, the question: Recursive traversal disassembling with Radare2?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Reversing the call graph or the control flow graph of a binary isn't for the faint of heart, and is still a hot topic for researchers.\nYour approach looks promising; but, unfortunately for you, you'll stumble upon lots of barriers.\nOne, following <pre><code>call</code></pre> instructions is most likely to give great results, if analyzing statically the binary file. The only problem is that, sometimes, you'll have indirect calls/jumps. Meaning, the operand will be a register containing the target address. This will occur very often if the target binary file original source code was written in <pre><code>C++</code></pre> (virtual functions) for example. One way to obtain the target address in this case is to emulate or run the chunk of code that computes it. Another is to assess its value heuristically (heuristics are hell). \nTwo, you can run your binary file with multiple input data sets and dynamically extract the call graphs (this can be performed through instrumentation). You can then cross reference all the obtained call graphs ...\nThree, I would recommend a basic-block centric approach rather than a functional one. Mainly, because a function is a basic-block in itself and you'll have more luck finding functions this way than trying to match patterns which can change from one compiler to another, or from one version of a compiler to another. \nThe following publications are extremely interesting : [1], [2], [3], and also I would encourage you to check <pre><code>DynInst</code></pre> and <pre><code>callgrind</code></pre> if you want to learn more about the subject.\n",
            "votes": "8",
            "user": "yaspr",
            "time": "Jul 11, 2014 at 8:15",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">I've had some success in following <code>call</code>s and doing (minimal!) emulation for register jumps. <a href=\"http://reverseengineering.stackexchange.com/questions/2895/delphi-pascal-try-except-finally-block\">See a sample output snippet here</a>. Recommended on-line reading: <a href=\"http://www.backerstreet.com/decompiler/introduction.htm\" rel=\"nofollow noreferrer\">Decompiler Design</a> -- esp. <a href=\"http://www.backerstreet.com/decompiler/basic_blocks.php\" rel=\"nofollow noreferrer\">the Basic Block approach</a>.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "Generally, the solutions to this problem can be classified to:\n\nPattern matching heuristics. Just like what you are proposing. For example, searching for <pre><code>push</code></pre>es in the binary can provide a (rather) rough approximation of function starts. Things are more difficult if you want to locate function ends though.\nMachine learning. Pattern matching can be automated using machine learning. There are several proposals in the literature like [1], [2], and [3]. All of which attempt to learn byte-level features of function starts and ends. However, modern compiler optimizations make it challenging for such approaches to generalize to binaries beyond the training set.\nCFG-based techniques. This is the most promising approach based on [4] (disclosure: first author here) and concurrently [5]. Basically, it proceeds with (1) direct call target analysis, (2) CFG traversal to locate function ends, and (3) tail-call target analysis.\nCall frame information (CFI) records. Before doing anything fancy, checkout the CFI records in the <pre><code>.eh_frame</code></pre> section. There is a good chance that functions are defined there already. In order to dump CFI records, you can use something like <pre><code>readelf --debug-dump=frames /bin/ls</code></pre>.\n\nI've recently revisited the problem of function identification in this blog post where I provide more details.\n",
            "votes": "1",
            "user": "Codoka",
            "time": "May 27, 2020 at 7:19",
            "is_accepted": false,
            "comments": [
                {
                    "user": "lllllllllllll",
                    "text": "<span class=\"comment-copy\">Cool. Thank you for summarizing the problem in a nice way. It's 2020 now and go solo to publish research papers on \"identifying function boundaries\" might not be as promising as when I posted this question five years ago. But yes, it's always nice to see binary hacking folks constantly explore and publish papers in this field.</span>",
                    "time": null
                }
            ]
        }
    ]
}