{
    "title": "Ollydbg 2.1 Allow for multiple saves or not make backups",
    "link": "https://reverseengineering.stackexchange.com/questions/5881/ollydbg-2-1-allow-for-multiple-saves-or-not-make-backups",
    "content": "I have been looking all around for an answer to this, so I am hoping I find an answer here.\nI am working in Ollydbg 2.1 and every time I patch an exe it makes a foo.bak (backup) which is ok. However, I must reload the program to make more patches and often I am making multiple patches in multiple stubs at a time. Olly wont allow me to patch multiple times unless I rename the file cause there is a .bak already there and it wont over write that. I keep all my own backups so I am wondering.\n1 Is there a way to have olly not make backups?\n2 Is there a way to have olly allow forover writing the .bak files or some way to have multiple saves in a session?\nPlease let me know . \nThanks!\n",
    "votes": "3",
    "answers": 1,
    "views": "414",
    "tags": [
        "ollydbg",
        "patching"
    ],
    "user": "LUser",
    "time": "Jul 16, 2014 at 23:40",
    "comments": [
        {
            "user": "blabb",
            "text": "ollydbg does not create backups for opcode/ assembly editing it keeps all the patch info in a special window called patch providing an actual problem with i load notepad change je to jne at address 401234 use edit copy to executable it asks me to save i save it using a new name  next time ollydbg does not allow me to save  thus  one can try to reprduce might provide a better answer\n",
            "time": null
        },
        {
            "user": "LUser",
            "text": "This seems to be a repeat of what i said above.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Here is a hack for now... I think it would be better to not allow for it to make backups... Which I can do but for now this will just allow the changes to take place and JMP over the error sequence.\nThe Origional\n<pre><code>OFFSET 004BDBF7 :JNZ SHORT 004BDC1B\n</code></pre>\nChange to:\n<pre><code>JMP 004BDC1B \n</code></pre>\nI almost feel bad for this cause there is has to be an option somewhere that I am not seeing. Not to mention the whole inception feeling of debugging a debugger running another process. 0.o...\n",
            "votes": "2",
            "user": "LUser",
            "time": "Aug 8, 2014 at 0:20",
            "is_accepted": true,
            "comments": []
        }
    ]
}