{
    "title": "Visualizing ELF binaries",
    "link": "https://reverseengineering.stackexchange.com/questions/6003/visualizing-elf-binaries",
    "content": "I recently saw an older talk by Sergey Bratus and Greg Conti by the name of Voyage of the Reverser: A Visual Study of Binary Species.\nAre there any opensource/free tools that one could use to see visual representations of the binaries that are fed in (similar to what is shown in the talk)?\n\nSamples from the talk:\n",
    "votes": "62",
    "answers": 7,
    "views": "18k",
    "tags": [
        "binary-analysis",
        "elf",
        "visualization"
    ],
    "user": null,
    "time": "Nov 30, 2022 at 12:52",
    "comments": [],
    "answers_data": [
        {
            "content": "The tool we used for the talk, binviz, is available here: binviz_0.zip.\nSome papers are here:\n\ntaxonomy-bh.pdf;\n2008_VizSEC_FileVisualization_v53_final.pdf\n\nAnd, there is also an earlier Black Hat talk, in addition to the one I\ndid with Sergey:\n\n(200808_binviz38_dc_final.ppt)\n\nI haven't used it in a while but binviz was written in Visual C# (VS2005\nor maybe VS2008).  The .zip is the project (source) file so it should\nload into visual studio and run.  There is also a compiled <pre><code>.exe</code></pre> in...\n<pre><code>/binviz_0.44bw/binviz_0.01/bin/Debug/</code></pre>. You should just be able to double\nclick it and run on a Windows machine. I developed it under XP, but\nhave since used it under Windows 7 and it worked more or less the same.\n(mouseover event behavior is a little different, but still usable).\nNote that binviz is a research prototype and has a bug... it doesn't\nlike small files.  Would try something 10M in size and then work down\nfrom there. I think it is around 500K where it starts getting cranky.\n",
            "votes": "46",
            "user": "perror",
            "time": "Aug 2, 2014 at 14:17",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">Thanks for your reaction! In your 2008 paper you mention platform independent versions as \"future work\" (p. 8). Were you able to pursue this any further, or is the download still the canonical \"current\" version?</span>",
                    "time": null
                },
                {
                    "user": "Greg Conti",
                    "text": "<span class=\"comment-copy\">I went down the a variant path of trying to include automated mapping of arbitrary binaries.  <a href=\"http://www.rumint.org/gregconti/publications/dfrws_2010-301.pdf\" rel=\"nofollow noreferrer\">see binary mapping paper</a> and wasn't able to explore the platform independent version further.  So yes, this is the \"current\" version.</span>",
                    "time": null
                },
                {
                    "user": "Denis",
                    "text": "<span class=\"comment-copy\">@GregConti Will this software recognize writing patterns in text like articles or books?</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "cantor.dust\n\nThis project is an interactive binary visualization tool, a radical\nevolution of the traditional hex editor. By translating binary\ninformation to a visual abstraction, reverse engineers and forensic\nanalysts can sift through mountains of arbitrary data in seconds.\nEven previously unseen instruction sets and data formats can be easily\nlocated and understood through their visual fingerprint.\n\n\n\nPresentation video from Derbycon\n\nPresentation slides from Recon 2013\n\nMore pretty pictures\n\n\nSadly, I think the development stopped, at least I haven't heard any news about this project recently.\nBinwalk\n\ndevttys0 implemented a similar visualization in binwalk.\nVix/Biteye\n\nGraphical (SDL-based) hexadecimal dump tool designed for GNU/Linux. It\nlets you see the patterns formed by its bits.\n\nGithub\n\nbinglide\n\nBinglide is a visual reverse engineering tool. It is designed to offer\na quick overview of the different data types that are present in a\nfile.This tool does not know about any particular file format, everything is\ndone using the same analysis working on the data. This means it works even if\nheaders are missing or corrupted or if the file format is unknown.\n\n\nsenseye\n\nSenseye is a tool for for monitoring, analyzing and visualizing everything\nfrom static files and crash dumps to live data flows and application dynamic\nmemory.Each data window provides you with different views (e.g. 3D point butt)\nand statistical tools (e.g. histogram) and some controls for hinting how the\nsensor should sample, pack and transfer data.\n\n\nbinvis.io\n\na browser-based tool for visualising binary data.\nWith binvis.io, you can:\nVisually explore binary data.\nCluster bytes to pick out fine structural features with space-filling curves.\nUse the simple scan layout to navigate and select data intuitively.\nFlip between a number of useful byte color mappings, including an entropy.\nVisualiser that lets you pick out compressed or encrypted sections.\nExport data segments for analysis.\n\n\n===\nBinVis\n\nA Qt based tool for visualizing arbitrary data.\nBinVis has abilities to:\nVisualize large amounts of binary data (several TiB).\nVisualize in time (normal plot) and space (byte plot) domains\nVisualize parts of files and narrow in on relevant parts of the file\n\"Step\" through the file to see what type of data each part of the file contains\n\"Reverse draw\" to highlight strong patterns in the visualized data\nUse filters, transparency, color schemes and various shaders to highlight the relevant data.\nHeavy use of threading for performance reasons\nFairly static memory usage, using the same amount of memory for visualizing a 1GiB file and 100TiB file\nhttp://trippler.no/wpcms/?page_id=20 http://trippler.no/wpcms/wp-content/uploads/2014/06/Screenshot_2015-08-09_19-52-30.png\n\nPortEx\n\nJava library to analyse Portable Executable files with a special focus\non malware analysis and PE malformation robustness\n\nVeles\nBinary visualization framework.\n",
            "votes": "33",
            "user": "Community",
            "time": "Jun 17, 2020 at 9:54",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "These are graphic dumps from the source data. I use this extensively, with a hex reader I wrote myself -- it's a great way to quickly locate \"data\" (see the difference between <pre><code>.text</code></pre> and <pre><code>.data</code></pre>) and larger structures (which often contain repeating or similar data on the same offsets).\nThe top images show raw data dumped as grayscale information: each byte is treated as a pixel. Presumably, the author chose grayscale for convenience. I prefer a full range of contrasting colors, so long swathes of \"same\" and \"similar\" data can be discerned easier.\nThe blocks of solid color near the bottom (<pre><code>.rsrc</code></pre>) are icons and other graphics. They appear horizontally stretched out because they are displayed as one-pixel-per-byte, and are actually 16-, 24-, or 32-bpp images.\n(I don't believe the entire top is <pre><code>.text</code></pre>! Executable code appears as random pixels, but the top 1/3rd in that image is less dense. It's probably the MZ and PE Executable Header; these contain lots of zeros. The more denser part in the bottom 1/3rd is part of <pre><code>.text</code></pre> and most likely the Virtual Call table, which happens to contain the byte <pre><code>0xFF</code></pre> a lot.)\nIn the bottom images, each byte is displayed in a monochrome binary format: each byte is shown as 8 consecutive pixels. By convention, these are displayed with the most significant bit first. There is no need to check for 'endianness', as that only comes into play when dealing with single values larger than a single byte.\nWriting something like this yourself is not hard; probably most important is to make the graphics routines as fast as possible, in particular the monochrome bitmaps. This is also addressed by Conti et al., Visual Reverse Engineering of Binary and Data Files (http://www.rumint.org/gregconti/publications/2008_VizSEC_FileVisualization_v53_final.pdf):\n\nWhen testing performance we found that the display could be updated in 0.03 seconds, leaving open the possibility of creating byteview visualizations at greater resolutions while still providing a responsive interface. [...] We were able to achieve this level of performance by avoiding C#’s GetPixel and SetPixel methods and directly accessing image memory [...]\n\n\nScreenshots of my own tool, very similar to what is shown above:\nThe <pre><code>.text</code></pre> section of CALC.EXE. The repeating structure on the bottom is the Virtual Call table.\n\nA file containing RLE-encoded images. The RLE compression can be recognized by the horizontal stripes of \"coherent\" data (better visible when changing the width interactively).\n\nGZ compressed data, in monochrome. This is as close to random static as possible.\n\nA tiny embedded bitmap font found in another executable. The random bits between characters are the width in pixels - see the synchronically scrolling hex dump.\n\nSome data is better visualized in other ways. This is an old-style VGA palette (6x6x6 RGB).\n",
            "votes": "14",
            "user": "Jongware",
            "time": "Aug 2, 2014 at 12:20",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "The data visualizing tool I saw used in the talk seems to be almost identical if not identical to the BinVis tool available on Google Code. A screenshot of some of the features:\n\nNote: the above is an old version as I could not install the latest on my PC; see Google code site for more.\n",
            "votes": "13",
            "user": "JamalS",
            "time": "Aug 2, 2014 at 9:36",
            "is_accepted": false,
            "comments": [
                {
                    "user": "broadway",
                    "text": "<span class=\"comment-copy\">Yeah, it's his work, and I think all that's available unless cantor.dust shows up as opensource.</span>",
                    "time": null
                },
                {
                    "user": "PlasmaHH",
                    "text": "<span class=\"comment-copy\">It seems that the current version is availabel in <a href=\"http://binvis.googlecode.com/svn/trunk/binviz_0.01/bin/Release/app.publish/Application%20Files/binviz_0.01_1_0_0_1/\" rel=\"nofollow noreferrer\">binvis.googlecode.com/svn/trunk/binviz_0.01/bin/Release/…</a> by just renaming .exe.deploy to .exe</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "BinView is a prototype for a tool for binary data visualization\nGitHub repository\n",
            "votes": "11",
            "user": "Russlan K",
            "time": "Feb 16, 2015 at 0:21",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I wrote https://github.com/REMath/implementations/blob/master/code_examples/plot_hex.py which implements the ngram method presented Conti as well as a clustering component to isolate visual properties.\n",
            "votes": "9",
            "user": "turnersr",
            "time": "Aug 5, 2014 at 14:15",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I was part of a team that built a dynamic visualization tool (dynamic because it operates on executions of binaries, not on static binaries) called Haxxis:\nhttps://github.com/voidALPHA/cgc_viz (the visualization component developed by voidALPHA)\nhttps://github.com/Vector35/traceapi (generates traces using a modified qemu that are fed into the visualizer)\nWhile it mainly works on \"Decree\" format (a 32bit x86 modified elf format) it would be easy to adapt to other binary formats. It produces some nifty visualizations: \nhttps://www.youtube.com/watch?v=6r1fOrDb80s&list=PLuDRBJDBc4F9HnfV5tQDwqhSs9a5VPegD\nhttps://www.youtube.com/watch?v=LEfejsqEucY&list=PL6wMum5UsYvZx2x9QGhDY8j3FcQUH7uY0&index=13\nhttps://www.youtube.com/watch?v=SYYZjTx92KU&list=PL6wMum5UsYvZx2x9QGhDY8j3FcQUH7uY0&index=31 (long overview of the CGC event itself with snippets of Haxxis throughout)\n",
            "votes": "3",
            "user": "Jordan",
            "time": "Sep 6, 2017 at 21:00",
            "is_accepted": false,
            "comments": []
        }
    ]
}