{
    "title": "Is the magic number important",
    "link": "https://reverseengineering.stackexchange.com/questions/6012/is-the-magic-number-important",
    "content": "While checking the PE header of DLLs and EXE(s) by PEviewer, I found  something called \"magic number\". \nAfter googling \"magic number\". I found that it is used to determine the file type. My question is how can a malware analysist benefits from this magic number ? And why is it in the PE header ?\n",
    "votes": "3",
    "answers": 1,
    "views": "2k",
    "tags": [
        "static-analysis",
        "pe"
    ],
    "user": "Ahmed",
    "time": "Aug 3, 2014 at 8:56",
    "comments": [],
    "answers_data": [
        {
            "content": "A magic number is a set of bytes used when accessing a file to determine its type. For example, the standard Microsoft PE begins with (in ASCII) <pre><code>MZ</code></pre>, the initials of one of the developers of MS-DOS.\nThe initial headers in a portable executable specify a variety of information regarding the file, ranging from the supported platform, number of symbols, number of sections, time stamps, etc. As such, it is a logical location to store the magic number, as it is also part of the file metadata.\n\nHow can a malware analyst benefit from this magic number?\n\nThe only information the magic number provides is the file type, and as such that is all that can be garnered by a malware analyst, or any type of analysis. Although one can refer to the file extension to check a file type, they can be changed without affecting the contents of the file. As such, checking the magic number is a method to determine the true file type. Discrepancies would then indicate potential malicious behavior or attempts to hide data.\n",
            "votes": "5",
            "user": "JamalS",
            "time": "Aug 3, 2014 at 12:35",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Ahmed",
                    "text": "<span class=\"comment-copy\">Could you provide me with the magic number of other populer file type of malware</span>",
                    "time": null
                },
                {
                    "user": "JamalS",
                    "text": "<span class=\"comment-copy\">@Ahmed: Wikipedia has a list of many: en.wikipedia.org/wiki/List_of_file_signatures.</span>",
                    "time": null
                },
                {
                    "user": "Jongware",
                    "text": "<span class=\"comment-copy\">@Ahmed: you got it the wrong way around. <i>Malware</i> doesn't have a \"magic number\". Their <i>containers</i> do. Malware can be hidden inside executables, but also in PDFs, JPEGs, and even DOS batch files.</span>",
                    "time": null
                },
                {
                    "user": "JamalS",
                    "text": "<span class=\"comment-copy\">@Ahmed: Yes, don't confuse file types with malware. The file types serve as a way of storing malicious code.</span>",
                    "time": null
                }
            ]
        }
    ]
}