{
    "title": "Anti-cheat Memory Scan",
    "link": "https://reverseengineering.stackexchange.com/questions/6046/anti-cheat-memory-scan",
    "content": "The Problem\nI'm attaching a game's process to view/edit my ammo. I've reversed a few games and understand x86 assembly; however, I'm new to the whole anti-debuggers and memory scanning bit. I have searched for resources on how to combat this issue, but still have found nothing. Whenever I attach to the game it still works, but as soon as I change a single instruction it's as if the application \"scans\" it and detects my change, thus causing a crash. Also, sometimes if I happen to \"bypass\" the detection, the anti-cheat always finds a way to kick me out.\nI've read about a few functions that some programs may use, but none of them have really seemed to help.\nQuestions\n\nWhat do these games/applications use to detect this?\nIs there a way to avoid this detection?\n",
    "votes": "1",
    "answers": 2,
    "views": "3k",
    "tags": [
        "x86",
        "anti-debugging"
    ],
    "user": "iScott",
    "time": "Jun 17, 2020 at 9:54",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "Possible duplicate of reverseengineering.stackexchange.com/questions/3658/… ?\n",
            "time": null
        },
        {
            "user": "Dominik Antal",
            "text": "Are you sure it's the anticheat thats crashing the app, instead of you messing at the wrong place in memory? Since you didn't mention which AC is this, I'ld recommend you googling for \"warden\" and \"punk buster\" and check game hacking sites for more info on them to get a basic understanding how they work.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Regarding the questions:\n\nApplications are reading code memory and computing checksums. If checksum not matches predefined value - applications act accordingly.\nThere is no general and easy explainable way to avoid such kind of detection. The most common point of such action is patching the code that checks the checksum.\n\nIn your case I'd try to protect the changed memory from reading (by calling VirtualProtect from injected dll for example) or create breakpoint on reading memory on changed area and check the area of code where changed memory reading will occur - this will be the place where the changed code is read. \nYou'll need either recalculate the checksum with your new changed code or nopify the code that is responsible for incorrect checksum reaction.\nPlease note that the checksuming code you'll need to change may be also protected in the same manner.\n",
            "votes": "2",
            "user": "w s",
            "time": "Aug 10, 2014 at 11:03",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "First, there's no perfect solution. An application running on a computer is subject to all kinds of manipulation. All you can do is take a few reasonable steps to prevent most cheating and manipulation of the client by people who aren't willing to spend enough resources to figure out how to circumvent your anti-cheating measures. \nA few steps you can take include:\n\nObfuscate the binary by randomizing the linker. This way, any in-memory hacks change every time you push a new version. \nEmbed a secret key in the client. Check for the correct key every time you connect to a client. \nObfuscate memory.  Have a set of randomized XOR pads for each memory structure, making it harder for an in-memory hacker to determine how to manipulate memory. \nChecksum. For each structure, store a checksum of all values which is periodically verified. \nConstraint validation. For any constrained values, double check them every time they are used for sane values, preferably on the server.\nLog and ban.  Log any suspicious behavior and immediately ban the user.  Ultimately this is your best deterrent to cheating.\n",
            "votes": "1",
            "user": "Jeff-Inventor ChromeOS",
            "time": "Aug 10, 2014 at 20:34",
            "is_accepted": false,
            "comments": []
        }
    ]
}