{
    "title": "Search remote malware zoo for homologous samples",
    "link": "https://reverseengineering.stackexchange.com/questions/6106/search-remote-malware-zoo-for-homologous-samples",
    "content": "I've got the following problem:\nI'd like to find new binaries of a certain malware family -- unpacked -- for subsequent analysis (active C&C comms analysis).\nIs there a database of binaries somewhere where I can write a query like the following:\nGive me samples that are homologous to an input binary (or collection thereof) using fuzzy hashing as the distance metric and then filter by date seen?\nTo clarify, the samples don't use packing.\n",
    "votes": "3",
    "answers": 4,
    "views": "459",
    "tags": [
        "binary-analysis",
        "malware"
    ],
    "user": "Fred Concklin",
    "time": "Aug 21, 2014 at 19:09",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "AV companies (and some security companies) spend a large amount of resources creating these databases. I know of no public system that allows you to search for homologous samples using just a sample (or set of samples) as input. You may want to search based on strings in your sample, and if you don't find anything with that approach, reach out to friends in the AV industry to see if they can help you find related samples.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I am afraid that most of these databases aren't public, the malware analysis companies tries to keep it for them.\nYet, I recommend you to take a look at VirusTotal (see its Wikipedia page for more information about it) which is probably the most furnished database available on-line.\nYou may also want to take a look at the IRMA (Incident Response Malware Analysis) framework if you want to run your own server.\nFinally, here is a collection of tools and papers on methods to find similarities in binary blobs:\n\n<pre><code>sdhash</code></pre> tool (see also this blog post);\n<pre><code>ssdeep</code></pre> tool;\nBinSlayer: Accurate Comparison of Binary Executables, by Bourquin, King and Robbins , 2013 (GitHub Project);\nmvHash - a new approach for fuzzy hashing, by Knut Petter Åstebø, 2012;\nAn evaluation of forensic similarity hashes, by Vassil Roussev, 2011.\n\nThis list is far from being complete, but I think that this is a good starting point...\nHope this will help you !\n",
            "votes": "2",
            "user": "perror",
            "time": "Aug 21, 2014 at 19:34",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "VirusTotal has import hash to match:\nhttp://blog.virustotal.com/2014/02/virustotal-imphash.html\n",
            "votes": "2",
            "user": "karl",
            "time": "Aug 22, 2014 at 10:11",
            "is_accepted": false,
            "comments": [
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">In fact, imphash (Import Hashing) correspond just to the hash of the import table of the executable. It is a good signature for software using an unusual set of API functions, but if you manage to use only very common ones you will remain unnoticed. Better than the link you gave, prefer <a href=\"https://www.mandiant.com/blog/tracking-malware-import-hashing/\" rel=\"nofollow noreferrer\">this one</a> (much more detailed).</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "I work on the team for darkpoint.  Our platform can compare and cluster submitted malware based on feature vectors.  Basically, we do static and dynamic analysis to determine the characteristics of all the software we see.  Then we use machine learning to discover matches.  You can also do explicit matches based on normal search terms.\n",
            "votes": "1",
            "user": "Dale",
            "time": "Aug 22, 2014 at 14:03",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "malshare.com - Request an API Key and pull all the samples you want.\n",
            "votes": "1",
            "user": "t4u51f",
            "time": "Oct 31, 2014 at 6:17",
            "is_accepted": false,
            "comments": []
        }
    ]
}