{
    "title": "Run multiple instances of same application - Adobe Reader",
    "link": "https://reverseengineering.stackexchange.com/questions/6128/run-multiple-instances-of-same-application-adobe-reader",
    "content": "I have been fuzzing Adobe Reader for a while now.\nOne of the issue that I face is running multiple instances of same application. If I'm able to run multiple instances of same application, I will be utilizing my CPU cycles efficiently.\nBut, the issue is, applications like Adobe Reader, does not allow multiple instances.\nIs there any way by which I can run multiple instances of application that does not support multiple instance and fuzz them efficiently.\nActually, I'm trying to find ways by which I can achieve my goals.\nOne of the idea is to hook functions.\nPlease share your views and opinions.\n",
    "votes": "1",
    "answers": 1,
    "views": "268",
    "tags": [
        "fuzzing",
        "vulnerability-analysis",
        "multi-process"
    ],
    "user": "john4tech",
    "time": "Aug 27, 2014 at 10:01",
    "comments": [
        {
            "user": "Stolas",
            "text": "For fuzzing or vulnerability analysis it might taint your envoirment and thus your fuzzing surface. I'd recommend you'd use vargrant or something like that to spawn a fuzzing farm quickly and painlessly.\n",
            "time": null
        },
        {
            "user": "QAZ",
            "text": "The simplest way is to run each instance under a separate user account.\n",
            "time": null
        },
        {
            "user": "w s",
            "text": "Virtual machines will help you.\n",
            "time": null
        },
        {
            "user": "john4tech",
            "text": "Actually, I'm fuzzing using VMs'. I'm trying to find a way to develop application containers that can run multiple instance of same application. So, that I can fuzz multiple instances of software (Adobe) in same virtual machine.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Adobe Reader uses the following two methods to determine if another instance is running:\n\n<pre><code>CreateSemaphoreW(NULL, 0, 1, L\"Acrobat Viewer\")</code></pre> followed by\n<pre><code>GetLastError() == ERROR_ALREADY_EXISTS</code></pre>\n<pre><code>FindWindowW(L\"Acrobat Viewer\", NULL) != NULL</code></pre>\n\nSo as long as you hook those two functions appropriately or patch the code that performs those checks, you will be able to run multiple instances of Adobe Reader.\n",
            "votes": "3",
            "user": "Jason Geffner",
            "time": "Aug 27, 2014 at 13:55",
            "is_accepted": false,
            "comments": [
                {
                    "user": "john4tech",
                    "text": "<span class=\"comment-copy\">thank you. But I'm looking for a generic way of doing this. I want to make a container which can run multiple instances of most of the apps. Just like application virtualization (do you think that this will be a good approach for fuzzing?).</span>",
                    "time": null
                },
                {
                    "user": "ST3",
                    "text": "<span class=\"comment-copy\">Also <code>CreateMutex</code>(<code>W</code>/<code>A</code>) may be used in the same manner as <code>CreateSemaphore</code>(<code>W</code>/<code>A</code>)</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">@john4tech: The approach I described above will be more performant than a generic solution, which as I'm sure you know is very important when fuzzing. Unless you're looking to fuzz dozens of different applications (for which manual analysis might be too time-consuming), I'd recommend using application-specific hooks/patches.</span>",
                    "time": null
                },
                {
                    "user": "john4tech",
                    "text": "<span class=\"comment-copy\">@jason-geffner yes, my aim is to fuzz dozens of applications which run in single instance mode. It's time consuming to look into each application and make patch for it. That's why I'm looking for a generic solution.</span>",
                    "time": null
                }
            ]
        }
    ]
}