{
    "title": "Suddenly unable to load exe into OllyDbg - process terminates before execution",
    "link": "https://reverseengineering.stackexchange.com/questions/6139/suddenly-unable-to-load-exe-into-ollydbg-process-terminates-before-execution",
    "content": "A week ago, I've loaded an app into Olly, as an exercise and out of curiosity. It has been successfully loaded and I've found out that there's no protection of any kind applied (all strings are \"plaintext\", no anti-debugging techniques, simply nothing).\nToday, I wanted to come back to said program and suddenly I'm unable to load it into Olly - even before Olly starts its analysis (the bar in the bottom of the window), the process terminates and I land in ntdll.dll.\nIf run without a debugger, the exe works fine - there seem to be no problems.\nI'm really puzzled because since then I've made two changes to my PC: \n\nInstalled Nod32 4 (disabled it, nothing changed)\nDownloaded WDK 8.1 from this page:\nhttp://msdn.microsoft.com/en-us/windows/hardware/gg454513.aspx (uninstalled, didn't help either)\n\nI've also tried this on another PC which hasn't been even powered on for the last month and is basically a clean Win7 install, still to no avail.\nAt the first glance, this probably looks like battling a TLS Callback protection, but as I said, I'm certain the exe has no protection at all, as I've been able to play around with it a couple days ago.\nAre there any 'common' causes for such behavior?\n",
    "votes": "1",
    "answers": 0,
    "views": "2k",
    "tags": [
        "ollydbg"
    ],
    "user": "user4520",
    "time": "Aug 29, 2014 at 18:18",
    "comments": [
        {
            "user": "JamalS",
            "text": "Have you tried observing its behavior in other software, e.g. IDA, Hopper? Alternatively try just using the GDB command-line tool to see if it has something against debuggers.\n",
            "time": null
        },
        {
            "user": "user4520",
            "text": "The same thing happens in other debuggers I've tried. As I've said, I'm positive it hasn't any kind of protection. I even have C code written a week ago because I was able to reverse some basic calls.\n",
            "time": null
        },
        {
            "user": "JamalS",
            "text": "Would it be possible for you to provide the executable for us to analyze ourselves?\n",
            "time": null
        },
        {
            "user": "user4520",
            "text": "So it turns out that attaching to process in OllyDbg 2.0 will work. In 1.10, I have this weird issue where the target process will be frozen by Olly (happens with many other programs, such as MS Notepad). I'll try a fresh Win7 install tomorrow, see what happens.\n",
            "time": null
        },
        {
            "user": "evlncrn8",
            "text": "check if DbgUiRemoteBreakin in ntdll.dll is patched to jump to exitprocess (or similar), its a pretty common anti attach trick\n",
            "time": null
        }
    ],
    "answers_data": []
}