{
    "title": "What kind of obfuscate is this?",
    "link": "https://reverseengineering.stackexchange.com/questions/6202/what-kind-of-obfuscate-is-this",
    "content": "I'm trying to deobfuscate a .NET exe file, using de4dot. I have many dll files, when I open the dll file with .NET Reflector, it appears like this:\n\nAnd when I did the deobfuscation again with <pre><code>de4dot</code></pre>, some stuff are cleaned:\n\nWhen I open that cleaned-dll, all the variables and class name look very strange, it's not related with the code inside that function.\n\nHave you guys seen this before? How can I get the real name of functions and variables ? Did they use 2 times obfuscation ?\nLink to download application files :\nhttps://dl.dropboxusercontent.com/u/10907501/bc/UW.rar\n",
    "votes": "1",
    "answers": 1,
    "views": "3k",
    "tags": [
        "deobfuscation",
        ".net"
    ],
    "user": "user8490",
    "time": "Jul 10, 2015 at 15:44",
    "comments": [
        {
            "user": "Dominik Antal",
            "text": "I doubt you could get the original name of the functions. I think the obfuscation technique used randomly switched the function names within the assembly, or used random function names from a list. If the prior happend, you could guess which function name belongs to a certain function, after observing what it does. I don't know which obfuscation software has this \"func name switching\" feature, but if you find out, maybe you can observe what it uses to decide  the switching and restore it manually.\n",
            "time": null
        },
        {
            "user": "SSpoke",
            "text": "Find out how the RNG worked what seed used etc.. and you will be able to compile a list of RNG values which could aid in the reverse process, consider a set of values <pre><code>[0,1,2,3,4]</code></pre> etc.. before they were randomized, to attempt to find their offsets. It's possible that in the RNG the value <pre><code>[3,4,0,1,2]</code></pre> is really positions <pre><code>[4,5,1,2,3]</code></pre> The more dedicated you are to figuring this out then you will actually figure it out.. because nothing is really lost, it's just computed/swapped :) You will need to find the string table then re-order it back and if it's correct everything will go back in place\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "This is definitely one of the naming schemes from Crypto Obfuscator.\nAs listed on their features page:\n\nFake Renaming Scheme\nCrypto Obfuscator also has a renaming mode which renames all classes, fields, methods, etc to fake but realistic names like Domain/Log/Stream/etc (for classes) or Open/Close/Clear/Delete/etc for methods and so on. This makes it extremely difficult to differentiate between symbols excluded from obfuscation and obfuscated symbols.\n\nAlso, running de4dot through Command Prompt should display the detected obfuscator.\n",
            "votes": "5",
            "user": "svick",
            "time": "Oct 16, 2014 at 11:12",
            "is_accepted": false,
            "comments": [
                {
                    "user": "T.Todua",
                    "text": "<span class=\"comment-copy\">can you answer the case, where the obfuscator is not detected? <a href=\"https://reverseengineering.stackexchange.com/questions/20007/how-to-detect-obfuscator-de4dot-shows-detected-unknown-obfuscator\" title=\"how to detect obfuscator de4dot shows detected unknown obfuscator\">reverseengineering.stackexchange.com/questions/20007/…</a></span>",
                    "time": null
                }
            ]
        }
    ]
}