{
    "title": "Reverse engineering and programming byte-by-byte on mobile OSs?",
    "link": "https://reverseengineering.stackexchange.com/questions/6232/reverse-engineering-and-programming-byte-by-byte-on-mobile-oss",
    "content": "I can't find any disassembling programs for the various binary formats out there that can run on OSes like Android, iOS, Blackberry, etc. These are the only devices I have access to, and I am trying to learn assembly and very low-level programming for retro-computers architectures (NES, SNES, Genesis, PSX, N64, etc.).\nI managed to find one hex editor for Android that does the job well enough. It's entirely possible to load up any binaries there and hand-disassemble them (meaning look at each byte and an opcode table, etc.). \nDoing so, is it possible that one can completely reverse engineer, say, a game and generate some form of assembly-textual source by stepping each machine byte(s) back to assembly instructions that can be re-programmed then back to the machine executable bytes/data/etc.?\nWhat I'm asking is, is this possible or is there a step I am missing?\n",
    "votes": "2",
    "answers": 2,
    "views": "341",
    "tags": [
        "machine-code"
    ],
    "user": "TomHardyBoyyy",
    "time": "Oct 15, 2014 at 7:31",
    "comments": [
        {
            "user": "Willem Hengeveld",
            "text": "I think you should lookup the cpu type of your device, and check if it is in  this list.\n",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "If you think it be useful if there was a disassembler for (Insert Platform Here), and there is none - or they do not work the way you'd like - then writing one is a good exercise. It will make you intimately familiar with the system.\n",
            "time": null
        },
        {
            "user": "user45891",
            "text": "I'd imagine that doing software development or reverse engineering on a tablet isn't fun. It's probably easier to buy some old laptop. But on question: Yes surely it is possible. Is it doable in an adequate timeframe? Hell no\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Hex-Rays ported IDA to iOS several years ago:\n\nIt's not publicly available, but (from http://www.hexblog.com/?p=82#comment-652) --\n\nif you have a current ida license and want to play (just to\n  play) with it, feel free to send a request to the support\n",
            "votes": "2",
            "user": "Jason Geffner",
            "time": "Sep 14, 2014 at 15:45",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "radare2 is running natively on:\n\nAndroid\niPhone\nfirefoxOS\n\nIf you don't like reversing on your device, you can spawn a web interface, and play around with your device, from your web browser, on your computer.\nAnd it's a free software :)\n",
            "votes": "0",
            "user": "jvoisin",
            "time": "Jan 13, 2015 at 19:31",
            "is_accepted": false,
            "comments": []
        }
    ]
}