{
    "title": "Is nVidia Linux driver reverse engineering legal in Europe?",
    "link": "https://reverseengineering.stackexchange.com/questions/6235/is-nvidia-linux-driver-reverse-engineering-legal-in-europe",
    "content": "How does nvidia linux driver eula, especially sections 2.1.3 and 5. play with European Union Directive on the legal protection of computer programs?\nI think somebody would have already done that and uploaded to nouveau if it was legal in Europe. But I am not sure.\n",
    "votes": "5",
    "answers": 1,
    "views": "1k",
    "tags": [
        "driver",
        "law",
        "nvidia"
    ],
    "user": "user3313119",
    "time": "Sep 14, 2014 at 18:50",
    "comments": [
        {
            "user": "Stolas",
            "text": "Sorry to say this but, ask a Lawyer.\n",
            "time": null
        },
        {
            "user": "Paul",
            "text": "2.1.3 - No Reverse Engineering. So, no it's not legal. Though as above contact a lawyer.\n",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "@Paul: If EU laws contradict the license, this makes this part of the license invalid, and in many cases, if a part of a license, treaty, or whatever, is invalid, it makes the whole license invalid. My personal opinion is that, assuming NVidia failed to provide linux drivers (which they don't!), it would be legal in the EU to disassemble the windows drivers to the extend required to make them work with linux - but not to create a new, independent set of drivers. But i'm not a lawyer either, so this personal opinion should not be taken as a fact.\n",
            "time": null
        },
        {
            "user": "Franck Dernoncourt",
            "text": "You might be interested in this Law Stack Exchange proposal  which is now in commitment phase.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Up to my knowledge, reverse-engineering is possible in Europe if you need it to achieve inter-interoperability and that the maker of the software or the hardware refuse to do it.\nIt means that, if you cannot get a graphic card to work properly under your favorite operating-system and that the maker of this card does not want to make a support for it, then you are free to perform a reverse-engineering on it.\nBeware, publishing publicly the (direct) result of a reverse is not allowed ! For example, you cannot publish a disassembly of a firmware. The thing is that I do not know if you can publish the API that you obtained by reversing the firmware... The API is somehow quite far from the original raw material... and publishing your code in open-source would be somehow the same as publishing the API... So, I do not know exactly where is the limit.\nI remember a few years ago, with others, we sent a letter to Apple asking them to support Ogg-Vorbis format on their iPod Nano. They received the letter but did not dare to answer. Then, we started to reverse the Nano without breaking the law.\nAnother way to work-around the law against reverse-engineering in Europe is to be part of a laboratory. Then, you can do reverse for studying the software or the hardware that you are focusing on (beware, publishing is still tedious in this case also).\n",
            "votes": "2",
            "user": "perror",
            "time": "Sep 15, 2014 at 8:54",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user3313119",
                    "text": "<span class=\"comment-copy\">So it will be legal to reverse engineer it for l4 microkernel if they will not respond?</span>",
                    "time": null
                },
                {
                    "user": "perror",
                    "text": "<span class=\"comment-copy\">If it is for interoperability purpose, yes. See <a href=\"http://en.wikipedia.org/wiki/Reverse_engineering#European_Union\" rel=\"nofollow noreferrer\">Reverse Engineering in European Union</a>.</span>",
                    "time": null
                }
            ]
        }
    ]
}