{
    "title": "XORing command-line for encryption?",
    "link": "https://reverseengineering.stackexchange.com/questions/6267/xoring-command-line-for-encryption",
    "content": "I have the following lines\n<pre><code> push [ebp+dwBytes]\n push 8                 ; dwFlags\n call ds:GetProcessHeap\n push eax               ; hHeap\n call ds:HeapAlloc      \n push [ebp:lpCmdLine]   ; char *\n mov edi, eax\n call _atol\n mov esi, eax\n xor esi, 28Ch\n mov eax, esi\n pop ecx\n mov edx, ebx\n xor eax, 1104h\n xor ecx, ecx\n shr edx, 1\n jz  short loc_60114A\n</code></pre>\nThe first part is not difficult. They get a handle to the default heap and after that, they allocate some memory on that heap using the handle hHeap. \nThe part with lpCmdLine take the lpCmdLine and converts it into a long value.\nNow, I do not understand the part which comes after call _atol.\nEspecially the lines with the XOR :\n<pre><code> xor esi, 28Ch\n</code></pre>\nQuestions:\na) Is that a way of encryption ? I mean, is it so that they try to encrypt the string pointed by lpCmdLine ? \nb) Normally I had a cmp before jz, but here as you can see, there is only a jz instruction? Why is the cmp is missing ? \nbest regards,\n",
    "votes": "0",
    "answers": 1,
    "views": "510",
    "tags": [
        "assembly",
        "xor"
    ],
    "user": "user3097712",
    "time": "Sep 20, 2014 at 17:58",
    "comments": [
        {
            "user": "evlncrn8",
            "text": "atol = ascii to long, so if you passed 12345678 on the commandline then eax would become that, then its xoring the value, presumably for a compare later, so at a guess      jz doesnt need a compare, some of the other operations will adjust the eflags.. like the shr edx.. if edx = 0 after this the zero flag will be set\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "The number returned by <pre><code>_atol()</code></pre> is XOR'ed with <pre><code>0x28C</code></pre> and then XOR'ed again with <pre><code>0x1104</code></pre>. Since XOR is an associative operation, this is equivalent to XOR'ing the number returned by <pre><code>_atol()</code></pre> with <pre><code>0x1388</code></pre>.\n\na) Is that a way of encryption ? I mean, is it so that they try to\n  encrypt the string pointed by lpCmdLine?\n\nThere's not enough context in your snippet above to infer how this resulting value is being used.\nAlso, it's unlikely that what IDA is labeling as <pre><code>lpCmdLine</code></pre> is really the program's command line, since a command line typically begins with the executable's file name, on which <pre><code>_atol()</code></pre> would typically fail (you can create a process and have only command line arguments as the command line, and alternatively it is possible that the code above expects the executable's file name to be numeric (like <pre><code>123.exe</code></pre>), but these are both less likely than IDA just mislabling the variable).\n\nb) Normally I had a cmp before jz, but here as you can see, there is\n  only a jz instruction? Why is the cmp is missing ?\n\nThe <pre><code>jz</code></pre> instruction checks the CPU's Zero Flag. The <pre><code>shr</code></pre> instruction prior to the <pre><code>jz</code></pre> instruction sets the Zero Flag as follows (from http://x86.renejeschke.de/html/file_module_x86_id_285.html) --\n\nThe SF, ZF, and PF flags are set according to the result [of the shift operation].\n\nIn other words, if after <pre><code>shr edx, 1</code></pre> the register <pre><code>edx</code></pre> is <pre><code>0x00000000</code></pre>, then the jump is taken. As with your previous question, though, there's not enough context in your snippet above to infer how this is being used.\n",
            "votes": "2",
            "user": "Jason Geffner",
            "time": "Sep 21, 2014 at 15:31",
            "is_accepted": false,
            "comments": []
        }
    ]
}