{
    "title": "Firmware encrypted with Openssl [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/6315/firmware-encrypted-with-openssl",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 7 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI managed to copy the Firmware out of a device and tried to extract to content with binwalk but the Signature tells it's encoded with OpenSSL\nWhich are the possible ways to find out which type of chipper has been used and so on.\nCheers,\n",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "firmware",
        "decryption",
        "cryptography"
    ],
    "user": "albi",
    "time": "7 years ago",
    "comments": [
        {
            "user": "devttys0",
            "text": "I don't think there's anything in the signature that indicates what encryption was used (justsolve.archiveteam.org/wiki/OpenSSL_salted_format). There is likely some code in the firmware to do the decryption though; can you provide a link to the firmware image?\n",
            "time": null
        },
        {
            "user": "albi",
            "text": "Thanks devttys0 i send you a email with a few examples to webmaster@ the FW is customized for each SN so i better don't post it here ;)\n",
            "time": null
        },
        {
            "user": "devttys0",
            "text": "Is this dumped from the device itself, or is it a firmware update file? There doesn't appear to be anything besides the encrypted data, so something has to be decrypting it. Could be done in hardware, but more likely there's some other software that is doing the decryption.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "As mentioned in the comments, OpenSSL salted format (if that's indeed what you have) stores no information about the encryption used. You can probably guess some things, e.g. the block size from the size of the encrypted data, but to know for sure you need access to the code which processes the file (e.g. the firmware dumped from the device or the firmware updater if it does the decryption). Without access to that this question can't really be answered.\n",
            "votes": "0",
            "user": "Igor Skochinsky",
            "time": "Apr 4, 2017 at 9:35",
            "is_accepted": false,
            "comments": []
        }
    ]
}