{
    "title": "How does iOS hash and salt passwords on its secondary-storage?",
    "link": "https://reverseengineering.stackexchange.com/questions/6322/how-does-ios-hash-and-salt-passwords-on-its-secondary-storage",
    "content": "I bought a used iPhone from someone, but I accidentally got a lock screen on the phone and can't figure out what the passcode is. Long story short, how does iOS hash the passcodes for entry, what kind of salt/etc. does it use, where would it store it, and is it possible to mount the internal drive (I'm guessing SSD?) where it stores the passcode? \nAnyone familiar with iOS reverse engineering? Coding/development? Can one mount the whole filesystem and copy the files/decrypt/reverse engineer/view them/hex edit them/etc. (the files of the hashed/encrypted passcode)? I am all up for this 100%; just need some people more familiar with iOS to set me in the right direction.\nWhy other alternatives aren't good enough:\n\nCan't factory restore; all very important data will be lost that was not backed up.\nThere's no way to bypass the lock-screen on this iOS version. Only way would be to determine where it stores the hashed/cryptographic passcode on the disk and figure out what it is to re-gain entry.\n\nTo be blunt, I'm striving to password crack my own device. On Android this is easy, but I have heard of absolutely no one getting this done with iDevices/iOS.\n",
    "votes": "0",
    "answers": 0,
    "views": "1k",
    "tags": [
        "decryption",
        "encryption",
        "cryptography",
        "ios"
    ],
    "user": "Some girls R ignorant",
    "time": "Sep 27, 2014 at 16:58",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "So you \"bought a used iPhone\", yet you don't want to factory restore because \"all very important data will be lost\". It sounds like you're trying to recover stored data from a lost/stolen iPhone (otherwise you wouldn't care about doing a factory restore).\n",
            "time": null
        },
        {
            "user": "Igor Skochinsky",
            "text": "Please don't post duplicate questions; improve the original instead. And absolutely do not create duplicate accounts.\n",
            "time": null
        }
    ],
    "answers_data": []
}