{
    "title": "What kind of JS obfuscation is this? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/6358/what-kind-of-js-obfuscation-is-this",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions asking for help reverse-engineering a specific system are off-topic unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem.\n\n\nClosed 10 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI have read about de-obfuscating JS files and about multi-layered obfuscation. I have come across a file (which I have uploaded here) and it doesn't seem to be obfuscated except for lines 21 and 42. I there seems to be some HTML components on those lines but when I tried using JSBeautifier and JSDetox on it, it doesn't help. \n\nHave any of the reverse engineers come across this type of obfuscation? if yes, how is it done?\nIs thereany way to de-obfuscate it?\n",
    "votes": "0",
    "answers": 2,
    "views": "1k",
    "tags": [
        "obfuscation",
        "deobfuscation",
        "javascript"
    ],
    "user": "Pervy Sage",
    "time": "10 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "you can either print out the eval values on a custom html page using something like \n<pre><code><html>\n<body>\n<script>\ndocument.write('<textarea cols=\"120\" rows=\"10\">');\ndocument.write(contents of eval);\ndocument.write('</textarea>');\n</script>\n</body>\n</html>\n</code></pre>\nor use malzilla or http://matthewfl.com/unPacker.html\n",
            "votes": "2",
            "user": "Sigtran",
            "time": "Oct 1, 2014 at 16:31",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "This is dean edwards' js packer : http://dean.edwards.name/packer/. I see it quite frequently being used to obfuscate scripts as it is freely available. It's written in Javascript but there are also versions in other langages on the site.\nBy the way the Decode button and text area is only disabled via HTML attributes, so you can reenable them using The Developer Tools in Google Chrome for example :) Here are the 2 decoded scripts from your sample :\nhttp://pastebin.com/duWWwWuQ\nhttp://pastebin.com/VUaivSVk\n",
            "votes": "2",
            "user": "ekse",
            "time": "Oct 2, 2014 at 1:26",
            "is_accepted": false,
            "comments": []
        }
    ]
}