{
    "title": "R.java to xml file",
    "link": "https://reverseengineering.stackexchange.com/questions/6469/r-java-to-xml-file",
    "content": "How does <pre><code>R.java</code></pre> work? In a compiled .apk file, does it contain all constants from the XML files prior to compilation? I've decompiled an app using several Java RE tools, and used <pre><code>apktool</code></pre> to extract the resources (xml files, images and others). However, when rebuilding the project in Eclipse, the <pre><code>R.java</code></pre> generated by Eclipse (in the <pre><code>gen</code></pre> folder) does not match the original <pre><code>R.java</code></pre> from the decompiled app. Is this a common occurrence when reversing android apps? In this case, the original R.java contains fields consistent with the rest of the code. However, this is not present in the generated R.java and hence this error.\nThe decompilers I used are\n1) JEB (Commercial)\n2) jadx (Open-source)\n",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "decompilation",
        "android",
        "java"
    ],
    "user": "Nederealm",
    "time": "Oct 16, 2014 at 4:25",
    "comments": [
        {
            "user": "Nederealm",
            "text": "why the downvote?\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "Could you clarify what's the question?! I see two sentences with a question mark, but neither has a lot to do with reverse engineering.\n",
            "time": null
        },
        {
            "user": "Nederealm",
            "text": "Ok, I reworded the question. Hope it's clearer to understand\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "The R.java file created by jadx exists to be a reference between the resources id after compilation and the name of the resource mentioned throughout the code. \nIf you wish to recompile it, it is possible to recreate something that looks like the original xml files by creating a script that ignores a part of the prefix and searches for the resource's name. Once it is located inside the xml files, specify the correct one.\nAnd I think that apktool provides a much better reference to the resources xml files.\nBut if what you wanna do is make just a small change, it will be faster to do it with smali and use apktool to put it all back together again.\n",
            "votes": "1",
            "user": "DarkLighting",
            "time": "Nov 4, 2014 at 20:57",
            "is_accepted": true,
            "comments": []
        }
    ]
}