{
    "title": "Unknown game data compression method (Gamecube)",
    "link": "https://reverseengineering.stackexchange.com/questions/6527/unknown-game-data-compression-method-gamecube",
    "content": "I got some game compression data which I couldn't find any clue.\nAll compressed file signature start with: [SK_ASC] and unknown compression method.\nI got some information from RAM/Executive file but still didn't work.\nI think the compression is the lossless format (But it's not a LZO nor ZLIB).\nCan anyone help me figure out the compression, and how to decompress?\n\nAll of example file above can be found here: http://goo.gl/JJQfl4\n\n=== 10.25.14 ADDED ===\nThe list below compression method that I tested, but doesn't match:\n\nLZ10\nLZ11\nLZ77\nLZO1x-1\nLZO1x-999\nLZSS\nLZW\nLZMA\nHUFF blocksize 4 & 8 byte\nRLE\nZLIB\n\n=== 10.26.14 ADDED ===\nToday I analysis something via memory dump.\nFirst of all, compressed <pre><code>EMnMenu.cmp</code></pre> file could be loaded when I enter the main menu by guessing it's file name. and there are very similar files which is unused. (<pre><code>EKisokMenu.cmp</code></pre>, <pre><code>EE3Menu.cmp</code></pre>)\nSo I try to check memory dump by replacing file each other. and I got <pre><code>dump_menu.ram</code></pre>, <pre><code>dump_e3menu.ram</code></pre>, <pre><code>dump_kioskmenu.ram</code></pre>. By comparing three different ram dump data, I found out only specific offset data is changed.\nBy using this method, I finally got a decompression data dumped via offset: 0x80CA6980. Decompressed data is well known texture which was first 4 byte signature  start with 0x00 0x20 0xAF 0x30. (check texture format here: http://goo.gl/UqLz3m)\nI try to find compression algorithm by compressing the decompression data and compare with original data. but non of algorithm that I test above doesn't match.\nAnyway, I uploaded several decompressed data via ram dump and compressed data so you can check here: goo.gl/JJQfl4\n\nCMP is a compressed data which always start with SK_ASC.\nBIN is a same as CMP.\nDCMP is a instant copy from memory file, which was extracted from offset 0x80CA6980.\nDMP is a data value correction by subtracted 0x80CA6980 because there so many memory scrapping dummy (so this is the cleaned decompressed data if I guess right)\n\nADDED Didn't work with regular deflate/zlib all compress level.\n== 11.09.14 ==\nI posted several forum to help, but no clue for weeks :(\n\nhttp://zenhax.com/viewtopic.php?f=9&t=313&sid=3172c154c5da95476795ac742501fec1\nhttp://encode.ru/threads/2074-Identifying-compression-method?p=41188&posted=1#post41188\n\n== 11.15.14 ==\nOther forum user said to me there are Gamecube DOL (executive file) plugin for IDA.\nSo I use them and now I've found decompression main/algorithm subroutine.\nWould anyone help me find out describe how it works?\n(I'm not well in dis-assembly, So I'm learning now)\nhttp://goo.gl/2bQNfj\nPower PC based Dis-Assembly skill Required\n",
    "votes": "2",
    "answers": 0,
    "views": "1k",
    "tags": [
        "file-format",
        "decompress"
    ],
    "user": "NGC_KOR",
    "time": "Oct 6, 2015 at 4:53",
    "comments": [
        {
            "user": "Igor Skochinsky",
            "text": "You should run <pre><code>signsrch</code></pre> on the binary doing decompression, not the compressed data. Though it's quite likely the algorithm is completely custom and you'll just have to reverse it.\n",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "According to webcache.googleusercontent.com/…, <pre><code>SK_ASC</code></pre> is used for at least one game developed by Silicon Knights. The <pre><code>SK</code></pre> suggests that this is using an algorithm that's proprietary to Silicon Knights, as @IgorSkochinsky suggested.\n",
            "time": null
        },
        {
            "user": "NGC_KOR",
            "text": "@IgorSkochinsky, I used 'signsrch' on Executive/Memory file, not a compressed data. Anyway, algorithm is quite mess and still no clue.\n",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "Are you sure you uploaded the correct files? At a glance, they look very similar, and neither starts with <pre><code>SK_ASC</code></pre>.\n",
            "time": null
        },
        {
            "user": "Jongware",
            "text": "What I mean is it seems you uploaded the memory dump twice. I don't see the signature in either.\n",
            "time": null
        }
    ],
    "answers_data": []
}