{
    "title": ".idb file suddenly grew to 16GB in size",
    "link": "https://reverseengineering.stackexchange.com/questions/6592/idb-file-suddenly-grew-to-16gb-in-size",
    "content": "I'm working on a certain executable to which I add additional binary files from time to time.\nA few hours ago, I added an additional binary file to the idb I was working on like this:\n\nThe additional binary file is about 60k in size.\nWhen I next pressed ctrl+W, it took a long while for IDA to save, and then I noticed the .idb file grew to 16GB in size. It couldn't have been more than a few megabytes before that.\nI tried editing the sections and deleting the one I just added and re-saving but it doesn't seem to change anything.\nI have no backup.\nWhat can I do at this point?\nedit:\nI forgot to mention, when I try to close and tell IDA to collect garbage, it still saves 16GB worth of idb file. Telling it to deflate the database causes the resulting idb file to be 16 -MB- but when I open it again it inflates to 16GB. Specifically, the .id1 file is the heavy one.\n",
    "votes": "4",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ida"
    ],
    "user": "Sleeptime",
    "time": "Nov 5, 2014 at 15:17",
    "comments": [
        {
            "user": "0xec",
            "text": "The file may well be a sort of zip bomb\n",
            "time": null
        },
        {
            "user": "Sleeptime",
            "text": "It's a really big HTML file, practically all text\n",
            "time": null
        },
        {
            "user": "user1354557",
            "text": "Just curious- what version of IDA are you using?\n",
            "time": null
        },
        {
            "user": "Sleeptime",
            "text": "6.6.140613 (32-bit)\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Eventually what I did was start fresh. Opened the original binary, added the additional binaries again (including that 60kb one), exported the database and typeinfo from the 16gb one (file->produce file->dump database to IDC file) and imported them into the fresh copy.\nTook 2 minutes, everything's okay now and the new .idb weighs 2.5mb\n",
            "votes": "2",
            "user": "Sleeptime",
            "time": "Nov 6, 2014 at 12:15",
            "is_accepted": false,
            "comments": []
        }
    ]
}