{
    "title": "Name and Ordinal table pointers in export directory are NULL although DLL exports functions",
    "link": "https://reverseengineering.stackexchange.com/questions/6652/name-and-ordinal-table-pointers-in-export-directory-are-null-although-dll-export",
    "content": "I'm trying to explore the functions exported by profapi.dll and I came across a behavior that I can't explain. \nReading about the PE binary format I gather that the export table has 3 tables (arrays): one array containing function pointers of exported functions, another containing names (strings) of exported functions, and a third array containing the integer ordinal numbers of the exported functions. The linker needs the information in the name and/or the ordinal table to patch calls to exported functions in other DLLs. The name table pointer can be NULL if the DLL exports its functions using only ordinal numbers. \nHowever, for profapi.dll, I see that both the name table and the ordinal table pointers are NULL; yet the DLL exports 6 functions (verified using IDAPro). In fact, shell32.dll calls one of the functions in profapi.dll using its ordinal number and the linker somehow resolves the address. I'm not sure how the linker is able to resolve the call in shell32.dll. Moreover, pefile, the Python library I am using to parse the DLL reports that profapi.dll does not export any functions since both the name and ordinal table pointers are NULL. What am I missing?\nI'm using profapi.dll version 6.1.7600.16385 and shell32.dll version 6.1.7601.2278 on Windows 7. I'm using pefile version 1.2.10-139.\n",
    "votes": "1",
    "answers": 1,
    "views": "3k",
    "tags": [
        "dll",
        "pe"
    ],
    "user": "redraga",
    "time": "Nov 18, 2014 at 0:47",
    "comments": [],
    "answers_data": [
        {
            "content": "The \"ordinal table\" (also known as the Export Ordinal Table or <pre><code>AddressOfNameOrdinals</code></pre>) is used in conjunction with the \"name table\" (also known as the Export Name Pointer Table or <pre><code>AddressOfNames</code></pre>) if-and-only-if functions are exported by name.\nFrom the official PE-COFF documentation:\n\nThe export name pointer table and the export ordinal table form two\n  parallel arrays that are separated to allow natural field alignment.\n  These two tables, in effect, operate as one table, in which the Export\n  Name Pointer column points to a public (exported) name and the Export\n  Ordinal column gives the corresponding ordinal for that public name. A\n  member of the export name pointer table and a member of the export\n  ordinal table are associated by having the same position (index) in\n  their respective arrays.\n\nBut if there are no functions exported by name, then there is no Export Name Pointer Table, and if there's no Export Name Pointer Table then there's on need for the Export Ordinal Table either, which is why both fields are <pre><code>NULL</code></pre> in the Export Directory Table.\n\nIn fact, shell32.dll calls one of the functions in profapi.dll using\n  its ordinal number and the linker somehow resolves the address.\n\nThe build-time linker (part of the compiler toolkit) doesn't resolve the address; the run-time loader (part of Windows) resolves the address. The loader see that shell32.dll imports a profapi.dll function by a given ordinal number (let's say <pre><code>105</code></pre>, for example), so it subtracts profapi.dll's Ordinal Base (let's say <pre><code>101</code></pre>, for example) from the ordinal number and uses the result (<pre><code>4</code></pre> in this example) as an index into the Export Address Table to find the RVA of the imported function. Neither the Export Ordinal Table nor the Export Name Pointer Table are needed.\n\nMoreover, pefile, the Python library I am using to parse the DLL\n  reports that profapi.dll does not export any functions since both the\n  name and ordinal table pointers are NULL. What am I missing?\n\nAs discussed here, the pefile Python library is broken, or at least older versions of it are known to be broken with respect to ordinal handling.\n",
            "votes": "3",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">In addition to the official PE-COFF documentation linked above, I've always found <a href=\"http://win32assembly.programminghorizon.com/pe-tut7.html\" rel=\"nofollow noreferrer\">Iczelion's Export Table tutorial</a> to be very helpful with understanding how this all works.</span>",
                    "time": null
                }
            ]
        }
    ]
}