{
    "title": "HOW do I point the debugger towards UNPACKED version of dll stored on my filesystem during debugging [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/6684/how-do-i-point-the-debugger-towards-unpacked-version-of-dll-stored-on-my-filesys",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 10 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nHere is my problem:\nProgram P1 launches another program P2.\nThe P2 program uses a dll DLL1 which is packed using PE Compact.\nThe DLL1 is obviously unpacked  during run time and a routine inside DLL1 calls another dll DLL2 which is also packed with PE Compact.\nP1->P2->DLL1->DLL2\nI have successfully unpacked both the dlls. Now While debugging the OllyDbg shows me \"The code is packed, self extracing...\" stuff. What I want is to point the OllyDbg towards the unpacked version residing on my filesystem so that a can debug it properly.\nHow do I d this.Thanks in advance :)\n",
    "votes": "1",
    "answers": 1,
    "views": "120",
    "tags": [
        "ida",
        "ollydbg",
        "debugging",
        "packers",
        "patch-reversing"
    ],
    "user": "ASHUTOSH",
    "time": "10 years ago",
    "comments": [
        {
            "user": "user45891",
            "text": "I'm not sure if I understood you correctly but it seems that you have two original DLLs and those two unpacked on disk. If so, can't you rename the unpacked ones so they are loaded?\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "As @user45891 commented, replace DLL1_packed on disk with DLL1_unpacked, and replace DLL2_packed on disk with DLL2_unpacked.\n(@user45891, feel free to post the same answer as this, and I'll delete my answer so that you can get credit as the \"first responder\".)\n",
            "votes": "0",
            "user": "Jason Geffner",
            "time": "Nov 22, 2014 at 18:08",
            "is_accepted": false,
            "comments": []
        }
    ]
}