{
    "title": "Saving Kik conversations using VirtualBox Android device [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/6686/saving-kik-conversations-using-virtualbox-android-device",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions on software development are off-topic here, but can be asked on Stack Overflow.\n\n\nClosed 10 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm using a virtual Android device on VirtualBox to chat using \nKik. Kik doesn't officially support saving conversations, but can I do \nit using my setup? \nMy thoughts: when I take a snapshot of Andy (my VirtualBox Android \ndevice), that snapshot should contain my last n Kik conversations in \nsome form. Kik doesn't store conversations permanently, but does let \nyou scroll back through some number of them (the storage is local on \nyour device, not remote on their servers). \nI tried \"shared folders\", but I couldn't get this to work, even after \ntrying to install \"guest additions\" (which didn't appear to work \neither: I'm guessing they're only supported on certain platforms). \nHas anyone looked into doing something like this? Thoughts?\n",
    "votes": "0",
    "answers": 1,
    "views": "712",
    "tags": [
        "android",
        "virtual-machines"
    ],
    "user": null,
    "time": "10 years ago",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "It sounds like what you're doing (saving snapshots and scrolling through the message history) is already working as a solution for you. What's your question?\n",
            "time": null
        },
        {
            "user": "user10070",
            "text": "Actually, that's my backup plan. I'm assuming that the kik messages are somewhere in the .sav or .vdi file and can be extracted programatically. I 'grep'ed and found nothing, but, of course, there's no guarantee that the messages are stored in plain text-- they could be compressed or even images or something.\n",
            "time": null
        },
        {
            "user": "Fred Concklin",
            "text": "Setup a port forward and connect to the Android device using ADB. From there you should be able to access what you (e.g. if it is written to a file you can read it). If you can't, get root on the vm.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You would need to mount the VM's VDI HD image and then look through the file system for the conversation logs. If you can't easily find the logs in the file system, you'll need to reverse engineer the Kik application to determine where it's storing the conversation logs.\n",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Nov 23, 2014 at 17:39",
            "is_accepted": false,
            "comments": []
        }
    ]
}