{
    "title": "Ollydbg - Remove analysis from module",
    "link": "https://reverseengineering.stackexchange.com/questions/6889/ollydbg-remove-analysis-from-module",
    "content": "for a manuelly unpacking process, I need the option \"Remove analysis from module.\"\nIt can be reached by right-click -> Analysis -> Remove analysis from module. \nBut I can not find it in my ollydbg program (I have the version ollydbg v1.10).\nMy question:\nDo I need a plugin for that? Or can I find that option in a higher version of ollydbg ?\n",
    "votes": "1",
    "answers": 3,
    "views": "1k",
    "tags": [
        "ollydbg"
    ],
    "user": "user3097712",
    "time": "Dec 26, 2014 at 20:18",
    "comments": [],
    "answers_data": [
        {
            "content": "It's definitely in the standard OllyDbg v1.10.\nBefore right-clicking in the disassembly pane of the CPU window, be sure to left-click in the disassembly pane first so that OllyDbg sets the disassembly pane as the active pane. Once the disassembly pane is active (black disassembly text instead of gray disassembly text), you can then right click and find Remove analysis from module in the context menu:\n",
            "votes": "1",
            "user": "Jason Geffner",
            "time": "Dec 26, 2014 at 20:00",
            "is_accepted": false,
            "comments": [
                {
                    "user": "user3097712",
                    "text": "<span class=\"comment-copy\">hmmh, yes I did the same thing that you described above,  but the point is : I have only the options \"Scan object files\", \"Remove object scan from module\" and \"During next analysis, treat selection as\"</span>",
                    "time": null
                },
                {
                    "user": "user3097712",
                    "text": "<span class=\"comment-copy\">I have also take a picture how it looks like. You can see it in my edited question.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">Ah, it's because for your unpacking scenario, OllyDbg did't realize that the OEP's memory region contains code. Given that OllyDbg didn't do a code analysis on that region, there's no analysis that needs to be removed. So if you're following a tutorial, you can skip the \"Remove analysis from module\" step.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "This might also be a reason of a wrong value used in BaseOfCode member of OptionalHeader. For example if the value is larger than the code section size OllyDbg won't show the Analyze Code option. Like what Jason Geffner said if the option Remove analysis from module is missing then the Analyze wasn't made. You can also try to use AnalyzeThis! plugin.\n",
            "votes": "0",
            "user": "RCECoder",
            "time": "Dec 28, 2014 at 14:19",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "so ollydbg didn't understand the code put unnecessary code.so after doing \"Remove analysis\" from the assembly pane i got OEP\nThanks @jason Geffner\n",
            "votes": "0",
            "user": "Bikash Dash",
            "time": "Mar 8, 2016 at 14:19",
            "is_accepted": false,
            "comments": []
        }
    ]
}