{
    "title": "Writeup of reverse engineering VM based obfuscation",
    "link": "https://reverseengineering.stackexchange.com/questions/7990/writeup-of-reverse-engineering-vm-based-obfuscation",
    "content": "I've seen quite a few crackmes on reverse engineering VM's. I've also come across \"Unpacking Virtualization Obfuscators\". Are there any other writeups that you could point me to that discuss the RE'ing of a VM based obfuscation from scratch?\nAlso, is the source code for any VM based obfuscator available online?\n",
    "votes": "8",
    "answers": 3,
    "views": "3k",
    "tags": [
        "obfuscation"
    ],
    "user": null,
    "time": "Jan 9, 2015 at 21:56",
    "comments": [
        {
            "user": "0xec",
            "text": "Check out google scholar and source code of x86-virtualizer\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Here is a pretty old challenge with, among other stuff, a VM in the end. You have both the write-ups of many candidates, and the official write-up of the author, with explanations as how to do such VM-based obfuscation.\n",
            "votes": "5",
            "user": "user2823000",
            "time": "Jan 12, 2015 at 13:03",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "There's a discussion of reverse engineering virtualization-based obfuscation here.  A forerunner of this work, which in retrospect I'm not all that happy with, was published in ACM CCS 11 [link].\nI don't know of source-code availability of any VM-based obfuscators.  There's a free system called Tigress, available (in binary form) from \nhttp://tigress.cs.arizona.edu/, that performs virtualization at the C source-code level.  This system gives you a lot of control over a lot of the parameters of the obfuscator so you can experiment with different combinations of settings.  The FAQ explains the rationale for not distributing the source code.\n",
            "votes": "2",
            "user": "debray",
            "time": "Jan 13, 2015 at 22:55",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "There is a good article wrote by Rolf Rolles about it.\n",
            "votes": "1",
            "user": "Community",
            "time": "Apr 13, 2017 at 12:49",
            "is_accepted": false,
            "comments": []
        }
    ]
}