{
    "title": "Is there any way to make IDA permanently save recently used files in a list?",
    "link": "https://reverseengineering.stackexchange.com/questions/8078/is-there-any-way-to-make-ida-permanently-save-recently-used-files-in-a-list",
    "content": "I usually work with two or three IDBs open at the same time which are linked between themselves (basically the main .exe, and DLLs it loads).\nHowever, every now and then I open different files to take a look, and my \"recently used IDBs\" quickly gets filled up and the IDBs I work with disappear.\nIs there any way I can make IDA stick those IDBs at the top of the \"recently opened files\" so I can access them easily?\n",
    "votes": "1",
    "answers": 1,
    "views": "896",
    "tags": [
        "ida",
        "ida-plugin"
    ],
    "user": "rev",
    "time": "Jan 22, 2015 at 17:17",
    "comments": [],
    "answers_data": [
        {
            "content": "Assuming you're on Windows, you could write a script that regularly restores <pre><code>HKEY_CURRENT_USER\\Software\\Hex-Rays\\IDA\\History</code></pre>.\nOn Linux or Mac OS, I'm sure there's something similar than can be easily restored via a simple script.\n",
            "votes": "5",
            "user": "Jason Geffner",
            "time": "Jan 22, 2015 at 18:07",
            "is_accepted": true,
            "comments": [
                {
                    "user": "rev",
                    "text": "<span class=\"comment-copy\">I am on Windows, yes. Can I somehow make an IDC script that runs the registry script each time I load IDA?</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">Yes, with <a href=\"https://www.hex-rays.com/products/ida/support/idadoc/198.shtml\" rel=\"nofollow noreferrer\"><code>Exec()</code></a>. However, by the time it's executed IDA will likely already have read the registry info. Why not replace your IDA shortcut in Windows with a batch file that restores the registry entries and then runs IDA?</span>",
                    "time": null
                },
                {
                    "user": "rev",
                    "text": "<span class=\"comment-copy\">Could be. What if I make a plugin using IDA's SDK? Would that get loaded before?</span>",
                    "time": null
                }
            ]
        }
    ]
}