{
    "title": "Laptop monitor backlight [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/8146/laptop-monitor-backlight",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n This question does not appear to be about reverse engineering within the scope defined in the help center.\n\n\nClosed 10 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI've had two laptops, one Sony and another Acer. Sony laptops backlight can be decreased quite a bit, however the Acer laptops backlight brightness is too much.\nI was wondering where these values sit and if there is a possibility to lower the laptop screen backlight brightness any lower than their current settings.\nI don't know if this question belongs here but I've asked around a bit in forums and usual answer is to simply decrease brightness using GPU software. Yet this does nothing to the actual backlights, which in the night are eye piercing.\n",
    "votes": "0",
    "answers": 1,
    "views": "244",
    "tags": [
        "hardware"
    ],
    "user": "Tarlonn",
    "time": "10 years ago",
    "comments": [
        {
            "user": "rev",
            "text": "do you have any experience or do you want to do reverse engineering? or you're just trying to lower the brightness?\n",
            "time": null
        },
        {
            "user": "Tarlonn",
            "text": "No, my problem isn't with simply lowering brightness. I want to turn down the backlight close to dark. I've programmed in Java, C# and a little bit python but have no clue how to reverse engineer. I thought I'd modify the following source codeproject.com/Articles/236898/… to lower the backlight even further yet I found out laptops have preset for backlight. So i guess this falls under reverse engineering.\n",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "What model is your Acer laptop?\n",
            "time": null
        },
        {
            "user": "Tarlonn",
            "text": "Acer Aspire 5750G\n",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "I'm voting to close this question as off-topic because it's not about reverse engineering.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "According to the official Quick Guide for the Acer Aspire 5750G, you can use Fn+F6 to turn the backlight completely off, and you can use Fn+▷ and Fn+◁ to increase or decrease the screen brightness, respectively:\n\nThe Acer Aspire 5750G has an Intel HD Graphics 3000 integrated graphics processor. So if you need more fine-grained control over the brightness, use the Intel HD Graphics Control Panel (latest drivers for your laptop) to manually adjust the backlight brightness:\n",
            "votes": "0",
            "user": "Jason Geffner",
            "time": "Feb 3, 2015 at 14:59",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Tarlonn",
                    "text": "<span class=\"comment-copy\">I already know this but the backlight brightness is too high even at lowest for night viewing.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">I've updated the answer above after some Googling for you.</span>",
                    "time": null
                },
                {
                    "user": "Tarlonn",
                    "text": "<span class=\"comment-copy\">Thanks, i've tried that too. It does not help the backlight. Even completely black shines very brightly in the night. This is because of the backlight. I do not have the lower settings that are shown in the picture. I have latest intel drivers</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">If I were you, I'd contact customer support at Acer. There's no reason to believe that reverse engineering the drivers will allow you to lower the brightness any more than what's described above.</span>",
                    "time": null
                },
                {
                    "user": "Jason Geffner",
                    "text": "<span class=\"comment-copy\">Also, in the future, it would help if you explained in your original question what you've already tried.</span>",
                    "time": null
                }
            ]
        }
    ]
}