{
    "title": "Error decompiling apk [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/8181/error-decompiling-apk",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 10 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nIve a problem.\nI am unable to decompile a game apk successfully. I am using apktool. \nI get many errors and but i get thw files. But then many of its smali files doesnt have a .end method in its code which makes a recompile impossible.\nCan someone help me or decompile it?\nIts this file https://www.dropbox.com/s/05kj2x4zie734b9/com.asobimo.iruna_en-1.apk?dl=0\nThanks in advance \n//Edit: I figured out why it didnt work as I wanted to. The game has some kind of protection in apk since this year. So I used an older version of apk from 2014, and edited its files and set its version to actual version with APK Edit v0.4. Then save new apk and im fine =)\nThanks though for you help\n",
    "votes": "-1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "decompile",
        "apk"
    ],
    "user": "Seedlord",
    "time": "10 years ago",
    "comments": [
        {
            "user": "rev",
            "text": "just FYI, decompilation is only for you to analyze the program with ease, not to recompile it again. I haven't worked with Java (only with C#), but what you most probably should do is directly patch the bytecode.\n",
            "time": null
        },
        {
            "user": "Seedlord",
            "text": "How could i recompile successfully? There are people doing it. But they wont teach how to... my will is to delete detection of a gamehack. A smali file has the detection strings which i replace but then no recompile possibility :(\n",
            "time": null
        },
        {
            "user": "rev",
            "text": "as I said, you can't recompile as decompiler's output is not designed to be recompiled again. you'll have to patch the bytecode. hint: change the string to not detect you, should be pretty easy even if you don't understand the bytecode\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "For various reasons, it is generally not possible to decompile a non-trivial program to the point where it can be correctly recompiled. Among other things, there's a lot of things you can do in bytecode that don't correspond to Java language features, and even in the ideal case, it is hard to restructure certain complex code. \nDecompilation is useful for understanding code, but if you want to edit it, you need to learn how to patch things at the bytecode level. The easiest way to do this for APKs is using baksmali. \nRunning baksmali gives you a directory with a smali file for each class in the dex file. You can then edit the smali to make the changes you want, and run smali to reassemble everything into a new dex file. Then of course you have to add your <pre><code>classes.dex</code></pre> back into the apk, then sign and format it.\n",
            "votes": "1",
            "user": "Antimony",
            "time": "Feb 9, 2015 at 0:26",
            "is_accepted": true,
            "comments": []
        }
    ]
}