{
    "title": "Where to find a full analysis of the encryption scheme of CTB-Locker?",
    "link": "https://reverseengineering.stackexchange.com/questions/8202/where-to-find-a-full-analysis-of-the-encryption-scheme-of-ctb-locker",
    "content": "CTB-Locker is a currently active ransomware that encrypts files to lock users out.\nHere are a few links about this malware:\n\nA new generation of ransomware: Elliptic curve cryptography + Tor + Bitcoin, by Fedor Sinitsyn, July 24, 2014.\nCTB-Locker: Multilingual Malware Demands Ransom, by Pablo Ramos, January 21, 2015.\nCTB-Locker Ransomware Includes Freemium Feature, Extends Deadline, by Trend Micro, January 21, 2015.\nCTB Locker and Critroni Ransomware Information Guide and FAQ, by Lawrence Abrams, January 29, 2015.\nCTB-Locker: files decryption demonstration feature, by Zairon, February 9, 2015.\nCTB-Locker dropper, by Christophe Rieunier.\ndecryptcryptolocker.com, by FireEye and Fox IT (doesn't seems to work for CTB-Locker).\nCryptoLocker, Wikipedia (a similar Ransomware).\n\nIs there a complete analysis about the encryption used by CTB-Locker, and some hints about possible cryptanalysis based on some weaknesses of this cryptographic scheme that can be used to recover the encrypted files.\nThe idea would be to produce a (free) tool similar to decryptcryptolocker.com, that can perform the decryption for users.\n",
    "votes": "3",
    "answers": 1,
    "views": "897",
    "tags": [
        "tools",
        "malware",
        "cryptanalysis",
        "ransomware"
    ],
    "user": "perror",
    "time": "Feb 13, 2015 at 10:16",
    "comments": [
        {
            "user": "MrSynAckSter",
            "text": "Do you think this would work better on crypto stack exchange?\n",
            "time": null
        },
        {
            "user": "RoraΖ",
            "text": "@baordog He's pretty much just asking if anyone's analyzed this particular piece of malware.  Not sure the Crypto SE would know what to do with it.\n",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "I'm afraid that, even if \"us\" reverse-engineers would be able to reverse the malware to fully documented source code, we'd need the help of \"them\" crypto guys to attack it; and there was no way to succeed unless the malware writers messed up somewhere. Openssl has been open source for >10 years and we still don't know how to sniff TLS traffic.\n",
            "time": null
        },
        {
            "user": "perror",
            "text": "In fact, it seems that the cipher algorithm used by CTB-Locker has a few weaknesses and the context in which the cipher occurs is a bit peculiar because you may imagine to have access to some couple (ciphertext, cleartext) if you have a (partial) backup of your system. The point here is to recover precisely the encryption scheme of CTB-Locker to see if there is a way to break it.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I found a full analysis of the cipher algorithm of CTB-Locker performed by Zairon. \nHe's not really optimistic about the possibility to cryptanalyse the files as the first paragraph of the blog post is the following:\n\nAfter my last post about CTB-Locker I received a lot of e-mails from people asking for a complete analysis of the malware. Most of them wanted to know if it’s possible to restore the compromised files without paying the ransom. The answer is simple: it’s impossible without knowing the Master key! That key resides on the malicious server and it’s the only way to restore every single compromised file.\n\nAnd, follow a full analysis of the encryption scheme of CTB-Locker. A good reading for anybody wants to know more about it !\n\nCTB-Locker encryption/decryption scheme in details, by Zairon, February 17, 2015.\n",
            "votes": "2",
            "user": "perror",
            "time": "Feb 18, 2015 at 13:44",
            "is_accepted": true,
            "comments": []
        }
    ]
}