{
    "title": "cost, time and tools had Google reverse-engineered Java packages? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/8334/cost-time-and-tools-had-google-reverse-engineered-java-packages",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 10 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nIn the context of Oracle vs. Google:\n\nThis is not a case where Google reverse-engineered Oracle’s Java\n  packages to gain access to unprotected functional elements contained\n  therein.\n\npage 48 ORACLE AMERICA , INC . v. GOOGLE INC .\nMy question is, had Google, or, were to Google to reverse engineer Oracle's Java packages:\nWhat tools would Google have used?\nHow long would it have taken, approximately?\nWhat would've been the estimated cost?\n\n(I'm not asking whether or not an API should or can be copyrighted, or the merits of what Google did.)\n(To clarify:  Google didn't reverse engineer \"Java\"; at least one comment defines what they did as refactoring.)\n",
    "votes": "1",
    "answers": 1,
    "views": "303",
    "tags": [
        "disassembly",
        "android",
        "java",
        "api",
        "dalvik"
    ],
    "user": "Thufir",
    "time": "10 years ago",
    "comments": [
        {
            "user": "joxeankoret",
            "text": "As far as I know, the source code of Java is freely available.\n",
            "time": null
        },
        {
            "user": "Thufir",
            "text": "@joxeankoret yes, it is..but there's a licensing agreement.  So, I really, really, don't want to troll, that's not the intent.  It's a very narrow technical question.  I can put the question in context of appeals court decision, but that's wayyy off topic..\n",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "Reading publicly available source code doesn't count as reverse engineering. So there was no reason for them to reverse engineer anything. Now, IF they had had only the .class files, they would have had to use a java decompiler, possibly fix decompiler errors, annotate the sources, do some optimizations, whatever. But there's no serious way to guesstimate timeframe and cost - running something like <pre><code>jd-gui</code></pre> over the java classes cost an hour. Cleaning the source code and assigning meaningful comments costs months.\n",
            "time": null
        },
        {
            "user": "Thufir",
            "text": "@GuntramBlohm the reason to reverse engineer is because OpenJDK is under the GPL; Google uses the ASL, instead.\n",
            "time": null
        },
        {
            "user": "Guntram Blohm",
            "text": "License issues can be a reason to re-engineer something (build a new software from scratch that behaves like the original, but doesn't share code with the original). This something different from reverse-enigneering, (investigate an implementation to find out how it works). Google re-engineered Java, but they didnt - and didn't have to - reverse-enigneer Java.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "As I understand it, they didn't reverse engineer anything. They wrote an independent implementation based on reading the documentation of the APIs. Oracle's contention was that simply having the same method names in the APIs was a copyright violation, which is obviously silly.\n",
            "votes": "3",
            "user": "Antimony",
            "time": "Feb 25, 2015 at 16:01",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Thufir",
                    "text": "<span class=\"comment-copy\">Agreed, they didn't reverse engineer.  The question is hypothetical:  \"what if?\"  What I'm asking is, and I think Guntram gave most of the answer, is that they would've/could've done the reverse engineering with <code>jd-gui</code>, and, based on his estimate, it would've meant months of delay.</span>",
                    "time": null
                },
                {
                    "user": "Antimony",
                    "text": "<span class=\"comment-copy\">Why would do you anything with jd-gui? At least use a real decompiler like procyon.</span>",
                    "time": null
                },
                {
                    "user": "Thufir",
                    "text": "<span class=\"comment-copy\">sure, I just asking, in general, what tools would be involved and, just to estimate, the cost and time involved to actually reverse engineer on this scale.</span>",
                    "time": null
                }
            ]
        }
    ]
}