{
    "title": "I wonder about the SPI memory access [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/8355/i-wonder-about-the-spi-memory-access",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 10 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nGood evening.\nI have a question.\nI have been using router has failed.\nI would like to proceed with the SPI memory dump.\nAnd I have connected to the SPI memory in the router board using the Bus Pirate.\nDo I have to connect power to the router board?\nBus Pirate do you only need to connect a power source?\nThanks\n",
    "votes": "0",
    "answers": 1,
    "views": "189",
    "tags": [
        "spi"
    ],
    "user": "malware",
    "time": "10 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "This can be a little awkward from time to time.\nThere are several ways this can pan out. In approximate order of lazyness:\n\nYou allow the router to provide power and the Bus Pirate attempts to drive the CS, clock, MOSI and reads MISO. \n\nThe problem here will be that you need the master CS and clock to be in a high-impedance state for this to work. Because the master knows it will be driving these signals, this isn't always the case. For power saving purposes though, a lot of masters will let these go high impedance.\nYou also rely on the master not responding in anyway to unprompted changes in MISO. If the master sees a change of MISO and responds, you will end up with garbage.\n\nYou allow the Bus Pirate to provide power.\n\nSometimes this works when 1 fails. This relies on the circuit somehow isolating the power supply to the memory device from the master of the SPI bus. You end up powering the memory device and not the master. Bigger boards sometimes isolate the power supplies, but often you'll just end up in the same situation as 1.\n\nHope the device reads the entire useful memory of the device and sniff bus.\n\nQuite a lot of routers using SPI memory for settings or firmware read the entire device sequentially at start-up, or if you issue a command to write settings to the device they will write it out. Alternatively, most devices will eventually read all of the memory addresses they actually need, and you can sniff these and reconstruct the memory.\n\nCut the power between the memory device and master, use Bus Pirate for power.\n\nSometimes there is a very easy place to cut the power between the memory device and master. You probably want it to be repairable.\n\nDesolder the entire memory device and dump it.\nIf all the others fail, you need to do this.\n",
            "votes": "1",
            "user": "Cybergibbons",
            "time": "Mar 1, 2015 at 22:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}