{
    "title": "Obfuscating jar already obfuscated [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/8479/obfuscating-jar-already-obfuscated",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions asking for help reverse-engineering a specific system are off-topic unless they demonstrate an understanding of the concepts involved and clearly identify a specific problem.\n\n\nClosed 10 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm wondering what happens if we try to run a jar through Proguard that has already been obfuscated by another obfuscator or Proguard itself? Will the obfuscated class names and methods names be changed by the new obfuscator?\nFor example, I would like to have those names renamed to something simpler such as <pre><code>a</code></pre> or <pre><code>aab</code></pre> rather than unicode characters. Will another obfuscator change the names?\n",
    "votes": "1",
    "answers": 2,
    "views": "1k",
    "tags": [
        "obfuscation",
        "java"
    ],
    "user": "Nederealm",
    "time": "10 years ago",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "Why don't you just try it out?\n",
            "time": null
        },
        {
            "user": "diff",
            "text": "Proguard is used on Java code, so you'd have to run a JAR through JAD (or similar decompiler) first before you could even attempt this.  Assuming nothing fails in this process (which depends on the obfuscator) you could reprocess the decompiled code with proguard, though I'm unsure this would result in the desired \"simpler\" names.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It's reasonable to assume ProGuard (or any other alike software) cannot tell if a name is deliberately unclear or not. If it could, it would be reversible -- create 'sensible' names for those that it deemed unclear.\n(Which would be a useful program. I have seen \"plain\" code with such bad names that it already looked quite obfuscated. Some of it was my own. My younger self did not think my older self would ever need to understand his code.)\nEven if obfuscating 'again' may change the names (again), it will not add an entire new \"level of obfuscation\".\n",
            "votes": "1",
            "user": "Jongware",
            "time": "Mar 16, 2015 at 22:58",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Nederealm",
                    "text": "<span class=\"comment-copy\">Thanks for pointing that out. I've edited the question to include a specific example. That was basically my question. I would like to achieve the desired effect of changing the class names in the jar to use ASCII rather than UTF-8 chars in the names.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "It all depends on what the obfuscator does. Proguard is a relatively weak obfuscator - it basically only renames things and strips out unused methods. So running Proguard on the same application twice is pretty much useless, but it won't cause any ill effects.\nIf you use a stronger obfuscator however, things will almost certainly break. For example, Allatori and Stringer both encrypt constant strings with a key derived from the class and method name of the caller. At runtime, the string decrpytion function uses various hacks to get the name of the caller and then decrypts the string with that. \nIf you then run Proguard on the obfuscated application, Proguard will blindly rename the classes, meaning that when the string decryption functions are called, the decryption key will be incorrect and the application will get garbage strings at best or much more likely just crash.\n",
            "votes": "3",
            "user": "Antimony",
            "time": "Mar 17, 2015 at 2:42",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Nederealm",
                    "text": "<span class=\"comment-copy\">Last paragraph assumes reflection is being applied to load classes dynamically?</span>",
                    "time": null
                },
                {
                    "user": "Antimony",
                    "text": "<span class=\"comment-copy\">@Nederealm No the reflection is used by the string decryption functions. Presumably it's intended to stop people from decrypting the strings by just calling the functions blindly though it's easily circumvented.</span>",
                    "time": null
                }
            ]
        }
    ]
}