{
    "title": "Is there a way to tell the IDA debugger to apply all patches from the database?",
    "link": "https://reverseengineering.stackexchange.com/questions/8522/is-there-a-way-to-tell-the-ida-debugger-to-apply-all-patches-from-the-database",
    "content": "I'm in the process of \"enhancing\" an Android application that comes with a huge compiled .so file. After patching about 200 bytes in the database, i'd like to attach to the running app, apply all these patches to the loaded shared library, continue the app, and debug my changes; then detach from the app and undo the changes again.\nCan IDA do this, or is there a plugin to do this?\nI know i can write back all my changes to the .so file and restart the app, but i don't want to do this at the moment (for various reasons, one being i suspect the app does a checksum on the library when it's first loaded in memory.\nI also know i can patch single bytes interactively in memory while the debugger is attached, but my changes are a bit too extensive to want me enter them over and over again with each debug session.\n",
    "votes": "2",
    "answers": 2,
    "views": "786",
    "tags": [
        "ida",
        "debuggers",
        "patching"
    ],
    "user": "Guntram Blohm",
    "time": "Mar 22, 2015 at 21:57",
    "comments": [],
    "answers_data": [
        {
            "content": "Ida patcher might help you with some of this. \nhttps://thesprawl.org/projects/ida-patcher/\n",
            "votes": "2",
            "user": "tyh",
            "time": "Mar 23, 2015 at 0:04",
            "is_accepted": false,
            "comments": [
                {
                    "user": "Guntram Blohm",
                    "text": "<span class=\"comment-copy\">Thank you for your answer. Unfortunately, it doesn't help much - it makes the process of getting bytes into IDA easier (so if i assemble something outside ida, i can copy the object code instead of typing it), but it doesn't do anything with the debugged target.</span>",
                    "time": null
                }
            ]
        },
        {
            "content": "The point of the debugger is to show what actually is in memory and not what happens to be present in the database. That said, I imagine you can  come up with some script based on <pre><code>visit_patched_bytes()</code></pre>, <pre><code>get_original_byte()</code></pre> and <pre><code>get_db_byte()</code></pre>.\n",
            "votes": "1",
            "user": "Igor Skochinsky",
            "time": "Jul 1, 2020 at 6:48",
            "is_accepted": false,
            "comments": []
        }
    ]
}