{
    "title": "Custom gdb output",
    "link": "https://reverseengineering.stackexchange.com/questions/8622/custom-gdb-output",
    "content": "Yesterday i noticed a nice output from dbg while going through a write up on the internet. As am new to dbg i googled a lot as i wanted to make dbg work similar for me. As seen below this customisation would help me a lot with my work with all the data displayed instantaneously. I tried voltron from the below link but was unable to get it working with many errors. https://github.com/snare/voltron\nIs there any extension other than voltron so that i can get the output as shown in the link below? Would editing the .dbginit file help in any way?\nhttps://i.sstatic.net/Pg9JH.jpg\nTIA\nRegards\n",
    "votes": "2",
    "answers": 1,
    "views": "755",
    "tags": [
        "debuggers",
        "linux",
        "gdb"
    ],
    "user": "m4v3rick",
    "time": "Apr 2, 2015 at 6:00",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "Are you writing <pre><code>dbg</code></pre> instead of <pre><code>gdb</code></pre> in your text on purpose, or is that a spelling checker wrecking havoc? You might want to check gdb -tui.\n",
            "time": null
        },
        {
            "user": "blabb",
            "text": "iirc you are looking at mammons gdbinit should be downloadable at woodmanns or at github\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "what you show looks a lot like PEDA (PEDA Github repo) a Python extension to GDB. Although PEDA is very good, it looks like it is not being actively developed anymore. \nA newer incarnation of this idea is GEF (GDB Enhanced Features) (GEF Github repo). It is written in Python as well and it has the advantage of bein multi-architecture (Intel, ARM, MIPS, etc.)\nBoth require a minimal change in your .gdbinit to work, no tedious installation, dependencies or anything like that.\nHave fun debugging!\n",
            "votes": "3",
            "user": "Carlos Garcia",
            "time": "Apr 2, 2015 at 18:12",
            "is_accepted": true,
            "comments": [
                {
                    "user": "m4v3rick",
                    "text": "<span class=\"comment-copy\">Thanks for the reply. That  solved my problem. It is time to have fun with PEDA and GEF than :)</span>",
                    "time": null
                }
            ]
        }
    ]
}