{
    "title": "Command for Command line plugin does not work",
    "link": "https://reverseengineering.stackexchange.com/questions/8630/command-for-command-line-plugin-does-not-work",
    "content": "I need to analyse a sample which creates a child process. I want to analyze the child process, too, but I have the following problem. Therefore, I take the command line plugin for my olldbg v1.10 and type the following command:\n<pre><code>childdbg 1\n</code></pre>\n(that is also described at https://stackoverflow.com/questions/21695192/can-ollydbg-trace-a-launched-exe by blabb )\nBut the plugin says:\n<pre><code> Unrecognized command: CHILDDBG\n</code></pre>\nWhy this appears? How can I fix it ?\nPS:\nBefore somebody recommend me to use ollydbg v2.01 (because it has a built-in option to debug a child process), I can say that I can not open the sample with ollydb v2.01 but this is a topic which I asked here: \"Debugged application has modified the debugging registers\" with ollydbg 2.01\nbest regards,\n",
    "votes": "3",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ollydbg",
        "process",
        "plugin",
        "command-line",
        "error"
    ],
    "user": "user3097712",
    "time": "Sep 28, 2018 at 0:42",
    "comments": [],
    "answers_data": [
        {
            "content": "the latest version is available in blog entry  \nhttps://www.openrce.org/repositories/users/anonymouse/ModifiedCommandLinePluginWithChildDbg_Date_16082008.rar \nif the link did not work you can download a modified version of the plugin with an additional command .writemem  compiler has been changed to vc++ and old code modified to suit vc++  so the functionality of old commands not tested use it cautiously. i have tested only the .writemem functionality\nsome background for the additional command can be found here \nhttps://stackoverflow.com/questions/28488750/how-to-automate-task-in-ollydbg-using-ollyscript-or-any-other-tool/28556003#28556003\nhttp://wikisend.com/download/750442/cmdline.dll\n",
            "votes": "2",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": true,
            "comments": [
                {
                    "user": "user3097712",
                    "text": "<span class=\"comment-copy\">ah, ok. thanks, now it works. Ahm, for those who have the same problem with childdbg. In my case, the link provided by blabb maked some problems with the firefox browser. So, I try to open the link with Google Chrome, it works. (and with IE it also works).</span>",
                    "time": null
                },
                {
                    "user": "blabb",
                    "text": "<span class=\"comment-copy\">i have added an additional download link to another modifed version  (compiled dll) this dll was created with the same code base but with an additional command .writemem and the compiler replaced from bcc5.5 to vc++ 2010 express by me old commands untested so if you find any problem pl post back or msg me so that i can take a look</span>",
                    "time": null
                }
            ]
        }
    ]
}