{
    "title": "How was the Zero Flag implemented on Z80 ALU?",
    "link": "https://reverseengineering.stackexchange.com/questions/8755/how-was-the-zero-flag-implemented-on-z80-alu",
    "content": "Z80 was a popular 8-bit processor with a 4-bit ALU.\n\nImplementing a zero flag for a register should be straight forward, it would be a logical <pre><code>NOR</code></pre> of all the bits on the register.\n\nSomething like that would work for a small number of inputs. As for a 64-bit processor you cannot make one gigantic <pre><code>NOR</code></pre> gate with 64 inputs. The fan-in would be too high. 8 transistors would be in series. The circuit capacitance would be high thus slowing down everything else.\nI can see some other options.\n\nThe zero flag could be generated directly from the 8-bit result using 2 level logic.\n\n\n\n\nThe zero flag could be generated directly from the 8-bit result using 3 level logic.\n\n\n\nThe zero flag could be generated from each nibble and then put together, like if there was a \"half\"-zero flag. The result for the lower would be saved using a flip-flop while waiting for the high nibble result to be calculated.\n\n\nKen Shirriff wrote a nice article about reverse engineering the Z80 ALU. However when it comes to the zero flag he states:\n\nNot shown in the block diagram are the simple circuits to compute parity, test for zero, and check if a 4-bit value is less than 10. These values are used to set the condition flags.\n\nSo, although they are simple circuits I would like to know exactly how they were implemented and if they used any of the implementations proposed above or something else completely different.\n",
    "votes": "8",
    "answers": 1,
    "views": "1k",
    "tags": [
        "hardware"
    ],
    "user": "GabrielOshiro",
    "time": "Apr 27, 2015 at 20:25",
    "comments": [
        {
            "user": "caskey",
            "text": "Your assertion that the \"fan in would be too high\" has hidden assumptions that may not be valid.\n",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "Please ask instead at electronics.stackexchange.com\n",
            "time": null
        },
        {
            "user": "GabrielOshiro",
            "text": "@JasonGeffner The question is about reverse engineering. I want to know exactly how something was implemented. I have no doubts on how the electronics behind it work.\n",
            "time": null
        },
        {
            "user": "Spektre",
            "text": "@GabrielOshiro nice images but you forget the simplest one: wired or + single negator. The zero flag can be located anywhere (ALU,Register file,any of the data BUS,...)  and also would need some gating because not all operations change ZF. The truth can be found only by examinaning the DIE (which is time consuming) or ask someone that created the Z80 circuitry/die masks inside Zilog Company ...or the clones copies like U880A ...\n",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "For reference, here's the question on the Electrical Engineering Stack Exchange.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Well if you want to know how it was done exactly\nThen download the Z80 die shot of model you want to investigate, crop the ALU part and identify all the gates you can until you dig to Zero flag your self (sorry for indirect answer).\nHere my Z80 ALU post processed die shot\n\n\nwhite - metal\ngreen - poly-Si\nred   - dopped-Si (diffusion)\nGray  - conductive joints between layers\n\nTry to identify all gates and buses you can (and mark them to the image)\n\nWhen found familiar structure like Wire OR, (N)OR cascade, ... then you will know for sure. Just try to find the basic components like:\n\nform the circuit schematics and make some sense of it.\n",
            "votes": "13",
            "user": "Spektre",
            "time": "Jun 8, 2016 at 11:55",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Jason C",
                    "text": "<span class=\"comment-copy\">Of course Spektre is telling you <i>how</i> to reverse engineer it, you <i>did</i> ask on a site called Reverse Engineering! :)</span>",
                    "time": null
                },
                {
                    "user": "GabrielOshiro",
                    "text": "<span class=\"comment-copy\">@Spektre Thanks for you answer! You got the reward :P</span>",
                    "time": null
                }
            ]
        }
    ]
}