{
    "title": "Reverse Engineering an iBaby M6",
    "link": "https://reverseengineering.stackexchange.com/questions/8795/reverse-engineering-an-ibaby-m6",
    "content": "The iBaby M6 is a pretty cool baby monitoring system with neat features.  It has Android and iPhone apps but unfortunately, there's no PC interface.\nI was thinking that if the camera was broadcasting video, it should be possible to use VLC on a PC or Linux to watch the broadcast video and perhaps sound.\nFrom the setup instructions, I know the iBaby has net connectivity through your home wifi.  Yet when I look at my modem/router's list of clients, I don't see it.\nI'm currently in the Android app looking at my baby, and logged into my modem, looking at the list of attached clients.  I don't see the iBaby in the list of wireless clients (or any clients at all).\nHow is this possible?\n",
    "votes": "1",
    "answers": 1,
    "views": "162",
    "tags": [
        "hardware",
        "networking"
    ],
    "user": "Mathematician",
    "time": "May 3, 2015 at 3:53",
    "comments": [],
    "answers_data": [
        {
            "content": "I'd imagine this is a limitation of your router/AP that is preventing you from seeing the connection. Different routers do it differently - some show all associated WiFi clients, other only clients using DHCP, some anything that has shown up on ARP. \nThe iBaby M6 manual download doesn't appear to work at the moment, but reading the questions on their site, it sounds like you had to connect a USB cable to transfer the WiFi settings into the camera before it would connect. It then appears to be a \"cloud\" based (read \"connects to an external server). \nThe only way you are really going to see what is going on is sniffing or proxying the traffic from your phone. I would suggest using something like Burp Suite or Fiddler to do this, and see what is going on.\n",
            "votes": "1",
            "user": "Cybergibbons",
            "time": "May 3, 2015 at 7:51",
            "is_accepted": false,
            "comments": []
        }
    ]
}