{
    "title": "Calling functions from IDAPython",
    "link": "https://reverseengineering.stackexchange.com/questions/8817/calling-functions-from-idapython",
    "content": "I wrote a script containing several functions, which I loaded in IDA pro. From IDAPython now I'd want to call a specific function. Is it possible? Which idaapi functions should I use to call my functions in the script?\nEDIT:\nI am running IDA on a linux system and the script has been written in python.\n",
    "votes": "2",
    "answers": 1,
    "views": "2k",
    "tags": [
        "ida",
        "idapython",
        "ida-plugin"
    ],
    "user": "badnack",
    "time": "May 5, 2015 at 8:19",
    "comments": [
        {
            "user": "w s",
            "text": "how did you load these functions to IDA pro ? Is the script is wrote in  IDAPython too ?\n",
            "time": null
        },
        {
            "user": "badnack",
            "text": "Just updated the post. I uploaded the script using the IDA functionality\n",
            "time": null
        },
        {
            "user": "w s",
            "text": "Would you please explain which IDA functionality did you use ? And how are you going to run your script ?\n",
            "time": null
        },
        {
            "user": "badnack",
            "text": "What do you mean? I just load the script using File->Load file->Script file. Or by using (from shell) ida -Smyscript mybin\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "You have 3 alternatives:\n\nYou can just run the function by its name. If you already ran your script, defined functions should remain in the Python interpreter context.\nYou can add the path of your script to sys.path and import the script again. It should looks as follows:\n<pre><code>import sys\n\nsys.path.append(\"path to your folder with the script\")\n\nimport your_script_name\n</code></pre>\nYou can add this (addition to sys.path and import) into file <pre><code>idapythonrc.py</code></pre> in the root of IDA installation and this script will be imported each time you running IDA.\n",
            "votes": "3",
            "user": "perror",
            "time": "May 5, 2015 at 11:06",
            "is_accepted": true,
            "comments": []
        }
    ]
}