{
    "title": "10 years as erp consultant. Is too late to become an ethical hacker? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/8978/10-years-as-erp-consultant-is-too-late-to-become-an-ethical-hacker",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI am working as an ERP consultant for post 10 years. I find Ethical hacking and reverse engineering very interesting and want to become one. I have been reading some books and also watching videos. But, is it too late to choose that as a career? If not, what should I do, learn and imbibe?\nEDIT:Sorry folks! Only from the downvotes I realized that this question is opinion based and SO is not for such questions. However, from the comments and replies, I sense some motivation enough to fuel me. I will be deleting this post shortly.Thanks!\n",
    "votes": "-3",
    "answers": 1,
    "views": "258",
    "tags": [
        "career-advice"
    ],
    "user": "Rao",
    "time": "9 years ago",
    "comments": [
        {
            "user": "w s",
            "text": "It depends on your career objectives. It's not that obvious what are you tying to achieve in your life. It's also not that obvious where are you living.\n",
            "time": null
        },
        {
            "user": "0xC0000022L",
            "text": "I have no quarrel with this question other than that it's opinion-based and was asked on SO and closed there for that reason. It's never too late to become an ethical hacker, I'd say. It's defined by your deeds. But aside from the above shortcoming of your question it's not even clear which part of \"ethical hacker\" you have or have not achieved and thus want to achieve? I.e. do you have hacking skills but were mostly a blackhat? Being an ERP consultant doesn't exactly preclude that possibility.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Note: This is a very opinion based answer, so some people will strongly disagree with me. But your question doesn't have a real good answer that would be valid for others as well.\nMy personal experience is that, to be good at hacking, ethical or not, you need to have a very strong drive to want to find out how things work, an eye for technical details, and the ability to figure out things of your own.\nNoone i know who is good at hacking, reverse engineering, or anything in related fields, decided one day \"I'd like to be a hacker, so let's learn how to do it\". Rather, these guys cut open the heads of their sister's dolls at the age of 6 to find out how the mechanism worked that closed the eyes when you laid them to bed, got their first electrical shock at 12 when they opened some electronics device, and started hacking as a hobby in their teens. Staying up all night to finally find out how something worked seemed to be much more rewarding that, say, talking an alcoholic drink out of a barkeeper when you were underage.\nLater, they turned the experience they had with this kind of stuff into a job. Much of this job belongs of long, arduous sessions at the computer, paying attention to every little detail, until you finally get your reward in that \"yay! I did it!\" feeling.\nThis kind of person is not, in my opinion, somebody who does an ERP consultant job for 10 years, given the chance to choose. But in the end, it's up to you to decide if you're this type.\nI know many people who do a job they don't really like, work from 9 to 5 to earn their living, don't even want to think or talk about their job in their free time, and are still moderately successful in terms of money or social status. This is ok; many jobs aren't that demanding, but need to be done. However, this won't work if you intend to be a hacker. To be a successful hacker, you don't have to want to be a successful hacker, you have to be curious, need an intense appetite to satisfy that curiosity, and have a strong will to never stop attacking a problem until you solve it.\nNow, it's up to you to decide if that appeals to you.\n",
            "votes": "2",
            "user": "Guntram Blohm",
            "time": "May 25, 2015 at 14:17",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Rao",
                    "text": "<span class=\"comment-copy\">Thank you Guntram for such a detailed opinion!  Certainly this was not a flash thought. I could actually relate to few of those traits. However I think I could not focus that drive into my career and this ERP consultant job was not out of choice. Time and again I had been trying to switch the track but without any success. Perhaps due to a constant hesitation. Still programming and reverse engineering is what I have a flair and appetite for.  But just these few traits and interests are not enough to define me as a hacker in making. So, its time for me to retrospect and act.</span>",
                    "time": null
                }
            ]
        }
    ]
}