{
    "title": "Conditional instructions on ARM",
    "link": "https://reverseengineering.stackexchange.com/questions/8989/conditional-instructions-on-arm",
    "content": "I'm trying to understand the syntax of the <pre><code>IT</code></pre> instruction that is to be used to enable conditional execution of instructions on ARM, in Thumb2 mode.\nThe way I understand it, the bits in the CPSR register along with the <pre><code>IT</code></pre> instruction make conditional execution possible in Thumb mode. If I were writing some Thumb2 code perhaps I could go about following the process mentioned below.\nLets say I have 4 conditional instructions(the maximum limit suported by <pre><code>IT</code></pre>).\n\nFirst, I write down by conditional instructions. Lets say the prefixes for the four instructions are <pre><code>CLZNE.W</code></pre>, <pre><code>CLZEQ.W</code></pre>, <pre><code>ADDEQ</code></pre>, <pre><code>ADDNEQ</code></pre>.\nNow before the conditional instructions I add an instruction of the form <pre><code>ITEEE NE</code></pre>. The NE is added as the first instruction has an NE. The <pre><code>EEE</code></pre> following the IT are added as the last 3 instructions are the converse of an <pre><code>NE</code></pre>. Is this how assembly programmers write conditional thumb2 ARM code? Is my understanding of the process correct?\nWhy is the condition encoded in both <pre><code>IT</code></pre> and the instructions that follow?\n",
    "votes": "2",
    "answers": 2,
    "views": "660",
    "tags": [
        "arm"
    ],
    "user": null,
    "time": "May 26, 2015 at 12:26",
    "comments": [
        {
            "user": "perror",
            "text": "Usually, when I am not sure about the semantics of an ARM instruction, I use this website. It always give you a good insight of what really does the instruction.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "As far as I understand you described the process of using IT instructions correctly. This is exactly how one of compilers I worked with works.\n[EDIT]\nAccording to (for example) ARM Architecture Reference Manual document conditions are not encoded in most of conditionally executed Thumb instructions (except of jumps and some others) and it is the thing that defines the reason for IT instruction and all its variants existence.\nUnfortunately I couldn't find exact Thumb 2 encoding reference, but I think that it behaves the same as in Thumb.\n[ONE MORE EDIT]\nYes, it is correct,both thumb and thumb II instructions I looked to does not have condition field (for example addition instructions and other ALU related things). The document I found it in is ARMv7-A -R Architecture Reference Manual, its download requires registration. So regarding your question number 3 - conditions in IT compliant operations are definitely not encoded in instruction itself.\n",
            "votes": "1",
            "user": "w s",
            "time": "May 27, 2015 at 9:26",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "The condition codes displayed after the instructions is a convenience feature of the disassembler (deduced from the preceding <pre><code>IT</code></pre> instruction), the individual Thumb-2 instructions do not encode the condition codes. Adding condition codes even if they're not encoded is also the practice recommended by ARM when writing UAL assembly. This serves two purposes:\n\nThe assembler can check that the <pre><code>IT</code></pre> instruction matches the following conditional-suffixed instructions (e.g. all <pre><code>T</code></pre> instructions use the same condition as <pre><code>IT</code></pre> itself and all <pre><code>E</code></pre> ones use the opposite one),and no conditional instructions appear outside of the <pre><code>IT</code></pre> range.\nThe same assembly can be used when assembling for ARM mode - the IT instruction is ignored  (or hidden by an <pre><code>ifdef</code></pre>) and conditional instructions are assembled as regular conditional ARM instructions.\n",
            "votes": "1",
            "user": "Community",
            "time": "May 23, 2017 at 12:37",
            "is_accepted": false,
            "comments": []
        }
    ]
}