{
    "title": "decoding blob into original file [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/8999/decoding-blob-into-original-file",
    "content": "Closed. This question needs details or clarity. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Add details and clarify the problem by editing this post.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI have a program which converts file to blob in sqlite database. It uses QT framework. I can normally save the file from the database but only through its GUI (which is really painful).\nI want to be able to decode the blob in sqlite to the original file.\nI have attached the original and encoded file here link\n(click download button)\nIt is likely using qtarray and qstring but I am not sure. It seems also that the header is removed while encoding.\nI would really appreciate your help.\n",
    "votes": "0",
    "answers": 1,
    "views": "5k",
    "tags": [
        "decryption"
    ],
    "user": "schrodinger",
    "time": "9 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "The blob file is compressed with zlib, so you have to decompress it first. The first 4 bytes of the blob is the decompressed size and the compressed content start at 6th byte.\nAfter the decompression you got binary file starting with <pre><code>0xDEADBEAF</code></pre> (in big-endian, marked as yellow in the figure). After it you can find some header parameters, one of the <pre><code>0x22</code></pre> (marked as green) is the number of rows.\nAfter the header you can find the row data as 32-bit float (see float conversion here):\n<pre><code>6 = 06\n0.756431 = 0x3f41a578\n-1.494892 = 0xbfbf589f\n</code></pre>\n",
            "votes": "7",
            "user": "ebux",
            "time": "May 27, 2015 at 13:38",
            "is_accepted": true,
            "comments": [
                {
                    "user": "schrodinger",
                    "text": "<span class=\"comment-copy\">I am really so much thankful for this.... I got everything except the part you said (one of the 0x22 (marked as green) is the number of rows.).....what do you mean by number of rows=22</span>",
                    "time": null
                },
                {
                    "user": "ebux",
                    "text": "<span class=\"comment-copy\">0x22 = 34, and you had 34 rows in your xed file (see the first line of it)</span>",
                    "time": null
                }
            ]
        }
    ]
}