{
    "title": "infosec reverse engineering course [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/9015/infosec-reverse-engineering-course",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nDid anyone take infosec institute's reverse engineering course? I'd like to know if it's worth my money, I didn't find feedback about the course on the web. Thank you.\nFor the people downvoting my post...why is that? Because of the tags? Using a tag is mandatory and I couldn't post with more appropriate tags like \"institute\" or \"company\" or something like that. The question is pertinent because it's about an institute that teaches reverse engineering. So I really don't get why the downvotes...don't you want to know how good a R$2000 reverse engineering course is before taking it??\n",
    "votes": "-2",
    "answers": 1,
    "views": "203",
    "tags": [
        "disassembly",
        "program-analysis"
    ],
    "user": "savram",
    "time": "9 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "The material is good for the course but the presentation and presenter suck big time. He pretty much reads from the slides directly. That said, the LABs and material is good. I have learned a lot.\n",
            "votes": "1",
            "user": "Jacob",
            "time": "May 29, 2015 at 12:24",
            "is_accepted": false,
            "comments": [
                {
                    "user": "savram",
                    "text": "<span class=\"comment-copy\">Thank you for your reply. The course is pretty expensive...over R$2000. Did you manage to get a discount and how? So you recommend taking the course despite its price and presentation/presenter? Or do you think although you learned a lot everything that was taught can be found on the web?(where then?). Thank you.</span>",
                    "time": null
                },
                {
                    "user": "Jacob",
                    "text": "<span class=\"comment-copy\">I would still recommend you to take it as the material is good</span>",
                    "time": null
                },
                {
                    "user": "Jacob",
                    "text": "<span class=\"comment-copy\">They will give you discount if you push them down on the price.</span>",
                    "time": null
                },
                {
                    "user": "broadway",
                    "text": "<span class=\"comment-copy\">Based on ISI's prior history, I probably wouldn't personally take one of their courses. <a href=\"http://securityerrata.org/errata/charlatan/infosec_institute/\" rel=\"nofollow noreferrer\">securityerrata.org/errata/charlatan/infosec_institute</a></span>",
                    "time": null
                },
                {
                    "user": "savram",
                    "text": "<span class=\"comment-copy\">Hmm thanks didn't know about the plagiarism. It also says where they took the material from...very useful.</span>",
                    "time": null
                }
            ]
        }
    ]
}