{
    "title": "Initial ESP and EBP values (Windows x86)",
    "link": "https://reverseengineering.stackexchange.com/questions/9018/initial-esp-and-ebp-values-windows-x86",
    "content": "After PE loads into memory, sections are mapped depending on IMAGE_BASE value (assume there is no ASLR and it is always the same) and sections table.\nMy question, how EBP value is determined (I assume ESP can be found of EBP). Can it be any valid memory address, or is it calculated depending on some rules?\n",
    "votes": "1",
    "answers": 1,
    "views": "2k",
    "tags": [
        "x86",
        "register"
    ],
    "user": "ST3",
    "time": "May 29, 2015 at 14:32",
    "comments": [
        {
            "user": "0xec",
            "text": "See here\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "The stack is allocated as part of the loading procedure, after the process is mapped into memory.  Its reserve size plays a part in where it can be placed in memory.  The location of the stack is not fixed, but ends up with a common value when the stack size and process image base is the default size.  It's simply the result of a memory allocation function, which finds the lowest location in memory that can satisfy the request.\nSince the stack grows downwards, ESP initially points to the top of the stack.  When the process starts, EBP is saved on the stack, ESP is moved into EBP, and then some space is allocated for variables which are stored on the stack.  Thus, ESP is set to the new value of EBP less some bytes.  The number of bytes depends on how many variables Windows needs to store.  The number is essentially fixed, depending on the version of Windows (different versions of Windows require a different number of variables for process loading), but can be changed at any time by a patch, if ever additional information is needed to be used to start the process.\n",
            "votes": "3",
            "user": "peter ferrie",
            "time": "May 30, 2015 at 1:17",
            "is_accepted": false,
            "comments": [
                {
                    "user": "ST3",
                    "text": "<span class=\"comment-copy\">One more question, image there is A.exe and B.exe, does always ESP of A.exe stays in the same place (ASLR ignored) and ESP of B.exe also fixed, but different from A.exe?</span>",
                    "time": null
                },
                {
                    "user": "peter ferrie",
                    "text": "<span class=\"comment-copy\">Yes, the location of the stack doesn't change once it is set.</span>",
                    "time": null
                }
            ]
        }
    ]
}