{
    "title": "What are the risks of running a decompiler? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/9071/what-are-the-risks-of-running-a-decompiler",
    "content": "Closed. This question needs to be more focused. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it focuses on one problem only by editing this post.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI have a binary file which is potentially a virus and I wish to look into its internals. I need to be cautious as I don't want it to run on my system. That's why I ruled out gdb.\nI've searched and skimmed various sites on decompilers but, I haven't been able to figure out the internals. Does the decompiler actually execute the code in someway? (again, I don't want the file to run on my system in any way).\nUsing a VM is not an option as I have a low-RAM system. What are the risks of running a decompiler to analyze a potentially malicious executable.\n",
    "votes": "-3",
    "answers": 1,
    "views": "673",
    "tags": [
        "decompilation",
        "decompile",
        "decompiler",
        "malware"
    ],
    "user": "pash",
    "time": "9 years ago",
    "comments": [
        {
            "user": "rev",
            "text": "No, static analysis (e.g. IDA and other disassemblers) don't execute the code, they just disassemble it. It can still be exploited (by e.g. crafting a file that exploits a vulnerability in the disassembler), but I think that hasn't even happened yet, so... it's worth the try\n",
            "time": null
        },
        {
            "user": "Dominik Antal",
            "text": "It did happen.\n",
            "time": null
        },
        {
            "user": "Dmitry Grigoryev",
            "text": "There is already a nice answer to this question: reverseengineering.stackexchange.com/questions/23/…\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "Static analysis doesn't execute the code.\nYou can safely run a decompiler or dissembler against the binary and it will analyze without executing the code. Static analysis by itself can be difficult if the binary is obfuscated and packed. There is a risk where the file could exploit a vulnerability in the program doing the analysis, but this is fairly uncommon, though you should still keep you systems up to date and run as an unprivileged user.\nSome disassemblers you could try:\n\n<pre><code>objdump</code></pre>. You can use the <pre><code>objdump</code></pre> disassembler to dump the disassembly of the binary. The command <pre><code>objdump -D yourbin</code></pre> will disassemble all sections.\n<pre><code>IDA Pro</code></pre>. You can grab a free trial of IDA Pro from their website. \n<pre><code>Hopper</code></pre>. Hopper also has a free trial you can use. Its cost is much cheaper than IDA Pro if you do decide to purchase.\n\nThis page lists some decompilers you could try. I haven't tried any of them (except for IDA Decompiler, which is expensive), so I can't vouche for how well they work.\n",
            "votes": "2",
            "user": "amccormack",
            "time": "Jun 6, 2015 at 0:32",
            "is_accepted": true,
            "comments": []
        }
    ]
}