{
    "title": "How to find a verification routine that enables a button and a textbox [duplicate]",
    "link": "https://reverseengineering.stackexchange.com/questions/9142/how-to-find-a-verification-routine-that-enables-a-button-and-a-textbox",
    "content": "This question already has answers here:\n                                \n                            \n\n\n\n\nUse OllyDbg to identify what happens when a button is pressed\n\n                                (4 answers)\n                            \n\n\nFind a string that I entered in ollydbg\n\n                                (3 answers)\n                            \n\nClosed 9 years ago.\n\n\n\nI have an app (reverseme) that looks like calc.exe.\nIt has 9 number btns, clear and enter buttons.\nThe enter is disabled.\nThere is another input textbox without any enter or submit button. It takes inlut from the keyboard but when i press enter it doesnt throw any badboy or goodboy messages just a sound of a bad press.\nI need to enable the enter button and find the serial.\nThe app compiled with borland and writteb in c++.\nIt uses kernel32, user32, comctc32.\nI have disabled the entered button by enabling it in reseditor and noping the disabling routine in the code but im shure there is another way.\n",
    "votes": "0",
    "answers": 0,
    "views": "567",
    "tags": [
        "crackme"
    ],
    "user": "Igal name",
    "time": "9 years ago",
    "comments": [
        {
            "user": "Jason Geffner",
            "text": "Set the breakpoints described in Find a string that I entered in ollydbg to find the verification routine.\n",
            "time": null
        },
        {
            "user": "Igal name",
            "text": "The input is not submited because the enter and the textbox are disabled\n",
            "time": null
        },
        {
            "user": "Jason Geffner",
            "text": "So you set breakpoints on <pre><code>GetWindowText()</code></pre>, <pre><code>GetDlgItemText()</code></pre>, <pre><code>SendMessage()</code></pre>, etc. and saw none of the breakpoints hit while entering content into the textbox?\n",
            "time": null
        },
        {
            "user": "0xec",
            "text": "A small screenshot might help. Additionally, the app may handle the <pre><code>WM_KEYDOWN</code></pre> within the message loop. You need to check that too.\n",
            "time": null
        },
        {
            "user": "Dominik Antal",
            "text": "Also related question.\n",
            "time": null
        }
    ],
    "answers_data": []
}