{
    "title": "Setting Breakpoints at functions decoded by Hopper/IDA Pro in an iOS app",
    "link": "https://reverseengineering.stackexchange.com/questions/9281/setting-breakpoints-at-functions-decoded-by-hopper-ida-pro-in-an-ios-app",
    "content": "So, its been very interesting to reverse engineer an iOS application and I have made significant improvement into learning how to read disassembly and understand them. Now I was trying to debug the iOS app using lldb debugserver.\nI was able to attach my system to my jailbroken ipad running the gdb server and hooked it to one of the running process. Now the problem is, that the executable has no symbols (or at least lldb is telling me that). But when I tried to disassemble it in IDA Pro and Hopper, I was able to get all the objective-c classes and functions names. \nFor example, one of the function that is being used is HMACWithSecret which has the signature -[NSString(HMAC) HMACWithSecret:]\nIf I try to set a break point from lldb using the command\n<pre><code>b -[NSString(HMAC) HMACWithString:]\n</code></pre>\nOr any other variant\n<pre><code>b HMACWithSecret:\nb HMACWithSecret\n</code></pre>\nIt fails to find a location for the same. I know that in objective-c every call is made via objc_msgSend with arguments about which function to call. But if i want to set a breakpoint in the above function (or any other I reveal via Hopper/IDA Pro) what should I do?\n",
    "votes": "2",
    "answers": 1,
    "views": "1k",
    "tags": [
        "ida",
        "ios",
        "hopper",
        "lldb"
    ],
    "user": "Satinder Rana",
    "time": "Jul 3, 2015 at 12:30",
    "comments": [
        {
            "user": "Guntram Blohm",
            "text": "I'm not sure if i understand you correctly, especially the <pre><code>gdb server</code></pre> and <pre><code>lldb</code></pre> part, when you've disassembled the app in IDA Pro. Your problem might come from the fact that <pre><code>gdbserver</code></pre>, when it attaches to a running process, doesn't know about the executable file and can't load symbols from it. But if you have IDA anyway, you can just use it to attach to the running <pre><code>gdbserver</code></pre>, and the IDA debugger will know all symbols that were defined during the disassembly phase.\n",
            "time": null
        },
        {
            "user": "KHacker",
            "text": "I have the same problem . I attached IDA to a jailbroke ios deviece. But if I set breakpoint at main , it works . Otherwise if I set breakpoint at a fuction from thirdparty lib (.a file) , it doesn't work . Can anyone have the same problem? If yes , please give some clue .\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I was able to achieve this by installing gdbserver on my ipad. Then i ssh into the ipad and attach a remote lldb debugger (xcode tools) to attack breakpoints. A long method but works. There are now tools to debug in same way on android and ios.\n",
            "votes": "2",
            "user": "Satinder Rana",
            "time": "Mar 21, 2016 at 12:08",
            "is_accepted": true,
            "comments": []
        }
    ]
}