{
    "title": "What certifications do I need to become a Malware Analyst? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/9323/what-certifications-do-i-need-to-become-a-malware-analyst",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI've previously posted here on how to get started as a malware analyst, and wanted to say thanks on getting me started. How much do certifications help me in for my resume and which one(s) should I get? Will experience ultimately be better than a cert? And finally, when should I get certified? I'm currently a sophomore studying information assurance, should I wait until I graduate to get certified?\nSorry for the abundance of questions, and thanks for helping.\n",
    "votes": "-1",
    "answers": 1,
    "views": "157",
    "tags": [
        "malware"
    ],
    "user": "user12983",
    "time": "9 years ago",
    "comments": [
        {
            "user": "Vitaly Osipov",
            "text": "It's not certs you need but constant study and a lot of knowledge. Hiring-wise you just need to get past the HR.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "I do not recommend you to waste your money in certifications, honestly. Get malware, reverse engineer it yourself and publish your results in your blog. This is, certainly, going to help more than any certification on earth. Indeed, some people may take a bad impression of your resume if it makes emphasis in certifications and I know tech-people, not recruiters, that will not even bother to read your resume if you put certifications on it.\n",
            "votes": "4",
            "user": "joxeankoret",
            "time": "Jul 10, 2015 at 21:36",
            "is_accepted": false,
            "comments": []
        }
    ]
}