{
    "title": "How does storing values in registers result in a functioning program? [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/9525/how-does-storing-values-in-registers-result-in-a-functioning-program",
    "content": "Closed. This question is off-topic. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\n Questions on software development are off-topic here, but can be asked on Stack Overflow.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm currently learning assembly, but I cannot seem to understand how storing values into registers and manipulating them results in a working program. \nI was wondering if you guys could provide a very easy to understand explanation on why certain things are being done within the assembly code.\nTake for example the Hello World program in assembly code:\n<pre><code>section     .text\nglobal      _start                              ;must be declared for linker (ld)\n\n_start:                                         ;tell linker entry point\n</code></pre>\n\nWhy does the message length need to be put into the EDX register? And why is the EDX register chosen rather than a DX register or EAX register?\n<pre><code>mov     edx,len                             ;message length\nmov     ecx,msg                             ;message to write\n</code></pre>\nI also do not understand why we are moving 1 into the EBX register? And for that matter moving 4 into the EAX register?\n<pre><code>mov     ebx,1                               ;file descriptor (stdout)\nmov     eax,4                               ;system call number (sys_write)\nint     0x80                                ;call kernel\n</code></pre>\nWhy are we moving 1 into EAX? What is so significant about EAX compared to the other registers? And what happened to the 4 stored in EAX previously?\n<pre><code>mov     eax,1                               ;system call number (sys_exit)\nint     0x80                                ;call kernel\n\nsection     .data\nmsg     db  'Hello, world!',0xa                 ;string\nlen     equ $ - msg                             ;length of string\n</code></pre>\nHow does data in the individual register interact with each other? How do they know that data is stored within them? \n\nTL DR: How is it all merged to present Helloworld onto the screen?\n",
    "votes": "1",
    "answers": 3,
    "views": "4k",
    "tags": [
        "assembly",
        "x86",
        "linux"
    ],
    "user": "user36278",
    "time": "9 years ago",
    "comments": [
        {
            "user": "Jongware",
            "text": "You may want to study a bit more before asking on Reverse Engineering. \"How do [registers] know that data is stored within them?\", for example, is an extremely naïve question. It's not as if a register must look somewhere to see if it has some value stored in it. The same goes, actually, for your other questions as well.\n",
            "time": null
        }
    ],
    "answers_data": [
        {
            "content": "It would be more helpful to give a full sample program instead of bits and pieces. You could inline your questions using <pre><code>;</code></pre>-preprended lines.\n\n1) Why does the message length need to be put into the EDX register?\n  And why is the EDX register chosen rather than a DX register or EAX\n  register?\n<pre><code>    mov     edx,len                             ;message length\n    mov     ecx,msg                             ;message to write\n</code></pre>\n\nWhere (in which register) each parameter lands really is a matter of the architecture (seemingly here x86_64): ABI. The order usually is the same as for the C runtime functions which are the frontend to the syscalls, here <pre><code>write</code></pre>. It's a convention between the kernel and user mode.\n\n2) I also do not understand why we are moving 1 into the EBX register?\n  And for that matter moving 4 into the EAX register?\n<pre><code>    mov     ebx,1                               ;file descriptor (stdout)\n    mov     eax,4                               ;system call number (sys_write)\n    int     0x80                                ;call kernel\n</code></pre>\n\nOne is literally the file number of the standard stream named <pre><code>stdout</code></pre>.\nFour is the system call number (essentially an index into a table) and <pre><code>int 0x80</code></pre> is a call gate into the kernel. I.e. execution transitions into the kernel and the respective system call (here <pre><code>sys_write</code></pre>) knows where to take the parameters from.\n\nWhy are we moving 1 into EAX? What is so significant about EAX\n  compared to the other registers? And what happened to the 4 stored in\n  EAX previously?\n\nUsually the return value also ends up in EAX or EDX:EAX or similar. So the 4 would have been overwritten. It depends on the return type.\nOne in this case is the system call number of <pre><code>sys_exit</code></pre>, the kernel-side function for the libc <pre><code>exit</code></pre> function.\n\n<pre><code>    mov     eax,1                               ;system call number (sys_exit)\n    int     0x80                                ;call kernel\n\nsection     .data\n\nmsg     db  'Hello, world!',0xa                 ;string\nlen     equ $ - msg                             ;length of string\n</code></pre>\n3) How does data in the individual register interact with each other?\n  How do they know that data is stored within them?\n\nThey don't. The kernel picks them from these registers and the (user mode) developer simply has to know where to put these pieces of data.\nIn the normal case the user mode developer will, however, make use of a C runtime, like glibc.\n",
            "votes": "3",
            "user": "0xC0000022L",
            "time": "Aug 1, 2015 at 12:44",
            "is_accepted": true,
            "comments": []
        },
        {
            "content": "<pre><code>int 80</code></pre> is used to perform system calls\nEach  system call has an index  \nThe index is always passed in eax register \nThe function calls may need arguments \nThe first five arguments are passed via ebx,ecx,edx,esi,edi registers\nIf there are more than five arguments a special method is employed using an array pointer \nprototype of sys_write is as follows\nssize_t sys_write(unsigned int fd, const char * buf, size_t count) \nindex of sys_write  = 4   \nso    \n<pre><code>eax = index == 4,    \nebx = fd    == 1,stdout    \necx = char* == msg   \nedx = count == len   \n</code></pre>\nsame goes to sys_exit\ntake a look at the links below for a concise syscall index ,arguments ,prototypes , and source details\nhttp://docs.cs.up.ac.za/programming/asm/derick_tut/syscalls.html#note117\nhttp://asm.sourceforge.net/syscall.html#4\n",
            "votes": "1",
            "user": "blabb",
            "time": "Aug 1, 2015 at 15:46",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Int 80 is a method of performing a syscall to the Linux kernel. This method is specific to Linux. \nTake a look at arch/x86/include/asm/unistd_32.h\nIt has documentation for this \"function\". \nTypically in assembly you push your inputs to any function you call in reverse order to the stack. However this is a special command where the functional inputs are stored in the registers.\nTake a look also at https://en.m.wikibooks.org/wiki/X86_Assembly/Interfacing_with_Linux\n",
            "votes": "0",
            "user": "Viktor",
            "time": "Aug 1, 2015 at 13:01",
            "is_accepted": false,
            "comments": []
        }
    ]
}