{
    "title": "VirtualKD + VBox > 4.3",
    "link": "https://reverseengineering.stackexchange.com/questions/9533/virtualkd-vbox-4-3",
    "content": "Is it any way to connect VirtualKD 2.8 to VBox > 4.3.\nI googled it but the nearest result was VBOX_WITH_VIRTUALKD config flag and some change logs about stub/loader.\n\nOK, because of lack of information in my question, I try to explain my problem...\nI start installing the VirtualKD from Ref I using VKD 2.8. exactly in step 2 it said\n\nUnable to cast COM object of type 'VirtualBox.VirtualBoxClass' ...\n\nSo I start googleing and i found a great article Ref II. I compiled the C# code and ran it in the VirtualKD-2.8 directory. the first problem is gone but the virtual box said:\n\nUnable to load R3 \"C:\\VirtualKD-2.8\\VBoxKD64.dll\": Not signed ... (VERR_LDRVI_NOT_SIGNED)\n\nAgain I start googleing... the problem is for <pre><code>VBox > 3.1</code></pre>, it force signed dll loading in windows. so I signed the DLL by a self generated sign ( and of curse I added it to my trust list ). now the virtualbox braks with\n\nUnable to load R3 module \"C:\\VirtualKD-2.8\\VBoxKD64.dll\" None of 1 path(s) hav a trust anchor.: ... (VERR_CR_X509_CPV_NO_TRUSTED_PATHS).\n\nso I used a globally trusted sign to do the job but I got a FATAL error from vbox...\n",
    "votes": "3",
    "answers": 1,
    "views": "792",
    "tags": [
        "debugging",
        "kernel-mode"
    ],
    "user": "diener_k",
    "time": "Aug 4, 2015 at 7:45",
    "comments": [],
    "answers_data": [
        {
            "content": "As I think, someone else might have this problem, I have to answer my own question...\nFirst. please read the question carefully ( it is long but worst it ).\nThen...\nAs Virtual Box only accepts signed DLLs so you have to sign the \nVBoxKD64.dll and/or VBoxKD.dll. it is not easy to find a trust sign so avast guys make a pre-signed virtual-kd available for download here\nNow we have another problem. Virtual Box will not load DLLs that are not owned by NT SERVICE\\TrustedInstaller so we have to add Virtual-KD directory to it's kingdom. ( read this if you have no ida about what I say )\nAlso it is a good description in the avast package named Install.txt.\n",
            "votes": "3",
            "user": "diener_k",
            "time": "Aug 25, 2015 at 8:23",
            "is_accepted": true,
            "comments": [
                {
                    "user": "Peanut",
                    "text": "<span class=\"comment-copy\">The Avast link you provided doesn't have a signed copy of the driver in the .zip ?</span>",
                    "time": null
                },
                {
                    "user": "diener_k",
                    "text": "<span class=\"comment-copy\">You are right. my problem was installing Virtual-KD on Virtual Box. It doesn't need Virtual-KD driver to be signed... some useful information about your problem is present at VKD forum.</span>",
                    "time": null
                }
            ]
        }
    ]
}