{
    "title": "Taking up reverse engineering as a research topic, need advice [closed]",
    "link": "https://reverseengineering.stackexchange.com/questions/9542/taking-up-reverse-engineering-as-a-research-topic-need-advice",
    "content": "Closed. This question is opinion-based. It is not currently accepting answers.\n                                \n                            \n\n\n\n\n\n\n\n\n\n\n\nWant to improve this question? Update the question so it can be answered with facts and citations by editing this post.\n\n\nClosed 9 years ago.\n\n\n\n\n\n\n\n                        Improve this question\n                    \n\n\n\nI'm currently a computer sciences undergrad who'd like to do some basic research work in reverse engineering as my premier project (for completion of my bachelor's degree). So far, I've studied operating systems, computer networks, computer architecture, cryptography (basic and advanced), systems security & network security. My mathematical/theoretical background consists of theory of computation, complexity theory, abstract algebra, graph theory, number theory and basic algorithm and data structure design/implementation. I'm also currently doing a course on compilers (design/implementation). \nI find reverse engineering quite intriguing; although since I don't have any first hand experience of the area itself, I cannot say much. Bachelor's project is supposed to be a showcase of a person's strengths in computer science at my institute, and being primarily interested in systems security, I'd like to do my main project in some specific sub-area in the aforementioned area only. I'd preferably like to explore more theoretical parts than applied ones, although I'm okay with a fine balance between both.\nI need help in actually knowing if I should go for it or not. I know this is a very vague question (and it'd probably get flagged), but I don't really know any other avenue where I should be asking this. Is there scope for research in this field at an undergrad level? If yes, what more background do I need to acquire before getting into it? I feel taking this up as a research project might be a bit too ambitious since I don't know anything about the field, but in case I do take it up, where shall I start? I need to have a proper problem definition in mind, which I sadly do not have, so I'd appreciate some help/advice on the same.\nThanks (if you've read this far and aren't annoyed).\n",
    "votes": "1",
    "answers": 3,
    "views": "173",
    "tags": [
        "operating-systems",
        "security",
        "career-advice"
    ],
    "user": "user2841250",
    "time": "9 years ago",
    "comments": [],
    "answers_data": [
        {
            "content": "Bachelor's project is supposed to be a showcase of a person's\n  strengths in computer science\n...\nI don't have any first hand experience of [reverse engineering]\n\nGiven your two statements above, I would posit that you should not do your bachelor's project on reverse engineering :(\n",
            "votes": "3",
            "user": "Jason Geffner",
            "time": "Aug 3, 2015 at 19:00",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "I would also not recommend it. Reverse Engineering is a topic that's too advanced for many/most senior IT professionals in the industry. It would be a very risky experiment on your behalf!\n",
            "votes": "1",
            "user": "Swiss Dev",
            "time": "Aug 4, 2015 at 18:45",
            "is_accepted": false,
            "comments": []
        },
        {
            "content": "Visit a site with legal reverse engineering challenges like e.g. crackmes.de, solve at least five challenges up to a level of three (level one being the easiest, 5 and up are difficult even for the experienced), and then start with your thesis. Your background in cryptology will help you on the higher levels.\nBe warned - you will need patience and must not expect very quick results, but successful solutions will be a big reward. And be warned again, the virus of reversing might infect you...\n",
            "votes": "1",
            "user": "josh",
            "time": "Aug 4, 2015 at 21:38",
            "is_accepted": false,
            "comments": []
        }
    ]
}